{
    "rating": 7.7,
    "release_date": "1983-08-25",
    "num_reviews": 236,
    "genres": [
        "Comedy"
    ],
    "summary": "\"Documentary\" about a man who can look and act like whoever he's around, and meets various famous people.",
    "reviews": [
        {
            "review_title": "Zelig is a masterpiece",
            "content": "Yes, a masterpiece.  The entire premise of the movie is wildly original, even coming from WOODY ALLEN who continually cranks out one interesting film after another to this day.  The label of mock-umentary just doesn't do justice to the uniqueness of this film.  ALLEN and his amazingly talented staff created a movie that no other director could have made nor even thought of doing.  Some of the humor is rather modern like the forward references to self-gratification during the psychiatrist scenes with MIA FARROW.  But mostly, it's filled with humor from another time and place which we'll never return.To me, one of the wonderful aspects of this is the period music dispersed throughout with joyful admiration.  We are lucky that ALLEN has continued to use music from the early part of the 20th century.  I think no other director has so consistently had such a reverence for this wonderful music. Perhaps no other director has such a strong knowledge of it either.That WOODY ALLEN normally portrays himself as a nebbishy character in many of his own movies works so well in this movie.  A more aggressive person who becomes a chameleon would not have worked as well at all.  I am glad that MIA FARROW was still associated with him when he made this film, I think no other modern actress could have pulled this off as well as she did.  She has that timeless look that is appealing but has a far-off feeling.The flavor of the period-looking cinematography and photography is part of the genius of the implementation here.  It is so right on the money.  The flickering of projectors, the out-of-focus look to so man scenes shot today meld amazingly well with the contrived shots.THINK ABOUT THIS - this is years before CGI took over Hollywood...years before FORREST GUMP and countless of other knock-offs have proliferated in movies.  Gee whiz, there is CGI in so many movies these days.  I watched a DVD of a recent movie recently which used special effects in the most unexpected, unlikely and unnecessary parts you'd be surprised.Yes, ZELIG is a masterpiece and I only feel sorry for those who cannot see the astounding piece of cinema this is.",
            "review_date": "2004-07-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody Allen Does the Chameleon",
            "content": "\"Zelig\" is a very clever movie, the kind you just know Woody Allen is capable of.  In this \"mockumentary,\" Woody plays Leonard Zelig, an insecure man who goes to the ultimate length to fit in.  Mia Farrow offers the love interest as Dr. Eudora Fletcher.  In \"Zelig,\" we get to see Woody spliced into old footage, including the Nazi rally.  This came before the effect became used more often, in movies like \"Forrest Gump.\"  I see this as a transition in Woody's movies.  It comes somewhere between his early funnier movies, like \"Bananas\" and \"Take the Money and Run,\" and his later, more introspective ones, like \"Hannah and Her Sisters\" and \"Husbands and Wives.\" It makes a statement about individuality, and produces laughs in the process.",
            "review_date": "2003-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody strikes again!",
            "content": "Woody can be clever.  Woody can be funny.  And when Woody's clever AND funny, you get \"Zelig\".Telling the story of Leonard Zelig (Woody Allen, who else?) who transforms himself chameleon-like into anyone just to get people to like him, he finds himself the object of on-going observation from a kind doctor (Farrow), who eventually falls for him.  But lest you think this is simply a love story, there are also pot-shots at fame, fads, the 1930s (!!), medical conventions, product cash-ins and the joys and pitfalls of celebrity.Then there's the sheer joy of the technical wizardry that allows Woody's Zelig to stand alongside such figures as Josephine Baker, Brickhouse, William Randolph Hearst, Marion Davies, \"Red\" Grange, Al Capone, F. Scott Fitzgerald, Lou Gehrig and Fanny Brice.  This is the same type of FX visible in \"Forrest Gump\", and eleven years before the fact!  Nice going.But you haven't lived till you've seen Woody trying to blend in at an Adolph Hitler speech.There's a lot of slapstick but there's also a lot of great lines (\"I have to council a group of chronic masturbators\", Zelig complains, \"and if I'm late they'll start without me.\")  Classic.But at the center of it all is Woody himself, just like his Zelig character, wanting only to be liked, if not loved.  He succeeds.  Once you see \"Zelig\", you'll love it.Eight stars, plus one star more for watching Woody be serenaded by Fanny Brice.  He's the cat's pajamas!",
            "review_date": "2000-04-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Identity Crisis and Its Relationship to Personality Disorder \"",
            "content": "One of the most sophisticated, cleverest, funniest, exquisitely shot and edited, scored, and acted movies ever made, \"Zelig\" is a masterpiece and astounding work even for Woody Allen whose mediocre movies are way above the regular Hollywood fares. With the modest running time less than 80 minutes, this mockumentary tells the story of a \"human chameleon\", Leonard Zelig, Leonard the Lizard who possessed an extraordinary ability to transform himself in anyone he met (or should I say, an extraordinary ability possessed him?). Leonard is a shy, little, meek Jewish man whose rare personality disorder consists of not having his own personality at all and successfully and effortlessly adapting any personality he came close to and fitting perfectly to any surroundings. His skin turns black when he is with the Black people, with the Native Americans, he became one; attending the dinner with the intellectuals, he speaks brilliantly with F.S. Fitzgerald, when on the baseball field, he is Babe Ruth. The meeting with an intelligent and compassionate psychiatrist, Dr. Eudora Fletcher (Mia Farrow) will begin the slow and long process for Zelig of searching and finding his own personality and possibility for love and happiness. The movie provides laughs and smiles but it also makes the viewer think of more serious subjects. Are we all have a Zelig inside? Don't we all want to be liked and try to adapt to our surroundings to feel comfortable? The movie can also be viewed as the meditation on the nature of the acting ability. While watching \"Zelig\", I kept thinking of a book I read recently. One of the characters was a great actor who had the similar to Zelig's disorder - he had no personality at all until he was given a part to act on stage. That Actor made the best and most convincing and complex Shakespeare's heroes - he was a brilliant reflective Hamlet but his greatest success was tragic Othello. The actor's transformation to Othello was so real that he acted it at home with his wife whom he suspected in cheating - he played his role perfectly with the same as in the play results. He ended up in the asylum where he could not act but he was allowed to read...Dostoevsky's novel \"The Possessed\" from which he chose to adapt the personality of Nikolai Stavrogin with rather unpredictable results. When his doctor finally realized what happened, he took all books with the exception of \"The Idiot\". Finally, the actor became a gentle and kind Prinz Myshkin, and that was the end of book.Both, the book and the movie \"Zelig\" made me think of the price the artists pay to achieve perfection in their art. Are they vampires sucking the life out of their victims only to use them as characters for their acting roles? Is that the ultimate price the artist is paying for being a great artist? Does he need lives and souls of others to be able to create? This is one of many subjects \"Zelig\" makes you think about.Allen seamlessly weds Black and white newsreel footage with his humorous but deep and fascinating tale allowing Zelig to be exactly where and when History was made. Using special lenses to give the movie the old style, mixing his own footage with the real documentaries, including his favorite music, dances, feeling perfectly forever gone era, Woody recreates The Roaring 20Th with breathtaking authenticity. M:IWIHSIIT - according to my new grading system, a Masterpiece, I wish I had seen in the theater",
            "review_date": "2006-05-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The FIRST EVER Mockumentary.",
            "content": "My Rating : 9/10To ME this is the FIRST EVER Mockumentary that I enjoyed and something that absolutely worked with my sensibilities!Woody Allen is such a genius fellow, love his art and movies. 'Zelig' is supremely engaging, funny and has that old-world charm about it that makes it a classic.Loved everything about this and thanks Woody for coming through when I was heavily bored with intellectual mumbo-jumbo movies and just needed the right kick in the teeth!",
            "review_date": "2019-05-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Identity Crisis",
            "content": "Before FORREST GUMP told the story about its eponymous main character managing to find himself at the center of this country's main events we had this oddity of a mockumentary that only the uber-intellectual mind of Woody Allen could come up with. Appropriately narrated in that self-important newsreel voice-over that is the template of most documentaries, we are taken into the life of this 'human chameleon' called Leonard Zelig. Zelig has the ability to show up and blend into whomever he is around with at any given moment and pops up in the most interesting of places.Soon he catches the interest of psychiatrist Dr. Eudora Fletcher who decides to undertake the task of 'curing' Zelig. She subjects him to a series of sessions to find out the meaning of his condition and thus further her own breakthroughs in psychology. At the same time we see comments from real-life celebrities as diverse as the day is long which pretend to explain his effect on events in general, his marriages, the man and the myth. Their presence lends an air of veracity and at times it's hard to believe one is watching an extremely clever mockumentary due to the footage utilized. Allen, in making ZELIG well before CGI, was able to painstakingly age film and process photos as to make it seem that Zelig in effect was \"there\" when things happened. Viewers at the same time will feel tempted to look for the dividing line between montage and real footage; one memorable scene is a rally led by Hitler (an actor playing Hitler, not the real man) which Zelig witnesses as a German Nazi. Dr. Eudora Fletcher follows him there and hilarity ensues as she points him out in the middle of Hitler's rousing dissertation. However, there is a greater irony as this event becomes a grossly fictionalized \"film version\". Allen is clearly toying with the viewer in saying that even when he is presenting \"the facts\" about this personage, events will be glamorized, and the line between fact and fiction will be blurred. Clever, indeed.ZELIG falls short of being one of Woody Allen's great films for the reason it's a mockumentary; it barely has his presence and that of Mia Farrow as familiar faces and is a visual attack of archive footage and old jazz tunes. At the same time, one of his much shorter tales of self-existentialism in the threat of blending in, it does serve as something of an allegory that bears his indelible mark.",
            "review_date": "2005-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You Wanted More When It was all over!",
            "content": "I have to say that even though Zelig is less than 80 minutes, I was deeply saddened by it being over. I actually wanted more of it. Woody Allen is brilliant as Leonard Zelig, a human chameleon, who can transform to other races, religions, and ethnicities. Anyway, Woody Allen does it subtly and brilliantly without going over the top. Woody Allen is a genius with his neurosis. In this film, it's a love story before doctors getting intimate with patients had become a frowned upon today. Zelig came alive in the 1920s and 1930s. His character always seems to be looking for a place to fit in society. Woody Allen's brilliance is really about examining his life in film especially his relationships. The psychiatrist is played by Mia Farrow who was involved with Woody Allen at the time. The cast is usually New York actors like Deborah Rush. But I enjoyed seeing Susan Sontag in this documentary spoof. Zelig is perhaps one of the best spoof documentaries of all time. When it's over, you just want more.",
            "review_date": "2010-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zenith Zelig.",
            "content": "ZELIG is simply a jaw-dropping sight and sound as a film; hilarious.... out loud. The funny premise is polished to some astonishing level of trickery with editing and matte effects seamlessly blending real 20s with recreated 20s adding Allen and Farrow and dialog and interviews that will have you recalling and roaring with laughter for days. I had not seen it since 1983 and now in 2008 to be reminded how stunning and hilarious this creation is, well, I am just delighted to be back on the wavelength of this genuinely brilliant hoax documentary. Now I can see how FORREST GUMP came about, given that it is a similar 'historic' premise using real footage of events and eras mixed with the lead character. But ZELIG is another perfection altogether; if you know your 20s, silent films, the imagery, the early sound newsreels and all those silly songs, then ZELIG is a superlative treat. It even features Mae Questrel singing a new Betty Boop song and for that alone I cheer this almost perfect film. What a delight. If you also get to see the early Peter Jackson hoax documentary FORGOTTEN SILVER or Stanley Donen's MOVIE MOVIE you will be equally rewarded.",
            "review_date": "2008-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My brief review of the film",
            "content": "A fascinating pseudo-documentary with an intriguing premise, the footage shown looks very authentic, edited well together, with apt sets and costumes. A number of original songs written especially for the film are included, and they sound exactly like the type of tunes expected in a 1930s musical. The non-original music choices also suit the project. Woody Allen superbly acts out the interesting character that he has written for himself: a very different type of insecure, neurotic person to what he usually plays. Even at less than eighty minutes, the material nevertheless wears thin by the end, but some great ideas are developed along the way. It also feels a bit odd to watch, as the film is not really a comedy, nor a drama - not fitting into any genre - then again, in general real life are not meant to be straight comedies or dramas, are they? With the limitations of the style that Allen has chosen for the film taken into account, he does a pretty good job.",
            "review_date": "2005-07-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zealous about \"Zelig\"",
            "content": "Leapin' lizards! This film is brilliant, brilliant, brilliant.\"Zelig\" was a revelation in 1983, an utterly ingenious faux-documentary, without any precedent, at least not on this scale. Hilarious then, it still is today. That quick glimpse you get of the all-Hasidic production of \"A Midsummer Night's Dream\" is priceless. It gives renewed meaning to \"Lord, what fools these mortals be!\"Allen's technique is extraordinary. \"Zelig\" has the best bogus documentary footage quite probably since \"Citizen Kane\".As the film urges, everyone should \"Do the Chameleon\", by seeing \"Zelig\". Woody Allen creates a trenchant comment on people's desire for conformity: \"Everybody, go chameleon.\" We all tend to do that to some degree, but it's not usually so amusing. Try to blend in with the crowd rushing out to find \"Zelig\" on video.It is probably worth noting that a Jewish Nazi is not as ridiculous a stretch as Woody makes it seem. Reinhard Heydrich, the vicious organizer of the Final Solution, fell into that category. The top Nazis were all misfits in one way or another.",
            "review_date": "1999-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My favourite Woody Allen film",
            "content": "Out of all Woody's movies, this is my all-time favourite. Deep and meaningful, a perfect blend of drama and comedy. It was filmed in black-and-white, like Manhattan, but this time in the mockumentary style of Take the Money and Run. Less comedic than that film, though, but just as entertaining. The special effects (blending the actors with documentary stock footage) are simply astounding for their time. It was only 10+ years later that another film (Forrest Gump) managed to pull this thing off with the same success. (Now that I mentioned it, Forrest Gump may have a lot more in common with Zelig... There are clearly parallels not only visually, but thematically, as well.) It is also very concise. Lasting only 70 minutes, there is no unnecessary fat at all. A time very well spent for anyone who loves bittersweet, heart-warming movies.",
            "review_date": "2016-02-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Delightful Story In An Engaging Format",
            "content": "Was this the first \"mockumentary\"? I checked out IMDb and it predates Guest, Reiner and co.'s This Is Spinal Tap by a year. Not only was it a fake documentary, it sustained the format throughout, never once breaking into an enacted scene. Allen told his story, set in his favorite time period, The Roaring 20's, using special lenses to create the old style newsreels. Using photo stills, mixing real footage with his, and providing exposition via modern-day \"historians\" and aged characters, he gave this innovative film such an authenticity that if one didn't know any better, you would swear there had been an actual Leonard Zelig.Allen plays Leonard, a man so devoid of identity, so eager to assimilate, that he literally takes on the appearance or, at least, the attributes of anyone he comes in contact with. Mia Farrow plays his psychiatrist, Dr. Eudora Fletcher, and taken in smaller doses, she actually is perfect in this role. There are a few moments when you get to see an extended dialogue between the two, most notably when her brother is filming \"The White Room\" sessions at her country estate. This is the only time that Allen's shtick gets to flex, as he cracks jokes about teaching a Masturbation class. Advanced. I also loved Zelig groaning about Eudora's terrible cooking under hypnosis. Eventually, Dr. Fletcher is able to cure him, and with his newfound personality, he and Eudora fall in love.Allen also introduces the idea of Zelig's story being filmed as a movie, so he inter cuts some of the news sources with scenes from the film (very funny). The one thing that really stood out for me, though, was this revelation towards the end of the film. Woody as Leonard Zelig was smiling. A lot. It was kind of weird to see, but his happiness actually imbued the film with positive emotion and charmed the pants off me (not literally, of course) to such a degree that I will undoubtedly be repeating my viewing pleasure many more times.I'll be honest. There were moments early on that I perhaps wondered if he was going to be able to sustain my interest. I thought he might be playing this conceit a little too long. What had, in the first 20 minutes, been enchanting and amusing seemed to dwindle in the middle of the film. Would he really succeed at telling an engaging story in this method? Well, I stuck with it and I'm glad I did. He layers so many meanings into his character's transformations, and all of his historians offer different interpretations. The importance of being yourself. How Zelig's journey was America's journey during the tumultuous and wild 20's. He also has a great running gag about Moby Dick that lampoons the Great American Novel.Will Allen ever be this innovative and original again? Well, it appears he's making an attempt with his newest film, Melinda and Melinda, in which he tells the same story twice, with one tone being humorous, while the other is tragic. If nothing else, he at least continues to strive for an authentic voice in this littered landscape of movie franchises and ridiculously insulting comedies. Go Woody.",
            "review_date": "2005-03-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Layered into Reality",
            "content": "Spoilers herein.Woody's films, enjoyable or not, represent a walk though all the larger philosophical observations and experiments in film. Most of those - at least in this period - have to do with how the camera distorts reality.We get this in the reinvention of history overlain on the very nature of a fake documentary. It is echoed in the story, of course, which gives Woody a chance to mug and romance his new girl. (She `saves' him.)Anyone who thinks this is about a man needs to have his license to watch Woody revoked.I consider this a practice session for his best film: `Sweet and Lowdown,' which deals with these same issues, in the same way but so much more subtly and powerfully. That's in part because Woody's biggest liability as a director is Woody the actor, and he substituted the best folded actor in the world. But it is also because `Sweet' didn't have the distraction of manipulating old film.Still, this is a pretty sweet idea, the idea of having a character be sufficiently powerful that he is able to actually modify existing filmed history.Ted's Evaluation -- 2 of 3: Has some interesting elements.",
            "review_date": "2003-10-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody Allen's \"Epic\" film of a man finding his place in society",
            "content": "Woody Allen's Zelig is a funny, but that's to be expected. Right from the start one gets that this is a \"mockumentary\" done mostly with archival footage and interviews, so it would be hard for Allen (working in this form the first time) to keep a straight face as a filmmaker. He has to make jokes, as a character and as a writer, and it would be hard not to when having a 'chameleon' like the one Leonard Zelig is in the film, going from scene to scene, place to place, historical event to celebrity to circus act to scandal-celeb and, finally, anti-Nazi hero.But there's more to the piece than I remembered first seeing the film when I was younger. It's a very smart and precise account of what a person in society becomes when he tries, and succeeds, to become like those around him. What happens when conforming- or just getting people to 'like' you or respond well to you- goes too far in a direction? We see how Zelig, who first got this gift/curse to be a human chameleon after being beat up as a child (there's a funny story to that, by the way, if you can believe it), does this trick with some people not quite noticing at first, then it spreads like wildfire that this guy can go along with any group he's in. He can be a fat guy, a black musician, a politician, a man with a mustache, anything. We're not shown him being a woman at any point, but that option could be open as well.Zelig is also an epic, in a sense, and as perceptive- maybe a lot more focused in its approach- as Forrest Gump. Where that posited a man drifted through the highs and lows of the 50's through the 60's, with Zelig we're treated to what a man goes through in the world of the press and high fashion and glitz and glamour and living high in the 1920's and 1930's. Allen loves this time period, and the footage he puts together (what he filmed exactly and what wasn't is hard to spot, making it all the more masterful and exquisite, aside from the laugh factor) is infectious in its spirit. And it looks and feels so much like a documentary that it immerses the viewer into its subject matter without a moment's thought of thinking \"oh, that looks fake\". Often, I was laughing at the specific photos, the way people are put together, and Allen's wit as Zelig that I wouldn't bother to notice its \"fake\" elements.But beneath its satire on society and what it means to fit in, or not, and the trappings of fame and the fun with psychology (\"Freud and I disagreed on Penis Envy,\" says Zelig as a \"Psychologist\", \"he said it only worked for women\"), is a heart. We do feel for Zelig, as well as his state of being and finding of himself with the doctor played by Mia Farrow. So, when these crazy things do happen to him, or around him, or little visual puns are made (San Simeon clips are some of the best), he isn't just some running one-note gag. Allen makes him a character, and even delivers one of his finest performances. He'd have to - he's everyone and no one at once. A+",
            "review_date": "2010-03-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Minor Masterpiece",
            "content": "Zelig is, I think, my favorite Woody Allen movie. It's strange to prefer it over Annie Hall or Manhattan or Hannah and Her Sisters, and perhaps it's just my trivia loving personality that points me toward Zelig rather than one of Allen's more traditional movies.Regardless, it is an incredible film. Years before computer animation, Allen was able to insert himself convincingly into old movies. His ability to replicate both the look and sound of old newsreels, in addition to the scratches and discolorations, is remarkable, but this is just window dressing for something that exists on several different levels.At one level, Zelig is a simple satire, a fake documentary about a made-up \"human chameleon\" celebrity of the 1920's. It's rich with typical Allen touches and lines. But at another, it is a serious examination of how we adulate then try to destroy celebrities in America. At yet another, it is an examination of the Jewish compulsion to assimilate into whatever society we happen to be in.But there are even more layers to this film. Allen manages to be laugh out loud farcical through most of this movie, but in the way of all great screen comedians, injects pathos into the film when Zelig, about to be sentenced for multiple crimes committed when he was in his \"chameleon states\" disappears leaving his heartbroken fiancée/psychiatrist behind.And at an even deeper level, it's a rejection of the modern tendency to have to understand what things mean, rather than just appreciating them. This latter bit is shown by an actor discussing his book, \"Interpreting Zelig,\" immediately followed by the late Susan Sonntag, playing herself, disputing this while the subtitle identifying her shows her as the author of \"Against Interpretation.\" Indeed any film that manages to have Dr. Bruno Bettleheim, Irving Howe, Saul Bellow and Sonntag playing in it, commenting on the fictional Zelig, is something that can appeal to many people in many ways.Undoubtedly, this reflects the complex character of Zelig himself, who could be so many different things to so many different people. This complexity is, like it is for Zelig, both a curse and its redemption. Rather than just a silly little fake documentary or a complex dissertation on art and philosophy, it's both and neither.All this creates a remarkably rich cinematic experience which is genuinely unique, even among Allen's several \"mockumentaries\" like \"The Harvey Wallanger Story,\" \"Take the Money and Run\" and \"Sweet and Lowdown.\" See it once, or a hundred times, there are always details, either on the screen or in the ideas presented, that seem new and wonderful.If it isn't Allen's great masterpiece (which in my mind, it could be), it's a minor masterpiece worth seeing.",
            "review_date": "2005-04-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "More Relentless Self-Deprecation From The King",
            "content": "This could well be a review of 90% of Woody Allen's oeuvre. The film is a smorgasbord of fabulousness - exquisite concepts, very clever lines and very funny ones. No film maker has ever had such a grasp of irony, sarcasm and the ridiculous, and still imbue it with wit and (occasionally) subtlety. But it is the relentless self-deprecation and extant feelings of worthlessness that eventually become wearing after you have watched as many Allen films as I have. This is the film that most impresses you with his confusion over identity however. I could go on about self-analysis for pages but it's unnecessary...just watch any given Woody Allen film. He mellows it out with a rather forlorn sense of romance that becomes endearing rather than pathetic...a skill that is essential to engage with his films. This is a fine film. Oh yeah...and very funny...if you get the references.",
            "review_date": "2015-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic",
            "content": "First, I need to point out that I generally don't like Woody Allen movies. This is not just due to his weird off-screen antics but the fact that over the years his movies just stopped being funny. Instead, introspection and artsy-fartsiness have replaced genuine humor. Take the Money and Run, Bananas, Sleeper and Play It Again Sam were good (though not great) films. However, starting in the late 1970s, he tried too hard to \"say something\" and forgot humor. Despite this, in the midst of his unfunny phase, he created a gem. In my opinion this is his best film and no others come even close. However, I will freely admit that this movie is not for everyone. To understand and appreciate Zelig, you really need to understand and care about our history. Since I am a history teacher and LOVE history, it was not hard to follow the historical references. I knew who nearly all the people were who were shown in the documentary films that were spliced into the film. But, for the average viewer, this could be a real sticking point. They may know who Hitler was, but haven't the foggiest notion who William Randolph Hearst, Marion Davies, Charlie Chaplin, Al Smith or any of the other people were who show up in the movie. To make matters even worse, the first time I saw this movie, someone I know said \"gee--I never even knew this Leonard Zelig guy existed\". In other words, despite the movie's preposterous elements, this dunderhead believed it was ALL true! This is an extreme case, but feel that in general this movie is \"too smart\" for the average viewer and as the years pass, this problem will become greater. This is a real shame because they also will not, in many cases, understand the context in which this movie was made. The amazing computer enhancements we come to expect today were not available in the early 80s when this film was made. Instead, painstaking blue screen shots were made and superimposed flawlessly into archival film and some scenes had to be created using modern actors who doubled for the real historical figures. The amazing detail and time needed make this a great film and an important one as well.",
            "review_date": "2005-06-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody Allen's most underrated film? Most likely",
            "content": "...as well as among the better half of his filmography. It does drag a bit and the earlier parts occasionally ramble too much, but Zelig is still a truly great film. Technically Zelig looks fabulous, one of his better-looking and most interesting early films along with Manhattan and The Purple Rose of Cairo. And it's actually more interesting in this regard than either of those films, because among Allen's films it's his most unique and ground-breaking. As far as I can recall, none of Allen's other films use the technique of inserting a character(in this case Leonard Zelig) into existing footage like newsreels and archive photos, and so cleverly. Well, What's Up Tiger Lily? had a dubbed over commentary over an existing mystery film but with mixed results and that's not really the same thing. The music suits the period brilliantly and gives the sense that you are there, it's great-sounding and memorable too. The screenplay is among Allen's cleverest, it's laugh-out-loud funny but also very poignant with the romantic parts really sweetly done. It's also very intelligent and has a lot to say on the issues that it deals with. The characters are not as neurotic as in some of Allen's other films, though they are unmistakably Woody Allen. They feel real, and I did find myself relating to Zelig in his struggles and desire to fit in(that was exactly the case with me in school), the characters' relationships and chemistry were more than believable. The story is heartfelt, funny and makes great use of his mockumentary style, there are some rambling moments but not to an interminable degree. Allen directs thoughtfully as ever, and he gives a great performance that is among his most physical, energetic and relatable. Mia Farrow also gives one of her most sympathetic performances, and is touching in doing so. In conclusion, a great film that deserves more attention, despite the high rating and reviews holding it in great esteem elsewhere people talk about Annie Hall, Crimes and Misdemeanours and Manhattan as well as more recent stuff like Midnight in Paris and Match Point but Zelig is rarely talked about and that's a shame because people are missing out on Woody Allen at his most unique. 9/10 Bethany Cox",
            "review_date": "2014-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "rock, mock, and doc",
            "content": "With \"Zelig\", Woody Allen took a completely different approach to everything. It's a pseudo-documentary - maybe the first one ever - in which he plays Leonard Zelig, a human chameleon in the 1920s: he literally changes his personality and physical appearance to accommodate the people in his surroundings. Mia Farrow plays Dr. Eudora Fletcher, trying to cure him.This has some of the things that we would expect in a Woody Allen movie, namely Leonard's explanation of the kind of class that he teaches. But, he keeps it going. The \"Reds\"-style interviews really help the movie (there's even one with Susan Sontag), as does the '20s soundtrack. This is one movie that you're sure to like. Too bad that Allen started making movies about neurotic rich New Yorkers later on.",
            "review_date": "2006-04-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of Woody's very best",
            "content": "An amazing film technically, with a lot to say about society, conformity, and how we see ourselves. This mock documentary about a 'human chameleon' in the 1920s and 30s who would involuntarily change his appearance to fit in with those around him in a desperate effort to be liked and accepted is hilarious and heartbreaking, often at the same time. Some of the visual effects are still astounding by modern standards. And Allen gives a performance that is surprisingly subtle. There are a few slow moments, and a few jokes feel self-conscious, but not enough to really damage the greatness of the film in any way. It's tied with 'Crimes and Misdemeanors' and 'Hannah and her Sisters' for my 2nd favorite Allen film behind 'Annie Hall'. Worth seeking out if you've never seen it.",
            "review_date": "2010-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny and technically remarkable",
            "content": "\"Zelig\" is another terrific film from Woody Allen, about a chameleon who lived earlier in the century and was treated by a psychiatrist to become one, whole person. Done in documentary style all the way through and narrated by Patrick Horgan, it's difficult to tell sometimes who is real and who is acting. Leonard Zelig is a young man who, simply by standing with someone, becomes just like them - if he's with a black person, he becomes black; if he's near a fat person, he becomes rotund and so on. He is the subject of articles as well as songs (\"Leonard the Lizard,\" \"(You Have Such) Reptile Eyes,\" and \"You May Be Six People, But I Love You,\" to name a few) and inspires a popular '20s dance, \"The Chameleon.\" Dick Hyman composed the songs perfectly in the style of the '20s, and one, in fact, is sung by the voice of Betty Boop, Helen Kane. Zelig is attacked by Labor Unions because they claim that, as a chameleon, he's holding down six jobs. The KKK doesn't know what to make of him - he can become anything they hate in seconds. While working with a dedicated psychiatrist, Eudora (Farrow), Leonard's sister and boyfriend take him out of the institute and use his chameleon qualities to commercialize him and make a bundle. After a murder/suicide, Eudora gets Leonard back and continues to work with him.The best part of \"Zelig,\" of course, are the film clips and photos from the '20s and '30s that place Zelig and/or Eudora actually in them. The old film was apparently matched to the new by such technical things as stepping on it, putting it in a shower, and crumpling it up. The production used actual cameras and lighting from the '20s to give the right effect, and a technique used in a series of Time-Life specials that inserted Dick Cavett into archival footage was used - and actually was the inspiration for the film, it fascinated Allen so much. All of these photos and film clips are remarkable, but the best is the appearance of Leonard Zelig on the podium near Hitler while Hitler is giving one of his impassioned speeches.\"Zelig,\" though, is more than a technical wonder. It's the story of a man who has no identity of his own and, through the dedication of one doctor, develops one. It's also very funny in parts, particularly one of Leonard's sessions under hypnosis when he talks about the meaning of life.A wonderful film with jaw-dropping editing, done meticulously. Highly recommended.",
            "review_date": "2007-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "zelig",
            "content": "Zelig is first film of woody allen i saw,and i liked parts of a film,i liked that film is represented in a documentry type way since it worked in a unique style and it didnt suffered becase of that,i was impressed also to see that allen is a pretty good actor and that is a rare case considering other directors putting themselfs in films but he suceeded,but considering on seeing how many people find this film funny,i wasnt able to find nothing like that,movie has good potreyed story but it isnt funny one for me,since im not big fan of documentry type films in this one i was able to invest myself in a story and it picked my interest in it",
            "review_date": "2020-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zelig : Patience Is A Virtue",
            "content": "Only briefly in the past had I heard about this Woody Allen movie, that being only the title and not knowing it was by Woody Allen.On attaining a copy of the\nmovie on DVD, I watched it a few months backI did like the idea of a made up documentary about a \"human chameleon\" who can take the form of others around him as\na deeply sub-conscious effort to fit in with others and be accepted.The inclusion of Woody in historical moments is amazing also,given this was accomplished 11 years before being done by Tom Hanks in Forrest Gump.The comedy. Some good funny moments and lines but, after the first hour, I felt the movie was kind of grinding to a halt. Now, that could just be me, for I know others here have given the move higher marks.I may be missing some point in the film or something then didn't resonate to me but I started to feel the point had been made and once that was done, it felt like it was repeating ideas already coverd.I'm not stating anyone's opinion is wrong (that would\nbe a dumb thing to do) I'm only saying I personally felt that way. Maybe the 8 , 9 and 10 star reviewers know something I may be missing here.I know Allen can be ingenious in his comedy works, I have seen nearly all of his movies. I felt it just needed a few more touches of comedic writing and maybe even a little more manic-craziness related with the era Zelig lives in.So, 7 rating out of 10. My rating takes nothing away from the abilities of Allen of course. So, I may view this again sometime, maybe I'll feel differently . (END.)",
            "review_date": "2022-05-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "When to be 'like' is the key to be 'liked' ...",
            "content": "What pair of words can give the most proper description of Woody Allen's \"Zelig\"? Fictional documentary? Nostalgic mockumentary? Social commentary? Psychoanalytical enigma? Thought-provoking comedy? Poignant romance? An even harder question: tone-wise, what is the film's most defining aspect? Egomaniac self-derision? Intelligent self-deprecation? Ingenuous irreverence? Experimental experimentalism? Or just fun, fun and plain fun \u0085 and where the heck am I going with all these interrogations? Simply to the point of their pointlessness, \"Zelig\" surely is a remarkable genre-bending piece of art, but it's also into everything that made its AUTHOR so unique, irresistible and appealing.Yes, I insist on the authorship, because in the very case of \"Zelig\", it's not pretentious to call it 'cinema d'auteur', on that level, it even redeems the dreadful \"Stardust Memories\" precisely disappointing because Allen tried to copy a style that didn't belong to him. \"Zelig\" is definitely Allen's film, it is an artistic masterpiece because it can't be compared to another film and because it found the perfect format to handle its subject:: mockumentary? What is funnier than something funny except something funny handled in a very serious way?Indeed, when real-life intellectuals are interviewed and speak about this strange pop-culture phenomenon that was Leonard Zelig, it's not only subtly hilarious; it also elevates Allen's talent to a level of wizardry. It's almost magical how not only Allen is able to capture the zaniness of the roaring twenties but also to make the whole thing absolutely realistic. He makes the 'fantasy' aspect of the basic plot's premise totally believable, by encapsulating the era into many relevant archive footage of the era, and inserting several cameos of its most influential people from Chaplin to Lindbergh, from Capone to Hitler, and using the reel voice-over narration with the perfect tonality.That's the trademark of the greatest films, they don't just take their story for granted but they try to transcend an already qualitative content. And \"Zelig\" is also a remarkable technical achievement on the field of photography and cinematography, I don't know much about the use of lenses and the possibility to make a picture look dated and deteriorated, but let's just say that one decade before \"Forrest Gump\", they were able to put Woody Allen behind Adolf Hitler and make it look quite seamless. This level of perfectionism is vital because the format chosen by Allen wouldn't have allowed a fake look; it's precisely because it looks real that the gags work.And the more I see \"Zelig\", the more I realize that the movie works on a self-reflexive way as if it was deliberately trying to embody the very condition of its titular character, a man who tries so hard to fit into every human group, to be liked by everybody that he mysteriously develop the same physical characteristics and mannerisms of the personalities around him. It's as if for the first time, Allen abandoned his self-absorbed neurotic lovable loser character to let express the most hidden part of his personality, a man uncomfortable with what he is, lost in an era where everything is dramatized for the sake of it.Mia Farrow enriches the story with her part as Dr. Eudora Fletcher, the psychoanalyst who wants to understand Leonard Zelig with the well-intentioned motive to help him to overcome his condition. Their interactions are handled with the perfect mix of comedy and poignancy, especially during the hypnosis, one of the film's best moments. Between many laughs, we understand the insecurity lying beneath Zelig's strange behavior, a ferocious and unconscious desire to fit in the crowd, to be like everybody as if it meant liked by everybody. If you extrapolate this, you'll end up realizing that there are the very aspects of human personalities that were exploited by totalitarian movements, hence the cameos of some infamous characters.The zany 20's provided larger-than-life, eccentric, charismatic characters fittingly heroes, stars, gangsters or even dictators, people who could inspire both jealousy and admiration in this orgy of entertainment, before the crashing climax left people with a painful hangover that would plant the seeds of a coming War. Zelig not only fitted his entourage but also his era, a pure product of a time where the world reached two extremes, where being different and forming one was two different norms defining two sides of the world that would collide in 1939. That's the intelligent poignancy of \"Zelig\", humorously dealing with History's facts, just as \"Radio Days\" would do, four years later.And to a certain extent, the conclusion of Eudora Fletcher's therapy reflects the self-reflexive aspect I mentioned. The film is a cinematic chameleon, and not just one of Allen's most ingenuous, but one of his best. I don't think it had to do with the Allen's envy to please his fans by any means, after the average \"Stardust Memories\" and \"Midsummer's Night Sex Comedy\", but probably a desire to become himself again, and to redefine himself as the major comedic director he's always been. How? Simply by bringing something new in the screen as he did in his directorial debut \"Take the Money and Run\" in 1969, and it's not too much of a coincidence that both have the same format.Like a more confident and perfectionist \"Take the Money and Run\", \"Zelig\" marks Woody Allen's rebirth, a new impulse of his creativity during the 80's that would reach a splendid pinnacle with \"The Purple Rose of Cairo\", \"Hannah and Her Sisters\" and \"Radio Days\". And after watching \"Zelig\" a second time, I genuinely found the film better than the much more applauded \"Broadway Danny Rose\" and like many cinematic masterpieces, very insightful about their author's psyche and Zelig is simply Woody Allen reconciling with himself through one of his greatest characters.Bill Cosby said : \"I don't know the key to success, but the key to failure is trying to please everybody.\" Both Leonard Zelig and Woody Allen would have probably agreed.",
            "review_date": "2012-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Allen's brilliant mockumentary over a funny and chamaleonic figure of the 20th century",
            "content": "Jewish, socially rejected, and then a enigmatic figure coming out of the mind of Woody Allen, Leonard Zelig, the main character in one of the first mockumentaries ever made (I believe it is the first) is a chamaleonic guy who transforms himself with the same clothes and personal characteristics of the person he talks or appears at his side. Famous personalities like writer Saul Bellow and others talk about the mysterious and famous Zelig and his cultural influence in the American society of the 1920's and 1930's with his ability to change of personality in a blink of an eye.Here's a story of a man who wants to fit in the society, be accepted to it but he doesn't know how to because he seemed to lost his persona after a event involving his desire to read \"Moby Dick\". Someone asked if he had read the book and his positive answer \"transformed\" him into a human chameleon changing from Asian, African American, a obese man, a nazist and many other figures. Not only the physical characteristic but he thinks he has the ability to work in the same profession of the person he follows, so you're gonna see him delivering babies without knowing how to, or becoming a aviator à la Charles Lindbergh. To help him overcome with this hilarious and problematic skill a doctor (Mia Farrow) is going to make a groundbreaking medical research on Zelig and discovers the reason behind this changes. And of course, there's a love story between them.Helped with a excellent and complex cinematography by Gordon Willis evoking the memorable News Obituary from \"Citizen Kane\", \"Zelig\" tells the story of its character with a grained but very stylish photography, making the film with a realistic look of the 1920's and 1930's, where Allen has the chance to be closer to many personalities of the time, or attending a Nazi party while Hitler's speeching. It has the same quality that made \"Forrest Gump\" a interesting and remarkable film where a character passes decades meeting famous people in unusual events.But \"Zelig\" is a comedy and being so it has some of the funniest lines of a film written and directed by Allen. His opinion on baseball; his wish to read \"Moby Dick\" quoting the book as the most intellectual book of all; and all of hypnosis sessions where he says things about a masturbation class and his childhood where everybody beat up on him and in his family are among the most memorable and funniest lines in the film. Writing, directing and acting Allen succeeds in a spectacular and positive film with a impeccable mise en scene that is very believable in recreating the old era of Jazz, the American society of the period and it is a very entertaining and very historical film even though Zelig never existed. But sometimes we think he could have existed. But he's very real to many of us in this great film! 10/10",
            "review_date": "2011-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing concept, diminishing laughs",
            "content": "Zelig (1983)Amazing concept, diminishing laughsWhen this starts, it's astonishing, and funny, and inventive. And very very well done. Starting with Susan Sontag, the real Sontag, is a leap of reality that seems like it'll carry the whole 79 minutes. And there are truly moments that show up throughout that are good for a gasp or a laugh, the Hitler scene for one. But the concept is the key, and to some extent it's been done before, at least in stills. And once you get it, which might take three minutes or might take ten, you've got it, and it depends more on acting or cleverness from then on. And for me it falters too often to really make it worthwhile (Mia Farrow is really a bore throughout, and even Allen is sometimes straining). I have to say, the first time I saw it I didn't get as tired of it, so if it's the first time you might be thrilled. And if you've seen the 1994 Forrest Gump (and liked it), you owe it to yourself to see Zelig for being first, and in my small view, better, technically.Because technically this is a complete marvel. The original footage is as authentically 1920s and 30s as anything authentic (an odd post modern truth), and the newly composed music and dance numbers are really fabulous, and funny. The team Allen has during all his films this period (many of them my favorites) is none other than Gordon Willis behind the camera, Susan Morse editing, Juliet Taylor casting, and Santo Loquasto costumes. The music by Allen veteran Dick Hyman, who is now more famous for his ragtime renditions, is key, of course, and really convincing (sometimes convincingly bad, very period).So whatever my reservations, this is in many ways a fresh, unique, brilliant film, a small one with big brief moments.",
            "review_date": "2009-09-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My favorite Woody Allen film",
            "content": "Even when I highly respect Woody Allen as a filmmaker, I'm not a big fan of his movies.However, if I had to choose one of all the movies that he has done as my favorite; \"Zelig\" would be my first choice.It isn't only wonderfully directed and has the subtle sense of humor displayed by the other films of Woody Allen, but it also has an incredibly story, which fits perfectly well with mockumentary visual style used on this film. The balance between the comedy and the sentimental parts of plot (which tells an honest, truly endearing love story) is perfect, being displayed in a very convincing way, containing also a healthy dose of irony and satire that completes all the virtues previously mentioned. The result is a very rewarding experience, which could be easily considered as the best film directed by Woody Allen to date.Personally, I think that this is one of the most intelligent and better written comedies ever made in the history of cinema.",
            "review_date": "2012-07-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Witty, amusing and technically impressive mockumentary",
            "content": "This film is a documentary about the story of one Leonard Zelig, a man who came to prominence in the 1920's when police found him living as a convincing Chinese man and, on arrest, his personality and appearance changed again. He became a medical phenomenon and everyone lined up to have their say. One doctor in particular, Eudora Fletcher, dedicates herself to \"curing\" his condition and finds that she becomes part of his fascinating life story.Zelig was a film that I heard about but had never gotten round to seeing for year and years. Recently I had been catching up on some of Allen's modern films and decided to make the effort to find and watch some of the older ones that had slipped past me. Bananas was one, Zelig was another. Bananas didn't impress me that much but I enjoyed this film a lot more simply because it seemed a lot more assured in what it was doing. Typically for Allen, the concept is based on personality order and issues over not fitting in but it is taken to the extreme in Zelig's case. This \"fantastical\" edge to the material doesn't produce as many big belly laughs as I expected but it is constantly witty and amusing, with lots of silly material made funnier by how straight it is delivered. The documentary style really suits the film and gives good lines to the narrator and also embedded into the archive footage.Indeed without the archive footage and the approach I think the film would be a lesser one because it is technically impressive throughout. I was taken by how Allen captured the period and blended his material so well with stock footage. OK there are one or two moments of being inserted into famous footage that don't work as well now that Gump has done that to death but it is sparingly done and not as tiresome as in that film. The grain of the film, the movement of the actors, the movement of the camera all come together to produce a really convincing look and feel \u0096 which is only more convincing by including the modern day talking heads by contrast, the modern style making the other more dated. Within this the performances are impressive because they engage as well as technically convince. I enjoyed Allen's physical comedy and nervous energy as much as I liked Farrow. Horgan's dry delivery as narrator can also not be overlooked.Overall Zelig is not a hilarious comedy that gets easy laughs off inserting a character into historical footage like they did in Gump. Instead it creates its own history built around an amusing concept and, as a result delivers a witty and engaging little film that is not only fun but also technically is very accomplished.",
            "review_date": "2009-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"My one regret in life is that I am not someone else.\" - Woody Allen",
            "content": "Woody Allen's Zelig studies a made-up \"chameleon man\" from the jazz age, a man who appears to have no identity of his own, who instead assumes the attributes of people around him. Allen takes the concept to humorously absurd levels. It's not just that Zelig is bashful around bashful people, outgoing around outgoing people, and pretends to be a doctor around doctors or a musician around musicians. No, Zelig also becomes black when around blacks, fat when around fat people, Chinese when around Chinese people, and a Nazi when around by Nazis. Of course he becomes a huge cultural phenomenon, though he's treated by a psychiatrist, one of Mia Farrow's best performances. Naturally at first her work is foiled by his inclination, when with her, to take on the persona of a psychiatrist, but she seems to make progress when she hits upon the cunning approach of claiming that she is not a psychiatrist but only pretends to be one.Together with flourishing as a hilarious and light-heartedly enjoyable film, Zelig engagingly traverses the universal dilemma of personal identity. Rather directly, given all of the ways in which we're different from the people we were at ten, fifteen and twenty, in what way can it be said that we're the same people as those young men/women, teenagers and kids? Of what exactly is one's individual personality comprised? Because the eponymous character transforms more excessively and more spasmodically than most do, the character of Zelig arouses this question more palpably.One might see the film as an analysis of falsehood, the inclination to go along dormantly with the crowd, to do what others do, to believe what others believe, trustingly, instead of thinking for oneself and behaving in kind. There is the notion that those who live this way miss the chance to live their own lives, but instead ultimately die having lived the lives merely of the others or of the crowd. Allen's portrayal of Zelig as becoming a Nazi when surrounded by Nazis explicitly raises the ethical and party-line concern of phoniness, as well as the existential one. It might be viewed that the whole reason for the film's time and place is so that it can lead to the idea that genocidal onslaught and warfare does not occur because thousands go insane, but because millions will submissively and compliantly follow the orders of the few who are. One explanation for why they do so is that they want to fit in, and to be free of the blame or strain of self-reliant thinking and doing.Zelig is so convincing in its portrayal of a documentary, and yet it's not one. It's a purely fictional, wildly over-the-top story. It's ingenious in taking on the same all-encompassing inauthenticity as its title character. We're in some sense meant to pretend it's true or realistic, when it's anything but. It's comprised of antiquated newsreels, grainy black-and-white footage, old photographs, old recordings, all-encompassing voice-over, even interviews with such contemporary intellectuals as Susan Sontag, Saul Bellow and others, all of whom play themselves offering critique and perspective. The fictitious characters are flawlessly assimilated into images of Hitler, Pope Pius XI, Eugene O'Neill, F. Scott Fitzgerald, Charlie Chaplin, Calvin Coolidge, Herbert Hoover, James Cagney, William Randolph Hearst, Babe Ruth, etc. Allen never taints the deception that we're watching a documentary about an actual historical figure.It would also seem, however, that the most pertinent description of Zelig could be self-alienation, as he leads an inauthentic life, with the modern tendency to coast through life submissively, trustingly assuming the views, principles and manners of others instead of attentively shaping his own intentions, principles and concerns, based on his own experiences, of which he has an inordinate many. It's simple to taunt and belittle such pretended compliance as gutless. It's evident that Allen doesn't like it, but even so he suggests a compassionate answer to Zelig's motivation, essentially by pointing out that Zelig is right to be worried about his security. When he was a kid, his brother beat him, his sister beat his brother, his father beat the three of them, the neighbors beat his family, and the people down the block beat the neighbors and his family. He was constantly bullied by anti-Semites. His parents, who never took his side and always blamed him, sided with the anti-Semites. It's easy to see why someone in such an environment would fearfully want to be invisible, to be liked, which is safe.All this, and the movie's only 79 minutes long. Nevertheless, Zelig is a cheerful and uplifting film. Eventually, we see the character fall in love, overpower his life of incoherence, find individual purpose and fly an airplane upside-down across the Atlantic. He is also not the only character to be intriguingly elucidated. They have to be their own individuals, and make their own moral choices. \"Otherwise, you're like a robot, or a lizard.\"",
            "review_date": "2007-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\" All I ever wanted was to be liked \"",
            "content": "The inventive mind of Woody Allen has little to prove. He has consistently managed to capture our hearts and minds with humorous entertainment of a superb quality for years. In this surprising offering entitled \" Zelig \" a strange phenomena occurs when Leonard Zelig (Woody Allen) a common man is able to morph himself, like a chameleon into anyone around him. This includes resembling Blacks, Orientals or different cultures, nationalities and even professions. What begins as a trick, or illusion becomes a world wide sensation which further transports him into the NEWS of the Day. Zelig comes to the attention of Dr. Eudora Nesbitt Fletcher (Mia Farrow) who decides to dedicate her life to the study and understanding of the unusual man. Using a documentary style Allen captures the sites, sounds and feels of the 20's and 30' with success. With such results, the film becomes another triumph for Allen who wrote, directs and stars in this sure to become a Classic. ****",
            "review_date": "2009-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody along with Willis perfects his invention",
            "content": "Woody Allen who arguably invented the mockumentary with the hilarious Take the Money and Run brings it to another level in Zelig. Allen along with cinematographer Gordon Willis manage to take 20s and 30s newsreels and apply it seamlessly to Willis's footage of Allen's fictional creation Leonard Zelig, the chameleon man.Leonard Zelig (Allen) is a typical nondescript average Joe with one remarkable trait-the ability to morph into any situation with convincing expertise. He gets close to world figures (on a balcony with the pope, on deck behind Babe Ruth)and later finds out he's been performing surgery. Before this is revealed though Zelig becomes a popular celebrity (further solidified by a dance song entitled The Chameleon) taking his place with all of the other popular celebrities of the day. Dr. Eudora Fletcher tries to get inside the head of Zelig through hypnosis and he falls in love with her (in spite of her pancakes) and they plan to marry. At this point dozens of women make the claim he married them while others sue him for (one for delivering her baby with ice tongs) malpractice. With pressure mounting Zelig does what he does best, disappear.This sober faced faux documentary with its outrageous central character is filled with things to both laugh and marvel at. Getting the grainy footage to match so well with newsreel you find yourself being fooled more than once. Stills of Zelig and other celebrities, crackling audio, retro doc music score and staged scenes from the era are impeccably adjusted to create maximum believability, evoking humor through Zelig's responses as well as through the clinical narration of the absurd goings on.As Zelig, Allen is charmingly ambiguous and comfortable in his many skins. Since his conflict is with himself Allen is free of the de riguer whiny rants he has with female leads in many of his other films, flashing a genuine smile at press conferences and claiming being psychotic can lead to a world of opportunity.Where Allen really shines though is in the exacting detail of capturing the period's history in look and sound and injecting an implausible character into the proceedings without missing a beat. Zelig is one brilliant and original satire that a quarter of a century later remains the template on the perfectly executed retro fit.",
            "review_date": "2010-08-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Impressive but more satire needed",
            "content": "The idea is great and much of the execution wherein we see Allen as Zelig inserted perfectly into old footage. But I would have liked more satire to emerge, a stronger, more biting attack on the world around Zelig that made a chameleon out of him, and perhaps a bit less of the romance with the psychologist.",
            "review_date": "2020-07-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome piece of film-making a true Masterpiece",
            "content": "This film is a keystone in Woody Allen's career. It truly shows him to be the definitive descendant of Franz Kafka. Hundreds have imitated & paid homage to Kafka in the 80 years or so since he wrote his masterpieces but no one has come close to metamorphosing Kafka's vision & mindset to contemporary American culture as Allen has. Leonard Zelig's relationship to other people, worldly events, \"identity\" & the \"otherness\" in society exactly expresses the the points of view of Joseph K, Gregor Samsa, the Hunger Artist & the rest of their brethren.On a personal level one can view the \"chameleon\" message of the film as Mr. Allen's gentle explanation of how & why he makes so many different kinds of films, imitations to some, homages to others, to great authors, directors. Classic comedies, domestic dramas, social satires, you name it, he does it. He truly speaks everyone's language, he thinks & feels like them (us), he becomes them (us).On top of which the purely film-making aspects of Zelig are stunning. The seamless integration of newsreel footage with contemporary invention. The 100 percent authentic feel of the music, dance, film grain, sound, with the time depicted. All of it a major accomplishment of a giant artist.No question in my mind that this is Woody Allen's greatest achievement among many many stupendous accomplishments.",
            "review_date": "2005-09-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of Woody's most creative masterpieces",
            "content": "I saw it a few days ago and it's now definitely among my top 10 Woody Allen favorites. From start to finish I was amazed by how the story was told and it just felt so real. It could be a real documentary! I also admire the job of the actors doing the part of the testimonies and when we are showed the old photos with the Ken Burns Effect. It's incredible they made this in 1983. I don't know if it was the first mockumentary ever done but I'm sure it influenced a lot since then. There are also some good messages and great lines, even it's not your typical Woody Allen script. All the actors are fantastic and the make up is pretty impressing. When it was over I wanted the movie to start again. It is really a different cinematic experience, original, fresh and funny. I recommend it to everyone, while I know not everyone will be as amazed as I was.",
            "review_date": "2016-04-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sheep-like",
            "content": "Zelig is an adjective of Germanic (not especially Yiddish) origin, with multiple meanings, ranging from blessed or blissful (soulful), to silly. In its Anglo-Saxon incarnation (saelig) it has often had a tendency to be applied to sheep: simple, hapless, foolish animals, conforming aimlessly to the herd, sometimes referred to as sheeple, incapable of independent thought. This seems to be Woody Allen's impersonation here, ineffectual and unidentifiable. Merge with the herd; go with the flow.Reviewers have had a little difficulty in assigning a satisfactory genre to this film, most settling for describing it as a mockumentary of a non-existent person. Perhaps slightly pretentious.I think of it more as a philosophical excursion into the meaning of life, and an examination of our purpose, if any, on earth. Acceptance, compliance, or defiance ? A very great deal of archive research and other work was clearly put into this production, and it was undeniably highly ingenious. Although a little annoying at times, on balance I found it fascinating and engaging, and while I hovered for a time on a low rating, I finally settled for quite a high appreciation of its paradoxical creativity.",
            "review_date": "2017-03-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Highly original and very funny",
            "content": "The story of Leonard Zelig, a man who could (and would) assume the physical characteristics and mannerisms of anyone he cam into contact with. When doctors discover him, they try to figure our he has this ability and what causes him to change. Eventually he is treated by Doctor Eudora Fletcher, a psychiatrist, and she works out how to treat him. Meanwhile, dubbed \"the human chameleon\", he becomes a celebrity. Celebrity has its downsides, however...Very original film from master writer-director Woody Allen. The 1980s were a very creative period for Allen, including venturing into more dramatic areas. Long gone were the absurdist (yet very funny) comedies of the early 70s. Zelig is a bit of a throwback to that period, with a wonderfully ridiculous central plot and some hilarious jokes.While over-the-top, the plot is actually very plausible doesn't fall apart, remaining solid to the end. Being presented as a documentary helps the plausibility. Reveling in its absurdity the movie has a great momentum and energy. The documentary format presents Allen with scores of opportunities to demonstrate his editing and cinematographic skills, editing Zelig (ie himself) into newsreels with famous people as well as constructing very plausible \"footage\" of Zelig at famous events.One of Woody Allen's greatest movies, and that says a lot.",
            "review_date": "2017-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Films Of The 80's: Zelig",
            "content": "Zelig (1983): Starring Woody Allen, Mia Farrow, John Buckwalter, Patrick Horgan, Marvin Chatinover, Stanley Swerdlow, Paul Nevens, Ralph Bell, Richard Witing, Sol Lomita, Mary Louise Wilson, Sharon Ferrol-Young, Erma Campbell, Director Woody Allen For me, Zelig was Woody Allen's greatest film, despite the success and overall genius of Annie Hall, which put Allen on the map. His creative comedy, a blend of intellectual humor, Jewish culture, psychological and sexual jokes, a tendency to romanticize and glamorize New York City's past, all which would continue to be prominent in other films throughout the 80's, notably in \"Hannah And Her Sisters\", is at the core of this film, which is directed so as to resemble and parody a serious black-and-white documentary about an actual 20th century man. This man is Zelig (Woody Allen), a shy, unassuming, meek little Jewish man with a rare identity disorder. He cannot live a normal life as himself due the serious problem of his ability to transform himself to adapt to his surroundings, i.e. when he is around Native Americans, he becomes Native American, when in the company of black people, his skin turns black, when around overweight people, he gains weight. His body changes to the skin color of every ethnic group he is around with. This miracle of biology earns him the title of \"Chamaleon Man\". Consequently, he makes friends, wives, lovers and enemies. With such an absurd and fantastical premise, Zelig becomes a fun and brilliant escapist fantasy, though presented as if it were a true story and a true disorder. Actress Mia Farrow (Rosemary's Baby, The Great Gatsby) who was romantically involved with Woody Allen at this time, stars as his therapist, Dr. Eudora Fletcher. She records hypnotic sessions with Zelig and studies his disorder extensively. The time they share together as patient and doctor gradually becomes a romantic relationship. An attractive aspect of this comedy is the fact that Zelig's celebrity status draws famous personages of the 20's, 30's and 40's into his life. He is so loved that he is able to hob-nob with silent legend Charlie Chaplin, newspaper millionaire William Randalph Hearst, novelist F. Scott Fitzgerald and his wife Zelda, Broadway star Fanny Brice, actress Dolores Del Rio, black French exotic dancer Josephine Baker, gangster Al Capone, aviator legend Charles Lindbergh. In one scene, Zelig has fled the US after a polygamy scandal (He can't recall having married different women because he was different men at the time!). He hides himself among the Nazis, and we get to see Adolph Hitler himself at a speech rally. All this is done using actual footage of these historic people, with the camera trick of putting Woody Allen into the footage. This is exactly like \"Forest Gump\" 10 years later, only in that film Gump appeared in various footages of the late 60's and 70's. The movie can border on cartoonish sometimes but it's highly enjoyable. The Jazz Age is well-rendered, and the original songs resemble popular styles of the time, especially in the song \"Chameleon Days\" which is modeled after a Charleston-like dance song sung by a vocalist who sounds a lot like Betty Boop!! This is my favorite Woody Allen film. If you haven't seen Woody Allen movies and want to start, this is one you should definitely watch, along with \"Annie Hall\", \"Hannah And Her Sisters\" \"Midsummer Night's Dream Sex Comedy\" and \"Alice\", a film which Woody Allen directed but did not appear in.",
            "review_date": "2006-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A homage to Peter Sellers?",
            "content": "This is my favorite among Woody Allen's movies. I also think it is his best. It has real depth, there is less incoherent babbling than normal. The message here is clear and really touching. The idea to make a pseudo documentary, with pseudo old record scores and all, was a great and resoundingly successful experiment. It shows the extent of Allen's genius. To set the story in the Roaring Twenties and early thirties seems to be a decision that is dead right. It really enhances the quality and the message of the movie.I wonder if the character of Leonard Zelig is motivated by the personality and the performances of Peter Sellers to whom Allen is somehow indebted. There is no doubt for me that Sellers must have influenced Allen as an actor quite profoundly. And it was Sellers who used his uncanny chameleonic talents that sometimes made him appear as a sort of a freak. Sellers died in 1980, Zelig came out in 1983. Pe-ter Sel-lers, Len-nard Ze-lig ... is this Allen's personal secret? Or am I mistaken?",
            "review_date": "2003-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Inventive Allen mockumentary",
            "content": "Woody Allen delivered Zelig in the middle of a particularly strong creative patch. He had successfully navigated from pure comedies to more serious comedy-dramas. If anything, Zelig falls into the former category. But it's really quite different to anything else he had directed at that point. It's a pretty experimental movie in many ways, one that uses technical wizardry like no other Allen movie. It takes the form of a mockumentary, and in order to successfully achieve its aims, it blends old and new films such that Woody himself appears seamlessly in old footage depicting various historical figures and scenes. In this sense, it pre-dates the Oscar winning Forrest Gump by a decade.Its story revolves around a strange figure called Leonard Zelig. He is a man who had a significant effect on world affairs but who is now forgotten. Historians and people who knew him discuss his life in a talking heads format, while we see a variety of stills and clips taken from different parts of his life. It appears that he was known as a human chameleon, in that he was able to change his appearance and personality at will, so that he could blend into any situation; in this way he was, for example, able to turn black, put on excessive weight, speak new languages, etc at will. The premise is of course entirely fantastical but it is treated with sober seriousness by the narrator. This mixture of silliness with a dry academic documentary style is what makes it the film that it is. I guess it has some things to say about conformity and celebrity but in essence it's an amusing inventive docucomedy. It reminded me a little bit of Peter Greenaway's The Falls in it's absurdist humour and documentary realism, except this is a good deal more accessible and, of course, funnier. Having said all that, it isn't among Allen's best works in my opinion. It's neither as funny as his best comedies, nor as emotionally involving as his best dramas. Nevertheless, it is one of his most original. And where else can we see Allen goofing around behind Adolf Hitler at a Nazi rally? Overall, it's a film that once again proves Allen is a highly original talent.",
            "review_date": "2012-08-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Outstanding- a 10*+++",
            "content": "So often, members of ensembles like SNL or Second City have less success when they make feature films, because they attempt a presentation of 2 hours or so on the large screen, more appropriate to a 10- or 15-minute skit on TV. The same is true for some hugely-successful sitcom stars, who become virtually billionaires from TV, but whose films have modest success, or are box office disasters. Again, they seem unable to translate to the 2-hour/big screen venue material which played well for the 22 minutes or so during their half-hour programs.Like many of his films - and perhaps the best example of all - Allen's \"Zelig\" takes a premise and shtick which would play very well in a 10-minute to half-hour TV venue, and makes it thoroughly engrossing and entertaining as a full-length feature movie. In fact, I've never seen a single Woody Allen movie which I wouldn't have enjoyed if he'd made 50% longer.Everything about this movie is outstanding: the humor, both oral and visual, the superb film artistry in creating a complete feel for the period of the film, and the technical expertise displayed without any disturbance of the impression of this being filmed with earlier, more primitive resources.If somebody placed a gun to my head and insisted on a criticism, it could only be that I'd wish that he place the names of the real-life personalities, portrayed as commenting on Leonard Zelig, on-screen every time they were shown, and leave them on-screen a bit longer.My liking of Allen films is so complete that if I were to rate all in order, the lowest on the list wouldn't be below a \"9.9,\" and I can't think of any I wouldn't accord a \"10.\" My personal favorites (both with Mia Farrow, and both black-and-white with the intentionally \"grainy\" filming technique) - this film, and the equally- and delightfully-quirky \"Broadway Danny Rose.\"",
            "review_date": "2006-10-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Joke Stretched Thin",
            "content": "In this mockumentary, \"historical\" footage is used to tell the story of a man who had a chameleon-like ability to integrate himself into his surroundings. This is a one-joke movie, and that joke is stretched much too thin to produce any laughs. There is also just one message: conformity is bad. The joke and the message are exhausted in the first 15 minutes. However, the film then drags on for another hour of repetitious footage as Allen belabors the point. The main purpose of this film is for Allen to show off the technique of merging new footage with historical footage, something that had never been done on this scale. It's an interesting exercise for a short, not a feature film.",
            "review_date": "2011-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very good but overpraised",
            "content": "Really strange mock documentray that takes place in America in the 1920s--a man, Leonard Zelig (Woody Allen) is a human chameleon--he takes on the physical characteristics of any man he is with.  He's regarded as a freak but a caring doctor named Eudora (Mia Farrow) tries to cure him.This came out in 1983 and was a huge hit.  With it's truly incredible trick photography (inserting Allen and Farrow in actual newsreel footage of the 20s) it was fascinating to watch--and still is.  But critics overpraised it ridiculously.  It's a very good little comedy but no masterpiece.  Some critics were comparing it to \"Citizen Kane\"!  As it is it's good but not totally satisfying--there's just not enough material for a full-length film. Even at its short running time--79 minutes--it feels too long.  At about the 50 minute mark it should have ended.  When it was over I was still \"hungry\" for another movie.So, it's worth seeing for its photography and a few hilarious moments, but it's not enough.",
            "review_date": "2003-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Moments of mad-genius inspiration",
            "content": "Woody Allen's \"Zelig\" appears to be a wispy-thin string of sketches about a chameleon man who can radically alter his appearance to fit into any given situation, and theatergoers in 1983 may have found the release an Allen-underachiever. It has no higher aspirations than getting quick, momentary laughs from its flaky visual jokes, and a leading character who isn't meant to be memorable or even personally intriguing. The film is pure film-making style, a triumph of creating a whole feature from technique, although Allen's satirical side is as sharp as ever. Mia Farrow has a negligible role as Zelig's psychiatrist (she amusingly--perhaps intentionally--resembles Liv Ullmann, magically transferred from \"Autumn Sonata\"), while Woody, in the lead, has great fun with fads, fashions and nostalgia. The humor here isn't cutting-edge, although the effects are remarkable. \"Zelig\" is so slyly silly it may pass right under your radar, but it has some very amusing bits and pieces. **1/2 from ****",
            "review_date": "2006-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rate Shifter",
            "content": "I'm so glad I watched this film.At first I was disappointed that it was a period piece, thinking that it would look like another modern movie attempting to appear like it was set in the 20s, but now I think maybe I've gotten that impression because I've seen a lot of modern movies trying to look like a Woody Allen film set in the 20s.I laughed and laughed throughout.(Rate shifters are viewings that make me want to bump all my other scorings down at least one star, except the other rate shifters, given my tendency to overrate films.)",
            "review_date": "2012-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Enough for another 200 years",
            "content": "I feel so lucky to found a gigantic mind that reveals the exact things happened in his own life, in fact Woody's most fans were having the same problems as he shows in his films and i couldn't agree he really did these movies In that time of ages. I'm seeing his film ascending orderly now I came to Zelig oh god can't wait what did he done after these kinda miracles.. it's not enough I should fantasies more about what it would be like the onward films",
            "review_date": "2018-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Human Freak of Nature/Curiosity Gets Woody Allen Treatment",
            "content": "Just before giving us the campy \"Purple Rose of Cairo\", Woody Allen created \"Zelig\", another very unique film. The title character is a man who, like a Chameleon, changes his physical appearance to blend in with whomever he is sharing present company. When getting acquainted with an obese man, Zelig suddenly develops a pot-belly; among Asians, Zelig changes appearance to resemble the people near him; no matter how different the person in Zelig's company, he changes to adapt.Mia Farrow plays a psychiatrist (an unusual occupation for a woman in the 1920s & 30s) determined to figure this case out. The predictable romantic involvement ensuing adds to the confusion. The film is enveloped in countless news real excerpts and newspaper headlines. The elaborate \"joke\" may have been even more effective if kept to a shorter format. A 30 minute short is not always improved by an 80 minute feature film.The Woody Allen character is depicted as not only a curiosity or a freak of nature, but as someone incapable of functioning independently. A human chameleon may be a curiosity, but it does not render an intelligent person as helpless and in need of guarded confinement. Although offering many chuckles and even big laughs, the idea of caging someone who is different, treating him like an \"E.T.\" or \"Elephant Man\" can make viewers uncomfortable. Our society has not fully evolved to accept such differences. I'm not certain if this film is an argument for or against acceptance of human curiosities. Although the special effects, mainly authentic \"aged film footage\" and period music are outstanding, the story line is somewhat disturbing.",
            "review_date": "2005-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "How to blend in the funny way",
            "content": "Woody Allen's genius, intelligence and wit are often only hampered by his insistence to play the same character over and over again in a multitude of films, or at least a version of that archetypal protagonist: a whiny, talky, at any rate neurotic American Jew with never ending problems in the romantic area. This makes him a welcome guest for shrinks, and the resulting filmed self-analysis is all garnished with the typical sophisticated Woody Allen humor. In \"Zelig\" he is all that and more. As this time our hero proves more adaptable. Literally. And it's a good thing.Allen, who brought the world such fresh comedy ideas like film stars stepping out of the screen, characters sensing that they might be out of focus, writers lost between fiction and reality to name just a few, created with \"Zelig\" one of the best mockumentaries to date. Subject of course is this peculiar director/writer/actor, who loses himself in the role of a human chameleon, a freak of nature, who has anything but an identity to count on. Apparently his former roles as time traveler, dictator by accident or Vulgarian \"spy\" were not enough, so Allen pulls out all the stops and turns clown, dentist, professor, Indian, black, fat, mustached and what not - all in one picture. Adapting involuntarily to anything regardless of profession, ethnic or political orientation, the Zelig character goes all the way through, even finding himself consequently in Nazi Germany at a Hitler rally. And he makes a point. Aside from the comic effect of this premise and its perfect execution via newsreels, photo manipulation and the like containing mystifying historical details that never happened, there's that other level to the film as well: \"Zelig\" deals head on with the complex relationship between individual and society, poses questions about identity and assimilation, and in bringing up all those serious issues is simply hilarious.",
            "review_date": "2013-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "His best technical effort",
            "content": "Amazing bit of work for Woody took 3 years to finish. The use of sound here is just as impressive as the visual aspects. As other reviewers have stated: the funniest scene has to be Leonard under hypnosis; describing not only the horrible pancakes but how every member of his family,  as well as his neighbors, all beat each other in his childhood. Mia Farrow looks exquisite here and genuinely glowing. You can tell her and Allen loved each other deeply in real life. A shame how their relationship ended up so bitter and full of hostility. Especially after viewing this- one of Woody's masterworks in a full canon of them.",
            "review_date": "2002-05-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"and for several days, will not come off the wall\"",
            "content": "Whether a comedy meets the test of time takes, well, time... and Zelig passes. I originally described Zelig as a \"one joke movie,\" but added it is a pretty good and very original joke (even if there are echos of Robert Crumb's comic book history of the early mysterious life of Mr. Natural). Now I see Zelig as much more.Woody's deadpan faux history is a very loving evocation of the 1920s and 1930s through its use of tasty bits of period film. It also manages to mock documentaries themselves, and (with its riotous use of prominent real world geniuses who deliver many of the funniest lines of the film) to mock intellectual pretension generally, and psychology in particular.But in the end it is a love story, and a metaphor for the struggle of immigrants to assimilate, giving the film a bittersweet quality not often seen in Woody's films.Silly, ridiculous, and giggle-ishious. You keep expecting the inventiveness to flag and it never. Fun & highly recommended.Til",
            "review_date": "2006-08-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unusual and hilarious mockumentary",
            "content": "\"Zelig\", Woody Allen's follow-up to his \"A Midsummer Night's Sex Comedy\", is a hilarious faux documentary focusing on Leonard Zelig, a man capable of transforming himself, and his bizarre adventures. \"Zelig\" is a successful film not just because it's a remarkably funny movie with, hands down, some of the best dialogue Woody Allen has ever written, but because it reaches past its premise (which would have been amusing only as a half-hour short or something of the sort) to become yet another Allen film with psychological preoccupations. It really does have depth, but doesn't go too far in that direction to distract from the comedy, which really is brilliant.The film is only 80 minutes long, but its flaws are still entirely due to the length. It's a mockumentary that feels a little like watching one of those documentaries where you wish the subject's life didn't suddenly get boring towards the end. It's still an excellent film, but I definitely feel sorry that it wasn't mind-bogglingly brilliant as it definitely had the potential to be.It's shot as and looks like most documentaries do, but the archive footage, thanks to Allen and Gordon Willis, looks absolutely spot-on and just about completely convincing, and the film's best visual moments come with faux footage of a 1935 Warner Bros. feature, \"The Changing Man\", which top to bottom looks and feels like a thirties studio feature. Those scenes are among the funniest in the film as well.With its typical preoccupations with psychology and psychoanalysis, \"Zelig\" is a look at familiar subject matter from Woody Allen, but through a fresh and different perspective. It's one of the best mockumentaries around, in spite of feeling a bit dragged-out, and it is absolutely hilarious in places, with some of the energy of Allen's stand-up shining through here and there. Tremendously entertaining.8/10",
            "review_date": "2008-09-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Shifting shades of life",
            "content": "Woody Allen's Zelig can be considered, if nothing else, an anomaly in every sense of the word. Certainly beyond the parameters of what his prior films had explored in terms of form or theme, Zelig adapts the trappings of a historical documentary exploring the life of a man whose curious affliction (a tendency towards conformity so pronounced that his actual physical form is transformed to match those around him, a literal human chameleon) makes him a national celebrity. However, the crucial distinction lies in the fact that the subject of the 'documentary' is played by Allen himself, thereby eliminating any pretensions of realism. As such, it becomes clear that Allen's film is entirely more sophisticated than a 79 minute film coasting by on a single joke premise, but a nuanced, tragic and ultimately tremendously uplifting meditation on identity, whether individual or collective (or a hybrid of both), the function of celebrity, media and audience, and the role of genuine interpersonal feelings within the shuffle. And beyond all that, it's accessible and funny too!Disguised within pristinely re-created crackly historical footage and Patrick Horgan's acute replication of traditional documentary narration, Allen's Zelig drifts in and out of recognizable historical settings and events, every time perfectly blending with his surroundings, before being entrapped by a more standard 'therapy-turned-love-plot' by ambitious therapist Dr. Eudora Fletcher, played crisply yet warmly and with entire credibility by Mia Farrow. Nonetheless, despite the fearfully contrived nature of the latter half of the plot, there is nothing in the film that doesn't somehow hit home as genuine or acceptable, as even the foray into romance functions equally as either reflexive social critique (what audience member wouldn't assume or yearn for a budding romance?) and as wholly heartwarming in spite of itself, infusing a largely intentionally dry, thoughtful film with some offbeat, quiet warm and sentiment. There also lies a peculiar case of art seemingly anticipating life reacting to art in this regard, as in the film, the widespread turn towards criticism and ostracization of Zelig once he stops doing what the masses expect of him, could all too easily be theoretically applied to Allen as filmmaker, whether in regards to this specific film or throughout his career. The real question throughout is who or what Zelig is actually supposed to represent. Allen himself, his own identity consistently misconstrued throughout his numerous, allegedly life- like film personas? A figure emblematic of the mutability of film and performance themselves? Or simply an empty signifier, slyly intended to be, like the character himself, consistently having interpretations and judgments passed upon him? Allen's motivation remains typically unclear, but the ambiguity lies as part of the film's genius, consistently leaving the audience questioning how aligned they are with the frantic, fickle crowds depicted within the film, thus lending the film an unshakable, lingering impact. It would seem, however, given his inclusion of contemporary interviews by respected intellectuals (a device mimicked in later faux- documentary Sweet and Lowdown), that Allen's key focus is not only to provide food for thought, but largely an extensive joke on the pretensions of authenticity of the documentary medium, intended to be chuckled at more than scrutinized at every turn. Finally, the film's reputation as \"Woody Allen meets Forrest Gump\" also proves to be somewhat of a misnomer (particularly as Zelig predates Gump by over a decade). Rather than being simply a gimmick, Allen's insertion of himself into historical footage (including a particularly iconic appearance at a Nazi rally), while a particularly impressive early special effect, is all the more impressive in its keeping with the film's overall tone of subtlety, blending into the background for the sake of highlighting the film's theme of the cultural celebration of conformity rather than showboating. In many ways, the literal transformations of Allen (turning him obese, Chinese and African American among others, all surprisingly convincingly) by way of prosthetics and makeup are far more impressive, simply due to their ability to actually credibly depict the most unlikely transfigurations of the iconic Allen while still making them appear remarkably unassuming and natural. Equally interesting is Allen's treatment of his own performance as Zelig. While playing the part with wonderful flatness yet subtle charisma, it is intriguing to note that during the few excerpts of his dialogue, Allen's Zelig, the \"man without a personality\", spouts out witticisms and one-liners exactly along the lines of the traditional Allen persona, as if Allen could not resist repressing his usual 'character' even when portraying a blank slate of a man. Rather than a self-indulgence, this again feels a deliberate commentary, whether on the viewer assumptions of Allen to \"play himself\" as per usual, to question the seemingly black and white distinction between 'having' or 'not having' a personality, or to further posit Allen himself as ultimately empty, like Zelig, without his persona. At any rate, Allen's performance as such emerges as both enjoyable (and frequently hilarious) and fascinating, again furthering the film's continual vein of satisfying both sets of expectations.A seemingly simplistic film which, upon closer inspection, unearths fascinating layers of complexity and cleverness, Zelig proves equally capable of satisfying those reading it as a Freudian self-analysis and rumination on the character of art or those interpreting it as a chance to see Woody Allen be silly in a different context (and particularly those looking for both). Certainly a unique film from whatever stance it is examined, Zelig, like its protagonist, threatens to innocuously fade into the background of cinematic history, potentially only examined by Woody Allen enthusiasts or scholars. Nonetheless, a film of such unique, understated creativity and whimsy deserves ample appreciation, and as such should be viewed by those familiar or fond of Allen as well as those generally turned off by his traditional output. -9.5/10",
            "review_date": "2011-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Technically brilliant...",
            "content": "This is a technically brilliant spoof documentary. It starts in the 1920s using grainy silent film and stills, goes through the sound era and ends in colour in the 1980s. It makes clever use of library footage and newsreels so that what you see on the screen is always plausibly what could have been shot at the time. For example, when Dr Fletcher goes to a nightclub it is illustrated by stock footage of a 1920's nightclub plus stills of Dr Fletcher that a nightclub photographer might have taken. The scenes of Zelig's treatment are explained by Dr Fletcher's being an early exponent of the use of film to record a case history. Some of the newsreel is completely faked and some is doctored so that, for example  Zelig appears to be at a Hitler rally or appears to be sung to by Fanny Brice. There are also excerpts from a fake 1935 Hollywood biopic  based on Zelig's life. All this is intercut with a modern commentary in colour featuring an elderly Dr Fletcher and real personalities such as Saul Bellow and Susan Sontag.\nThe pastiche musical numbers such as Do the Chameleon, Chameleon Days and Leonard the Lizard, were a joyThat said, the film is not very funny. I sat there thinking: \u0091Wow, this is brilliant' but with only a half-smile on my face. Even at 75 minutes I found it a bit too long and repetitive like an idea for a short story that has been stretched too far.",
            "review_date": "2001-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I don't understand Hebrew. Then he wants to charge me $600 for Hebrew lessons.",
            "content": "Like Allen's earlier Take the Money and Run, which was one of the first ever mockumentaries, Zelig has a whimsical perspective on life. The distanced, self-serious retrospective that the faux-documentary style comes with therefore is a great match for Allen's comic sensibilities. In Zelig, he engages with the many facets of the eponymous Leonard Zelig's identity, and takes aim at even the most prominent of targets, namely the Catholic Church and Hitler's Nazi party, without ever seeming like slowing down. Of course, although the format presents itself as informative and possessing great insight, it is anything but. Zelig's conditions allows Allen the openest of conveniences to slot himself in any historical moment he pleases without the slightest hint of illogic or absurdity. Well, perhaps less the latter, but Allen is smart enough to not over-do any of his gags, or to draw too much attention to them. Sneaking into Hitler's elite seamlessly and then suddenly wondering and waving about as if he has no idea why he is there could be such an easy and tasteless joke to make, but here it is played completely straight. The narrators address the event with such concern and serious regard (even a former SS Obergruppenfuhrer grumpily recalls the scenes) and Hitler was reportedly \"extremely upset\". Mild, and at the same time, a hilarious image is formed. It is nothing at all like what happened in the film adaptation of the fateful meeting. Allen is particularly fond of these deconstructions within his work: see The Purple Rose of Cairo for an entire film on this treatment. Partly why this approach is so believable and successful is because of the technical lengths and achievements that went into integrating the bluescreen footage into the various archival scenes. Fervent critics of Allen might accuse his ego of taking over his films, making himself the centre stage of all the events - imagine if Allen had been as explicit as Forrest Gump. But what makes Zelig work is precisely the opposite; his knack for blending into a scenario like a chameleon renders the thin, pasty face of Allen (and there is no spotting that red hair) almost unrecognisable, and the delight is in how long we can accept a scene for what it is before we suddenly realise where he is. Long- time collaborator Gordon Willis has done a brilliant job of this - the filters, the grain, the decay of the negatives, it all looks authentic. This allows Allen to play with the format in his own way, slip in jokes that would be much less effective overtly. My favourite is the solemn voice-over concerning Zelig's overconfidence which leads him to adamantly disagree with other's opinions. The elderly Fletcher narrates this as some grave medical condition, and all the way during, we see Zelig get comedically violent with a rake with the group of doctors. The exaggerated, slapstick movements are nevertheless visible in the film grain. There is another subversion of the format; Fletcher uses hypnosis in order to draw out intensely personal confessions from the childhood of Zelig (Allen has always had an intense fascination with psychoanalysis). He drones off with the usual beginnings (\"My brother beat me\" \"I just want to fit in\") and then trails off in awkwardly hilarious monologues about cheap rabbis and the terrible quality of Fletcher's pancakes (at which point Farrow, red-faced, tries to look away into the distance even though Zelig is not even aware of her). Take the Money and Run was funny enough, but the humour was a little disjointed, and a lot of the jokes felt like leftover bits that Allen wanted to no go to waste. This, on a whole, is more sophisticated and integrated, and knows exactly how to use the mockumentary format to its advantage.",
            "review_date": "2016-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Overlooked classic",
            "content": "This is one of Woody Allen's most overlooked films. Here Woody shows himself the master of the \"mock-documentary\" style of filmmaking, by \"mocking\" a A&E style show on Leonard Zelig. If you do not know what Woody and Mia look like, you might actually believe it was real. 10 of 10.",
            "review_date": "2001-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An underrated comedic work of art.",
            "content": "A brilliant mockumentary from Mr. Allen, it is the zenith of his satirical comedic career. It is the sort of off-beat filmmaking that he should perhaps consider exploring again these days even if he's not able to replicate the success of this one. The world still thirsts for those. This film is one of the more successful Allen-Farrow collabs that consists of 12-and-a-third films, and in the subcategory of Mr. Allen's filmography where the two actually had screen time together, seven-and-a-third in my count, this tops the bunch in its tenderness and poignancy. Hannah and Her Sisters and Crimes and Misdemeanors only comes as a close second and third in that distinction.\n \nIt is worth checking out other works having a darker take on the themes addressed in this film regarding psychiatry, etc., the profound dystopic sci-fi films La Jetee by Chris Marker and its cinematic progeny, Twelve Monkeys by Terry Gilliam.Exceptional cinematography from Mr. Gordon Willis, inserting those faux-newsreel footage with the real ones are just cunning and way ahead of its time. The soundtrack with those uproarious songs such as \"Leonard the Lizard,\" \"Doin' the Chameleon,\" \"Chameleon Days\" by Dick Hyman blends in as well and passes of a genuine thing of having made in pre WW-Two.This film is a convergence of Mr. Allen's brilliance of different skills sets that showcases his mastery of the cinematic medium: directing, acting (the most iconic Woody Allen on display here), and writing.Only criticism that can be thrown in this film is that it would have been better if it ended at the halfway mark, the point where Zelig mutters that pancakes quote under a hypnotic trance. That definite quote already hit the bull's-eye. The pay-off ended already there, sad to say.My rating: A-flat.",
            "review_date": "2018-03-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody's Take on Conformity.",
            "content": "The whole deal with conformity is that it's a balancing act in which you walk a tightrope. Too much of it and you fall off one side; too little and you fall off the other. Like water, conformity is a prerequisite to social life but it must be kept within bounds. A soothing shower, yes. A raging flood, no. Wait. I think I was just swept away by one too many analogies. \"Zelig\" is Woody Allen's illustration of what can happen when you have too much of a good thing. The time is the 1920s. His character, Zelig, has the capacity to not just blend in with, but physically resemble any group he associates with. We see glimpses of him as an Indian chief, a member of a Mariachi band, a Black Shirt supporting Hitler, that sort of thing. He also frisks around with William Randolph Hearst, Charlie Chaplin, and Jimmy Walker -- thanks to some highly skilled process work and editing.Finally he winds up in a psychiatric hospital under the care of Dr. Eudora Fletcher, played by Mia Farrow. (In the hospital, Zelig assumes the role of psychiatrist and begins writing books on \"delusional paranoia\" and giving lectures on masturbation.) Fletcher finally cures him and the two become a famous couple and finally marry. Zelig is now able to voice his own dissenting opinions. He even begins a physical fight with one physician who remarks that it's a nice day.Then Zelig begins to pay the price of a relatively normal man who achieves celebrity. Single mothers come out of the woodwork claiming that he's the father of their children. The public turns against him. His Hollywood career is in tatters. So he disappears.Fletcher tracks him down to Berlin and rescues his from the Nazi gang he's joined and they make a perilous escape by airplane. Fletcher is the pilot and Zelig has never flown before, but he assumes her aviatrix identity and when she loses consciousness he establishes a world's record for flying across the Atlantic upside down. They live happily ever after although, on his deathbed, Zelig expresses regret that he's been reading \"Moby Dick\" and now won't be able to see how it turns out.And so it goes, full of Woody Allen's adult-oriented jokes and sight gags in this meandering tale of a man who wanted to be like everybody else. I said his gags were adult oriented for a reason. The level of cultural literacy that we can take for granted seems to have undergone a cataclysmic collapse over the past few decades. I'm not sure how many youngsters will recognize an allusion to \"Moby Dick.\" I mean, not the heavy metal band. I'm not even certain that they wouldn't have to really REACH for Adolf Hitler. Those who get it, who get the whole issue of the limits of conformity, will find it rewarding. And conformity really IS a perennial social question, if a little banal after its treatment by French intellectuals. Just yesterday I wore a toga picta to work at the bank and -- well, you'd be surprised.Oh, and the movie gives Woody a good chance to use his favorite 1920s tunes as a score.",
            "review_date": "2009-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Citizen Puzzle",
            "content": "This is a great experience, oscillating between pure woody allen territory and serious film ideas that woody places before absolutely every one of his films, even the failed ones.Here he places himself apparently in the middle of the narrative exploration that Welles started with Kane. But only apparently. In Kane, we had several views of the same story, in that case the story was the life of a man. Each view was from the direct perspective of a specific narrator (newsreel, ex-wife, best friend...). It broke a lot of rules and, together with Toland/Welles' impressive visual work, it changed the course of cinema, we all know.This Zelig also uses visual elements from apparently different sources to put up a story. It also teams up one of the best cinematographers ever, whose pairing with Allen produced a number of unsurpassed quality films (including the incredibly moving Manhattan, disparaged by Woody himself!). The story here is also the life of a man. And that life is also heavily self-biographical to its author/actor.But something is fundamentally different. Each different medium, each different visual language is here to show us some insight on one story. Every bit completes the others, it never competes with them. So the narrative strategy is that we the narrator (one single narrator) is (apparently) collaborating with the audience to show them the story he proposed to tell. That's why the fake documentary form fits perfectly. We are given every sort of ordinary TV documentary tricks, from testimonies of witnesses now old to bits of newsreels \"from the 20'\". Visually it's well stitched together, and i admit it was probably very hard to keep the pace of such a film, because this form is fitted for real stories, where the interest of wanting to know the thing makes you want to keep on watching. But this is well put together.Whenever we deviate from the rules Woody established for this film, we are on his grounds of comedy. Of all the bits, the white room sessions with Mia Farrow are the funniest, also because we step out of fiction and see Woody's personal passion in those days.My opinion: 4/5http://www.7eyes.wordpress.com",
            "review_date": "2010-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A unique film from Woody Allen",
            "content": "Unlike \"Take the Money and Run\" and \"Husbands and Wives\" -- to choose two Allen films from opposite ends of the spectrum that also use the trappings of the documentary form -- \"Zelig\" could actually pass for one thanks to the care that was taken in bringing it to the screen. While it can be outlandish at times (e.g. when Zelig is given an experimental drug that literally drives him up a wall), the narration is spoken with such deadpan sincerity that you have no choice but to swallow it. The contemporary interviews also help in this regard (a device that was later employed in \"Sweet and Lowdown,\" also to good effect).It's no wonder Gordon Willis's fine cinematography was nominated for an Academy Award. In fact, the whole film is carried off so well -- and the documentary aspects so convincing -- that it possibly obscures Allen's achievements as writer and director. (No matter; he would be recognized for both the following year with \"Broadway Danny Rose.\") And his acting is also frequently overlooked. The scene where, under hypnosis, Zelig reveals that he hates Dr. Fletcher's pancakes is wonderful.",
            "review_date": "2002-02-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Praise",
            "content": "Great movie that uses humor and empathy to delve into the individual's need to belong and society's love of anything it deems a \"freak\".",
            "review_date": "1998-09-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "10 stars",
            "content": "Not only a truly fun movie to watch but a movie to think of too. This movie explores with accurate-to-reality descriptions one major theme of both sociology and psychology: how one man identifies himself in relation to others and himself.\nYou can even learn some bits of history (of the pet historical era of Woody Alen, of course).\nImpecably crafted this movie immerses you in the world of the psychological and sociological probles of its main character.\nSo, prepare yourselves for 79 minutes of both laughter and thought - even of contemplation.",
            "review_date": "2020-04-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Boring, repetitive, seemingly interminable film",
            "content": "I felt trapped in this film, and to me it was a misery to sit through. It's 80 minutes of the exact same gimmick repeated ad nauseum, a gimmick that the audience \"gets\" in the first 5 or 10 minutes, and then we are ready to move on to another joke. But no other joke is forthcoming -- it's just an endless, mind-numbing repetition of the exact same thing, a joke that wasn't that funny (to me) to begin with. If the fact that certain people are social chameleons is news to some people, then those people may, perhaps, enjoy this film. Otherwise, I'd admonish: Stay away.I personally advise skipping this film. In my opinion, it's a one-note film based on a joke that isn't funny even the first time you hear it.",
            "review_date": "2006-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I definitely enjoyed watching this little movie.",
            "content": "\"Zelig\" is a fake documentary done by Woody Allen, which is set mostly in the '20's and '30's of the last century, about a man who is known as the human chameleon because he can transform himself psychically into every person that gets close to him. It's of course a real silly concept and it's also a quite quirky movie, though you can probably still believe this is something serious when you fall into it because it is done that well.Because the fake documentary is set for most part in the '20's and '30's it also uses camera's and techniques from those days. I was really impressed with how the movie looked and at times I was really confused about whether I was watching some original stock footage back from those days or some newly shot footage done by Woody Allen and crew. It's definitely great that they used some of the actual techniques available at the time and did not just used some editing tricks to make the movie look old. It's also really great that the cinematography for this movie got actually nominated for an Acadamy Award, as was its costume design, which also really seemed to fit the time period it was trying to re-create.They also did quite a great job with blending in the actors with some of the original stock-footage. We see Woody Allen for instance hanging around with Charlie Chaplin and even Adolf Hitler at one point. I remember it actually being a big thing back in 1994 when \"Forrest Gump\" came out and people being amazed by seeing Tom Hanks shaking hand with John F. Kennedy for instance but it just seems that those techniques were already available way back earlier.Even though the movie is of course a comedy it got made as a straight and serious one. It makes the subtle humor work out all the more great. The movie does not attempt too hard to make you laugh out loud and is instead more constantly funny through some of its ridicules moments and witty dialog. A great trick Allen also used was every now and then also putting in some 'modern' scenes with the elderly characters within this movie, reciting some of the events. It breaks the movie and I'm not sure if the movie would had been all that good to watch if it had entirely been done in '20's and '30's style, from start till finish.It's one of those unusual and somewhat more experimental movies of which I say it works out well but at the same time I'm thinking what is the point of it all. Yes, I was surely entertained and also somewhat impressed but at the end I did not feel as if I had just seen a great movie. It's somewhat of a perfect in-between movie to watch and you'll surely have a good time watching it and it luckily also isn't too long. It's definitely not a must-see and a movie you can easily do without ever seeing but nevertheless you will still have a good time when you catch it on somewhere.7/10http://bobafett1138.blogspot.com/",
            "review_date": "2010-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great, Though Not Allen's Best",
            "content": "\"Documentary\" about a man who can look and act like whoever he's around, and meets various famous people.I found this film clever and the filming techniques are inspired, but it is far from Woody Allen's best. The joke wears out about 45 minutes in, so even with a brief 80 minute run time, it is more than necessary. Strangely, they filmed an interview with Lillian Gish but did not include it. That is probably the film's biggest fail -- Gish would have stepped this up one more notch.This also happens to be one of the few Allen films my library does not carry. Not sure what exactly that implies... draw your own conclusions.",
            "review_date": "2011-05-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "not funny to me",
            "content": "During the 20's, Leonard Zelig (Woody Allen) becomes a popular sensation. He's an unassuming person who seems to fit into any situation. He is taken to a mental hospital where he's misdiagnosed. Dr. Eudora Fletcher (Mia Farrow) is more compelled by the new patient and diagnose him as a \"human chameleon\". She treats him as his fame grows. Then he disappears and resurfaces in Nazi pre-war Germany.I don't get it. It's definitely not funny to me. Woody Allen creates a faux documentary using the old fashion style. It's an intriguing idea but with no voice, Zelig is a mystery. He is not compelling. I can't get a handle on the character. This could be an intriguing drama but there is not a single laugh or even a single smirk.",
            "review_date": "2016-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "that previous comment about this not being funny is dead wrong",
            "content": "This is purely my opinion - I doubt too many people would agree with me. But, IMHO, \"Zelig\" is Woody Allen's funniest film. I realize most folks would say that either \"Sleeper\" or \"Bananas\" or \"Annie Hall\" or \"Take the Money and Run\" or \"Hannah and Her Sisters\" is his funniest, but I liked \"Zelig\" best. I loved all the sight gags (especially when Leonard Zelig, surrounded by 250-pound men, starts expanding himself), but the best scene is when Zelig is under hypnosis.Anyway, you're welcome to yell at me, declaring how ignorant I am to have laughed more at \"Zelig\" than \"Annie Hall\", but this is just my opinion. Rent \"Zelig\" for some good laughs.",
            "review_date": "2001-08-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zelig, The human chameleon",
            "content": "Once again Woody Allen decides to take a potshot at Warren Beatty the man who had an dalliance with Allen's former lover Diane Keaton.Zelig is a mockumentary. Whereas Beatty's Reds was a film about idealistic Americans during the Russian Revolution in a documentary framework, this treads a similar path with comedic effect.Woody Allen plays Leonard Zelig, a human chameleon who assimilates with the people around him. It was observed in a swanky Long Island party where F Scott Fitzgerald was present. Zelig spoke with a posh accent with fellow guests and was a Republican, later he was found downstairs in the house with the servants using more coarser dialect where he was a Democrat.In fact Zelig can not only take on the traits of the people around him he can even change colour so he looks and peaks Chinese when he is with Chinese people.Zelig's condition sends the medical world in a frenzy and psychiatrist Dr Eudora Fletcher (Mia Farrow) is determined to cure his personality disorder. Eventually Zelig is cured and he and Eudora fall in love.Allen's film which is mostly in black and white also successfully integrated the concept of splicing characters into old footage such as Zelig sitting behind Hitler in a rally but really they are well staged re-enactments. This concept became popular in adverts and films such as Forrest Gump.Allen has fun with the 1920s setting with songs from the era but it also comes across as rather flat emotionally and a one joke film. The film will give you a few smirks and make you marvel at its cleverness.",
            "review_date": "2017-07-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Convincing and always charming",
            "content": "The execution of this idea is perfect: creating an old newsreel of a strange story comes out perfect - Woody Allen, a loving fanatic of the roaring 20's, decides to create himself his own roaring 20's story. And here the idea is out of this world - a human chameleon which can change appearance according to whoever is around him. Of course he does this with his usual style, and he never fails to make the audience laugh their guts out. Magnificent integration of actual footage and made-up film, this is the definition of mockumentary, even interviewing people from the present to talk about the past. Early Allen genius, it is only a pity that he hasn't tried doing something like this ever since.",
            "review_date": "2002-10-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Be yourself",
            "content": "Woody Allen plays Leonard Zelig, a human chameleon who becomes the person he's with.He can be black, Native American, a shrink, even a Nazi.People go nuts about Zelig in the 1920's.Mia Farrow is his doctor Eudora Fletcher who tries to cure him. Zelig (1983) is made to look like a documentary.There are people like Susan Sontag and Saul Bellow talking about the man named Zelig.Some real people from the history are seen in footage of the film.You can see Charles Chaplin, William Randolph Hearst, Marion Davies, Josephine Baker, Marie Dressler, Al Capone, Lou Gehrig, Carole Lombard, Adolphe Menjou and one Antichristus.Zelig is not so much of an extremely funny film as it is fascinating.The main character becomes all these other people because he wants to be liked.The message of the film is-obviously-be yourself.Don't be everybody else the way Zelig is.",
            "review_date": "2006-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody Allen's Mockumentary",
            "content": "After scoring big with \"Annie Hall\" and \"Manhattan,\" Woody Allen had a bit of a dry run in the early 1980s with the forgettable \"Stardust Memories\" and \"A Midsummer Night's Sex Comedy.\" \"Zelig\" found him back on track, and feels like a return to the screwball hijinks of his early 1970s films.Allen films \"Zelig\" as a documentary, and takes as his subject the life of a man who is able to blend in with his surroundings. Allen himself plays Zelig, and keeps everything -- both his performance and the film's tone -- utterly deadpan. There are a ton of funny one-liners and sight gags, but they're played completely straight.\"Zelig\" isn't one of Allen's most ambitious films, but it's very funny and is many times better than most of the movies he's making today.Grade: A-",
            "review_date": "2008-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Do the chameleon!",
            "content": "\"Zelig\" is, without a doubt, one of Woody Allen's greatest and cleverest films. The fake documentary about 'the chameleon man' takes places in the jazz era in the 1930's and counts with great acting by Woody himself and Mia Farrow, who plays Dr. Fletcher, a psychiatrist that will take a great part in Zelig's life. Filmed in black and white and showing many fake interviews, the \"documentary\" shows many of Woody's greatest jokes and one-liners, and it's completely amusing. If you have the chance, don't miss it. In my opinion, it deserves four stars out of four.",
            "review_date": "2003-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zelig: 6/10",
            "content": "Before I begin the review, I want to say that I love Woody Allen and his style of comedy. I really enjoyed his most recent, Hollywood Ending. But this one didn't have as many laughs as his other ones.Allen plays Leonard Zelig, a \"human chameleon\". He can change his appearance to whatever his surroundings are. I enjoy this type of \"fantasy\" movie (like Purple Rose of Cairo, but I didn't like the documentary style in which it was brought to us in.Mia Farrow plays a psychiatrist who tries to \"wean\" Leonard off of his changing ways by giving him more self-confidence. He changes because he wants to fit in with everybody else.I didn't find it too funny, but there were a couple scenes (like the pair of Siamese twins, for example), that cracked me up. I liked how Allen took old news reels and transfixed himself in it (I love the Hitler scene). It would be used almost 20 years later in Kung Pow!.I believed Farrow's and Allen's romance, because he didn't seem to be double her age. As I've said before, the documentary style is nice, but I didn't like it. If it had played in \"real movie format\", it would have been better.Also, the movie laster about 80 minutes, yet it still seemed too long. The droll of the narrator, and the \"historians\", droned on and on. The plot I liked a lot, but if they didn't do it in a documentary style, it would have been nicer.Don't get me wrong, I liked this film a lot. There just weren't too many laughs. I enjoyed the fantasy part of the film a lot, and that's what's earned it it's 6.My rating: 6/10Rated PG. (I didn't hear anything objectional)",
            "review_date": "2002-10-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Portrait of a deep psychological crisis.",
            "content": "*Spoilers possibly.*ZELIG is the story of a man with the ability to assume the social identity of those around him. In the film, Zelig is the child of a religious Jewish household, one whose values he rejects. Having done that, he has lost his psychological anchor and is a man without a personality, and so he \"borrows\" the group persona of whatever society he is in. Professor Neil Postman, in reference to the film, calls the character the ultimate \"other-directed man,\" in contrast to a person being self-directed.As nature abhors a vacuum, so does Zelig's ego. This comedy has at its heart the frightening image of a man who not only lacks direction in life, but everything that makes-up what we call individuality. He is the very icon of the ultimate Yes-Man, ready and able to obliterate himself for the group.A great film-paradox: comedy blooming from tragedy.",
            "review_date": "2004-03-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It Defines \"Unique\" !",
            "content": "Another great movie from the once-great Woody Allen. It's layered when it comes to the reasons of singularity.It's a story of one gifted human who doesn't work well with people. His abnormal power, which's also unmatched sickness (looking and acting like whoever he's around), comes from his sole desire to fit in, and be loved. This is a delicate wonderful subject, as the problem of every special person, in a fantasy/superpower movie. The script is no less unique; since it follows the story seriously and comically in the same time, without losing any merit of both.The thing about Allen is that he doesn't stop at handling the lead's power/problem as yet another Jew's calamity. He rises above it, to make a more human concerned movie in which the main point is the talented' calamity, and that's exactly what makes Allen's work international before being long-lived as well.The way of making the whole matter as mockumentary, a very early one by the way, gave the movie a distinct form and a realistic flavor. Furthermore, selecting taking place during the 1920s served Allen's satire about America in such an age where people longed for any heroes, enabling him to mock freely at the period's everything (songs, movies, news reels, etc). He succeeded also at saying all what he wanted around the period, and his movie itself, through the opinions of his fake documentary's guests; this is a dream of every talkative worry artist comes true, and so smartly; without alienating the viewers, or causing a feeling of something extra.The quality of the image is ahead of its time. Now I know that (Forrest Gump - 1994) isn't the first movie to mix new image in old ones. 11 years before it, there was (Zelig), however without the computer's magic. The way that this movie resembles the old movie's looks is fascinating. I believed it in many times to be an old one itself. Not to mention how the moves of the characters, in the pseudo-news films, seem outrageously like what we watch in the oldies; recall how every man behind the one who talks in the microphone whispers, in unexplained sullen features, to the other, with what we don't hear!The romantic core of it is solid. It even has a crazy adventure as a big finish where Zelig flies over the Atlantic, beating the Nazis, rescuing his love, and returning home as a glorified hero. I only hated that the movie didn't care of filming that in a *real* fair climactic sequence. But I loved how when the lead didn't find someone beside him, he went to destroy the world (with Hitler). And the meaning that the drama propounds at last got me utterly: \"You don't need the acceptance of the whole world, just the one of a woman who loves you\". Re-watch this movie again, then compare it with what Allen makes lately, to know what the \"once great\" remark in the start is all about.(Zelig) defines the unique person, and the unique movie too.",
            "review_date": "2010-10-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cinema Omnivore - Zelig (1983) 7.4/10",
            "content": "\"Structure-wise, the whole pseudo-documentary format is devised with the full treatment, like Bob Fosse's raw and edgy biopic LENNY (1974). Apart from punctiliously coaxed archival footage, retro-style home videos, Allen also uses real-life personages and actors (who play the fictional characters) to give their candid interviews of the subject, you almost believe what they say if the words are spoken from Susan Sontag or Saul Bellow, among other authority figures.\"read my full review on my blog: cinema omnivore, thanks.",
            "review_date": "2021-04-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Personality of an Era",
            "content": "Zelig [1983] is undoubtedly one of Woody Allen's finest works. Coming shortly after and maintaining the brilliance that Manhattan [1979] and Annie Hall [1977] shared with us, Woody's writing and directing in Zelig makes it perhaps his best work. Taking on documentary fashion, this mockumentary seeks to comment on a man with a dissociative identity disorder, or as the movie calls him, a chameleon. The mental illness or perhaps genius of the man is his ability to take on characteristics of those around him. Woody presses this to the extreme as we see Zelig transformed from a baseball player to a mobster to a black musician even to a Native American. Leave it up to his comedic routine to establish a connection with satire and cultural stereotypes.Nominated for cinematography and costume design, one can see and breathe the Jazz Age. We hear the chameleon song and see a movie made after him. The social commentary sets in as he is treated by a doctor played by Mia Farrow. She can't seem to break him as he soon assimilates the role of doctor. After much turmoil, she assumes the role of patient, which sends Zelig into his own role as patient. Of course, there is nothing there, as his world crashes down on him. He then starts on about some Freudian childhood memories, and she can begin to treat him.Dare I say that this is Woody's greatest commentary on the social condition? He seeks to describe not just the whirlwind that is mental illness, but carries it all the way to the personality that is an era, and the effect it has on man. I have to be honest here and say that I too fell victim to being a chameleon. Growing up in a military family and moving around a lot, I became well versed in the ways of getting new friends to like me and assuming my role in the new culture. The next question takes us back to the patient-doctor situation, where Zelig assumes the role of doctor, and the doctor the role of patient. If being a chameleon is bad, then how does one not fall entrapped when one seeks to remedy the cause at its root, by becoming the identity of another, for surely all are somewhat something that they are not, and one cannot cure everyone? Woody drives home his doctrine that bending to the opinions of others makes one a fascist, as we see Zelig become a fascist Nazi, literally lost in the masses. Escaping death, Zelig uses his disability as genius to become a pilot, and flies a plane across the Atlantic upside down. We may not always know everything, but if we use our talents and creativity to inspire us, there is little we cannot do. At the end of the movie, Zelig is seemingly cured and lives happily ever after, married to his doctor. The ending goes on to talk of love, and how it can shine a light in our own lives to help us find our own identity.",
            "review_date": "2011-08-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "THIS is why we love movies!",
            "content": "There's something of a chameleon in all of us when we enter a movie theatre or sit in front of the TV.  We leave ourselves behind and hope to enter the life of someone else and proverbially walk in his or her shoes for two hours.  We also go to see visions we've never seen before and to perhaps feel an overwhelming enchantment with the magic of cinema.  `How did they do that?' we say \u0096 or an even more exciting question is `How did they think of that??' Ultimately, it is the imagination behind the magic than the slight of hand itself that becomes ingrained in our consciousness.Woody Allen has always been a master of absurd ingenuity, from dubbing over a Japanese pulp thriller with a ludicrous plot involving an egg salad recipe (What's Up Tiger Lily?) to creating a film where a character in a movie walks off the screen (The Purple Rose of Cairo).  But this film takes the cake!  There's social satire (of Warren Beatty's film `Reds' as well as the social pundits he chose: all with their tongues firmly in cheek).  There's an AMAZING array of 1920s-1930s footage that not only is choked full of some of the most influential people of the twentieth century, it also contains a lots of footage of the streets and the popular forms of entertainment of the day -including a wild variety of songs.  There's footage of Woody himself standing in frame with these influential people (including Hitler!), blending in so naturally that you have to do a double take each time to figure out what's `real' and what isn't.  And then, in between gasps of awe and spasms of laughter, the most profound bits of magic shine through.  You care about this guy.  You ARE this guy, and he is you.  The most human vulnerabilities of feeling like an outsider (like fears of not fitting in or of not being liked) rise within your own memories. Also, your desires to be like those beautiful ghosts on the silver screen.  To be glamourous, graceful, heroic, funny, not to mention (at least temporarily) black, Asian, Indian, or a notorious gangster or a jazz musician.  Who wouldn't want to hang out with Charlie Chaplin at Hearst Castle, or stand next to the Pope as he delivers his Easter Sunday sermon?  That's why we go to movies, to be there.  To be everyone and everything and retain just a bit of it in our daily lives to add dimension to our own \u0091character'.  Sometimes we retain some of the lingo, or perhaps a hairstyle or an `attitude', or maybe if the film is powerful enough, we even find a bit of personal bravery to fight through the hard times we're having.  No wonder Leonard Zelig is a hero! He's a composite of all we'd secretly desire to be.I also think of Zelig as an analogy of America, with its constant demand to assimilate yet its wonderful contradictory stubbornness in retaining individuality.  We are a generic society, but we still celebrate the pioneer spirit and the rebel.  We may be infested with shopping malls and advertising, but we will always retain our true spirit as long as we have jazz and rock and roll, and cinema icons like Woody Allen.  Yep, Woody is a rebel, as much as Jim Morrison or James Dean because he supplies us with the adventure of imagination.  I've been a Woody Allen fan for thirty-four years, even though I must admit there are only a few films of his that I've liked in the past thirteen years.  But I think he's more than made up for it with his ingenuity, and with his ability to fuse into our vulnerabilities and liberate us from them.  I hope one day they put on a ticker-tape parade for Woody.  If anyone deserves it, it's the Woodman!",
            "review_date": "2003-05-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Memoirs of a Chameleon",
            "content": "This is a masterfully done film, presented in documentary format (though entirely fictional). Allen plays a man, Leonard Zelig, who can morph into virtually any character, depending on his immediate environment. We are treated to newsreel footage as this character achieves world prominence as a true chameleon. I was greatly intrigued by the premise, but somehow, the story wasn't terribly interesting to me. Allen needs to be complimented for his great reach. It has some hilarious moments, but also has a harsher, deeper side. I guess this is what makes Woody Allen's milieu so impressive. See it for its dynamic effort to create a great character.",
            "review_date": "2014-07-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A little quirky",
            "content": "Zelig is a pretty strange movie. While parts of it are clever, I think only die-hard Woody Allen fans are going to like this one. It's filmed as a mockumentary, which in itself is a very tricky genre to master.Woody Allen plays the title character, and Mia Farrow, his at-the-time sweetie pie, plays his psychiatrist. Woody has become a celebrity because he acts as a human chameleon and mimics anyone he comes in contact with. Sometimes the film uses stock footage of real historical figures, like Lou Gehrig, F. Scott Fitzgerald, Babe Ruth, Charles Lindbergh, Charlie Chaplin, and others. Mia interviews and observes Woody, trying to understand his condition through various methods. Parts of it are cute, parts of it are funny, but parts of it get a little long in the tooth. If you love Woody and want to watch all thirteen of the movies he made with Mia, go ahead and rent Zelig. As long as you expect it to be quirky, you'll know what you're in for.",
            "review_date": "2017-09-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One joke comedy - but at least a good joke.",
            "content": "A mock (old school) black and white documentary about a man (Zelig) that can adapt his appearance and manners according to his location.\nAnother one of these \"two in morning\" movies, that only Allen actually gets made. This is the kind of stuff that works best on the small screen and preferably very late at night. Sadly it has nothing to do apart from repeat its one joke over and over again, until you are sick to death of it.\n(Not that some parts are not funny - the Nazi rally scene is a hoot.)Good support from Mia Farrow as the psychiatrist that Allen falls in love with, but this plays like an amusing Saturday Night Live sketch dragged out to cover a whole movie. It should also be noted that the technique also allows for shoddy production values that probably helped make the thing a tad cheaper too.Not a total stinker - but hardly worth paying money for.",
            "review_date": "2003-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody portrays Leonard Zelig, a human 'chameleon.'",
            "content": "Woody's funniest & most imaginative film.  I you haven't seen it, you're missing out.  Like \"FORREST GUMP\" a decade later, the star is placed into historical films and reenactments - without the digital technology.One of those films a writer looks at and says \"Wish I had thought of that!\" Great dialogue and situations.",
            "review_date": "2001-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Chameleonard",
            "content": "\"Zelig\" is a film from the United States that is almost exclusively in the English language, even if it says German language as well on the imdb page, but the inclusion of that, namely my language, is almost non-existent in here. I already forgot where this was included, probably just two or three sentences or words. This is from the year 1983, so definitely not among Woody Allen's oldest works, but also not really recent anymore at almost 40 years now. There I already mentioned the writer and director and he was still under the age of 50 when he made this. Of course, he also plays the title character in here. It is a very short film without being an actual short film, but this one here stays under the 80-minute mark. You can certainly call it a documentary spoof or mockumentary as some say today as well. The one thing Allen is maybe most known for is how he always managed to reinvent himself, to bring something new to the table that was not totally mainstream or only became mainstream after he did it first. The latter is probably not even true for this film here. I cannot really think of other films and filmmakers that took a similar approach. I know here in Germany, Olli Dittrich, one of my country's most famous comedians, occasionally does half-hour formats in which he becomes a new character and there is elaboration on what this character does and why he deserves such a format. Usually, there is a connection to contemporary or historic events, but even there we have a crucial difference, namely that Dittrich (in character) is interviewed most of the time and here this is not the case. There are no interviews at all with Zelig (Allen), but all the ones interviewed play or played a crucial role in Zelig's life, accompanied him for a little while or even for a long time. The best example is the character of Dr. Eudora Nesbitt Fletcher. She is portrayed by Mia Farrow and Farrow and Allen were a couple at that point already and her fling with Frank Sinatra was long over. There is talk about how Farrow's character in here is not particularly on the attractive side, but I would kinda disagree. The actress' great looks were difficult to hide, even if they tried their best with hair and makeup.But the star here is Allen and nobody else. They did all they could really to use old photos of him, editing software etc. To create this fictitious character of Leonard Zelig. There is not even too much to say about his background. The medical sensation he is can be summarized in one sentence, namely that he is able to physically adapt to his surroundings and the people that are in his company at that point. This resulted also in a few scenes that politically correct people may criticize today and see as stereotypical or even racist. We have Allen basically become a Black man, we see him as an Asian and we also see him as an Indian. These are perhaps the three key groups included in here with which people might have a difficult time. Oh yeah, Mexicans too later on if I remember correctly. I personally don't see it as so bad to be honest. To some extent, political correctness is really the death of all humor if everybody is offended so quickly, but this is a sad state of affairs and nothing desirable that we should be aiming at. Too bad many people cannot understand it. The good news is that Allen in this short mockumentary pretty much insults everybody, so it is almost a South Park approach if you wanna call it that. If everybody gets their fair share, then those who feel discriminated against do not really have anybody to turn to anymore because everybody can say as a response that he also did it to them. I think you get the point. What I have not mentioned yet is that this film scored some really strong awards recognition back in the day. Good for Woody again. Oscar nominations happened with the film's cinematography and costume design. It lost both to a Bergman movie, but nominations alone for a film with such a concept like this one are big enough triumphs already. Definitely unconventional. The BAFTAs loved it even more and handed it more than just two nominations, including one for screenplay, even if there it also did not manage to win a category. But it is all good, Woody probably didn't care anyway. The film scored a handful minor wins on other occasions. I am pretty sure the Oscars and BAFTAs today in 2022 would whine about discrimination instead of nominating a film like this, but oh well. That's why I am glad it got made back then.What exactly you find funny here will all come down to your personal taste. However, you will probably smile a lot as a consequence of the creativity of it all as the story continues in a very chronological manner. I laughed ten times at least, maybe more often and I am also glad that Allen did not feel the need to stretch the film as much as possible and feel obliged to turn it into a 1.5-hour movie or so. It is right the way it is. One of my favorite scenes was when we hear how Allen's character turned into an Irishman on one occasion with red hair and green clothes on all of a sudden. There is no photo of that the way there is on many other occasions, but the mere verbal description was already enough to make me laugh and I was not the only one in the audience who liked it. The room was rather small, but there were still roughly ten people in there and I am glad I went and was one of them, even if this is probably a film that can also be watched on a small television or laptop screen and the experience will not be any worse. The important or recommended thing is that you watch the film. Many worse ways to spend 80 minutes. It is never really anything other than a comedy film, but here and there it is also worth seeing for its slightly more dramatic moments. I am not talking about the escalation with the bullfighter and what happened to him and a few others, but for example the moment when Zelig sits there on a chair and we hear that he basically has no life of his own and is just exploited for being a freak.Or of course the moment when Farrow's character, who also becomes Zelig's love interest eventually, there during therapy sessions admits to him that she is not a doctor herself and he as a consequence adapts and tells her he is not a doctor himself either. All this after he would not admit it under any circumstances. Adapting is the key again to getting him to open up, to relax and also to finally successfully hpnotize him. But before that in this recorded session there was also one of my favorite moments, namely when Allen's character talks about cashing in big style with patients who are Siamese twins with personality disorder. The crowd loved it. Certainly one of the funniest writing moments from the film and it was also in general nice to see how Allen there basically reflected the actions and behavior of Farrow's character. It was also funny how he identified the guy filming in the room. There was a slight parallel to a scene from almost the ending when we understand that Zelig (very absurd given his religious background) had joined the Nazis and was relatively close to Hitler and then during a speech he saw Farrow's character and remembered and recognized her and waved at her and basically destroyed a racist joke Hitler was about to tell. What ensued was a chase scene with gunfire that we find about through words rather than video footage, but that is okay. I mean it was the 1930s in this film then. Zelig is also not interviewed, to get back to the beginning of my review, because he was no longer alive when this movie got made. But Fletcher was and she (as an old woman now) shares her memories. They even interviewed a Nazi official, which was kinda hilarious because that guy probably never would have agreed to be a part of this. Unless maybe he completely understood how wrong he was back then, how wrong everybody else in Germany was. But yeah, the idea of Zelig having moved to Germany to perfectly blend in with the almost unstoppable movement there made sense story-wise, even if initially I felt that perhaps it was one twist too many, but I changed my opinion because they really did not milk this German cow for 15 minutes or more, but it was really just the one scene in which Zelig ruined Hitler's speech and as a consequence the two lovebirds were united again. So it was all good.Overall, the majority of inclusions and scenes from this film worked out nicely thanks to Allen's writing and great attention to detail and just general creative mind. Of course, you can never say how well certain scenes and references age. For example, one aspect that did not do too much for me was the elaboration on how Zelig's life got turned into a movie relatively quickly. Or when there is talk about all his wives and how he got some of them pregnant when he was basically putting other personalities on display. Can you call it a multiple personality disorder? Maybe. There is not really one term for it. Let's not forget that it is all fictitious. But even these slightly inferior segments resulted in laughs, like when he apologizes to one man for taking out his appendix. Oh yeah, another scene I liked was the interview with the female protagonist's mother because it did go exactly the opposite as planned by the film crew. This is pretty much it then overall. I thought this was an enjoyable little flick. Nothing truly outstanding or defining, but a creative idea executed with precision and I applaud Woody for it. We don't really have filmmakers like him nowadays and I could not care less about his personal life. Forgive me for not elaborating in detail anymore on other cast members except Allen and Farrow. There are some prolific actors in here, but not really any big names. Maybe Michael Jeter some will recognize. This film I would call decent overall, but it is definitely closer to being great than to being weak. The thumbs-up and positive recommendation were never in doubt. Go see it!",
            "review_date": "2022-12-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrific concept, great effects, lackluster final product.",
            "content": "This movie looks and feels just like a real documentary. Real 1920's newsreel footage (into which Woody Allen has been seamlessly inserted) is impossible to tell from the faux-footage Mr. Allen filmed himself. Scenes from the fake 1935 movie telling the Leonard Zelig story, which are shown periodically throughout the film, not only look like a film of that era, but are written and acted as such as well. And interviews with real experts, on the fictional character of Zelig, complete the effect quite nicely. There can be no doubt that this movie looks terrific. But the problem lies in the content.Leonard Zelig, the human chameleon, is a fascinating character. But someone besides Woody Allen should have played him. Mr. Allen is (or can be) a brilliant writer/director, but his range as an actor is limited. And so, though we see plenty of brilliantly done, authentic-looking footage, photos, etc. of Leonard Zelig blending in with his surroundings, we hardly ever see him interact in those surroundings. The pictures and clips of Woody Allen as a rabbi, a fat person, a Nazi, etc. are amusing, but they are not substantial. We are told that he is able, not only to look like those around him, but to converse like them to. But the only time we see him do this is when he's playing a psychiatrist: no stretch for Mr. Allen, who discusses psychoanalysis in many of his films (though usually from the recipient's point-of-view). And so the only time we actually hear from Zelig is when Dr. Eudora Fletcher puts him into a trance, at which time he has no personality of his own. It's a shame; he's such a fascinating character, but the only way we really know he's a fascinating character is because we are told so by others. In lieu of scenes that help us get to know the characters personally, we are given narration and talking heads. This is not the way to make any film, not even a documentary.When it comes to Woody Allen mockumentaries, I much prefer Take the Money and Run. It's not as researched and authentic-looking as Zelig, but it's far funnier, and far more engaging.",
            "review_date": "2004-06-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Doing the chameleon with Woody Allen",
            "content": "Insecure nobody zhlub Leonard Zelig (Woody Allen, who's perfect in a tailor-made part that makes clever use of his neurotic persona) possesses the remarkable ability to transform into other people who he comes in contact with. It's up to dedicated psychotherapist Dr. Eudora Fletcher (a charming portrayal by Mia Farrow) to figure out a way to cure Zelig's peculiar affliction.Allen ingeniously uses the inspired faux documentary format as a witty and perceptive means of presenting a surprisingly profound and often quite funny cinematic meditation on identity, conformity, and man's basic need to fit in somehow and somewhere in order to be liked and accepted by others. Moreover, Allen and cinematographer Gordon Willis do a masterful job of capturing the look and feel of a motion picture made back in the roaring 1920's and early 1930's, with Zelig appearing in vintage newsreel footage with such folks as Babe Ruth, Charles Chaplin, Josephine Baker, James Cagney, Calvin Coolidge, and even Adolf Hitler. In addition, it's a hoot to see real-life people including Saul Bellow, Susan Sontag, and Irving Howe all talking about Zelig as if he was an actual person, plus all the stuff about Zelig getting into trouble with the law for marrying various women and having children with said women is simply hilarious. A total treat.",
            "review_date": "2022-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very good idea, but...",
            "content": "First, I am sorry for my english.\nI think it's a very funny and very very original film. But I think it's too longe. It would be better with 45 minutes menos",
            "review_date": "2018-03-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Ultimate Conformist.",
            "content": "I'm starting to think that I've underrated Woody Allen. Sure, he can make some half-hearted stinkers but his good stuff is the best of the best. It's remarkable how he can take this simple surreal idea and have it blossom into a unique experience with a mockumentary style. Not only is it profound and heartfelt, but also hilarious every time Zelig's chameleon-like condition effects him. From the plot line, I thought it was some kind of gimmick, but the fact that it's involuntary and Zelig is played as such a blank and naive slate makes him brilliant and sometimes quite relatable. It touches on one of the greatest social dilemmas of the human condition. Blend in at the expense of personal identity or be opinionated and ostracised? This idea hits the gut. Hard.The cause-and-effect of Zelig's condition is highlighted by its broad stroke documentary style where information is given by a narrator or talking head interviews. Consequences are shown immediately and allows the film in its 70 minutes runtime to explore a vast amount of detail, especially in studying celebrity culture and how icons are embraced then ignored. We only get snippets of Zelig himself which are often Allen delivering sharp punchlines but it's Mia Farrow's involvement that gives it a heart. I usually don't feel too engaged by Allen's romances but this one I really wanted to see them get together. With its technical prowess in its innovation matching its profound ideas and creativity, this is one well-rounded picture and one of Allen's best works.9/10",
            "review_date": "2013-09-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Historical goof in Zelig",
            "content": "In Woody Allen's mockumentary \"Zelig\", a historical error creeps in during the new-shot footage of Leonard Zelig with his psychiatrist, Eudora Fletcher, when they visit with an aviatrix at an airport. In one shot they are walking towards the camera and a pair of fabric-covered wings are seen stacked against a wall in the background. The partial registration number visible on the surface of one wing is N15. If this were the 1930s as the footage purports, the civil registration would have begun NC15. The Bureau of Air Commerce, later the Civil Aeronautics Authority, and then the Civil Aeronautics Administration, would not drop the \"C\" portion of the United States national registration until 1948.",
            "review_date": "2006-02-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody Allen at his funniest best",
            "content": "This must be Woody Allen's most absurd and innovative movies of all. A human chameleon! How did he cook this thing up? You need to be out of your mind to think of something like this.It is a mockumentary on life and times of Leonard Zelig, played by Woody Allen, a conformist to such level that he becomes and assumes the shape of his surroundings. In the company of blacks he becomes black, with greeks he becomes Greek etc. etc. Mia Farrow plays his Psychiatrist whom he falls in love with and so does she with him. Technically it is done so well with all the narration and live footage and with absolute dead pan that you actually believe that you are watching some documentary till of course you realize what exactly is being shown. The scene with Hitler is hilarious and really well done and makes you realize that Forest Gump was not the first movie to try this kind of thing.It is a great satire, it is absurd and it is dead pan.",
            "review_date": "2005-08-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pop Culture goes *pop*",
            "content": "This is an engaging mockumentary about Leonard Zelig (writer/director Woody Allen), the undisputed medical phenomenon of 1929. So serious is his neurological condition, that he will assimilate the physical, mental, and even cultural attributes of whomever with he spends significant time. That's right--around fat people, he gets fat. Around black people, he becomes black. He'll develop a beard and orthodox learning before your eyes if he's around rabbis. The only one who understands, and consequently, fights for him, is the long-suffering Dr. Eudora Nesbitt Fletcher (Mia Farrow), determined to find the cure.It's just a shame that this film didn't win more awards than it actually did, and a near perfect crime that it's not discussed more often than it is. For one thing, it's far and away among Allen's VERY BEST. The textbook subjects that he confronts so well, such as disease and physical yearnings, are present, but are righteously treated as window dressing for the presentation of the story. The insertion of Allen, Farrow, and a cast of their pals (all of whom perform to a T) to the pre-war era is eye-popping, to say the least. As said before, it's a mockumentary executed so nicely that it could make Christopher Guest turn stone with envy. The highly improbable plot is considerably well-handled, leading us to the inevitable comparison that follows.Now, if you run around praising \"Forrest Gump\" (and I KNOW you do), and you haven't seen this, you're really missing it. As fun and briefly interesting as \"Gump\" was, this classic edges past it, for the simple reason that it knows better than to take itself seriously. This is a comedy, start to finish. The gags are gags, and never manipulate. When we feel for Zelig, Eudora, or both, it's real. After all, who HASN'T tried to fit in somewhere? Finally, the ever-changing way in which the public views/treats Zelig through the whole ordeal that was his \"career\" exposes the fickle nature of pop culture, showing it for the joke that it is. This was truly Woody at his finest, in a work that definitely should have a little more admiration.",
            "review_date": "2009-03-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A brilliant magic trick, a successful experiment....but not much of a movie",
            "content": "Technically, \"Zelig\" is brilliant. Others have explained how and why in lengthier terms. It's an ambitious experiment from Woody Allen, who seems to have gone through with it just to prove that he could do it....and he was right. However, it's also one of the last films that I would recommend to someone new to Woody Allen to start with - yes, I consider it more difficult to \"get into\" than \"Interiors\" or \"Stardust Memories\". The main problem is summed up by the movie itself, when the narrator (a magnificently deadpan Patrick Horgan) calls Zelig a \"nonperson\": it's hard to stay interested in a movie where the main character has actually no character (in fact, he barely even speaks) at all, at least in the first half. It's no coincidence that \"Zelig\"'s most enjoyable scenes are those where Woody slips back into his usual persona while Mia Farrow attempts to hypnotize and psychoanalyze him, and throws 2 or 3 (but no more than 5) hilarious lines (my favorite: \"I teach a masturbation class, and if I'm late they start without me!\"). Woody's point (\"Be yourself\") is a valid one, but you'll get it quickly, and then you'll mostly be left to admire the film's technical brilliance. One thing that does shine through is Allen's love for cinema itself. **1/2 out of 4.",
            "review_date": "2012-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One Of Woody Allen's Better Comedies",
            "content": "In this extremely clever \"Mockumentary\", comedian Woody Allen plays fictional character Leonard Zelig, a remarkable man who can fit anywhere in society because he can change his appearance at will.The laughs come fast and furious in this account of Zelig's adventures in the 1920s and 1930s, when he became all the rage and hung out with the likes of Babe Ruth, Al Capone, Fanny Brice, Pope Pius XI, and Adolph Hitler, to name but a few.Woody Allen seamlessly weds old, black and white newsreel footage with his humorous tale, allowing Zelig to be right there in the thick of history.Zelig, from 1983, is a remarkably well-executed Comedy that holds the viewer's rapt attention from start to finish.A big hand goes to Cinematographer Gordon Willis for his painstaking work in this film.",
            "review_date": "2014-05-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gimme my money back",
            "content": "I bought at a flea market 4 movies of Woody Allen at the price of 1. While MANHATTAN was breathtaking and ANNIE HALL was good (I still have to see CRIME AND MISDEMEANORS), for ZELIG Woody Allen takes a pass and decides to make a non-movie.The movie starts with a joke in a documentary style. Mmhhh, quite good I said to myself. OK, the joke wasn't that bad. I then waited for the movie to start. It never did. Minute after minute after minute that documentary style when on and on and on endlessly and that joke was always the same. Somebody help me!What a frustration! In this movie there is no acting.When the end titles came on my DVD player read 71 minutes. How about that? A movie that lasts 1 hour 11 minutes? The last time I saw such a short movie was BELLBOY of Jerry Lewis but it was explained in the extras that production put pressure on Lewis to absolutely finish the movie before Christmas (of whatever year that was) so poor Jerry Lewis only managed to come up with approx. 70 minutes of footage.What is Woody Allen's excuse for such a short movie? But on the other hand I thank Woody Allen. If this movie was 2 hours long it probably would have killed me.",
            "review_date": "2009-09-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect blend of \"old\" and \"new\" Woody",
            "content": "This is still my favorite Allen film, and I've seen them all. It's the only one of his \"mature\" films that approaches the same level of zaniness of his \"early funny ones.\" He had already parodied the documentary format once before, in \"Take the Money and Run,\" but at that time he had not yet matured enough to do it in a realistic way, which always makes a parody funnier. Here he is in total control of the medium.People who think of Allen mainly as a writer, or who dismiss him as old-fashioned, should see this film to realize just how state-of-the-art his films are cinematically. When he wants to, he can be as impressive a technical wizard as the big-budget Hollywood honchos, albeit on a quieter scale. This visual splendor is evident in many of his films, but none more than this one.",
            "review_date": "2001-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A fun film with very good music",
            "content": "Another film I saw back in college and that I now got a chance to see again through the magic of Netflix streaming vid. I joined a bus load of students going up to a multiplex near the Cities, and everyone else was going to see The Big Chill. But I wasn't interested and went alone to see Zelig. That makes me the opposite of the protagonist...t in this film, Leonard Zelig, who wants so much to fit in and be liked that he literally changes his appearance to match whoever he's with.The \"Mockumentary\" was a brand new art form in 1983, and Woody Allen pulls it off very convincingly. Framing this as the story of a human curiosity from the 1920s, he shoots most of it in black-and-white newsreel format. The story centers on Zelig and the \"lady doctor\" who tries to \"cure\" him of his problem, and while she is successful in getting him to stop transforming into whoever he's with, we get the sense that maybe he's getting the last laugh. She has to trick him into letting his guard down so she can put him under hypnosis, but while he's in a trance he seems to tell her what she's always wanted to hear a man say, thus morphing into the man of her dreams. Sure enough, she falls for him, so maybe he's not as \"cured\" as she thinks? The film keeps us smiling throughout, but the deadpan seriousness of the delivery tends to tamp down any real belly laughs. The two exceptions are the human interest reporter who tries to do a puff piece interviewing the doctor's mother but gets more than he bargained for, and the faux German newsreel documenting Zelig and his fiancée's daring escape from the Nazis, in which the announcer calls them every name in the book, in German! The music is also a very nice touch, with some original songs like \"Chameleon Days\" and \"Doin' the Chameleon\" interspersed with actual songs from the '20s. So, while it didn't quite \"wow\" me, it's still a fun little movie that, in the words of Zelig, \"just goes to show what you can do when you're a total psychotic.\" Seven stars.",
            "review_date": "2011-03-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zelig (1983)",
            "content": "Incredibly inventive idea for a film, and the technical achievement is quite impressive. The footage matches perfectly, there are very few instances where the illusion falters. Not as wall-to-wall funny as Allen's other comedies, but there are some howlingly good jokes in it. And the film touches on issues like conformity and the cult of personality in clever ways. At times, however, it just feels like an excuse for Allen to try on different disguises. I don't have quite the same fondness for it as I do for LOVE AND DEATH or SLEEPER or a number of other Allen movies, but I enjoyed revisiting it, more than I expected to.",
            "review_date": "2012-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful, painful, slow, dated, unfunny and shallow",
            "content": "Imagine watching a badly made, dated documentary about a historical figure with no personality. Now imagine that this documentary isn't even real - the people and events you're seeing are all made-up. This begs the question: why? Oh, it's meant to be funny. However, Zelig is very immature and stupid and works far better as a depressing waste of time than as a comedy. It is full of predictable set-ups and cheap jokes.Woody Allen is a terrible actor. He is always the same in everything he does. He isn't naturally funny. Perhaps he's talented as a director or writer, but not as a performer. Nevertheless, Zelig confidently invests almost all of its focus into Woody's character with little else going on. There is no social commentary, no relevance to real world events, no deeper message. Just an indulgent mess of missed jokes.This movie starts slow and then slows down. It's one-dimensional. It uses a familiar format - a 1930s newsreel documentary thing about a mysterious man named Zelig. They interview boring old people. And they even show names for these people. Do they have funny names? Of course not. Why even bother to show their made-up names? This is torture. Every documentary ever made is worth more than this excruciatingly abysmal \"movie\". At least you might learn something or get a look inside another world.Zelig is a completely pointless exercise. It's an excuse for Woody Allen to dress up as different stereotypes and stare blankly, emptily at the camera. They took the time to record a bunch of fake 20s songs about a \"chameleon\" craze. We're shown a bunch of random stock footage from the 20s. I'm more interested in those parts. At least they're real people with real lives. At one point Zelig is under a trance and tells a joke about a Rabbi. It takes ages to set up, has nothing to do with the rest of the movie and is probably much funnier if you're familiar with Jewish stereotypes. Facepalm.I'm reminded of the huge personal disappointment that was Duck Soup. I don't find dark films or music or books \"depressing\". I find the likes of Duck Soup and Zelig depressing. They make me not want to watch movies. I feel empty, confused and frustrated because of them. Confounded at what on Earth the people making them were thinking. Did they actually think this would be funny or entertaining?Let me write about some good movies to heal myself a bit.Dr. Strangelove had ridiculous characters but they were played with sincerity and energy. It was a brilliant satire with great acting and lots of irony (and it's just funny). The Great Dictator openly mocked Adolf Hitler when he was at the height of his power, had beautiful physical comedy, made fun of politics in insightful ways and had an incredibly powerful speech at the end. This Is Spinal Tap made people believe in a fictional band, was full of hilarious ad- libbing, had perfect timing and was a satire of rock bands with many easy-to-miss references.Zelig is not even a decent attempt at a film that simply went awry. It's pretentious, self-absorbed, lazy film-making. A random sequence of average YouTube videos would have more laughs and more cohesion that this abomination. Absolutely one of the worst films I've ever seen.",
            "review_date": "2015-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Strange! 5/10",
            "content": "Review: What was Woody Allen on when he was making this film? I must admit, it's shot extremely well and he really looks like he's in some of the old footage, but the storyline is completely bonkers. It's about a human chameleon who seeks treatment for his weird condition. I really wondered what was going on while I was watching the film because it looked so real. The added commentary and interviews also made it seem really realistic but the storyline does go from one extreme to another. Watching Allen's character change into a Jew and a black person was cleverly done for a movie that was made in the 80's, but I was wondering what was Allen trying to attempt. It's shot like a documentary so there isn't much comedy but the concept is original but weird. I did stick with the movie because of the crazy storyline, but I don't know if I liked it or just thought that it was mad. Watchable!Round-Up: Personally I think that this movie would have been much better if he had some top class actors in it. The scene were Zelig was sitting behind Hitler trying to get his wife's attention was impressive and Allen played his character well. When all of his wife's started to pop out of the woodwork, the moral of the story comes into play but it's still a crazy movie. It's worth a watch just to witness Zelig change into different people and to see how he cleverly put the movie together. It does seem like your watching the History channel because of the old footage, but when you see Allen's face pop up in some of the shots, you realise that it's his warped sense of humour that created such a off the wall movie.Budget: N/A Domestic Gross: $12millionI recommend this movie to people who are into there Woody Allen movies about human chameleon, trying to to be cured of his condition. 5/10",
            "review_date": "2014-11-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Do The Chameleon!",
            "content": "Woody Allen's \"Zelig\" is a documentary about a man so desperately insecure he adopts the physical attributes of whomever he's around. Much has been made of the psychological \"statement\" the film makes, and many critics have compared the premise to the immigrant's struggle to assimilate to American culture, particularly the Jew's, but let's not get too presumptuous yet.\"Zelig\" is less than it seems, and I mean that in a good way, because Woody has such a joyful time exploring the mockumentary format that Zelig the man winds up as only one of a thousand cultural phenomenons, no more or less significant than flagpole-sitters or the fat guy who takes the cannonball to the stomach. The triumph of this film is its technicality: Woody clearly worked hard to insert Zelig into old newsreels of the 20's and to age every frame and soundtrack to convince the audience we are actually watching a remnant from another era. It works seamlessly.What doesn't always work is Zelig's character, or lack thereof. It's difficult to feel for a man with no identity, and the extended therapy sequences are just as often flat as they are engaging. It's difficult to believe Woody ever truly understood Zelig the man; the scene in which he \"wakes up\" from being a Nazi while Hitler gives an impassioned speech only five feet away is both brilliant and anti-climactic. The lights are on but nobody's home.If you come to \"Zelig\" expecting the brilliance of Woody's golden era you will be disappointed. If you approach it as nothing more than an interesting detour you will be pleasantly surprised. As the man-on-the-street declares in my favorite line from the film: \"LEONARD ZELIG IS THE FINEST American IN HISTORY!!!\" Something like that.GRADE: B- (NOTE: If you like this movie check out \"The Kids In The Hall\" Cyril St. John Escapist short!)",
            "review_date": "2009-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody Allen movies tend to make the film watchers need to see more.",
            "content": "Zelig is a movie best enjoyed by those 35 and older and by Woody Allen fans. Woody Allen is not my favorite actor and I really don't like most of the things he does. I don't rate this movie a \"1\" because the movie is quite compelling and makes you want to see more (even though Wood Allen grates on my nervous system). Woody Allen movies tend to make the film watchers need to see more. Woody Allen has that talent despite his annoying voice and attitude. I do like watching Mia Farrow act. She helps tone Woody Allen down a bit. The movie drags a bit for me. Fake movie documentaries are not my thing either so the plot does really interest me. Woody Allen is a decent director though. Bring coffee to this one.",
            "review_date": "2014-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Great Mockumentary From The Master",
            "content": "This gem from 1983 pretends to be a documentary following the tale of Leonard Zelig (Allen), a human chameleon writhe ability to become ethnicallyand socially similar to whomever he is associating with. Zelig He is exploited by psychiatrists and the media becomes a celebrity due to his ability. The story follows him through from his ignoble beginings, to the height of his popularity to his eventual destruction. The only person who cares for Leonard is Dr. Eudora Fletcher (Mia Farrow), but her concern may not be enough. State if the art editing effectsplace Allen in real newsreel footage withJosephine baker, Cole Porter, the Yankees and many others.\nThe technical effects are marvelous. There are old-timey songs about Zelig, and plenty of altered photos. The movie never loses that \"This is a true story. This is all real.\" feel of an actual documentary. Critics who crowed about similar effects in Forrest Gump obviously didn't realize they'd been put tobetter use a decade earlier.The writing is, as always, distinctly Allen. If you like Allen, you'll find him in top form here. While this film avoids zaniness (remember, this is real), it is always clever and witty. The more you know about the early part of last century and about psychology, the more you'll get out of this movie. Most of the humor deals with issues like celebrity, social personae, identity, psychology, the media and, of course, relationships.",
            "review_date": "2002-03-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "More impressive than entertaining",
            "content": "This is a feat of skillful filmmaking to mix all the archival footage and make the fake documentary work, but there's not really all that much here that's fun to watch. A few gags work, a few are clever, but mostly it's one of those \"meh\" things that works more as an experiment than a finished product. Expertly made, but kind of bleh.",
            "review_date": "2022-02-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "We love those reptile eyes",
            "content": "Probably the strangest movie on Woody Allen's resume, a technically brilliant fake documentary about a human chameleon so insecure in his own skin that he mimics and becomes anyone he is exposed to.  Including historical figures and sports legends.  Leonard Zelig, the chameleon, becomes a national phenomenon, and it's up to a no-nonsense psychiatrist to cure him.  Since the good doctor is played by Mia Farrow, and this was their second of several movies together, it's safe to say the relationship does not remain patient and doctor. The film is a piece of art--although, truth to be told, not one of his comedy classics.  There are plenty of laughs, but the movie seems somewhat overburdened by its technical aspects.  Woody did win back some of the critics he lost with his previous two films, both underrated (Stardust Memories and A Midsummer Night's Sex Comedy), and Zelig's critical (if not commercial) success paved the way for his mid '80s classics with Farrow. But safe to say that this movie is for his die hard fans only.",
            "review_date": "2002-07-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A worthy experiment that fails",
            "content": "... but it's not a bad movie, really. It's watchable and initially fun, but somehow the attempt to pose a conventional comedy as a documentary doesn't work right here. The story, which is vintage Woody, is a great idea which probably would have been better conceived as a straightahead narrative, with some faux documentary footage thrown in, perhaps. Still, a decent film, with the unmistakable Allen touch.",
            "review_date": "1999-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the only two Woody Allen films to impress me",
            "content": "I am not a Woody Allen fan--yet two films he made are remarkably good--\"Match Point\" and \"Zelig.\"\"Zelig\" is quasi-documentary at its best. When you are watching Allen and Mia Farrow, you realize you are also watching \"the real Dr Fletcher in color,\" who does resemble Ms Farrow. Much later you realize the \"Real Dr Fletcher\" was also an actress. The question is not whether you like Zelig, the real question is when can the viewer be fooled into believing what Allen wants you to believe. Color or B/W do not provide clues here. Great stuff.Watching the real Saul Bellow interview recording was a bonus--a clever bonus from Allen.And for me the best part of the film was the real Susan Sontag interview recordings--she was more attractive than Ms Farrow any day! She could have been a great actress as well as the great thinker we know her as.",
            "review_date": "2016-03-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A unique film experience",
            "content": "\"Zelig\" has several very funny moments, but it is probably most memorable for its unique premise and its masterful execution.  The cinematography is quite well done; this movie pairs Woody Allen with historical figures long before Forrest Gump ever met the President.  The visual and auditory elements of the film lend it a strong air of authenticity, even though we know this is a comedic \"fake\" documentary.  Every Woody Allen fan should give it a go.",
            "review_date": "2004-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Im not creative cant think of a title its just my opinion",
            "content": "This film was good as most Woody Allen films are in my opinion. If this were not a Woody Allen film I wouldn't have given it a chance since its about a man who is a human chameleon but since is Allen, you have to suspect there's something deeper than a man who can change identities and of course it was. Zelig is a man that has an \"extreme\" longing to be liked by others and transforms to be like the people he is around assuming their identities, as humans tend to do consciously or unconsciously, some more than others but once he over comes his disorder he becomes too outspoken and needs to be trained again to act in conformity and the cycle I'm assuming just continues. If you like Woody's humor you will like the film.",
            "review_date": "2008-03-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Allen's Most Visually Impressive Film!",
            "content": "The more I thought about Zelig, the more I think about Woody Allen's feature in a favorable light. I thought the film was merely okay upon initial watch, but it ends up growing on me. Allen has a large filmography, and Annie Hall is generally seen as his best. Over time, people have now considered Zelig to be his best. I may have that same feeling...yet. Still, this is Allen's most proficient film in terms of visual effects and editing. Filmed as a mockumentary, Allen uses old technology and stock footage to great comedic effect. With just the perfect amount of editing, he was able to insert himself into footage with Charlie Chaplin and Al Capone to name a few. You can see where later films such as Forrest Gump was influenced by. Allen has always been a king when it came to dialogue and this film is no exception. There are several lines that had me wheezing with laughter. Sadly, not every part of the film is funny but there is enough to please fans. The movie is a brisk 79 minutes, but I felt some weariness around the edges which could have been an issue if the film was any longer.We all know how adept Allen is at creating stories and strong dialogue. Now that I am thinking about it, this may be his most self-depreciating film yet. There is an ego to Allen's character, very reminiscent to Allen's real-life persona. Setting the story and tone aside, I am very interested in the special effects and Gordon Willis's cinematography. Willis received plenty of high praise for the first two The Godfather films, yet this was the film that the Academy recognized him for...and rightfully so. Allen and Willis found antique film cameras and lenses to use and went as far as damaging the negatives to produce authenticity. Allen also took old newsreel footage and inserted himself into it using bluescreen technology. The production team took so long with the special effects, that Allen was able to direct and produce two films while this film's special effects were being perfected. Even if the actual story is not to your taste, you might like the film's technical prowess.Filmed as a documentary but to comedic effect (known as a mockumentary), the story focuses on a man named Leonard Zelig (Woody Allen) during his time of infamy in the 1920's and 30's. He first came to the attention of the world when he was seen in the background of historical events. Somehow, he was able to change his image through each moment in time, even including his ethnicity. He eventually fell under the care of famed psychiatrist Dr. Eudora Fletcher (Mia Farrow) and was given the nickname \"Chameleon Man\" due to his ability to effortlessly change. He was diagnosed with a disorder to universally liked (don't we all!). In addition to the issues surrounding Zelig's ability, this \"documentary\" dives deep into the personal relationship between Zelig and Fletcher.As for the performances go, they were decent. I do not think this type of film is pushed forward on acting, but I still managed to believe the characters in their only zany worlds. Allen uses his strong dialogue to great effect. His delivery on some of the famous lines are smooth and hilarious. Farrow is adequate if not a bit forgettable.Zelig is a high-concept movie that pushed some boundaries. I also thought it was hilarious that Allen used experts in their fields to comedic effect. Well done, sir! Not everything works for me, but enough Allen dry wit is pushed across to make the film a good watch. More important than the story itself is how Allen used special effects to enhance his movie. Now that is a great reason to watch! Mercifully, the film is short and straight-to-the-point.My Grade: B.",
            "review_date": "2022-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Charming more than funny.",
            "content": "The clever use of double exposure with old newsreel footage makes this work. Using interviews with actual writers and essayists from its present (1980s) makes for a good counterpoint.Aside from that it's a charming, occasionally funny romance between a princess disguised as a shrink and a prince disguised as a frog disguised as a chameleon disguised as everyone else.  It's not \"Annie Hall\" but neither is it that self-indulgence he fell into later on.  I can watch it any night of the week.",
            "review_date": "1999-08-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Flawed Genius of Allen",
            "content": "Woody Allen has long been considered a genius of cinema, and here again is another example of how he has always been ahead of his time. The story is about Leonard Zelig (Allen), who when in the company of academics or famous people can morph himself into them, regardless of race, colour or creed. Allen cleverly superimposes himself onto newsreel footage so that he appears on screen with such recognisable figures (for example, there is a scene where he is seated just behind Hitler at a Nazi rally). Yes, the intelligence of this kind of footage was explored to huge commercial success with films like Forrest Gump, but, as that film was released well over 10 years after this one, it again shows how Allen was trailblazing a path in cinema long before others. Most of the film is naturally therefore in black and white, and told in a documentary style, and there are numerous clever sequences that uphold Allen's reputation as a master film maker. For me, there is no doubt that the quality of the piece is visible pretty much from the first frame of film, but conversely, this for me is also the problem. You can't slate the film because it is obviously something very unique and well made, but I fidgeted, because I think the germ of the idea was not (in my humble opinion) strong enough to extend over a feature length movie. To be honest, the mood and feel of the picture got on my nerves, and that is my problem with it, but I cannot doubt the obvious work of genius that is going on underneath.",
            "review_date": "2013-03-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a Mockumentary should be.",
            "content": "One of the most original, well-structured, well-executed, thought-provoking, witty, effortlessly profound and technically impressive films I've ever seen. It's also a sad reminder that the comedic sub-genre, that's Mockumentary, has long been dead after being mocked and insulted. It does have some flaws, though. It drags a bit at some point (definitely not a good sign, especially given its 79-min runtime) and it's bookended with a less-than-subtle delivery of its moral.(8.5/10)",
            "review_date": "2020-04-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody Allen 2.0",
            "content": "Zelig is a \"pseudo-documentary\" about the world's first human chameleon. This film boasts one of the most realistic re-imagining of prewar film-stocks ever filmed, crisped to the tiniest detail. The Nazi scenes alone can be worth the watch for this film.Indeed, The film is a technical marvel and acting itself is no slouch either but it always felt like something is off in this film. The story in paper is very actually interesting but Allen's mixing of his anxious comedy style with that of documentary made it came off a bit stiff and phony in a way. I just cannot suspend my disbelief as the story goes more ridiculous by the minute with its BBC-like narration topped by some on or off jokes. Overall, the film is a technical marvel and is fun to watch in tiny bits but suffers in comparison to his better works's snappy warmth and pizazz [3/5]",
            "review_date": "2017-03-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One line",
            "content": "Get rid of the narration, it's a cheat, the least cinematic film of all time, however, Allen is at his best. Witty and hilarious. He keeps this film afloat.",
            "review_date": "2018-09-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zelig",
            "content": "Woody Allen's 1983 film, Zelig was an interesting concept for a film. In the style of a mockumentary, Woody Allen starred as a man who was a literal human chameleon, appearing in the background newsreel footage through many different periods of history as he assumed the role of the context he was in. Zelig was able to change anything about himself, including his ethnicity with almost no effort. Eventually, under the care of a world-renowned psychologist, it was discovered that Zelig suffered from an insatiable need for ultimate conformity with the goal of being universally liked. The rest of the mockumentary delved into the psychological and legal struggles of a man who could change so much about himself so effortlessly. Perhaps, Zelig suffered from my not being in the right frame of mind to take it in, or perhaps it was just so different from what I expected at that moment, or perhaps it is simply a film that begs a second viewing but I didn't love it as much as I loved many other films I've been watching throughout this Woody Allen project. Zelig uses the mockumentary style in the best way that I have ever seen, those types of films don't impact me, personally, but I can recognize that Zelig used this format well. Zelig is complete with a traditionally perfect Woody Allen opening, and plenty of trademarks of the director to make any Woody Allen fan happy. Zelig grapples with death and identity, in perhaps the deepest way I've seen yet. The film is also another in his oeuvre that uses gorgeous black and white photography. What was missed, however, was the incredible dialogue I've come to expect from Woody Allen films, which was a bit of a letdown.",
            "review_date": "2017-07-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An enjoyable, one-joke pastiche with some genuine elements of technical innovation",
            "content": "An enjoyable little romp from Allen, though one that might be appreciated on a more technical level, as opposed to the more conventional, cinematic likes of Annie Hall (1977), Manhattan (1979) and Hannah and her Sisters (1986), etc. It's essentially a one-joke film, creating a mock documentary around the fictitious character of Leonard Zelig, a man so stunned by life and desperate to go unnoticed that he develops a strange psychological condition that allows him to mimic in both tone and appearance the look and demeanour of anyone in his presence. As ever with Allen's work, particularly of this period, the film is played for laughs, with the silly concept eventually giving way to elements of sly satire, wicked one-liners and a great deal of comical absurdities, as we follow the life of this extraordinary character and his relationship with the radical female psychiatrist that tried to save him.It's not one of my favourite of Allen's films - feeling at times a little too strained or limited in scope - but it is, regardless, an impressive one, filled with wit, imagination, character and of course, a genuine sense of technical invention. The way that Allen seamlessly blends himself into the ancient, black and white stock-footage featuring a variety of iconic names and faces is still incredibly impressive twenty-five years after it was first released, with the hard work of cinematographer Gordon Willis, editor Susan E. Morse, production designer Mel Bourne and costume designer Santo Loquasto all going towards the evocation of an impeccably convincing period setting alive with atmosphere and integrity. If it wasn't for the recognisable appearance of Allen and his then leading lady Mia Farrow in the role of Dr. Eudora Fletcher, then it would have been fairly easy to stumble across this film and, without knowing anything about it, take it as a genuine life-style biographical documentary on a forgotten social/historical phenomenon.The general look and feel of the film is incredibly effective throughout, especially when combined with the talking-head interview sequences with people like Susan Sontag, Bruno Bettelheim, Saul Bellow and John Morton Blum, all adding a sense of context to Allen's absurd, manufactured imagery. Once again, it confirms Allen's place as possibly the greatest living American filmmaker, and of course, continues his firm grasp of the mock-documentary format; something that he had already mastered with his first film, the great Take the Money and Run (1969) and would return to some years later with the underrated Sweet and Lowdown (1999). As a whole, Zelig (1983) is not as immediately satisfying as some of Allen's more cohesive films, such as Stardust Memories (1980) and Broadway Danny Rose (1984) produced around the same era, though it does remain, nonetheless, an impressive film that is definitely worth experiencing.",
            "review_date": "2008-06-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Can a person have more than one masterpiece?",
            "content": "Zelig is an utterly remarkable film.  It works on several different levels. First, it is presented as a documentary.  Of course, no one is expected to view it only on this level.  It's obviously a joke, a big, grand, long, beautiful joke.  But, it does function on that documentary level (as opposed to, for instance, Sweet and Lowdown, which has lots of documentary-looking interviews, but is dominated by a dramatization... Zelig consists entirely of \"archive\" footage and interviews).  The second level is the level of the comedy.  This is not a documentary, but a so-called mockumentary, and it's loaded with humor.  But unlike \"This is Spinal Tap\", it isn't merely the subject of the documentary that it funny... the format itself is subverted through the innovative and extremely effective device of giving the narrator jokes.  The third level is as a commentary on conformity. \nIf not for this third level, \"Zelig\" would be just another in a long line of good, funny, solidly enjoyable Woody Allen movies.  But this comedy has a strong point to make, and its made incredibly well.  Everyone has Zelig tendencies.  Allen created a character who takes this need to be accepted to a ridiculous (and thus highly comic) extreme.  What makes the film especially remarkable is that it can be viewed with either an optimistic or a pessimistic slant.  Certainly, Dr. Fletcher manages to rehabilitate Leonard a great deal, and he manages to exist, for a time, as a fairly regular member of society.  Of course, then he relapses and ends up a Nazi.  But even at Leonard's peak, one can interpret his success a merely another chameleon effort to fit in.  He was surrounded by people who wanted him to have his own opinions, and lauded him with celebrity status when he did.  \"Zelig\" exposes the insidious, unintended effects of societal pressure and influence.  There is no escape from this influence, of course, but it's important to remember that it's there.  It also creates a moral distinction between the conformist and that to which he conforms.  While Nazism can rightly be judged evil, the worst you can say about Zelig is that he is weak.",
            "review_date": "2002-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very entertaining film, Woody Allen at his best",
            "content": "Zelig is a fictitious biography of a man named Zelig. Zelig happens to be a human chameleon, able to take on the shape and personality of anyone who is in the room with him. The film is shot in such a way as to make it seem like an authentic documentary (with fictitious news footage, interviews, etc), which it of course isn't. It's filled with trademark Woody Allen humor, it's inventive, and it's entertaining. I thought it was an excellent film.",
            "review_date": "2000-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I still don't know how he did it.",
            "content": "I still don't know how he did half the visual effects in this film, sticking Zelig into all sorts of historical footage.  I have to believe this was the inspiration for the \"I hafta pee\" scene in \"Forrest Gump.\"  Maybe the whole film.",
            "review_date": "1999-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Give Me My Ukelele and My Ukelele Baby and Leave the Rest to Me!",
            "content": "This is a highly enjoyable film. Perhaps not quite (but nearly) a great film, because I don't think that the underlying psychoanalytical story quite works, but it is a hoot nonetheless. It is in the mocumentary style of \"Citizen Kane\" and \"F for Fake\" and is propelled by some very deft editing - almost a decade before \"Forrest Gump\".In actual fact the idea of an insecure man who via some biological glitch turns into a close reproduction of his (male) interlocutors, is brilliant. The problem is that it is wonderful idea concerning the craving for normalcy in an age of fads and silly dance steps, and of superficial engagement in a mass culture, that needs a film of its own. Whereas in this case it is simply overwhelmed by the hilarious footage. Mia Farrow's part is therefore very nearly wasted, and the counselling sessions that take place at her home - though they are witty and engaging in their own right - struggle to compete with Woody Allen (Leonard Zelig) standing alongside Calvin Coolidge and Herbert Hoover, or William Randolph Hearst and Marion Davies, or swinging a bat next to Babe Ruth, or (best of all) Fanny Brice on a Manhattan rooftop singing \"Say Mister Zelig stand by,/ 'Cause I've got a feeling I'm falling,/ Falling for nobody else but you!\" with 'Zelig' substituted for 'Parson' (from the 1929 song by Billy Rose, Fats Waller and Harry Link).The pastiche songs by Dick Hyman (especially the chameleon song) are a particular pleasure. Even a deliberately crass and corny number in the up-tempo style of the 1920s is a delight when compared with the aural ordure that passes for contemporary popular music.",
            "review_date": "2006-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zelig is no imitation comedy. it's the real thing.",
            "content": "The reviews for this flick were justified words of praise, although someone name Fiore couldn't figure it out. He probably has not yet learned to count to 10.Viewers, including, it seems, every critic in the books gave it the highest praise. Count me in. It is extremely clever, extremely innovative, and way ahead of its time using special effects that later movie makers borrowed.It slows down every now and then with too much narrative, but when Zelig becomes intertwined with the personalities of the '20s and '30s you don't know whether to sit there and be intrigued of just laugh like a loon, so you do both.To say the least, Woody Allen has always been offbeat. In this case, to coin an appropriate new word, he is off-beater.If you are looking for something very different, and very funny check Mr. Zelig. You will probably do it more than once.On a personal note, I was born in Manhattan (General) Hospital looong, looong ago. I think I recognized the doctor who brought me into the world. No, it was Woody Allen. I am grateful.",
            "review_date": "2011-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Continues Woody's decade-plus streak of peerless comic gems",
            "content": "Woody is in genius form as the eponymous chameleon man who can adapt to any situation by morphing into the appropriate guise, a rare psychological trait born of a fear of not fitting in. I think what distances me somewhat from this very clever, very funny concept, is the sleek professionalism that drains the film of the uncomfortable intimacy that characterizes much of Allen's work. An odd criticism, but here it is: I guess you could say it's too complete, its imperfections paved over in seamless collage photography, sleight-of-hand, and an uproarious case history, which contains invaluable bits of absurdity, but distances us from the characters (let it be said that this is much the intent and effect of the storytelling artifice). Funniest of all is the way Leonard Zelig is able to integrate himself into some of the WWII era's watershed moments, and Woody's take on the irrational measures by which ordinary (or in this case, not so ordinary) people are selected for celebrity and vilification is consistently engaging. I feel like a complete churl for saying this, but I think Zelig may have been more effective if Allen had chopped 20 minutes off and aired it on The History Channel (or its 1983 equivalent), purportedly as a straight-laced doc. This may seem an unfair conflation of artistic and business strategies, but what is Zelig without its flabbergasting, utterly deadpan presentation as something that it isn't? This continues Woody's decade-plus streak of peerless comic gems that started for me with the incomparable Sleeper (1973).",
            "review_date": "2005-02-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zelig: Not Just About Jews Who Don't Fit In, No Matter How Hard They Try",
            "content": "Ned Flanders, the Simpson's next door neighbour, said he liked Woody Allen films, but was not quite sure about the nervous little guy with the glasses who always appeared in them. Neither am I.There were only four I have ever really warmed to. \"Play It Again, Sam\".(The personal Bogart mentor is fun but the slapstick becomes tedious) \"Everything You Always Wanted to Know About Sex\" (It is still funny and insightful) \"Radio Days\" (a rare delight - but the little guy with glasses is an offscreen narrator) \"Broadway Danny Rose\" (an examination of the idea of \"grace\", forgiveness, turning the other cheek as an alternative to revenge)\"Crimes and Misdemeanours\" - The suggestion that you tend to forget about guilt if you live with it long enough and make enough money to buy respectability is interesting. But is the film just a technicolor morality tale.In \"Annie Hall\" and \"Manhattan\", the little guy with glasses reveals himself as a self deluded, self obsessed brat.And then there was \"Zelig\". It runs out of steam about half way through and has to be resuscitated by a rescue mission resulting in a new world record for flying a plane upside down across the Atlantic.It seems to depict the age old plight of Jews, who were kicked out of Israel by the Romans and have endeavoured to become citizens of North Africa, then Spain, then mid Europe then Russia. The more ambitious and successful tried to assimilate with the people they lived amongst, (take on the identity of such people) only to be violently rejected in the end. However there is a universality to \"Zelig\". \"Man is born free but all around us we see him in chains\". If you try to make yourself identical to everyone else to 'fit in', you will never know who or what you really are. You will ultimately miss out on the wisdom gained through atonement - the means to 'Know Thyself\". That may well apply to the timid Germans of the 1930's, the conformist faces in the crowds in those old newsreels. But it's not just about1930's Germans.You can see it acted out in Luis Bunuel's, \"Exterminating Angel\". The high society supper party guests slowly realise that they can not escape from the room in which they have gathered. Their increasingly desperate plight is finally brought to a head when one of them suggests they go back to doing what they were doing before it dawned upon them that they were trapped. The solution works. They find a way to exit the room. To celebrate their deliverance, they all attend a grand cathedral church service. And at the conclusion of the film, they realise they are trapped in the cathedral.So how do you escape the invisible chains that trap people in a society that is very imperfect? Ask the Greek philosophers.The beginning and end of all wisdom is to \"Know Thyself\" By beauty it is that we come at WisdomIn Keats' words,\"Beauty is truth, truth beauty,—that is all  Ye know on earth, and all ye need to know.\"But what is the route that leads to that beauty that is wisdom, that is self knowledge?Woody Allen might well have gained some insight into that question had he spent more time becoming acquainted with the Hebrew scriptures than he did in \"Crimes and Misdemeanours\". Moses' Law and the Prophets have a great deal to say about the journey that leads to wisdom and beauty. Take the feasts prescribed in Moses' Law.Moses' Law ties the Exodus from Egyptian slavery story to a fortnight in early spring in which Passover, Unleavened Bread and First Fruits feasts are observed. They celebrate redemption. Of course only two of the people who were redeemed on that first passover made it to the promised land. The rest did not even make it into God's rest (Psalm 95), whatever that means.A fortnight at the end of summer contains the new year, atonement and tabernacles feasts. They commemorate the forty years of wilderness wandering (atonement) that allowed them to see and know God's ways(wisdom) . Passover is about redemption. The child at the loving mother's breast is protected from harm, nourished and kept warm. It would die without that redemptive care. Think of redemption as beauty, love, mercy, forgiveness, grace. Think of the closing scene of \"Broadway Danny Rose\"Atonement is about law, truth, consequences of actions. The child who has been weaned and goes out into the world soon discovers the truth that it is not at all like suckling at mommy's bosom. Wisdom is truth. The truth that is discovered about oneself by life experiences in the hard, cold world. They either make you, or break you. You get to decide by the way you react to the calamities of nature and actions of other people. Think of wisdom as truth. It is symbolised as a virtuous wife in the book of Proverbs. It is expressed as the knowledge of God that comes from riding out grief, pain and loss, in the book of Job. Apotheosis.The man who had his ex- lover murdered in \"Crimes and Misdemeanours\" failed to gain that wisdom.Beauty is truth, truth beauty Redemption is beauty. The Wisdom discovered by atonement is truth.If you want a new definition of the construct referred to as \"God\", recast that idea as what happens at some abstract point at which Redemption intersects with Atonement - at which grace and beauty intersect with truth. Using that definition, knowing God is to know redemption and atonement - beauty and truth - true wisdom.There's an idea for some new movies, Woody. Some really worthwhile movies, with or without the little guy who wears glasses.",
            "review_date": "2014-02-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "In its own odd way, it may be Woody's most personal film",
            "content": "In its own odd way, it may be Woody's most personal film, this mockumentary about a meek man who wanted to be liked so much that he physically changes himself to be like the people he is around. A grand view of the '20's, and all of its great and terrible figures, with, of course Zelig having part in most of these events. This moving comedy, with a few classic Allen lines, has to have been the predocesor, if not the influence for \"Forrest Gump\". Yet, this is more sublimely romantic, and moving, done, like Allen himself, quite, and threw a camera lens.",
            "review_date": "2002-04-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zelig: a mix of reality and fantasy",
            "content": "Zelig: a mix of reality and fantasy Allen NThis is my undertaking of Woody Allen's movies .Both its reality and absurdity staggered me and the discussion on possible multiple personality impressed me. The director visited colourful real characters and mixed them with fictional narratives, to achieve the convergence of reality and the past. This approach in shooting biographies of historical figures is not unique but may be the first.Story Leonard Zelig was a celebrity in 1920s in America, famous for the ability to mimic other people and changed his personality into another person's entirely according to the environments. His deeds were always hits. People hated him or liked him just because of his legendary sense. He finally met a psychologist who could make him back to normal person and he married her.Telling story The story was told with time going. Changes had happened on main characters, especially the hero.Actor The director shaped a little cute and a bit confused public person who was actually a morbid man.Photography Normal The virtual parts had been done to old style and speeded, so it could look like historical data more and could be called ''documentary''. Music Normal Shortcoming Using \"documentary\" as classification does not seem right and ''biography film'' might be more appropriate.",
            "review_date": "2012-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just genius...",
            "content": "I already had a high opinion of Woody Allen but after watching this one I rank him on the list of the cinematic geniuses. Definitely one of the smartest stories I have ever seen. Another proof that you don't need huge budgets or fancy actors to make a great film and a slap in the face of all those writers-directors who depsite the lack of imagination have made ''succesfull'' creations. Highly recommended to literally anyone and especially to every young person who intends to enter the writing field.",
            "review_date": "2020-08-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Woody Allen's \"pseudo-documentary\" about the chameleon life of Leonard Zelig.",
            "content": "Zelig is a Woody Allen film with an original style. Set as documentary on the life of a Woody Allen creation, Leonard Zelig, Zelig opens with the premise that people have \"just forgotten\" about one of the most influential person of the 1920's. Allen, probably realizing that a joke can only be taken so far, elects for a shorter than usual running time (79 minutes) and still is able to convey the joke: Zelig (played by Woody Allen) is a human chameleon who underlies a greater sociological problem in this world: the necessity people feel to \"adapt to their surroundings\" in order to feel safe. Dr. Eudora Fletcher (Mia Farrow)is the psychiatrist willing to help Zelig return to one personality. Zelig's life is not peachy, and in fact later he has to overcome adversity as he regresses in his treatment. However, this and other loopholes in plot are masterfully explained by documentary-type interviews with such people as Saul Bellow and Susan Suntag. Zelig is an excellent film that is enjoyable to watch both for its idea, its subtle comedy (it would harldy be Woody Allen any other way) and its technical aspects.",
            "review_date": "1998-10-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Intelligent Comedy!",
            "content": "Not only the film is a near-perfect mocumentary - with its use of real-life academicians and writers - it is also one of the most intelligent comedies! Also, for Woody-specific fans, it is a pure Woody Allen flick - his use of humour, nuances, philosophy are as original and amusing as they ever are.After you're amused by it, you can also take a look at its philosophical core. It literally personifies our desire for conforming to the society and the problems it can bring. It tells the importance of the unique space we occupy in the society and the things we bring to it.",
            "review_date": "2020-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "\"He was, of course, very amusing. But at the same time touched a nerve in people, perhaps in a way that they would prefer not to be touched.\"\nThough he wrote it for one of his characters, that's an oddly apt description of Woody Allen himself.\n\nAllen discards most of the neurotic intellectual persona that he used to such acclaim on his other work in order to create one of the most successful faux-documentaries that had been made to date. Using bluescreen technology, Allen and longtime cinematography collaborator Gordon Willis got very creative with the techniques that could convincingly edit old newsreel footage in the pre-digital era. With an eye towards lampooning the dry nature and even the practical design of traditional documentaries, the script gives plenty of short-form comedy to get the quick laughs. But as usual, there's also some creative subtext mixed in, as Zelig serves as a way for Allen to explore his own nervousness and social coping mechanisms, just taken to the extreme. \n\nZelig is definitely dated on the race jokes, which might make some people turn it off early, but for the world before Christopher Guest and This is Spinal Tap, the film is groundbreaking in the development of mockumentaries. Not as emotionally involving or consistent as some of Allen's other comedies, but definitely a creative departure featuring a lot of solid gags. (3.5/5)",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, a masterpiece. The entire premise of the movie is wildly original, even coming from WOODY ALLEN who continually cranks out one interesting film after another to this day. The label of mock-umentary just doesn't do justice to the uniqueness of this film. ALLEN and his amazingly talented staff created a movie that no other director could have made nor even thought of doing. Some of the humor is rather modern like the forward references to self-gratification during the psychiatrist scenes with MIA FARROW. But mostly, it's filled with humor from another time and place which we'll never return. To me, one of the wonderful aspects of this is the period music dispersed throughout with joyful admiration. We are lucky that ALLEN has continued to use music from the early part of the 20th century. I think no other director has so consistently had such a reverence for this wonderful music. Perhaps no other director has such a strong knowledge of it either. That WOODY ALLEN normally portrays himself as a nebbishy character in many of his own movies works so well in this movie. A more aggressive person who becomes a chameleon would not have worked as well at all. I am glad that MIA FARROW was still associated with him when he made this film, I think no other modern actress could have pulled this off as well as she did. She has that timeless look that is appealing but has a far-off feeling. The flavor of the period-looking cinematography and photography is part of the genius of the implementation here. It is so right on the money. The flickering of projectors, the out-of-focus look to so man scenes shot today meld amazingly well with the contrived shots. THINK ABOUT THIS - this is years before CGI took over Hollywood...years before FORREST GUMP and countless of other knock-offs have proliferated in movies. Gee whiz, there is CGI in so many movies these days. I watched a DVD of a recent movie recently which used special effects in the most unexpected, unlikely and unnecessary parts you'd be surprised. Yes, ZELIG is a masterpiece and I only feel sorry for those who cannot see the astounding piece of cinema this is.",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zelig is a brilliant look at identity in a time of mass media, with particular resonance to actors. On the musical side, Bruce Cockburn expresses it equally well in \"Pacing the Cage\" \n\"I've proven who I am so many times\nThe magnetic strip's worn thin\nAnd each time I was someone else\nAnd everyone was taken in.\"",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This mockumemtary shows that Woody Allen is one of best American comedian of all time. Hilarious till end!!. 9/10",
            "review_date": "2022-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woddy Allen at his very best - in a hilarious mockumentary about the extreme human chameleon Zelig. Allen is brilliant in the main role, and Mia Farrow is also perfect as the psychiatrist doing research on and trying to cure Zelig's exceptional ability to change character, which is a result of an intense identity disorder. The story is basically set to the 1920's, and this together with the superb old style filmography and special film and photo effects, takes the total up to a unique dimension of realism that almost makes one forget that it's only satire. Technically very realistic and most impressive for being made in the early 1980's. Also the actors playing the bi-characters are all doing such a credible job, without trying to be funny, which makes it all the more comical. In a myriad of priceless humoristic elements, there's also a general but subtle segment of serious psychology, both on the individual and universal human plan. It's so spot on that Charles Chaplin, who even has a small part as himself, would have been absolutely amused.",
            "review_date": "2021-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In Woody Allen's mockumentary Zelig, set during America's Jazz Age, Leonard Zelig (Allen) captures the nation's attention with his ability to become a human chameleon, changing his physical appearance depending on his environment in order to assimilate, conform, and be accepted.  Stylistically, the film is unlike anything else found in Allen's expansive oeuvre.  Shot to mimic aged film, it is scratchy and shaky and tinny and totally effective. The film itself is funny, insightful, endlessly fascinating, and immensely entertaining.  Despite its brief running time, this may be Allen's most wildly ambitious film.",
            "review_date": "2021-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll confess to not being a Woody Allen fan but this is absolutely outstanding. Very funny mockumentary, probably wouldn't be made today as someone would claim it is offensive. This is outstandingly well made and a great send up of the 1920s. Just properly brilliant comedy.",
            "review_date": "2020-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't work for me at any level.",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most original, well-structured, well-executed, thought-provoking, witty, effortlessly profound and technically impressive films I've ever seen. It's also a sad reminder that the comedic sub-genre, that's Mockumentary, has long been dead after being mocked and insulted. It does have some flaws, though. It drags a bit at some point (definitely not a good sign, especially given its 79-min runtime) and it's bookended with a less-than-subtle delivery of its moral.\n\n(8.5/10)",
            "review_date": "2020-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Woody Allen's most technically ambitious films this has a large a cult following and often ranks highly in critical assessments of Allen's entire filmography. In concept it is fascinating and it can be seen as a forerunner to films like Forrest Gump (1994) in the conceits that it employs and the comments that it makes on the nature of American society. I did find myself loving parts of the film but where it lost me was in the fact that we spend so much time viewing Zelig through the eyes of the intellectuals that narrate the pseudo documentary and not enough time with the characters at the center of the film. That meant that this was a difficult film to engage with emotionally and it lost something in it's refusal to let us into the character's mind.\n\nThe shy young man Leonard Zelig, Woody Allen, lied about having read Moby Dick to a group of people as a child and was able to assimilate successfully. From that moment on he was able to fit into any group he met, losing his own identity in the process. He becomes a media sensation as the public are fascinated by him but kind Doctor Eudora Fletcher, Mia Farrow, is eager to take him on as a patient and treat his condition. While treating him the two fall in love and eventually marry but women make unfounded claims against him which bankrupt him and the young couple struggle to survive.\n\nThe heart of the film should have come from the love story between Zelig and Fletcher who find themselves when they fall in love. Some of the best moments in the film come when Fletcher is simply questioning Zelig and an attraction between them slowly builds as the quiet Fletcher is charmed by Zelig's aggressive pursuit of her. Those who do not appreciate Allen's regular nebbish persona will be pleasantly surprised by his performance here as he is quiet and subdued without the joking of Alvy Singer. I could have used more of Allen in the film though as while there is novelty to hearing Susan Sontag spout absolute trash there should be more than just vague amusement to be drawn from imaginative nature of the film.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best comedy movie ever made!",
            "review_date": "2019-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fictional documentary like no other. It's hilarious, innovative and shows off the brilliance of Woody's filmmaking skills.",
            "review_date": "2018-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It might be Allen's magnum opus. One word for it: BRILLIANT.",
            "review_date": "2018-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the funniest and most intelligent films I've ever seen. It's very rare to have those two things together, but this film is incredible and makes it work. Creative, funny and tackles some rather philosophical insights into human nature all at the same time. Well done Woody.",
            "review_date": "2017-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "#woodyallenretro Podcast Project\n\nWoody perfects his mockumentary skills from take the money and run to a perfect tee with a very interesting and fantastically shot look into this charismatic chameleon character - still holds up to this day and can fool people to even think this was real person... well... not really but great execution",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most philosophical, historical, mocking documentary showcasing Woody Allen at the height of his imagination and moral seriousness, thinly and charmingly under the disguise of wit and mockery.",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant Film. The story, though somewhat slow at some points, is genius and the dialogue hilarious. The film itself is technically amazing because of its use of blue screen technology in inserting Woody and the cast into old footage and intercut them with re enacted scenes, which you hardly notice. I found myself trying to to dissect the film into \"real\" and \"fake\" parts but to no avail. The film contains a myriad of interesting themes that have kept me up at night after watching it. The mockumentary style allows for interesting \"mechanics\" such as fake interviews and my personal favourite, scenes from a film about the character, to be used, developing the narrative and the atmosphere. My favourite line in the movie is \"The Fuhrer had a great joke about Poland planned\". I'll leave it there. Watch it !!!!!",
            "review_date": "2017-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant mocumentary perfectly capturing its subject times, dusted with that arrogant, yet nonchalant humour Allen became famous for.",
            "review_date": "2016-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very interesting concept (documentary style movie about something so improbable in a satirical realistic setting) but the delivery wasn't as funny as is known with Woody's work. First 45 mins, the novelty of the concept keeps you going but after that, it drags.",
            "review_date": "2016-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute, short, with some memorable laugh out loud moments. An interesting comedic follow up to 'Being There.'",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"-But I've never flown before in my life, and it shows exactly what you can do, if you're a total psychotic\"",
            "review_date": "2016-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It pains me to not absolutely love this movie, I'm a huge Woody Allen fan and I'm slowly working my way through all his great films..... But this just didn't do it for me. Zelig is a mock documentary, very clever and really cool concept. The film just did not keep my attention, within the first 15 minutes of the film I had already lost interest and realized that I did not want the watch an hour and a half of the same repetitive gags. Sadly this movie will not be going into my collection and I'm hoping I can recoup my money that I spent on it by selling it on Ebay.",
            "review_date": "2016-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Forrest Gump effects. Stupid plot.",
            "review_date": "2016-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a good film. You could convince one to believe it's true facts and history.",
            "review_date": "2016-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fairly delightful, light-hearted film by Allen built around a technical gimmick that still looks pretty fantastic.",
            "review_date": "2015-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an odd ball Woody Allen movie with a mockumentary style to it like Sweet and Lowdown which I liked and it worked better for that movie. Allen is great as well as the score, writing, and cinematography. Not my favorite Allen movie but a good one",
            "review_date": "2015-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The mockumentary  approach turns this absurd story into complete genius.",
            "review_date": "2015-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What impresses most about Zelig, of course, is the incredible dedication of Woody Allen and his team to verisimilitude, despite everything about this faux-documentary being false.  Allen plays Zelig who, during the 1920s and '30s, developed a psychiatric disorder that led him to transform (often physically) to be like those around him - a \"chameleon\" effect.  Mia Farrow plays his psychiatrist.  Although Allen claimed that the content of the film (about conformity and needing to be liked, one supposes) was his main focus, the no-holds-barred effort to shoot the film using old cameras (and even to rough up the film stock), to create songs and other ephemera featuring Leonard Zelig the Chameleon that appear true to the period, to entice real people like Susan Sontag and Saul Bellow to reflect on the fictional Zelig, and most famously to super-impose Allen himself into stock footage featuring various celebrities and politicians of the era, suggest otherwise.  The whole thing flows very smoothly and you could, if your thoughts wandered for a moment, forget that you were watching a 1980s film (or at least forget that the footage of the past was faked).  Alas, the content itself does not necessarily sustain the enterprise, but there are a few good jokes.",
            "review_date": "2015-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen definately crafts an original, and undoubtedly funny, mockumentary.",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "M-F\n\n8.2\n\n[Woody Allen]",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mixing in footage of popular crazes and stock footage from the roaring 20's Woody masterfully creates a very unique film that I've seen nothing like since Forrest Gump, if it were exclusively the newsreels. Certainly mockumentaries are common, but a whole movie with vintage film and minimal narrative is a fascinating project. He still finds time for unrequited love, mockery of the public, over-reaching intellectuals, and non-sequiturs so you never forget you're watching a Woody Allen movie.\nHe attempts to make a strong point about the court of public opinion and the power of the press, which feels slightly forced, but what works is everyone's fear of not 'fitting in.' Most interesting when Zelig is alone he is completely devoid of personality because he has no one to work blend in with. An interesting, short movie that's most notable for it's ability to impose Allen's image on old footage in the pre-computer filmmaking era.",
            "review_date": "2015-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Jew that was able to turn himself into a Negro or Indian was a triple threat.\n\nLeonard Zelig has a special talent where he is able to turn into anyone he comes in company with.  If he is around Native Americans, he can turn into a Native American, same for other nationalities.  Due to his internationally recognized talent, he gets to meet hundreds of famous individuals; however, due to lost memory due to some of his episodes, some chance meetings go better than others.\n\n\"The neighbors beat our family.  The neighbors down the block beat our neighbors and our family.\"\n\nWoody Allen, director of Midnight in Paris, Manhattan, Alice, September, Small Time Crooks, Annie Hall, Match Point, Shadows and Fog, and The Purple Rose of Cairo, delivers Zelig.  The storyline for this picture is interesting and reminded me very much of Forest Gump.  The character and interactions were interesting as was the filming style.  The cast delivers above average performances and includes Woody Allen, Mia Farrow, and Patrick Horgan as the narrator.\n\n\"The bull gives himself a brain concussion.\"\n\nI grabbed this off Netflix as another Allen movie I had never seen but was highly reviewed on both rottentomatoes and Netflix.   I found the film interesting and well thought-out, I do wonder how much of the idea of Forest Gump came from this film (they were very similar).  Overall, this is a nice addition to the genre, was a bit choppy in parts, but is definitely worth a viewing.\n\n\"Guilt related masturbation.\"\n\nGrade: B-",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like the style of narration a lot in this one",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "May take a while to grow on you, but Zelig is an intelligently crafted and fascinating mock-doc with impressive special effects and while not full of riotous jokes like This Is Spinal Tap (released one year later), it boasts a sustained smirk inducing comedic tone throughout, perfectly representative of  Woody Allen's playful sense of humour.",
            "review_date": "2014-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fabulous mockumentary about a man who can transform himself into anybody he comes in contact with. Directed by Woody Allen and released in 1983, Zelig is a love letter to the Hollywood of the 20's and 30's.",
            "review_date": "2014-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review:\nWhat was Woody Allen on when he was making this film? I must admit, it's shot extremely well and he really looks like he's in some of the old footage, but the storyline is completely bonkers. It's about a human chameleon who seeks treatment for his weird condition. I really wondered what was going on while I was watching the film because it looked so real. The added commentary and interviews also made it seem really realistic but the storyline does go from one extreme to another. Watching Allen's character change into a Jew and a black person was cleverly done for a movie that was made in the 80's, but I was wondering what was Allen trying to attempt. It's shot like a documentary so there isn't much comedy but the concept is original but weird. I did stick with the movie because of the crazy storyline, but I don't know if I liked it or just thought that it was mad. Watchable!\n\nRound-Up:\nPersonally I think that this movie would have been much better if he had some top class actors in it. The scene were Zelig was sitting behind Hitler trying to get his wife's attention was impressive and Allen played his character well. When all of his wife's started to pop out of the woodwork, the moral of the story comes into play but it's still a crazy movie. It's worth a watch just to witness Zelig change into different people and to see how he cleverly put the movie together. It does seem like your watching the History channel because of the old footage, but when you see Allen's face pop up in some of the shots, you realise that it's his warped sense of humour that created such a off the wall movie.\n\nBudget: N/A\nDomestic Gross: $12million\n\nI recommend this movie to people who are into there Woody Allen movies about human chameleon, trying to to be cured of his condition. 5/10",
            "review_date": "2014-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a legendary mockumentry.",
            "review_date": "2014-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly one of Woody's best all around movie's, ever. Even my die hard \"I HATE Woody Allen Friends\" love this movie when I force them to watch it. Woody and Farrow are at their best, Woody playing a long-lost historical schlemiel over the ages, somehow time making him immune to his past. It's brilliant !",
            "review_date": "2014-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Zelig\" continues to morph in the style of its titular hero from being mildly amusing, to depressing, before finally becoming a fascinating piece of work about the nature of celebrity, individuality, and Allen himself. If not a masterpiece, it's most certainly brilliant and one of Allen's most accomplished pictures that is not only incredibly original, but intelligent and perhaps even important.",
            "review_date": "2014-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Allen's best, which puts it in the running for one of the best of all time.",
            "review_date": "2014-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Woody Allen's great masterpiece. A genious, funny and incredibly wonderful work. The pseudo-documentary tells the strange and entertaining story of Leonard Zelig, the human chameleon who can turn be the people around him (in the mental and physical appearances). The film deepens man's quest for a better human being, a personality, have their own opinions, despite being influenced by others. The film chronicles a goal of man: to be accepted in society that lives in spite of being different from others. The comedy that addresses all these issues, it is also somewhat human and romantic, turning this little seventy-nine pseudo-documentary in a masterpiece of the great genius Woody Allen, one of eternal masters of cinema.",
            "review_date": "2014-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great comedy about a human chameleon. Allen and Farrow give great performances here.",
            "review_date": "2014-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the most imaginative farce you'll ever see. Special kudos for the retro imagery in all its forms here. Essential Allen, way outside the box, and a near-believable documentary.",
            "review_date": "2014-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are some really funny moments in this mockumentary. Woody Allen sort of reminds me of Stan Laurel a bit in this, at least he has that look of a bewildered idiot genius. The film does have a bit of a lull in the middle but the rest is good solid comedy.",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a boring movie. The plot was unique, and the style was cool, but it did not keep my attention.",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Woody Allen's great masterpiece. A genious, funny and incredibly wonderful work. The pseudo-documentary tells the strange and entertaining story of Leonard Zelig, the human chameleon who can turn be the people around him (in the mental and physical appearances). The film deepens man's quest for a better human being, a personality, have their own opinions, despite being influenced by others. The film chronicles a goal of man: to be accepted in society that lives in spite of being different from others. The comedy that addresses all these issues, it is also somewhat human and romantic, turning this little seventy-nine pseudo-documentary in a masterpiece of the great genius Woody Allen, one of eternal masters of cinema.",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting concept for a comedic film by Woody Allen. I don't think I ever saw another film like this.\n\nAn oldstyle comedic mockumentary on a fictional figure.\n\nWhat's better is the type of person this film is about: a human chameleon named Leonard Zelig, someone who can literally transform to match the people he is around to fit in. If he is around black people, his hair and skin will change. If he is around doctors, he will pose as one. When around anyone, he will fit in with them.\n\nIt came from when Zelig was younger and was asked if he's read Moby Dick. He was embarrassed to say no. He was humiliated and never wanted to feel like that again. So from then on, he's made sure he could always fit in with the crowd and not negatively stand out and potentially be humiliated.\n\nWith this story concept, Allen add hilarious lines all throughout the film.\nThis film is added to my list of favorite Woody Allen films.\n\nZelig, I give you a 100%.",
            "review_date": "2014-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm probably too familiar with Zelig, but for many it was a welcome return to laugh out loud comedy with Woody Allen in his most farcical film since Love And Death. Extraordinarily clever  and oozes charm.",
            "review_date": "2014-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This mockumentary about a human chameleon who is able to change race, appearance, and professional demeanor at will is rather clever with the \"archive footage,\" the smoooth 'n smarmy radio-voiced \"narrator,\" and the \"cameo interviews\" with actual famous literati, but the movie tips on the tightrope of Woody Allen's slapstick inanity and Woody Allen's in-depth human analysis without ever transcending to the latter.\n\nI'm not one for blanket political correctness, but if you're gonna use blackface and slant-eyed make-up, you've gotta say something narratively relevant and not just treat it as a gag. There's so much social and cultural critique to be mined for both smart comedy and introspective pathos: people's prejudices toward different races, the knowledge of one's own race as the Other, the oftentimes unquestioned authority of those in respected professions, et cetera. \n\nThe fictional Dr. Eudora Fletcher states that to the untrained observer, Zelig's faux-psychiatrist sounds realistic, but he's really just deploying cliched lingo. It would follow that Zelig adopts different stereotypical speech patterns for different races or classes, but all of this \"research\" is presented in silent \"archive footage,\" not some tour de force bit of spoof acting like Robert Downey Jr.'s in \"Tropic Thunder.\" Nothing changes within Woody or Zelig to actually BECOME or even inhabit another personality, which is sadly unsurprising since Woody Allen seems incapable of playing anyone other than Woody Allen. (And anyway, mimicking Dr. Fletcher is technically a plothole because Zelig's chameleonic power doesn't work with or on women.)\n\nWithout grounding in what it actually means to \"pass\" as a different race, class, or other distinction, this lightweight premise and execution is almost as insulting as Woody's blind man bit in \"Hollywood Ending.\"",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty odd Woody Allen movie, although it does have classic moments that shine.",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen has always known how to bend reality just enough.\n\nWould recommend to true Woody Allen Fans",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my fave woody allen pic just watched again and it still holds up well and made me laugh it sets the stage for such pix as 'forest gump\" and others",
            "review_date": "2014-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zelig is definitely one of Allen's most distinct films, despite the humor in it being consistent with the absurd-yet-brilliant style of his earlier work. Before watching it, I had since seen another more recent film in which he borrowed the Mockumentary storytelling used here and after watching Zelig, I'm convinced this it seems to be a natural way for him to create an well-made story. Not only was the plot unique, but the comment in it was an interesting take on social expectations. Excellent.",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A laugh-out-loud mockumentary that wickedly pokes fun at celebrity gossip, psychiatry and the inert conformists in all us with a yarn about a \"human chameleon\".",
            "review_date": "2013-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zelig is a fascinating film. It is a \"documentary\" about a man who can look and act like whoever he's around, and meets various famous people. Woody Allen and Mia Farrow give incredible performances. The script is well written that it kept me entertained. Woody Allen also did a great job directing this movie. I enjoyed watching this motion picture because of the humor.",
            "review_date": "2013-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The idea of this was funny and was cleverly done but I felt it was an idea thy could only stay funny and be used for about 20 mins or so then it just gets repetitive and boring",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect example of Woody Allen's extraordinary powers of film-making...Zelig is a meticulously crafted picture.",
            "review_date": "2013-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Allen creates a person, a character, a back-story and a life while parodying history and the media, and at the same time asking interesting questions about the human condition all in the space of 80 minutes. Fascinating from start to finish and it's left me slightly in love with Leonard Zelig and Allen's mastery of film technique. It's memorising and may well be the directors best work.",
            "review_date": "2013-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen's mockumentary about a man who wanted to be liked so much he can change his appearance and personality to mimic those around him. The film does the documentary style with deadpan humor, even with a goofy premise it comes off like a real documentary. Essentially Allen messed with an optical printer to put himself and Farrow into old movie clips, several years before Zemeckis used similar ideas in \"Forrest Gump\" using computers. The filmis hilarious, but not only had heart, but it has a serious underside as well. Quite recommended.",
            "review_date": "2013-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very clever mockumentary of the fictional Leonard Zelig \"the human chameleon.\" Allen like his later features The Purple Rose of Cairo (1985), Bullets over Broadway (1992), and Midnight in Paris (2011) really shows to his audience his love for the 1920 to 1940 era. His lead character Zelig is likable, Mia Farrow appealing yet since it is a mockumentary fairly muted and the lighthearted but psychoanalytic tone of the film is just right. First time rating: 8.3/10",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was only today that I read Chomsky's 10 strategies of media manipulation. If the movie was aired as a docu without Allen's name I'm sure people would so much buy the story.",
            "review_date": "2013-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zelig is not as well known as Annie Hall or Manhattan or Midnight in Paris--but it should be. It's unique, quirky and humorous, with clever special effects for its time. It still holds up, even three decades later, and should be watched by any Woody Allen or mockumentary fan.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliantly executed and affectionate mockumentary set in the 20s/30s, Zelig is not one of Allen's 'heavy' hitters perhaps but it's a winner all the same and strikingly ahead of its time.",
            "review_date": "2013-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen's Zelig is a mockumentary about Leonard Zelig, also played by Allen, a chameleon-like character who takes on the characteristics of those he is around in the 1920's. Like many other Woody Allen projects, Zelig is, as a whole, an underwhelming effort. This is truly one time that you could accuse Allen of choosing style over substance. Allen's strict adherence to the documentary structure, including authoritative narration, works to ultimately confine the work. All the humor and action is just moved along by the narrator, in order to setup and repeat one of the film's two jokes. The jokes surrounding this nothing man range from inserting him into old footage - He's behind Babe Ruth! He's behind Hitler - or him taking on the appearance of those around him - He's black! He's Asian! He's Scottish! The special effects used to believably insert Allen's Zelig in stock footage is impressive, but aren't really funny, let alone funny enough to carry the film.\n\nZelig marks Woody Allen's second attempt at the mockumentary, following his directorial debut, Take the Money and Run. The documentary structure is not as strictly adhered to in Take the Money and Run, which makes me wonder if Allen thinks that those breaks have a negative impact on the film. Allen does make statements concerning pop culture, celebrity, and himself as an artist and person, but I found them muddled in overall tone and structure of the film. Zelig, running at about 80 minutes, feels long and can never overcome the fact that it's a one joke film. I can only recommend it to die hard Woody Allen fans.",
            "review_date": "2013-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zelig stands out as a tongue-in-cheek look at American hypocrisy, especially in the 20s when the great American dream was only beginning to take off. \nThe brand of humor is typical of Woody Allen: intelligent dialogues which induce a smirk rather than bring on laugh out loud moments. \nExtremely well shot, the film is iconic in its technical brilliance and the eerie, fantastical story. Amidst the dead-pan humor is some serious commentary on individuality, capitalism, the compulsive need to conform and the ephemeral nature of public memory. \nZelig is one of the most perfect mockumentaries around. Bound to find resonance in everyone, this movie would do Bergman proud!",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Favourite woody allen film. Pretty different than the rest of them.",
            "review_date": "2013-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"ZELIG...! IS...! THE CAT'S...! PAJAMAS!\"\nOne of my top three all-time favorite Woody Allen pictures.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Documentary\" about a man who can look and act like whoever he's around, and meets various famous people.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I absolutely can appreciate what Woody has done with this film, formulating a very nice and funny documentary; and while I like seeing him and Mia Farrow in films together...I felt that the film was too long winded for its simple premise.",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Normally watch 21st century films, but this Woody Allen film shows how the classics will always dominate recent, enjoyable, rubbish.",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen's first & I believe only Mockumentary on the fictitious Zelig character who is more or less a human chameleon.\n\nThe use of visual trickery is fantastic the way in which Woody adds Zelig into original footage & stills is sublime. \n\nMia Farrow is yet again the muse for many if not most of Woody's 1980's endeavours. Quite original & well thought off, Woody was by no means your typical comedy director he did a film here that not any one could 'just' pull off.",
            "review_date": "2012-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's certainly innovative and very funny when it tries to be, but it's hard to escape the notion that the film is slight and often more tiring than great.",
            "review_date": "2012-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fun Woody Allen film.",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "* My Favorite *\nA very odd film and a brilliant idea behind it.",
            "review_date": "2012-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films Woody Allen has ever made! I loved it",
            "review_date": "2012-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It finally happened. A Woody Allen movie (mockumentary) I like. Great format! Fun, authentic-feeling and lovingly made.",
            "review_date": "2012-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny in many places, I wonder if this is where the \"mockumentary\" idea started? It is a great satire about psyhology and psychiatry. The photography was great - the old B&W footage looked real. It seemed a bit long, though - probably could have been 45 minutes or an hour and would have been perfect.",
            "review_date": "2012-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, witty and smartly directed.",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Originally made as the first film of a new deal with Orion Pictures, this one of Woody Allen's most brilliant and technically astonishing films, he got the idea from seeing talk show host Dick Cavett, inserted into old film footage. He had a brilliant idea, and it's one of the most original films he's ever made, and the special effects are brilliant. It's a mockumentary set in the 1920's and 1930's, and charts the phenomenon of Leonard Zelig (Woody), a man who happens to be a \"human chameleon\", meaning he is able to change to be like any party of people he is in the presence of, it gets him into trouble, when he mingles with Chicago gangsters and the New York Yankees. When his medical malady is discovered, Dr. Eudora Fletcher (Mia Farrow) is determined to cure him of this strange syptom, but it's not going to be easy, especially when Zelig is exploited because of his symptoms and put in freak shows and put on a world tour, but after a tragedy, he's discovered at the Vatican and put in Fletcher's care, and she finds a way to cure him, and doctor and patient find themselves falling for each other. This brilliant piece of cinema, it took nearly 3 years to make, but it was worth it. This is not a million miles away from Citizen Kane, or even when Forrest Gump did, but with Allen's usual wit and characterisations, this is a real treat, which could actually fool people who didn't know any better.",
            "review_date": "2012-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen's mock documentary is more absurd than funny but with such a short runtime this unusual mix of 'Forrest Gump' and 'Citizen Kane' does not out stay its welcome.",
            "review_date": "2012-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best fake documentary EVER",
            "review_date": "2012-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zelig is a really funny movie, and perhaps even more importantly, it's a really funny Woody Allen movie.  Yet, this does feel like a funny premise stretched to feature length.  As funny and smart as it is(as well as the underlying metaphor's incisiveness), it doesn't feel quite right all the time.  It might be better suited for a vignette or a short film, because the diversions with this idea often feel strained.",
            "review_date": "2012-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly ingenious, this film is a mockumentary shot in an authentic 1920s style with Woody Allen demonstrating his genius not only as writer, director, and actor but also as a remarkable visionary.",
            "review_date": "2012-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genius. So inventive and original, I feel that on further viewings I may start to class this as one of the best films of the 80s. I laughed out loud throughout, was impressed by the authentic feel of the mockumentary given that it is a humorous endeavour, and was astounded that a film from the 80s could be shot so that it looks like it was actually filmed in the 20s and 30s. Every other modern day film I've seen that tries to imitate that look never quite pulls it off completely, whereas with this it was pretty much impossible to distinguish between the vintage newsreel clips and the scenes that had been shot for the film. Brilliant stuff.",
            "review_date": "2012-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can't compare Zelig with Woody Allen's other movies .",
            "review_date": "2012-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wacky, zany, creative, and utterly brilliant. Forest Gump stole the special effect gimmick years later.",
            "review_date": "2012-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zelig reiterates that Woody Allen undoubtedly is a true master of film making. A mockumentary in 80's! Who'd have imagined?",
            "review_date": "2012-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is Woody Allen's funny, offbeat, and really cleverly hilarious mockumentary about Leonard Zelig, the \"human chameleon\"- a man with a multiple personality disorder so bad, he compulsively transforms into anyone that he is near.\n\nThe bulk of the film is shot in the style of 1920s/30s newsreels, and follows Leonard through history as he does everything from show up to batting practive with Babe Ruth, appear at the Vatican with Pope Pius and stand behind Hitler at the Nuremberg Rally. Basically, this film pioneered the same concept and special effects later used to great effect and acclaim by Robert Zemeckis with Forrest Gump.\n\nThis film is a lot funnier, more clever, and more zany, though. Besides his antics with mimicking people and showing up at various historical events, Zelig becomes a celebrity in his own right, and, while being treated and cured by Dr. Eudora Fletcher, he falls in love. \n\nThis is a brisk, funny, very sweet, and terrific film. I loved the ideas and the execution. At a running time of 80 somehting minutes though, this feels really slight and the style seems to overrun the substance. The film does get slightly beneath the surface though, so it's not all fluff. It's not one of Woody's best, but I'd put it near the top of his B-Sides.",
            "review_date": "2012-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderfully engaging and absolutely hilarious mockumentary. A masterpiece of the genre!",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best mock-documentary ever made. Brilliant. The directing is amazing, the effects are great. The seriousness of the narrators and interviewers just makes you actual consider the possibility. This shows how easy documentaries can distort things because of the accuracy than they imply when you watch them. A must see definitely.",
            "review_date": "2012-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody at his best, I cant believe going back over the years how he has maintained a purple patch.",
            "review_date": "2012-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The title character became proverbial in many languages throughout the globe. What more can a movie achieve?",
            "review_date": "2012-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen is smart, hilarious & overall just plain brilliant, as usual, as Leonard Zelig, a man present during most of the landmark historical events of the century. A truly unique mockumentary chock full of old school newsreel footage & appearances by the most brilliant minds of medical, literary & artistic culture.",
            "review_date": "2012-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both a break from and an homage to traditional Allen fare, \"Zelig\" is an impressive accomplishment for the filmmaker.  The film speaks about its creator more than any of his other works.  Allen may have a preferred niche, but he's never afraid to try new concepts.  More importantly, when he does, they almost always turn out great.",
            "review_date": "2012-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hilarious mockumentary about one mans need to fit in. Leonard Zelig or the human chameleon represents the jewish need for assimilation and on a larger scale the human need for acceptance.",
            "review_date": "2012-01-29",
            "source": "rt",
            "lang": "en"
        }
    ],
    "rt_rating": 8.8,
    "rt_summary": "In this fictional documentary, a man achieves notoriety for his ability to look and act like anyone he meets. With his unique talent for mimicry, Zelig (Woody Allen) ingratiates himself with people from every sector of society. His chameleon-like skill catches the eye of Eudora Fletcher (Mia Farrow), a doctor who thinks Zelig is in need of serious cognitive analysis. Their relationship moves in a direction that's not often covered in medical textbooks."
}