{
    "rating": 9.3,
    "release_date": "1950-12-26",
    "num_reviews": 290,
    "genres": [
        "Japanese"
    ],
    "summary": "Brimming with action while incisively examining the nature of truth, \"Rashomon\" is perhaps the finest film ever to investigate the philosophy of justice. Through an ingenious use of camera and flashbacks, Kurosawa reveals the complexities of human nature as four people recount different versions of the story of a man's murder and the rape of his wife.",
    "reviews": [
        {
            "content": "A landmark innovation in film storytelling at the time, and yet at the same time evocative of the silent era in the performances. Some great shots here as well. Good stuff.",
            "review_date": "2023-01-13",
            "source": "rt"
        },
        {
            "content": "Rashomon (1950)\nAs pioneered by Akira Kurosawa is an analytical, culturally inspired film using the act of persistent story telling and an un-reliable narrator perspective such as made popular in work of literature such as HP Lovecrafts writing, as the pioneering director to create a film of this narrative style.\n Akira Kurosawa created a trope known as the Rashomon affect which is concerned with the fact that the film analyses 7 separate recounts of the same events however told through the eyes of separate characters and each version of events is different. It brings arise to the question that perhaps each character, through a perception of a certain event (in this case the brutal death of a samurai and the rape of his wife) is telling the truth of what they perceive as true. However the facts have been driven towards our minds based on a cultural understanding of the art and grammar of film making known as the semiotic symbolism. It is to be noted that some of the recounts of these events are told through a third person and perhaps those accounts could also be told again by someone in a \"Chinese Whispers\" style of storytelling rather than a factual, true representation of the event that is only ever suggested to the audience and is never clarified, the true events cannot be understood because Akira Kurosawa intentionally left components of story telling out of the film, proving that in cinema, all of the collaborative information has to be displayed as the audience cannot invent story without semiotic and philisophical understanding and because of the way the suggestive grammar of the film affects us on a personal and cultural level (The question of honour comes into play alot in this film, an aspect displayed heavily in traditional Japanese Culture) and by suggesting that the creator of the film does not have the information needed to paint an accurate representation of the events (creating an instance known today collocally as un-reliable narrator). This is a major part of what is called the ambiguous code of cinema and is responsible for the connotations displayed through this piece of artistic amazement.\nI could write more, but I don't think I will, if you'd like to see a bit more of what I'm saying here, watch the movie!\nIsaac Prior - AD of film theory",
            "review_date": "2022-11-01",
            "source": "rt"
        },
        {
            "content": "The perspective of four sides of the story so original for 1950!",
            "review_date": "2022-10-25",
            "source": "rt"
        },
        {
            "content": "Literally no exaggeration, one of the best movies ever.",
            "review_date": "2022-10-25",
            "source": "rt"
        },
        {
            "content": "Exploring the vulnerable grandeur of man when reduced to his elemental state, Rashōmon represents Kurosawa's most fearless investigation of human nature. Today, it is celebrated as one of the greatest work of the East Canon. This film abounds in daring philosophical ideas, the place of individuals in the world and the frailty of lines demarcating chaos from order, guilt from innocence. By combining tragedy and comedy, this film centres around an elusive and mysterious murder in Japan. It traces the fortunes of three characters huddling in a ruined temple called Rashōmon. Its realisation is bright in the extreme ripe with astounding images and musical effects. \nBy addressing the issue of guilt and duty and its consequences, the director unleashes a bitter attack on human nature. However, we need to qualify the remark. At the end of the movie, there is an undercurrent of hope : it conjures up a sense of kindness and helps to attenuate the criticism. Man is capable of the best and the worst. \nThe influence of this movie cannot be underestimated.",
            "review_date": "2022-09-19",
            "source": "rt"
        },
        {
            "content": "A wonderful message displayed with substance through the amazing performances given and the brilliance of technique used all additional to the brilliant structure of the film. Rashomon is one of Kurosawa's, who has thirty Director credits to his name, most acclaimed films. Rashomon is a film that makes you question not just those around you and the world around you, but you yourself at the core. This is most certainly a thinking man's movie and one that explores truth versus peoples perception of truth. Highly Recommended to everyone who believes in humanity.",
            "review_date": "2022-09-09",
            "source": "rt"
        },
        {
            "content": "Not only it raises several philosophical questions to think on after watching, it has some iconic shots and scenes hard to forget. Must watch!",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "The brilliance of \"Rashomon\" derives from a combination of its intellectually engaging theme and the relentless dramatization in its execution. Kurosawa surely pulls out all of the stops, utilizing innovative music, movements, and camera angles to achieve and sustain a consistently high dramatic pitch throughout the bewildering events of the film. This is a film which is boldly aware of its own aesthetic power, hypnotizing us in the process of weaving together a series of developments which feels less like a story than a mesmerizing spell cast over the viewer. In a manner befitting truly well-rounded film-making, the final captivating moments leave us with a memorable and elusive tale that wins over our hearts as well as our minds, fortifying our faith in the ability of cinema to creatively define itself in endlessly bold and innovative ways. \"Rashomon\" is triumphant in its ability to both challenge and stimulate us, yielding an endlessly fascinating and entertaining tale in the bargain.",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "A masterpiece in storytelling and a great way to get introduced to the great Japanese movie era. Kurosawa is one of the greatest directors in history (Seven Samurai, Yojimbo, Ran etc). This is where I'd start with Kurosawa's movies, it doesn't stretch to oblivion and still has a fantastic story.",
            "review_date": "2022-03-19",
            "source": "rt"
        },
        {
            "content": "More maniacal laughter then I'm used to.  So much of this movie is dialogue that takes itself so seriously it feels like a parody. I was in stitches. Maybe I'm too shallow, or perhaps this movie's too deep.  Either way, a great watch. I'll let you decide if it's a comedy or drama for yourself.",
            "review_date": "2022-02-07",
            "source": "rt"
        },
        {
            "content": "A sublime work of art",
            "review_date": "2022-01-21",
            "source": "rt"
        },
        {
            "content": "Although sounding like a Bacon x Pokemon promotion (I 100% stand by this joke) Rashomon is actually a profound meditation on human nature from Japanese cinema grand master Akira Kurosawa told through the lens of several unreliable narrators. \n\nRashomon relays the story of an assault and murder from three differing perspectives with the principal players a wife, her husband and a bandit all offering conflicting and self serving accounts. Each retelling offers a further strand to the web we as viewers are asked to untangle. \n\nSuperbly acted, especially Machiko Kyõ who staddles the line between distraught victim and (rather unfairly) femme fatale even with a disconcerting lack of eyebrows. Stunning black and white visuals ranging from rain and wind swept ruins, sweaty and desperate sword battles and expertly composed court room confessionals.",
            "review_date": "2022-01-17",
            "source": "rt"
        },
        {
            "content": "I was pleased to watch Rashomon and enjoyed it. We have largely watched English and American films and, for some reason, Scandinavian with one or two exceptions and it was nice to branch further afield. The premise was interesting and did allow for some quite dramatic scenes. The whole film had quite an intimate and small scale feeling which was nice, there were certainly no superfluous characters. At times I did find it a little tiresome watching so many versions of the story - they said in the film there were three but think there was more than that. One never really knew if one was seeing/hearing the truth and no doubt that was deliberate and part of the message or meaning of the film. The film did have something to say about human nature and also a little on the nature of gender. Overall the film was quite simple but in a good way - in its storytelling, meaning and shooting - which did allow for a fitting zen element to it all. Some aspects of the film were a little over dramatic and repetitive making it tiring at times but not really much to criticise about this film.",
            "review_date": "2021-11-13",
            "source": "rt"
        },
        {
            "content": "Rashomon, an early offering from Akira Kurosawa, is a narratively innovative examination of perception and justice.  Told from a variety of perspectives, the movie examines each character's perception of a murder and rape, each sharing common elements but unique in their details.  Considered by many as Kurosawa's greatest film, it may be a bit overrated, thanks primarily to an excessive amount of overacting from much of the cast, led by the antics of Toshiro Mifune as Tajomaru, the bandit who triggers the chain of events.  Despite this, it's a artfully crafted film with an intriguing and interestingly structured story and some excellent cinematography from Kazuo Miyagawa.",
            "review_date": "2021-10-28",
            "source": "rt"
        },
        {
            "content": "Probably the most famous of all mysteries who did what to whom only enlighted at the end of the movie!",
            "review_date": "2021-08-15",
            "source": "rt"
        },
        {
            "content": "Highly regarded cinematic piece of history that did nothing for me. Found it all pretty dull. There's not much to the stories and little motivation for some of them to be recounted as they are. I'll leave it for others to revere this one.",
            "review_date": "2021-08-08",
            "source": "rt"
        },
        {
            "content": "Even when it drags, it is interesting. RASHOMON holds one of the most powerful and complex stories I've ever witnessed, and it's in Kurosawa's top 3 that I've seen. It does often drag, though.",
            "review_date": "2021-04-06",
            "source": "rt"
        },
        {
            "content": "\"Rashomon\" displays brilliant storytelling, especially for its time. The innovative nature of the way the story is presented demanded my attention. I found myself fascinated by the way the characters were presented and it made me think a lot. It is intentionally never revealed what the truth of the events being discussed, is and that is both a great strength and weakness of this film. I would have loved to know what actually transpired, but it also would have taken away from the point of the movie. Overall, this is an interesting and quick watch that I think is a great film to spark many discussions regarding how human beings can perceive certain events and the morality of the truth.",
            "review_date": "2021-02-27",
            "source": "rt"
        },
        {
            "content": "Amazing classic with great use of discourse.  Impressive feat for the time.",
            "review_date": "2021-02-08",
            "source": "rt"
        },
        {
            "content": "The story may not seem as innovative as it did seventy years ago, but this is still an amazing movie.  Kurosawa's style and the actors' performances are enthralling.",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "In the end, I wasn't convinced. The story started out good. There was anticipation cause of the line \"never heard a story as horrible as this. This time, I may finally lose my faith in the human soul. It's worse than bandits, the plague, famine, fire or wars.\" It was disappointing cause the courthouse story wasn't worse than those terrible, catastrophic events. It was just said to hype up the movie.\n\nI felt like the drama and emotions portrayed by the characters lacked depth and was made convenient to arrive at a point about people being selfish and evil. There wasn't enough build-up to sympathize with the characters' sorrow and sudden realizations.\n\nI thought I would like this more than Kurosawa's other works cause the intro felt like a modern movie in a sense that it was straight to the point. Maybe this would work better if it was performed in a theater stage with a bit more exaggeration for effect.",
            "review_date": "2020-10-28",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa's film is not simply a magnificent achievement in film. Lighting, sound, editing … each is its own character in this story about a specific incident.\nThe incident – the death of a samurai and the rape of his wife – is seen through the eyes of four different witnesses.\n\nAlthough the same thing happened, the tellings are much different.",
            "review_date": "2020-08-06",
            "source": "rt"
        },
        {
            "content": "Really good film. I finally got a chance to see this and now can know what the \"rashomon\" technique is first hand. I feel parts of it went over my head, but I am struck by how vivid the cinematography was, even in black and white.",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "I understand that the symbolism and messaging in 'Rashomon' make up some (or most?) of this film's appeal, but I just don't feel that's enough to allow it to remain one of the \"greatest films\" of all time. It just isn't, in my opinion. The story itself is not that interesting to begin with, the overacting is a distraction at times, and that final \"battle\" scene is just pathetic. Maybe this film was something else when it arrived 70 years ago, but it hasn't stood the test of time.",
            "review_date": "2020-07-31",
            "source": "rt"
        },
        {
            "content": "A fantastic depiction of how people experiencing the same event remember and tell the story differently. Thus, a nice example for any history class representing unreliability of human memory and credibility of any story being told. It goes wonderfully with the concept that humans are historical beings and that we are conscious of our past but that does not mean the past would be truthful to us. In short, OLD but GOLD.",
            "review_date": "2020-06-07",
            "source": "rt"
        },
        {
            "content": "Rashomon is a movie about the human behavior. It is a film that is able to perfectly capture the nature of deceiving, stealing and lying. Although the film may sound very pessimistic at first glance, little by little we get to see some hope in these flawed personalities. It is one of the best movie that Kurosawa had ever directed.",
            "review_date": "2020-05-27",
            "source": "rt"
        },
        {
            "content": "A masterful achievement in cinematic storytelling. Visually stunning and gripping. This is maybe the definitive Kurosawa's masterpiece reflecting the Japanese feeling during the post-WWII thanks to the game played between perception and reality.",
            "review_date": "2020-05-16",
            "source": "rt"
        },
        {
            "content": "This is a fantastic movie that everyone should see.",
            "review_date": "2020-04-25",
            "source": "rt"
        },
        {
            "content": "A masterpiece about the unreliability of memory, or at least the unreliability of witness statements at a trial. There are many remarkable scenes, such as the camera-work during the initial journey through the jungle, which operates as an entrance into a mythological world where passions and emotions are heightened. The seance scene is unmatched for its strangeness, intensity and believability. Belongs in the top 10 films of all time.",
            "review_date": "2020-04-24",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa proves with Rashomon to be a gifted storyteller that is able to maintain the viewer captivated until the credits roll in a stunning psychological tale.",
            "review_date": "2020-03-31",
            "source": "rt"
        },
        {
            "content": "Kurosawa's incredible thriller discusses the place of truth, selfishness, morality, and perspective within this engrossing thriller. Touching on the same event from several potentially unreliable narrators, Rashomon calls upon the viewer to dissect what, if anything, can be considered sincere. (5/5)",
            "review_date": "2020-03-13",
            "source": "rt"
        },
        {
            "content": "This was my first experience with Kurosawa and I found this enchanting study of truth and the nature of human nature both visually stunning and intellectually stimulating. While the way in which some of the concepts or themes were looked at here may seem simplistic or banal to viewers today, I believe the universal aspects of human nature explored in this film are always worthy of a closer study through art, whether in 1950 Japan or 2020 America.",
            "review_date": "2020-02-25",
            "source": "rt"
        },
        {
            "content": "An amazing masterpiece! Everyone is untrustworthy, everyone will lie and cheat the story to make themselves the hero. In my opinion, Rashomon is by far the best work of Kurosawa. It shows the nature of humans when it comes to reliability. Even in the end, it doesn't show the true story, when the third guy reveals the farmer's thievery, we understand even him isn't reliable because he needs to alter the story in order not to draw attention to himself. I think Kurosawa truly made a movie that will leave his mark in the history of cinema!",
            "review_date": "2020-02-08",
            "source": "rt"
        },
        {
            "content": "Innovative form in the film medium to explore the theme of perspective. Intriguing performances.",
            "review_date": "2020-01-28",
            "source": "rt"
        },
        {
            "content": "Maybe it's just me, but if this was my introduction to eastern film, I wouldn't be so keen to explore Kurosawa more; luckily, though, I've seen what else he's capable of with seven samurai and ran.",
            "review_date": "2020-01-27",
            "source": "rt"
        },
        {
            "content": "It's the first movie to tell a story from different perspectives and unreliable narrators, but that doesn't mean it's an entertaining movie.  It doesn't hold up to today's movie standards.",
            "review_date": "2020-01-26",
            "source": "rt"
        },
        {
            "content": "This movie is on a lot of the \"Greatest Movie of All Time\" lists. I think it deserves to be. It famously tells a story from multiple perspectives, some more other-worldly than others.\n\nThe problem with a lot of movies is that they try to be wise, but they do it with one or more gigantic blind spots. Some ignore the reality of putting food on the table, the reality of child-rearing, the reality of defending yourself from outside challenges. This movie acknowledges a huge part of life, and it does it poetically, with simplicity. I love it.",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "A riveting murder mystery about morality.\n\nAkira Kurosawa's crime drama Rashomon (1950) is a near flawless film that ruminates on how the average person would act in a deadly scenario. Rashomon sees four witnesses to a murder recount the fatal events from their perspective. The twist is that they are all unreliable narrators and Kurosawa accomplishes this by only telling the audience what happened from their viewpoint. Endlessly intriguing, seemingly nihilistic, yet hopeful by the finale, Rashomon is a beautiful testament to the power of truth and decency as well as the dangers of lies. Kurosawa's script is one of complex rationality and touching sentiment. At first glance, Rashomon is so pessimistic that you may be put off by its hopeless parable, but a single act of kindness reveals that there is hope for humanity after all. Kurosawa's writing is biting and thoughtful with each line as justice prevails.\n\nRashomon is a fantastic fable with a dreamy atmosphere conjured by Kurosawa's striking direction. Constant rainfall contributes to Rashomon's dour tone, the sunlit forest is a lovely backdrop for unspeakable crimes, and the stark white court is an intriguing set for plain lies. Kurosawa's camera is always moving and the cinematography within Rashomon is fantastic as we always see from an interesting angle. Whether we are looking under a tree, above a stream, behind bushes, in front of a temple, or right in the face of characters, Rashomon finds the most fascinating camera placement choices. I will say that Rashomon is methodically paced, so that may be too slow for some viewers in the start, but the story is so riveting and the camerawork is so captivating that you are sucked into a horrifying tale of rape, murder, and deceipt. Rashomon is 83 minutes of suspense!\n\nI love the use of light to brighten up faces and shadows on trees in Rashomon. The natural beams of light make even the most dire situations seem surmountable. The silhouette of the horse riding across the sunset is classic Kurosawa imagery. The sword duels are exciting and unorthodox. The first is exhilarating as we get to enjoy a flurry of sword swings in vicious strokes, while the second is a shocking display of cowardice and fear as the two men run away from each other desperately reaching for their swords. Rashomon is intriguing on its own story merits and filmmaking prowess, but the ambition and daring of Kurosawa to deliver a duel of frightened swordsmen is unparalleled.\n\nI will say that Toshiro Mifune is hilarious and appalling as the excitable bandit. His cunning farce and brave persona are entertaining in their own right, but he depicts any number of layers as the bandit Tajomaru. Takashi Shimura is moving as the Firewood Dealer and witness to the dreaded murderous encounter. His ultimate honesty and act of compassion is heartwarming and touching. Shimura gives a subtle performance of understated agony, inner conflict, and quiet goodness.\n\nI liked the upsettingly sad and wildly erratic performance from Machiko Kyo as the rape victim Masago. She acts with a gleeful fervor that's fun opposite the eccentric Toshiro Mifune. Masayuki Mori is solemn, yet intense as the wandering samurai and murder victim Takehiro. Minoru Chiaki is sympathetic as the kind priest going through a moral crisis of faith that mankind could be so cruel and selfish. Kichijiro Ueda is funny as the commoner listening to the four tales. His selfish act is both darkly humorous and deeply disturbing, yet completely honest for his character's desperate want. Lastly, I rather enjoyed the insane flailing and intriguing mystique of Fumiko Homma as the medium at court.\n\nOverall, Rashomon is a nightmare of cynicism with a droplet of hope. I think it's moral questions will still resonate with audiences. Find moral clarity and solace in the sunlight of Rashomon!",
            "review_date": "2019-12-12",
            "source": "rt"
        },
        {
            "content": "I'm sure I've seen this once, perhaps even twice. Didn't think much of it then, maybe now it's gotten better, but still a bit of a slog to sit through. 4 different stories (but maybe, I guess, 5?) all different about the circumstances of a death of a man transporting his wife, and what happens when they encounter a thief, Somewhat extreme overacting here, but there are some good bits.",
            "review_date": "2019-07-27",
            "source": "rt"
        },
        {
            "content": "A pillar of film history, there is no doubt Rashomon was extremely influential to an entire generation of filmmakers and it remains relevant to this day. Rarely is a title so important that its very name becomes a shorthand for that type of storytelling device, but what Kurosawa did in this movie was groundbreaking. Aside from the originality of the concept itself, telling the same story from several different, incongruent perspectives, the film boasts several innovations in the camerawork and editing with quick tracking shots and wipes that wouldn't be seen regularly until much later in cinema. Additionally, the stellar composition of the shots and great (if rather theatrical by today's standards) acting serve a simple yet effective story about the relativity of truth and the effects of passion. Classic and worthwhile",
            "review_date": "2019-07-22",
            "source": "rt"
        },
        {
            "content": "Too good to miss out on",
            "review_date": "2019-07-16",
            "source": "rt"
        },
        {
            "content": "Very impressive. Rashomon can make us think deeper into human nature. Just like it suggested in the movie, everyone is dishonest and selfish. They will hide the truth for keeping their dignity(like the pirate in the movie), their virginity(like the woman in the movie)... The same story, different people have a different statement for their own interests. This is very interesting, in reality, this kind of situation is really common, maybe we all just tend to ignore it.",
            "review_date": "2019-03-26",
            "source": "rt"
        },
        {
            "content": "It's RIDICULOUS that this is 50th in all time list of best movies.  MOST great film directors learn and take from Kurosawa's movies like this one, AND i's nowhere near his best like 7 Samurai and Ikiru.  Rotten Tomatoes shows it's becoming more of a SELLOUT site for GARBAGE new movies versus REAL skills like the movie Rashomon on all sides from acting, directing, and cinematography",
            "review_date": "2019-03-03",
            "source": "rt"
        },
        {
            "content": "The director seems to be saying that everyone is a cowardly hypocrite and the only way to change that is to do the little part that you can to change the world, but it ends up being very convoluted getting to that point. The notion of subjective truth that I read in the reviews about this film weren't very accurate, as the character's lying to themselves doesn't change the fact that they still know what happened and the kind of worthless human that they are. No amount of testifying to others some cock and bull story will change the story from what actually happened. It's true that in time it would be possible for them to alter their own memories by lying to themselves, but this doesn't back the idea of subjective truth as a viable process and theory. The scene where the lady had the knife was incredibly cheesy, as she went forwards, backwards, left and right over and over again with the fakest expression of terror on her face she probably could muster. Mifune isn't as good as I saw him in Seven Samurai, but he isn't awful. A lot of the shots are beautiful, and lot of the scenes are stale. This is such a mixed bag, I have no idea why it is so highly regarded.",
            "review_date": "2019-02-09",
            "source": "rt"
        },
        {
            "content": "I can't say I enjoyed the film, nevertheless I appreciate the interpretation the director gave to the story, and how revolutionary and innovative it was at its time",
            "review_date": "2018-12-25",
            "source": "rt"
        },
        {
            "content": "I can't say I enjoyed the film, nevertheless I appreciate the interpretation the director gave to the story, and how revolutionary and innovative it was at its time",
            "review_date": "2018-12-25",
            "source": "rt"
        },
        {
            "content": "A landmark film with endless interpretations and analyses, so Iâ(TM)ll try my best not to prattle on.  There is a good dose of cynicism in Rashomon, with human nature shown to be selfish and for people to lie, or perhaps more delicately, to distort the truth through the lens of their own perception.  A couple of serious crimes have been committed in the forest, and whatâ(TM)s happened is told from four different perspectives.  Common to all is that a samurai and his wife were travelling through the woods, and then set upon by a bandit (the incomparable Toshiro Mifune).  He ties up the samurai and rapes his wife in front of him, and afterwards the samurai is found dead.  Itâ(TM)s a grim, awful crime, and worse yet, because of the culture and the period, the rape is viewed with elements of dishonor and shame in the woman.  Beyond that, the truth is elusive, and once we see that the flashbacks vary in their accounting, we realize it may be difficult to arrive at what actually happened.\n\nIn the banditâ(TM)s account, he puts himself in the best possible light.  The woman fights courageously with a dagger before succumbing to him, but then grasps him in her arms when he assaults her, indicating consent in the end.  She then tells the bandit that because of the shame, either he or her husband must die, urging them to fight to the death, which they do valorously.  The lens here is clearly the banditâ(TM)s masculinity, perhaps what is most important to him.\n\nIn the womanâ(TM)s account, after sheâ(TM)s raped and the bandit leaves, all she can see are her husbandâ(TM)s eyes, boring in to her own.  She feels guilty, horribly guilty, and faints near him with the dagger in her hand.  When she comes to, her husband is dead, and she attempts suicide multiple times but fails.  In her case, the lens is one emphasizing her feeling of shame, as painful as that is for us to see.\n\nIn the samuraiâ(TM)s account, cleverly told through a medium, after the rape, his wife is about to leave with the bandit, when she asks him to kill her husband.  The bandit is shocked by the request, and asks the samurai if he wants to kill the woman, or let her go.  Because of that honorable action, heâ(TM)s willing to pardon the bandit.  The woman flees, and after the bandit releases the samurai, the samurai commits suicide.  In this case, the lens emphasizes an honor code, and puts more control of what must have been a helpless and humiliating situation back in the hands of the samurai.\n\nThis is where the 1922 short story â~In a Groveâ(TM) from Ryunosuke Akutagawa ends, and I find it fascinating that Kurosawa added the woodcutterâ(TM)s account (beyond him simply finding the body).  In this version, after the rape, the bandit begs the woman to marry him, but she refuses and releases the samurai.  Instead of an epic battle for her hand, the two are both cowardly, only fighting when she spurs them on, and then with more fear than skill.   Itâ(TM)s very tempting to think that this must represent the closest thing to truth, as itâ(TM)s told from an outside observerâ(TM)s perspective, contains elements of the otherâ(TM)s stories, and shows no one in a flattering light.  However even it has discrepancies, casting doubt over it, and thus, the truth is ever elusive.\n\nIf you think about it, each of the first three stories has an underlying misogyny.  In the first, the woman says no, but given enough force, eventually says yes.  In the second, she essentially feels guilty for having been raped.  In the third, while the samurai and even the bandit display honor, her shame is so great that she requests her husband be murdered.  Perhaps there is some redemption in the woodcutterâ(TM)s story when she criticizes her husband for not protecting her in the first place.\n\nThe other aspects that Kurosawa added relative to the original story was the setting at â~Rashomonâ(TM), which was the largest gate in Kyoto, the discussion at the gate throughout the narrative, and the ending sequence with the baby.  Akutagawa had also written a short story called â~Rashomonâ(TM), which is published today along with â~In a Groveâ(TM) and others in a slim volume, and Kurosawa took this setting and the title from the other story.  The gate had fallen into disrepair and was a hide-out for thieves as well as a place to abandon bodies, and as the rain pours down, we feel the wretchedness of the human condition.  In providing the ending sequence though, Kurosawa seems to give us an answer to the central question posed by the film: how can anything be accomplished when eyewitnesses canâ(TM)t even agree on the simple truth of past events, and people are so selfish, driven by their own egos?  Itâ(TM)s through mercy and kindness, acts which transcend misunderstanding.",
            "review_date": "2018-11-13",
            "source": "rt"
        },
        {
            "content": "\"Rashomon\" seems like a courtroom drama movie but it's not about finding the truth. You're stuck on a Kurosawa's philosophy about human beings, who can be trusted and if there is nothing to be trusted, is this world a hell? It's a movie that puts a lot of influences, for now, a story which feels new and original at the time and becomes a new innovation. With truly beautiful and brilliantly shot visuals, the greatest acting performance, the visual, and the score, \"Rashomon\" deserves to be called as an art along with the best film ever. In fact, it's difficult to parallel with the today films where creative seems to be gone. \"Rashomon\" is a film yet more than a film.",
            "review_date": "2018-10-12",
            "source": "rt"
        },
        {
            "content": "Obviously, this film is well known for coining the Rashomon effect, and other technical innovations. With that said, it is extremely dated and something under 90 minutes felt like 3 hours to me.",
            "review_date": "2018-10-11",
            "source": "rt"
        },
        {
            "content": "Beautifully crafted. The very film that many would make people think that Akira Kurosawa a god of cinema.",
            "review_date": "2018-10-10",
            "source": "rt"
        },
        {
            "content": "Truly ahead of it's time.",
            "review_date": "2018-09-25",
            "source": "rt"
        },
        {
            "content": "A brilliant masterwork of psychological integrity from Kurosawa.",
            "review_date": "2018-09-24",
            "source": "rt"
        },
        {
            "content": "While watching Rashômon:\nWho do I believe?\nShould I even believe anybody as long as all people seem to be liars?\n\nAfter watching Rashômon:\nI don't care who's right, but please God forgive me for being so skeptical!\n\nIn Rashômon, the legendary filmmaker Akira Kurosawa explores our perception of reality with a creative narrative structure, and unreliable narration that reflects the moral dilemma of the story, and uses a plenty of unprecedented visual storytelling techniques; groundbreaking editing, and jaw-dropping use of camera angles that have inspired, and still inspire many films up to date, and also made Rashômon an immortal piece of cinematic magic.\n\nHowever the real genius of this film is how it emphasizes its moral dilemma is nothing short of fact by making us the real victims, simply because we are humans who have countless flaws, case in point, skepticism and constant doubt. That being said, the movie is far from being nihilistic, nor merely pessimistic. Because if we see the whole picture, we will find that the movie also affirm that the human has as good characteristics as he has bad ones. Without going into any details, some of these good characteristics are Sympathy, Truth-seeking, and pleading guiltiness.\n\nAll the performances are as good as possible, but whose performance stands out for me, and arguably for most viewers, is Toshiro Mifune's as the notorious bandit, Tajômaru. He delivered such a kinetic performance that will stand the test of time exactly as the movie itself. Also Machiko Kyô was phenomenal; the fact that she frequently changes her facial expressions in such a graceful way is unbelievable.\n\nThere's only one character that I think isn't necessary. It expresses the viewer's doubt to convey, and end the moral aspect of the story, while we already drawn into the story that we can grasp everything because, as I mentioned above, it's a story about us. That made the conclusion of the movie feels a little bit on the nose. Nevertheless, the interplay between this very character and the Woodcutter helped to set the tone at certain points, hence made the viewers know how to feel at the very beginning, and the very end of the movie.\n\nAll in all, Rash?mon is a thought-provoking study of human nature. It's an ageless piece of art not just because its universal themes, nor the revolutionary narrative, and visual techniques, but because it takes advantage of us, as humans, to prove its moral.\n\n(9.5/10)",
            "review_date": "2018-09-03",
            "source": "rt"
        },
        {
            "content": "Outdated characters and storyline. This film has reached its expiration date. The story essentially follows similar trappings as The Room, men are dutiful and lead astray by emotional, weak, and manipulative women. Then tells that story in four different perspectives. More modern films can just as well tell the story of people having different perspectives and the ability for people to convince themselves, but without all the patriarchic baggage.",
            "review_date": "2018-08-17",
            "source": "rt"
        },
        {
            "content": "Stunning in all its storytelling.",
            "review_date": "2018-05-27",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa's Rashoman may have a few aspects that feel dated by today's standard, but the story is a thoughtful exploration of reality versus perception and truth vs pride.",
            "review_date": "2018-04-13",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa was an incredible filmmaker who left an indelible mark on modern cinema. I seen Seven Samurai several years ago, and while it might have been a little overextended, it was near peerless in terms of stakes, character development and emotional power. Rashomon, much shorter, nevertheless packs a punch, and is an incredible achievement in narrative structure. Rather than the familiar 'Unreliable Narrator' trope, here we get the same story told from 4 opposing viewpoints, with some details remaining the same but many changed and, of course, contradictory. The film is a meditation on truth and perception, deceit and dishonour. As the story unfolds we are presented with a number of stories, all of which cannot be simultaneously true. But rather than trying to surmise which one is correct, we are instead left to ponder who is telling the fewest untruths. The nature of honest is frail, and we can only go on what we see and believe. Sometimes we make things up to exaggerate a tale, sometimes we hide things to make reality more palatable. Lies are a part of our humanity, and we do it all the time with usually little consequence. Kurosawa is not asking us to stop lying, but instead acknowledge that we do it so often and with such disregard. The acting is incredible, especially from the legend that is Toshiro Mifune, a man who can shift between joyous laughter to aching despair in seconds. He's an infectious presence and never shows any signs of being uneasy with what he's doing. He's an absolute master, while still playing possibly the most reprehensible character. Again, that's a decision left up to the audience, since everyone is flawed in one way or another. It does feel draw out in places, despite being only 88 minutes, but it's an incredible achievement from the man who was at the peak of his powers, and a film that deserves all its acclaim.",
            "review_date": "2018-03-15",
            "source": "rt"
        },
        {
            "content": "Conflicting narratives told to the point of death at the cost of life, Kurosawa allows us to understand the self-deception that man is prone to.",
            "review_date": "2018-01-20",
            "source": "rt"
        },
        {
            "content": "Random guy: Dialogue is inherently un-cinematic.\n\nKurosawa: Hold my beer.\n\n\nThere's so much to like about this movie, but the thing that I took away the most was how absolutely incredible the blocking of the actors is throughout. The drama of what's being discussed is so palpable just from where everyone is positioned in relation to each other and the camera. Beyond that, the story of the film is very inspired, truly captivating, and told with clear vision and style. Unfortunately not everything in the film holds up so well today (a fair few of the performances), so you do have to forgive some cheesiness. If you can get past that though, I highly recommend checking this one out.",
            "review_date": "2018-01-04",
            "source": "rt"
        },
        {
            "content": "A directorial masterpiece about perception which has gone on to be named in academia for the interpretations of events.",
            "review_date": "2017-12-21",
            "source": "rt"
        },
        {
            "content": "A timeless film about the subjectivity of truth. Expertly directed by Akira Kurosawa, using only three simple scene backrounds! The acting was very theatrical indeed  and the dialogues reminded me of ancient greek tragedies. A classical masterpiece not to be missed!",
            "review_date": "2017-11-27",
            "source": "rt"
        },
        {
            "content": "Tiny pearl, overpowering melodrama.",
            "review_date": "2017-10-29",
            "source": "rt"
        },
        {
            "content": "The film will always been know for its brilliant structure and studied deconstruction of human fallacy, but its questionable subject matter hasn't aged nearly as well.",
            "review_date": "2017-10-23",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa brilliantly portrays how an incident can be told as many different stories from different point of views and none of them coincides with the real truth which is yet unknown even after the movie finishes.",
            "review_date": "2017-10-12",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa's Rashomon is his masterpiece about subjectivity.  It is about a rape, a death, and several accounts of how they came about.  How did the victim die?  Who is lying?  Does anyone tell the truth?  How do we assess credibility?  What does truthfulness tell us about human nature?  Is there any cause for optimism about humanity?  Kurosawa artfully raised these questions and allows the viewer to come to the viewer's own conclusions.  Rashomon repays viewing again and again.",
            "review_date": "2017-09-14",
            "source": "rt"
        },
        {
            "content": "As good as the book!",
            "review_date": "2017-08-27",
            "source": "rt"
        },
        {
            "content": "Brilliantly crafted film with a groundbreaking narrative structure and eye opening direction by Akira Kurosawa. Simple yet brilliant set design and beautiful camera technique that changed the medium forever.",
            "review_date": "2017-08-04",
            "source": "rt"
        },
        {
            "content": "Rashomon masters inventive, backwards storytelling (you thought Memento did it first?). It's a cynical commentary on deceit and self-image. Throughout Rashomon is a prevalent feeling of unease - a sense that all is not what it seems. It trusts audiences to make their own deductions. Rashomon's rhythmic, cryptic storytelling and the astonishingly good acting continue to hypnotise western audiences. It is so un-Hollywood. You cannot be a film fan and not watch Rashomon at least once. If you watch it 50 times, you'll get something new from it each time.",
            "review_date": "2017-07-20",
            "source": "rt"
        },
        {
            "content": "The direction stands the test of time, the photography is superior and the plot is interesting.\nThe style of acting and representing emotions is changeling for Western eyes but given it is almost 70 years old and still works - it deserves a level of respect, one for the arts crew!",
            "review_date": "2017-07-16",
            "source": "rt"
        },
        {
            "content": "An influence to cinema lovers, Rashomon changed the foreign film business",
            "review_date": "2017-07-14",
            "source": "rt"
        },
        {
            "content": "Not just technically brilliant, but an intriguing mystery where the truth doesn't matter as much as the characters within it.",
            "review_date": "2017-06-30",
            "source": "rt"
        },
        {
            "content": "Rashomon was the game changer. However, Kurosawa's technique is less interesting now because it's been used so many times in the years since. Yet Rashomon is still a great film, studying the often submerged line between what is real and what is viewpoint.",
            "review_date": "2017-06-13",
            "source": "rt"
        },
        {
            "content": "A murdered samurai is found in the forest near some sort of post. We don't know what happened, but we are up for the task to find out as we get four different stories. One is told by the woman, one by a bandit, one by a woodcutter and one by the dead man himself. We switch back and forth in time, perspectives change, but the setting stays.\n\nVery complex and observative film that's got a great direction and some nice shots. Smart and open film by one of the greatest movie masters ever.\nI did like it a whole lot, even if it never engaged me completely. The idea and execution are swell, the nature and characters are nice features too.\nMysterious and a film that seem very open, still done with deeper statements even if the film itself is something you not necessarily get.\n\n8.5 out of 10 perspectives.",
            "review_date": "2017-06-12",
            "source": "rt"
        },
        {
            "content": "Awesome movie! Love the way it tells it's story through for different characters and how each one differs vastly from the other, even though I think the woodcutter's story is probably the most genuine. But overall, it was a great way to tell a story and it kind of reminds me of the way Pulp Fiction was written.",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "Amazing movie, this one had innovative narration that is used by many filmmakers today. Classic masterpiece, it is a little bit dated and demanding, that is why I gave it 4,5 stars.",
            "review_date": "2017-03-15",
            "source": "rt"
        },
        {
            "content": "I LIKE THIS STORY SCARY",
            "review_date": "2017-02-21",
            "source": "rt"
        },
        {
            "content": "As soon as man and rain are paired with the opening words, \"I just don't understand this,\" a sense of existentialism comes over me.  In fact, I pondered a bit too far away from the story, but I eventually caught up.  \n\nI love any film that recreates scenarios with different appearances, forcing us to question reality.  Kurosawa takes us deep into each version of the story at hand, so much that we forget there's anything outside of this, thinking we might just stay here and continue along.  Like the characters at the center of the story, we too lose grasp of what is truth and what is fiction, we believe our own version as these characters do.\n\nShimura is yet again playing a dualistic character with an underlying darkness that haunts the film.  In Scandal he is hiding a sin, but redeems himself by standing up to the corruption.  In Rashoman, he is as much a bandit as the person he swears against.  \n\nThe film deals with the fundamental question of whether or not man is just plain evil, or if he can do good.  Trust is shaken between friends by the end of the movie, a devilish function between them forcing them to question their own faith in one another.  They will prevail, but not without facing the lowest point of their relationship.  Shimura walks into the sunset with a left behind baby.  This part is a little too random for me, and while it does a decent job of forcing the question, it's too big of an idea to randomly throw in at the end of a movie.  This is not a film dealing with themes of birth and rebirth, not without us stretching our imaginations at least.  It seems an unnecessary device between these characters facing this question of truth.",
            "review_date": "2017-02-19",
            "source": "rt"
        },
        {
            "content": "This film utilizes one of my favorite story-telling techniques. I love when a plot is all about flashing back to the same story, but telling it from different points of view. In fact, Rashomon might use that method more effectively than any other movie I've seen. It's just fascinating because most movies use this type of plot strictly to show different points of view, but here they use it to talk about the vagaries of perception and memory.\n\nIt's one of those movies where they leave you hanging without telling you everything in the end. The fact that I desperately wanted to know what happened is a sign that the movie was working as it should. My big struggle with the movie is that, no matter how things really went down, I don't understand why all 3 people involved were motivated to take the blame for what happened. I suspect there's something about guilt that plays into that, but it would probably take a few times watching it to understand all of that.\n\nRashomon is a film that I keep thinking about hours after watching it, which is a great sign. I wasn't sure how good all the actors were, because I have trouble catching on to how well actors are capturing emotions when they aren't speaking English. It felt like a couple of them were a bit overly melodramatic, and the weird eyebrow situation on the women kept throwing me off. The film looks great for a black-and-white movie, and Kurosawa does some great things with light and shadows. I can always see why he is such a lauded director, and why this film is considered one of his best.",
            "review_date": "2017-02-16",
            "source": "rt"
        },
        {
            "content": "This is considered a classic and at the same time revolutionary, but I found it dull, too slow, gimmicky, and very annoying.  People just don't act like this.",
            "review_date": "2017-02-01",
            "source": "rt"
        },
        {
            "content": "I appreciate Rashomon for what it is and the influence that it had on film, but, to be completely honest, it hasn't aged very well. The pacing is a little uneven and the acting is distracting, at times. Nevertheless, you can't deny Kurosawa's talent in creating this iconic film with its multiple perspectives.",
            "review_date": "2017-01-30",
            "source": "rt"
        },
        {
            "content": "A tremendously influencial masterpiece of aesthetics and narration. The best of  Kurosawa's early works.",
            "review_date": "2017-01-19",
            "source": "rt"
        },
        {
            "content": "A 1989 essay on the Criterion site describes Rashomon as \"the best known, most widely shown Japanese film of all time\", which makes me wonder if I've been living in a bubble: I was aware that it was a Kurosawa film, but I'd never seen it and knew almost nothing about it, to the point where I was surprised it was another samurai-era picture. Certainly I wouldn't have hesitated a millisecond to name Seven Samurai as his best known and signature work.\n\nI'm very happy if I was mistaken, though, as I think this could well be my favourite of the bumper crop of Kurosawas our Criterion Watch has lavished on us so far (Seven Samurai, High and Low, Yojimbo, Sanjuro, The Hidden Fortress, and a sneaky preview of #316 Ran). My basic impression of Kurosawa from these was that he was the master of an extremely artful Japanification of western noirs, Shakespeare tragedies and, er, Westerns; immensely watchable but perhaps on the mainstream end of the spectrum of cinema's great auteurs. But Rashomon is like nothing I'd seen before, and as arthouse as my little heart could desire, so if I underestimated the great director, I can only now apologise.\n\nThe film starts in a rather leisurely fashion, with three travellers caught in a torrential downpour near the Rashomon gate in ancient Kyoto. One of them is visibly and audibly baffled by a mystery he has recently encountered, one that has apparently shaken his faith in human nature. Obviously this piques the interest of the newest arrival who demands the story be recounted. The man agrees and we are treated to several minutes of our woodcutter narrator travelling through the forest wherein he will stumble upon the scene of the crime. On first watch this long sequence seemed faintly indulgent, but once considered as the liminal journey into the dark, tangled realm of memory it acquired a retroactive majesty.\n\nThe crime in question is the rape of a samurai's wife and the samurai's murder by a bandit (played by a promising newcomer named Toshiro Mifune). Rape and murder were, it seems, fairly commonplace in 11th century Japan, but the curious feature of this case is that, over three separate retellings of the incident by its key players, each of them, the bandit, the lady, and the dead samurai (conveying his viewpoint via a rather spooky psychic medium, naturally) not only has a completely different recollection of what exactly occurred... each of them actually claims to have struck the killing blow!\n\nAlready we have the makings of a rather good Agatha Christie novel but Rashomon is not just a samurai whodunnit, it's a real journey into the darknesses of the human soul. Our woodcutter, the peerless Takashi Shimura, seems appalled to be discovering that the truth is built on sand and helpless against the tides of human vanity and pride. And if you thought that this all sounds complicated enough by now, think again, as in a further twist it turns out that the narrator of all these unreliable narrations is himself perhaps the most unreliable of all. But just in case spoilers might be an issue I'll stop there.\n\nThis is one of those movies that I quite enjoyed while I was watching but which grew in my estimation the more I read and thought about it afterwards. For one thing, on the first watch you're primed to take everything you see at face value - it's only much later in the film that you realise that everything you took to be \"reality\" is just a subjective version of the same. It may not click that Mifune and his co-stars are each playing four very different characters until quite close to the end. As such, here is a film that I wanted to watch again almost immediately the credits rolled, and I'm sure I'll be getting hold of a copy to do this very thing before too long.\n\nFour stars for much of the film (sometimes the rhythms of Japanese art can be a little daunting to someone half a world and more than half a century distant) transmuted to four-and-a-half once the pieces of the puzzle began to click into place. As I've already said, a strong contender for Kurosawa's greatest film; one of the closest things I've seen to a poem on celluloid; and just a truly unique piece of cinema. Hugely recommended.",
            "review_date": "2017-01-02",
            "source": "rt"
        },
        {
            "content": "The characters' perspectives of the addressed crime are all cleverly written and delightfully ambiguous, the sets are beautiful and realistic, and the performances are very well delivered. One of Japan's best classic films.",
            "review_date": "2016-12-28",
            "source": "rt"
        },
        {
            "content": "A story is never just one side, seldom just two sides, sometimes not even three, but more. A samurai morality play, with numerous twists and turns. One of Kurosawa many great great movies. One of his bests...",
            "review_date": "2016-11-14",
            "source": "rt"
        },
        {
            "content": "Kurosawa sure knows how to tell a story.",
            "review_date": "2016-11-13",
            "source": "rt"
        },
        {
            "content": "It's by no means badly written but remains rather badly acted, edited and directed, resulting in a pretty basic, inessential 90 minute crime film that feels like it's much longer. It's always kind of stressful when I fail to like or even appreciate so-called gems such as this but I stand by my opinion. I found this boring, badly pieced together and overall trying too much to get some \"philosophical\" points across through a barely interesting plot. \"Rashomon\" is not too hard to watch but why do it?",
            "review_date": "2016-08-22",
            "source": "rt"
        },
        {
            "content": "Influential for its effective use of flashbacks, \"Rashomon\" is a very recognizable Kurosawa piece.",
            "review_date": "2016-08-09",
            "source": "rt"
        },
        {
            "content": "A great - and now common - premise: three different versions of the same events that lead to a murder are recounted, and it's only at the end that we learn the truth is a mix of them all. Some average fight scenes and it really annoys me when they use the over-the-top fake maniacal laughing. Mifune is good as Tajomaru, the bandit and Kyo is versatile as the wife, Masago - Mori doesn't have too much to do as Takehiro, her husband and the victim. Because it's in black & white, there's no subtle difference in each retelling of the murder - just the same bush. Not too long and a good ending, it's a semi-obvious murder-mystery that could've been slightly better, or slightly worse.",
            "review_date": "2016-08-06",
            "source": "rt"
        },
        {
            "content": "I was unfortunately bored out of my mind.",
            "review_date": "2016-07-18",
            "source": "rt"
        },
        {
            "content": "Rating a classic like this is obviously foolish. Rashomon reminds us that truth is more than facts in the outer world, but what is going on in our own inner worlds.",
            "review_date": "2016-06-27",
            "source": "rt"
        },
        {
            "content": "In an exploration of thinking, master of film direction Akira Kurosawa perceptively created a riveting story with an extremely simple foundation, and provided insight into humanity as a whole.",
            "review_date": "2016-06-05",
            "source": "rt"
        },
        {
            "content": "4/5\nQuite the exceptional piece of storytelling fueled by its revolutionary directing and its almost 100% quotable script.",
            "review_date": "2016-06-03",
            "source": "rt"
        },
        {
            "content": "An empty movie from Kurosawa. It might have been fresh and interesting at the time but it is not now. Just an event (a murder to be precise) being told by different people involved with different characters.\nIt has no real meaning, and not interesting much. Nothing worthy, of anything.",
            "review_date": "2016-05-31",
            "source": "rt"
        },
        {
            "content": "Kurosawa's best. A surprising commentary that still seems to reflect even the most modern of times. He provides the story with challenging perspectives, true levels of character flaws, and blind judgment. What we get is a film most human.",
            "review_date": "2016-05-20",
            "source": "rt"
        },
        {
            "content": "Rather than giving a mystery surrounding a murder, Rashomon serves as a commentator about society's desires, dreams and destruction. A definite answer isn't given, but the trick is that we are given a chose of what the motivations and causes are and by the end we understand others better than we thought possible.",
            "review_date": "2016-05-13",
            "source": "rt"
        },
        {
            "content": "In the end it doesn't matter which of the stories is true. In truth, as the great Robert Altman once said of this film, \"they're all true, and none of them are.\" Those trying to decipher the mystery itself have missed the point, in my opinion.\n\n\"Rashomon\" is about the nature of truth and justice; the separation between truth and facts, and the sad cynicism of the sinful nature. People are capable of great cruelty and evil; man's inhumanity to man fills this movie, but, even in the end, we're left with hope, ambiguous as it may be.",
            "review_date": "2016-04-07",
            "source": "rt"
        },
        {
            "content": "cinegeek.de Kurz vor dem Dreh von Rashomon sprachen Kurosawas drei Co-Regisseure bei ihm vor. Sie waren unglücklich, da sie das Drehbuch nicht verstanden hatten. Kurosawa soll sie ermutigt haben, es noch einmal zu probieren - es sei verständlich! Sie waren sicher, es genau studiert zu haben. Ohne es zu verstehen. In Kurosawas Biographie (Something Like an Autobiography) kann man nachlesen, wie er ihnen Rashomon erklärt. Diese Erklärung wurde auch im Booklet der Criterion DVD abgedruckt. Zwei der Co-Regisseure waren anschliessend zufrieden, der Dritte nicht: Es gab einen Mord, vier Augenzeugen, aber keine Lösung. Die Berichte der vier Augenzeugen passen nicht zusammen. Jeder beansprucht für sich, der Mörder zu sein. Dem Studio gefiel Rashomon ebenfalls nicht, dass es sich sogar selbst aus den Credits tilgte. Doch der Film schlug weltweit ein wie der Blitz, gewann das Filmfestival von Venedig, ja verhalf dem japanischen Film insgesamt zum Durchbruch. Niemand hatte je derartiges gesehen! Zum ersten Mal sah man Rückblicke, die sich aber gegenseitig widersprechen, darüber, was nun tatsächlich geschah! Am Ende müssen wir drei mutmassliche Mörder akzeptieren, aber keine Auflösung. Die Genialität besteht darin, dass die drei vorgetragenen Perspektiven alle wahr und doch falsch sind. Kurosawa erklärt dass, da der Mensch überhaupt nicht in der Lage sei, über sich selbst Auskunft geben zu können. Das Wunderbare des Films ist die Tatsache, dass wir uns dennoch in die Geschichte vertiefen und letztgültig eine Lösung erwarten. Rashomon eröffnet mit einem fürchterlichen Regen. Zwei Männer, ein Mönch und ein Holzfäller, sitzen im Schutz einer Hütte. (Der Regen ist ein geeignetes Mittel, die Gegenwart von der Vergangenheit sichtbar zu unterscheiden.) Schliesslich rennt ein Knecht in die Hütte und erzählt, dass ein Samurai getötet und seine Frau vergewaltigt wurde. Während sie über das Geschehene diskutieren, wird deutlich, wie widersprüchlich ihre Erzählungen sind. Jeder scheint zu lügen, jeder beansprucht für sich, der Mörder zu sein. Das Drehbuch Kurosawas ist aber nur die Grundlage von Rashomon. Das Wundervolle sind für mich die grossen Gefühle und die Bilder (des Kameramanns Kazuo Miyagawa)! Miyagawa filmt direkt in die Sonne, was bis dahin ein Tabu darstellte. Genau das macht den Zauber von Rashomon aus, so dass wir uns wie in einem anderen Bereich der Realität fühlen. In einem langen Kampf zwischen dem Banditen (Toshiro Mifune) und dem Samurai (Masayuki Mori) können wir ihre Erschöpfung, ihre Angst, ihre Atemlosigkeit förmlich spüren. Während die Frau (Machiko Kyo), setzt Stille ein. Die Konzentration wird nun über Leben und Tod entscheiden.... Vor Rashomon hatte ich nicht sehr viele klassische japanische Filme gesehen. Ich kannte einige der leisen realistischen Dramen, in denen die Menschen sich in etwa so unterhalten wie wir es tun. Kurosawa aber geht es nicht um Realismus. Seine Protagonisten agieren mit mächtigen Emotionen, sie posieren und schreien. Kurosawa geht es nicht um Realismus! In seiner Biographie erfährt man, wie tief beeindruckt er von Stummfilmen war, da dort jede Emotion durch Mimik und Gestik ausgedrückt wird. Im nachhinein fällt mir auf, dass in Rashomon und auch anderen Kurosawa Klassikern viele Szenen stumm bleiben. Doch was sehen wir? Eine Filmkamera suggeriert Objektivität. In Rashomon aber lernen wir, dem nicht zu trauen, was wir sehen. Das ist das Fundament von Kurosawas Philosophie: Kurosawas letzter Film handelt von einem Lehrer, der bald sterben wird. In dem Moment, da sein Tod naht, wird niemand weniger darüber wissen als er selbst.\nmehr japanische Klassiker findet ihr in den Film Lists auf cinegeek.de",
            "review_date": "2016-03-10",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa's masterpiece has become a copied plot-line since its release.  The \"same story from many perspectives\" is standardized here for subsequent generations to repeat over and over.\n\nThe film is an excellent tale, and despite it being Japanese, is still quite satisfying to watch.",
            "review_date": "2016-02-05",
            "source": "rt"
        },
        {
            "content": "An extremely shocking picture, Rashomon is a film that really makes you think, as well as showcase Akira Kurosawa's excellent direction.",
            "review_date": "2016-01-09",
            "source": "rt"
        },
        {
            "content": "A typically finely-shot and well-scripted drama from Akira Kurosawa, but after all the intrigue and character experiments, which are quite painfully acted, the main point seems lost.",
            "review_date": "2016-01-03",
            "source": "rt"
        },
        {
            "content": "Whodunnit, jidaigeki style. A very interesting watch. Great acting and chilling throughout.",
            "review_date": "2015-12-29",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa's Rashomon is famous for recounting a murder from several eyewitness points-of-view, all of which are drastically different, but similar in some aspects. After watching this movie a number of times, I've come to the conclusion the woman committed the murder of her samurai husband, and each witness claimed otherwise for their own motives.\n\n1) In all of the accounts, the wife wanted her husband to be killed.\n\n2) The first account is from Toshiro Mifune's bandit. He gleefully boasts of a valiant battle with the samurai (at the wife's request) before killing him. He claimed the killing because he knew he would hang for it anyway, and wanted to boost his own reputation by claiming to have defeated a samurai while also protecting the wife who he was infatuated with. When asked about the wife's missing dagger, he seems caught off-guard.\n\n3) The wife testifies after she was raped by the bandit, her husband looked at her with cruel contempt. She is playing the total victim, pleading for sympathy from the unseen judges. She claims to have blacked out and found her husband stabbed with her dagger when she came to, although we presume she killed him and left that part out. She hadn't heard the bandit's version, so she can't place the blame on him.\n\n4) The samurai tells his story from beyond the grave through a medium, which adds another level of unreliability. In his version of the story, he never fought the bandit, even though his wife asked the bandit to kill him, and he killed himself with his wife's dagger. He is a samurai and wouldn't admit to being defeated in battle by a bandit or killed by a woman, so claiming to kill himself allows him to be remembered honorably, which would be more important to him than justice.\n\n5) The woodcutter tells the final account after the trial. His story feels the most authentic. The bandit and samurai are scared as they fight to the death at the wife's request. The story more closely resembles the bandit's version, but the bandit comes off as more desperate in the woodcutter's version. The woodcutter, who had heard all the accounts, makes the ending match the bandit's to cover his own theft of the dagger.\n\nI've come to the conclusion the bandit fought the samurai and beat him as told in the bandit's and woodcutter's accounts, but didn't kill the samurai. After leaving the samurai on the ground, his wife finished him off with the dagger, which was then stolen by the woodcutter.\n\nOf course, every viewer has their own interpretation. I love that this movie is not one that can be viewed passively, but can be reflected on long after and with multiple viewings.",
            "review_date": "2015-12-23",
            "source": "rt"
        },
        {
            "content": "\"Rashomon\" is considered to be one of Kurosawa's best movies, and this is a movie that studies human nature, the film examines a brutal rape and murder from four different perspectives. The film's main motivation is not revealing which story is true, but to reveal the greed and deceit that a person is capable of and that it is difficult for one person no matter how inherently good he is to always do the right thing. But what is the right thing to do? that depends on certain situations as this movie shows us.",
            "review_date": "2015-12-16",
            "source": "rt"
        },
        {
            "content": "Haunting, beautiful tale of ego, perspective and humanity's flaws. A classic.",
            "review_date": "2015-12-05",
            "source": "rt"
        },
        {
            "content": "A dark, silent, effective drama flick with you as a character, Kurosawa captivates  quickly with his brilliant mind and effective symbolism. I have not and surely will not ever see a movie quite so well themed as Rashomon.",
            "review_date": "2015-11-12",
            "source": "rt"
        },
        {
            "content": "While the critical discussion of Rashomon is largely relegated to the dissection of its narrative structure and how this structure has become somewhat ubiquitous since its release, it's important to remember what this structure is in service of: a powerful statement about the human condition. Man has the capacity for theft, dishonesty, murder, and general depravity and this perception of the supposed human tendency towards selfishness has resulted in several socio-economic schools of thought that cater to this idea. Rashomon acknowledges this, but avoids rote pessimism by also presenting man's tendency towards righteousness, offering a more nuanced look at what human beings are capable of that is just as poignant as its form of conveyance.",
            "review_date": "2015-11-07",
            "source": "rt"
        },
        {
            "content": "Three witnesses offer conflicting accounts of the same crime and only manage to prove how unreliable people are. 5 bursts of hysterical laughter /5",
            "review_date": "2015-10-26",
            "source": "rt"
        },
        {
            "content": "Restaurado pela fundação do Scorsese, vi um dos filmes que mais explodiram minha cabeça, hoje na Mostra...",
            "review_date": "2015-10-24",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2015/09/rashomon.html",
            "review_date": "2015-09-27",
            "source": "rt"
        },
        {
            "content": "This is somewhat of a spoiler for another film right off the bat, but Rashomon is more effective in letting the viewer discern what is true and what is not than The Usual Suspects. It frightens the priest as it should frighten us what we discern about the nature of man.\n\nThe beginning focuses on a priest and a woodcutter in shock after having heard three separate versions of the same event in a trial of sorts. The priest is a little repetitive about how much of a tragedy these stories are, but it is still a powerful dialogue with a close- up on the priest.\n\nThe story varies from person to person, but what is in all four of the versions presented (the woodcutter tells what he saw towards the conclusion of the film) is the rape of the wife of a samurai by a bandit, and the murder of the samurai. Things get more tense and dramatic as we switch from story to story, each containing a different version of how the samurai died and a different motive each time. We are constantly asking whether one or more of the witnesses lied to protect the others, or if they are justifying their actions - either way, we get a depressing view of human nature; all three are portrayed as terrible people within the film.\n\nWhat is fairly necessary so that the film is not too pessimistic is the conclusion with the woodcutter making a decision to take care of an abandoned baby which restores the priest's faith in humanity. Like Birdman, I would have liked if this film ended just a few minutes earlier, but it is still powerful at the close of the film.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "Back in 1950, Akira Kurosawa changed and challenged the grammar of filmmaking with Rashomon, and its foray into the unknown. Few have managed to match his efforts since; the film would've been unlike anything anybody had ever seen before. And even today, its intricate mastery and majesty will envelop the film-literate with awe.\nRashomon is a movie of multiple truths and myth-making, raising the idea of whether or not the camera can be truly subjective. Visually and narratively innovative, Rashomon ranks amongst Kurosawa's most accomplished and definitive films; the auteur's artistic background lingering over his frames, which tend to mimic both Western and Eastern styles of painting.\nMany films are great, and many films are influential, but Rashomon holds the lasting power of an entire film movement within a mere 88 mins. Essential cinema.",
            "review_date": "2015-07-14",
            "source": "rt"
        },
        {
            "content": "It possesses an innovative narrative structure that nicely ends with an understood message delivered in a same style that most of the 20th-century classics had expressed, which is why this was considered a great masterpiece from Japanese filmmaker Akira Kurosawa before \"Seven Samurai\". Although, despite fitting into the film's delivered message, the nature and behavior seen throughout the film is strange with the pacing being distant a couple times. But overall, it's a masterful story that makes foreign films talented. (B)\n\n(Full review coming soon)",
            "review_date": "2015-06-15",
            "source": "rt"
        },
        {
            "content": "94%\nWatched this on 3/6/15\nAkira Kurosawa's impeccable morality check murder mystery has an innovative feel and has the feel of another similar film 12 Angry Men which also explores the human condition. The film has superb acting, stylized film making, a different approach to the handling of it's premise and innumerous plot twists and is more engaging compared to most other films of the 20th century.",
            "review_date": "2015-06-03",
            "source": "rt"
        },
        {
            "content": "This Masterpiece from Akira Kurosawa is one of the all-time greatest films from International cinema.  I hadn't seen it in a long while, and it looks fantastic on Blu-ray.  It examines a crime from four different perspectives, and of course they are all different.  Very interesting film that is a MUST for all cinema lovers!",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "Brilliant.  So groundbreaking and impressive.  A must watch for any true cinephile.  Once again Kurosawa leads the pack and was the inspiration for so many movies.",
            "review_date": "2015-04-23",
            "source": "rt"
        },
        {
            "content": "A superb narrative storytelling of a rape-homicide told at a vantage point full of ambiguity through another human perception. Masterfully directed by Akira Kurasawa with impressive and fluid visual; stunning performance from all cast. Ultimately, Rashomon is about pride, greed and hope in humanity.",
            "review_date": "2015-04-03",
            "source": "rt"
        },
        {
            "content": "Perfect. Satisfyingly thrilling/disturbing and profound. Kept me on the edge of my seat.",
            "review_date": "2015-04-02",
            "source": "rt"
        },
        {
            "content": "A great thriller by Kurosawa.  Love Mifune's work, and even though it is a great thriller, it makes you think about the human condition.",
            "review_date": "2015-03-31",
            "source": "rt"
        },
        {
            "content": "I like the order of the film. We see four people tell their own perspective on a tragic event, like a detective interviewing witnesses to collaborate their stories to solve a crime. It makes you appreciate how hard it must be to find the truth when  everything is so subjective. It's a film about the philosophy of truth, reality and human nature. The film looks great. The cinematography is so marvelous words can't do it justice. There's so much masterful work going on behind the camera lens. Every event is given it's own visual treatment. The cast is also great. It's impressive watching the actors film the same scene four times in different ways. And the medium was a nice touch. A little fantasy in the story compliments the magical aesthetic.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "a classic story of the one man death.",
            "review_date": "2015-03-12",
            "source": "rt"
        },
        {
            "content": "I liked tajomarus acting and I appreciate the message of dishonesty but wasn't that blown away",
            "review_date": "2015-03-06",
            "source": "rt"
        },
        {
            "content": "So who is telling the truth? And what is truth?",
            "review_date": "2015-02-27",
            "source": "rt"
        },
        {
            "content": "i like  Toshiro Mifune but the movie is boring",
            "review_date": "2015-02-11",
            "source": "rt"
        },
        {
            "content": "Ultimately I give this film something near 4 stars. \nI try to explain my relatively low rating of this classic below. \nI recommend that it should be watched at any rate.\n---\nWhile my first viewing experience was marred (as expected) by the films cultural ubiquity \n(https://twitter.com/Marcusdweeb/status/564446148698857472) \nand perhaps by plain old fashioned dated-ness (e.g. some scenes felt slightly longer than they needed to be)**, I was surprised by the power*** this film ultimately generates from its philosophical premise. \n\nBy the end this film managed to provoke thought for a viewer who had assumed, in his own life, that he had gone over this territory before.\n\n-----SPOILER ALERT---- \nI was also surprised by the human-ness of 'the final unveiling' of the truth (or something like the truth.) I expected, from watching various homages over the years, that said unveiling/twist would involve an all knowing villain manipulating events. Instead I got a denouement with significantly more depth. A far more human and understandable**** answer.\n-----END OF SPOILER ALERT-----\n\n\n**(Both this factor and its cultural ubiquity created a barrier for me, stopping me from being properly immersed, even though the film fostered admiration through its various decisions.)\n\n*** (If power is the right word. Another philosophical quandary.)\n\n**** (and enlightening)",
            "review_date": "2015-02-08",
            "source": "rt"
        },
        {
            "content": "The cinematography is out of this world. Every shot is beautiful and the acting is wonderful.",
            "review_date": "2014-12-25",
            "source": "rt"
        },
        {
            "content": "Every single part is perfect. It is perfect.",
            "review_date": "2014-12-11",
            "source": "rt"
        },
        {
            "content": "Amazing cinematography work for it's time.",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "An inspirational masterpiece. It's brilliant. If you haven't seen it yet, I URGE you to.",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Excellent. 9.4/10. A.\n\n\nWith brilliant cinematography as well as thoughtful writing along with the marvelous editing and top-notch, brilliant and masterful direction, Rashomon has a very entertaining narrative as well as a study and meditation on shame, honesty, and reality - a message about perception vs. reality, not lying to others but lying to ourselves.",
            "review_date": "2014-10-18",
            "source": "rt"
        },
        {
            "content": "Whoa! Theatrical and intellectual and still emotionally engaging. A film that has me thinking about it, and talking about it for a long time afterwards. And a films I will want to see again.",
            "review_date": "2014-10-14",
            "source": "rt"
        },
        {
            "content": "With brilliant plot, wonderful cinematography, fully realized characters, amazing acting and powerful ending, Rashomon is also thought-provoking, poignant, smart and groundbreaking in both cinematography (use of sunlight) and plot structure (told from different perspectives and ambiguous). The movie also has an interesting, dark and creepy supernatural sequence, gloomy but relevant message and wonderful, still hopeful ending. It is an absolute masterpiece, one of the best films of the decade and one of the very best Japanese films ever made.",
            "review_date": "2014-09-08",
            "source": "rt"
        },
        {
            "content": "A bleak depressing film that has been imitated many times but never surpassed.",
            "review_date": "2014-07-28",
            "source": "rt"
        },
        {
            "content": "What it lacks in intrigue, it more than makes up for in plot, pacing and general inventiveness.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "A recent incident involving a kidnapping, a rape and a murder where the three people involved (a husband, his wife and a bandit) have conflicting accounts of events, lead three men sheltering from a storm to reflect on man's propensities for truth/deceit and good/evil.\nThe mystery surrounding the events in the forrest provide a great hook to keep the plot progressing but Kurosawa seems to have more to say. There's a sense that the spectre of World War 2 hangs over this film: the three men (a woodcutter, a priest, and a commoner) take shelter in the dilapidated gateway of what seems to be a town in ruins, commenting regularly on how \"the world has gone to hell\", but it's the three conflicting views to the one incident that could serve as a fitting parable for a world still making sense of how it could almost blowing itself asunder. Kurosawa himself is reported to have said the film is a reflection of life, which doesn't have clear meanings, but you'll find yourself searching for them anyway as the revelations and reflections progress to their surprising conclusion.\nIn spite of its age, Rashomon remains an unforgettable and engrossing film.",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "Perhaps it's because I saw The Outrage first, but I did not enjoy this film as much. Perhaps it's simply because The Outrage is a western. Did not like the Samurai speaking from the grave.",
            "review_date": "2014-07-11",
            "source": "rt"
        },
        {
            "content": "Pretty great movie. Very mind-boggling, great acting. Entertaining for a \"who-done-it\" film.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "With rich textural ambiance of the woods and mind boggling narratives, Rashomon powerfully evokes the ugliness of human's nature.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "awesome period piece",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "Rashomon (1951)\n\nThis revolutionary movie by Akira Kurosawa was ground-breaking for its time and has been copied many times in subsequent films and television since then.  Basically the retelling of the same story from the different perspectives of the four main characters.  What is the truth, maybe none of it.",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "Perfect, even better than Seven Samurai.",
            "review_date": "2014-05-22",
            "source": "rt"
        },
        {
            "content": "Innovative and well-acted, a classic.",
            "review_date": "2014-05-12",
            "source": "rt"
        },
        {
            "content": "Rashomon is revolutionary for creating a new way to tell a story, using the human mind and it's unreliability.",
            "review_date": "2014-05-06",
            "source": "rt"
        },
        {
            "content": "While it is not my favorite Kurosawa films, it maybe the best written one......seriously, did this guy make a bad film?",
            "review_date": "2014-05-05",
            "source": "rt"
        },
        {
            "content": "Absolutely remarkable. Everything you've heard is true. Or, more to the point, nothing is, in this extraordinary morality tale about multiple perspective, and the shifting nature of truth. The bandit's - and especially the woman's - manic cackling get a bit too much at times - but, hey, this is Japan we're talking about, we're everyone is a little kooky, or a lot. This film - like so few films - gets better and more intriguing as it goes along. The detail and care in every scene, every shot, is astonishing. Love the difference is the way the men duel dependent upon viewpoint. There's more than four viewpoints here too - the \"do gooder\" who captures the bandit embellishes the arrows (or does he?). The framing device (literally and figuratively) of the three dudes under the gate in the rain is perhaps the best part of the film too, with the bitter, cynical interpretations on the self-serving selfishness of mankind balanced against constantly shifting grey areas (literally and figuratively) and tilting, at least occasionally, towards decency. Entrancing stuff that resonates for days. I've seen and read lots of works over the years that try to copy Rashomon. I'm glad I have finally seen the real thing. Because nothing else comes close.",
            "review_date": "2014-04-28",
            "source": "rt"
        },
        {
            "content": "I heard about this movie for a long time and now that I have finally seen it, I find it's one of Kurosawa's more incomprehensible films.  The only two things I could discern from this film was everyone sees reality in a different way and the world is not as bad as we perceive it to be.  The Seven Samurai is still my favorite Kurosawa film.",
            "review_date": "2014-04-24",
            "source": "rt"
        },
        {
            "content": "A landmark in cinema and the most important film that came from japan on the 50's, Kurosawa's masterwork opened the door to many other foreign films not just from japan but from around the world. Rashomon and its unique narrative story,the very well acted performances (specially that of Toshiro mifune) is what makes of this film a must see for true cinema lovers.",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "Full written review soon.",
            "review_date": "2014-04-11",
            "source": "rt"
        },
        {
            "content": "Groundbreaking narrative and moral elements, stylish camera wizardry and challenging discussions of right and wrong abound, Rashomon is a challenging classic.",
            "review_date": "2014-04-02",
            "source": "rt"
        },
        {
            "content": "Nothing short of fantastic",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "It's a bit hard to get past those painted on eye brows and a couple aspects in the performances which I suppose come down to culture but Rashomon's influence on film narrative is well known and it's a very interesting look not just at characters' points of view but also their motivations.",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "Though I have been interested in cinema for a couple of years, I haven't had the opportunity, until recently, to watch a Kurosawa film. I wanted to start his filmography with The Seven Samurai but that isn't available yet here in the format that I normally watch in and my local library doesn't have the film available on their shelves. I borrowed two Kurosawa films from the library, this and Red Beard, and I was contemplating which of the two I should watch first. I eventually just decided to watch the one that was released first chronologically in order to see some sort of progression in his work. Rashomon was a film that I thought would only entertain me in a shallow kind of way; figuring out who did it and watch thrilling fights between characters. Instead Rashomon gave so much more, exploring deep themes and ideas.\n\nThe film's screenplay was written by Akira Kurosawa and Shinobu Hashimoto. This would be Hashimoto's first screenplay and the first of many collaborations with Kurosawa. On the surface they have written a thrilling story of a murder, and the writers have decided to have it be told in multiple perspectives. I think the film would have worked if it just plainly focused on the entertainment aspect of it, but this would lose it's replay value as I feel this film requires multiple viewings in order to completely understand each perspective being explored. The film's heart is in it's exploration on the human soul. It shows us the sin that has taken over us and that it has spread to the souls of others, becoming a common trait in society. This concept is much more impactful on the citizens of Japan as virtues and sins are ideas that are very important to them, and my understanding of that allowed me to relate to the feelings that the film's characters are suffered with. Rashomon shows us that society's integrity have been lowered to a standard that makes people selfish, dishonest, violent, and manipulative. The stories that are being told seem to feed the egos of the characters, in order to make themselves be the virtuous person that they think they are or wish to be. The writers never gives a clear answer of the truth, and in the end it doesn't really matter because what might be said by anyone by the end of it, would just come off as mendacious. This concept of damaged humanity has been touched on by many films that succeed this, but none I can recall have wrapped it in a story as simplistic as this. The film's dialogue was entertaining to listen to as it defines it's characters so well that each one becomes memorable. The film's story is great but I think I would enjoy it a lot more during my subsequent viewings, as I would have spent more time thinking about it's ideas and themes rather than it's plot and how it would unfold.\n\nThe film was directed by Akira Kurosawa, and Rashomon would be the first film I have seen from him. What a great way to start his filmography; a great film that is both thought provoking and entertaining. I am not familiar with Japanese cinema and I have wanted to give it a try for quite some time, who better to start with than Kurosawa. He has showed me just how great Japanese cinema could be with a tale that is very grounded to it's roots but also containing themes that are universally relatable. Kurosawa was able to make something as complicated as telling 4 different stories and make each one equally entertaining and digestible. He doesn't try to confuse you, instead he tries to make you see more than what is just plainly shown. By the end of the film, Kurosawa doesn't leave us with anything that suggest that one person's perspective is right over the other because it's all the same, regardless of what happens. I was surprised to see that this film only runs for about an hour and a half, when a story like this would usually have directors be indulgent and highly informative in it's storytelling, but Kurosawa opted for a more stripped down style, removing all unnecessary content, allowing the film to become more focused on what it wants to say. I also really enjoyed the way Kurosawa managed the action sequence between Tajomaru and Takehiro during both confrontations, as he was able to demonstrate a contrast between reality and exaggeration, and also through these sequences, he showed layers of these characters that were really interesting to watch. I think Kurosawa wanted us to believe at the end that there is still a chance to fix ourselves and that we aren't stuck with the values that are given to us.\n\nThe film's cinematographer was Kazuo Miyagawa and what he has done for this film was excellent. I truly admired the way he used natural light and manipulating it to illuminate the scene. He wanted the film to feel natural, like as if we were present witnessing the event as it happened. Miyagawa used shadows as a way of creating this deep and mysterious atmosphere. Even the subtle uses of it, like the breeze that Tajomaru feels as Kanazawas pass by him, creates that natural presence that makes the scenes look and feel convincing. Miyagawa, a lot of the time, has the camera moving which then controlled the film's pace, with only static shots present to highlight expression from the actors. The dolly shots at the start of the film were mesmerizing to look at and he really made use of the environment, following actors wherever they go and not have them be boxed in a frame. I enjoyed watching the close-ups that he created as it really seems to capture the essence of the film's characters, letting the audience see deeper than what is just presented. I was also amazed on the way Miyagawa used rain in the film, reminding me of how Fincher used it in Seven; it created this melancholy atmosphere and it was like a barrier of sorts that prevents these three people from leaving this broken temple.\n\nThe film's score was composed by Fumio Hayasaka. I wasn't so wild about his work here, with some moments feeling a bit forced in trying to get a reaction from it's audience. The score isn't a disaster by any means but it just didn't do much for me. There isn't more I can say about his work because there is very little I remember about it. I was more invested in the film's cinematography and story.\n\nRashomon doesn't have a large cast, and the film mostly focuses on a certain event that included three people. The film's main actors were Toshiro Mifune, Machiko Kyo and Masayuki Mori. I thought for the most part, they were great to watch. Mifune and Mori were really great in their roles, embodying almost three different sides of their characters. Kyo on the other hand was tolerable but for the bulk of the film, she just seems to show two sides of her, crying and not crying. It would have been better if she wasn't so melodramatic in displaying emotion and try not so hard to be the centre of attention during a scene. Takashi Shimura, Minoru Chiaki, and Kichijiro Ueda were great together, particularly the last few minutes of the film. These characters seemed more natural than the three actors involved in the main plot, maybe to create a close representation of the audience or maybe to contrast between perception and reality? All in all, the acting in this film was a delight.\n\nRashomon is a great film, and over time may prove more positively with me. This was a great entry into the work Kurosawa and I am excited to see what else he has created.",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "Though I have been interested in cinema for a couple of years, I haven't had the opportunity, until recently, to watch a Kurosawa film. I wanted to start his filmography with The Seven Samurai but that isn't available yet here in the format that I normally watch in and my local library doesn't have the film available on their shelves. I borrowed two Kurosawa films from the library, this and Red Beard, and I was contemplating which of the two I should watch first. I eventually just decided to watch the one that was released first chronologically in order to see some sort of progression in his work. Rashomon was a film that I thought would only entertain me in a shallow kind of way; figuring out who did it and watch thrilling fights between characters. Instead Rashomon gave so much more, exploring deep themes and ideas.\n\nThe film's screenplay was written by Akira Kurosawa and Shinobu Hashimoto. This would be Hashimoto's first screenplay and the first of many collaborations with Kurosawa. On the surface they have written a thrilling story of a murder, and the writers have decided to have it be told in multiple perspectives. I think the film would have worked if it just plainly focused on the entertainment aspect of it, but this would lose it's replay value as I feel this film requires multiple viewings in order to completely understand each perspective being explored. The film's heart is in it's exploration on the human soul. It shows us the sin that has taken over us and that it has spread to the souls of others, becoming a common trait in society. This concept is much more impactful on the citizens of Japan as virtues and sins are ideas that are very important to them, and my understanding of that allowed me to relate to the feelings that the film's characters are suffered with. Rashomon shows us that society's integrity have been lowered to a standard that makes people selfish, dishonest, violent, and manipulative. The stories that are being told seem to feed the egos of the characters, in order to make themselves be the virtuous person that they think they are or wish to be. The writers never gives a clear answer of the truth, and in the end it doesn't really matter because what might be said by anyone by the end of it, would just come off as mendacious. This concept of damaged humanity has been touched on by many films that succeed this, but none I can recall have wrapped it in a story as simplistic as this. The film's dialogue was entertaining to listen to as it defines it's characters so well that each one becomes memorable. The film's story is great but I think I would enjoy it a lot more during my subsequent viewings, as I would have spent more time thinking about it's ideas and themes rather than it's plot and how it would unfold.\n\nThe film was directed by Akira Kurosawa, and Rashomon would be the first film I have seen from him. What a great way to start his filmography; a great film that is both thought provoking and entertaining. I am not familiar with Japanese cinema and I have wanted to give it a try for quite some time, who better to start with than Kurosawa. He has showed me just how great Japanese cinema could be with a tale that is very grounded to it's roots but also containing themes that are universally relatable. Kurosawa was able to make something as complicated as telling 4 different stories and make each one equally entertaining and digestible. He doesn't try to confuse you, instead he tries to make you see more than what is just plainly shown. By the end of the film, Kurosawa doesn't leave us with anything that suggest that one person's perspective is right over the other because it's all the same, regardless of what happens. I was surprised to see that this film only runs for about an hour and a half, when a story like this would usually have directors be indulgent and highly informative in it's storytelling, but Kurosawa opted for a more stripped down style, removing all unnecessary content, allowing the film to become more focused on what it wants to say. I also really enjoyed the way Kurosawa managed the action sequence between Tajomaru and Takehiro during both confrontations, as he was able to demonstrate a contrast between reality and exaggeration, and also through these sequences, he showed layers of these characters that were really interesting to watch. I think Kurosawa wanted us to believe at the end that there is still a chance to fix ourselves and that we aren't stuck with the values that are given to us.\n\nThe film's cinematographer was Kazuo Miyagawa and what he has done for this film was excellent. I truly admired the way he used natural light and manipulating it to illuminate the scene. He wanted the film to feel natural, like as if we were present witnessing the event as it happened. Miyagawa used shadows as a way of creating this deep and mysterious atmosphere. Even the subtle uses of it, like the breeze that Tajomaru feels as Kanazawas pass by him, creates that natural presence that makes the scenes look and feel convincing. Miyagawa, a lot of the time, has the camera moving which then controlled the film's pace, with only static shots present to highlight expression from the actors. The dolly shots at the start of the film were mesmerizing to look at and he really made use of the environment, following actors wherever they go and not have them be boxed in a frame. I enjoyed watching the close-ups that he created as it really seems to capture the essence of the film's characters, letting the audience see deeper than what is just presented. I was also amazed on the way Miyagawa used rain in the film, reminding me of how Fincher used it in Seven; it created this melancholy atmosphere and it was like a barrier of sorts that prevents these three people from leaving this broken temple.\n\nThe film's score was composed by Fumio Hayasaka. I wasn't so wild about his work here, with some moments feeling a bit forced in trying to get a reaction from it's audience. The score isn't a disaster by any means but it just didn't do much for me. There isn't more I can say about his work because there is very little I remember about it. I was more invested in the film's cinematography and story.\n\nRashomon doesn't have a large cast, and the film mostly focuses on a certain event that included three people. The film's main actors were Toshiro Mifune, Machiko Kyo and Masayuki Mori. I thought for the most part, they were great to watch. Mifune and Mori were really great in their roles, embodying almost three different sides of their characters. Kyo on the other hand was tolerable but for the bulk of the film, she just seems to show two sides of her, crying and not crying. It would have been better if she wasn't so melodramatic in displaying emotion and try not so hard to be the centre of attention during a scene. Takashi Shimura, Minoru Chiaki, and Kichijiro Ueda were great together, particularly the last few minutes of the film. These characters seemed more natural than the three actors involved in the main plot, maybe to create a close representation of the audience or maybe to contrast between perception and reality? All in all, the acting in this film was a delight.\n\nRashomon is a great film, and over time may prove more positively with me. This was a great entry into the work Kurosawa and I am excited to see what else he has created.",
            "review_date": "2014-03-25",
            "source": "rt"
        },
        {
            "content": "The subjective nature of truth is at the heart of this poetic film about the seduction of a woman, the death of her husband, the bandit who confesses, & the woodsman who witnesses it all. A powerful film that everyone should watch at least once.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "It is not a great samouraï movie, or a reflexion about the human mind and weakness, or a philosophical story of the humanity's deepest sins, but a true piece of art from Kurosawa.",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "An incredible masterpiece.",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "More than half a decade later, Kurosawa still is relevant as he keeps shaping the visions of generations of filmmakers. And it keeps getting better after each viewing.",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "This classic Japanese film from master director Akira Kurosawa is by now considered one of the most influential film in history. The structure of the film is pretty interesting and the heavy symbolism displayed throughout the film contribute greatly to it's timeless iconic status. Although today some of the elements feel dated and overplayed, the film remain a beautiful piece of film making with undeniable artistic qualities. A must see for film fans.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "\"Rashomon\" is one of cinema's most profound films. Its insights continue to haunt me.\n       H. W. Zegers",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "Now I see why Kurosawa is held in such high esteem. And then you have the dashingly handsome and charismatic Toshiro Mifune. Wonderful.",
            "review_date": "2014-01-30",
            "source": "rt"
        },
        {
            "content": "One of the most brilliant dramas I have ever seen, this is a thought provoking film where you need to have your own interpretation of it. The acting from the entir ensemble in each different scenario is wonderful, the writing is creative, honest and powerful, but sometimes quite hilarious and the cinematography is kinetic just like Akira Kurosawa's direction. A tour de force of filmmaking, this is a masterpeice and is the only  Kurosawa movie I've seen, but I wanna see more.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "as thought provoking about the nature of humanity as it is masterly crafted with top notch performances.  Time goes on yet the beauty of Rashomon will probably last forever. Classic cinema at its best form (y)",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "Kurosawa with his godly cinematography and writing (as usual), but also being concise (what a pleasant surprise!)!",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "Brillante, magnifica y sorprendente film de Kurosawa, Una de mis preferidas de todos los tiempos.",
            "review_date": "2014-01-17",
            "source": "rt"
        },
        {
            "content": "An excellent story with unexpected twists, great acting and a moving message. One of the essentials",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "Kurosawa's Rashomon remains a classic crime story, and the original multiple perspective picture.",
            "review_date": "2013-12-16",
            "source": "rt"
        },
        {
            "content": "One of the most important films of all time that ushered in a new respect for international filmmaking but also changed the medium in and of itself. Superbly written, beautifully shot and perfectly acted, this 63 year old film remains timeless. A true classic of cinema. Wow.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "As a film student, I appreciated this film a lot when I studied post world war two japan. So much symbolism and truth about our world.",
            "review_date": "2013-12-03",
            "source": "rt"
        },
        {
            "content": "Here we have a good example of a movie that you only can describe with one word: Perfect. It has perfect acting, direction, lighting, camerwork and at last but not least: a perfect story, that actually was quite unique for it's time.",
            "review_date": "2013-11-23",
            "source": "rt"
        },
        {
            "content": "My first Akira Kurosawa film, again I saw as a child. Complex. Humane. Beautiful cinema. A great human watching experience. Substance. Depth. Subtleties of being born a human being.",
            "review_date": "2013-11-22",
            "source": "rt"
        },
        {
            "content": "If any film is guaranteed to make your life more intelligent and cultured, this is it.",
            "review_date": "2013-11-12",
            "source": "rt"
        },
        {
            "content": "Who do you believe- or do aspects of each retelling fit as parts of the actual truth? A timeless tale worth revisiting.",
            "review_date": "2013-11-11",
            "source": "rt"
        },
        {
            "content": "Very Original Picture, \n\na Must Watch Film !!",
            "review_date": "2013-11-08",
            "source": "rt"
        },
        {
            "content": "Love multi-perspective films. This really sets the tone for future following this narrative to come",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "The greatest art film from the 20th centuries greatest cinematic artist. A completely original experience that has been photocopied but never as powerfully constructed.",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "A crime told by the point of view of all the characters involved, and each version of the story contradicts the other. Great use of narrative and an engaging plot. The cinematography and music are also worth mentioning. I felt the pacing was uneven at times and the girl was pretty annoying, but that doesn't affect the movie much. Interesting and with clever undertones like the hope in humanity.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "Si son rythme est un peu etrange pour nous autres Occidentaux, Rashomon reste un film profondement passionnant de par son message, distille a petites doses (a l'image des indices sur le meurtre dont le film fait reference), et par sa direction d'acteurs, encore une fois parfaite, avec un immense Toshiro Mifune (comme d'habitude). Le score de Fumio Hayasaka est un peu trop present, cependant.",
            "review_date": "2013-09-09",
            "source": "rt"
        },
        {
            "content": "http://thepiratebay.sx/torrent/5844672/Rashomon_1950_720p_BRRip_x264_AAC-BeLLBoY_(Kingdom-Release)",
            "review_date": "2013-09-05",
            "source": "rt"
        },
        {
            "content": "Kurosawa truly is a master of filmmaking.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "\"Well, men are only men. That's why they lie. They can't tell the truth, even to themselves.\"\r\n\r\nRashomon was the first film from critically acclaimed Japanese director, Akira Kurosawa, that I got to see. I was expecting some great things from this film considering it ranks among the best films in history. The black and white cinematography was breathtaking and there were some great long shots, but the story fell flat and the performances here were a bit theatrical for my taste. The film is only 85 minutes long, but it seemed to drag forever. The film was made in 1950 so I can imagine there were several inventive elements incorporated here, but they really don't stand out today because we've seen those tricks so many times now. For example, it is claimed that this was the first time that a camera was pointed directly at the sun, but of course that doesn't have an effect on the viewer today. However, I've seen many other classic films which I thought still managed to seduce me and have timed really well, but it wasn't the case with Rashomon. The film focuses on different realities and perceptions about humanity, but in doing so it really never manages to find a deep meaning. It focuses on the lies we tell, our selfish desires, and our pursuit or need to believe in the goodness of humanity (reflected through the Priest in this film), but ultimately it plays down to discovering that sometimes reality is just a matter of perception and differing point of views. \"Rashomon is a reflection of life, and life does not always have clear meaning,\" is what Kurosawa would say about this film when approached about its meaning. What I can say about Rashomon is that the cinematography is great and the lighting effects were also astonishing for its time. \r\n\r\nThe film takes place during a heavy rain storm (classic trade mark from Kurosawa) as a preist (Minoru Chiaki) and a woodcutter (Takashi Shimura) are taking refuge from the rain and talking about a terrible crime that has been committed. A peasant (Kichijiro Ueda) who is unfamiliar with what they are talking about joins the conversation and the two men recount the events of what they consider the most horrific crime they have experienced. The woodcutter happened to discover the body of a samurai three days ago as he walked across the woods and was summoned to testify at a trial for the samurai's murder. The priest also has to testify since he had run into the samurai (Machiko Kyo) and his wife (Masayuki Mori) as they were passing through the town before the murder took place. The woodcutter and the priest then recount what they heard from the three direct witnesses of the murder: the suspected bandit Tajomaru (Toshiro Mifune) who apparently raped the wife and killed the samurai, the wife, and the samurai himself who testifies through a medium. They all give different accounts of what took place, and each account is as unreasonable as the next. The story is told in the form of flashbacks through the perception of each witness.\r\n\r\nThe main issue I had with the film is that the horrendous crime never felt like it was that terrible or memorable to begin with. It was just a common crime, a terrible one, but nothing to have an existential or philosophical debate about. Besides the main concern they had wasn't because a murder was committed but rather that everyone seemed to be lying about what happened. They couldn't find a reasonable explanation for an unreasonable act. The flashbacks were sort of interesting despite me not liking the performances, and I really liked the fighting choreography staged near the end between the bandit and the samurai. It was nothing you would expect from a japanese samurai film. That was probably my favorite scene in this film and it had some funny moments as well. I can see the influence the director has had in modern films like Vantage Point or The Usual Suspects, but despite that I had a difficult time carrying about this movie. Well I guess I'm on the minority here, but Kurosawa would have to accept my opinion and the perception I had of this film because that is what this film is really about: differing perceptions of what we believe to be real.",
            "review_date": "2013-08-24",
            "source": "rt"
        },
        {
            "content": "Although Rashomon is definitely a very good film, I take issue when people call it Kurosawa's best. It features performances of varying quality and is definitely a very slow movie experience, but it makes up for most of its flaws in the stylish direction, original visuals, and compelling and thought-provoking story. This is definitely one of the most original films of all time, and explores the depths of people's ability to falsify the truth with absolute precision. All-around, it's a fun and engaging movie to watch... even though my dad fell asleep during it.\r\n\r\nRashomon begins in a dilapidated building, where three people are sitting around waiting for the rain to stop. Two of them won't stop muttering about how \"It's the most horrific thing ever,\" and the third asks what they are talking about. Finally, they tell him the story: A dead man was found in the woods, and all those involved told the story of his death in different ways. The bandit who attacked him said that the two of them fought gallantly over the man's wife, the wife said that the bandit killed him, the dead man (through a psychic) said that the wife encouraged the bandit to kill him, and the guy who found the bodies claimed that he saw nothing. Who says dead men tell no tales?\r\n\r\nThis movie is about lying and how different people see different things. But it's also about how people can lie to themselves about things that they did or didn't do, in order to make themselves feel better. For instance, the bandit said that he killed the man after a ferocious yet epic battle in which both of them were very skilled with their weapons. The woman, however, said that they scrambled around in the dirt for ten minutes trying to sissy-slap the shit out of each other. Maybe what she said was hyperbole, maybe the bandit was lying through his teeth-- we'll never know.\r\n\r\nRashomon is one of the first films that explored the concept of putting falsehoods to celluloid. Back in the day, when a movie presented a situation to you, you were expected to believe what it told you. Nowadays, of course, we have films like Total Recall or Inception, where anything could be a dream, and it's out to confuse the audience deliberately. Rashomon started that concept. After hearing the four stories all the way through, you realize that none of them must be truly accurate, as each person had their own personal bias in the retelling of the tale. \r\n\r\nThe performances in this movie are mostly good, but as it is with many Japanese films, they're a little over-the-top. The bandit's Joker-esque laughing gets a little old after a while, and the wife cries nonstop in the most obnoxious way possible. The man, unfortunately, is the one respectable and sane character who, through whatever turn of events, has to end up fucking dead. I will refrain from spoiling the film's final irony for you, suffice it to say that it will make you want to watch it over again. However, I will say this-- the fight scenes go on a little too long, and there is a lot of needless screen time in which people stare off into space and flop around in the dirt. This movie is only an hour and a half long, but I don't doubt that the story could have been told just as well in under an hour. And that's saying something.\r\n\r\nThe cinematography, although in black and white, is beautiful. The building that the characters start out in is very well-crafted; it's falling to pieces and warping from the rain, and it gives the dialogue some very spooky atmospherics. The scenes in the forest are particularly memorable for the sun-dappled scenery and well-crafted set pieces. Even if it does tend to go on and on, Rashomon is just visually spectacular. If nothing else, the movie redefined what can and can't be done with such simple things as a camera, six actors, and some trees.\r\n\r\nFinal Score for Rashomon: 8/10 stars. Those of you who get bored during other Kurosawa films should definitely stay away from this one, as it's honestly probably a bit beyond you. However, if you got bored during Man of Steal Your Money's onslaught of incomprehensible action, this is definitely where you should turn to. It is a studious film on people's uncanny ability to deceive both others and themselves. It basically states that people are born liars, and will continue lying compulsively until the day they die. Whether you agree with this statement or not, it's definitely a film worth watching. It's smart, focused, and is somehow able to tell the same story four times, all the while keeping it interesting. And that's a pretty big feat all by itself.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "De lo mejor de la historia del cine.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "While I don't think it's as good as people say it is, it does have a very interesting narrative structure and is directed exceptionally well.",
            "review_date": "2013-07-12",
            "source": "rt"
        },
        {
            "content": "Excellent film making and story telling.",
            "review_date": "2013-07-07",
            "source": "rt"
        },
        {
            "content": "This film is brilliant in every way possible, the cinematography, acting, story, narrative structure, and direction. Everyone should watch this film at least once. This is possibly my favorite film of all-time.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "I think to understand you must first be confused .A great classic film that questions humanity and leaves you thinking for days to come. I expected it to be boring since I had to watch it for Extension English class but I'm glad I chose this from the list seeing its 100% rating on RT.",
            "review_date": "2013-06-20",
            "source": "rt"
        },
        {
            "content": "Greatest director of all time at the peak of his powers!",
            "review_date": "2013-06-19",
            "source": "rt"
        },
        {
            "content": "Very Very intense. The kind of movie that makes you want to read about it afterwards.",
            "review_date": "2013-06-17",
            "source": "rt"
        },
        {
            "content": "Rashomon is an exploration of multiple realities instead a particular truth. A period drama to those that love classics.",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "A heinous crime and its aftermath are recalled from differing points of view.",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "The original 'different perspectives of the same event' movie.",
            "review_date": "2013-05-30",
            "source": "rt"
        },
        {
            "content": "I think, even by today's standards, this film is innovative in its use of cinematography, and camera angles in depicting different characters' internal workings.  A true masterpiece",
            "review_date": "2013-05-18",
            "source": "rt"
        },
        {
            "content": "A narrative structure that has yet to be surpassed.",
            "review_date": "2013-05-14",
            "source": "rt"
        },
        {
            "content": "Why? No how, do people enjoy this movie at all. I wish I could have drank every time I wanted to die, which in end would have killed me.",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "In hindsight ''Rashomon'' is a piece of directorial genius. Akira Kurosawa delivers a well paced and gripping drama that bears a very creative style of storytelling. It shows how any event can be manipulated and how dishonest people can be. The actors deliver great performances and the film delivers on an entertainment factor as well as being an intelligent piece of cinema. ''Rashomon'' is a must see for any film buff as well as any regular moviegoer.",
            "review_date": "2013-05-06",
            "source": "rt"
        },
        {
            "content": "Rashomon is one of the greatest films ever made - that's all that really needs to be said, but it wouldn't be fair for me or the film to leave it at that. No, Rashomon isn't just a film, it is an experience that will never leave you even when you finish watching it. It is by far one of the most riveting and powerful dramas I've ever seen, and it's also a film that engaged me, made me think, and also left me to ponder its meanings and messages.\n\nThe film starts off with three men gathered at an abandoned temple during a rainstorm who discuss the occurrence of a rape and murder and the four differing points of view over what really happened: the bandit's, the woman's, the dead man's through a medium, and a witness to the heinous incident. The three men try desperately to piece together how such a horrible thing could occur and what may have really happened.\n\nWhile the plot is fairly simple, Kurosawa takes this plot and makes it go above and beyond what it would be by itself and also challenges the viewer to make their own interpretations. It's a film about human perception, the dark depths of the human soul, but also about our faith or damnation of mankind in the midst of such a horrible crime.\n\nThough only 83 minutes in length, Rashomon packs a hell of a lot into such a short time and I found myself completely absorbed by its haunting and powerful plot, made all the more real by the superb acting. Beautiful, haunting, challenging, visceral, emotionally gripping, and all-too-realistic, Rashomon is a film that no serious film fanatic should ever miss out on because it will blow you away and make you feel in a way that few films ever will in your life. It's a film that forces the viewer to peek into the deep, ugly recesses of human nature and makes us wonder if humanity is really good, or if we are simply monsters who try to justify our misdeeds. What more could you ask from a drama with such touchy material? It's a masterpiece, no question about it.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "Simply perfect. One of Akira Kurosawa's greatest masterpieces. And that's saying a lot.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "An interesting piece by Kurosawa about the unreliable narrator, and the beginning of multiple accounts of the same story being woven into one film. The story itself is not too complex, but an interesting take on making it into more than it first seems. Also very rich to see in B&W. Toshiro Mifune, Takashi Shimura and Minoru Chiaki all feature prominently, though it is Mifune's film to steal, as in Seven Samurai (in which all three also appear). Worth a watch if you enjoyed Seven Samurai, but a very different movie and might not appeal as much. Still a very well made film.",
            "review_date": "2013-04-18",
            "source": "rt"
        },
        {
            "content": "Its perfect. But not one of my favorite films. Toshiro is such a great character.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "One of Kurosawa's best. One of the very few Directors who have never let me down....",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "Great thriller with never-seen-before screenplay & if you can understand that highly philosophical climax than you have surely understood life.\nFlawless direction & screenplay.\nRespect Akira Kurosawa.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "One of Kurosawa's finest...",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "Final message: human nature isn't inherently good or evil, it just is. Great staging and plot structure too. The illusory nature of subjectivity is the driving force for the story in Rashomon.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "Ver estas pelÃ­culas es como leer un poema, es puro arte.  Ya quiero ver los Siete Samurais.",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "the story of the truth and the legend, Rashomon is an art-house epic that tells a chilling story while at the same time bearing strong elements of hope in its favor.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "Rashomon is a splendid and memorable film from Akira Kurosawa. It studies human values and morals, constantly making us wonder what is the true story behind the events that surround the murder of a man. I enjoyed seeing each character's perspective of the same happening and how they are all motivated by a strong set of principles that were consistent with the feudal period of the japanese history. The acting is top-notch from the whole cast and I really like how raw and intense the sword fighting sequences between the bandit and the murdered man were. I could feel their desperation and how they were practically being moved only by primal instincts. Akira Kurosawa masterfully explores the human nature and moral ambiguities, making Rashomon a must-see for all movie lovers out there.",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "One of the all time great works of Akira Kurosawa, Rashomon is a story of lies, greed, and differing perspectives.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "Beyond the unique narrative structure, exquisite cinematography and surreal performances. Rashomon is a poignant musing on humanity, truth and deception.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "A powerful, meaningful film. Perhaps the best of Kurosawa.",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "Wow! Great story with alternate points of views.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "Directed by the famed Akira Kurosawa, the film starts off with two men eventually joined by a third. Both seem very melancholy and they explain this is because of something that happened three days earlier. Apparently a bandit met a husband and wife on the road and raped the wife with the husband being killed. However, this event is shown in four different accounts all varying greatly and we never learn what is fact and what is actually fiction. Because of this horrible event, one of the men who is a priest loses faith in mankind. The film ends just as it began with the two men alone under a pagoda watching the driving rain. However, an act of kindness quickly renews the priest's belief. Kurasawa's film certainly has an interesting plot device and camera work. Historically, it is also important because it introduced the world to Japanese cinema",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "What starts out as a simple tale of a violent encounter between a bandit and a married couple in the woods in feudal Japan turns into a complex meditation on truth, justice and morality as four differing testimonies (by the captured bandit, the wife, an eyewitness, and the dead husband via a medium) offer up four self-serving perspectives on the event. Kurosawa's masterpiece is simply but beautifully shot in black and white, and though seemingly slow-paced to modern sensibilities, it is invigored by a fierce performance by Toshiro Mifune as the bandit.",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "Rashomon is a compelling watch. Some of the scenes are so beautifully constructed that it feels like you're watching a Kabuki theatre play.",
            "review_date": "2013-01-21",
            "source": "rt"
        },
        {
            "content": "Unlike the numerous copycats its narrative has inspired, \"Rashomon\" isn't a standard mystery or thriller. Its a meditation on human morality by Kurosawa and a thought provoking one at that. Its also beautifully shot and visually inventive.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "A must watch for every film student.",
            "review_date": "2013-01-15",
            "source": "rt"
        },
        {
            "content": "Why does everyone laugh so maniacally?",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "Rashomon is described as Akira Kurosawa's greatest work, which in Japan is a rather big deal. The film examines an incident that occurred in the woods, and follows the recollection of the incident from each individuals perspective, it is left up to the viewer to decide which perspective is the true story. I could imagine this would have been a monumental film in 1950, introducing a new take on story telling and leading the audience through one hell of a trip. Regardless, for the time it was a well made movie, despite having several sequences dragging on to the degree that it becomes difficult to watch.",
            "review_date": "2013-01-11",
            "source": "rt"
        },
        {
            "content": "El maestro Kurosawa demuestra porqué era uno de los grandes de todos los tiempos, con una historia sobre la personalidad de las personas y como esas decisiones repercuten en nuestro futuro; de una manera magistral. Todo el impacto argumental del film, sigue  muy vigente hasta el día de hoy, como si el maestro supiera el futuro. Un film sobre como los seres humanos mentimos, nos comportamos y como esto repercute para siempre en nuestras vidas. Una obra maestra.",
            "review_date": "2013-01-07",
            "source": "rt"
        },
        {
            "content": "Highly philosophical , extraordinarily brilliant film",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "want to see it again .......",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "This is a film of pure genius. It has some of the best narrative storytelling in a film ever. And it is probably one of the best movies ever made. Only if we had more films like this today. This \\was the time when storytelling was gold and there was no film made for just money.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "The film that brought Kurosawa (and Japanese film more generally) attention in the West (despite a long tradition and some other good Kurosawa films like Stray Dog) really is all that it is cracked up to be.  The cinematography is beautiful, with dappled light on the forest floor or streaming through the leaves above.  Mifune chews the scenery (and inspires all subsequent caricatures) but this raving bandit stands in contrast to his earlier more sober parts (thus showing this to be a measured choice in acting style, not an inflexible mode). The famous story of the rape and murder in the woods is told in flashback from at least four points of view (but in fact recounted by only 1 or 2 characters sheltering under the Rashomon gate from a rainstorm).  The central theme here is the subjectivity of human experience (since all 4 versions vary in their details) and the way that we bend our perception for selfish ends. This may typically be a result of self-deception or motivated bias but, in Kurosawa's film, someone is obviously lying as well.  Otherwise things don't add up.  It is a measure of Kurosawa's genius (or a happy accident) that he allows this final ambiguity, even as he puts in a plug for the basic goodness of humanity in the face of evil.",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "complex, intriguing nd revolutionary, rashomon is a brilliant nd classic piece of stroytelling.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "A beautiful piece of art!",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "A movie that sends an inner message across one that stirs the soul.",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "A simple story told through four different lenses. It's interesting to see the depth added with each additional retelling of the same events, and trying to figure out which one is the correct version of what really happened.",
            "review_date": "2012-12-19",
            "source": "rt"
        },
        {
            "content": "Pure genius. Brilliant study of how our perceptions shift what is reality.",
            "review_date": "2012-12-17",
            "source": "rt"
        },
        {
            "content": "An incredible movie that uses mystery to probe the dark depths of human nature. This is a must-watch.",
            "review_date": "2012-12-14",
            "source": "rt"
        },
        {
            "content": "Intense, unique and riveting. Unlike Kurosawa's other works, it does have notable flaws, but none draw away or effect the film enough to merit a mention.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Now on blu-ray from Criterion. What a world! Could watch it over & over.",
            "review_date": "2012-11-29",
            "source": "rt"
        },
        {
            "content": "Definitely one of the greatest films to date. Easy to follow through on such a wide scale of storytelling on morality. Deep and growing ever more intense than the sequence before, Rashomon outlines the absolute best of Kurosawa's artwork. A definite timeless masterpiece.",
            "review_date": "2012-11-26",
            "source": "rt"
        },
        {
            "content": "âRashomonâ? is acclaimed, worth to watch, and artistically classic. Best regard to Akira Kurosawa for presenting a brightly different and brand new style that influence modern cinema.",
            "review_date": "2012-11-23",
            "source": "rt"
        },
        {
            "content": "technically sound & very good structure makes it interesting work. some of the actors overact, minor flaw...",
            "review_date": "2012-11-17",
            "source": "rt"
        },
        {
            "content": "Kurosawa è un maestroc'è poco da dire e ciò che più colpisce nei suoi film è il vigore, che ha incantato molto più gli occidentali che i giapponesi stessi. Vigore nella regia e nella narrazione. In Rashomon si evidenzia anche la diversità dei punti di vista come solo il cinema può fare, oltre che un'attenta riflessione filosofica sulla natura egoistica dell'uomo. Un grande Toshiro Mifune.",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "This looks like an awesome show",
            "review_date": "2012-11-15",
            "source": "rt"
        },
        {
            "content": "Boring...and I don't get it. Regarded as a great film. One of Kurosawa's finest. Yet, it's pretty boring.",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "I wanted to weep at the end, but I'm not sure if it is from the pure and raw emotion exploding in the black and white like bright colors, or the glorious redemptive ending which gives a hope mankind is not totally lost.",
            "review_date": "2012-11-06",
            "source": "rt"
        },
        {
            "content": "So, got a chance to watch this epic classic, works of one of the legendary director Akira Kurosawa. The way of story telling is what all about the movie, interesting as well as confusing and visually stunning too. Definitely worth a look.",
            "review_date": "2012-11-05",
            "source": "rt"
        },
        {
            "content": "One of the greatest works in Japanese cinema! Akira Kurosawa is truly master of Japanese cinema but also one of the greatest when you think all of the directors. Beautiful shots, interesting story, brilliant acting and working scenery. Everyone should be able to see this brilliant masterpiece that will stay in people's mind forever!",
            "review_date": "2012-11-02",
            "source": "rt"
        },
        {
            "content": "Just an incredibly weird film. I wanted to see it for a long time because so many writers are basing their work on this story. I never want to see it again.",
            "review_date": "2012-10-30",
            "source": "rt"
        },
        {
            "content": "Very dense and difficult to understand, but the ideas thrown around are very thought-provoking.",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "the best Kurosawa film!",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "Having just read the two short stories on which this was based makes me appreciate Kurosawa's storytelling and his humanity all the more. A revealing look at how different people see themselves and their actions, and Mifune is outstanding.",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "First of all, I give Rashomon a lot of respect for inventing (or perfecting) one of my favourite narrative elements which is even named after the film (the Rashomon-effect).\nIt also has really really cool cinematography, something films of such small scale are not particularly recognized for. You can see here how masterful Kurosawa is with the camera.\n\nThe plot though is another thing. Although it's an interesting idea to let the viewer decide how it really happened or that it all took place in a completely other way and it most of it makes sense at the end after all, I was a bit disappointed by the execution of the four different stories.\nNot only that the woman was so unbearably unnerving that I wanted her to get raped after all but I also found that all four stories lacked some suspense and a genuine climax.\n\nRashomon is a pretty good film and technically astounding but from an entertainment standpoint it just didn't have enough suspense.",
            "review_date": "2012-10-17",
            "source": "rt"
        },
        {
            "content": "I will hold off from a full review until a second viewing becaus I feel like I'm missing something.",
            "review_date": "2012-10-17",
            "source": "rt"
        },
        {
            "content": "Pretty interesting story, very original for its era.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "Un hito de Kurosawa debido a la increible estructura narrativa. Son los 50, y a nadie todavia se le habia ocurrido presentar asi una historia, 3 versiones, 3 opticas, 3 relatos... no obstante esta llena de flojas sobre actuaciones, planos innecesarios y secuencias no demasiado reconfortantes... aunque no importa demasiado, recibio un precioso homenaje de HERO.",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "A film as old as this with a message still as relevat as this is amazing. Like Seven Samurai its so far ahead of it's time. Kurosawa is the orginal.",
            "review_date": "2012-10-02",
            "source": "rt"
        },
        {
            "content": "It's easy to see why Kurosawa is so revered. With its excellent direction, wonderful acting, and a great story, Rashomon is something that can truly stand the test of time.",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "Like Akira Kurosawa once said \"This film is as about life itself it can or simply cannot be explained easily\" It is an amazing landmark which brings new elements into filmmaking in general and also in to story driven narrative.",
            "review_date": "2012-09-20",
            "source": "rt"
        },
        {
            "content": "Four conflicting tales of a single crime reveal the weaknesses and prejudices of the tellers. Rashomon has many great and timeless moments, and Toshiro Mifune's Tajomaru is maybe my favorite performance in a Kurosawa flick, but for me it's not among Kurosawa's best handled stories. The denouement is kinda hammy. Still, I might chalk this one up as \"necessary viewing\", whatever that means.",
            "review_date": "2012-09-18",
            "source": "rt"
        },
        {
            "content": "A reason to love films. I rate films out of 4 stars. (4/4)",
            "review_date": "2012-09-16",
            "source": "rt"
        },
        {
            "content": "Not my favorite from Kurosawa but still masterfully done and absolutely memorable.",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "viewed on 22/7/04 (Thurs)\n\nAfter that nearly four hours of Seven Samurai, I am all ready to watch this one at ... 88 minutes! And I always thought Akira's movies are lengthy. \n\nWhile watching this 1950 movie, I remember those days as a stage actor. The film is very stagey and if ever there is an effort of bringing the film on stage, there is hardly anything will change in what we see on the screen.\n\nBut I like the dialogue. Now there is a thing about dialogue in some stage plays portraying similar emotions in the film. It tends to focus too much on the dramatic effect. Think Qiong Yao and you will know what I mean. Here the dialogue sounds like it but it is simple and easily brings out the emotions of the characters.\n\nNow many people will know that this movie is basically about accounts of three parties involved in an abduction and possibly a rape. Their accounts don't tally at all and in fact to make matters complicated, there is actually a fourth account. \n\nNow I am just amazed that a simple setting with three characters, a few props like a dagger, two swords and a rope can tell a story of four different variations. \n\nIn the end, it is rather pointless to debate who is telling the truth and who is not. The coda suggests that there is no whole truth and whole lie. We are made up of shades of them. \n\nIt also goes on to mull over a bigger thought - men will choose dishonesty, sometimes even to oneself, over faith in mankind. Still, the finale ends on a hopeful note.\n\nSome movies are made to last forever. I think Akira's movies have this impact on many viewers. \n\nRating: A-",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "An absolute masterpiece in cinema and a truly intriguing film. The idea of subjectivity shown throughout the glaring differences in each re-telling of the story is brilliant  and the  cinematography is inspiring and beautiful.",
            "review_date": "2012-08-27",
            "source": "rt"
        },
        {
            "content": "Not my absolute favorite from Kurosawa, but we all have to start somewhere.",
            "review_date": "2012-08-26",
            "source": "rt"
        },
        {
            "content": "Few movies really show how people's positions regarding a situation skew their account of it as well as RashÃ´mon does. It details a crime from the point of view of the rape victim, the rapist and murderer, and even the murder victim.",
            "review_date": "2012-08-21",
            "source": "rt"
        },
        {
            "content": "I am of the opinion that rape should never be the subject of a movie.  Perhaps a documentary, or perhaps if the director or writer had been the victim of rape and wanted to address their experience through the medium of film.  Bottom line, it should be a hell of a lot more rare as a plot device than it currently is.  That said, \"Rashomon\" is a good, thoughtful film despite revolving around a rape scene.  The rape itself is wisely not shown nor illustrated in any particularly graphic way.  It could not have been, not only because censorship in Japan and the United States at the time would likely have prohibited it, but because uncertainty about what exactly took place between a bandit, a samurai, and the samurai's wife are essential to the plot.  Through flashbacks we see several different versions of what may have happened, and each new piece of the puzzle prompts a priest and an old woodcutter to reflect on the sorry state of human existence as they wait out a rainstorm beneath a ruined gate.  Strong performances by regular Kurosawa actors Toshiro Mifune and Takashi Shimura make this perhaps the most tasteful and artful movie about a rape, if such a thing is possible.",
            "review_date": "2012-08-20",
            "source": "rt"
        },
        {
            "content": "???? ???? ???? ???? ?? ?? ??????? ????? ???? ??????...",
            "review_date": "2012-08-20",
            "source": "rt"
        },
        {
            "content": "A story told from 4 different perspectives, this is a very interesting film made only better with its fantastic cinematography and editing. This is an editor's dream. The way Kurosawa uses editing to tell the story and make us see what we want to see is genius. It is also a great moral story about our version of the truth. \n\nGrade: A-",
            "review_date": "2012-08-14",
            "source": "rt"
        },
        {
            "content": "Not because it is legendary, but because of its content and shoestring budget, I love it. I am amazed at how much a director can accomplish with his camera and vision. In a point in the movie we start losing a grip on reality. We don't know what is true anymore. We have no faith on values. As the priest realizes, we too realize that humanity is about one personal sacrifice and not mass apathy. Feels drama-ish but great.",
            "review_date": "2012-08-11",
            "source": "rt"
        },
        {
            "content": "Don't really need to say much about 'Rashomon', the films it has inspired speak for it enough already. A masterfully made classic, with an intersting plot and ideologies, without 'Rashomon' I'm more then certain that many of people's favourite contemporary favourite films - like 'Resevoir Dogs' - wouldn't exist.",
            "review_date": "2012-08-08",
            "source": "rt"
        },
        {
            "content": "A Masterpiece.\nGo see it",
            "review_date": "2012-08-08",
            "source": "rt"
        },
        {
            "content": "quality work and a masterpiece for eternity",
            "review_date": "2012-08-03",
            "source": "rt"
        },
        {
            "content": "Rashomons filming style is way before its time, with a great story and great performances from my favourite Japanese actor, Toshiro Mifune, \"Rashomon\" is one masterpiece you don't want to miss.",
            "review_date": "2012-08-02",
            "source": "rt"
        },
        {
            "content": "beautiful colours, nostalgic mood, a minor masterpiece, the acting leaves something to be desired, it's much better in ran - still really this is one to see",
            "review_date": "2012-07-28",
            "source": "rt"
        },
        {
            "content": "It is all a matter of prospective. Rashomon constantly presents man as a manipulative, lying, murderous creature but still attempts to restore faith in humanity by depicting true acts of kindness. Man is weak and flawed but that does not make them evil.",
            "review_date": "2012-07-26",
            "source": "rt"
        },
        {
            "content": "Rashomon is a brilliant and intellectually thrilling masterpiece, taking us down the complicated road of perception, reality; truth and lies. What is the truth? Rashomon leaves its viewer with few answers, but only because there are no true answers, and the truth is for everyone to find on their own. Needless to say, Kurosawa's direction is incredible, and the whole film falls into place perfectly.",
            "review_date": "2012-07-24",
            "source": "rt"
        },
        {
            "content": "A true masterpiece by the amazing Kurosawa. A tale of deception, greed, honor, betrayal, shown in a truly innovative narrative. Reality combined with perception. Mifune shines as always, giving one of the most memorable Japanese performances.",
            "review_date": "2012-07-24",
            "source": "rt"
        },
        {
            "content": "Kurosawa, né. Fotografia maravilhosa (principalmente por ser um filme de 1950). Muito bonito apesar de uma história muito triste. Uns enquadramentos que deixavam tudo extramamente realista, senti até medo!",
            "review_date": "2012-07-23",
            "source": "rt"
        },
        {
            "content": "This Is A Landmark Film.",
            "review_date": "2012-07-19",
            "source": "rt"
        },
        {
            "content": "Here is a film that neither has nor requires a center. Kurosawa's ever-relevant ideas in Rashômon haunt, and with good reason: we see eye-to-eye with at least a couple of his characters on some level.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "Kurosawa did another great job on this picture. The cinematography is absolutly perfect for this film, it captures every scene perfectly, also the few sets that where used where excellent and they set the tone for the style of the film. The combinnation of the 6 star cast is an excellent choise and they play theur character with absolute greatness. But offcourse the most memorable is the screenplay/story, it is so well written that it grips you from the first second untill the very last. The editing plays a very important part and is done very creative, without comming over to fast our to messy, its an absolute joy to watch this perfect film.!",
            "review_date": "2012-07-15",
            "source": "rt"
        },
        {
            "content": "Must see! If you haven't , run out now!",
            "review_date": "2012-07-12",
            "source": "rt"
        },
        {
            "content": "Rashomon is one of the Japanese classics. It entangles brilliant shots for camera. Unique story telling technique & amazing editing for fighting scenes as all Kurosawa's films",
            "review_date": "2012-07-08",
            "source": "rt"
        },
        {
            "content": "This was such a wonderful movie. I really enjoyed the plot and story. It was interesting and well put together. I was pleased that I got to watch this.",
            "review_date": "2012-07-08",
            "source": "rt"
        },
        {
            "content": "I don't really remember this but I apparently liked it.",
            "review_date": "2012-07-06",
            "source": "rt"
        },
        {
            "content": "Beautiful. Leaves you with a \"million\" questions whose answers are not easy to come by.",
            "review_date": "2012-07-05",
            "source": "rt"
        },
        {
            "content": "Brilliant film work depicting a crime as told by four different people with different motivations. Rashomon keeps you hooked until the final revelations are made. A great mystery film.",
            "review_date": "2012-07-05",
            "source": "rt"
        },
        {
            "content": "This movie protrays exactly how a person views a situation according to his principles, mind and above all what suits him best.\r\n\r\nThis is as natural as it gets, I doubt you will ever find a movie, that needs explaination after its end like this one.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "One of most celebrated films of phenomenal director Akira Kurosawa, Rashomon boasts ground-breaking storyline construction, dazzling performances, and a meditative study of truth and fiction.",
            "review_date": "2012-06-21",
            "source": "rt"
        },
        {
            "content": "Certainly a milestone in terms of using the film medium in brilliant ways. A little thin story-wise but, then again, the medium is the message with a movie like this. Fans of \"Run Lola Run\", \"Groundhog Day\", \"Hero\" and \"Source Code\" will love this post-modern delight.",
            "review_date": "2012-06-18",
            "source": "rt"
        },
        {
            "content": "S'il y a de ces films dont on ne ressort jamais indemne, Rashômon en est un de ceux-là. Surtout quand on débute avec l'idée de la perspective d'un film japonais d'arts martiaux de 1950 et qu'on se retrouve à la fin avec, sur les bras, un problème de conscience à résoudre.\n\nC'est un long cheminement personnel que de devoir visionner Rashômon, puisqu'il devient automatiquement nécessaire de stopper le film à chaque 20 minutes, question de réfléchir à la véridicité des évènements. D'ailleurs, un des personnages principaux n'est là que pour introduire le doute dans l'esprit du spectateur, et il y réussit assez bien merci. Par Rashômon, Kurosawa remet en question la foi en l'être humain, un être égoïste qui se pervertit au fil du temps. Car quand la logique n'y est plus, vers qui faut-il se tourner? Vers l'être humain?",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "I imagine that this movie was a game changer at the time. It has been largely imitated but it's effectiveness was never duplicated. The movie deals mainly with the theme of perception and truth by telling the story of a rape of a woman and the murder of her samurai husband through 4 different eyewitness accounts. In my humble opinion, this movie was Kurosawa's magnum opus.",
            "review_date": "2012-06-02",
            "source": "rt"
        },
        {
            "content": "so magnificiently picturised film..",
            "review_date": "2012-05-29",
            "source": "rt"
        },
        {
            "content": "Not my favorite of Kurosawa's work, but he is a master filmmaker and improved much throughout the 50s.",
            "review_date": "2012-05-27",
            "source": "rt"
        },
        {
            "content": "There are three sides to every story. This is a beautiful telling of that antidote.",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "I get what they're getting at, and appreciate it... Also appreciate the intention behind location, and exaggerated characters and facial expressions, and give the film respect for its novelty in that era and influence on later films- but I can't say it's a favourite just yet... Also, a bit slow-moving, so I don't recommend watching when sleepy! ;-)",
            "review_date": "2012-05-25",
            "source": "rt"
        },
        {
            "content": "A slick combination of Welles and Hitchcock, Kurosawa's big break features highly detailed camera work, challenging themes, and standout performances Toshiro and Takashi.",
            "review_date": "2012-05-22",
            "source": "rt"
        },
        {
            "content": "Great story by a great director.",
            "review_date": "2012-05-15",
            "source": "rt"
        },
        {
            "content": "Am I the only one on the planet that didn't like this film? The plot was okay, the characters are great and it is beautifully shot (point for the cinematographer). The costumes and sets were great too. Why did I not like this film? The answer is simple: because these classic Japanese movies don't appeal to me (except for \"Seven Samurai\").......it's that simple.",
            "review_date": "2012-05-15",
            "source": "rt"
        }
    ]
}