{
  "title": "3 Idiots",
  "rating": 8.2,
  "release_date": "2010-02-12",
  "genre": [
    "Drama",
    "Comedy",
    "Romance"
  ],
  "summary": "Two friends embark on a quest for a lost buddy.  On this journey, they encounter a long forgotten bet, a wedding they must crash, and a funeral that goes impossibly out of control.  As they make their way through the perilous landscape, another journey begins: their inner journey through memory lane and the story of their friend--the Two friends embark on a quest for a lost buddy.  On this journey, they encounter a long forgotten bet, a wedding they must crash, and a funeral that goes impossibly out of control.  As they make their way through the perilous landscape, another journey begins: their inner journey through memory lane and the story of their friend--the irrepressible free-thinker Rancho, who in his unique way, touched and changed their lives.  It’s a story of their hostel days that swings between Rancho’s romance with the spirited Pia, and his clash with an oppressive mentor, Viru Sahastrabudhhe . And then one day, suddenly, Rancho is gone. (Reliance BIG Pictures)… Expand",
  "critic_reviews": [
    "There's an unavoidable joie de vivre (symbolized by Rancho's meditative mantra \"All is well\") and a performance charm that make this one of the more naturally gregarious Bollywood imports.",
    "3 Idiots takes a while to lay out its game plan but pays off emotionally in its second half.",
    "In writer-director Rajkumar Hirani's tuneful, enjoyable college comedy, 3 Idiots, Khan plays \"Rancho,\" an engineering student so brilliant that he barely has to break a sweat to place first in his class.",
    "The film's good points, though, are marred by a slow start and a nerve-jangling soundtrack."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "3 Idiots is always fun for me, as a film reviewer- some movie suck, some rock and some are so sad and inspirational and funny at the same time- those are the works to sum up Vidhu Vinod's best movie yet. The movie is about 3 college friends3 Idiots is always fun for me, as a film reviewer- some movie suck, some rock and some are so sad and inspirational and funny at the same time- those are the works to sum up Vidhu Vinod's best movie yet. The movie is about 3 college friends who try to meet up again by the most smartest of their group- Rancho played brilliantly by Aamir Khan, Mahadeven and Sharman do a good job too and the movie packs emotion and laughter. It's 3 hours- a long movie with a long and great message. While cliched, still, 3 idiots manages to be one of the best bollywood movies I have ever seen. It's a rare, funny treat at the movies if you haven't seen it. Rated U/A Parental Guidence for language and emotional moments In India and Rated PG13 in us for thematic elements, language, some violence and partial nudity.",
      "review_date": "2014-02-08"
    },
    {
      "review_title": null,
      "content": "there is novelty in the story. originality is also there. execution is above average. the ending is nice. but the first half is just like that. technical values are good. casting is top notch and production values are good.some changes inthere is novelty in the story. originality is also there. execution is above average. the ending is nice. but the first half is just like that. technical values are good. casting is top notch and production values are good.some changes in the execution might have given a chance for being a trade mark movie. but anyway its good.",
      "review_date": "2010-12-15"
    },
    {
      "review_title": null,
      "content": "Despite it being rather long, I enjoyed 3 Idiots. Prior to watching this, I had never seen a Bollywood film before and I would love to watch more. The characters are both funny and, somewhat, relate-able. I thought the story line was inchDespite it being rather long, I enjoyed 3 Idiots. Prior to watching this, I had never seen a Bollywood film before and I would love to watch more. The characters are both funny and, somewhat, relate-able. I thought the story line was inch perfect and the ending was not what I expected!",
      "review_date": "2013-06-30"
    },
    {
      "review_title": null,
      "content": "Good movie. Even-though Aamir Khan is 48 Yrs old, he performed the role very well-suitably.  Nice-movie. Story, Performance and message delivery is brilliant.",
      "review_date": "2013-09-01"
    },
    {
      "review_title": null,
      "content": "The comedy is relaxing and heartwarming goes to a road story like this but 3 Idiots deserves more well-known Asian actors supporting all films to make them popular when they were released around the road for anyone to join the culture ofThe comedy is relaxing and heartwarming goes to a road story like this but 3 Idiots deserves more well-known Asian actors supporting all films to make them popular when they were released around the road for anyone to join the culture of India and other Asian countries including China, Pakistan, Nepal, Thailand, Japan (etc.) are going to be involved with some relaxing narration.",
      "review_date": "2016-10-22"
    },
    {
      "review_title": null,
      "content": "When I was a kid, everyone in my class had watched 3 Idiots. They all used to laugh at me for some reason because I didn't watch it. So the day this movie featured on TV, I watched it. And I have seen it every single time it comes on TV. AndWhen I was a kid, everyone in my class had watched 3 Idiots. They all used to laugh at me for some reason because I didn't watch it. So the day this movie featured on TV, I watched it. And I have seen it every single time it comes on TV. And afterwards I began laughing at them because I had seen it more number of times than them. But well, immaturity aside, let's review this movie.The film talks about the rat race that everyone goes through, that we have been brainwashed into believing ever since we were teenagers. They always tell us that we need to get into a good engineering college if we want to have a good job irrespective of which field we work in, then that will play out when we have to get married, then we will have children and then the cycle will go on for them. We don't dare to think otherwise, because the elders always have a sense of insecurity about us and also because they always resort to shouting and scolding whenever we dare to question their authority.The film has become something of a synonym with engineering life. Everyone learnt about the various things that happen in the top engineering college, because I think this is one of the first commercially successful Bollywood films to talk about the environment. There are three protagonists, each being a stereotype of an engineering student we all can relate to - Rancho the brilliant guy who doesn't study much but still gets good marks because he loves what he's doing, Raju who is a superstitious and cowardly guy coming from a poor household, and Farhan, a student who really has a passion for photography but his parents are forcing him to do engineering. Basically the three types of engineering students we all know.Together they spend their college life in fun ways, teaching each other the meaning of life and the points of views of each person. And then after they leave college, they all decide to meet each other because of a \"challenge\" that Chatur, a teacher's pet had given them. Chatur wasn't exactly wrong from his point of view, since he came from Uganda, a country where Indians were being persecuted back in the late 20th century. He had learnt early in life that one has to take all means possible in order to achieve success, and that's exactly what he was going with.Every time I watch this film I end up managing to find a new detail that I had previously missed. I watch it every time it comes on TV because of that reason. It was only later that I got to know this is actually a book adaptation of Five Point Someone by Chetan Bhagat, and those friends of mine who laughed at me for not having seen this film are the same people who ridicule Chetan Bhagat for his terrible books. And to be honest they are kind of right, since this is his only good book adaptation. And by good I mean absolutely flawless.",
      "review_date": "2021-04-06"
    },
    {
      "review_title": null,
      "content": "3 Idiots are Aamir's best performance as for now. The story is an eye-opener for all the students to choose a path which they like and follow their passion and heart.Rajkumar Hirani has made a masterpiece out of it. Boman Irani is supreb3 Idiots are Aamir's best performance as for now. The story is an eye-opener for all the students to choose a path which they like and follow their passion and heart.Rajkumar Hirani has made a masterpiece out of it. Boman Irani is supreb with his performance.",
      "review_date": "2020-08-14"
    },
    {
      "review_title": null,
      "content": "After watching over 5k+ movies throughout the world still this is my all time favourite movie.",
      "review_date": "2022-11-12"
    },
    {
      "review_title": null,
      "content": "It is a long movie but I am still eager to re-watch it. The actors have brought their great sense of humor to the screen play in an almost flawless way. The mixed feeling of touching and funny are just dramatic enough. My teardrop have hitIt is a long movie but I am still eager to re-watch it. The actors have brought their great sense of humor to the screen play in an almost flawless way. The mixed feeling of touching and funny are just dramatic enough. My teardrop have hit the ground for several times when it comes to those touching scenes. It may be the best comedy that I have ever watched.",
      "review_date": "2011-10-21"
    },
    {
      "review_title": null,
      "content": "Don't expect much but turns out 3 idiot is the best bollywood movie I've seen yet. The production is bollywood standard, BUT the story, characters and acting are really charming & brilliant. I just can't stop laughing and Don't expect much but turns out 3 idiot is the best bollywood movie I've seen yet. The production is bollywood standard, BUT the story, characters and acting are really charming & brilliant. I just can't stop laughing and sometimes touched with this 3 hour roller coaster fiasco.",
      "review_date": "2010-02-15"
    },
    {
      "review_title": null,
      "content": "This movies strength is in the storytelling...and it was fun to watch.",
      "review_date": "2010-02-15"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n3 Idiots is a rather great Bollywood movie, truly hilarious and yet with a very focused and introspective message on life and the choices we make.\r From a screenwriting perspective, it's almost the perfect script. It has a large number of different characters that all stand out and manage to be interesting in their own way, with a number of themes weaved throughout the film that makes it a very well put together piece. The actors also all do a very good job, and the songs are memorable, better than most Bollywood movies.\r Most of all, the movie has an infectious youthful spirit that is very hard not to like. A refreshing, at times moving and very funny, blast of summer air.\r But, here's the thing.\r And this is more a reflection on society than a fault of the movie, yet it is remarkable to observe how unaware the characters are that the very message of the story, about freedom and making your own choices, is undermined in every way by the way the film ends. Because at the end, after all that talk about not caring about social status and money and living your life freely...all of the characters are singing and dancing and crying tears of joy because A) they got high-paying jobs or B) they are getting married and fulfilling they social contract.\r That is how society works, all over the world. All people deep down understand that life is not meant to be slaved away working for money or titles. Everyone wants to \"change the system\" or \"be different.\" But at the end of the day, the vast majority of people are too afraid to reach out for true freedom. True freedom, either by individuals leaving the system or working to abolish the system, does not have a happy ending. Freedom is not free. The price for freedom is in blood, and often in isolation. For most, the true price of freedom is too high.\r And so, like all the characters in this movie, they create a \"false freedom\" in order to fill that gaping hole in their hearts. They make fun of the character who is greedy and openly lives for his love of money, thinking they are different  but at the end they submit to the chains of marriage, to the chains of working for a corporate company. The main character, who most boasts about this \"freedom\" is a perfect example of this. He encourages others to choose the majors they are interested in studying, to do what they want with their lives  but it just so happens that, conveniently, his own choice in the engineering field will make him a very rich man. It is easy for rich people to tell the poor that money is not important, it is a whole other thing to live that life.\r So all of that together, 3 Idiots is a delightful movie about characters creating false freedoms and finding joy in them, which is a lie the majority of mankind tells itself each and every day when it wakes up in the morning. Is there no hope left for true freedom? Are there no more warriors left to fight the good fight? Or must we all get married and get corporate jobs? Is a happy lie better than the harsh truth? Let the philosophers ponder. But Neo said it's not.",
      "review_date": "2013-06-21"
    },
    {
      "review_title": null,
      "content": "I watched it yesterday and going to watch it again tomorrow with my girlfriend. I loved the movie! And i believe it leaves you with a good message.\rI had never seen a Bollywood film before this and I was surprised how good this one actually was!",
      "review_date": "2014-07-26"
    },
    {
      "review_title": null,
      "content": "3 idiot is the best bollywood movie I've seen yet. The production is bollywood standard, BUT the story, characters and acting are really charming & brilliant. I just can't stop laughing and sometimes touched with this 3 hour roller coaster fiasco.",
      "review_date": "2013-07-25"
    },
    {
      "review_title": null,
      "content": "aaamir khan is a great actor. movie is also great.\raamir khan father of all khans.\rHe is real king of bollywood.\raaamir khan is a great actor. movie is also great.\raamir khan father of all khans.\rHe is real king of bollywood.",
      "review_date": "2014-09-09"
    },
    {
      "review_title": null,
      "content": "Three Idiots is a nice movie, it is a great watch with family for some good story. The plot is great and depressing while the acting of all the characters is just great, Aamir Khan is a great actor that always does great acting. The humor isThree Idiots is a nice movie, it is a great watch with family for some good story. The plot is great and depressing while the acting of all the characters is just great, Aamir Khan is a great actor that always does great acting. The humor is well crafted and the drama is carried very well in the movie. The movie has funny and depressing moments that mix to create a powerful experience. There are flaws with the movie and that is that the story is drawn out a bit to long and there is one scene where it is one misfortune and one strange luck act after another in a rather inappropriate scene for children which was most definately not required. Overall \"Three Idiots\" was a great film that is most definately worth watching for it blends drama and comedy into a unique movie. Breakdown for \"3 Idiots\": Presentation: 8.5, Plot: 8.25, Acting: 9, Script: 8.75, Lasting Appeal: 8. Verdict: 8.25 out of 10 \"Great\"",
      "review_date": "2011-11-20"
    },
    {
      "review_title": null,
      "content": "The first 1.5 hours is solid, and even the second 1.5 hours is solid but in terms of how it all connects back to the central themes are established at the beginning it does not. I was thoroughly entertained by this movie, but everything fromThe first 1.5 hours is solid, and even the second 1.5 hours is solid but in terms of how it all connects back to the central themes are established at the beginning it does not. I was thoroughly entertained by this movie, but everything from the halfway point to when all the revelations come out about who Rancho really is/when everyone is reconnected is so much unnecessary movie for the sake of more movie. Furthermore, the entire incident with the baby being born was ridiculously melodramatic. Beyond that, though, the music, the acting, the writing, and the cinematography was all outstanding. The Director of Photography did fantastic work on this, and whoever colored the film did a great job!",
      "review_date": "2017-07-10"
    },
    {
      "review_title": null,
      "content": "A nearly 3 hour long comedy... The funniest part of the 20 minutes I made it through was a rip-off of a Seinfeld joke. Should have been called 3 Million Idiots for the number of people that like this movie.",
      "review_date": "2021-05-29"
    }
  ],
  "num_reviews": 22
}