{
  "title": "Black Swan",
  "rating": 8.2,
  "release_date": "2010-12-03",
  "genre": [
    "Drama",
    "Thriller"
  ],
  "summary": "Black Swan is a psychological thriller set in the world of New York City ballet. Featured dancer, Nina, finds herself locked in a web of competitive intrigue with a new rival at the company. (Fox Searchlight)",
  "critic_reviews": [
    "Just like the final performance by its deeply disturbed heroine, Black Swan is perfect.",
    "Artful, epic, operatic even, this thriller set in the world of ballet challenges the viewer with its intelligence and depth and wit.",
    "This eye-popping, inspired and often-demented (in a good way) cross between \"The Red Shoes\" and \"All About Eve\" channels horror maestros David Cronenberg, Brian De Palma and Dario Argento.",
    "One of the best movies of the year.",
    "To induce a state of dread and mesmerize with beauty is a rare, paradoxical achievement.",
    "This is, no doubt about it, a tour de force, a work that fully lives up to its director's ambitions.",
    "Wild and woolly, the movie is a breathtaking head trip that hails from a long tradition of backstage melodramas: \"42nd Street,\" \"A Star Is Born,\" \"All About Eve,\" and, yes, that kitschy '90s relic, \"Showgirls.\"",
    "Black Swan is visceral and real even while it's one delirious, phantasmagoric freakout.",
    "Whether your tastes are delicate or coarse, whether you prefer the ballet or horror movies, there is plenty in the film for you.",
    "A florid, often lurid, completely enthralling film held in place by a disarming Portman, who rarely leaves the frame.",
    "It's all or nothing with Black Swan. Either you embrace its headlong descent into madness brought on by the pressures of artistic perfection, compounded by smothering anxiety, or you reject it. It's that simple.",
    "A wicked, sexy and ultimately devastating study of a young dancer's all-consuming ambition, Black Swan serves as a fascinating complement to Darren Aronofsky's \"The Wrestler,\" trading the grungy world of a broken-down fighter for the more upscale but no less brutal sphere of professional ballet.",
    "This drama-horror hybrid, set within a New York ballet company, strikes a tone more along the lines of the terrifying hallucinatories of Aronofsky's breakout film, \"Requiem for a Dream,\" revisiting, too, favorite themes of monster mommies and female hysteria.",
    "Black Swan is ridiculously over the top, but in a way that makes it fascinating to watch.",
    "A near-masterpiece of a film set in the hothouse world of New York ballet.",
    "The look and feel of Black Swan, which captures the essence of a major New York ballet production, is one of Aronofsky's great successes.",
    "Portman's portrait of an artist under siege is unmissable and unforgettable. So is the movie. You won't know what hit you.",
    "A full-bore melodrama, told with passionate intensity, gloriously and darkly absurd. It centers on a performance by Natalie Portman that is nothing short of heroic.",
    "Is Black Swan high-minded? I'm happy to say: No. It is extremely high-grade hokum, which is to say it offers several different and combustible varieties.",
    "Lurid and voluptuous pulp fun, with a sensationalistic fairy-tale allure. You can't take it too seriously, but you can't tear your eyes away from it, either.",
    "An extraordinary, intoxicating movie. Its hard, twisted edges may turn off some, but there's no faulting either Aronofsky's technical mastery or Portman's flawless performance.",
    "Both a baroque thriller set in New York's ballet demimonde and a portrait of artistry as schizoid perfectionism, Darren Aronofsky's new film percolates parallel lines of fine madness-but then, doubling down on duality is this movie's raison d'etre.",
    "A near-irresistible exercise in bravura absurdity, Darren Aronofsky's Black Swan deserves to become a minor classic of heterosexual camp-at the very least, it's the most risible and riotous backstage movie since \"Showgirls.\"",
    "Aronofsky isn't loose enough, or canny enough, to be in touch with its camp soul.",
    "A psychosexual thriller that lures its viewers into a woozy nightmare.",
    "With Natalie Portman dominating the action and exhibiting a screen maturity not seen from her before, this all-stops-out Grand Guignol melodrama exhibits more than enough blood, sweat and tears (emphasis on the blood) to score nicely beyond the ballet crowd.",
    "Arriving with a savage grace, director Darren Aronofsky's nightmare-come-to-life Black Swan cements his reputation not only as one of the more daring filmmakers of his generation, but also as an actor's director of the first order.",
    "Like all his (Aronofsky) films, it's lurid, visually stimulating, thoughtful, absurd in spots, well-cast and unrelentingly intense.",
    "Black Swan is a stage door melodrama putting new spins on cliches as old as \"All About Eve\" (and maybe Adam). Setting them among ballerinas as opposed to showgirls or movie stars doesn't make them any less familiar.",
    "It's excessive and psychologically imprecise, coarse where it should be refined and too much like a David Cronenberg horror movie in places where restraint and intellectual rigor are called for.",
    "Audaciously whacked-out and never less than entertaining, Darren Aronofsky's Black Swan mixes a backstage dance drama with a Freudian psychological thriller that's indebted to Roman Polanski's studies of shattered feminine psyches and David Cronenberg's movies about repressed bodies in rebellion.",
    "Some girls fight over men. Ballerinas fight over parts. But the occasional brilliance of Black Swan is that it's a one-way fight. Nina battles herself.",
    "Aronofsky blurs the line between reality and fantasy, turning the film into a gothic horror show that is fascinating and disappointing in equal measure. What's resplendently real, though, is the beauty of Ms. Portman's performance. She makes the whole lurid tale worthwhile.",
    "The black/white duality isn't terribly interesting, but as in most of Aronofsky's films, an intense horror of the body and its uncontrollability fuels the rhapsodic psychodrama.",
    "For all its dazzling allure, Darren Aronofsky's Black Swan, a feverishly psycho thriller set in the hermetic world of classical ballet, proves a meaningless exercise in Grand Guignol exhibitionism.",
    "Me, I'm of two minds about a movie that wants to be a nail-ripping thriller and a statement on an artist's unholy communion with her role. It's reminiscent of older, better movies.",
    "Portman toils slavishly to realize Aronofsky's mad vision. It isn't her fault that, despite Black Swan's visual splendor and bursts of grand guignol excess, this emotionally inert movie never does grow wings.",
    "This exercise in hysteria is so over the top that you don't know whether to scream or laugh. Despite an emotionally gripping performance by Natalie Portman, it's nothing more than a lavishly staged \"Repulsion\" in toe shoes.",
    "A love-it-or-hate-it movie. Put me in the (sort of) hate-it column. My slight qualification here is because Darren Aronofsky's movie starring Natalie Portman as an increasingly unhinged ballerina gets points for being unlike anything else that's out there.",
    "Indeed, White Swan/Black Swan dynamics almost work, but the horror-movie nonsense drags everything down the rabbit hole of preposterousness.",
    "Off the dance floor, however, Black Swan is trashy and incoherent. Aronofsky, for all his gifts, is a gaudy maestro, opportunistic and insecure as an artist.",
    "Not just any kind of trash, it's high-art trash, a kind of \"When Tutu Goes Psycho\" that so prizes hysteria over sanity that it's worth your life to tell when its characters are hallucinating and when they're not."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "\"Black Swan\" is a fearless movie that unveils the psychological horror of perfectionism and observes the deepest, darkest personalities of mankind. All of this is created and formed with Keen, sensitive direction and a frightfully perfect\"Black Swan\" is a fearless movie that unveils the psychological horror of perfectionism and observes the deepest, darkest personalities of mankind. All of this is created and formed with Keen, sensitive direction and a frightfully perfect performance from Natalie Portman (as expected, she won a Oscar for her performance). Ultimately, this masterpiece is a beautiful dark twisted movie you must, and will watch.",
      "review_date": "2011-09-21"
    },
    {
      "review_title": null,
      "content": "This is one of the best movies made in the past ten years. Its art is mesmerizing. Its entry into the psyche of Portman nearly singularly unique. Its portrayal of the relationships excellent, its moments of tenderness and want, concern andThis is one of the best movies made in the past ten years. Its art is mesmerizing. Its entry into the psyche of Portman nearly singularly unique. Its portrayal of the relationships excellent, its moments of tenderness and want, concern and horror, worthy of almost any director. Over the years, we will see this film grow in stature. Its record twelve Broadcast Film Critics Association nominations are no mistake.",
      "review_date": "2010-12-14"
    },
    {
      "review_title": null,
      "content": "This movie is plain brilliant. The stronghold is its script as with all movies, but this one in particular stands out because of its very unique and dynamic development. The storyline is very original and it is putted out in the same way,This movie is plain brilliant. The stronghold is its script as with all movies, but this one in particular stands out because of its very unique and dynamic development. The storyline is very original and it is putted out in the same way, with a very intriguing and terrifying psychological plot. The concept of madness is its central element, and it is unwrapped is a way that will make you feel it yourself. The horror also takes deep involvement in the telling of this story and it has a huge part on constructing the mind altering movie this is. Over another aspect; the acting is as well excellent, with wonderful performances that have proven to be an essential part of this production with major contributions to the whole feeling of it. Totally amazing, this dark and machiavellian title will challenge your mind as never before and make you experience the psychological evolution through unexpected twists until achieved the utmost insanity seen in this movie.",
      "review_date": "2012-01-09"
    },
    {
      "review_title": null,
      "content": "Black Swan is almost as perfect as it's protagonist's final performance. With an incredibly detailed, perfected, yet subtle performance by Natalie Portman - a career best, most certainly - Black Swan manages to keep ones attention fullyBlack Swan is almost as perfect as it's protagonist's final performance. With an incredibly detailed, perfected, yet subtle performance by Natalie Portman - a career best, most certainly - Black Swan manages to keep ones attention fully throughout the length of the film. Not only does Portman shine, but so does the supporting cast, especially Barbara Hershey and Mila Kunis. With many fantastical aspects to the film, it is somewhat confusing and keeps one on the edge of their seat, since we never know what is really happening with Nina (Portman) and her surrounding. The cinematography is beautiful and the editing is done quite superbly. The musical score is very appropriate, with beautiful music by Tchaikovsky, including a techno-redo for a club scene, done by the Chemical Brothers.The only aspect of the film that left me wanting more was a pre-story to Nina's situation. Yes, the focus of the film is rather appropriate, but a nice extra 5-10 minutes at the beginning to set the stage would be nice. Or some sort of flashbacks? That, of course, would take away from the mystique of the film, but by the end I did feel I wanted to know more about Nina and how she got to where she was. The film did that in many ways effectively, but I still felt there were some things Aronofsky could have worked out.Nonetheless, one of the best films of the year, by far! Excellent!!",
      "review_date": "2011-10-17"
    },
    {
      "review_title": null,
      "content": "A deep and passionate ride that tickles your mind with a psychological twist. BS might cast level 5 confuse on you if you don't give it your full attention as it is compelling as it is bewildering.",
      "review_date": "2011-11-15"
    },
    {
      "review_title": null,
      "content": "My favorite movie from 2010. It's beautifully dark and intensely made by Darren Aronofsky, who has kind of a streak with me (my favorite 2008 movie The Wrestler). Natalie Portman's haunting performance is amazing. The whole cast brings theirMy favorite movie from 2010. It's beautifully dark and intensely made by Darren Aronofsky, who has kind of a streak with me (my favorite 2008 movie The Wrestler). Natalie Portman's haunting performance is amazing. The whole cast brings their A-game. Mila Kunis (her rival), Vincent Cassel (the creepy director),  and Barbra Hershey (the crazy-ass mother). I know it's not categorized as a horror movie, but it sure feels like it and it's nice to see some recognition from the academy.",
      "review_date": "2011-09-20"
    },
    {
      "review_title": null,
      "content": "This is a very interesting film. I really like how the whole movie went together. Now the one thing that some viewers might not like about the movie is how sexual the film is. It does play a part in the story. Like the more gritty dirtierThis is a very interesting film. I really like how the whole movie went together. Now the one thing that some viewers might not like about the movie is how sexual the film is. It does play a part in the story. Like the more gritty dirtier version of Swan Lake. The cast is excellent. Natalie Portman is pretty intense and so strict in her life. While you have Mila Kunis who is more bubbly and willing to do anything. Winona Ryder is in the film but seems like she was dying. Couldn't tell if it was her or the character. Vincent Cassel is also pretty good as he pushes Portman's character to be the best. The film really has a dark feel to it showing how the mind can warp reality and take control. If you are not a fan of the theater, when you here Swan Lake, you think boring. But even though this seems like a different movie, it actually has the presence of Swan Lake in the background and it makes it very more interesting to think about.",
      "review_date": "2011-10-07"
    },
    {
      "review_title": null,
      "content": "The intensity of this film elevates the artistic portrayal of Swan Lake far beyond what you may expect. Aronofsky enthralls the audience with this mesmerizing piece of art, coupled with Natalie Portman's phenomenal portrait as a troubledThe intensity of this film elevates the artistic portrayal of Swan Lake far beyond what you may expect. Aronofsky enthralls the audience with this mesmerizing piece of art, coupled with Natalie Portman's phenomenal portrait as a troubled young dancer.",
      "review_date": "2014-08-25"
    },
    {
      "review_title": null,
      "content": "Even though it starts out bland the latter part really digs into me with its disturbing imaging and artistic nature. I was hoping for the thrills to come sooner and I was just about to walk out when all of a sudden, I see Portman run intoEven though it starts out bland the latter part really digs into me with its disturbing imaging and artistic nature. I was hoping for the thrills to come sooner and I was just about to walk out when all of a sudden, I see Portman run into Kunis' arms. Things got really interesting after that. While not one of the greatest movies of all time it is still one of the best I've seen so far this new decade.",
      "review_date": "2011-03-24"
    },
    {
      "review_title": null,
      "content": "I like how Aronofsky can make that depressive atmosphere in his movies and you feel that tension and constant menace all along. This one is even more a thriller rather than a drama. Very good characters by Natalie Portman, Vincent Cassel,I like how Aronofsky can make that depressive atmosphere in his movies and you feel that tension and constant menace all along. This one is even more a thriller rather than a drama. Very good characters by Natalie Portman, Vincent Cassel, Mila Kunis and Barbara Hershey . Also Winona Ryder made a decent job though I didn't even recognize her.",
      "review_date": "2014-03-01"
    },
    {
      "review_title": null,
      "content": "Maybe it's the acting, maybe it's the perfect scrip, maybe are the musical numbers that makes this movie a perfect psychological thriller, with a storytelling technique unlike any other.",
      "review_date": "2014-05-01"
    },
    {
      "review_title": null,
      "content": "The balance between the performance of Natalie Portman and the directing of Darren Aronofsky are enough to get an incredible film. Everything else is gain for our feelings and give us goosebumps during the 108 short minutes.My perception ofThe balance between the performance of Natalie Portman and the directing of Darren Aronofsky are enough to get an incredible film. Everything else is gain for our feelings and give us goosebumps during the 108 short minutes.My perception of the film is the metamorphosis of grow up, how do you transform from childhood to adolescence or even to the maturity, displayed in a visceral and violent metaphor.Everything in this film is a topic of conversation, but for me, the most remarkable of the film is the immaculate cinematography, is one of the best that I had ever seen.",
      "review_date": "2021-12-13"
    },
    {
      "review_title": null,
      "content": "Amazing visceral acting, cinematography, score, and most importantly, the film deeply immerses you.Natalie Portman deserves an oscar nomination for her role.",
      "review_date": "2010-12-12"
    },
    {
      "review_title": null,
      "content": "I hate to be so vulgar but this movie was a total mindf*ck; and I mean that in the best way. Seriously, I don't know how else to describe it. Whatever it feels like to drop acid, that's what this movie was like. Mesmerizing. UncomfortablyI hate to be so vulgar but this movie was a total mindf*ck; and I mean that in the best way. Seriously, I don't know how else to describe it. Whatever it feels like to drop acid, that's what this movie was like. Mesmerizing. Uncomfortably intense, dark, powerful, creepy, sexy, and heartbreaking. I recommend you see it; it will kick your ass and you'll love every second of it!",
      "review_date": "2010-12-24"
    },
    {
      "review_title": null,
      "content": "Black Swan deserves the title of psychological thriller more than simple drama because, although its about a ballet dancer that wants to get the leading role in the Swan Lake, shows the journey that has to make an obsessive and disturbed girlBlack Swan deserves the title of psychological thriller more than simple drama because, although its about a ballet dancer that wants to get the leading role in the Swan Lake, shows the journey that has to make an obsessive and disturbed girl throw her subconscious to change her personality. But this will become more difficult because she will have to struggle not only against herself but also with an overprotective mother who tries to fulfill her broken dreams through Nina.Changes start physically and with the help of the director of the ballet company and another dancer, Nina will discover her alter ego. This concept is pursued by Darren Aronofsky, and it can also be notice in The Wrestler. The idea is to show the other side of reality, the one that scares us, our other personality hidden deeply in ourselves.The performances are as remarkable as the plot, and in the final scene, Natalie Portman gives an incredible presentation, which is impulsive and seductive at the same time, culminating her transformation and achieving perfection.The amazing thing about this movie is that all the elements: plot, performances, music, dialogues, confusing and frightening images, leads to complete madness. And because of this is hard to distinguish if the things that you see in the movie are fact or fiction, but that topic is for your own interpretation.",
      "review_date": "2012-01-13"
    },
    {
      "review_title": null,
      "content": "\"Black Swan\" runs an intense and gripping course that is provided by the direction of Darren Aronofsky; but the spectacular and spellbinding performance of Natalie Portman is the reason that this film will be remembered long after.",
      "review_date": "2010-12-06"
    },
    {
      "review_title": null,
      "content": "Outstanding film.  Portman gives an excellent performance.  This is not a film that is enjoyable to watch, minute-to-minute, as it moves along.  It is a ride you are on.  And it is incredibly stressful and scary at points, but that is a signOutstanding film.  Portman gives an excellent performance.  This is not a film that is enjoyable to watch, minute-to-minute, as it moves along.  It is a ride you are on.  And it is incredibly stressful and scary at points, but that is a sign of Aronofsky's success in putting you inside the protagonist's increasingly frayed mind.  The ending is exhilarating and powerful.  As good of a closing 30 seconds as I have seen in a film in quite some time.  The film is an excellent piece of art with several good acting performances.",
      "review_date": "2010-12-06"
    },
    {
      "review_title": null,
      "content": "I loved this movie! Natalie Portman was mesmerizing! I was on the edge of my seat for most of the movie. It was exhilarating and disturbing at the same time. An Oscar contender for certain. I would see this movie again.",
      "review_date": "2010-12-31"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA beautiful, seriously flawed, at times laughable, melodrama. The only suspense, soon disposed of, is whether we are witnessing the descent into madness or a ghost story. Descent into madness it is! Sit back and watch her unravel, or rather metamorphize. Vincent Cassell is out of his depth in a role that requires more than his usual fetid pathological intensity. Natalie is sweet but her ultimate transformation seems like more than she can, or is allowed to, emote. The ultimate problem lies in the often weak direction which seems engrossed in pulp fiction or comic strip camp instead of the exploration of driven ambition.",
      "review_date": "2010-12-18"
    },
    {
      "review_title": null,
      "content": "Histrionic and overly-dramatic movie full of smoke and mirrors, with nothing new to reveal. Natalie Portman, a fine actress, is tearful and earnest. Since the film is all from her POV we never know when she's hallucinating. Perhaps theHistrionic and overly-dramatic movie full of smoke and mirrors, with nothing new to reveal. Natalie Portman, a fine actress, is tearful and earnest. Since the film is all from her POV we never know when she's hallucinating. Perhaps the overbearing mother is a total hallucination as well. Perhaps the whole ballet company is a hallucination.Seriously, what Martin Scorsese did in a similar over-the top vein in Shutter island still contained a surprise at the end, which gave context to the horrific and strange events the main character experienced.  But where's the surprise in seeing Portman going slowly crazy. Not to mention that Aronofsky himself is totally mired in the Madonna-whore complex, seemingly unable to portray a woman realistically.",
      "review_date": "2011-02-20"
    },
    {
      "review_title": null,
      "content": "I watched this because of all the hype and awards it was garnering. After watching this, I was quite surprised. It was not nearly as good as what most of the critics were saying. I mean, the whole movie is about Nina and how she descends intoI watched this because of all the hype and awards it was garnering. After watching this, I was quite surprised. It was not nearly as good as what most of the critics were saying. I mean, the whole movie is about Nina and how she descends into madness. And that's it. Everything else are just fillers. The ballet dancing, sure, it was great and Natalie Portman did a splendid job. There were, what I would consider \"unnecessary\" scenes that contributed much to the film's age viewing classification. Hmm... I don't quite know how to put this but we don't really get to see much love towards the \"art of ballet\" instead we get a tortured soul that happens to be in ballet. We never get to see Nina loving ballet. We just see her desire to be perfect. This is not a bad film, not it is definitely not. But it is not as good as I thought. I don't believe this film will bag the Best Picture Oscar, but Natalie Portman, sure, she will for Best Actress in a Leading Role.",
      "review_date": "2011-02-11"
    },
    {
      "review_title": null,
      "content": "Natalie Portman was difficult to watch in this so-called psychological thriller. Her quest for perfection took her into the uncharted territory of real/imagined physical injuries and damages, real/imagined conflicts with her demanding andNatalie Portman was difficult to watch in this so-called psychological thriller. Her quest for perfection took her into the uncharted territory of real/imagined physical injuries and damages, real/imagined conflicts with her demanding and smothering mother and her jealous competitors, and real/imagined conflicts about her sexuality.This movie was painful to watch because it WENT NOWHERE and had no UNDERSTANDABLE RESOLUTION in the final frame. If I had ten thumbs, they would all be DOWN in rating this abortive attempt at defining the conflicts of a woman searching for ultimate acceptance of her talents by all her peers and her critics. An absolutely HORRIBLE, DEPRESSING MOVIE!!",
      "review_date": "2010-12-25"
    },
    {
      "review_title": null,
      "content": "Who wrote this crap?!! What an objectionable, cluttered, incoherent, sophomoric mess.  Give me \"Repulsion\", \"The Tenant\" or \"Gaslight\" instead of this pretentious, infantile drivel.",
      "review_date": "2011-02-13"
    },
    {
      "review_title": null,
      "content": "High art, beautiful photography, great costumes.  So so acting, over the top plot, with a few memorable moments.  Go to an afternoon showing or wait for it to come to your ondemand service.This movie does not deserve an Academy AwardHigh art, beautiful photography, great costumes.  So so acting, over the top plot, with a few memorable moments.  Go to an afternoon showing or wait for it to come to your ondemand service.This movie does not deserve an Academy Award nomination.  It's good, but overhyped.",
      "review_date": "2011-02-21"
    },
    {
      "review_title": null,
      "content": "Awful movie! I almost walked out like half the audience! What were the critics thinking? Ok, she does a decent acting job but 80% of the movie is nothing but pure PORN! if that's what you're looking for then enjoy. Personally I had no desireAwful movie! I almost walked out like half the audience! What were the critics thinking? Ok, she does a decent acting job but 80% of the movie is nothing but pure PORN! if that's what you're looking for then enjoy. Personally I had no desire to see girl on girl and other sexual acts on a large screen. Trailers & movie description VERY MISLEADING. I left wanting my money and sense of decency back.",
      "review_date": "2011-02-22"
    },
    {
      "review_title": null,
      "content": "Boring and disturbing.  Could not even finish it.  I do not qualify insanity and boarder line porn ART.  This movie was so uncorfortable that we decided to not put ourselves through any more torture.",
      "review_date": "2011-04-10"
    },
    {
      "review_title": null,
      "content": "A lite porno with a tacked on story line that was as \"thrilling\" as watching a silent horror movie from the silent movie era where the only sound was that of a piano being played to enhance the viewers mood during those otherwise silentA lite porno with a tacked on story line that was as \"thrilling\" as watching a silent horror movie from the silent movie era where the only sound was that of a piano being played to enhance the viewers mood during those otherwise silent screenings. Except this movie doesn't have that piano to enhance the mood. The only disturbing sound throughout this entire movie is that of a protagonist that, when speaking, stuck out like a broken, ill confident little child. Would this kind of character ever get to be the star of a leading production ballet company? I don't even hardly think so.If the protagonist in this movie were to have been, from the start, an over confident and obnoxious character that slowly descended into madness then this would have been much more thrilling. Instead the meek and clueless character gets a little less meek and a little less clueless and then completely breaks. Bearing in mind that the impact of this break might be equally reflected by an egg cracking on the floor after having been accidentally dropped, not thrown. Not a very surprising result, really.The actors made a valiant attempt at playing the characters that they were assigned. It's just a shame that the characters were all bland.This film gets 2 points from me. The lite and brief porn scene at least made me sit up straight in my chair and grabbed my attention that little bit more for those few, undeserving seconds.If you're a fan of ballet then you might appreciate the behind-the-scenes drama this film shows. If you're not a fan of ballet then I would suggest you look elsewhere for a thrilling time.",
      "review_date": "2011-07-04"
    },
    {
      "review_title": null,
      "content": "Honestly. The best movie I've ever seen. I believe it was a nicely cast film and well written. It takes you deep into the psychologically disturbed mind of Nina (Natalie Portman). It's apparent that Nina is a closed off \"mama's\" girl. Nina,Honestly. The best movie I've ever seen. I believe it was a nicely cast film and well written. It takes you deep into the psychologically disturbed mind of Nina (Natalie Portman). It's apparent that Nina is a closed off \"mama's\" girl. Nina, still living with her mother and sleeping in a pink bedroom, starts the film seeming rather normal with a few odd things such as the scratches on her back. Things seem to spiral further into psychological torment after she is cast as Swan Queen in \"Swan Lake\". She, as well as the audience, begins to see things wrong with her that everyone around her cannot see. For example, the tearing of skin off her finger in the bathroom, the lesbian love scene with Lily (Mila Kunis). In this fantastic psychological thriller Natalie Portman reaches what seems to be deep down to be able to portray herself as this disturbed soul. The last scene is simply breathtakingly fantastic, leaving you in awe and wanting more. One of the best film's I have ever seen. I say you must watch \"Black Swan\".",
      "review_date": "2011-07-03"
    },
    {
      "review_title": null,
      "content": "Black Swan is gripping, dramatic, intense and passionate and Natalie Portman brings all that in her unforgettable performance. This movie also has a strong performance from Mila Kunis and has some cool visual effects that fit the movie. IBlack Swan is gripping, dramatic, intense and passionate and Natalie Portman brings all that in her unforgettable performance. This movie also has a strong performance from Mila Kunis and has some cool visual effects that fit the movie. I give this movie 93%.",
      "review_date": "2011-12-30"
    },
    {
      "review_title": null,
      "content": "Coming from a successful award circuit with The Wrestler - which consequently restarted Mickey Rourke's acting career - director Darren Aronofsky returns with the ballet-based psychological thriller Black Swan. Following in the footsteps ofComing from a successful award circuit with The Wrestler - which consequently restarted Mickey Rourke's acting career - director Darren Aronofsky returns with the ballet-based psychological thriller Black Swan. Following in the footsteps of Aronofsky's previous films (Pi, Requiem For A Dream), Black Swan is a dark psychological nightmare with disturbing cinematography that freely crawls underneath the skin of its audience.  In his newest venture,  it seems as if Aronofsky took stylistic notes from Jean-Luc Godard and at the same time attempted to make a vague statement.  Essentially, Black Swan is a film that has too much style rather than its implied substance. Like The Wrestler, Black Swan converges most of its attention onto a single character. Natalie Portman strays from her archetypal roles and impeccably plays the innocent character of Nina; an aspiring ballerina who receives the star role of the \"Swan Queen\" in an upcoming rendition of Swan Lake. The production of Swan Lake requires the queen to play the innocent White Swan and the provocative Black Swan.  Primarily, the film focuses on Portman's conservative character, who must under pressure, contrastingly channel her inner malevolence to \"perfectly\" perform her role.  Portman IS the highlight of this film. Like with Mickey Rourke in The Wrestler,  Portman defines herself as an actress in this film. Although it takes an excessive amount of time to buildup to Nina's breakdown, the final half of Portman's performance is flawless. The spectrum of emotion and insanity she displays is so real, she has truly locked the \"best actress\" category for the upcoming award season.While Portman's performance is flawless, this brings to question the real point of the film. Aronofsky places symbolism in the film that is vague and at the same time obvious. With different scenes of shocking imagery such as the sensual scene between Kunis and Portman, it is really difficult to grasp why the film possesses such figurative scenes. There are various points of blatant symbolism, giving the impression that the film attempts to be deep. An exemplification of this complaint is the non-stop sensuality seen in the film.  I acknowledge that it is to bring out Portman's immorality and show the effects of a disturbed artist, but there is just so much that it overshadows the brilliance of the film.  There are too many figurative aspects in Black Swan. That is where the film loses substance, it tries to be cerebrally    abstract even when it is not.   The film really should have focused on Portman's mental breakdown rather than employing figurative imagery. Even though the film's \"figurative\" impression refrains itself from being a masterpiece, Black Swan is one of the best films that 2010 offers. Set aside the excessive focus on deepness,  Aronofsky's film is visually gorgeous and its intensity immense.  The visual imagery is the disturbing essence that you expect from the director. It digs into your emotions, and it stays there throughout the movie. Black Swan is gritty and raw, and the usage of handheld filming is subtle yet effective (unlike movies like **** which uses it in an irrelevant fashion).Overall, Black Swan is an excellent film that is not quite the \"masterpiece\" that many are saying it is.  With that being said, it is still a quality film where its pros outshine its cons. Its visual brilliance and its suspenseful emotion makes up for the film's flaws. Black Swan will disturb and haunt its audience to the fullest. Hopefully audiences will just ignore the film's senseless statement. Grade: B+",
      "review_date": "2010-12-03"
    },
    {
      "review_title": null,
      "content": "If 'Black Swan' was directed by David Fincher, it would be called 'Ballet Club,' and it would be a thematic sequel to 'Fight Club.' However, it wasn't directed by Fincher, but instead by Darren Aronofsky, which explains why it is probably theIf 'Black Swan' was directed by David Fincher, it would be called 'Ballet Club,' and it would be a thematic sequel to 'Fight Club.' However, it wasn't directed by Fincher, but instead by Darren Aronofsky, which explains why it is probably the most well-directed movie of the year. I can't say that it is the best film of the year, which I believe is 'The Social Network' because it is both good and culturally relevant, but Aronofsky's skill is at its peak in 'Black Swan,' and it sure is something to marvel. I believe Aronofsky exquisitely directed the most perfectly structured and beautifully told story of any film I have seen this year. I still give major props to Fincher, as well as David O Russell ('The Fighter') and Christopher Nolan ('Inception'). Natalie Portman steals the screen for the majority of the film, brilliantly portraying the fragile ballerina Nina Sayers. After winging the role of the Swan Queen in the upcoming show of the popular Swan Lake dance, Nina struggles to move out of the shadow of her nutty, sheltering mother, while rejecting the sexual advances and dark nature of her extremely professional instructor, all the while preparing for a performance she wants to make perfect. Seeing 'Tron Legacy' and 'The Fighter' before this (I saw all three in one day) helped keep me up with this whole perfection fiasco, which is the entire theme of 'Black Swan.' The most brilliant thing about 'Black Swan' is that it actually adapts the story of 'Swan Lake' into Nina's story that we see in the film. Since I'm a guy, I know very little about 'Swan Lake,' but Aronofsky obviously wasn't targeting all females with this film, so he throws in a summary about halfway in. It is then that you should be able to pick up that everything Nina is going through is a literal translation of the 'Swan Lake' story. This is even easier to notice with the orchestra music that plays throughout the movie during scenes that would not normally have music playing in the background. Most guys won't find this information fascinating at all, but hey, we get to see two hot chicks making out. Or do we? Aronofsky does a lot more with this film than you'll probably be able to notice after seeing it once. This includes having Natalie Portman always wearing white while Mila Kunis always wears black, to represent Portman as the Swan and Kunis as the dark side, although this symbolism is all in Nina's head. Her reluctance to push everyone else out of her life shows as we continually see her trying to keep her mother out of her room, as well as her attempts to impress her instructor while failing to understand what he wants out of her. Her struggle to impress two perfectionists drives her to the point of insanity, and the balance of the two characters on Nina's shoulders represents the struggle of the \"swan\" with it's dark side, which we see leads to a surprisingly extravagant conclusion. I would say that Aronofsky was very Fincher-esque with the psychological mindf**k, Kubrickian with the perfectionist structure of the film (especially with the bombastically loud orchestral soundtrack), or even Tarantinoish with the way he incorporated symbolism every which way (as 'Inglourious Basterds' did), but if you have seen any of this director's past films, you will understand that this is all Aronofsky. While it is indeed perfect, and very symbolic, it is also very dark and never afraid to push the limits, just as his other films are. 'Black Swan' as a whole represents the beauty of Aronofsky's dark natured filmography, although some will not like it since the limits the film pursues to push are not the type fans of Disney's 'Ice Princess' would've expected. It actually thrilled me to see many of the young girls in the theater covering their eyes throughout the film, just so I could assure myself that I wasn't watching some Hannah Montana manure.",
      "review_date": "2010-12-21"
    },
    {
      "review_title": null,
      "content": "This is the best movie to come out in the past twenty years. Absolutely gorgeous, and haunting at the same time. It will stay on your mind for days after seeing it. Every Academy Award should go to Black Swan, Natalie Portman, and DarrenThis is the best movie to come out in the past twenty years. Absolutely gorgeous, and haunting at the same time. It will stay on your mind for days after seeing it. Every Academy Award should go to Black Swan, Natalie Portman, and Darren Aronofsky. My new favorite movie.",
      "review_date": "2011-01-03"
    },
    {
      "review_title": null,
      "content": "As I was watching \"Black Swan,\" I started counting the times the camera lingered on Natalie Portman staring pointlessly at herself in a mirror and lost count at eight billion.  Guess that means I'm not one of the many crying \"bravo\" for thisAs I was watching \"Black Swan,\" I started counting the times the camera lingered on Natalie Portman staring pointlessly at herself in a mirror and lost count at eight billion.  Guess that means I'm not one of the many crying \"bravo\" for this film.  I love Vincent Cassel, but here he's wasted as one more catalyst for the flowering of Natalie Portman's neurosis into capital-A Art.  It's interesting to me that Winona Ryder showed up as the has-been dancer because Portman seemed to base her character on the timid mental patient Ryder played in \"Girl, Interrupted\" (watchable only for Angelina Jolie's much more dynamic sociopath).  The difference here is that we experience manifestations of Portman's disintigration and are clearly supposed to wonder whether she is, in fact, being sabotaged.  That would be the thriller part.  But it's evident from the first 10 minutes of the movie that this chick is way too screwed up for anyone to bother sabotaging; all an intelligent rival would have to do is stand around, smoke a cigarette or two, and wait for her to self-destruct.  So \"thrills,\" for me, along with surprises, were in pretty short supply.  I was mildly interested in how she'd finally sex up her Black Swan (hint: no sex involved) but rolled my eyes when it finally happened.  I'm happy for all the people who swooned with delight at this film, but I was definitely not one of them.  Plusses: some nice dancing.  Vincent Cassel putting the mack on Portman then walking off in disgust.  Barbara Hershey's scary facelifts finally used to advantage.",
      "review_date": "2011-01-10"
    },
    {
      "review_title": null,
      "content": "Considering all the laudatory reviews and the number of 10 ratings one might assume a masterpiece had birthed. Alas not for this viewer. Natalie did a fine job, no problem there, but talk about an overwrought  Polanski rip-off. If this isConsidering all the laudatory reviews and the number of 10 ratings one might assume a masterpiece had birthed. Alas not for this viewer. Natalie did a fine job, no problem there, but talk about an overwrought  Polanski rip-off. If this is masterful film making today, I'm depressed. It had the makings of an interesting, dramatic thriller. But where was the subtlety, the craft of a work that gradually seduces you. Not here. I'm only seen a couple major reviewers that have really questioned the artfulness of this project. I felt like I had been hammered by it. It was so over the top.",
      "review_date": "2010-12-20"
    },
    {
      "review_title": null,
      "content": "Very Disappointed in this movie.  Yes the dancing and the Photography is good, but it takes a lot more then that to make an interesting movie.  My group found the movie tiring and the ending predictable.  The idea that anyone would cast suchVery Disappointed in this movie.  Yes the dancing and the Photography is good, but it takes a lot more then that to make an interesting movie.  My group found the movie tiring and the ending predictable.  The idea that anyone would cast such a fragile, timid ballerina in the lead of a major production  of Swan Lake in one of the world's premiere ballet companies is laughable. Dancing required hard work and discipline. As the movie states, it is a very competitive art. I do not think this character, who still sleeps in a room that was designed for a three year old would have ever made it past her first three years of dance, much less make it to stardom. She would have \"cracked up\" years and years before.  I have read the other reviews and \"know where they were going\"...I just don't think they ever got there.",
      "review_date": "2010-12-31"
    },
    {
      "review_title": null,
      "content": "I heard great reviews about this movie so I expected to see a great movie about the ballet Swan Lake. The movie started with camera work I would have expected from an amateurish 8th grader holding the camera for the first time. It was shaky,I heard great reviews about this movie so I expected to see a great movie about the ballet Swan Lake. The movie started with camera work I would have expected from an amateurish 8th grader holding the camera for the first time. It was shaky, forcefully zoomed in, and did not capture the mood of an ballet. After the terrible camera work hit me I was forced into the overworked tense scene where everything they tried to place in a scene that would scare her just seemed funny. The dream sequences which were not dream sequences left me asking who asking who came up with this script and you need to pick a genre and stick to it. Finally while things like costumes and acting were amazing, the directing was terrible and ruined what could have been a great movie.I go to art school and saw it with my art school friends, unless you are a pretentious art school kid, skip this movie. As a man, even the lesbian scene was just sad and I kind of laughed through most of it due to just how unrealistic this movie is. I can't really find a group of people to recommend this to. I know girls who have done Ballet and yes they are stressed but do not have mental issues like she does. Just generally a bad movie...",
      "review_date": "2011-01-05"
    },
    {
      "review_title": null,
      "content": "Unbelievably trashy. A cross between Polanski's Repulsion, Carrie and everything done by Cronenberg. But unfortunately done by all the above much better. A boring, repulsive, claustrophobic experience with a courageous, yet artificialUnbelievably trashy. A cross between Polanski's Repulsion, Carrie and everything done by Cronenberg. But unfortunately done by all the above much better. A boring, repulsive, claustrophobic experience with a courageous, yet artificial performance by Portman. I never believed for a minute that she was the obsessed, naive and sheltered character she was playing. And this whole nonsense that all she needed was a good orgasm to perform the Black Swan with passion was too much. And was the lesbian sex scene really necessary?",
      "review_date": "2011-01-04"
    },
    {
      "review_title": null,
      "content": "This is one of the worst movies made in the past 10 years.  After all the buzz, my wife and I had hyped up hopes that were dashed halfway through this wannabe psycho-thriller.  It's one of those movies in which, at the end, when you expect toThis is one of the worst movies made in the past 10 years.  After all the buzz, my wife and I had hyped up hopes that were dashed halfway through this wannabe psycho-thriller.  It's one of those movies in which, at the end, when you expect to have this \"aha\" moment that gives some measure of clarity or answers ... you see the beginning of the film credits.  We expected a sophisticated, sexy thriller ... we got a goofy movie with a few titillating scenes with Portman squirming on a bed.",
      "review_date": "2011-01-19"
    },
    {
      "review_title": null,
      "content": "Black Swan is one of those all too rare films these days where you are never quite sure where it is going.  Sometimes that can be upsetting and disorienting--but not so with this film.  Aronofsky's direction kept me constantly on edge andBlack Swan is one of those all too rare films these days where you are never quite sure where it is going.  Sometimes that can be upsetting and disorienting--but not so with this film.  Aronofsky's direction kept me constantly on edge and even provided some genuine thriller moments where more than one audience member shrieked out loud.  It is a darkly hued tale expertly told and performed by Natalie Portman in what is surely one of her most powerful roles to date.  Indeed this story is at times disturbing and provocative, but that's the way good art should be--even in the seemingly simple lithe world of ballet dancing.",
      "review_date": "2010-12-20"
    },
    {
      "review_title": null,
      "content": "The first thing I did after seeing The Black Swan, was buy new socks. Comfort is not in the emotional vocabulary of this film. Think Requiem for a Dream without the laughs or the moral tale. Black Swan is a fable of self destruction.",
      "review_date": "2011-02-15"
    },
    {
      "review_title": null,
      "content": "Wau!!! Awesome, Natalie Portman is wonderful. She make a mysterious and fantastic interpretation. Darren made a movie that it can be one of the best in this year. Mila Kunis do a great job.",
      "review_date": "2011-02-05"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBlack Swan makes Harry Potter and the Deathly Hallows Part 1 look like best picture of the year--I say this because I thought the Potter movie just might be the worst movie of 2010.  To my surprise, and dismay, that is not the case.  There's an even worse film:  Black Swan.  It takes itself so seriously--We're making Art here, people!--that I wished I was watching ballet and not this movie.  I hate ballet and this movie made me want to watch ballet.  That's how bad this movie is.  Watching ballet would have been more entertaining, more fun, and for more original than this insipid meat cleaver to the face--thirty seconds into the movie and it's clear that Natalie Portman's character is madder than a hatter and there the guesswork ends; the conspicuous meat cleaver has split your face in two, but does director Aronofsky stop there?  Nope.  His disgust for subtlety (of any kind) knows no bounds, or shame.  He wants us to be so sure that Portman is madder than a hatter that he meat cleavers us in the face over and over:  She's madder than a hatter!  It's all in her head!  Get it?  Yes, Darren Aronofsky, I got it thirty seconds into the movie when the first meat cleaver got me square between the eyes, thank you very much.  This movie is so bloody obvious that I began to wonder if Aronofsky simply doesn't want his audience to use their brains while watching one of his art house movies.  (We're making Art here, people, and curing cancer!)  Is he so threatened by someone else's interpretation that he leaves no possible room for interpretation?  Is that the reason for the meat cleavers to the face, Darren?  If true, I'd argue Aronofsky's got some issues that he might want to take up with his urologist.  There isn't an original moment in this predictable, so-called disturbing movie.  Disturbing?  It's disturbing that Black Swan was so bad it made me want to watch ballet!  To make matters worse, (if that's possible, and dear God in heaven, it is), there isn't a likeable character in the entire film.  Now, there's nothing in filmmaking 101 that says you have to have a likeable character in your movie, but basic storytelling will tell you that if you want your audience to connect in a way that matters, a likeable character might be a good idea.  In the very least, have an unlikable character find some kind of redemption at the end so that the audience will feel emotionally satisfied.  In Black Swan, every character is not only an obvious stereotype, they're repugnant.  (When Barbara Hershey came in as the evil ballet stage mother, I thought I was watching bad satire.)  I was like, well, geez, I can't stand these people, I have no hope for them, it's clear there is no hope for them because they're all crazy, so why do I care what happens to them at the end?  It isn't my fault that I felt this way.  It's Darren Aronofsky's fault.  When the end did finally come (thank God), was I surprised, shocked, horrified, confused, sad?  No!  I just wanted to get out of the theatre and see some ballet!  And this brings me to Natalie Portman's brave acting job:  Brave because she lets a hot chick go down on her and shows us her orgasm face.  Wow, that takes some talent.  (Porno stars do it all the time, but they're professionals so they make it look easy.)  Halle Berry did the same thing for Monster's Ball, and she did it better, longer and with Billy Bob Thorton--now that's what I call brave!--and at least Halle showed some boob.  All we get in Black Swan is Portman's worried orgasm face.  Of course, she'll be nominated for an Academy Award for Best Actress (because she was so brave--We're making Art here, people, curing cancer and bringing peace to the world!)  The Academy did the same thing to Halle, but Hollywood has a tradition of rewarding actresses who show us their orgasm faces in movies.  Put a famous actress in a movie where a guy or girl goes down on her and she shows us her orgasm face and you can be sure she'll receive a nomination.  Most of the time, they don't do that for the men.  (Sean Penn got an Academy Award for MILK, but he didn't show us his orgasm face or go down on a guy in the movie, so it doesn't count.)  It's usually just the ladies.  Hollywood's orgasm face double-standard, like this typical Hollywood movie:  A steaming pile of hubristic crap.\r My rating:  Six Irish Carbombs and a Mind Eraser shooter, and a ticket to the ballet.",
      "review_date": "2011-01-12"
    },
    {
      "review_title": null,
      "content": "Surprisingly one dimensional and lacking in heart, especially when compared to Aronofky's The Wrestler from a year ago which I thought was superb. Natalie Portman was good, as was most of the other acting, but the movie as a whole did notSurprisingly one dimensional and lacking in heart, especially when compared to Aronofky's The Wrestler from a year ago which I thought was superb. Natalie Portman was good, as was most of the other acting, but the movie as a whole did not make me care at all.",
      "review_date": "2011-01-17"
    },
    {
      "review_title": null,
      "content": "Way over hyped.Natilie Portman acts in a movie that is both bland and banal.I am amazed at the ridiculously high scores from the luvvie film reviewers.",
      "review_date": "2011-02-02"
    },
    {
      "review_title": null,
      "content": "Neither fish nor fowl-\"Black Swan\" neither surprises nor probes the mind of its would-be tragic heroine. The theme of the young femme lost in an exhibitionistic/voyueristic art-world, beset by a husky voiced rival, willing to do everything itNeither fish nor fowl-\"Black Swan\" neither surprises nor probes the mind of its would-be tragic heroine. The theme of the young femme lost in an exhibitionistic/voyueristic art-world, beset by a husky voiced rival, willing to do everything it takes among the casting couch set - and then some, has been done before and much better. Take it from this man raised in a ballet family, see \"Show Girls\" for the real deal! Ironically, that piece of high-brow trash was the one critics loved to loath - which I take, as here, a mark of the nebbish anti-sexual nerdosity of the average film reviewer. In short, \"Black swan\" is predictable and boring, while \"Show Girls\" still delivers the devilish thrills and erotic chills Swan is wan to do.",
      "review_date": "2011-02-06"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBooooooooooooooooooooooooooooooooo!!! Was I trippin on acid? This movie is a mess!!! a weak storyline, and average acting does not a Oscar make!!! I know some of you fan boys loved to hot **** scene but I though it was a little tasteless.....wait....or did it really happen!!! who knows, who cares! I give this movie 2 thumbs down!!!",
      "review_date": "2011-01-31"
    },
    {
      "review_title": null,
      "content": "As someone who has been involved with ballet both as an aspiring dancer and an administrator I was looking for ward to this film with great anicipation, particularly considering the overall glowing reviews. It took about five minutes toAs someone who has been involved with ballet both as an aspiring dancer and an administrator I was looking for ward to this film with great anicipation, particularly considering the overall glowing reviews. It took about five minutes to dissolve. The rest of the time watching this film was utterly painful and a complete waste of time. An idiotic plot without drama (in spite of the gory blood and explicit sex), stereotypical characters, wooden acting and ridiculous attempts at making Natalie Portman look like a dancer. She does, when standing still, having achieved the required amaciated look but nothing more. Her very beautiful face is in every scene - but after a while even the most gorgeous looks become tedious, especially if it only has the one static expression of a stunned rabbit cought in the spotlight.\rThe film offers no subtelty, no mystery, no suspense. It's boring and predictable, confirming all existing prejudices that surround ballet.  It doesn't even show any interesting dancing .An utterly dull film that makes a mockery of the art form that it sets out to portray. Stay away!",
      "review_date": "2011-02-04"
    },
    {
      "review_title": null,
      "content": "I had been wary going to see this film after reviewers who I would generally trust had been greatly unimpressed by it, but as a big fan of Requiem for a dream I still had hopes. I had read that as a description of the ballet world it was fullI had been wary going to see this film after reviewers who I would generally trust had been greatly unimpressed by it, but as a big fan of Requiem for a dream I still had hopes. I had read that as a description of the ballet world it was full of clichs, but this did not concern me, as it was not intended to be one. What did, was that as a portrayal of anything faintly human, there was nothing but ridiculous pastiches of human beings. The premise of the film is the extreme suffering and destructive forces a person must endure to achieve their artistic goals. While there is truth in the idea that one must suffer for their art, or to excel in anything, this idea is explored in a crude and superficial way. Black Swan trades on a romanticized view of the 'high art' ballet world, and on the idea of the mysterious and mad artist perusing perfection at the expensive of their sanity. This is itself just another clich, and an approach that makes the most of the cultural myth of the tortured and illusory artist engrossed in an exotic and unhinged life. While this idea may be seductive to some judging from the many favourable reviews, if you are not sucked in by the shallow illusion, all that is left is affected banality. In time I think this film will come to be seen in a less favourable light.",
      "review_date": "2011-02-05"
    },
    {
      "review_title": null,
      "content": "To be honest, I was very disappointed by this movie.  When I saw the previews, I really wanted to see it.  It looked like a film that dealt with the trials and tribulations of perfectionism, masochism, and mental illness.  It did deal withTo be honest, I was very disappointed by this movie.  When I saw the previews, I really wanted to see it.  It looked like a film that dealt with the trials and tribulations of perfectionism, masochism, and mental illness.  It did deal with all three of those issues but in an extremely slow and unexciting way.  I did not connect with any of the characters and the ending was no surprise.  Because there was no connection made with Natalie Portman's character, I didn't even feel bad for her in the ending.  Honestly, I was just glad the movie was over and was grabbing my coat the second she made the jump.",
      "review_date": "2011-02-20"
    },
    {
      "review_title": null,
      "content": "i dont understand why natalie portman is getting such rave reviews(dancing aside).. she either cried or hyperventilated for 2 hours thats it ... i had more questions than answers by the end of that movie, for all the hype was i was veryi dont understand why natalie portman is getting such rave reviews(dancing aside).. she either cried or hyperventilated for 2 hours thats it ... i had more questions than answers by the end of that movie, for all the hype was i was very disappointed.  a",
      "review_date": "2011-02-22"
    },
    {
      "review_title": null,
      "content": "There are very disturbing sequences throughout this film of putrefying flesh and violated bodies, and these images do not make sense, either psychologically or artistically.  They are simply the usual manipulations of the audience employed byThere are very disturbing sequences throughout this film of putrefying flesh and violated bodies, and these images do not make sense, either psychologically or artistically.  They are simply the usual manipulations of the audience employed by almost all films of the horror genre.  Such images play upon the morbid fascination that one feels when considering the loss of something that one considers to be essential to one's being, like a leg, or one's flesh, or one's face, or one's eyes.  Not even one of the characters is truly nurturing of either art or of the human beings who make it.  Even the mother of the lead character is revealed to be a falsely nurturing figure.  If that were true in real life, then there would be no art at all.  The movie left me with a feeling of dread that took several hours to overcome.",
      "review_date": "2011-01-16"
    },
    {
      "review_title": null,
      "content": "Lets be honest, in 5 years time people are not going to be looking back saying \" wow, remember that movie Black swan? It was amazing!!!\" Nope, Once it has finished surfing its current 'hype' wave, it will sit among the 'pretty good' movies ofLets be honest, in 5 years time people are not going to be looking back saying \" wow, remember that movie Black swan? It was amazing!!!\" Nope, Once it has finished surfing its current 'hype' wave, it will sit among the 'pretty good' movies of 2010! Ill give credit where its due, Natalie Portman gives so much of herself that you wonder what depths she went too to portray this tortured soul...She is absolutely spellbinding. The Director 'Darren Aronofsky' however holds the reigns as best he can, but with such a bleak pallet and morbid tone, his raw technique, digs deeper than it needs and seems lost in its own pretensions. The Final 20 minutes however are breathtaking, with all the forgotten loose ends brought together in a truly operatic finale. To be fair maybe it needs another viewing to fully appreciate its complexities, but the thing is, \" I don't  want to watch it again\"!!",
      "review_date": "2010-12-29"
    },
    {
      "review_title": null,
      "content": "This movie's plot was thin and played out in a shocking and gruesome way. Come on folks, give the viewer a little more credit for taste and intelligence.",
      "review_date": "2010-12-21"
    },
    {
      "review_title": null,
      "content": "Portman sports a worried grimace through the entire movie, making the ending more of a relief than a climax. Should have been called The Emperor's New Tutu.",
      "review_date": "2011-02-02"
    },
    {
      "review_title": null,
      "content": "Darren Aranofsky",
      "review_date": "2010-12-05"
    },
    {
      "review_title": null,
      "content": "Lame and boring. How can I use 150 characters to say this movie was lame and boring? Until the last 20 minutes, I was really wanting to just leave before I fell asleep. And I really went in expecting to be impressed. Maybe it's aimed at theLame and boring. How can I use 150 characters to say this movie was lame and boring? Until the last 20 minutes, I was really wanting to just leave before I fell asleep. And I really went in expecting to be impressed. Maybe it's aimed at the artsy, NYC theater crowds. But here in Texas it just falls flat. And this was from the general consensus of the people we talked when leaving the theater.  Lame and Boring. Unless you live in NYC and have a thing for Ballet, skip this one",
      "review_date": "2011-01-02"
    },
    {
      "review_title": null,
      "content": "Ridiculous pap geared to 13 yr olds.  The whole deal was idiotic, all geared to how they could get the next gruesome special effect or soft-porn scene into the flick.\r Give Nat Portman credit, she never seemed to act like she knew she wasRidiculous pap geared to 13 yr olds.  The whole deal was idiotic, all geared to how they could get the next gruesome special effect or soft-porn scene into the flick.\r Give Nat Portman credit, she never seemed to act like she knew she was in a ridiculous movie, give her an academy nod for that.",
      "review_date": "2011-01-29"
    },
    {
      "review_title": null,
      "content": "I found this movie to be deceptively shallow--entertaining to watch but ultimately flimsy.  It is a psychological thriller and a conventional one at that, often dependent on predictable horror movie cliches.  It is generally well paced andI found this movie to be deceptively shallow--entertaining to watch but ultimately flimsy.  It is a psychological thriller and a conventional one at that, often dependent on predictable horror movie cliches.  It is generally well paced and effectively creates a mood of foreboding, but the payoff, when it comes, is not terribly interesting and is no surprise at all.  It confirms what you'd already anticipated and resolves whatever mild curiosity you might have had.  The acting is good.  Mila Kunis is terrific.  The relationship between Natalie Portman's character and her domineering, self-loathing mother is completely credible, and Portman is effective in playing an obsessive, egocentric, immature artist.    Unfortunately for her, that sort of emotional unintelligence does not make for an absorbing character--the interplay between reality and her own disturbed psyche is just not that interesting.Considering all the hype and critical acclaim, I'm tempted to give this movie a score in the basement, but it's not a _bad_ movie.  It's an entertaining way to spend an hour and a half, but nothing more than that.",
      "review_date": "2010-12-19"
    },
    {
      "review_title": null,
      "content": "I did not enjoy watching this movie and I would not see it again.  I had two serious issues with it: (1) the premise that an emotional lightweight could get the lead role of Swan Lake in one of the world's premiere ballet companies and (2)I did not enjoy watching this movie and I would not see it again.  I had two serious issues with it: (1) the premise that an emotional lightweight could get the lead role of Swan Lake in one of the world's premiere ballet companies and (2) the overuse of stock surprise elements -- over and over and over again to the point of distraction (and exhaustion).  The basic story line is good and interesting, and some performances were very, very strong (especially Mila Kunis').  That said, the overall execution was very disappointing.",
      "review_date": "2010-12-06"
    },
    {
      "review_title": null,
      "content": "get to work and stop dancing like a baby! dumb ****get to work and stop dancing like a baby! dumb ****get to work and stop dancing like a baby! dumb ****",
      "review_date": "2011-02-26"
    },
    {
      "review_title": null,
      "content": "Perfection--a major theme of the film and ultimately what it achieves. Portman is stunning. Aronofsky's direction is masterful. The cinematography and sound are interesting and integral to the story. This is simply a masterpiece in thePerfection--a major theme of the film and ultimately what it achieves. Portman is stunning. Aronofsky's direction is masterful. The cinematography and sound are interesting and integral to the story. This is simply a masterpiece in the psychological horror oeuvre.",
      "review_date": "2010-12-26"
    },
    {
      "review_title": null,
      "content": "Kenneth Turan of the LA Times is absolutely clueless. This film was brilliant. The fact that you are unable to distinguish reality from psychosis is what is so compelling about the piece. Natalie Portman deserves an Oscar for her amazing performance.",
      "review_date": "2010-12-22"
    },
    {
      "review_title": null,
      "content": "Thrilling, chilling, and mesmerizing is how I would describe this movie.  I was fully into the movie then entire time, even though I don't know too much about ballet.  Portman gives an incredible performance and the climatic finale had me onThrilling, chilling, and mesmerizing is how I would describe this movie.  I was fully into the movie then entire time, even though I don't know too much about ballet.  Portman gives an incredible performance and the climatic finale had me on the edge of my seat.  At some times the movie was confusing but that is why it works.",
      "review_date": "2010-12-23"
    },
    {
      "review_title": null,
      "content": "Black Swan is an imperfect film.  But it is thought provoking and interesting.  I am not a fan of ballet; in person it bores me to tears.  But I do respect the athleticism and talent involved in the process.  The ballet in this movie isBlack Swan is an imperfect film.  But it is thought provoking and interesting.  I am not a fan of ballet; in person it bores me to tears.  But I do respect the athleticism and talent involved in the process.  The ballet in this movie is merely the context of the story, not the point.  This is also not about a rivalry between two ballerinas, which was written by another user.  That may be implied by the trailer but it is not what's going on; I bet that person did not see the movie.  This is about a woman who is losing her mind, imagining lots of things including a rivalry that is more about her limitations and flaws than anything else.  My only complaint about the movie is either about how Natalie Portman played Nina or how Nina was written or how Arronofsky wanted Nina  to come across.  I'm not quite sure which one.  The problem is that Nina is so sheltered and so scared and so naive and so timid and so repressed that her character doesn't ultimately make sense.  The time and effort that go into such a career are monumental, as is the amount of rejection and judgement to which these people are subject.  It simply is not realistic on any level that Nina could have gotten as far as she did in the world of ballet  while being on such a weak psychological precipice.  It makes the story easier to believe, Portman looks on the verge of tears many times in this movie.  But anyone who had gotten that far in such a difficult profession quite frankly would have more mettle.  But that person wouldn't psychologically crumble as easy as Nina.  Still it is interesting.  Is Nina's mom living vicariously through her daughter (because she had to give up her career) or is the mom so over-protective that she has kept her daughter in a state of perpetual childhood.  I suspect a little of both.  Is Lily a potential ally or is she the rival Nina perceives her to be?  Did Lily help Nina by giving her ecstasy or did that hasten Nina's downfall?  I had hoped that it would have been less clear what was real vs. imagined.  It sure seemed pretty obvious.",
      "review_date": "2010-12-05"
    },
    {
      "review_title": null,
      "content": "Creepy and disturbing at parts. Every person in this movie is severely screwed up in the head. Only good thing was the making out between Mila and Natalie.",
      "review_date": "2011-03-11"
    },
    {
      "review_title": null,
      "content": "The performances were strong, but the story just was not credible. It relied too much on the idea that to be a great artist, one must be at least a little bit mad. Although many artists have fought madness, it's hardly a requirement.The performances were strong, but the story just was not credible. It relied too much on the idea that to be a great artist, one must be at least a little bit mad. Although many artists have fought madness, it's hardly a requirement. Furthermore, much of Nina's madness was hard to accept. Finally, I didn't find any of the characters likable.",
      "review_date": "2010-12-19"
    },
    {
      "review_title": null,
      "content": "If I would have seen just one more scene of her picking at her bloody fingers or back I think I would have walked out.  I am a fan of Natalie Portman so I went to see this movie with a friend.  We both had the same reaction - \"What is the bigIf I would have seen just one more scene of her picking at her bloody fingers or back I think I would have walked out.  I am a fan of Natalie Portman so I went to see this movie with a friend.  We both had the same reaction - \"What is the big deal about this movie\"?  The film goes back and forth between reality and her dual personality which is a bit confusing.  The lead is supposed to be perfection at playing the \"white swan\", but Natalie Portman looks like she's about to cry even when she dances as the white swan.  Lots of mommie dearest scenes, drugs, masturbation, and festering bloody sores.  Not what I would call entertaining.  In the end, a very polarizing film.  You either like this style or not.  I didn't.  I have to give it credit for some great visual style, however.",
      "review_date": "2011-01-18"
    },
    {
      "review_title": null,
      "content": "Black Swan is very good!. The movie is perfectly paced, great art direction and Mila Kunis is very underrated in this prestige film. I am not a big fan of Darron Aronoksy but this is a rare feat. I don't like ballet but it was interesting toBlack Swan is very good!. The movie is perfectly paced, great art direction and Mila Kunis is very underrated in this prestige film. I am not a big fan of Darron Aronoksy but this is a rare feat. I don't like ballet but it was interesting to have a better understanding of the art.",
      "review_date": "2010-12-20"
    },
    {
      "review_title": null,
      "content": "Mind-blowing and a horrific epic movie, '' Black Swan '' is one of the best dramas I ever saw. Natalie Portman plays, remarkably amazing, Nina Sayers, a ballet dancer who struggles with her role as the ''Swan Queen'', which she must both beMind-blowing and a horrific epic movie, '' Black Swan '' is one of the best dramas I ever saw. Natalie Portman plays, remarkably amazing, Nina Sayers, a ballet dancer who struggles with her role as the ''Swan Queen'', which she must both be the White Swan (the good side) and the famous Black Swan (the evil side, witch she loses control). Very artistic and interesting movie. The chemistry between the actors was brilliant ! You can really feel the emotion going on. It was very unique and even if you're not into ballet, you will still enjoy this thriller. But the ending disturb me a little bit. Everything was perfect until the last tiny ten seconds. It's still a amazing film. Definitely worth to watch",
      "review_date": "2011-01-02"
    },
    {
      "review_title": null,
      "content": "Stupendous film, which could have at its core the would-be, the almost, the near-but-not quite great, the  jock who is on the brink of stardom but can't cope with the pressure, the constant stress and anxiety, the bodily abuse.  Except it'sStupendous film, which could have at its core the would-be, the almost, the near-but-not quite great, the  jock who is on the brink of stardom but can't cope with the pressure, the constant stress and anxiety, the bodily abuse.  Except it's the mirror image, the almost great ballerina who is coping poorly (at best) with the stress/fatigue/injuries/obsessions/dedication/rejection/guilt trips, ya-da.  Definitely not for those who like fluff, Mr. Happy-Face, P or PG rating, or perhaps R ratings based on swearing or violence.  A true \"art house\", \"artsy - f--tsy\", \"thinkin' \" movie.  The remarkable finish leaves the audience stunned, astonished, agog.",
      "review_date": "2010-12-18"
    },
    {
      "review_title": null,
      "content": "As any movie, Black Swan has it's little defects. Even though i am willing to call it - Masterpiece. Natalie Portman's performance is breathtaking. We see Nina as a skilled ballet dancer obsessed of the desire of being perfect. She has theAs any movie, Black Swan has it's little defects. Even though i am willing to call it - Masterpiece. Natalie Portman's performance is breathtaking. We see Nina as a skilled ballet dancer obsessed of the desire of being perfect. She has the greet opportunity of playing the lead role in Swan Lake, but to take it she has to become the very best. Finally it results that the only obstacle on her way is her own personality. That is one of those love or hate movies. As you watch it you stop thinking about the other stuff and once it is over you spend several seconds or even a minute staring at the screen, processing the information, while wondering what exactly you just saw. As the time passes by the image becomes clearer and at the end you succeed in realising it's message. For me that's the idea of a brilliant movie, the one that leaves a trace behind in your mind and soul.",
      "review_date": "2010-12-24"
    },
    {
      "review_title": null,
      "content": "This movie is ally hype. It's nothing more than a compilation of lesbian sex scenes, blood and emotion. If this is what the world calls a good movie I seriously wonder what the hell is in the water these days! Americans need to wake up andThis movie is ally hype. It's nothing more than a compilation of lesbian sex scenes, blood and emotion. If this is what the world calls a good movie I seriously wonder what the hell is in the water these days! Americans need to wake up and see what is essentially softcore porn.",
      "review_date": "2011-01-10"
    },
    {
      "review_title": null,
      "content": "Really one of the worst movies of 2010. Pointless and dull, movie felt like a soft porno. This movie will only get little virgins excited about the sex scenes. This is not art.",
      "review_date": "2011-01-23"
    },
    {
      "review_title": null,
      "content": "I like lesbians so when that lesbian scene came up, I was all like \"Awh sweet, I like this.\" So if you want to catch some hot lesbian action, watch this movie. They lez out.",
      "review_date": "2011-02-13"
    },
    {
      "review_title": null,
      "content": "Aronofsky is brilliant as a director and Natalie Portman as an actress. But \"Black Swan\"doesnt have the psychological impact of \"Requiem for a Dream\" or the connection viewer-protagonist of \"The Wrestler.\" The scares are predictable andAronofsky is brilliant as a director and Natalie Portman as an actress. But \"Black Swan\"doesnt have the psychological impact of \"Requiem for a Dream\" or the connection viewer-protagonist of \"The Wrestler.\" The scares are predictable and somewhat ruin the atmosphere that Aronofsky tries to create. The music and cinematography are fantastic.",
      "review_date": "2011-02-17"
    },
    {
      "review_title": null,
      "content": "\"Black Swan is a disturbing , shocking , moving sadistic tale , that is captivating , compulsive and a work of art just shy of a masterpiece and will be no surprise when Natalie Portmen wins the Oscar for Best Actress\" ... A-",
      "review_date": "2011-02-14"
    },
    {
      "review_title": null,
      "content": "It was beautiful that's for sure. But honestly, do they think their audience is stupid? The ending ruined the entire movie! Portman was fine, but the real praise should be going to Mila Kunis & Vincent Cassel who steal the show each andIt was beautiful that's for sure. But honestly, do they think their audience is stupid? The ending ruined the entire movie! Portman was fine, but the real praise should be going to Mila Kunis & Vincent Cassel who steal the show each and everytime they are on screen.",
      "review_date": "2011-01-30"
    },
    {
      "review_title": null,
      "content": "Man what a film. Forget whether you do or don't like ballet, this is a surreal and intense thriller/horror almost in the vain of some of Stephen kings old stuff. Brilliant, disturbing imagery in parts, a great pace, always entertaining andMan what a film. Forget whether you do or don't like ballet, this is a surreal and intense thriller/horror almost in the vain of some of Stephen kings old stuff. Brilliant, disturbing imagery in parts, a great pace, always entertaining and suspenseful. Drags you deeper and deeper into madness and totally delivers at the end. A masterpiece really.",
      "review_date": "2012-12-09"
    },
    {
      "review_title": null,
      "content": "I understand what this film tried to do and what direction it took and why. But i couldn't help but feel so bored throughout all this film.It's a love hate thing. Natalie Portman takes up so much of this film, if you don't like herI understand what this film tried to do and what direction it took and why. But i couldn't help but feel so bored throughout all this film.It's a love hate thing. Natalie Portman takes up so much of this film, if you don't like her character you won't like this film. Which i didn't.",
      "review_date": "2011-03-30"
    },
    {
      "review_title": null,
      "content": "Outstanding Acting, Directing, and story.  One of the best thriller movie i seen. Outstanding performance by Natalie Portman and Mila Kunis. On of the year best films. This movie is going catch your attention from beginning to end. I enjoyOutstanding Acting, Directing, and story.  One of the best thriller movie i seen. Outstanding performance by Natalie Portman and Mila Kunis. On of the year best films. This movie is going catch your attention from beginning to end. I enjoy this movie a lot. Natalie Portman gave such a good performance in this movie. I love thriller movies like this. I think this is a movie ever body would enjoy. Very crazy and amazing movie.",
      "review_date": "2010-12-22"
    },
    {
      "review_title": null,
      "content": "It is one film of the year where I walk out of the theater and went, Hmm, nice! Well, that doesn't mean it's better than some other films I saw this year, but this is an impressive. Black Swan offers plenty of drama, plenty of thrillingIt is one film of the year where I walk out of the theater and went, Hmm, nice! Well, that doesn't mean it's better than some other films I saw this year, but this is an impressive. Black Swan offers plenty of drama, plenty of thrilling moments, and plenty of sexiness. With a thrilling and perplexed performance by Natalie Portman, and stylish directing from Darren Aronofsky, Black Swan can go far. The story is more complicated than you think it is. It is not just about a ballet dancer, it is about a ballet dancer with deep mental issues. Nina is professional ballet dancer who got promoted to play the key role in a ballet performance, the Swan Queen. With a lot of pressure on her, the story proposes that she is obviously hallucinating about her body being deform. At first, I thought all of this was real because Natalie Portman is so believable. But as the story developed, I know for a fact that this girl has some serious mental issues. A summary about the film really doesn't do it justice, go watch it and you'll see exactly what I'm talking about. Black Swan demonstrates how ballet is as exciting and thrilling as an action movie with Arnold Schwarzenegger in it. Natalie Portman might even win the Best Actress Oscar, that is if she beat Annette Bening (but she already locked herself an Oscar nod). Darren Aronofsky will probably snatch the Best Director nod, but Black Swan will definitely have a chance at the Best Picture run.",
      "review_date": "2010-12-11"
    },
    {
      "review_title": null,
      "content": "If you were a fan of The Wrestler you'll love this. If Requiem For A Dream flipped your stomach over, get ready for Black Swan. This movie was absolutely incredible. The story isn't unknown to the common movie-gower, but it doesn't haveIf you were a fan of The Wrestler you'll love this. If Requiem For A Dream flipped your stomach over, get ready for Black Swan. This movie was absolutely incredible. The story isn't unknown to the common movie-gower, but it doesn't have flashing signs and big arrows that yell \"SYMBOLISM\" or \"METAPHORE\". The surrealism mixed with the psychological torment of competition gave this film a VERY realistic feel for any person once involved with competitive theatre or dancing. All the actors were terrific and Mila Kunis was not shadowed by Natalie Portman, she stood her ground as her black swan and was a terrific supporting actress. Do what you can to see this movie. Do it.",
      "review_date": "2010-12-14"
    },
    {
      "review_title": null,
      "content": "Natalie Portman does for Black Swan what Mickey Rourke did for The Wrestler.  Both players pushed themselves physically and emotionally to lend gravitas to an art form that isn't widely respected or understood.  She brings such life to herNatalie Portman does for Black Swan what Mickey Rourke did for The Wrestler.  Both players pushed themselves physically and emotionally to lend gravitas to an art form that isn't widely respected or understood.  She brings such life to her roll.  She embodies anxiety, fear, excitement, frustration, and sexual confusion.  Every other character in the film represents some external source of emotion.  None of the supporting players gets three dimensions.  Each fills a role: \"the mother,\" \"the director,\" \"the rival,\" \"the former star.\"  To that end, each of those characters inspires a different sort of anxiety, curiosity, dread, or fury in the central character, and Natalie Portman brilliantly evokes the oftentimes subtle distinctions between those emotional responses.  It's fascinating to watch.",
      "review_date": "2010-12-19"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAronofsky's dizzying and dazzling new film grabs the audience and take them on a ride through the intense trials and pressures on a increasingly unstable ballerina played masterfully by Natalie Portman. Aronofsky's engaging camerawork places you directly in the action and dares you to join him on his feverish trip through Nina Sayers' mind. Although Aronofsky's film may not be  \"perfect\" like Nina's final, suicidal performance, it comes close.",
      "review_date": "2010-12-26"
    },
    {
      "review_title": null,
      "content": "He pulled it together by introducing Kunis' character and a solid ending, but the opening half hour is atrocious. overall, it's a bit overwrought for my taste, but i did appreciate the campy humor and quality acting.",
      "review_date": "2010-12-31"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nMaking a deep art experience a horror film is a big, big flaw. Making a horror film a deep art experience, a big sin as well. Aronofsky has usually a deep insight and great, great imagery, but like in Requiem for a Dream the one-dimensional plot is a problem and it can be summarized in \"drugs are bad\". On the Wrestler, that's a perfect example of a good main character. In here, instead of creating two faces of a same character (depth!), he keeps playing with one dimension in two characters. Where's the moment that the actress mixes the two swans and get in control of that? Besides the 'actress-killing-rival-before-premier' is quite worn out already. I was expecting a true transformation, a true character, and all that was shown is a girl that cannot stop whining and an alter-ego that is a plain murderer. Everything else was stunning, and brought high art to the masses: the songs, the grace of the swans, the art environment, and a specifically good scene where the teacher, tryint to seduce her, shows her (and us) the true meaning of ballet. I just think it needed characters with more depth to add verisimilitude to it.",
      "review_date": "2011-01-11"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nthe lead actress is very nice. She had a superb acting. the movie is good but it is not as exciting or thrilling as I expected it to be. Since from the beginning I already guessed that Nina has psychological disorder so its not thrilling for me anymore. however, it is still a bit confusing.",
      "review_date": "2011-01-14"
    },
    {
      "review_title": null,
      "content": "Darren Aronofsky's latest film, soon after his fantastic movie, \"The Wrestler\", is a thrilling joy ride that keeps a swift and dramatic touch throughout the film. \"Black Swan\" tackles a much different subject than the \"The Wrestler\", dealingDarren Aronofsky's latest film, soon after his fantastic movie, \"The Wrestler\", is a thrilling joy ride that keeps a swift and dramatic touch throughout the film. \"Black Swan\" tackles a much different subject than the \"The Wrestler\", dealing this time with ballet. Nina (Natalie Portman), a New York City ballet dancer, is trying to get into a ballet pagent, directed by her teacher (Vincent Cassel). Then, Lily comes along and competition beaks out. But, things start turning strange and Nina comes face to face with some of her darkest fears. The film is beautifully done with its art direction and costume design. Of course, a great thriller, with an unexpected twist, \"Black Swan\" is definitley a film worth checking out. 8/10 [R]",
      "review_date": "2011-01-16"
    },
    {
      "review_title": null,
      "content": "Visually stunning, artistic, brilliant performances from everyone involved, Natalie Portman was spectacular. It Was Creepy and strange and like nothing I've seen in a long time, Almost perfect 9/10",
      "review_date": "2011-01-24"
    },
    {
      "review_title": null,
      "content": "Does Aronofsky do his best to cheaply thwart all of the viewers attempts at rationalizing an implausible film in an attempt to make an otherwise boring storyline interesting? Yes he does. Does his succeed? Debatable. But does Aronofsky createDoes Aronofsky do his best to cheaply thwart all of the viewers attempts at rationalizing an implausible film in an attempt to make an otherwise boring storyline interesting? Yes he does. Does his succeed? Debatable. But does Aronofsky create one of the greatest psychological thrillers of all time out of a story about a stressed ballet dancer? Without question.",
      "review_date": "2011-03-02"
    },
    {
      "review_title": null,
      "content": "Utter self indulgent crap... I wish Aronofsky would switch it up a bit. Same old drivel. If you really insist on watching someone unhinging, watch Roman Polanski's Repulsion. Oh Darren why don't you go out and have some fun the world isn'tUtter self indulgent crap... I wish Aronofsky would switch it up a bit. Same old drivel. If you really insist on watching someone unhinging, watch Roman Polanski's Repulsion. Oh Darren why don't you go out and have some fun the world isn't gloomy 24/7 as it is in yours. But whatever you do don't try comedy I couldn't stand waiting 5 minitues for each punchline.",
      "review_date": "2011-04-17"
    },
    {
      "review_title": null,
      "content": "Great movie in a bad year for movies. I think 2010 was just a very bad year for movies and that just helped to make this movie look better than it was. I'm not saying it was a bad movie, I'm just saying that this year in movies is making itGreat movie in a bad year for movies. I think 2010 was just a very bad year for movies and that just helped to make this movie look better than it was. I'm not saying it was a bad movie, I'm just saying that this year in movies is making it look better then it really is.",
      "review_date": "2011-03-30"
    },
    {
      "review_title": null,
      "content": "The movie is disturbing all the way to its closing scene, haunting the viewer with its brilliant cinematography and beautifully choreographed and shot dance scenes. The movie is intoxicating, fast-paced, and keeps you on the edge of yourThe movie is disturbing all the way to its closing scene, haunting the viewer with its brilliant cinematography and beautifully choreographed and shot dance scenes. The movie is intoxicating, fast-paced, and keeps you on the edge of your seat. The acting is all very good, and Natalie Portman certainly deserves recognition for her fantastic work. A fantastic film.",
      "review_date": "2011-04-20"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI really disliked this movie. I really don't understand how people can give this a good rating. Maybe it's just the men who are voting. Men who like to see Natalie and Mila gettin' it on. Black Swan was probably the scariest movie that I have seen in theaters. I warn all- do not see this movie with your parents or relatives. I was just begging for the movie to end. It was too intense for me, and for what? So the audience could see someone hallucinate and fall to their death? Not my kind of story. I'm not saying that every story must have a magical, happy ending. I'm not saying that by any means. But Black Swan had no substance or purpose. All I could see what a crazy girl getting molested every five minutes. I don't mean to ramble, but no one see this movie. Save your sanity.",
      "review_date": "2011-04-22"
    },
    {
      "review_title": null,
      "content": "Well, y'know... It was a brilliant idea to pursue it with Natalie Portman in mind you know. She was just amazing and her depth! Oh how she scared the sh*t outta me? Dear Lord, your movie is the horror film of the year because of PortmanWell, y'know... It was a brilliant idea to pursue it with Natalie Portman in mind you know. She was just amazing and her depth! Oh how she scared the sh*t outta me? Dear Lord, your movie is the horror film of the year because of Portman and... Barbara Hershey! Scariest lady since Sylvia Ganush! Damn, I also commend Vincent Cassel and Mila Kunis! But oh, I couldn't put into words how much I admire this. Forget the Step Up 3D sh*t, this is the best dance movie of 2010!",
      "review_date": "2011-05-23"
    },
    {
      "review_title": null,
      "content": "I am deeply confused by Black Swan. On one hand it is an astonishing mix of twists and turns, displaying the very essence of madness and obsession. But it has quite a flaw. When I watch a film I feel for the characters. Whether its because II am deeply confused by Black Swan. On one hand it is an astonishing mix of twists and turns, displaying the very essence of madness and obsession. But it has quite a flaw. When I watch a film I feel for the characters. Whether its because I hate them or love them, I become attached and care about what happens to them. In Black Swan, I never really cared what happened to the characters. The director has created abominations. Extremely talented acting, but each portrayed in such a way as you cannot become attached to them. In it's main box office rival, the Kings Speech, I was infatuated by all the characters. For good or ill, i wanted to see what happened. In Black Swan, I was left un-moved.",
      "review_date": "2011-05-31"
    },
    {
      "review_title": null,
      "content": "Breath taking. That's the words I use to describe this movie. Simply brilliant. Darren is seriously one of the best living directors of our time. I fail to see how so many people are oblivious to this fact and would rather watch a Michael BayBreath taking. That's the words I use to describe this movie. Simply brilliant. Darren is seriously one of the best living directors of our time. I fail to see how so many people are oblivious to this fact and would rather watch a Michael Bay movie. Whatever, this movie's packed with symbolism, psychology and a great look into the character Nina's world[view].",
      "review_date": "2011-06-23"
    },
    {
      "review_title": null,
      "content": "After seeing this movie (And really looking forward to it) to say I was disappointed would be an understatement. I really don't understand what all the fuss was about. I can say that I am happy I didn't spend money watching it at the cinemas,After seeing this movie (And really looking forward to it) to say I was disappointed would be an understatement. I really don't understand what all the fuss was about. I can say that I am happy I didn't spend money watching it at the cinemas, and only ended up wasting a few bucks on this load of disjointed tripeat the video store. I could also understand why fellow nominees at the oscars could feel ripped off that Portman scored an oscar for this, in what can only be described as an over-acted, predictable performance.  A sad hollywood attempt at what would have been much better left to an arthouse cinema. Bad plot, bad acting, deplorable ending, can't believe I stuck with it. Don't waste your hard earned on this one folks!",
      "review_date": "2011-06-20"
    },
    {
      "review_title": null,
      "content": "I disliked the main character, it isn't inspirational, it doesn't teach you anything, it isn't funny, most of the characters are empty, and it is a sexist movie, what a waste, it deserves a 0 out of 10.",
      "review_date": "2013-01-08"
    },
    {
      "review_title": null,
      "content": "This movie is a horror flick and is not worth the money to see it.  The story and script are terrible.  Perhaps the acting is good, but it is wasted on this terrible horrific film.  Save your time and money and skip this one.",
      "review_date": "2010-12-12"
    }
  ],
  "num_reviews": 142
}