{
  "title": "Despicable Me",
  "rating": 7.6,
  "release_date": "2010-07-09",
  "summary": "Gru delights in all things wicked. Armed with his arsenal of shrink rays, freeze rays, and battle-ready vehicles for land and air, he vanquishes all who stand in his way. Until the day he encounters the immense will of three little orphaned girls who look at him and see something that no one else has ever seen: a potential Dad.  The world'sGru delights in all things wicked. Armed with his arsenal of shrink rays, freeze rays, and battle-ready vehicles for land and air, he vanquishes all who stand in his way. Until the day he encounters the immense will of three little orphaned girls who look at him and see something that no one else has ever seen: a potential Dad.  The world's greatest villain has just met his greatest challenge: three little girls named Margo, Edith and Agnes. (Universal Pictures)… Expand",
  "critic_reviews": [
    "Like the best kids' entertainment, this creates a daffy little world all its own.",
    "The effect is Chaplinesque if Chaplin had the latest in gadgetry, because the entire picture is also shot in 3-D that, for once, puts all 3 of the Ds to imaginative use.",
    "To hell with that childlike sense-of-wonder crap: Despicable Me, instead of trying to return adults to a false state of innocence, reminds us that we all started out as ill-mannered little savages.",
    "Another 3-D animated kid movie demonstrates that cartoon storytelling pitched to young people is the last, best refuge of sprightly filmmaking this hard, hot summer.",
    "A rousingly funny, heartfelt and imaginative 'toon blessed with the vocal talents of Steve Carell and loaded with whimsy and smarts.",
    "Coffin and Renaud's execution is fresh, sincere, often lovely and a great deal of fun -- and in this kind of movie, and this kind of movie summer, execution is everything.",
    "This is a self-contained story that stands nicely on its own. How novel.",
    "Despicable doesn't measure up to Pixar at its best. Nonetheless, it's funny, clever and warmly animated with memorable characters.",
    "There's nothing like a little world domination to melt the most dastardly evildoer's heart. Since villains so often steal the show in animation, Despicable Me smartly turns the whole operation over to megalomaniacal rogue Gru.",
    "It's all thoroughly adorable, and with an overlay that's nearly as odd as Carell's accent.",
    "This is dizzy diverting fun, from it's first Carell one-liner to the 3D gimmick gags stuffed into the closing credits.",
    "Directors Pierre Coffin and Chris Renaud craft a fun stretch run, wrapping the story with warm, fuzzy funnies and nothing to suggest a sequel, which is probably wise.",
    "The film is funny, energetic, teeth-gnashingly venomous and animated with an eye to exploiting the 3-D process with such sure-fire techniques as a visit to an amusement park.\r\nThe sad thing, I am forced to report, is that the 3-D process produces a picture more dim than it should be.",
    "Carell's genius for loading a comic line with mirth and malice is on joyous display.",
    "Until the \"creep + orphans = happy family\" formula starts demanding abrupt, unconvincing character mutations, Despicable Me is a giddy joy.",
    "Despicable Me has enough visual novelty and high spirits to keep the kiddies diverted and just enough wit to placate the parents.",
    "This fun-filled adventure avoids formula with a whimsical story and terrific voice casting.",
    "Hang in there and Despicable Me turns into an improbably heartwarming, not to mention visually delightful, diversion.",
    "It's not exactly aiming for the moon, but in a marketplace where surpassed expectations are as rare as unicorns, Despicable Me is delightful.",
    "Perhaps best of all, this is a rare instance in which the 3-D, while not an asset, is at least not a detriment.",
    "Though Despicable Me is a little ragged on story, it's got a lot of imagination and a heart as warm as a fluffy kitty.",
    "Carrell has stated in interviews that his accent \"falls someplace between Bela Lugosi and Ricardo Montalban,\" and that's about right.",
    "So, yes, kiddies--it's funny. Silly. Slight. Though, grown-ups, be warned: I had more fun watching the kid giggle through the screening than I did watching the movie itself. It's no \"Toy Story 3.\"",
    "Settles for simply being goofy good fun.",
    "Everyone knows that the villains are usually the most interesting characters in any movie. So the makers of Despicable Me were wise to cut to the chase and make the megalomaniacal Gru (voiced by Carell) the central character in this animated film.",
    "Is the movie itself good? Half-good, I'd say - the second, more openly sentimental half.",
    "Short, sweet-and-sour, and amusing rather than funny, Despicable Me can't help but be likable.",
    "The setup is pure Looney Tunes, and indeed, Despicable Me is at its best when trading in the anything-for-a-laugh prankery that was a specialty of the Termite Terrace crowd.",
    "It looks so stylish that thinking about its plot is strictly optional.",
    "Granted, it's a far cry from the Pixar classics. But Pierre Coffin and Chris Renaud's nicely quirky, animated comedy has just enough edge to entertain every member of the family.",
    "It's no first-rank CGI cartoon, but shows how Pixar's quality over crass is inspiring the mid-list. Fun, with teary bits, for kids; fresh and smart for adults.",
    "There's no reason to actively dislike the film, but that's not enough, not at today's ticket prices.  Just because you're not despicable, after all, doesn't mean you're the pick of the litter.",
    "The film throws so much ersatz cleverness and overdone emotion at the audience that we end up more worn out than entertained.",
    "When compared with the ambition and achievement of recent animated films, such as \"Coraline\" and \"Toy Story 3,\" Despicable Me hardly seems to have been worth making, and it's barely worth watching.",
    "Despicable Me cannot be faulted for lack of trying. If anything, it tries much too hard, stuffing great gobs of second-rate action, secondhand humor and warmed-over sentiment into every nook and cranny of its relentlessly busy 3-D frames."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "My son (age 7) and I went to see this today with my father - so three generations all watching a \"kid's movie\". We ALL enjoyed the movie and had a great time.",
      "review_date": "2010-07-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable Me deals in the absurd and comes out winning on every level. Why is it that the villains of a film also make for more memorable and worthwhile characters? This is pretty much what the film surrounds itself with, all these villainsDespicable Me deals in the absurd and comes out winning on every level. Why is it that the villains of a film also make for more memorable and worthwhile characters? This is pretty much what the film surrounds itself with, all these villains attempting to outdo each other by becoming the greatest villain ever known.\rSteve Carell voices Gru, an evil mastermind who isn't feeling quite as evil these days, someone has stolen the Great Pyramid, and is now considered the greatest villain in the world, much to the dismay of Gru.\rThe thief in question is Vector (Jason Segel) who seems like an accidental villain, simple minded and naive. but with the typical evil lair that is just too funny to ignore, sharks, missiles and hidden rooms, the film is rich with cliche but knows that it is, making it that much more enjoyable.\rGru aims to better the pyramid raid by stealing the moon, thats right, the moon. With the help of his trusted mad scientist Dr. Nefario (Russell Brand) and his hilarious minions called the, er.. Minions, he hatches a plan to finally be called the best.\rBut when he must infiltrate Vectors lair to retrieve a sonic ray that reduces the size of any object, he is upstaged by all the gadgets on show, so he adopts three orphan girls so as he can get them to deliver robot cookies to the house so as he can move forward with his plan. But who knew he was going to pick the most loveable and funniest of the bunch.\rAgnes is the smallest of the trio, and by far the funniest, she sees and believes things that the others don't, and truly sees a father figure in Gru.\rIt's difficult for a fresh comedy to come in and leave a lasting impression without falling into the same routine of previous attempts, but the film manages to take a very popular and gestated idea and basically poke fun at its own absurdity, and that is where the true laughter lies in this film, the fast-paced animation we are used to seeing in a Pixar film are present here, mixed with a perfect variation of characters and a brilliant voice cast that also includes Julie Andrews and Will Arnett.\rA truly funny and original film has been created with Despicable Me, it has the absurdity and laughter of a one-liner comedy but the heart and assurance of a Pixar classic, without being a Pixar film.",
      "review_date": "2013-05-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pretty good animated family movie that is somewhat like The Incredibles. The villain was awesome and just the use of weaponry was cool. The part where Gru's boss squeezed the apple was hella creepy.",
      "review_date": "2015-06-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "See, if I did not know which company produced this movie, I would have thought it was Pixar. This fun movie is sweet and touching at times, and filled with hilarious surprises throughout.",
      "review_date": "2014-03-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the worst opening theme musics I've ever heard, so that didn't set a good first impression with me. Comedy is too juvenile for my liking. Kids would no doubt love it, but there still needs to be more for the more mature for it toOne of the worst opening theme musics I've ever heard, so that didn't set a good first impression with me. Comedy is too juvenile for my liking. Kids would no doubt love it, but there still needs to be more for the more mature for it to better rounded. Story isn't great and seems to be handled a little sloppily, voice acting is meh and I didn't feel much for the emotive content. Nothing new for me really.",
      "review_date": "2014-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its crazy that this movie is 10 years old. For better and for worse, it definitely reshaped the face of animated film all through the 2010s. This movie's animation hasn't aged super well, but it is well written, charming, entertaining, and itIts crazy that this movie is 10 years old. For better and for worse, it definitely reshaped the face of animated film all through the 2010s. This movie's animation hasn't aged super well, but it is well written, charming, entertaining, and it knows when to not be annoying. Its a great family film, and I think it's earned its place in children's movie history.",
      "review_date": "2020-02-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A pretty good effort for the first film from Illumination Entertainment. Despicable Me is a great animated film. Sure it's not my favorite movie, but it's the best in the series. The story is good, the animation looks great, the charactersA pretty good effort for the first film from Illumination Entertainment. Despicable Me is a great animated film. Sure it's not my favorite movie, but it's the best in the series. The story is good, the animation looks great, the characters are lovable, and the humor is actually funny. Before the Minions overstayed their welcome, they were funny with some of the greatest moments in this film. Even though its not my favorite, Despicable Me is a great first effort.",
      "review_date": "2019-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable Me has dazzling animation, lots of laughs, originality, cute little characters (the minions), and just a heartwarming story , backed by solid voice acting make for an ideal family film. I give this movie 89%.",
      "review_date": "2012-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable Me is one the animated film that I enjoyed the most; starting by the plot: two bad guys that are constantly fighting to demonstrate who is the most evil. The interesting thing is that these two villains are very real, they bothDespicable Me is one the animated film that I enjoyed the most; starting by the plot: two bad guys that are constantly fighting to demonstrate who is the most evil. The interesting thing is that these two villains are very real, they both have conflicts with themselves and with the people that surround them, and both are trying to have a better life. Here lies the charm of the movie, the amazingly well develop characters, and with this I not only refer to the protagonist and antagonist, I also refer to the girls, the old scientist and the minions; all this bunch of captivating characters during the film, manage to break their stereotype. This release of the characters is the most remarkable concepts of this picture, because nowadays the protagonists are typecast and their development is linear or zero. This achievement should be awarded, the director and writers of Despicable Me have come back to the classics. This is what the animation filmmakers must learn, the pillar of cartoon production is a character that breaks his stereotype and evolve to an original form.",
      "review_date": "2012-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The puerile movie takes its chances on the comedy and humor rather than the story and characters. As a result \"Despicable Me\" may sometimes be overly reactive to such preposterous comedies they create, but at least succeeds in making a markThe puerile movie takes its chances on the comedy and humor rather than the story and characters. As a result \"Despicable Me\" may sometimes be overly reactive to such preposterous comedies they create, but at least succeeds in making a mark in the innocent hearts of the young ones with its mellifluous tone.",
      "review_date": "2011-10-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really enjoyed it. It's not on Pixar level (obviously), but it was pretty funny and really sweet.",
      "review_date": "2010-07-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable Me has some genuine humour and the animators look like they had fun making it. The characters and movie moments are fun and will have kids and some adults giggling throughout. The story does lack some weight as it ends up being aDespicable Me has some genuine humour and the animators look like they had fun making it. The characters and movie moments are fun and will have kids and some adults giggling throughout. The story does lack some weight as it ends up being a standard predicable story - something we have seen too many times before and may leave some adults wanting more, but what we have here is fun nonetheless. Recommended for kids.â",
      "review_date": "2011-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie's formula might be \"cute and fluffy\" but plot and jokes are nothing worth remembering and Steve Carrell has never been less funny. The little girls and minions give a few good laughs, though.",
      "review_date": "2010-08-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A good solid movie, and a good combination of kids humor and adult humor as well. Will def buy on Blu-ray for the kids when it comes out.",
      "review_date": "2010-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Oscar worthy for best animated film but will lose to Toy Story 3. One of the best movie this far and so far it has been Toy Story 3 and Cyrus.",
      "review_date": "2010-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A funny, family-orientated film that really goes into depth about adoption and, thatâ",
      "review_date": "2010-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A surprisingly good non-Pixar animated film. No crude jokes, many levels working at the same time, and heart also in a real way not in a Shrek calculated way. It earns its emotions. The film owes a lot to Bond and The Incredibles but it's funA surprisingly good non-Pixar animated film. No crude jokes, many levels working at the same time, and heart also in a real way not in a Shrek calculated way. It earns its emotions. The film owes a lot to Bond and The Incredibles but it's fun in its own right. A very pleasant surprise.",
      "review_date": "2010-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent animation and a series of funny moments make this a thoroughly entertaining film to watch for the whole family. The story verges on absurd but then again it is a fairytale where minions exist and the world's greatest villains have aExcellent animation and a series of funny moments make this a thoroughly entertaining film to watch for the whole family. The story verges on absurd but then again it is a fairytale where minions exist and the world's greatest villains have a soft spot for orphans.",
      "review_date": "2010-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Surprisingly enjoyed this, although the 3D at times seemed quite poor, the overall animation of the film was good and the story line was enjoyable. Heart-warming tale  for all ages. IT'S SO FLUFFY!",
      "review_date": "2010-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIt's been a long time since Universal stopped making 2D animated features except in 2006, they made Curious George that starred Will Ferrell and the rest of the cast. Four years later, they released their first CGI animated feature length film, Despicable Me. I've never saw it in theaters, but I've got the DVD of this movie and now I'm going to review it.\r It revolves around a super-villain named Gru, who plans to steal his arch-nemesis's shrink ray in an attempt to shrink/steal the moon. One day, he adopts three girls from an orphanage and made them do the job for him. Upon being distracted by them, he learns that being a father is more important than just being a super-villain, but little does he know that he himself is on a desperate battle between him and his arch-nemesis named Vector.\r I know what the story was about, but you have no idea how much this movie has impressed me. It has a terrific voice cast, great animation, cool action scenes, and entertaining comedy.\r The only problem that I had with the movie was the villain named Vector. He's wasn't given enough screen time to begin with, but that doesn't mean the characters have anything to do with it.\r Despicable Me lacks in any depth with the villain, but has solid acting and very good comedy. It is in no doubt one of the best animated movies ever made since the Disney era.\r 8/10",
      "review_date": "2011-06-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have to say this movie touched my heart as much as it did my laugh box. Steve Carrel is hilarious and if you didn't watch the credits you probably wouldn't know it was him. The story is very creative and original and (as always) was copiedI have to say this movie touched my heart as much as it did my laugh box. Steve Carrel is hilarious and if you didn't watch the credits you probably wouldn't know it was him. The story is very creative and original and (as always) was copied a year later with Megamind. I do have a hard time understanding some of those negative reviews though.",
      "review_date": "2011-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Light Bulb.\" It took a little time for the light bulb to turn on in \"Despicable Me\", but when it finally does it actually becomes a good film. The slow start almost ruined it for me but luckily the visuals were good enough to keep meLight Bulb.\" It took a little time for the light bulb to turn on in \"Despicable Me\", but when it finally does it actually becomes a good film. The slow start almost ruined it for me but luckily the visuals were good enough to keep me intrigued while the directors Pierre Coffin and Chris Renaud figured out where they were going with the movie. And I must say when they finally figured things out it completely turned the movie around for the better.Read full review at FlicksWorthWatching.com",
      "review_date": "2010-12-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "the movie was awesome..but it did tend to rush at some points",
      "review_date": "2011-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am 31 yrs old and for some reason I still like watching animated film. I absolutely loved those little minion things, they were hilarious! The only problem that I had with this movie was that Steve Carrell accent was a little weak, and atI am 31 yrs old and for some reason I still like watching animated film. I absolutely loved those little minion things, they were hilarious! The only problem that I had with this movie was that Steve Carrell accent was a little weak, and at time he just sounded like himself trying to do a Russian accent. Overall this was pretty funny movie. Acting: OK\rStoryline: Good\rCharacters: Good",
      "review_date": "2011-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great film, harmless family fun.I'll be honest it's nothing new but it's got it's charm and is worth watching, i'd rent rather than buy though :P",
      "review_date": "2011-05-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Borrowing heavily from Disney and Pixar animation, Despicable Me is charmingly written and thoroughly involving for children of all ages, with remarkable voice acting from Steve Carell.",
      "review_date": "2011-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pretty darn brilliant! I greatly enjoyed this film, with Carell dishing out superb voice talent. It struggles to get off the ground initially, but it takes off after 10 mins or so. This story is so funny and the supporting characters reallyPretty darn brilliant! I greatly enjoyed this film, with Carell dishing out superb voice talent. It struggles to get off the ground initially, but it takes off after 10 mins or so. This story is so funny and the supporting characters really light up the screen, in particular the three little girls along with the hilariously slapstick minions. Then, suddenly, the film's emotional fist slugs you right in the gut, full force, and this \"evil\" comedy quickly turns to an unconditional, parental-love story.",
      "review_date": "2011-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Summer 2010 was a time filled with sweet seasonal treats, especially amongst animated features. \"Toy Story 3\" hit theatres a month earlier than \"Despicable Me\", and was quickly deemed the best animated film of the summer, and quite possiblySummer 2010 was a time filled with sweet seasonal treats, especially amongst animated features. \"Toy Story 3\" hit theatres a month earlier than \"Despicable Me\", and was quickly deemed the best animated film of the summer, and quite possibly the year. I had undoubtedly agreed with the previously mentioned statement- until I visited my local movie theatre one afternoon in July to see \"Despicable Me\". The film, which features the voice talents of Steve Carell and Miranda Cosgrove (to name a few), was charming, moving and, possibly most importantly, hilarious for all audiences. I found myself laughing out loud on numerous occasions, as well as stifling back a tear or two at other times. The film is centered around a less-than-superb villain who, in order to complete a ruse to infiltrate his enemy's lair and steal the moon, adopts three orphaned and unmeasurably adorable sisters. With little experience in the paternal field and a strong background in being a misanthropic antagonist, comedy ensues as the girls completely rearrange his life. Looking for a feel-good film with heart, adventure and laughs? Look no further- you've found \"Despicable Me\".",
      "review_date": "2011-07-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great, humorous, movie..a film designed to get old and young to laugh..great, clean humor and an interesting storyline,plus memorable characters( including the Minions) make this a one-of-a kind move!!!",
      "review_date": "2011-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable Me is a sometimes predictable yet hilarious piece of cinema with stellar voice acting, a laugh-inducing script, and some of the best animation this side of PIxar.",
      "review_date": "2011-09-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a great family movie, and it could have nearly managed an 8. The animation is superb and the storyline was surprisingly good. The voices were played well, and the plot of it was good. There is a few messages that the movie mayThis movie is a great family movie, and it could have nearly managed an 8. The animation is superb and the storyline was surprisingly good. The voices were played well, and the plot of it was good. There is a few messages that the movie may give out to children, (good ones) though. It's funny, random but really good fun!",
      "review_date": "2011-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is absolutely brilliant. The animation is top-notch, the characters are lovable and memorable, and the jokes are bound to have both kids and parents on the floor laughing. It probably won't bring tears to your eyes likeThis movie is absolutely brilliant. The animation is top-notch, the characters are lovable and memorable, and the jokes are bound to have both kids and parents on the floor laughing. It probably won't bring tears to your eyes like Pixar/Disney movies do, but it's still very touching and heart-warming and it will definitely give you a warm, fuzzy feeling. 9/10.",
      "review_date": "2012-04-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best done animated movies I have seen. It is packed with lots of humor and quick wit. As with every movie, one must ignore critic reviews and experience it.",
      "review_date": "2010-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA turbaned man, a Muslim in Egypt, is nearly killed by a van carrying American tourists; ugly Americans, made so by the film's use of Lynyrd Skynard's \"Sweet Home Alabama\" blaring over the soundtrack, signifying impropriety. And sure enough, the tourists emerge from the van like they own the place, decked out in garish excursionist regalia, oblivious to their display of cultural insensitivity. Right away, \"Despicable Me\" establishes the American character as being hardly heroic, despicable even, conveyed through the southern family's non-concern for the Muslim pedestrian. When the young boy falls from the pyramid's scaffolding, he falls without any interference from a superhero, because there is no such thing as a superhero(read: Americans and Muslims alike are despicable). This satirical, and boldly subversive opening, demonstrates how the film views America as being the lesser of two evils in every global conflict. America is the more congenial villain. The boy falls; the boy bounces, off from the fake pyramid, perhaps, a metaphor for the fake war, initiated by the despicable against the relatively despicable. The world of \"Despicable Me\" is a dystopian one, and this opening scene establishes this dystopia, by going against the grain of how America sees itself, as heroes, because there's an expectation level on the moviegoer's part that some man from the sky will swoop down from the heavens and save the boy before he hits the ground. But alas, \"Despicable Me\" is not that movie. There's only villains, like Dru(Steve Carrell), an aging evil mastermind, engaged in a race to steal the moon with Vector(Seth Rogen), an upstart scoundrel who wants to just like Dru. This anti-NASA notion is a contest that could easily be construed as a parody of America's fight with the Soviet Union to conquer space during the Cold War. (\"Victor\", Vector's \"nerd name\", incidentally, is the NATO name for a class of nuclear-powered Soviet attack submarines.) When Dru deploys his shrink ray at the lunar sphere, he becomes an evil Neil Armstrong of sorts: the first man to walk all over the moon. He represents the America that other countries make us out to be, a tyrannical America. But Dru has a sentimental streak, a conflicted man who believes in family values, and saves the world, even though nobody asked him to save the world in the first place, as the cause of the dilemma was of his own making. Depending on who you are, Dru's actions, taken in its entirety, makes him either a hero, an anti-hero, or a villain.",
      "review_date": "2010-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sure, this movie was a little kiddy, but at about half the movie, there was, surprisingly, some funny stuff for my age. It could've been better if little kids would understand that Jason Segel, pretty much plays how he is in real life, lazy,Sure, this movie was a little kiddy, but at about half the movie, there was, surprisingly, some funny stuff for my age. It could've been better if little kids would understand that Jason Segel, pretty much plays how he is in real life, lazy, sort of that Steve Carrel- type character in Anchorman: The Legend of Rob Burgundy, but most of all, silly as Hell. The movie was also a little sappy, but yeah, for an animated movie about a guy being a dad while also having a \"second life\" to the kids, you should expect something like that. In my opinion, this movie was worth your money. See it yourself if you don't believe me!",
      "review_date": "2010-08-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Strictly for kids. I laughed maybe 3 times out loud. Very tired jokes, nothing really funny and new if you've seen the trailers.",
      "review_date": "2010-07-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An animated movie is one of the must lucrative schemes ever concocted. No matter what, as long as the film is animated numerous kids will beg their parents to take them to go and see the film. Don",
      "review_date": "2010-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Awesome, not as good as Toy Story 3, but a solid film.",
      "review_date": "2010-07-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "You are led to believe that this is about a bad guy who because of some adorable kids, becomes a good guy.  In fact, it really a story about some terrible animation (from a much overused style) about a guy who isn't really that bad (he hasYou are led to believe that this is about a bad guy who because of some adorable kids, becomes a good guy.  In fact, it really a story about some terrible animation (from a much overused style) about a guy who isn't really that bad (he has minions that he does care about - knows their names, asks how they're doing...), isn't very good at pulling off bad pranks (steals the Statue of Liberty - the small one from Las Vegas), and is just focused on the moon from a childhood experience.  The movie handles the 'adoption' terribly - I mean can you really walk into an orphanage and bring home 3 kids in a day on the basis of some obviously made up references?  There are just so many things wrong with the plot it's just ridiculous, but even if you want to give it a pass because it's a \"kid's movie\" and you have to pretend to be stupid for those types of movies, then fine let's focus on the animation.  Somewhere between Shrek and The Incredibles, it became \"the thing\" to do a certain type of animation that got just enough realism to do people correctly, but not too much to be freaky.  Since then, this and every other animated movie that comes has to follow this style.  The problem is that the style is a compromise, that only works so-so.  Just like this movie.",
      "review_date": "2010-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was a great movie. Funny. Charming. Sweet. The only thing it lacked was story. Go just for laughs.",
      "review_date": "2010-07-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought the movie was hilarious!!!",
      "review_date": "2010-07-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Although not as refined as Toy Story 3, my children enjoyed this much more and were talking about it the next day. Also the audience was more involved in this film. Laughing and getting into it much more, this was true of adults and children Although not as refined as Toy Story 3, my children enjoyed this much more and were talking about it the next day. Also the audience was more involved in this film. Laughing and getting into it much more, this was true of adults and children alike. So really, this movie does what it sets out to do. It was funny, and good looking. However some of the themes of adoption and returning adopted children back to an orphanage were in poor taste to anyone who has been involved in the adoption process. Most others will not even notice.",
      "review_date": "2010-07-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved the movie. nothing else to say. it appeals to all ages and was pretty freaking funny.",
      "review_date": "2010-07-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good movie for the whole family. The characters were lovable, especially Gru. The soundtrack was fun too (featuring Pherell). We've all been running around the house saying things like \"Freeze Ray\", \"Lightbulb\", and \"Squid Launcher\". That'sGood movie for the whole family. The characters were lovable, especially Gru. The soundtrack was fun too (featuring Pherell). We've all been running around the house saying things like \"Freeze Ray\", \"Lightbulb\", and \"Squid Launcher\". That's usually a sign of good fun at a movie when the kids return home with some funny lines.",
      "review_date": "2010-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Besides Steve Carell's wonderful accent, the best thing about 'Despicable Me' is how touching it manages to be, despite the fact that the film is clearly set up to end on a good note.",
      "review_date": "2010-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "well out of all theese family CGI films ive seen this one is prolly down on the bottom of my list. its not bad bujt its not great eather . i found it to be just ok and thats about it . the only decent comedy comes out of the little minions .",
      "review_date": "2011-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a Great movie. I myself saw it the day it was released. And loved it. The minions are the funniest characters of the movie. They just do the silliest of things.",
      "review_date": "2010-08-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Although the story isn't totally heart-warming and a few jokes felt a little tired, Despicable Me is still quiet clever in a few places and shows some great animation and design.",
      "review_date": "2010-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Never in my life have I found an appropriate time to use the word \"cute\". There is no way to describe this movie without including the C word. I'm 20 years old and I throughly enjoy this movie. The 3D was unecessary but I didn't mind spendingNever in my life have I found an appropriate time to use the word \"cute\". There is no way to describe this movie without including the C word. I'm 20 years old and I throughly enjoy this movie. The 3D was unecessary but I didn't mind spending a little extra to see probably one of my favorite movies this summer (close race with Inception. Opposite ends of the movie spectrum am I right?)",
      "review_date": "2010-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Charming movie - I was really not expecting this.I suppose, as they say, \"the minions make it!\" Yes, but it's also \"period\" - \"Golden Spy Era\" setting and humor, and I always loved that.\n\nIt's not predictable - something else to love. It'sCharming movie - I was really not expecting this.I suppose, as they say, \"the minions make it!\" Yes, but it's also \"period\" - \"Golden Spy Era\" setting and humor, and I always loved that.It's not predictable - something else to love. It's not (as you will say I often say!) a great film, but it is a very ENTERTAINING film, and it's VERY ENJOYABLE. Quite a surprise. Go in with no expectations and you will come out HIGHLY satisfied!",
      "review_date": "2010-09-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Despicable Me is fun , pure - hearted goodness , but i feel cheated .. because the movie went to fast , i really loved those little Yellow Minions they made the movie what it was , but for the most parents and kids alike will have a ball @\"Despicable Me is fun , pure - hearted goodness , but i feel cheated .. because the movie went to fast , i really loved those little Yellow Minions they made the movie what it was , but for the most parents and kids alike will have a ball @ this \"3D\" Film\" .. B",
      "review_date": "2010-10-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Movie was pretty interesting and funny. One of the most funny characters is Minions, dumb, hearty, and good-looking. Nice story. Funny jokes. It was funny to watch how bad guy became good one.",
      "review_date": "2010-10-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fun, light-hearted animated film that doesn't reach Pixar-level heights, but certainly is far better than most of the dreck Dreamworks has been putting out in recent years (\"Kung Fu Panda\" excluded). I can't imagine a child disliking this,A fun, light-hearted animated film that doesn't reach Pixar-level heights, but certainly is far better than most of the dreck Dreamworks has been putting out in recent years (\"Kung Fu Panda\" excluded). I can't imagine a child disliking this, but it does not have the emotional depth or wit to transcend its target audience.",
      "review_date": "2010-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gru may be Despicable, but this film certainly isn't The story of Gru and his adopting the kids may seem predictable or cheesy, but it manages to hit the right notes of your heart. I especially like how they manage to make him not suddenlyGru may be Despicable, but this film certainly isn't The story of Gru and his adopting the kids may seem predictable or cheesy, but it manages to hit the right notes of your heart. I especially like how they manage to make him not suddenly become a true dad, but develop over it, especially in the super fun theme park, as shown when the daughters try to win a carnival game. There are some funny jokes here that the kids won't get, one pick is \"BANK OF EVIL: formerly Lehman Brothers\", but its nice to see they don't try to make all the jokes that kids will get with fart gags and such, they craft a good storyline thats humourous and heart warming. For me, there is one component which made this film utterly brilliant and would make a brilliant film of their own: The Minions! These yellow creatures may seem annoying to some, but to me, they were utterly hilarious and so cute. They light up any scene they're in and the mini-movies they star in on the DVD are utterly hilarious and something brilliant. They're tied with Toy Story's aliens for favourite animation character. If you enjoyed Pixars various movies, then trust me, you'll definately enjoy Despicable Me.",
      "review_date": "2011-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie, forget the bad reviews! This video is worth seeing, no matter how old you are. This movie is way better than Toy Story 3! Meet Vector, Gru, and the kids for a thrill-packed ride! Believe me, it's awesome!",
      "review_date": "2010-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very cool movie.  The minions are hilarious, and it's worth seeing just to laugh at them.  Not a groundbreaking film and not going to win any awards, but I'd watch it again.",
      "review_date": "2010-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Though its materials are mostly cliche and have been used in Hollywood for a long time, Despicable Me delivers its high-class materials with charms, cute, and heartfelt style. Steve Carrell's voice performance is probably the better ones ofThough its materials are mostly cliche and have been used in Hollywood for a long time, Despicable Me delivers its high-class materials with charms, cute, and heartfelt style. Steve Carrell's voice performance is probably the better ones of voice performances I've seen in years. His cute minions also helped add to the film's quirkiness.\rGru, a criminal mastermind voiced by Steve Carrell, was on his way to conquering the world when he ran into three orphan girls and adopted them. Margo, Edith, and Agnes was in a home since they can remember and being adopted by anyone at this point is a joy for them. But after staying with Gru for a day, the kids were horrified. After months of teaching and nurturing, the kids were able to get Gru to be nicer. The story progress with Gru choosing between his evil plan and his kids. It is heavily borrowed from other children films, but Despicable Me stabbed at the materials at a different angle and succeeded in bringing Hollywood something new. OscarBuzz: Best Animated Feature, I has a good chance of being nominated but winning is a long shot.",
      "review_date": "2010-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable Me is one of the best animated movies i've seen, the characters are enjoyable, and it has a touching redemption story, it's hilarious and moving, this is a movie i would highly recommend seeing, it has what all movies need aDespicable Me is one of the best animated movies i've seen, the characters are enjoyable, and it has a touching redemption story, it's hilarious and moving, this is a movie i would highly recommend seeing, it has what all movies need a touching story with crude humor, my only complaint is that it starts off slow, but ultimately unfolds into one of the best movies i've ever seen.",
      "review_date": "2011-02-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fun movie with sweet story and plenty of laughs.   The characters were great - the bad guy just bad enough to still be likable and Vector enough of a weeny to be annoying.  Definitely recommend.",
      "review_date": "2011-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Long story short, I enjoyed the movie.",
      "review_date": "2011-04-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best Animated films of 2010, way better than Toy Story 3 or How to Train Your Dragon. Lots of emotion make a grown man want to cry. This movie deserves a Oscar.",
      "review_date": "2011-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a great example of a film for any age, the humour is grown up enough in places for young adults and parents, the animation is fantastic and the characters are very cute. I'd say this is on a par with Megamind for older viewers, butThis is a great example of a film for any age, the humour is grown up enough in places for young adults and parents, the animation is fantastic and the characters are very cute. I'd say this is on a par with Megamind for older viewers, but this just sneaks an 8 as it's better for kids. DVD Rental: Yeah why not, with the mates or with the kids",
      "review_date": "2011-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wonderful film we watched for \"family night\" with my 7 yr old son.\rIt was entertaining and funny.\rIt kept the adults interested as well as the kids.",
      "review_date": "2011-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "You fall in love with him, his minions and the three orphan girls....absurd and v v v funny! Blue Sky Creative are offering a FREE copy with a years hosting! http://blue-sky-creative.com/",
      "review_date": "2011-02-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable is yet another brilliant, heartfelt, and most of all, hilarious animated comedy for us to sink our teeth into this year. I thought to myself at the end of the movie that it felt a lot like The Grinch. So I dubbed it, \"How The GruDespicable is yet another brilliant, heartfelt, and most of all, hilarious animated comedy for us to sink our teeth into this year. I thought to myself at the end of the movie that it felt a lot like The Grinch. So I dubbed it, \"How The Gru Stole The Moon\". That's pretty creative huh? I thought so...Anyway, this is a fantastic film. It's obviously marketed for children, but like so many other films in its genre, there's plenty of material here to keep the adults happy. I laughed out loud more at this one, than I have in a very long time. A lot more than I did at the stupid MacGruber movie, and trust me, I laughed my ass off at MacGruber. The voicework is terrific. I love Steve Carrell (The 40-Year-Old Virgin, The Office). I love Jason Segal (I Love You Man, Forgetting Sarah Marshall) just as much. I love Russell Brand (Forgetting Sarah Marshall, Get Him To The Greek) and I love Kristen Wiig (Adventureland, MacGruber). As you can see, I had high expectations for this ensemble of hilarious comedians going in. They didn't disappoint. Steve Carrell's choice of accent may annoy some, but it did not bother me in the lightest. The think this movie had a very good script as well. The dialogue, the pacing, everything was well written. The editing is perfect. It does start off a tiny bit slow, but still not dull. It's funny all the way throughout. The music was great as well. Rapper/Producer/N.E.R.D. lead Pharrell Williams did the music, and it was excellent. Nice mix of a variety of music genres, all toned together perfectly. There are plenty of winning concept in the film. I mentioned that it reminded me of The Grinch, but it was still very creative. It was a lot better than that stupid Megamind movie is going to be. Why are Universal and DreamWorks releasing FOUR movies in the same year anyway?! Are they still married? I don't know, but if so, I guess they're trying to stay relevant so that Toy Story 3 doesn't easily destroy their line-up when Oscar season comes. Sadly, it will anyway. I say sadly because I'm one of the few who liked How To Train Your Dragon a little more than Toy Story 3. Back to this movie. There were some things I had a little trouble coping with. The main thing is, and this may sound stupid because it's a cartoon, but I had a little trouble coping with the obvious and complete lack of realism. This movie felt too much like an episode of The Looney Toons, with sharks eating Gru, and a dozen missles hitting him in the face, yet he walks away unscathed. Even so, I think it's great. The show stealers by far are the minions. I loved the minions so much. They never ceased to make me smile, crack up, or flat out bust out with laughter. They were awesome. Easily the best thing about the movie, which means a lot. I also liked the little girl, Agnes. She was cute, and actually a strong character. So, I highly recommend this movie to anyone, and everyone. Young or old. Hopefully Despicable Me will not be forgotten in the shadow of Toy Story 3.",
      "review_date": "2011-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely shocked me! This is a 3D animation with a change in direction! Completely fresh take on this form of entertainment, and i have yet to even see it in 3D! Story was incredibly original, super cute characters! Graphics areAbsolutely shocked me! This is a 3D animation with a change in direction! Completely fresh take on this form of entertainment, and i have yet to even see it in 3D! Story was incredibly original, super cute characters! Graphics are jaw-dropping, and given that this isn't a Pixar production, it has the kind of creative freedom to be as out there as need be! With no name to live up to --and no expectation-- a masterpiece is born.",
      "review_date": "2011-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable Me has some great characters. It is mildly funny, smart, and has a great balance between its humor and story. The result is a solid animated film.",
      "review_date": "2011-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable Me was not disappointing at all. The characters were great and the movie overall was entertaining. What made me start to track my opinion down was that I got a feeling that the movie showed cliche during the second half, which is aDespicable Me was not disappointing at all. The characters were great and the movie overall was entertaining. What made me start to track my opinion down was that I got a feeling that the movie showed cliche during the second half, which is a huge pet peeve of mine. The idea of a villain as a main character was awesome, but they could have taken it further. It felt like it was wrapped up too quickly or in the wrong way. Despite this, I recommend this movie to anyone at any age.",
      "review_date": "2012-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "THE ABSOLUTE CUTEST MOVIE. Being grown and mature, very few cartoons and childish movies touch home base for me. This movie's ending summed up all lose ends brought forth in the beginning of the movie and everything was just SO DAMN CUTE. TheTHE ABSOLUTE CUTEST MOVIE. Being grown and mature, very few cartoons and childish movies touch home base for me. This movie's ending summed up all lose ends brought forth in the beginning of the movie and everything was just SO DAMN CUTE. The minions, oh my goodness, I need one. Very heartwarming and cute storyline and characters - DEFINITELY WORTH WATCHING, whatever age group you may fit into.",
      "review_date": "2011-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "(5.5 is more accurate)   This is a solid animated feature and not too much else. If you got kids you like to watch movies with, this is a suitable number. The frame-shifted world of evil villains living amongst us in our suburbs, relatively(5.5 is more accurate)   This is a solid animated feature and not too much else. If you got kids you like to watch movies with, this is a suitable number. The frame-shifted world of evil villains living amongst us in our suburbs, relatively civilly half the time, is an entertaining slant to enjoy. The main villain and character is a charming enough rendition of a curmudgeon with ambition. (Although, honestly, I think Steve Carrellâ",
      "review_date": "2012-01-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Solid and good animated movie with a nice plot and so much fun with these little yellow ... does someone know how they're called?! Anyway definately worth it !",
      "review_date": "2012-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A new hit! Despicable Me is an awesome animated film, the characters are really funny, the voices are really incredible, and claps for the Minions, wow, be like the Rabbids on Rayman, Despicable is a great classic. I love it.",
      "review_date": "2012-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "First off, I would give this a 9.25 out of 10. Animation is good. Story real good. Can be funny sometimes. Acting and score is good. Steve carrel does good. Overall, this is a good movie that you and your family should see.",
      "review_date": "2012-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i seen this movie way too many times . but its okay movie and its 55 % enjoyable . but hello people its 2014 forget this animation film . this film is old . watch good and a 2014 favorite movie . Grade C",
      "review_date": "2014-03-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I hate all of them. Every single one, same plot, same cringyness. Please stop making them.",
      "review_date": "2022-04-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "“Despicable Me” is a movie that promised to be funny and it was. The characters were funny and the writing was very well done. The film also made good use of the 3-D using it to enhance the experience rather than create it. This is one movie“Despicable Me” is a movie that promised to be funny and it was. The characters were funny and the writing was very well done. The film also made good use of the 3-D using it to enhance the experience rather than create it. This is one movie that is worth checking out. Even if you don’t love it like I did you won’t be able to resist laughing from time to time at some of the film’s stupidest moments. If you don’t take the movie too seriously and just laugh a little you’ll find that “Despicable Me” is fine movie that couldn’t have been done any differently.",
      "review_date": "2013-05-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fun movie with a good story, and some witty dialogue by Steve Carrell. Although, there weren't as many laughs as I thought there would be (I blame it on the television commercials).",
      "review_date": "2011-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A smart and heartfelt story that doesn't just rely on quick laughs. A wide range of characters that vary between sweet, evil, and just pure fun. One of the few good animation movies that didn't come out of either Pixar or Dreamworks. It wasA smart and heartfelt story that doesn't just rely on quick laughs. A wide range of characters that vary between sweet, evil, and just pure fun. One of the few good animation movies that didn't come out of either Pixar or Dreamworks. It was great to see.",
      "review_date": "2013-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despite its best efforts Despicable Me is never quite as funny, particularly for adults, as the very best of the computer animated genre, an honour which for me still belongs to Toy Story. Thanks to some excellent voiceover performances andDespite its best efforts Despicable Me is never quite as funny, particularly for adults, as the very best of the computer animated genre, an honour which for me still belongs to Toy Story. Thanks to some excellent voiceover performances and plenty of sight gags however it certainly entertaining enough to make for a decent watch and children will love the little green minions.",
      "review_date": "2013-06-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A colourful and enchanting animation it certainly is, but it's nowhere near the quality of animation giants like Pixar. Not only this, but it's very forgettable and nothing special. Once in the cinema, yes, it's a nice treat. Twice...no.A colourful and enchanting animation it certainly is, but it's nowhere near the quality of animation giants like Pixar. Not only this, but it's very forgettable and nothing special. Once in the cinema, yes, it's a nice treat. Twice...no. DVD... definitely no...",
      "review_date": "2011-07-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sometimes funny but mostly lame, the premise is not very clever and the animation nothing special.",
      "review_date": "2019-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable Me is much, much better than I expected it to be, as the adverts and trailers didn't exactly do a good job promoting it... Despicable Me isn't exactly hilarious, but nonetheless is very funny, it has a lot of jokes, most of themDespicable Me is much, much better than I expected it to be, as the adverts and trailers didn't exactly do a good job promoting it... Despicable Me isn't exactly hilarious, but nonetheless is very funny, it has a lot of jokes, most of them being pretty funny, but some of them really make you laugh. The comedy flows well with the story, a fairly simple one, but interesting and kinda moving, this is typical, but great for an animated kids/family film. Despicable Me definitely has a lot of things going for it, including the minions, now they are funny  gibberish speaking yellow things with glasses! The animation in this film is charming and stylized. The action in this film is something that happens quite a lot, being comedic, 'in your face' and, well, action-y (that's a good thing). Well, to conclude: Despicable Me is a charming, funny, innovative, action filled movie with a moving story! So I give this movie a... 8.5/10!",
      "review_date": "2013-06-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despicable, it sure was. By simply using \"cute & fluffy\" antics does not automatically allow for humor. Steve Carell's vocal talents are shrouded in below-average dialogue from the script.",
      "review_date": "2014-09-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pretty interesting story with humorous jokes and nods toward popular culture that the kids wouldn't necessarily get, but the parents that are dragged in will enjoy. The story will tug at your heart strings just a little bit. Well...maybe itPretty interesting story with humorous jokes and nods toward popular culture that the kids wouldn't necessarily get, but the parents that are dragged in will enjoy. The story will tug at your heart strings just a little bit. Well...maybe it will nibble if even that much. I mean, if you're into the whole predictable plot and sappy story. It's a moderately enjoyable film to sit through; not too long, will give you a few laughs, and a better look toward your life's priorities. Give it a bit of a chance.",
      "review_date": "2012-06-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIt's quite good actually. I liked all of it, and I realized near the end that the moon was too big. And with the second one coming out soon, I cant wait for it!",
      "review_date": "2012-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I got to say that there was something about this movie I just found utterly charming. It's not brilliant, but I would say that it is pretty good. Carrel & Segel are both utterly hilarious with almost everything they do. The Minions are justI got to say that there was something about this movie I just found utterly charming. It's not brilliant, but I would say that it is pretty good. Carrel & Segel are both utterly hilarious with almost everything they do. The Minions are just priceless. They could easily do a who movie, focused solely on them. Where this movie suffers is perhaps that there is very little story to it. It feels more like a whole lot of comedic sketches put together. But that'S not to bad as it does give it a bit of a relaxed feel. Nice to have a movie that seems to just want to have fun without too much \"bay-ness\" to it.\r Overall: Despicable Me is just a charming and fun movie that is meant to be taken leisurely. Well worth the watch.",
      "review_date": "2013-04-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good film, enjoyable and all, but I just can't join the hype with everyone else. It's funny and I like the characters but there are so many similarities to other films, mostly Pixar, that you can't help but notice. It's also really aimed atGood film, enjoyable and all, but I just can't join the hype with everyone else. It's funny and I like the characters but there are so many similarities to other films, mostly Pixar, that you can't help but notice. It's also really aimed at the kiddies and it gives less for adults or big kids at heart to enjoy. There is enough going on to hold your interest and the minions provide a lot of the laughs along with Agnes, but at the end of the day there are better films like it out there.",
      "review_date": "2013-06-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Love the movies very much. It's has a lot of funny scene. Ana there are many family touching moment like the Gru's love of 3 daughter",
      "review_date": "2013-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you only watch a movie for one part or character then the rest of the film is irrelevant. Despicable Me is only enjoyed because of the minions who are quite funny but provide immature and slapstick humor.",
      "review_date": "2013-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very original, fun and interesting animation! It would've been better if it was a bit more dramatic and less fantastic... Overall i highly recommend this to everyone!",
      "review_date": "2014-04-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Why am I only just seeing this movie? It was fantastic for what it was. The 3 little girls were absolutely precious and the movie was generally heartwarming. The minions were adorable as well and always made me giggle. It isn't Pixar, but itWhy am I only just seeing this movie? It was fantastic for what it was. The 3 little girls were absolutely precious and the movie was generally heartwarming. The minions were adorable as well and always made me giggle. It isn't Pixar, but it made me smile and that's what it was going for. I think this movie did it's job very well and I loved it!",
      "review_date": "2013-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pros: Despicable me is a fun movie, it's very good for kids or maybe teens. The minions are really funny, I wish they have more screen time. Even that it is still a fun movie for all ages not just kids.\r Cons: Some jokes are corny but onlyPros: Despicable me is a fun movie, it's very good for kids or maybe teens. The minions are really funny, I wish they have more screen time. Even that it is still a fun movie for all ages not just kids.\r Cons: Some jokes are corny but only few of them.",
      "review_date": "2013-06-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Before reviewing this movie, and even though I have watched this before, I only clearly remembered Gru's voice and the minions, which left a bad impression considering that I couldn't remember most of what happened in the original movie.Before reviewing this movie, and even though I have watched this before, I only clearly remembered Gru's voice and the minions, which left a bad impression considering that I couldn't remember most of what happened in the original movie. After watching the movie, I somewhat understood why. While \"Despicable Me\" has some charm, funny minions, and wonder voice work from Steve Carell, it still has issues with so much visual effect that it leaves a slightly negative impression. \"Despicable Me\" is not refined as the best animated fare  and has an interesting theme on bad guy's, but doesn't do anything to us but laugh (and that's fine). \"Despicable Me\" is just average, but that's fine considering it does have hilarious moments that we will probably see again in \"Despicable Me 2\".",
      "review_date": "2013-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Incredibly imaginative and it has a special individuality to it, 'Despicable Me' has plenty of heart (not as much as Toy Story) and plenty of raucous laughs from the cute and crazed minions.",
      "review_date": "2013-11-15",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 135,
  "genres": [
    "Comedy",
    "Animation",
    "Family"
  ]
}