{
  "title": "Flipped",
  "rating": 7.8,
  "release_date": "2010-08-06",
  "genre": [
    "Drama",
    "Comedy",
    "Romance"
  ],
  "summary": "Two eighth graders start to have feelings for each other despite being total opposites. Based on the novel \"Flipped\" by Wendelin Van Draanen.",
  "critic_reviews": [
    "This is a beautifully crafted and special movie to cherish, one likely to stay with you long after most of the so-called summer blockbusters have faded into memory.",
    "Flipped is Rob Reiner's best film in 18 years, and includes echoes of two of his most accomplished efforts, \"The Sure Thing\" and \"Stand By Me.\"",
    "Maybe what makesFlipped\" such a warm entertainment is how it re-creates a life we wish we'd had when we were 14.",
    "Callan McAuliffe, a handsome Australian youth, looks right as the perma-press Bryce.",
    "A charming Rob Reiner film that more or less works as intended.",
    "A flipped take on tween-to-teen romance that make it such a minor gem.",
    "Flipped is the kind of small, special movie that wraps you up in so much warmth, humor and humanity that it will leave you wishing that stories like this weren't so rare.",
    "As phony as a poodle-skirted waitress at a mall diner, yet it's as sweet as a malt. A vanilla one.",
    "Interesting enough that you wish it were better.",
    "Sweet, smartly acted, and charmingly old-fashioned, Flipped is a minor pleasure that will strike a lot of moviegoers - those who think no one makes movies for them anymore - as a major treat.",
    "Though it's not worth doing cartwheels over, Flipped is a pleasantly nostalgic and well-intentioned family movie featuring strong performances by its young actors.",
    "Though the dialogue rings too chirpy (\"Gee whiz!\") and faintly anachronistic (\"Get over it, man!\"), the acting is wonderfully subtle, especially John Mahoney's turn as Bryce's grimly clear-eyed grandfather.",
    "Eventually the kids figure out that parents and other authority figures (among them Rebecca De Mornay, Anthony Edwards, Penelope Miller, and Aidan Quinn) don't always have it together. Was this trip necessary?",
    "The story should have made for charming results on screen. Instead - and I truly don't enjoy saying so - co-adapter and director Rob Reiner's picture lands somewhere between synthetic nostalgia and the texture of real life.",
    "Far more interesting than Juli and Bryce's banal budding love is Reiner and co-scripter Andrew Scheinman's sensitive exploration of how parents shape their children.",
    "Reiner again demonstrates compassion and insight into young people's battles to acquire self-knowledge, but in his new film, too many clearly fictional characters and contrived situations bog down his story.",
    "A well-intentioned family pic about first love that's overly concerned with period details and life lessons, rather than the genuinely sweet characters at its center.",
    "Flipped succeeds when it backs off the gluey nostalgia and focuses instead on the subtler pitfalls of adolescence - the tough stuff, the moral stuff, the constant tacking between fear and courage.",
    "Worse, he (Reiner) vacuum-seals it all in a patronizingly wholesome package, like an extended episode of \"The Wonder Years\" with all the wonder sucked out.",
    "There's barely half a film here, stretched and pulled so thin you can nearly see through it.",
    "Reiner, in very broad strokes, works in issues of poverty, thwarted dreams and family obligation, and almost pulls it off, thanks to Anthony Edwards, Aidan Quinn, Rebecca De Mornay, Penelope Ann Miller and John Mahoney, who impart humor and humanity to thinly sketched characters.",
    "That Flipped isn't insufferably cute is a measure of its integrity. But it still strains to view the world through the eyes of children without a filter of grown-up cynicism. It is plodding and awkwardly paced.",
    "I can't say anything nice about Flipped, a painfully clumsy adaptation of a tween novel by Wendelin Van Draanen.",
    "This results in a film that spells everything out visually, then further elaborates through groaningly obvious dialogue, then drives every point home for slow-witted audiences via shameless narration."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "It sounds like most of the critics have forgotten what Love is like, I watched \"Flipped\" with my daughter and found it enchanting and memories of being in love at that age came racing back....Excellent acting by all, especially the kids andIt sounds like most of the critics have forgotten what Love is like, I watched \"Flipped\" with my daughter and found it enchanting and memories of being in love at that age came racing back....Excellent acting by all, especially the kids and whether the adaptation is true to the book or not it came across great and would highly recommend it to any family with kids in their tween years.",
      "review_date": "2011-03-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Of course the critics would not like this film.  This piece is so careful not to clutter realism with the idle meanderings of a writers mind that one is amazed by how simple and realistic the film becomes.  It is perhaps one of the bestOf course the critics would not like this film.  This piece is so careful not to clutter realism with the idle meanderings of a writers mind that one is amazed by how simple and realistic the film becomes.  It is perhaps one of the best coming of age or self realization pieces I've seen.  There is an excellent ensemble cast.  The piece is limited technically.  This isn't a comic book adaption and it's certainly not a reworking of an overworked Tolstoi piece.  It's just a simple slice of life portrayed without a lot of tricks or visual effects or mass murders.",
      "review_date": "2012-03-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of the greatest movies i've seen. the screenplay is fantastic. humorous and enjoyable. I would recommend this movie to anyone of any age.",
      "review_date": "2012-03-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In my complete own personal opinion this is the best movie I have ever seen. There's just something about the way it ends or the way that its brought out that makes me just want to keep watching and gain an incredible interest in Juli andIn my complete own personal opinion this is the best movie I have ever seen. There's just something about the way it ends or the way that its brought out that makes me just want to keep watching and gain an incredible interest in Juli and Bryce's life. This movie will stick with me and be watched for a long time.",
      "review_date": "2014-11-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Flipped achieved one great thing, and that is to produce a feeling on me. At the end of the day that is one of the most important things that movies should ultimately accomplish and aim for. This movie presents one of the most ironical butFlipped achieved one great thing, and that is to produce a feeling on me. At the end of the day that is one of the most important things that movies should ultimately accomplish and aim for. This movie presents one of the most ironical but true love stories that can touch many if not everybody in some way or another. Granted, it could be a bit heavy at times given its structure. Flipped interludes between the two main character's perspective on each of the several situations that they cross upon, and that opens the gate for a lot of repetition which can be a little frustrating. But overall, Flipped couldn't have been any other way; it successfully reaches so much depth because of this enduring but intriguing concept. At the end, this movie takes you back to the days of the first true love, and also to the days that resembled the meaning of what it was to be young.",
      "review_date": "2012-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Man I can't believe this movie has gone under the radar for so many people! I feel sorry for the people who haven't seen or heard of this movie! This was one of my best movies of 2010 by far! Rob Reiner done a fantastic job! The movie has theMan I can't believe this movie has gone under the radar for so many people! I feel sorry for the people who haven't seen or heard of this movie! This was one of my best movies of 2010 by far! Rob Reiner done a fantastic job! The movie has the 'Stand By Me' feel!!! It was a really cute love story! I would recommend this for a date movie for sure! If you don't have a date please still it a go cos you won't be disappointed!!!",
      "review_date": "2011-02-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Critics have called Flipped, \"A true gem\", & \"an instant classic\", so I have to ask, what were they smoking when they watched this movie? The story follows Bryce Loski (Callan McAuliffe) who has just moved to a new neighborhood with hisCritics have called Flipped, \"A true gem\", & \"an instant classic\", so I have to ask, what were they smoking when they watched this movie? The story follows Bryce Loski (Callan McAuliffe) who has just moved to a new neighborhood with his family. Before he's even gone into the house his new neighbor, Juli Baker (Madeline Carroll) has come over to say hi, and for her it's love at first sight. Bryce, being all of eight years old, finds Juli annoying, but that doesn't stop her from stalking him all the way to high school. Will Bryce always find her annoying or will he eventually feel the same way about her? Well, I think the title of the film is a huge spoiler in and of itself, but that's besides the point. The entire film follows their interactions together, first told from his point of view, and then again from her point of view, making the whole thing very repetitive. The film offers nothing else besides the interactions of these two kids, no side stories, no friends, and even limited family interactions, it's literally just one meeting between Bryce and Juli after another. This is a film by Rob Reiner, the Director of Stand By Me, The Princess Bride, Spinal Tap, and countless other great films! I realize that not everything is going to be a home run, but couldn't he see how boring this movie was? Flipped is slow, repetitive, and even the damn title is a spoiler. This is most definitely one you can skip.",
      "review_date": "2020-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe lead actor seemed kind of bratty and I did not have much interest in his life.  I don't know how he moved from a wallflower to one of the popular high school boys, a \"ball boy\".  Watched this movie at home with a dvd from the library.",
      "review_date": "2017-04-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Set between the 50s and 60s, Julie Baker (Caroll) and Bryce Loski (McAuliffe) face each other's issues to build a funny and moving relationship in a complex yet upbeat coming-of-age story from the director of “When Harry Met Sally” and “TheSet between the 50s and 60s, Julie Baker (Caroll) and Bryce Loski (McAuliffe) face each other's issues to build a funny and moving relationship in a complex yet upbeat coming-of-age story from the director of “When Harry Met Sally” and “The Bucket List”, Rob Reiner.This movie has a simple narrative that is told primarily by two perspectives, which is in this case, a great way to tell the story of the two main protagonists. It perfectly catches the attention of the two lead stars, as well as their point of views in solving the conflicts by their own. Also, the retro style of this movie is perfectly realized by its fashion and music. By this, Reiner gives this generation a tale of innocent approach of first love and family traditions during the 50s and 60s.VERDICT: However does it look familiar to some coming-of-age stories from other movies, Flipped is still a genuine and heartfelt charm that never fails to captivate its audience.",
      "review_date": "2017-06-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Strange narrative: why do I have to see everything twice? And why must I see all the mental activity? But still a lovely movie for educating the youth.",
      "review_date": "2018-01-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I stumbled on this movie while browsing through Netflix, and only decided to watch because it was a Rob Reiner film. I have to say that this was a wonderful film and definitely filed under “rewatch again in the future”. If you’ve ever been inI stumbled on this movie while browsing through Netflix, and only decided to watch because it was a Rob Reiner film. I have to say that this was a wonderful film and definitely filed under “rewatch again in the future”. If you’ve ever been in love for the first time, this movie will bring back a lot of those feels. I also loved the 50’s setting that brought a nice “Wonder Years” vibe to the film. Anyone who gave this movie a 1 star rating is probably a “flat” person and has the same deep down emotional turmoil and prejudice as Bryce’s dad. For everyone else, this movie will not disappoint.",
      "review_date": "2021-08-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI haven't watch this movie so i cannot say if its really good or bad. Actually, this is my first time coming here.",
      "review_date": "2019-05-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I really really really really really really really really love  this movieeeeeee",
      "review_date": "2021-03-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don’t care what anyone says. I love... love love LOVE this movie! The story about a boy who pushes a girl away because his friends are like “EW, GIRRRLS!”. It isn’t blatant bullying as much as it is Bryce, as a kid, doesn’t know how to feelI don’t care what anyone says. I love... love love LOVE this movie! The story about a boy who pushes a girl away because his friends are like “EW, GIRRRLS!”. It isn’t blatant bullying as much as it is Bryce, as a kid, doesn’t know how to feel about Juli, who is head over heels for him growing up, so he pushes her away and does mean things. And unfortunately when he begins to fully understands his feelings as a teenager, it’s seemingly too late. This is more relatable as a movie than other movies I watched as a young boy, and to this day I have a soft spot for this slice of life.",
      "review_date": "2021-06-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nthis movie is doo doojdkdkekfkrkeoooekekekrkdkdkdjddjdnsnekeofocodkdnsksosoxockdjdnskozoxxk",
      "review_date": "2021-02-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \ngreat movie. loved it. Bryce is so handsome, i could totally empathize with Juli when she would talk about his dazzling eyes. and then when Bryce did some really mean things to her, I could once again totally empathize with Juli and thought he was a complete jerk. The whole story was very relatable to me in general. wonderful movie.",
      "review_date": "2021-06-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nClean movie, free from any politics loaded content so common nowadays. The characters dynamic is so tasteful that almost leaves you longing for the sequel, addressing the true nature of what romantic love should be; a man finding courage to break from peer pressure for a counterpart that moves you to be a better person, and a woman resisting to give her heart without a proof on maturity.Everyone in my family loved it!",
      "review_date": "2021-07-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I loved the movie I really did it’s like my comfort movie that I rewatch,they honestly don’t make movies like this anymore the only thing I wish they could of changed was the ending on how they leave it on a cliffhanger making us fans wantingI loved the movie I really did it’s like my comfort movie that I rewatch,they honestly don’t make movies like this anymore the only thing I wish they could of changed was the ending on how they leave it on a cliffhanger making us fans wanting a sequel:( but hey I’m happy I got to see the movie!",
      "review_date": "2021-07-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Flipped is a well crafted picture with the decent direction and unique colour-grading.Despite some minor flaws, Flipped is still a warm little entertainment.",
      "review_date": "2022-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I read the book and watched the movie in 6th grade and yet I still love the story. Great comfort movie",
      "review_date": "2022-05-08",
      "source": "metacritic"
    }
  ],
  "num_reviews": 44
}