{
  "title": "Ip Man",
  "rating": 8.2,
  "release_date": "2010-10-01",
  "summary": "Ip Man is the award winning film adaptation about the life story of Ip Man, the grand master of the Wing Chun style of kung fu and sifu (master) of legendary kung fu superstar Bruce Lee. Set in Foshan, China, during the Sino Japanese War, Ip Man vividly brings to life the brutality of the infamous Japanese occupation, where once proud menIp Man is the award winning film adaptation about the life story of Ip Man, the grand master of the Wing Chun style of kung fu and sifu (master) of legendary kung fu superstar Bruce Lee. Set in Foshan, China, during the Sino Japanese War, Ip Man vividly brings to life the brutality of the infamous Japanese occupation, where once proud men are forced to fight till their death for a precious bag of rice. Defined by courage and humility, one man rises to the fore, Grandmaster Ip Man, whose matchless fighting skills are revered all over China. Upon refusing to teach his beloved fighting art to the invading Japanese soldiers, he is forced to fight for the honor of his country in a series of battles that will culminate in a kill or be killed showdown with General Miura Japan’s greatest fighter. (Variance Films)… Expand",
  "critic_reviews": [
    "Like his narrative, Yip's aesthetics are more muted and traditional than those of well-known florid imports \"Hero\" and \"Crouching Tiger, Hidden Dragon.\" Yet such modesty is in tune with his soft-spoken protagonist, and also provides clean, sharp views of Yen's awe-inspiring skills, which, in choreographer Sammo Hung's thrilling one-against-many skirmishes, make literal the term \"fists of fury.\"",
    "It's a highly entertaining, big-budget, kick-butt kung fu movie, the best of its kind since Jet Li's \"Fearless\" in 2006.",
    "As a slice of history, Ip Man is disappointingly simplistic. Yip, Wong, and Yen never develop any real tension between Ip's true story and the exaggerated myth-making of a martial-arts movie. But as an exaggerated, myth-making martial-arts movie, Ip Man is often thrilling.",
    "Ip Man will be manna for those who like their kung fu straight and wireless, their villains Japanese and their heroes unconflicted Chinese patriots.",
    "The action is enthralling even if the storyline doesn't always have the ring of truth about it.",
    "The highlights, of course, are the competitions and duels, choreographed by Sammo Hung.",
    "If you're looking for great action scenes, you've found them. But if you desire more than eye candy, such as character and plot development and historical accuracy, you'll have to look elsewhere.",
    "Over all, the film is a prime exhibit in the relentless and regrettable shift away from a natural, allusive, romantic Hong Kong style and toward a mainland studio aesthetic that is stagebound, literal, overstuffed and sentimental - like the big-budget Hollywood weepies of the '60s or the '80s.",
    "Everything from the direction of actors to the dialogue signifies the work of a filmmaker who favors easy audience-baiting reactions over dramatic momentum. Doesn't the man who would later teach Bruce Lee how to kee-yah deserve better than a chopsocky Punch-and-Judy show?"
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I really enjoyed this film.  It had a nice balance of martial arts action and a solid storyline.  I found myself getting sucked into the whole storyline with ease.  While it won't win any prestigious awards, it is definitely worth the watch.",
      "review_date": "2010-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Frankly the film was one of the best films I've seen in my life which relates to the martial arts  the director was creative in all choices he made in environment- the dialogue between the characters- actors in everything else I did not findFrankly the film was one of the best films I've seen in my life which relates to the martial arts  the director was creative in all choices he made in environment- the dialogue between the characters- actors in everything else I did not find obvious or large flaws in the film except for exaggerating of  the strength of  ip man and the film do not deserve this average evaluation  by critics who seem to be enjoying more traditional films than inspiring films",
      "review_date": "2013-05-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "That movie was AWESOME. I have been running into many lackluster MA films, but this one has it all. Story...Check, amazing choreography... CHECK +, has Jet Li's approval... yes. All around great values, build-up and controversy. The onlyThat movie was AWESOME. I have been running into many lackluster MA films, but this one has it all. Story...Check, amazing choreography... CHECK +, has Jet Li's approval... yes. All around great values, build-up and controversy. The only fault I found was in the ending where \"someone\" was a little late.",
      "review_date": "2010-10-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An outstanding kung fu movie, the plot is a little shaky in places, but what do you expect in a kung fu movie?  Donnie Yen is unbelievable in this role and the action scenes are breath taking. If you're looking for a good old fashioned kungAn outstanding kung fu movie, the plot is a little shaky in places, but what do you expect in a kung fu movie?  Donnie Yen is unbelievable in this role and the action scenes are breath taking. If you're looking for a good old fashioned kung fu film, this is for you. DVD Rental: Do It.",
      "review_date": "2011-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Aesthetically pleasing but with the storyline that boardlines on boring, all is forgotten looking at the remarkable and masterful fights scenes  choreographed by Sammo Hung.",
      "review_date": "2011-03-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ip Man is mainly worth watching for the flawless fight choreography by Sammo Hung. It's creative and entertaining, and executed well by Donnie Yen playing Master Ip Man, as well as all the actors and martial artists he fights over the courseIp Man is mainly worth watching for the flawless fight choreography by Sammo Hung. It's creative and entertaining, and executed well by Donnie Yen playing Master Ip Man, as well as all the actors and martial artists he fights over the course of the film. Taken purely as entertainment, the film works extremely well, but after a promising and dramatic set up, it threatens to descend into tedium. In the second half, the film becomes more about spectacle than story - it's just one set-piece after another with little in terms of emotional drive to connect them, and the film only remains relatively decent because of the charisma of Yen. You have to take the events of the film (supposedly based on the real life of Bruce Lee's master) with a pinch of salt - the filmmakers have clearly used artistic license to make the story as action-packed as possible, and in some ways that is a shame. A deeper, more thoughtful look at the life of this extraordinary man would have been just as entertaining. As martial arts spectacle, Ip Man is among the best releases of the past few years, but as genuine drama, it's a little shallow.",
      "review_date": "2011-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really didn't know what to expect when I first saw this movie... not only did it surprised me, but it made it my favorite movie ever! I'm a big fan of good choreographic fight scenes and every fight in this movie are outstanding ones! 10/10 for me!",
      "review_date": "2012-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best kung fu movies ever made! Not only was there tons of great fighting scenes, there was also a FANTASTIC story line (which is rare in kung fu movies). Definitely recommend watching this.",
      "review_date": "2012-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie has excellent action, but boring characters and an overpowered protagonist. I think he gets hit under 10 times in the entire movie. It was fun to watch at first, but eventually even the action grew stale",
      "review_date": "2012-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie to I see in decades ...the best trilogy of artial marts movie (for me ever!! ) I cant belive some people write bad reviews ...maybe hate wing chu style and think fight is just send punchs to the air ..lol",
      "review_date": "2015-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is definitely one of Donnie's better films. His acting is very plausible, and his moves . . .? Well, he is Donnie Yen. If that doesn't mean anything to you, watch this film. And \"Flashpoint\". 8 1/2 on 10",
      "review_date": "2010-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "what the heck are these critics thinking? can they not read sub titles and get annoyed? i have become a user rating reader because i have always disagreed with critics. i think they might be shallow minded and unaware of good films. this filmwhat the heck are these critics thinking? can they not read sub titles and get annoyed? i have become a user rating reader because i have always disagreed with critics. i think they might be shallow minded and unaware of good films. this film is amazing and touching. every aspect of this film satisfies you as a human being. I am american and i feel all these **** are the typical american person wanting a over exaggerated hollywood film...do not listen to them.",
      "review_date": "2012-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm not a big fan of Kung Fu or martial arts movies, but \"Ip Man\" really struck to my attention. Sammo Hung has brilliantly choreographed the fight scenes and Donnie Yen was perfect to play Ip Man.",
      "review_date": "2013-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This delightful surprise of a martial arts film is not just your traditional \"good guy gets mixed up in a bad situation\" type of joint (even though it does feature that fundamental storyline to a degree). Wilson Yip's \"Ip Man\" is also anThis delightful surprise of a martial arts film is not just your traditional \"good guy gets mixed up in a bad situation\" type of joint (even though it does feature that fundamental storyline to a degree). Wilson Yip's \"Ip Man\" is also an incredibly important look at a period of history that's gone forgotten by so many for too long - the Second Sino-Japanese War. The film delivers the harsh, yet necessary realities of what happened, whilst also depicting the incredible trials and tribulations that the titular hero undertook throughout this period of history. And that of course means fight scenes, and - dear God - are they incredible to watch. Donnie Yen is a master of his craft and the filmmakers at hand have no doubts as to how to shoot him when he's doing his thing. It all looks so amazing. Just a well-meaning film with great set pieces and an incredible true story to build so many crowd-pleasing moments with. Great stuff.",
      "review_date": "2017-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favorite realistic martial arts movies, and Donnie Yen is a beast! Love that guy. His character (the eventual teacher of Bruce Lee!) is fantastic and I found the plot to be surprisingly good despite initial misgivings. DefinitelyOne of my favorite realistic martial arts movies, and Donnie Yen is a beast! Love that guy. His character (the eventual teacher of Bruce Lee!) is fantastic and I found the plot to be surprisingly good despite initial misgivings. Definitely recommend this to any fans of martial arts movies simply because of the awesome fight sequences.",
      "review_date": "2013-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best martial arts movie I ever saw. I reviewed this movie dozen of times and still wasn't bored. Strong plot based on real story. Thing that impressed me most is fights in this movie are without flying or unhuman acts. It is hardOne of the best martial arts movie I ever saw. I reviewed this movie dozen of times and still wasn't bored. Strong plot based on real story. Thing that impressed me most is fights in this movie are without flying or unhuman acts. It is hard to explain, but for example, compare this movie to Crouching Tiger - no human being can move as Li Mo Bai did, but real masters can definitely move as Ip Man did. Oh, I probably just confused you with my explanations. Just enjoy a movie.",
      "review_date": "2014-09-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great Kung Fu film that popularized both Grandmaster Ip Man (the master of Bruce Lee) and Wing Chun. It's a Kung Fu movie that fans of martial arts films should see. Despite being historically inaccurate, it's cool action scenes overshadow that.",
      "review_date": "2016-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is quite simple, but I have to disagree critics about character depthness. It's really not that bad. For those who haven't watch the movie I highly recommend it. This is a movie with soul and maybe it has a lack of plot in someThis movie is quite simple, but I have to disagree critics about character depthness. It's really not that bad. For those who haven't watch the movie I highly recommend it. This is a movie with soul and maybe it has a lack of plot in some parts but I guarantee that you won't sense it if you let it overwhelm you",
      "review_date": "2015-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wilson Yip's 'Ip Man' isn't the masterpiece a lot of people on this site think it is. It's not bad, but definitely not 'the best martial arts film ever', and other such nonsense.\r Donnie Yen is good as always, balancing the dramatic withWilson Yip's 'Ip Man' isn't the masterpiece a lot of people on this site think it is. It's not bad, but definitely not 'the best martial arts film ever', and other such nonsense.\r Donnie Yen is good as always, balancing the dramatic with the physical. The rest of the main cast are also very good....\rAll except Lynn Hung, who plays Man's wife Cheung Wing Sing. Every scene she's in she's just whining and moaning about something, it's like her entire character arc is based on the notion of being the 'unlikable' one in the film... It's very grating!\r The Direction of the film is pretty basic, nothing really special in it at all. Production values are exactly what you'd expect for a mid-budget martial arts film made in 2008.\r The musical score is very 'by the numbers', a bit of a crescendo here... A bit of dramatic music there.... Sombre music when it's needed....\r The only outstanding things in the film are the fight scenes. Sammo Hung worked as the action director, and choreographed some of the best Wing Chun action put on screen. Hung is well known for being a close associate of Bruce Lee (who was a student of Yip Man), and Hung does a brilliant job of putting the ferocity and speed of this very effective (but particularly vicious and brutal) kung fu style on film\r However, everything outside the martial conflicts is very slow paced and mundane. It's like a porn film, where you fast forward the bits where the plumber checks out the pipes, to get to the actual 'interesting' bits!\r The storyline is predictable, and doesn't really conform to the actual life story of Yip Man anyway. I understand that there needs to be a little artistic license.... But if you're going to make stuff up, don't just make the fight scenes exciting, add some intensity and real drama to the story and the narrative.\r Overall, it's a watch it in its entirety once kind of film. After that you can just go online and look up the fight scenes on YouTube!",
      "review_date": "2016-02-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Energetic and generic, but doesn't make the fact that Ip Man can live up an \"Oh\", an \"Ah\", and a \"Yay!\" like enjoying the movie itself. Give this one a shot.",
      "review_date": "2016-04-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is not Shakespeare and it should not be.  It is emotionally satisfying and meets expectations for a typical martial arts movie.  It reminds of the old cowboy movies only it is martial arts instead of a quick draw.  Shut up, sit back and enjoy.",
      "review_date": "2016-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing film, great characters, felt deep and meaningful and I felt emotional which I don't usually feel with films, and the fights are great. Genuinely one of the very best films I've ever watched.",
      "review_date": "2017-04-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I watched all the Ip Man movies (1-3), and in my opinion this one was the best. I don't know much about Kung Fu, but to me it looked outstanding. In terms of character development, it was relateable and paced perfectly. No one seemed tooI watched all the Ip Man movies (1-3), and in my opinion this one was the best. I don't know much about Kung Fu, but to me it looked outstanding. In terms of character development, it was relateable and paced perfectly. No one seemed too animated or \"exotic\".",
      "review_date": "2018-03-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hard to believe that this iconic martial art franchise started 12 years ago and launched Donnie Yen straight into fame for Western audience. The film is based on the life story of Yip Man, the first person to teach the Chinese martial art ofHard to believe that this iconic martial art franchise started 12 years ago and launched Donnie Yen straight into fame for Western audience. The film is based on the life story of Yip Man, the first person to teach the Chinese martial art of Wing Chun and Bruce Lee's trainer. This film focuses on his struggles during WWII where Japan invaded China.Let's start with what made this movie so popular in the first place, the fight scenes. The choreography is done by the legendary Sammo Hung who manages to craft a a variety of amazing fight scenes in this movie. Every fight in this movie feels different from one another yet exciting and memorable. There are one on one fights with different style of martial arts to fighting against multiple foes to fights where he uses an object to having the surrounding create a different fight. He manages to use different styles to show a characters personality through the fight scenes by having Ip Man elegant style against a much more fast pace and ferocious, villainous fighter. This movie also contains one of the most iconic fights in martial art movie history with Ip Man vs 10 dudes being INSANELY good. Every fight and action scene in this movie is nothing short of BREATHTAKING.Major praise must be given to actor Donnie Yen who plays the titular character. He trained in Wing Chun and learnt about Yip Man mannerism from Ip Man's sons. Donnie Yen gives of a wise, calm and knowledgeable mannerism for Ip Man that makes us believe that this is a master martial artist without having the need to use flashbacks to show this. When emotional moments happen, Donnie Yen is able to show a more aggressive side to the character while somehow maintaining the gracefulness of Ip Man which is astounding. All the supporting actors also do a great job as well with each character having notable traits and personalities that contrast with Ip Man. Having great action scenes is great and all but if the story is not engaging then it won't mean much. Fortunately, Ip man has a phenomenal character driven story. The story begins pre-WWII to show how happy and successful Ip man is before. It gives a sense of his strength and personality within a couple of minutes before it gets into the meat of things, World War 2. The movie doesn't show the invasion but shows the Japan occupation of China and the effect it has on Ip Man. We get to see him struggle unlike at the beginning and show that despite him being invincible in a fight and being able to beat up anyone, his fist can't protect anything anymore. There is a lot of drama within this movie during non fights that blend perfectly with the action sequences. Even during these non fight moments it is never boring and the director successfully keeps us the audience invested in the ongoing predicament. Interestingly enough, the movie manages to have Ip Man who was already somewhat perfect to change from the beginning to the end of the movie. The movie is able to convey a very clear yet important message by the end.The score by Kenji Kawai is very beautiful which is a perfect representation of Ip Man's character. When the action happens it is more sharp and loud with drums which makes the action more thrilling. The cinematography by O Sing-Pui is very vibrant in colors during the pre WWII sequence and very grey and monotone during WWII. He also uses this color template to show how the events are changing and by the end there is a lot more color even when they are still in WWII. The use of color to help tell the story is amazing. The costume and sets are very believable and feel like an accurate representation of China during the invasion.Any flaws I really have with the movie is borderline nitpicking. The story is a very pro-China story and mildly anti Japan. It can feel incredibly cheesy during parts and near the end where they portray China as the all mighty good guys. There are also some side plot that occurs during the movie that kind of feels like padding as it doesn't really relate to the main narrative. Additionally, it also feels really silly and unrealistic compared to the rest of the movie. In the end, this is one of the best martial art movies in decades. It is exhilarating, dazzling and ultimately captivating. If you're a fan of martial arts in general then this movie is a definite must watch. If you're not a fan of martial arts then this movie is still a must watch as there is still something for everyone in this movie.",
      "review_date": "2020-05-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ip Man was recommended to me by my roommate since he knows that Donnie Yen was one of my favorite parts of Rogue One. And, man, I am glad he did. I think that I found this movie so enjoyable primarily because it gave me exactly what I wanted:Ip Man was recommended to me by my roommate since he knows that Donnie Yen was one of my favorite parts of Rogue One. And, man, I am glad he did. I think that I found this movie so enjoyable primarily because it gave me exactly what I wanted: Donnie Yen beating people up, and a lot of it. There is a story and it is pretty good, but there isn't too much fluff and for every slow point in the movie we are rewarded with a very entertaining action scene shortly thereafter. Quite a pleasant surprise, this one was.",
      "review_date": "2018-04-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I enjoyed that movie a lot and I've watched it multiple times.Donnie Yen is my favorite martial artist actor. In this movie the fight scenes respect the traditional Wing Chun fighting style and Donnie execution is flawless.\n\nDonnie does IpI enjoyed that movie a lot and I've watched it multiple times.Donnie Yen is my favorite martial artist actor. In this movie the fight scenes respect the traditional Wing Chun fighting style and Donnie execution is flawless.Donnie does Ip Man justice in a very humble way.",
      "review_date": "2019-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Ip Man' offers itself to us as a martial arts film more interesting and original than it seems at first glance.The scenario (no spoil) allows the staging of a charismatic hero with an excessively powerful tempered character but who only'Ip Man' offers itself to us as a martial arts film more interesting and original than it seems at first glance.The scenario (no spoil) allows the staging of a charismatic hero with an excessively powerful tempered character but who only uses his abilities when it is the only option open to him. In this kind of film it is far too simple to put the hero on a pedestal and make the feature film a series of uninteresting and won fights. Fortunately, this is not the case with 'Ip Man'. The story has its roots in the Sino-Japanese pre-World War II conflict. The historical dimension is very important and brought in an interesting way. The acting is touching and precise, even if some characters are surprisingly undeveloped, such as the wife and son of the main protagonist. The choreographies are pleasant to watch, the impact of the moves is very well rendered with a few exceptions. The general lighting of the film is very good.At the end we realize that the film has stirred up multiple values and stories, so that it seems to bring out less a moral than several morals to remember from the story.",
      "review_date": "2021-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing Kungfu flick!Great music and theme,acting was amazing specially the Master i-p and 2,3 characters,story was decent as per biography,screenplay was Okay but the flow of the movie felt flawed even 100 mins runtime felt too long as perAmazing Kungfu flick!Great music and theme,acting was amazing specially the Master i-p and 2,3 characters,story was decent as per biography,screenplay was Okay but the flow of the movie felt flawed even 100 mins runtime felt too long as per entertaining only fights and The Fights were literally Great & Mind-blowing the Intensity of punches were awesome the wire-work is noticeable but camera work and fast paced action was amazing some fights were amazing like starting fight,challenges and ending,ending came as shocking but satisfying,the conflicts and bullying and ruling of japanese  was nicely captured the emotions were good specially the brothers one!Overall it was Good biography Action was masterpiece but the flow was bad didn't engaged at all as per entertainment.",
      "review_date": "2020-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm not going to bother reviewing each individual movie of the Ip Man series because they are all amazing and it should be watched from start to finish. It's a single continuous story so if you like the first one expect more of the same. IfI'm not going to bother reviewing each individual movie of the Ip Man series because they are all amazing and it should be watched from start to finish. It's a single continuous story so if you like the first one expect more of the same. If you are looking at a review you will be starting with the first movie regardless so here goes.I have no idea what the critics are smoking but these were the BEST martial art films I've ever seen. Don't go into it expecting a historically accurate documentary, take it for what it is. A heart wrenching tale of a family man living his life doing what he loves, through the good times and bad. While beating the heck out of people that deserve it. :P The characters are likable and loathsome in perfect proportions. You'll cheer them on, tear up when they die, and in some cases sit there with a smug grin on your face when the a-holes get taken down a peg. The choreography is worlds above any other film I've seen. While some of the moves are over the top it's so well done that you won't care. It truly makes the impossible seem possible.My only real complaint is that some of the English speaking vocal cast aren't very good actors. I highly recommend watching it in Cantonese with English subs and overlooking the few bad egg exaggerated English voices.",
      "review_date": "2020-07-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis movie is such an ass kicking masterpiece, I know it’s just opinions of the metacritic, but I feel like that this movie deserves a better metacritic score, I’ve been watching the Ip Man franchise since the summer of 2014, I was very impressed with the Wing Chun style, I was impressed with the second, third, fourth and the spin off",
      "review_date": "2020-08-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I’m not going to pretend that Ip Man’s story and character development is that of an epic masterpiece but, why does it have to be? Ip Man is a fun ride that is a bit simplistic but will provide you with incredible action along the way. TheI’m not going to pretend that Ip Man’s story and character development is that of an epic masterpiece but, why does it have to be? Ip Man is a fun ride that is a bit simplistic but will provide you with incredible action along the way. The fights are worth the ride alone!",
      "review_date": "2020-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Ip Man\" fails to rise above the rest of the mediocre, poorly-written martial arts films.",
      "review_date": "2022-04-25",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 42,
  "genres": [
    "Action",
    "Biography",
    "Drama",
    "History"
  ]
}