{
    "title": "Sex and the City 2",
    "rating": 4.1,
    "release_date": "2010-05-27",
    "genre": [
        "Drama",
        "Comedy",
        "Romance"
    ],
    "summary": "Two years after the first Sex and the City film, Carrie, Samantha,  Charlotte and Miranda are still friends struggling through the ups and downs of love, life and shopping from fabulous locales.",
    "critic_reviews": [
        "Sex and the City 2 will never be compared to \"The Godfather, Part II.\" But it's everything a fan could want in a sequel.",
        "So even if Sex and the City 2 consisted of nothing but a two-hour fashion show, it would draw crowds. But it also has the returning cast members in fine comic form, and it has more cutting-edge humor than the first movie.",
        "You don't have to be a fan of Sex and the City to appreciate the kitsch humor here. Part TV-series sequel, part Hollywood sendup, SATC 2 is all satire. It's hard to miss that this film is making gentle fun of itself, of the franchise's materialism, even of its own cinematic allusions.",
        "Although they've left the city behind, the girls haven't forgotten the sex. They're still as frank as ever, as outrageous as ever, as liberated as ever.",
        "Sex and the City 2 is a champagne cocktail on a runaway train -- fizzy, sparkly, giddy-making, and splashing all over the place.",
        "I enjoyed these characters more when they were rich, rather than obscenely rich, when their self-involvement and life crises had one foot on planet Earth -- and when they weren't all gussied up like Mae West in \"Sextette.\"",
        "Frothy as it is, SATC2 is best when it's about the women, not the wardrobe.",
        "A long sit in the shallows, the equivalent of five half-hour episodes strung together.",
        "The Muslim women in “SATC2” are props in the froth. Come to think of it, so are Carrie, Charlotte, Samantha, and Miranda.",
        "Part of the action occurs in the desert, which inadvertently proves apt, since the oases of enjoyable moments -- and they do exist -- suffer from being spaced too widely in what's otherwise a long, arid trek.",
        "If “the gals” have to bow out, at least they try to do it in a sprint -- in their Manolo Blahniks.  It’s a pity nobody told them you can’t run in heels -- in sand dunes.",
        "The \"Fab Four's\" dramadies continue for the audiences who love them. Trouble is the surrounding story and its supposedly fun sojourns are as embarrassing as granny panties.",
        "Yes, this is a great time for escapism at the movies. But there's a point at which escapism throws what we're trying to forget back in our faces.",
        "As Carrie might type on her laptop while giving one of her girly little shrugs, When did Sex and the City become so long and mean so little?",
        "The satire is sagging, the irony's atrophied and the funny is flabby.",
        "A movie gaudy enough to make Dancing with the Stars seem dignified.",
        "This feels bigger and more cinematic than the first film, and sees a progression in the lives of the characters. But many of the jokes are beyond broad, and the Middle Eastern stereotypes are shockingly cack-handed.",
        "Sex and the City 2 isn't a feature film as much as it is consumer porn. The audience is not asked to relate to the characters, or at least what we remember of them, as much as to their shoes, their bags, their apartments, their couture, their stuff.",
        "It's over the top, and over the rainbow. But just like Carrie's worries about the \"sparkle\" leaving her marriage, this movie is like once-brilliant Champagne, carelessly left out overnight. And gone flat.",
        "One wrongheaded jaw-dropper follows another.",
        "A dunderheaded comic melodrama with clothes to die for and dialogue to shrink from. It’s downright depressing.",
        "An insult to the memory of the cleverly written show and its celebration of friendship, it's a slap in the face for the four gal pals (often photographed at unflattering angles) and an affront to Muslims.",
        "The problem lies with the unimaginative story premise and the quip/reverse quip dialogue that just may be better-suited to half-hour television shows than this nearly 2½-hour movie feature.",
        "The most depressing thing about Sex and the City 2 is that it seems to justify every nasty thing said and written about the series and first feature film.",
        "Like its predecessor, SATC2--with a script that's basically a sack full of not very funny gag-lines wrapped in strung-together episodic mini-scenes--is not suited to be a movie.",
        "Some of these people make my skin crawl. The characters of Sex and the City 2 are flyweight bubbleheads living in a world which rarely requires three sentences in a row.",
        "The transformation of the girls from winsome wisecrackers into whiny bling-obsessed chuckleheads is complete.",
        "The biggest sin of Sex and the City 2 is its lack of beauty. It's garish when it should be sumptuous, tacky when it should be luxe, wafer-thin when it should be whip-smart and sophisticated.",
        "Hits a new low of idiocy and crassness.",
        "Sex And The City 2 panders to that audience to the point of self-destruction, squandering whatever goodwill the franchise had left after the first so-so movie by plopping its beloved characters into a series of garish vignettes that throw their shallowness into sharp relief.",
        "It's astounding how a movie this long could accomplish so little.",
        "Twenty minutes in, the movie is already operating at a deficit, and it never recovers.",
        "But the best, most irrefutable reason why Sex and the City 2 deserves one-half a shining star. It’s worse than Sex and the City 1, and that alone is a remarkable achievement.",
        "Sarah Jessica Parker’s Carrie should be a cautionary tale of perpetual adolescence; her character should be out dating any number of Hollywood’s graying beer bellied frat boys. But no. Instead, we are asked to identify and sympathize with a person who gets everything she wants, but complains anyway.",
        "The ugly smell of unexamined privilege hangs over this film like the smoke from cheap incense.",
        "Thanks to writer-director Michael Patrick King, I now have a fair idea how it might feel to be stoned to death with scented candles.",
        "Indeed, this movie's offensive on many levels, but Arabs and Muslims don't get to feel special. It relies on stupid stereotypes because it's a stupid movie that's offensive to virtually everyone.",
        "Real feelings lurk just below the surface--Samantha's terror of growing old, Carrie's fear of eventual tedium in a childless marriage. Yet the surface is where the movie stays, like an old submarine with dead batteries.",
        "And it's true that this movie's absolute tone-deafness, its complete disconnection from our current economic and geopolitical reality, by moments achieves a perverse Warholian profundity."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "This movie does accomplish the goal of being a \"feel good\" movie. The shallow characters make you feel good about your own personality. The selfishness of the characters will make you feel great about how you treat others. The amount of This movie does accomplish the goal of being a \"feel good\" movie. The shallow characters make you feel good about your own personality. The selfishness of the characters will make you feel great about how you treat others. The amount of offensive material toward Arabs will make you feel good about your tolerance toward others. The mere stupity of this film will make you feel smart. This is the only accomplishment of the movie (even if it wasn't intended) and the awful jokes, non-likable characters, and just how tasteless the entire production is only furthers this series to its grave. Most men know that they should stay away but the girl friend or wife will force them to consider attending. Ladies, if you really love your man, you won't subject them to this.",
            "review_date": "2010-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Offensive on so many levels, why do they have to be quite so vacuous?",
            "review_date": "2010-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'd rather watch my own mother beg for mercy, as she is being killed, then watch this movie again.",
            "review_date": "2010-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I had to laugh two or three times. But overall this movie is not funny. I could not see the irony, because the depiction of obscene richness was still realistic. This movie might serve the Taliban for showing their people why they should I had to laugh two or three times. But overall this movie is not funny. I could not see the irony, because the depiction of obscene richness was still realistic. This movie might serve the Taliban for showing their people why they should hate the Western decadence. Otherwise it is a waste of time.",
            "review_date": "2010-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "2.5 hrs of overplayed drivel hell. Here's hoping the vapid haggard SATC characters are now all finally wrapped up in a nice black diamond haze of disappointment..",
            "review_date": "2010-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Reading 'Breakthrough: Eight Steps to Wellness' in Abu Dhabi\" doesn't quite possess the same revolutionary quality as the Azar Nafisi memoir which recounted the transformative effect that western literature had on a group of \"Reading 'Breakthrough: Eight Steps to Wellness' in Abu Dhabi\" doesn't quite possess the same revolutionary quality as the Azar Nafisi memoir which recounted the transformative effect that western literature had on a group of female Muslim students, since Suzanne Somers, star of the \"Thighmaster\" infomercial, is no Vladimir Nabokov, so the deliverance of these women(equally anesthetized by popular cultural just like their western counterparts) is mostly limited to the body, and not the mind. It's a book club comprised of materialistic Islamic fashionistas who end up validating the ill-mannered behavior displayed by these privileged New York socialites, when the middle east-end girls step out of their traditional \"hijab\" attire to reveal the \"haute couture\" fashions beneath like naughty Catholic schoolgirls. Now Carrie(Sarah Jessica Parker) and her gal pals become the role models that they proclaim themselves to be. At a karaoke club, the ugly Americans have the effontery to sing Helen Reddy's feminist anthem \"I Am Woman\", both for themselves as a pointed animadversion of this hyper-patriarchal society, and the local women whom the westerners presume are in need of some consciousness-raising and enlightenment, without understanding that the mobilization of feminist-minded Muslim women may have deadly reprecussions from their oppressors. Samantha(Kim Cattrall), the ugliest American of them all, not only offends the Abu Dhabi men, but the women, as well. In a very public arena, Samantha's demonstrative canoodling with her latest conquest, proves to be an affront to the female bystanders' inherent modesty, which is derived from a sheltered upbringing that deemed such forwardness as justification for an \"honor killing\". To some Muslim females, the headscarf and veil are personal choices. In Diane Crespo and Stefan Schaefer's \"Arranged\", the principal of a Brooklyn middle school denigrates a young Muslim schoolteacher's traditional apparel choices, and offers her shopping money for designer clothes. It never occurs to the culturally biased educator, or \"Sex and the City 2\", that some Muslim women, like American girls who exploit themselves sexually on their own terms, adopt the \"hijab\" without the stigmatizing effect of Koran-sanctioned female subjugation, in which both forms of self-debasement are post-feminist, but nevertheless, subversive acts of emancipation.",
            "review_date": "2010-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's almost as if the producers of the movie never watched the show. I wasn't a big fan of the show but the episodes I watched were infinitely wittier than this crap. Fans of the show will have to settle for watching old DVDs.",
            "review_date": "2010-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I've never seen the show or the 1st movie but was dragged to see SITC2. Basically from the view point of someone looking in from the outside this movie indulges in every boring cliche of divaness imaginable. The characters are flat and I've never seen the show or the 1st movie but was dragged to see SITC2. Basically from the view point of someone looking in from the outside this movie indulges in every boring cliche of divaness imaginable. The characters are flat and the plot revolves around the boring mid-aged insecurities of hipster turned bourgeoisie. How tragic. At 2 plus hours I think I laughed twice.",
            "review_date": "2010-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The most silly and boring flick I have seen lately.",
            "review_date": "2010-06-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's pretty much the worst comedy I have ever watched. It makes Ishtar watchable.",
            "review_date": "2010-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie reminds me of four tweens texting. It is shallow, incoherent, and immature.",
            "review_date": "2010-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "My girlfriend who is a big Sex and the City fan dragged me to this and both of us came out feeling like three hours of our lives were sucked out of us. Why god why?!",
            "review_date": "2010-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don' know why I went to see this. My girlfriend owes me big, especially since she didn't like it either!",
            "review_date": "2010-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am a big Sex and The City fan and I didn't even like this. Its way too long, way too unfunny, and very anti muslim. I want my money and three hours back!",
            "review_date": "2010-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yeah, I'm a guy but I'm also a huge S & the C fan from the beginning. The show was brilliant. and it just got better until it wrapped production. then movie 1 came out. a messy & unnecessary footnote to such a great show. but at Yeah, I'm a guy but I'm also a huge S & the C fan from the beginning. The show was brilliant. and it just got better until it wrapped production. then movie 1 came out. a messy & unnecessary footnote to such a great show. but at least it was entertaining and it had a bit of the old S & the C charm. fast forward to movie 2. Michael Patrick king, i implore you: do NOT create a #3. this latest adventure of Carrie & co. is so anti-S & the C that if you ever watched the show you wouldn't recognize any of the characters. Carrie is married...and whiny. Miranda is bullied...and whiny. Charlotte is a mother...and whiny. Samantha is old...and whiny. get the picture? so they take a cathartic trip to...wait for it...the middle east. where the heat is oppressive and the women simply oppressed. stuff happens, the girls complain, a LOT, they drink a LOT, they spend a LOT. it's as if your best friend becomes a different person you don't recognize anymore. sorry girls, I'm done. i don't want to know what comes next, I'm no longer intrigued. because you are no longer intriguing.",
            "review_date": "2010-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ok, Sex and the City (both films) was never intended to be a smart film about intelligent women taking charge of their own lives and living their lives to the fullest. Oh - wait, YES IT WAS! That's what the whole bs is about \"smart women,Ok, Sex and the City (both films) was never intended to be a smart film about intelligent women taking charge of their own lives and living their lives to the fullest. Oh - wait, YES IT WAS! That's what the whole bs is about \"smart women, independent, blah blah blah\". Well, Sex and the City 2 is one of the most insulting films to women I've seen in a long time.And not just women, but also some specific cultural groups (of both men and women) such as Arabs! I just found it appalling and very annoying.The storyline was decently bad, but the dialogue and the jokes - OMG. WORST FILM DIALOGUE i've seen in a long, long time (as bad as \"Crossroads,\" if not worse).Literally, the only reason why I gave it a 2 and not a 0 is the fact that Samantha is as good as always and there are some really hot guys to look at. Otherwise, this is a headache. Horrible, horrible film.",
            "review_date": "2010-08-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Sex and the City 2 more like S@#tz and the City 2! I hated this sequel as I hated everything in this movie! They shouldn't been ended since the last movie that I enjoy just a little and of course the entire series too. The characters are notSex and the City 2 more like S@#tz and the City 2! I hated this sequel as I hated everything in this movie! They shouldn't been ended since the last movie that I enjoy just a little and of course the entire series too. The characters are not laughable,there are many subplots,and why oh WHY do we have to go over with lots of problems with these ladies? Like boring stuff in issues with their relationships and there plenty of more that is far over the top. And of course they have lots of racism and too controversial when the girls are having a break at the Middle East. It's almost as bad as the Transformers 2 and I'M NOT KIDDING RIGHT THERE,they even more racism like this. WHAT WERE THEY THINKING??? If you see this movie,I DARE you and trust me you won't be happy to see this sequel ever again.",
            "review_date": "2010-10-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What a heaping pile of garbage. Laughably bad. All of it. And this is coming from someone who was a pretty big fan of the show. I really wish this wasn't so terrible, but it was even worse than I had imagined. A true disaster. Unfunny, poorlyWhat a heaping pile of garbage. Laughably bad. All of it. And this is coming from someone who was a pretty big fan of the show. I really wish this wasn't so terrible, but it was even worse than I had imagined. A true disaster. Unfunny, poorly acted, and looks like it was directed by a child. Embarrassing.",
            "review_date": "2010-10-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "You want to like the movie. You watched the series and you even sorta kinda liked the first movie. So you want to like it, you want to make it your summer time special. You want to enjoy it, but it just blows in your face over and over andYou want to like the movie. You watched the series and you even sorta kinda liked the first movie. So you want to like it, you want to make it your summer time special. You want to enjoy it, but it just blows in your face over and over and over again. It's just too much. It's over-done, over-the-top, just like the wedding at the very beginning of the movie. It's over-produced and over-thought. It lacks carelessness and ease, not to mention it crosses over to ridiculousness one too many times. It doesn't have the wit and the smarts the original series had, and you can't find anything in common with Carrie - once always broke because of her shoe addiction, now living in luxury. Before, she couldn't afford to have her apartment renovated, now she's owning two and flying out to Middle East without a blink of an eye. I'm giving it 10, because when you peel all that off - the bad script, the over-produced schemes and the horrible product-placement - you kind of get what the producers wanted to do. There's a good, honest feeling of wanting you to feel entertained there - to leave the cinema with a smile on your face.",
            "review_date": "2011-08-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Well if you are a fan of the series, You might have good moments and some \"SPARKLE\". For those who haven't been through the whole ride, i am afraid they are gonna have a bumpy ride cause there is a whole lot of \"Not SPARKLE\" stuff in thisWell if you are a fan of the series, You might have good moments and some \"SPARKLE\". For those who haven't been through the whole ride, i am afraid they are gonna have a bumpy ride cause there is a whole lot of \"Not SPARKLE\" stuff in this movie. Extremely predictable and lame story with nothing in it to be excited about. And this is coming from a huge ducking fan.",
            "review_date": "2010-08-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Unwatchable drivel.",
            "review_date": "2010-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Breaks my heart to rate this film at such a low score.  But honestly the crew of SATC could have stopped at movie #1 there was no need for #2 and there was certainly no need to base the movie on a trip to abu dhabi .  The film is riddled withBreaks my heart to rate this film at such a low score.  But honestly the crew of SATC could have stopped at movie #1 there was no need for #2 and there was certainly no need to base the movie on a trip to abu dhabi .  The film is riddled with so many over the top sexual innuendos its almost child like that they would think the audience is that stupid.  \"Lawrence my Labia\"   The middle eastern stereotypes were offensive and awkward it was almost like this once smart comedy stepped down and degraded down to a kindergarten level of writing and acting.  So not impressed! You can skip this film for sure.",
            "review_date": "2010-08-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Worst movie of the decade. I've never watched an episode of Sex in City, but I was dragged to this movie. It's shallow beyond belief. It's part fashion show & part travelogue. The movie showcases lots of clothes and Dubai, one Worst movie of the decade. I've never watched an episode of Sex in City, but I was dragged to this movie. It's shallow beyond belief. It's part fashion show & part travelogue. The movie showcases lots of clothes and Dubai, one of those Arab sheikdoms with lots of oil & lots of sand & not much else. Dubai obviously financed most of this film. The sheiks didn't get their money's worth because the Hollywood Jews included the Muslims' oppression of women in the story line. That's the only worthwhile point made in this movie.",
            "review_date": "2010-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For TV yes it passable but on the big screen it was a tease and way to long... the girls make it work but the source material was far from the smart and fun it used to be.",
            "review_date": "2010-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "People don't seem to get Sex and the City 2.  The creators wanted to make something over the top silly and fun, and the movie succeeded.  Yes, it has some eye rolling moments, but this movie is pure escapism similar to old movies from thePeople don't seem to get Sex and the City 2.  The creators wanted to make something over the top silly and fun, and the movie succeeded.  Yes, it has some eye rolling moments, but this movie is pure escapism similar to old movies from the 30's, 40's, and 50's.  I laughed a lot at this film, and the scene where Charlotte and Miranda talk about parenthood in the bar is one of the best dramatic and funny moments in cinema this year.  Also, I don't think these critics were true fans of the original HBO show.  That series definitely had some silly moments as well.  I don't think the movies have been that different from the TV show.  I hope they make more sequels!  There!  I said it and feel EXHILARATED!",
            "review_date": "2011-02-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I think that my organs have stopped working after watching this film. It's not a gender thing, this is just a bad movie that should have gone right to dvd. Excuse me, I have to go cough out my spleen right now.\rRe: ArmandoG PARTI think that my organs have stopped working after watching this film. It's not a gender thing, this is just a bad movie that should have gone right to dvd. Excuse me, I have to go cough out my spleen right now.\rRe: ArmandoG PART THREE!!??!?!?!?\rThat would be genocide!",
            "review_date": "2010-11-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The opening music was suitable for an audience aged 12 to 21. Bad start considering the audience attracted to this film is aged 35+. The dvd cover for this movie has actually photo-shopped Kim Cattrall so much I actually thought she'd beenThe opening music was suitable for an audience aged 12 to 21. Bad start considering the audience attracted to this film is aged 35+. The dvd cover for this movie has actually photo-shopped Kim Cattrall so much I actually thought she'd been replaced by another actress. Were they blind? Now Carrie is meant to be a fashion icon and the first pair of shoes we see are garish brash sequined FAIL heels. Then she's wearing a hideous tiara with crimped hair - again someone was blind. Liza Minelli covering Beyonce Single Ladies was just absolutely woeful and sad. Sam's first sex scene lives up to the hilarity we expect and is the first good scene. The soundtrack for when they arrive in Abu Dhabi was the Stargate Movie soundtrack which was a tad wierd as I kept expecting the SG1 team any minute now. I didn't see this as insulting to Muslims as others have commented. It was four wealthy American women experiencing complete opulence in Abu Dhabi so it seemed ok to me that they didn't know much about the place, the people, the culture...  They didn't actresses justice in this movie, using camera angles, lighting and make-up that made them look old and tired. Miranda and Charlotte really took a backseat in this movie which was a shame. There were a few laughs but not as many as we've come to expect.",
            "review_date": "2010-12-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film is not only offensive to women , or Arabs, but too humanity itself. Non-exisent plot with filled with ruined characters, racism, and midlife crisis like cliches that no one wants to hear about. Ridiculuosly overhyped. Just stay away",
            "review_date": "2012-01-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "People are acting as if Sex and the City is an Oscar Contender. Wake up. It's a feel good sequel, just like the 1st movie was and just like the tv series was. Who cares if it's not realistic. I get enough realism everday turning on People are acting as if Sex and the City is an Oscar Contender. Wake up. It's a feel good sequel, just like the 1st movie was and just like the tv series was. Who cares if it's not realistic. I get enough realism everday turning on the tv set. I don't want my Carrie and Company slumming it. Lighten up people and be grateful for what you asked for. Long live SATC. Can't wait for part 3.",
            "review_date": "2010-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Thoroughly enjoyable. If you're a fan of Sex in the City, you'll love it too. If you're not, you won't. It's what we've come to expect from Sex and the City. It was a lot of fun and even my husband didn't Thoroughly enjoyable. If you're a fan of Sex in the City, you'll love it too. If you're not, you won't. It's what we've come to expect from Sex and the City. It was a lot of fun and even my husband didn't mind it too much (seeing as how he normally doesn't like \"chick flicks.\") I hardly ever go to theaters to see movies, but I'm very glad I went and saw this one.",
            "review_date": "2010-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazingly, this movie was slightly better than my rock bottom expectations. However, it was offensive to Islam and it was too long. They should have cut the Karaoke scenes and added more drama.",
            "review_date": "2010-05-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am so sorry to report that this time I agree with the critics reviews of this movie. I am a huge fan of the show and also love the first movie but when I left the movie theater for SATC2 I felt something about the movie was not quite I am so sorry to report that this time I agree with the critics reviews of this movie. I am a huge fan of the show and also love the first movie but when I left the movie theater for SATC2 I felt something about the movie was not quite right. Something was missing. This show saw massive success because it gave permission for women to speak freely about a wide range of topics on their mind that they may not have normally spoke so freely about before. It was based in a form of reality that many women experience on a daily basis and put it on the small screen for the masses to see. The focus of the show was the four women and their lives as single women and then to women with more stable lives in the end of the series making commitments to their lovers and themselves. Now the series is in the ",
            "review_date": "2010-05-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie was not Oscar worthy, but then, I wasn't expecting it to be. Just the usual entertainment SATC always is: bawdy sexual jokes, lovely scenery and wonderful clothes while pondering questions about relationships, and this time, The movie was not Oscar worthy, but then, I wasn't expecting it to be. Just the usual entertainment SATC always is: bawdy sexual jokes, lovely scenery and wonderful clothes while pondering questions about relationships, and this time, marriage and children.",
            "review_date": "2010-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is pure fun. The plot is less dramatic and is not as deep as the one from the first movie. It's so entertaining with a great cast and a lot of awesome guest stars^^ I am sure everyone can (and should) enjoy this movie for This movie is pure fun. The plot is less dramatic and is not as deep as the one from the first movie. It's so entertaining with a great cast and a lot of awesome guest stars^^ I am sure everyone can (and should) enjoy this movie for what it is, a lovely, funny and romantic comedy. -Maxi",
            "review_date": "2010-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you like the show, you'll like the movie. It is a joy to watch if you are a fan. If you're not a fan, don't go.",
            "review_date": "2010-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's not perfect movie but i sure as heck had fun seeing the girls again. That's the thing about tv characters. After seeing them week after week, you become emotionally invested in them. It's always good to see them again.",
            "review_date": "2010-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Just a great movie, Carrie, Samantha, Miranda and Charlett are back. This movie is not only more realistic then the first one but also the acting is better, the setting is better, the script is better and the plot is MUCH better. Sometimes a Just a great movie, Carrie, Samantha, Miranda and Charlett are back. This movie is not only more realistic then the first one but also the acting is better, the setting is better, the script is better and the plot is MUCH better. Sometimes a little over the top (referring to Samantha in the middle-east, how can it not be!?) but i enjoyed it the whole 140 minutes long. Specially the conversation between Charlett and Miranda about how hard parenthood is was so good! Very funny but o so recognizable!",
            "review_date": "2010-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I attended a preview as a date - I don't know the series well (I may have seen two or three episodes at some point) and I don't know the first movie. While this movie was a bit long, it kept me entertained enough. The gay wedding I attended a preview as a date - I don't know the series well (I may have seen two or three episodes at some point) and I don't know the first movie. While this movie was a bit long, it kept me entertained enough. The gay wedding scene, while over-the-top and filled with stereotype cliches, still amused. The glimpses of Abu Dhabi were interesting. I wasn't expecting to enjoy it at all.",
            "review_date": "2010-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Saw this with my wife and thought it was a 10 for a chick flick. Funny, silly, cute.",
            "review_date": "2010-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I saw it last night in a packed movie theater full of excited fans -- it was great fun. Stop taking everything so seriously or trying to review this film like it's supposed to be some masterpiece. It was entertaining & I very much I saw it last night in a packed movie theater full of excited fans -- it was great fun. Stop taking everything so seriously or trying to review this film like it's supposed to be some masterpiece. It was entertaining & I very much enjoyed. I hate this bandwagon mentality.",
            "review_date": "2010-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Seems the male critics were the harshest doesn't it? Most of the women critics were fairly bitchy, probably stemming from the fact they can't come close in looks or money of these actresses. This movie was a go for all of the SATC Seems the male critics were the harshest doesn't it? Most of the women critics were fairly bitchy, probably stemming from the fact they can't come close in looks or money of these actresses. This movie was a go for all of the SATC fans. What did the critics want, for the girls to stay locked in their 30's and never grow up or older? Once again - we love to build people up to tear them down. Go see for yourself!!!",
            "review_date": "2010-05-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was expecting this movie to be abysmal after reading the reviews, but I was moderately entertained. With such great characters and some snappy dialogue, there was some ample humor to offset its overlength. Overall, a modestly successful I was expecting this movie to be abysmal after reading the reviews, but I was moderately entertained. With such great characters and some snappy dialogue, there was some ample humor to offset its overlength. Overall, a modestly successful effort and one worth seeing if only once.",
            "review_date": "2010-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "People, seriously? As someone who watched the entire series, every season, and repeatedly enjoys reruns, this movie perfectly embodies the not only the original characters but also is realistic in showing their growth and what they People, seriously? As someone who watched the entire series, every season, and repeatedly enjoys reruns, this movie perfectly embodies the not only the original characters but also is realistic in showing their growth and what they experience. Carrie has ALWAYS been cheesy and could be whiny too when it came to Big. Samantha, is totally Sam, complaining about her age and focusing on how to keep herself young. Charlotte, really? Go back and watch the show again, she is exactly who she's always been and Miranda has developed since becoming a wife and mom and this movie show her being able to enjoy the person she is now. Ughhh! I could go on and on, debating the irrelevant comments left here, and discussing why the movie is so great! Is it exactly what it was intended to be.",
            "review_date": "2010-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie was good for what it was (a decadent girls-only escape)... but there was not enough Sex and not enough City. Very bold move taking the movie out of NYC... Stanford and Anthony's wedding was in CT (which is understandable, with The movie was good for what it was (a decadent girls-only escape)... but there was not enough Sex and not enough City. Very bold move taking the movie out of NYC... Stanford and Anthony's wedding was in CT (which is understandable, with their union not currently being possible in New York) and then the girls take off on their trip. I definitely would have liked to see more of the City featured in the film. I would have loved to see more Aidan, more Smith, and more Stanford & Anthony post-ridiculous wedding (I was not a fan of the Liza Minelli performance). The scene with Miranda and Charlotte bonding over mommyhood was the best scene of the movie by far. I could have done without the many braless nanny scenes (seeing those things bouncing around once was enough), the karaoke scene, and Carrie had way too many ridiculous puns and whiny moments. Charlotte was also pretty annoying... since when does this confident woman not trust her loving husband?? Samantha and Miranda were the best characters in the flick by far. Kim Catrall is absolutely hilarious, and I was happy to see Cynthia Nixon having a good time being Miranda again. I am hoping for a third installment where they focus on the ladies living their lives in NYC. We want that cozy feel of the series and the first movie that we know and love!",
            "review_date": "2010-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Just as fabulous as the first! loved it! Very entertaining.",
            "review_date": "2010-05-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Forget the reviews...if you loved the show..you'll at least like the movie and love the relationships of all our fave characters. Again, don't listen to all the haters! Watch for yourself...and decide.",
            "review_date": "2010-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nA mind freedom, wisdom and human nature is what this movie is about. The heart wants what it wants and nothing is going to stop it. A movie you need to feel.",
            "review_date": "2010-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As a huge SATC fan who loved the series along with the first film, this movie was a HUGE disappointment.The most genuine scene of this film is when Miranda and Charlotte are drinking at the hotel bar and enjoying each other's company andAs a huge SATC fan who loved the series along with the first film, this movie was a HUGE disappointment.The most genuine scene of this film is when Miranda and Charlotte are drinking at the hotel bar and enjoying each other's company and talking about real things. The rest of the movie is pure crap when you compare it to the precedent. Hopefully, if they make a third - it will take place in NYC where it belongs with the usual wit, glamour and sparkle of where the characters came from.",
            "review_date": "2011-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie make that  women look stupid,  this movie has no story, no developmen, nothing this movie is as empty as the first one, Michael Patrick King must the worst movie director ever",
            "review_date": "2011-10-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm surprised how entertaining and skillfully made the movie was for a guy like me. I pretty much watched it to see something exotic to what I usually see, and it delivered on the entertainment front, as well as the peek into a world that II'm surprised how entertaining and skillfully made the movie was for a guy like me. I pretty much watched it to see something exotic to what I usually see, and it delivered on the entertainment front, as well as the peek into a world that I usually avoid. As such, I recommend checking it out, but there is no truth to the portrayal of Arabs, and there is no mention of the women who find the Arab (conservative) culture to be empowering. Instead, the movie depicts the non-excessive people as submitting to the excessive rich women. That is a false and borderline deluded message. There also wasn't any focus on solving anything. The only woman who comes across as analytically smart is the red-haired one, who also uses her professional knowledge to help her friends. There are also few showings of moral integrity. The lead character shows a few heroic acts, but apart from that, it mostly follows the women as they turn off their brains and act on instincts.",
            "review_date": "2014-06-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Includes the line \"Lawrence of my labia\". 'Nuff said.­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­Includes the line \"Lawrence of my labia\". 'Nuff said.­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­­",
            "review_date": "2016-01-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Genuinely among the worst movies ever made. All parties involved should be ashamed. And I say this as a die hard fan of the show...SATC2 is deeply offensive on MULTIPLE levels (e.g. women, Muslims, Arabs, discerning viewers) and casts a darkGenuinely among the worst movies ever made. All parties involved should be ashamed. And I say this as a die hard fan of the show...SATC2 is deeply offensive on MULTIPLE levels (e.g. women, Muslims, Arabs, discerning viewers) and casts a dark shadow over the series' legacy. It's contrived, horribly oblivious to privilege, and nearly unparalleled in the depth of its ethnocentricity.",
            "review_date": "2019-04-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "We got different intents coming here to search for an app to track our partner or friends so it’s advisable to know the truth and not fall prey to the evil ones. I have been in a long distance marriage because of the nature of my job, myWe got different intents coming here to search for an app to track our partner or friends so it’s advisable to know the truth and not fall prey to the evil ones. I have been in a long distance marriage because of the nature of my job, my husband cheated on me times without number but since I wasn’t around to get him caught red handed in the act I decided to hack his cell phone to get all the data activities on his device. I got in contact with knoxtech00 (@) gmailcom through the head of the IT department in my workplace. According to him, after a long search on here he got to discover this genius and swift IT personnel, this guy is the best in the game right now. He shared me his contact info, After I got in contact with him, we made a deal and i paid him. I doubted the services at first but what I felt impossible became possible within 6hours,I got access to my husband’s phone activities,I don’t know how he did it but it looked like magic cause it was as if I had his phone in my palm. I got access to his Snapchat messages and videos, WhatsApp,instagram,Facebook,call logs ,video chat , text messages etc all in one swipe. I’m happy I got to discover the truth, knowing is better than self doubt. He is definitely the real deal, do not hesitate to reach out to him at knoxtech00 (@)gmailcom for a perfect, quality and satisfactory spying and investigatory services.",
            "review_date": "2020-09-14",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 93
}