{
  "title": "Tangled",
  "rating": 8.4,
  "release_date": "2010-11-24",
  "summary": "A princess stolen from her parents' castle as a baby, Rapunzel is locked in a hidden tower longing for adventure Now an imaginative and determined teenager, she takes off on a hilarious, hair-raising escapade with the help of a dashing bandit. With the secret of her royal heritage hanging in the balance and her captor in pursuit, RapunzelA princess stolen from her parents' castle as a baby, Rapunzel is locked in a hidden tower longing for adventure Now an imaginative and determined teenager, she takes off on a hilarious, hair-raising escapade with the help of a dashing bandit. With the secret of her royal heritage hanging in the balance and her captor in pursuit, Rapunzel and her cohort find adventure, heart, humor, and hair... lots of hair. (Walt Disney Pictures)… Expand",
  "critic_reviews": [
    "They really pulled out all the stops on this one.",
    "Tangled would be a satisfying adventure on plot and 3D sensations alone.",
    "And now with Tangled, a delightfully fresh spin on \"Rapunzel,\" the entertainment powerhouse delivers its first classic-caliber computer animation outside the Pixar family.",
    "The story should be a standard mismatched-couple-falls-in-love tale, but the script and the sprightly directing give the story plenty of snap and humor, and the animation is so luminously beautiful that even a falling-in-love sequence cribbed in part from The Little Mermaid is overwhelmingly magical.",
    "Not just a pretty face; there's meat on its bones and a song in its heart besides. This deserves a place up there with the best of Disney's previous fairy tales.",
    "Ultimately, the film is made for longevity, like all the best Disney titles are. However, it's also a ready-made Broadway show, with numbers, dialogue and even drama-club histrionics all pre-packaged for immediate adaptation to stage.",
    "There could have been more side trips on the road to self-discovery, but the plentiful lessons and derring-'do make Tangled a lock for playground pastimes. And maybe even some knotty parent-kid chats about finding your part in life.",
    "The tale of Rapunzel gets a cheeky make-over in this gorgeous Disney animation, which combines the studio's traditional hand-drawn look with the sculptural qualities of digital 3D.",
    "This is your basic, and very enjoyable, Disney princess musical, an empowerment tale to teach bright, dreamy girls how to grow to maturity - and outgrow the adults in charge.",
    "The film is picture-book pretty and fairly conventional, except for the 3-D, which is emerging as a convention in its own right. Still, the prettiness comes with brains, and the whole production, like those newly eye-catching models of American-made cars, bespeaks resurgent confidence.",
    "Disney's spirited re-telling of Rapunzel in 3D animation turns out to be a dazzler.",
    "Though not exactly innovative, Tangled has a snappy pace and the Broadway-style appeal of classic Disney fare.",
    "One thousand points of light never looked so fetching.",
    "Bright and engaging, and blessed with two superb non-verbal non-human sidekicks, Tangled certainly is more like it.",
    "There's also a Disney den of big, comically dumb-looking bad guys who turn sweet when Rapunzel sings to them. Because Happily Ever After never goes out of fashion",
    "The updated version of the familiar tale strikes a nice balance between humor, adventure and romance, making it a movie that will appeal to the whole family.",
    "Animated musicals are only as good as their songs, and this one isn't on a par with \"Beauty and the Beast\" or even \"The Princess and the Frog.\"",
    "Much as I enjoyed this diversion, I couldn't help but think that The Princess and the Frog had better songs and (hand-painted) animation, and that Mulan was a ripping adventure that didn't need tweaking to qualify as an action flick.",
    "As a melding of new techniques and technology with old-fashioned methods of storytelling, it's an opportunity for the Magic Kingdom to remind audiences that, when it comes to putting fairy tales on screen, they remain on a higher level.",
    "Tangled packs old-fashioned Disney magic as endless as Rapunzel's locks.",
    "The story had great optics but not a lot of action, I suppose, though as a child who walked around in towel-fashioned headdresses to simulate the long hair my mother wouldn't let me have, Rapunzel's was the story I longed to thrill to on the big screen.",
    "It takes a bit of doing, but when Tangled's core sweetness asserts itself and the film dares to wear its heart on its sleeve in a climactic scene featuring 46,000 paper lanterns, it's been worth the wait.",
    "A passably entertaining hodgepodge of old and new animation techniques, mixed sensibilities and hedged commercial calculations.",
    "Tangled is the 50th animated feature from Disney, and its look and spirit convey a modified, updated but nonetheless sincere and unmistakable quality of old-fashioned Disneyness.",
    "Tangled is snappily paced and easy enough to get wrapped up in, propelled by a set of jaunty, serviceable songs from venerable composer Alan Menken and lyricist Glenn Slater.",
    "The movie's real accomplishments are in its look, which was generated inside a computer but is as warm and rich as a painting.",
    "Tangled is a lively, funny, deft and delicious musical in the vein of Disney's 1989 classic \"The Little Mermaid.\"",
    "Tangled is lovely to look at, but if you're not a pre-teen girl, you may be distracted by the split ends.",
    "The movie has a field day with thousands of airborne lanterns, a troop of Neanderthal thugs (one is a mime), some surprisingly fleet camerawork, and good editing. I can't think of a cartoon more confident about how to use jump cuts for comedy. Those senses of cleverness and innovation merely underscore how shopworn the rest of this movie is.",
    "Visually, this toon is all over the place. Rapunzel's glowing hair can look alarmingly like fiber-optic cable, but some backgrounds are the computer-generated equivalents of Disney's golden-age work.",
    "Disney knows how to bewitch a crowd, but the sense that Tangled was made more by corporate mandate than artistic spark remains constant throughout.",
    "As Disney animated features go, Tangled is middling.",
    "There aren't that many songs this time - just a handful, reprised ad infinitum. You get to sing most of them, so I'm sure you've noticed how bland they are.",
    "Tangled is a serviceable kids' picture and marks a milestone in the history of Disney animation, but it's splitting hairs to characterize it beyond that."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I went into \"Tangled\" skeptical and unsure of what to expect; I left extremely pleased and impressed with Disney's efforts. As an animator myself, I was blown away by the quality of the animation and the detail that obviously went into eachI went into \"Tangled\" skeptical and unsure of what to expect; I left extremely pleased and impressed with Disney's efforts. As an animator myself, I was blown away by the quality of the animation and the detail that obviously went into each and every one of the models. The animation in this movie is top-notch, and deserves any praise that it gets in terms of technical execution. The script itself contains a fairly typical Disney love story that I must admit - I rolled my eyes at, especially upon realizing that it was a musical. However, the comedy  truly won me over - I was cracking up consistently throughout the entire film. The audio engineering behind the movie and its soundtrack was also great; The voice acting is nearly perfect, the audio is crisp and clear, and though some of the songs were forgettable, none of them were a chore to watch. Essentially, I have no complaints about this film - and I am very critical of animated films, especially coming out of Disney. This may very well be a top contender right alongside Toy Story for animated film of the year. 10/10, would love to see again.",
      "review_date": "2010-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved the film; its story, animation, music, and humor were all superb. Maybe worthy of the Disney 'Renaissance era' and proves Disney still has it in them when it comes to producing an excellent all around animated film for all ages. ItI loved the film; its story, animation, music, and humor were all superb. Maybe worthy of the Disney 'Renaissance era' and proves Disney still has it in them when it comes to producing an excellent all around animated film for all ages. It holds up too as it's still great after multiple viewings over the past year.\r Highly recommend it.",
      "review_date": "2012-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ol' school Disney is back ! :) You get the princess, funny animals, songs, bad guys and of course the happy end. On top of that, a gorgeous presentation. Some moments are genuinely magical, if you're in the mood. I'd recommend this movie forOl' school Disney is back ! :) You get the princess, funny animals, songs, bad guys and of course the happy end. On top of that, a gorgeous presentation. Some moments are genuinely magical, if you're in the mood. I'd recommend this movie for kids, families, but also for adults, if you like that Disney magic.",
      "review_date": "2011-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tangled is charming, hilarious, well animated and just fun. It doesn't have very memorable music but a few songs will get stuck in your head, and Mandy Moore gives a fantastic voice performance and the whole film just ends up being a wholeTangled is charming, hilarious, well animated and just fun. It doesn't have very memorable music but a few songs will get stuck in your head, and Mandy Moore gives a fantastic voice performance and the whole film just ends up being a whole lot more deep than most would think or even expect. I give this film 92%.",
      "review_date": "2012-01-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The biggest suprise of 2010, did not expect it to feel like a classic and/but feature some of the best animation in recent years. Funny, charming and actual good songs (unlike princess and the frog). Up there with Toy Story 3 and How to TrainThe biggest suprise of 2010, did not expect it to feel like a classic and/but feature some of the best animation in recent years. Funny, charming and actual good songs (unlike princess and the frog). Up there with Toy Story 3 and How to Train Your Dragon. This film was a moderate hit in the U.S. (it did amazing internationally) but I expect it to do much better in the future",
      "review_date": "2012-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is amazing. Action, comedy, romance, good characters, and who can forget, a horse eating an apple. At first, I thought this movie was going to be crap, but when I saw it, it was a beautifully made masterpiece I will never forget.",
      "review_date": "2012-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this movie, I always have a good feelling when disney release a new princess. I lo ve the way is focus the \"Rapunzel\" story, I liked this \"new perspective\" about the princess wants to go oue and took the iniciative, not wating forI loved this movie, I always have a good feelling when disney release a new princess. I lo ve the way is focus the \"Rapunzel\" story, I liked this \"new perspective\" about the princess wants to go oue and took the iniciative, not wating for prince who rescue her. I love the concept. Excellent movie for me.",
      "review_date": "2012-07-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Even though I freaking love disney animated movies, I had low expectations for this because by looking at the trailer, I thought they'd fill the movie with lame pop culture references and jokes. Boy, was I wrong! This movie pays perfectEven though I freaking love disney animated movies, I had low expectations for this because by looking at the trailer, I thought they'd fill the movie with lame pop culture references and jokes. Boy, was I wrong! This movie pays perfect tribute to all the great Disney movies from the 30s, 40s, 5s, and 60s by using great modern touches.",
      "review_date": "2011-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe movie certainly does have some good things in it, and I really do recommend watching it, but I can't help but feel that some things are missing. First of all, for a Disney villain, Gothel isn't a very memorable villain (she felt more like an annoying old woman). Also, none of the songs were even memorable like other animated Disney movie (maybe kids who watched this movie today may argue with me years from now about this point). Despite my few complaints, the movie is indeed solid, with a good plot and character development, just don't expect something as magical as Disney's 2D animated classics.",
      "review_date": "2011-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Tangled is Disney's 50th animated picture is Sweet , Clever and Charming as it is astounding and never misses a beat from its visuals to its heart and humor. I enjoyed the film from start to finish and i'm sure this is a movie everyone will\"Tangled is Disney's 50th animated picture is Sweet , Clever and Charming as it is astounding and never misses a beat from its visuals to its heart and humor. I enjoyed the film from start to finish and i'm sure this is a movie everyone will love\" .. A-",
      "review_date": "2011-02-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this movie. I had high hopes and they were definitely meant. This is a classic Disney fairytale and one that has been sorely missed in the annual collection of films that the big studios have been pumping out. I've loved the recentI loved this movie. I had high hopes and they were definitely meant. This is a classic Disney fairytale and one that has been sorely missed in the annual collection of films that the big studios have been pumping out. I've loved the recent Disney Pixar films and even a few of the Dreamworks movies but there's been a big gaping hole where a family oriented, moral driven, and fun film that has quality songs used to be every year. Keep up the good work Disney! The theater I was in was packed with kids and they were all laughing up a storm.P.S. originally the first trailer I saw with the Pink's \"Trouble\" really turned me off from seeing this film. If there's someone else who feels that way, don't let that trailer deter you from seeing \"Tangled\"",
      "review_date": "2010-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing animation. The movie was very cute & funny, & left me impressed, due to my expectations that it was not going to be a mind-blowing movie. The best parts of the movie were not even in the ads. The horse was hilarious, the soundtrackAmazing animation. The movie was very cute & funny, & left me impressed, due to my expectations that it was not going to be a mind-blowing movie. The best parts of the movie were not even in the ads. The horse was hilarious, the soundtrack was intense & well-fitting, the storyline & plot was never dull & always never unexpected nor predictable. Amazing movie that exceeds expectations. Please see this movie, & people of all ages should like it!",
      "review_date": "2010-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Though a touch slow at first, once this movie really begins it shines. Beautifully animated, with a very wonderful \"Into the Woods\" vibe, this film was a little bit of everything wonderful, making it easily rewatchable. It's fun and full of energy.",
      "review_date": "2010-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Before I saw Tangled, Toy Story 3 was for me the best animated film of 2010. But after I watched it, I was blown away how much this film is fantastic. Mandy Moore has a extremely beautiful voice, as well as Zachary Levi, and that can be seenBefore I saw Tangled, Toy Story 3 was for me the best animated film of 2010. But after I watched it, I was blown away how much this film is fantastic. Mandy Moore has a extremely beautiful voice, as well as Zachary Levi, and that can be seen from the plane. There is not need for nothing more to be said, an amazing film.",
      "review_date": "2011-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing, amazing, amazing!  Funny, adorable, engaging.  And I'm 44. I have and would recommend this to anyone. Totally worth a full price ticket any day.",
      "review_date": "2010-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was bored on a weekend so i thought i'd go see tangled, at that time i had heard already how great it was so i watched it with very high expectations, i am glad to say it went above and beyond what I expected from a princess movie.I was bored on a weekend so i thought i'd go see tangled, at that time i had heard already how great it was so i watched it with very high expectations, i am glad to say it went above and beyond what I expected from a princess movie.  needless to say this was the BEST movie I have seen all year.  this movie has everything that you need to make an instant classic.  I would recommend this movie to anyone over 5. it is just Fabulous.",
      "review_date": "2010-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My friends and I really wanted to see Tangled ever since the previews and we were not disappointed. I loved the art style. it displays top-notch 3d animation in 3d but still echos the charm and cuteness of classic 2d Disney animation. TheMy friends and I really wanted to see Tangled ever since the previews and we were not disappointed. I loved the art style. it displays top-notch 3d animation in 3d but still echos the charm and cuteness of classic 2d Disney animation. The story is great too. It is packed with comedy drama and some really dark themes harking back to the Grimm's fairy tale it is based off. The songs aren't bad either. They were surprisingly catchy, not 'hakuna matatata' or 'under the sea' catchy but still really great. I think this is everything Disney fans have been waiting for since Beauty and the Beast. It is as creative, gorgeous, and fun as the classics before it while showing cutting edge technological animation techniques. Rapunzel is definitely my new favorite Disney princess.",
      "review_date": "2010-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I enjoyed Tangled very much. The animation was great, and the humor is perfect for all ages. I went with my aunt (I'm 13, my aunt's 23) and we were both laughing. I would most definitely recommend this to anyone of any age.",
      "review_date": "2011-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What to say? It's Disney... and now is back to the basics... the classics! That old one which we grown up with...! A really brave princess, that goes beyond any boundary... a ''kinda'' prince who realices what is draming all about and twoWhat to say? It's Disney... and now is back to the basics... the classics! That old one which we grown up with...! A really brave princess, that goes beyond any boundary... a ''kinda'' prince who realices what is draming all about and two little but really important comic characters: Max and Pascal we've got what's expected, and what HAS BEEN BEING EXPECTED from a long time ago... a CLASSIC... humor, love, and over all of this... a great dream to fulfill!!!!",
      "review_date": "2011-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very beautiful. That's what I can describe about the film, the characters, the environment, the story, although it is modified from the original, but it is quite good. More over, this film is very fun, I can find a lot of laugh in it.Very beautiful. That's what I can describe about the film, the characters, the environment, the story, although it is modified from the original, but it is quite good. More over, this film is very fun, I can find a lot of laugh in it. Nevertheless, the original music of the film is just a little \"over mediocre\", which is not match so much with the whole fascinating film. If Walt Disney had given the better music, this film would have been one of the greatest animation that they've ever created. Never mind, 9.0 points for their effort and let's hope they can make better film in the future!",
      "review_date": "2011-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Disney strays from its self-esteem centered story work while sticking to its sacrificial hero helping a brave damsel in distress, and it works very well.  Outside of a big gripe I will discuss later, Disney still seems to have some sort ofDisney strays from its self-esteem centered story work while sticking to its sacrificial hero helping a brave damsel in distress, and it works very well.  Outside of a big gripe I will discuss later, Disney still seems to have some sort of magic when it doesnâ",
      "review_date": "2011-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "So, I'd seen the previews for this movie...and thought it might be O.K.But tonight I caught it with a couple of friends, and must say, Wow, it Blew Me Away.\n\nHow witty is Rapunzel! She was adorable from the get-go! I loved her. TheSo, I'd seen the previews for this movie...and thought it might be O.K.But tonight I caught it with a couple of friends, and must say, Wow, it Blew Me Away.How witty is Rapunzel! She was adorable from the get-go! I loved her. The beginning of the movie reeled me right in...until the final scene. A wonderful magical journey of a kidnapped princess.This movie was SO GOOD!I saw it in 2D, but I hear it's even better in 3D.See this movie.",
      "review_date": "2010-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best and hilarious movie made by Disney! I'm not really into princess stories with boring songs dumb innocence and typical handsome true love... but this movie got me tangled.",
      "review_date": "2012-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is no secret that I am a fan of Disney movies. I don't care what anyone thinks; I like good animation and a good story. It also no secret that Disney is one sided when it comes to movies geared to girls than towards boys. The boys get crapIt is no secret that I am a fan of Disney movies. I don't care what anyone thinks; I like good animation and a good story. It also no secret that Disney is one sided when it comes to movies geared to girls than towards boys. The boys get crap while the \"princesses\" have a whole park dedicated to them. So I was a little happy to hear that Disney was doing its version of the story Rapunzel but instead calling it \"Tangled\" because they were going to try appeal to coed audience. How on earth did they expect to do this? I mean the movie is about an 18 year-old girl with long blond hair, little boys aren't interested in that at allâ",
      "review_date": "2010-12-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When I saw previews to \"Tangled\", I honestly didn't have any interest to see it. It's just that Disney isn't the same anymore, I missed the Cartoon Animated types of Disney I wasn't getting into the CG Disney. I do like Toy Story, FindingWhen I saw previews to \"Tangled\", I honestly didn't have any interest to see it. It's just that Disney isn't the same anymore, I missed the Cartoon Animated types of Disney I wasn't getting into the CG Disney. I do like Toy Story, Finding Nemo, Wall-E, Up, and others from both Disney and Pixar. But it still doesn't give me that Disney feeling, I don't see the magic and imagination it use to have. \"Princess and the Frog\" and \"Winnie the Pooh\" were the last Disney Animated films I saw, and I really enjoyed them. But my parents got \"Tangled\" on Blu-ray, and I still disproved it so much. They were begging me so much to see it, so I finally broke down and watched it. The only thing I need to be completely honest is that I am a complete moron. This movie brought back the magic and imagination that I missed and waited for Disney to do, and I regrettably disproved it so much. I really wish I saw this in theaters, I was blown away by everything about it. I loved how it explains a lot on Rapunzel's childhood and why her hair keeps growing, it made a lot of sense. Then it gets better when the adventure begins, and finally see's her unforgettable cult to her kingdom. I felt heartbroken to see the King and Queen get emotional before they throw the lantern's for their lost daughter's birthday. Rapunzel never knew that all of that was about her, and its the main reason why she wants to go to that kingdom. I loved the characters, I really loved Flynn Rider and Maximus the horse. The animation, I honestly forgot about the CG, it was mostly 2D and it looked great. I don't know what else to say, but I really loved this movie so much. I just saw it for the 1st time just now, I'm gonna see it again many times more. But still, OH GOD I just wish I saw it in theaters. This was the Disney Animated film I've waited for, and I'm so happy to see that it still has that feeling and the heart for our dreams to come true.",
      "review_date": "2012-05-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I went in thinking that this would be another kids movie that puts you to sleep. I can say I was wrong I really enjoyed it. It was well done, funny and kept me on my seat the whole time. animation is awesome the actors had me laughing theI went in thinking that this would be another kids movie that puts you to sleep. I can say I was wrong I really enjoyed it. It was well done, funny and kept me on my seat the whole time. animation is awesome the actors had me laughing the whole time. It was really nice to an \"old school\" movie with all the singing. I almost forgot that all movies used to be like that. I recommend this for a family movie night.",
      "review_date": "2011-04-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Admittedly, I haven't seen a Disney movie for a while, so the magic and wonder hit me pretty hard. I watched this one last night before going to sleep, and I'm still thinking about it. I think it was an awesome movie, and it was veryAdmittedly, I haven't seen a Disney movie for a while, so the magic and wonder hit me pretty hard. I watched this one last night before going to sleep, and I'm still thinking about it. I think it was an awesome movie, and it was very romantic. It's really hard to get a good romance in an animated film, and this was done excellently. Yes, I am female. The style was very casual, a la The Incredibles or Cars thanks to John Lasseter, so the magical bits just became that much more magical. I give this a two thumbs up, and I will probably have to watch it again and cry some more.",
      "review_date": "2011-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Beautiful, fresh, this movie it's just amazing, the plot is incredible and the end is just perfect, I liked a lot the first time I saw this movie, and it's still one of my favorite animation movie",
      "review_date": "2013-08-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another great production by Disney, detailing strong morals and creating memorable characters. Although the story is very cliché, it has been spiced up with sub-stories and humorous encounters.",
      "review_date": "2013-04-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fantastic return to form for Disney. Tangled has got to be one of the best modern Disney movies (not including any Pixar  titles.) Great visuals, funny characters, great story, and some of the best dialogue in an animated feature in a longA fantastic return to form for Disney. Tangled has got to be one of the best modern Disney movies (not including any Pixar  titles.) Great visuals, funny characters, great story, and some of the best dialogue in an animated feature in a long time (well, at least from Disney.)\r Overall:\rA fantastic Disney movie that shows what Disney is all about. A true Disney Classic.",
      "review_date": "2013-04-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tangled is a good and enjoyable film. There are lots of hectic moments and lots of old fashioned action. It makes the twist with Rapunzel at the right moment. If you are a die hard animation-comedy fan you will absolutely enjoy this.",
      "review_date": "2013-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As a 19 year old man, I'm not usually the one for disney movies but this movie was fantastic and I loved it from start to finish (I know i'm late), but definitely a must watch!",
      "review_date": "2014-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My favorite movie of all time. Good clean humor! Really wonderful animation and dynamic and realistic characters.  Mandy Moore was the perfect pick for Rapunzel. This movie will make you laugh and cry. Must buy.",
      "review_date": "2013-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As the film starts, so will I start by saying that I really like the frame narrative. Everybody will be able to connect with it because of its reminiscence with bed-time stories, and it neatly ties the beginning and the ending together.As the film starts, so will I start by saying that I really like the frame narrative. Everybody will be able to connect with it because of its reminiscence with bed-time stories, and it neatly ties the beginning and the ending together.\r Throughout the film, there's a great momentum of action, singing and character building. The film succeeds in portraying likable, believable and funny characters that, although they may be cliché-esque types, do convince. The dialogues too may make you suffer from a certain feeling of déjà-vu, but they are witty, and the songs are enjoyable (props to Mandy Moore), with the usual accompanying trademark funny scenes. The voice-acting is top-notch, as are the sound-effects and the soundtrack, which provides just the right tune for just the right occasion. Going on about aesthetics, the animations were colourful and enchanting with jaw-dropping detail (which makes for an awful lot of beautiful screenshots for fans).\r The story is no big mystery or surprise, even for those who are not familiar with the fairytale itself. The film however, does a great job of keeping it interesting with several sub-plots and an occasional plot-twist. It is the story about the confrontation between a naive teenager and the world, and also about the adolescent's growing awareness for the other sex. Tangled is a great example of the genius, albeit quite clichéd Disney formula of success on its best. We recognize the story of a sympathetic protagonist searching for freedom, and exploring the world. He or she encounters several evil characters on the journey, but in the end wins out over them, not only because of his or her intelligence and perseverance, but also by charming others with their innocence, likability and lack of prejudice.\r This mix of elements forms the basis of the trademark Disney formula, with which Disney here proves they utterly ace the art of pleasing a mass audience, all age categories included.",
      "review_date": "2014-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A bit late on the review, but might as well contribute my love eventually for this movie somewhere. I absolutely love this movie, I grew up with Disney and I have to say, this movie has complete potential to be a part of the Disney classics!A bit late on the review, but might as well contribute my love eventually for this movie somewhere. I absolutely love this movie, I grew up with Disney and I have to say, this movie has complete potential to be a part of the Disney classics! It came to be my favorite of them all, which is shocking to me since I was so set with sticking with the classics! While it does have that fairy tale theme, it has a huge modern touch to it. Rapunzel is no damsel in distress, and Flynn is no typical male hero of the story, no love at first site involved, and certainly has good qualities young girls of this generation can look up to. The music in this movie is just amazing to me, despite the mix reviews it's had, I still find my self humming the tunes here and there. Easily Tangled has potential to hit the Broadway's, which shocks me that it hasn't! Tangled is officially something special that will live in my life and home forever and something I hope my own children and theirs will love as well.",
      "review_date": "2014-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is really fun. It's super original and worth watching. I'm pretty sure that I've watched it about five times or so myself. It's just that good.",
      "review_date": "2014-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great music, Singing and acting! Other Disney Masterpiece by the creators! A Comedy and a musical that works very very very very very very very very very very very awesome!",
      "review_date": "2014-05-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie. It takes classic Disney animation and storyline (look and feel), and gives it a modern sprucing up and some twists. Tangled has several layers of humor (child, teen, adult), some depth, and a lot of action. It's something forGreat movie. It takes classic Disney animation and storyline (look and feel), and gives it a modern sprucing up and some twists. Tangled has several layers of humor (child, teen, adult), some depth, and a lot of action. It's something for everyone, and one of my favorite movies (animated or not) in the last several years.",
      "review_date": "2010-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A friend of mine asked me, Is thiz movie worth-watching? I said, Go and find out for yourself. It is Disney anyway.  Not every year, Disney introduces us to their new princess. It is going to be a magical time of your life, get ready to beA friend of mine asked me, Is thiz movie worth-watching? I said, Go and find out for yourself. It is Disney anyway.  Not every year, Disney introduces us to their new princess. It is going to be a magical time of your life, get ready to be part of the history. Do you remember how wonderful is Snow White, Cinderella, princess Aurora the Sleeping Beauty, Ariel the Little Mermaid, beautiful Belle and The Beast, Aladdin princess Jasmine, Pocahontas, Mulan, up to last year Princess Tiana and her Frog? It is the time! For long-haired Rapunzel (Mandy Moore) to get out from her hidden tower, to leave vicious mother Gothel and has some adventures with her prince, errr.. I mean runaway bandit, Flynn Rider (Zachary Levi). It is also for the first time, princess Rapunzel will face the unfriendly outside world, but do not worry, she got her frying pan to protect herself and accompanies by very cool chameleon, Pascal and the white horse with dog capability, Maximus. The song When Will My Life Begin reflects that adventure spirit. The Directors are Nathan Greno and Byron Howard. Both of them had ever worked together in dog tale BOLT (2008). But I think the person that deserves the posthumous achievement to bring thiz German fairy tale comes alive is no other than Alan Menken. Menken is the regular Disney genius composer who can always provide delightful classic elements into every piece of his magical music or score. The storyline is so smooth and dynamic. Yeah it is predictable, but at least you could enjoy the joyful comedy, it is always fun to watch how Rapunzel and silly Flynn Rider tease each other. And although without dialogue, the animal characters, the chameleon Pascal and the horse Maximus are also doing an exhilarating slick slapstick performance. For visual excitement, the picture has been beautifully rendered to another level, you will be amazed by how realistic each texture and detail it has been made, the hair, the grass bit by bit. The most powerful scene is The Floating Lanterns Night Scene, when finally Rapunzel and Flynn were in the boat right outside the castle, waiting for the glow flying lanterns to be released. In that romantic moment, you could feel the pure sincerity and so much loves between them, through their innocence face expressions and breathtaking interaction with the background song: I See the Light.  That scene simply gives you goosebumps and could easily bring tears in your eyes. It is very rarely, there is a movie that could touch my heart. Thiz one is definitely the one. Usually if someone asks me, Who is your favorite Disney Princess? Most of the time, I would answer, Cinderella! But after thiz movie, maybe I would give a different answer. By the way, I always love the girl with the long hair ^_^ It is certainly Disney knows best!\r Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com",
      "review_date": "2011-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tangled is a fantastic movie!  Disney did not market this movie right.  I didn't realize it was a musical until we were watching it.  I don't know why Disney didn't market it as a musical--if I had known it was a musical, I would have seen itTangled is a fantastic movie!  Disney did not market this movie right.  I didn't realize it was a musical until we were watching it.  I don't know why Disney didn't market it as a musical--if I had known it was a musical, I would have seen it opening weekend.  It was so nice to finally see another Disney animated musical with music by Alan Menken again.  I really like the music, but I wish someone with a stronger voice than Mandy Moore was playing the lead.  There were a few plot holes I noticed, but it was still highly enjoyable.  I would gladly see it again, while it's still in the theatre even.  I will definitely buy the DVD.",
      "review_date": "2011-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Disney always gets it right, they really do. Though i guess there is some minor criticism for Tangled: it runs a bit slow in the beginning, and the musical pieces are not exactly blockbusters. But who cares... it's got everything a modernDisney always gets it right, they really do. Though i guess there is some minor criticism for Tangled: it runs a bit slow in the beginning, and the musical pieces are not exactly blockbusters. But who cares... it's got everything a modern American cartoon needs: simple enough to keep the kids on track, enough adult humor to keep the adults entertained, and a very charming and heartwarming story to pull it together. Some of the sideshow-character development is stupendous, including Maximus the horse, and the gang of Ruffians. You don't need kids to go see this... I can tell you that personally... I don't have kids, but my girl and I had a wonderful date night... Enjoy.",
      "review_date": "2010-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This one really surprised me. Was expecting a stupid Disney movie by the trailers. But it was extremely well done. Just as enjoyable for the adults as for the kids, without relying on any of the usual crass humor I've come to expect. NothingThis one really surprised me. Was expecting a stupid Disney movie by the trailers. But it was extremely well done. Just as enjoyable for the adults as for the kids, without relying on any of the usual crass humor I've come to expect. Nothing in it that I felt my kids shouldn't see. Good message. Strong roles.  A great story  good complexity in the mother/ daughter role for adults and discerning kids to appreciate. Thoroughly enjoyed this one.",
      "review_date": "2010-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not a bad animation for Walt Disney's  'princess' franchise, but it certainly lacks the purity the old animations (Beauty and the Beast, Little Mermaid) had.",
      "review_date": "2011-09-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tangled gloriously showcases Disney's return to top-form. It's deeply heartfelt, smart, funny and looks simply gorgeous. The voice actors' performances are great - Mandy Moore's Rapunzel and Zachary Levi's Flynn Rider have great chemistry,Tangled gloriously showcases Disney's return to top-form. It's deeply heartfelt, smart, funny and looks simply gorgeous. The voice actors' performances are great - Mandy Moore's Rapunzel and Zachary Levi's Flynn Rider have great chemistry, Donna Murphy makes Mother Gothel delightfully amoral, and the most memorable Disney villain in years, and the rest of the cast, including Ron Perlman, Brad Garrett and Jeffrey Tambor all appearing to be having an immense amount of fun in their roles. The real scene-stealers, however, are not characters with dialogue (though their animalistic expressions are expertly provided by Frank Welker), but the royal horse Maximus and Rapunzel's pet chameleon Pascal - with the possible exception of Meeko and Flit from Pocahontas and WALL-E, they make two of the most entertaining mostly-silent animated characters in film history. The story is energetic and engaging, the characters compelling, the songs are catchy (particularly \"Mother Knows Best\" and \"I've Got a Dream\") and you'd have to have a heart of stone to hold back tears at the tender and beautiful lantern extravaganza scene. It's always pleasing when Disney get the balance of entertaining both adults and children just right, something they certainly achieve in Tangled. It's a hugely fitting 50th animated feature for Disney, and here's hoping they can maintain this standard in the future, and never return to the mediocrity that has plagued many of their films in the last decade.",
      "review_date": "2012-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm a HUGE fan of Pixar movies, and I must say that - with the help of the Pixar guys - Disney managed to do as good, if not better (animation is just incredible !). This movie is also a great success for my daughters (2 and 9), my wifeI'm a HUGE fan of Pixar movies, and I must say that - with the help of the Pixar guys - Disney managed to do as good, if not better (animation is just incredible !). This movie is also a great success for my daughters (2 and 9), my wife too... The blu ray is very impressive on a HD TV (if you have to chose between BD and DVD).",
      "review_date": "2012-06-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When I first heard of Tangled, I automatically turned my nose up due to the fact that it was a disney movie that involved Rapunzel. I was happily proven wrong when I watched it the other week. I like how disney managed to make it appealing toWhen I first heard of Tangled, I automatically turned my nose up due to the fact that it was a disney movie that involved Rapunzel. I was happily proven wrong when I watched it the other week. I like how disney managed to make it appealing to both boys and girls with a male and female role who both have an equal importance to the film. The film also combines great action scenes with broadway style songs and typical disney princess story telling. \"Chuck\" Star Zachary Levi voices the charming yet idiotic bandit Flynn Rider while pop star turned actress Mandy Moore plays the sweet rapunzel. this film is perfect for both the young, old and everywhere in between. I must watch and Ten times the quality on Blu-Ray",
      "review_date": "2012-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Went to see this my one of my cousins from Albany, New York and my siblings enjoyed it. So did I. Animation was excellent, Acting was top-notch, songs are memorable, and setting was amazing. This movie is Disney's greatest creations since TheWent to see this my one of my cousins from Albany, New York and my siblings enjoyed it. So did I. Animation was excellent, Acting was top-notch, songs are memorable, and setting was amazing. This movie is Disney's greatest creations since The Lion King and The Hunchback of Notre Dame.",
      "review_date": "2011-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I forgot Disney movies use to have singing!!!  There are so many animated films out now that it is easy to forget that Disney movies are normally musical (especially when you assume all animated films are from Disney).  The first song startedI forgot Disney movies use to have singing!!!  There are so many animated films out now that it is easy to forget that Disney movies are normally musical (especially when you assume all animated films are from Disney).  The first song started and I thought, \"dear lord there's singing I thought they stopped doing that.\"Needless to say I spent the first portion of the movie kicking myself for wasting my money but as the movie progressed it got better.  The characters were great and likable.  There were a few funny parts.  I think if you go with children they will find it hilarious.",
      "review_date": "2010-12-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a childrens movie and it made me leave feelig warm. Disney has done a great job with this story that has never been done surprisingly. This movie is one I will suggest to all adults with young children to enjoy it with. VeryThis movie is a childrens movie and it made me leave feelig warm. Disney has done a great job with this story that has never been done surprisingly. This movie is one I will suggest to all adults with young children to enjoy it with. Very well done to all te participated with this movie. It was great!!",
      "review_date": "2010-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I wasn't really sure what to expect with this movie, while I was excited for it I was worried it would let me down, but it did no such thing, it's funny and charming, the only complaint I have is the songs are cheesy and I didn't really likeI wasn't really sure what to expect with this movie, while I was excited for it I was worried it would let me down, but it did no such thing, it's funny and charming, the only complaint I have is the songs are cheesy and I didn't really like them all that much, but there aren't that many so I can't complain all that much, a must see.",
      "review_date": "2011-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yes!! Finally a Disney film that has the same magic as the real classics (The Lion King, Beauty and the Beast, The Little Mermaid, Aladdin etc) The story is easy, yet good, and the characters are lovable. The songs are very good (Alan MenkenYes!! Finally a Disney film that has the same magic as the real classics (The Lion King, Beauty and the Beast, The Little Mermaid, Aladdin etc) The story is easy, yet good, and the characters are lovable. The songs are very good (Alan Menken did a good job writing the songs) and they are performed well. If you want to see a real Disney Animation movie, well, see this, cause Tangled is pure magic; Disney magic :)",
      "review_date": "2011-06-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely horrible. Princess this, princess that. I love you. This movie was unfunny and a waste of 1 and a half hours. The reason why I gave it a 1 is the 3D effects were pretty sweet. But the overall story was horrible.",
      "review_date": "2011-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While it is hard to say that \"Tangled\" was a bad film, it is definitely easy to say that it had a number of critical flaws. It is understandable that it would be cheesy and all, it is a Disney film after all. However, that does not mean thatWhile it is hard to say that \"Tangled\" was a bad film, it is definitely easy to say that it had a number of critical flaws. It is understandable that it would be cheesy and all, it is a Disney film after all. However, that does not mean that NONE of the conventions of Disney films shouldn't (at least attempted to) be broken. It has the very typical narrative and plot direction, and one can see it from a mile ahead. Girl and boy meet, girl falls for boy, boy falls for girl, villain separates them by tricking them, girl disappointed and heart broken, boy comes to save the day, and they live happily ever after. Granted, it does have the reversal of the boy saves girl, where Rapunzel actually saves the boy, but nonetheless it is rather typical. The animation is beautiful with some great work done here. The original score was decent enough, and there were some nice songs, out of which I've especially enjoyed \"Mother is Right\" and \"I See the Lights.\" Overall, though, with the predictable plot, and really annoying ways of maintaining the typical, mainstream view of what a fairytale is (unlike, for example, Shrek), it ultimately fails to provide us with anything that might be rewarding or challenging at the end. It ultimately comes down to be a good film for kids, but offers very little for adults, except of a cosy film with some nice songs and beautiful visuals. And sometimes that's just enough, but most of the time it just doesn't quite cut it to be a \"good\" film. 5/10",
      "review_date": "2011-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Don’t take this review the wrong way I’m not saying that Tangled is a bad movie it was entertaining. The reason why I am not giving this movie a higher score is because outside of the animation there was nothing really special about thisDon’t take this review the wrong way I’m not saying that Tangled is a bad movie it was entertaining. The reason why I am not giving this movie a higher score is because outside of the animation there was nothing really special about this movie. If you like these fairy tale stories where there’s a princess, a hero, and a villain and do not care how formulaic its plot it is or if you’re a little kid (especially if you’re a girl) than you’ll enjoy this movie a lot. As for me I fail to see anything amazing about this film. While Tangled isn’t bad its not amazing either. The reason why I gave Toy Story 3 a 9/10 was because it took a typical Toy Story plot and did something interesting with it (growing up, Lotso’s backstory, the furnace scene, and the ending). While fans of this sort of story will love Tangled I do not see this film becoming a classic anytime soon.",
      "review_date": "2013-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I went to this movie with fairly low expectations because I thought \"The Princess and the Frog\" from last year was mediocre.  I love animation so I check out most releases.  This turned out to be Disney's best feature in awhile.  It certainlyI went to this movie with fairly low expectations because I thought \"The Princess and the Frog\" from last year was mediocre.  I love animation so I check out most releases.  This turned out to be Disney's best feature in awhile.  It certainly helped that the music was WAY better than the Frog movie.  The humor is elevated high enough for both children and adults to enjoy, and some of the animation is amazing - particularily the scene where they let go of the lanterns while on the boat.  At first you might roll your eyes at all the impossible tasks the princess can do with her hair, but after awhile you just go with it.  It is a fairy tale after all.  The movie doesn't quite reach the level of \"Toy Story 3\" or \"How to Train Your Dragon\", but it's very close.",
      "review_date": "2010-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Strictly mediocre fare; it has its moments, but a lot of the movie just doesn't flow well, the plot feels contrived, and the central conflict is not very strong. The wicked witch's power in this movie was -stabbing people-. I mean, really?Strictly mediocre fare; it has its moments, but a lot of the movie just doesn't flow well, the plot feels contrived, and the central conflict is not very strong. The wicked witch's power in this movie was -stabbing people-. I mean, really? What kind of evil magic user is that?The music was very cheesy, and while the animation was beautiful, I can't really say that this is a great movie. Its a children's movie and nothing more.",
      "review_date": "2011-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "with a 260 million budget you could at least bribe half of the movie critics out there. No seriously, 260 million? what the hell did you guys do with all that money???",
      "review_date": "2011-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good, not great, just average. Movie for the family, mainly kids. some laughs, some singing, happy ending as usual. Good revamp of the story rapunzel.",
      "review_date": "2010-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie, \"Tangled\", displays many pieces of humor, which did make me laugh throughout the movie. Although, \"Tangled\", does represent a repetitive and lagging plot. Despite the humor, it did contain repetitive dialog and bland character's.This movie, \"Tangled\", displays many pieces of humor, which did make me laugh throughout the movie. Although, \"Tangled\", does represent a repetitive and lagging plot. Despite the humor, it did contain repetitive dialog and bland character's. Furthermore, \"Tangled\" is a movie that your 1 year old daughter will enjoy, but if you have a child over the age of 4 this movie will be a boring sitcom to them  This movie contains mainly not dry humor but even wet humor and is the least bit dramatic and has a plot that I would not recommend to somebody fond and familiar with a good film. There was fantastic animation in the film which I came into the movie surprised and pleased. But even though of the animation, Disney's of a great fairy tale turned out to be a far worse film.",
      "review_date": "2010-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another gem brewed up by Disney as they fail to disappoint. Great voice acting with characters you can't seem to hate.  A film that teaches a little about becoming independent when it is dearly needed.",
      "review_date": "2011-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tangles is an entertaining fairy tale sure to entertain any family. It has adventure, romance, and original plot (thank you!). The only issues I found were the following:The lack of thematic content, sure it had some interesting idea's, butTangles is an entertaining fairy tale sure to entertain any family. It has adventure, romance, and original plot (thank you!). The only issues I found were the following:The lack of thematic content, sure it had some interesting idea's, but it didn't make its point very well. In doing this it also blurred the line on whether it is right to trust your parents. This (in my opinion) could have been fixed if they had pushed their point or at least asked the question more clearly.",
      "review_date": "2011-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Cute movie, but the music was SUPER cheesy. I liked the horse the best. I think it was a good movie, but not original enough like Wall-E or Finding Nemo...waiting for the next big one!",
      "review_date": "2011-03-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Tangled' I actually thought that in places was quite funny. A good piece of animation that rarely ever happens, probably not the best animated film I have ever seen but I did enjoy it.",
      "review_date": "2011-10-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Behold. Disney has made a landmark in cinema. There are few times in history of visual arts where a feat such as this is accomplished. Apocalypse Now created a film that felt like being in a Vietnamese war zone. Raging Bull managed, with aBehold. Disney has made a landmark in cinema. There are few times in history of visual arts where a feat such as this is accomplished. Apocalypse Now created a film that felt like being in a Vietnamese war zone. Raging Bull managed, with a camera, to make you feel as if you had been punched square in the jaw. And now, Tangled has done something once thought impossible as well: Disney has created a Mandy Moore film that doesn't suck. (pause). I apologize for that build up to a silly punch-line, but I would have never forgiven myself if I didn't write it. Oh, the movie? Yeah, it's pretty good.",
      "review_date": "2011-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After years seeing only modern adaptations of fairy-tales, it was good to see the traditional story coming to alive on screen. Of course, that makes the film quite predictable with a lot of cliches included. Nevertheless,  the cast isAfter years seeing only modern adaptations of fairy-tales, it was good to see the traditional story coming to alive on screen. Of course, that makes the film quite predictable with a lot of cliches included. Nevertheless,  the cast is talented, the music is good and the visuals are one of the best I've seen on a cartoon.",
      "review_date": "2011-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "6 & 9 year old kids liked it and so did the wife and I. But overall the story is pretty forgettable and not very well executed. Good family flick if you are looking for one, though.",
      "review_date": "2011-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its probably not as refined as Princess and the Frog but Tangled can appeal to a larger audience because of the action and extra plot elements involved.",
      "review_date": "2012-05-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Disney's Tangled is their first departure from the usual 2D animation movies they have made especially for the Princess saga of stories. With Pixar style/quality of visuals and design - Disney has done a marvelous job in creating this movie.Disney's Tangled is their first departure from the usual 2D animation movies they have made especially for the Princess saga of stories. With Pixar style/quality of visuals and design - Disney has done a marvelous job in creating this movie. This is absolutely the beginning of a new era for Disney and it looks like its gonna be a great one.",
      "review_date": "2015-05-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAbsolutely, searingly horrible. I'm never going to get that time back. This movie attempts to be funny and made viewers laugh but utterly and horribly fail at it. Also it's extremely unrealistic besides the magic hair and what not.  In a life time someone couldn't grow 70ft of hair, it's impossible and even if they did there would be a lot of dead ends to it and it wouldn't be so pretty. My older sisters adores this movie but the plot is lame, rushed, and stupid. Hair couldn't make someone come back to life and everything moves much to fast. One moment Finn meets Rapunzel the next he's in love with her and doesn't want the damn crown back. The characters are pathetic because they have no personality and what little they do have is always changing and swinging back and forth. One moment Finn is the bad, the next he's the awesome, amazing prince for Rapunzel. Where is this movie leading I asked myself as I watched it. No where was the answer. The music is lame and the whole theme is overdone. Especially the part in the tavern when all these mean, rough tough guys turn into soft marshmallows. It's very unrealistic. Don't be stupid and waste your time watching this.",
      "review_date": "2011-11-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Inadvertently I have watched this two Disney animations hand-in-hand (TANGLED is from the orthodox Disney branch while BRAVE is its flagship Pixar production), which seems to be a perfect paradigm to juxtapose them together and to dissect theInadvertently I have watched this two Disney animations hand-in-hand (TANGLED is from the orthodox Disney branch while BRAVE is its flagship Pixar production), which seems to be a perfect paradigm to juxtapose them together and to dissect the state-of-the-art tendency of the mainstream genre (enormously profitable  since its chief target are zero in on family with children, so it has a much more important and instructive obligation other than merely an entertainment for the toddlers and above). Coincidentally both films' heroines are princess (Rapunzel in TANGLED and a Scottish Merida in BRAVE), adapted from Grimm Brothers' tale, TANGLED is supremely reminiscent of Disney's other established princess analogs trapped in a magic world, let's say Snow White, Sleeping Beauty and Cinderella, what's more, there will always be a prince-charming to deserve and requite her love. Wisely Rapunzel's Flynn Rider has been sizeably modernized as a reckless, self-mocking yet conservatively \"Disney\" prince with a thief background. But in BRAVE, Merida is a much more radical rebel by blood, she doesn't have or need a prince with white horse (the film doesn't care to proffer one since all her tribe suitors are one-of-a-kind wackos), she is fighting against her predestined life path which her mother has arranged for her and her status has requested her, a tad thread-bone notwithstanding, but chronicling with a single-linear arc, the mother-daughter predicament has slipped to the hanging-by-a-thread situation when a magic spell transfigures the Queen's appearance into a bear which cannot be recanted after the second sunrise, therefore, instigates an intimate bonding phase for the two, viscerally the mutual love only exudes when something unusual happens, while living in the mundane life, we are all suffering and grated by the love with a insurmountable generation gap.    Rapunzel, on the other hand, her main barrier is the ultimate breakthrough from her \"mother\" Gothel (a greatly overlooked Donna Murphy), who raises her and locks her up in the tower for 18 years, treats her as her own out of a selfish but very understandable motivation (to rejuvenate her youth), but out of any sequential transition, all of a sudden Rapunzel miraculously remember her princess identity (she was taken away when she was an infant, so I doubt there is any memory there, more like an implausible epiphany or actually a screenwriter's block), what's more unbelievably awkward is that she immediately snarls back to her \"mother\" as if all the recollections of Gothel's evil scheme has been replayed in front of her eyes and she has been tortured for all that year long (actually she is fairly happy and content alone with her cutesy chameleon) , which I deem as a child's play, very much panders to its core audience of pre-school demography.   So, from a vantage point under the contemporary context, BRAVE is far more daring and enthralling from its \"no guts no glory\" premise, it is able to identify with a way broader audience, which is also the main ingredient of the winsome recipe \"why Pixar can keep excelling all its peers (if not itself) on the top-tier of the hierarchy\", in spite of that on a technical level, all the major animation studios in Hollywood (DREAMWORKS, BLUE SKY STUDIOS, etc.) are almost equally cutting-edge. Music is Disney's strong suit, the first half of TANGLED is a conventional musical showcase, culminating the saccharine romance with the Oscar-nominated theme-song I SEE THE LIGHT, fusing with an intoxicating lanterns-all-over-the-sky spectacle,  this has always been the tactic to emit Disney's overblown sentimentality, I am certain it is no longer an all-age proof method now. In BRAVE, although Kelly Macdonald and Emma Thompson's heavy Scottish accents do not get along with my ears, the exotic score and tunes are generally agreeable, and what's more admirable, it doesn't steal the thunder of the film per se. Honestly speaking after the astonishingly-acclaimed WALL-E (2008, 9/10), UP (2009, 9/10) and TOY STORY 3 (2010, 9/10), I automatically skipped last years CAR 2 (2011), BRAVE is a left-field choice, the scale of the story has been slimmed down to a quite unimaginable mother-daughter clash, even grafting it on the most platitudinous soil of a princess's tale. But by good fortune, the film doesn't smear Pixar's paramount reputation, Merida goes through a well-deployed rite-of-passage and the sub-plots such as the blue wisps, the ancient lore of the discontent brother and the witch's hut are all positioned into the right niche to uplift the mythology and idiosyncrasy of the film. As for TANGLED, Disney will never relinquish its tradition (otherwise Walt Disney will definitely be jumping inside his tomb), and it is also an exquisitely-made piece of work, just unfortunately paled by comparison by BRAVE since there is no sparks glittering and all the chirpy happiness seems synthetic and a bit stale.",
      "review_date": "2012-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pretty good movie. Usual Disney Fare. Happy ending, you know what's going to happen. However made me laugh a lot. Didn't see it in theaters but its still pretty good on netflix. Watch it with your kids, or watch it with a couple guys and makePretty good movie. Usual Disney Fare. Happy ending, you know what's going to happen. However made me laugh a lot. Didn't see it in theaters but its still pretty good on netflix. Watch it with your kids, or watch it with a couple guys and make fun of the plot holes, either way your going to have fun with this one.",
      "review_date": "2012-01-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tangled is unquestionably the funniest animated Disney movie in a very long time, with such deliciously quotable lines as \"I'll have you know this is the strangest thing I've ever done!\" (spoken while wielding a frying pan in a fight againstTangled is unquestionably the funniest animated Disney movie in a very long time, with such deliciously quotable lines as \"I'll have you know this is the strangest thing I've ever done!\" (spoken while wielding a frying pan in a fight against a horse wielding a sword in its teeth). The writing is some of the most clever I've ever seen in an animated film, though at times this works against the movie: some scenes push past witty into overt self-parody, which seems to conflict with the story's emotional core.\r All the same, coming at the end of a near-decade-long Disney slump, with fantastic animation, excellent voice work all around, hilarious writing, enjoyable songs, and a strong story with very likeable characters, it's definitely a return to the same sort of quality we saw in the Disney Renaissance. The biggest problem the movie has is a tendency to act too much like Dreamworks and not enough like Disney, and even that is mostly just a nagging background worry.",
      "review_date": "2014-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tangled gets the animated children's movie right. It's funny, heartwarming, and watchable for anyone who loves the movies. If not for Toy Story 3, it'd be the best animated film of the year.",
      "review_date": "2012-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Bravo, Walt Disney Pictures, Bravo! #5 on my Animated Films list...truly a wonderful movie. Disney's 2nd best to only Beauty and the Beast! The music is lovely and reminded me of everything I loved about Disney as a kid! It's that goodBravo, Walt Disney Pictures, Bravo! #5 on my Animated Films list...truly a wonderful movie. Disney's 2nd best to only Beauty and the Beast! The music is lovely and reminded me of everything I loved about Disney as a kid! It's that good people, don't miss it!",
      "review_date": "2012-12-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Classic Disney-style fairy-tale that it is, Tangled sets itself right in the aura of mediocrity that has accompanied Disney these last years (ever since their abandoning classic vignette in favour of CG, in fact). They do try to change theirClassic Disney-style fairy-tale that it is, Tangled sets itself right in the aura of mediocrity that has accompanied Disney these last years (ever since their abandoning classic vignette in favour of CG, in fact). They do try to change their m.o. with snappy \"modern\" dialogue, but the elements that characterise Tangled are the usual recipe, evil stepmother included. We've seen this story so many times now it's pointless to try and see it with new eyes.\r All in all, Tangled is neither here nor there, meaning it's average and with 200 million dollars of budget at least the CGI could be a little more spectacular.",
      "review_date": "2014-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Highly recommended! Everyone who's a Walt Disney fan, should watch this animation for sure! It's funny,romantic and beautiful adventure that you shouldn't miss!",
      "review_date": "2013-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think that Tangled is not back to basics. Disney Renaissance passed away. \"Tangled\" is a good beggining for...I don't know. \"Bolt\" is good, \"The Princess and the Frog\" is regular but \"Tangled\" is better. Disney goes a new direction and itI think that Tangled is not back to basics. Disney Renaissance passed away. \"Tangled\" is a good beggining for...I don't know. \"Bolt\" is good, \"The Princess and the Frog\" is regular but \"Tangled\" is better. Disney goes a new direction and it gets to innovate. Fairy tale with traditional basis but it's modern at same time. Good film, Rapunzel is the new classic character in Disney.",
      "review_date": "2013-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n\"Tangled\" tells the tale of a traditional (yet modern-like) fairy tale, and in most cases it works more modern. As technology has advanced, and the minds of the young children have changed, \"Tangled\"'s modern turn to a fairy tale somehow is able to work. \"Tangled\" suffers from its songs, which, although is composed by Alan Menken, the composer of classics such as \"Beauty and the Beast\" and \"The Little Mermaid\", is not up to par with them.  Its song may not be memorable, but the story is not at all bad. The story focuses from the fairy-tale character Rapunzel  whose golden locks are beautifully animated. Rapunzel and her \"savior\" (yes, another story where the prince saves the princess) Flynn Rider have a funny chemistry and although it focuses on comedic acts, its still enjoyable. Pascal and Maximus are my favorites, as they are the comedic sidekicks that do their purposes well. The ending is a typical Disney one, and in my opinion, is so old. I'll give you a hint  cured by love. Well, I guess that's okay... I was debating on a 7 to an 8 and due to the fact that it has romantic moments and an good plot, I would have to give it an 8. If only they had half's on Metacritic.",
      "review_date": "2013-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "when I was at the theatres watching the movie i was late and missed the start when the baby gets stolen I preferred it more not knowing she was the princes.",
      "review_date": "2013-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tangled unravels with originality.\rTangled is an wonderful take of a classic fairy tale. The movie is anti climatic at times, but succeeds with its good pacing and well executed animation. The plot is fine, and the movie is enjoyable.",
      "review_date": "2013-11-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWhile the beginning is interesting and funny, the ending is rushed, boring, and predictable. The last few songs made me want lie down and fall asleep. The whole princessy 'true love' concept is much too overdone and I think it's time Disney would think up something a little more original. Also, I found it strange, that in the end, Rapunzel wouldn't at least be slightly distrought at the fact that the woman whom she thought was her mother for eighteen years, suddenly became dust and fell out of a window. Very unrealsitic and much too much 'mushiness'",
      "review_date": "2013-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "girly films are just sick and too much  for me . at least the only girly film i love frozen . but tangled is okay but it is kinda disapointing . ...........................",
      "review_date": "2014-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While the animation doesn't present itself as anything special compared to that of the classic \"Disney masterpieces,\" Tangled still holds itself up strongly with cleverly written songs, likable characters, and of course a wonderful additionWhile the animation doesn't present itself as anything special compared to that of the classic \"Disney masterpieces,\" Tangled still holds itself up strongly with cleverly written songs, likable characters, and of course a wonderful addition to the ever growing amount of Disney Princesses.",
      "review_date": "2014-05-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I know I'm about 3.5 years late, but this movie is one of my FAVORITE Disney Princess movies! I'm so upset that I didn't watch it in theaters when it first came out. Everyone I know LOVES this movie. I can honestly say that I don't know aI know I'm about 3.5 years late, but this movie is one of my FAVORITE Disney Princess movies! I'm so upset that I didn't watch it in theaters when it first came out. Everyone I know LOVES this movie. I can honestly say that I don't know a single person who dislikes this movie. Even my 46-year-old father and 16-year-old brother thoroughly enjoyed it; they quote lines from the movie all the time! I highly recommend this movie. It's absolutely phenomenal and great for all ages!!",
      "review_date": "2014-04-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tangled is another great movie made by Disney. It has a surprisingly smart script, beautiful visuals, and some great songs too. All this leads up to Tangled's surprisingly dark final scene. Overall tangled may not rank to be one of theTangled is another great movie made by Disney. It has a surprisingly smart script, beautiful visuals, and some great songs too. All this leads up to Tangled's surprisingly dark final scene. Overall tangled may not rank to be one of the greatest disney movies but it is still an amazing fun filled movie.",
      "review_date": "2014-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When i saw this movie, i shocked. this seemed to say \" animation is just for children. it's for you.\"  I falled in that movie. It has a good story and charming characters, Yujin and rapunzel. during movie time, I saw that the thrill and niceWhen i saw this movie, i shocked. this seemed to say \" animation is just for children. it's for you.\"  I falled in that movie. It has a good story and charming characters, Yujin and rapunzel. during movie time, I saw that the thrill and nice adventure that two main characters exprience very pleasantly.\rIt is the Best animation movie i have seen ever.",
      "review_date": "2014-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I liked this movie but I don't love it. The songs aren't as memorable as other Disney songs. Although some elements were a little too cute, the movie was clever, and the voices were about perfect.",
      "review_date": "2015-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Disney's 'Tangled' is a movie I did not expect to like, but ended up loving it...and I'm a guy!\r This movie is famous for being the first \"Disney Princess\" movie to be animated with 3D computer technology, something Pixar is known for. ThisDisney's 'Tangled' is a movie I did not expect to like, but ended up loving it...and I'm a guy!\r This movie is famous for being the first \"Disney Princess\" movie to be animated with 3D computer technology, something Pixar is known for. This movie does have some of the best animation I've seen in any animated movie.\r The story is pretty similar to the fairy-tale \"Rapunzel\", but there are some changes. A drop of sun light fell from the heavens and grew a magical flower that glows every time you sing to it, this flower has the power to bring anything you desire. There is an old woman who dreams of looking young forever, and every time she sings, she ages backwards to her satisfaction.\r In the kingdom, the royal couple were about to have a baby, but when the mother falls ill, the people start to look for the flower and they liquidize it to feed to the Queen.\r When the Queen gives birth to her daughter, she is born with long, blonde hair that glows every time you sing to it, just like the flower. The evil woman named Gothel (voiced by Donna Murphy) kidnaps the child after discovering that cutting her hair would make it lose its power and she decides the raise the child as her own.\r Every night on little Rapunzel's birthday, the kingdom would release thousands of lanterns and hope that she would return, the young Rapunzel gazes at these lanterns and wants to know what they mean.\r Years later, Rapunzel has grown up and is voiced by Mandy Moore, her 18th birthday is coming up and is eager to leave the tower and see those lanterns in person. When she finds out that Gothel forbids her to, it seems like Rapunzel needs to prove herself as she realizes that she cannot spend the rest of her life in a tower.\r We also meet a charming and witty thief named Flynn Rider (Zachary Levi) who is on the run from the law and his sidekicks, the Stabbington brothers (Ron Perlman). He hides out in Rapunzel's tower and that's where the main movie begins.\r Rapunzel makes a deal with Flynn that she will give him back what's his, as long as he takes her to see those lanterns. Flynn reluctantly agrees to this and they go off on their journey, and we, the audience, hop along as well.\r 'Tangled' is a surprisingly strong addition to the Disney canon, full of great animation, likeable characters, good songs and a well-written story...in fact, this movie has some of the best writing I've seen in a \"Disney Princess\" movie, the way they made Rapunzel end up in the tower and growing long hair, is absolutely plausible to a fault.\r 'Tangled' has started off something great, a new renaissance for Walt Disney Animation Studios, with films like 'Wreck-It Ralph' (2012), 'Frozen' (2013) and 'Big Hero 6' (2014) that followed, how could Disney not be in their new renaissance?",
      "review_date": "2015-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie. Good for kids and adults. The acting, songs, soundtrack and characters are all exemplary here. The humour, energy and warmth of the characters and story stay consistently strong. The villain is very good too, and in an indirectGreat movie. Good for kids and adults. The acting, songs, soundtrack and characters are all exemplary here. The humour, energy and warmth of the characters and story stay consistently strong. The villain is very good too, and in an indirect and subversive way. Overall, very good film.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good work for Disney , showing the best version of Rapunzel, good argument that was a great wallpaper , classic characters super, and this also good to know that more Rapuzel be a princess Disney , Great Job !.",
      "review_date": "2015-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am a huge Disney and animation fan, and was really interested in seeing Tangled. For me Disney have so many classics under their wing, Beauty and the Beast, The Lion King, Sleeping Beauty, Snow White, Bambi, Pinocchio, The Little MermaidI am a huge Disney and animation fan, and was really interested in seeing Tangled. For me Disney have so many classics under their wing, Beauty and the Beast, The Lion King, Sleeping Beauty, Snow White, Bambi, Pinocchio, The Little Mermaid and Aladdin especially. For over a decade, the past Disney films ranged from very enjoyable(Emperor's New Groove) to truly disappointing(Chicken Little)- The Hunchback of Notre Dame and Tarzan were the last ones to truly blow me away- until now.While Tangled had me interested, I didn't like how the film was advertised. The trailer looked as though the film would be a Dreamworks knock-off, and I didn't think much of the title either. I needn't have worried, Tangled was wonderful and Disney's best film in a while(I know I said that about last year's Princess and the Frog, yes I actually liked that too, but after seeing Tangled I've changed my mind). The film is so much better than its advertising suggested, it is not a knock-off of Dreamworks and more importantly it not only has the Disney magic but it has something for both kids and adults.What wowed me immediately about Tangled was the animation. It is simply gorgeous. The colours look beautiful, the backgrounds are stunning especially that surrounding Rapunzel's tower and the characters are very well modelled. The real revelations are with Rapunzel's hair, which is a masterstroke and also the floating lanterns, a scene of true beauty and very touching. Alan Menken's music was a surprise and in a good way. For me, this was his best score since The Hunchback of Notre Dame(that score is amazing), I was especially taken with the Kingdom Dance.The songs are also not bad at all, they are not quite instant classics like Colours of the Wind, Beauty and the Beast, When You Wish Upon a Star, Heigh Ho, Part of Your World, Circle of Life, Hellfire, Under the Sea, Whole New World and Bells of Notre Dame are, but they are listenable with beautiful melodies and surprisingly decent lyrics. The best for me were the stunning I See the Light and the goosebump-inducing Mother Knows Best.The writing is another strong asset. Tangled has some truly excellent writing, particularly with Flynn and Rapunzel, it is funny, witty and even touching. The storytelling is polished and is snappily paced, with the action sequences lively and the ending fitting well with the rest of the movie. When I saw the trailer I was expecting a story scattered with pop-culture references and almost laughter-free dialogue, but actually the storytelling does have a classic feel to it and some scenes like the aforementioned floating lanterns give the film its magic.I also loved Tangled's characters. Rapunzel is one sassy heroine and is also someone young girls in particular can relate to. Flynn is a charming, dashing and charismatic hero too, and his interaction with Rapunzel alone gives Tangled its spark. Mother Gothel is another strong character, in her character you can see shades of both Lady Tremaine and Frollo, and on top of that she is a very intriguing villainess. Even more surprising were the comic relief characters. There have been animated films/Disney films where the comedy either works like a glove(Emperor's New Groove), is either hit or miss(I say this with a heavy heart, Hunchback of Notre Dame) or doesn't work at all(Chicken Little). Here the comedy works perfectly, hilarious without being too over-the-top. Pascal is both hilarious and cute and Maximus the horse is a sheer delight in everything he does.The voice acting also adds a lot to the film. Mandy Moore is a perfect choice for Rapunzel, she has a pleasant speaking voice and a beautiful singing voice. I loved the charisma Zachary Levi brings to Flynn, his voice is one of the main reasons why Flynn is as likable as he is, while Donna Murphy is perfect as Mother Gothel.In conclusion, this was a wonderful film and I recommend it heartily for both kids and adults. For Disney fans too, I think you will be delighted, if you want humour, adventure, beautiful animation, good music, classic storytelling, witty scripting and likable characters, Tangled is a perfect match. 10/10 Bethany Cox",
      "review_date": "2020-04-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I watched it thousands of times and I like it, but I won't give it 10 because it's not very very interesting. I mean, the film isn't bad but I don't have any attraction to it because it's not the kind of movies I like.",
      "review_date": "2015-09-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Watched the it thinking it’s a kids animation and I may have to fast forward specially if there is singing, But was blown away. Disney is just out doing themselves and getting better and better. It’s unbelievable, the animation alone makes meWatched the it thinking it’s a kids animation and I may have to fast forward specially if there is singing, But was blown away. Disney is just out doing themselves and getting better and better. It’s unbelievable, the animation alone makes me want to see this again. The comedy is just enough and right Timing. The music is great and songs are catchy. Just watch. Voice actors were right on the money, perfectly flawless animation. I hope they do another one.",
      "review_date": "2021-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "At least it worked out as a better movie for me to be completely honest. Once you're watching the movie, just stay in for the movie to see at least some worth-to-watch scenes and you're on the way to complete your movie.",
      "review_date": "2016-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tangled may not be the Disney's best animated film, and it is too fast-paced as well, but has an entertaining story-telling, shows the true love that Disney brought with his classics and shares a wonderfully eccentric plot to the audience.Tangled may not be the Disney's best animated film, and it is too fast-paced as well, but has an entertaining story-telling, shows the true love that Disney brought with his classics and shares a wonderfully eccentric plot to the audience. Disney princess' fans, won't be dissapointned.",
      "review_date": "2016-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm a HUGE fan of Pixar movies, and I must say that - with the help of the Pixar guys - Disney managed to do as good, if not better (animation is just incredible !). This movie is also a great success for my entire family. The blu ray is veryI'm a HUGE fan of Pixar movies, and I must say that - with the help of the Pixar guys - Disney managed to do as good, if not better (animation is just incredible !). This movie is also a great success for my entire family. The blu ray is very impressive on a HD TV (if you have to chose between BD and DVD).",
      "review_date": "2016-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "LOVE Rapunzel, so much fun, lovable, & bubbly! Not really a fan of Maximus, Flynn Rider, or the Vikings. Rapunzel's dress & hair are beautiful, however, & I love the healing song she sings to heal Flynn. Beautiful song, and Rapunzel is aLOVE Rapunzel, so much fun, lovable, & bubbly! Not really a fan of Maximus, Flynn Rider, or the Vikings. Rapunzel's dress & hair are beautiful, however, & I love the healing song she sings to heal Flynn. Beautiful song, and Rapunzel is a wonderful character!",
      "review_date": "2016-11-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I didn't like it as much as I thought I would, but it was still good. The characters are good but could use some work. The story was actually good and pushes the score up a lot. The music is also good, but not great.",
      "review_date": "2017-05-28",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 134,
  "genres": [
    "Comedy",
    "Animation",
    "Family",
    "Musical"
  ]
}