{
    "title": "Knockin' on Heaven's Door",
    "rating": 7.8,
    "release_date": "1997-02-20",
    "num_reviews": 54,
    "genres": [
        "Action",
        "Crime",
        "Comedy"
    ],
    "summary": "Two terminally ill patients escape from a hospital, steal a car and rush towards the sea.",
    "reviews": [
        {
            "review_title": "Excellent, excellent movie",
            "content": "The TV guide described the two leads in _KoHD_ as terminally ill gangsters, so when I came to watch it I discovered something quite different from what I had expected._KoHD_ is an excellent film that blends facets of gangster, buddy, road movie, comedy and drama genres together into a seamless whole.  Initially, Martin and Rudi are, of course, hopelessly mismatched.  As they travel towards the sea (their ultimate goal), the relationship between the two men begins to change.  The nervous Rudi finds strength and confidence; Martin, on the other hand, who is initially by far the stronger of the pair, comes to rely more upon Rudi for strength and assistance.Much have been made of the comedy in _KoHD_, and this is a major component - it is the humour that makes the film (which could have been utterly bleak) ultimately an uplifting experience.  That being said, however, just when you forget that both men are dying you are reminded forcefully that they are both, as the title suggests, knocking on heaven's door.  These two forces - the pathos and the comedy - provide a wonderful balance.  Thumbs up.",
            "review_date": "2000-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "GREAT FILM, but you've got to either learn German, or wait for the dubbed version.",
            "content": "First of all, WHY HAS THIS FILM NOT BEEN RELEASED IN ENGLISH SPEAKING COUNTRIES??!!  Is it because Hollywood is afraid of German films that are actually as good as theirs?  Is it because this is a foreign film that isn't \"foreign\" enough (e.g. Bergmanesque symbolism or Wender's \"poetic imagery\") or is it because neither America nor Britain have the nerve to properly dub this film into English? In any case, the world is missing out.  This is a highly entertaining film with a simple plot, lots of humor, plenty of action, and two terrific leads. The plot, regardless of how many people will compare it to \"pulp fiction\" (a comparrison, by the way, which I simply cannot understand,)is a straight-forward buddy flick about two terminally ill men in their early thirties.  Like all buddy movies, (Lethal Weapan, 48 hours, Nothing to lose) the characters couldn't be more different at the beginning, and find a way to get along by the films end.  Nothing new here, except for the fact that both men know they will be dead by the film's end, thus eliminating (thank goodness) any chance of a sequel. Anyway, our heroes meet in the hospital, and quickly decide that they want to really \"live\" their final days on earth, and see the ocean before they pass away.  They steal a car which happens to belong to a dutch gangster (brief cameo by rutger hauer).  Thus begins the chase across Germany and Holland, a chase which combines road-movie laughs a-la Dumb and Dumber (there is a VERY similiar scene where the two men find the suitcase filled with money, and check into a rediculously fancy hotel) with genuine character development and bonding, a-la Thelma and Louise.The real star of the film is not the plot, but the little moments of genuine humor and tenderness between the leads.  Director Thomas Jahn's balance between over-the-top action-comedy and emotional \"cancer drama\" is amazingly played out by the two actors (til schweiger and jan josef liefers)I would recommend this film to ANYBODY who likes to be entertained.  The music is great, the jokes (most of them, at least) fly, and the relationships are genuine.  The only problem is probably that at this point, you have to speak German fluently to understand most of what's going on. BUT BE PATIENT!  Someday Hollywood will discover this film and at least SUBTITLE it like they did the equally terrific(er) \"lola rennt\".  My only hope is that they don't simply ruin the film by remaking it with american stars.  That would be a great letdown, because this film is already perfect. I doubt that most people would even think it's foreign, if they simply forget the subtitles and get into it.",
            "review_date": "1999-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "chef-d'\u009cuvre of life",
            "content": "European movies do have this feature: they combine drama and comedy and make you smile because it is too sad to cry. Moreover, this particular film has a perfectly selected crew and the screenplay is flawless.To have a dream. This masterpiece is all about it.Two men, trapped by cancer unconsciously recognizing the sea as the symbol of freedom and eternity are making their last 500 km to the Baltic Sea.Acting at its best the crew is offering us this warm feeling of sad happiness while singing Guns&Roses \"Knock, knock, knockin' on the heaven's doors\" and understanding, that such moments do make life.",
            "review_date": "2006-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Who Says the Germans aren't Funny",
            "content": "This is another one of those films that I have seen a while back, and I'm somewhat surprised that I haven't actually written anything about it. Maybe it was because I watched it prior to starting to write reviews on movies, though since I watched it back in the days of the SBS cult movie show, I'm sure I would have been writing about it then. Anyway, this is one of those films that is an absolutely delight, and a right laugh - the fact that it is German just adds to it.Basically it is about these two guys, both of them in the late stages of incurable diseases, one of them having an inopperable brain tumor, the other having bone cancer. While they are lying in their hospital beds realising that this is the last place they are going to be, they basically say 'stuff it', steal a baby blue Mercedes, that happens to have a million dollars in the back, and go for a cruise to the beach, namely because neither of them have seen the sea. Mind you, Baby Blue Mercedes tend not to just be lying about the place, particularly if there is something like a million dollars in the boot, and if they are, then you probably don't want to get on the wrong side of the people that actually own it.Yeah, we have a couple of incompetent goons who are supposed to be delivering a package to somebody, but these guys just can't get anything right. So, after knocking a kid off his skate board, they leave the car, unlocked, with the key behind the visor, and take him into the hospital. Oh, and our heroes are wearing nothing but their pyjamas, so because they basically have nothing left to lose, a crime spree is also on the cards, though of course only one of them happens to be a criminal, the other is basically just along for the ride, and the police all think he is a hostage anyway.Yet there is more to this film that a couple of goof ball crooks, and two guys that are taking advantage of their last few days left on Earth, there is some pretty confronting drama as well. The thing is that these guys are dying, and this isn't hidden away - in fact in many cases it is front and centre. In a way it is also a quest, a quest to get to the sea, because, well, there is just something magical about the sea. Yet it also makes you wonder what one would actually do if you literally had nothing left to lose, therefore no need to abide by those social restraints.This is actually a pretty bleak movie, but it is also very entertaining - a black comedy if you will. In fact some have suggested that it could almost be considered Germany's Pulp Fiction. Look, personally, I don't think so, though it does come pretty close. However, in many cases it is a film that pretty much stands on its own two feet, and it is also one of those films that you simply could not remake, even if it is to appeal to the English speaking world. In a way it is made in such a way that the skill and artistry of the director pretty much means that nobody ccould build upon what he has already created.",
            "review_date": "2019-04-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best German films of the nineties",
            "content": "\"Knocking On Heaven's Door\" has been a big German box office hit in the winter of 1996/97 and is still considered one of the best German movies of that decade next to the international success \"Lola rennt\". This is a breath-taking comedy about two losers (Til Schweiger and Jan-Josef Liefers) dying of cancer and getting anything they want during their last days on earth. They are robbing a bank and nicking a car containing a gangster's suitcase with a million marks in it. Of course the gangsters and the police hunting the guys who just want to reach the sea to die somewhere at the shore.Although this road-movie story itself isn't very new and has been filmed many times in Hollywood movies, it stands on its own. The story has dozens of quotes and references from American movies and film genres, but it also knows how to add a local, German and European style to it. You see two henchmen, a Turk and a Belgian, dressed in black suits and with sunglasses like taken from a Tarantino film. You see Hannes Jaenicke dressed as a fatally-looking leather cop U.S.A. style, drinking Jaegermeister (a popular German spice liquor). You see popular fifties girlie actress Conny Froboess playing Til Schweiger's mum, an Elvis Presley adoring fan.\nThere are plenty of funny scenes in this movie, many witty dialogues, absurd situations and brilliant performances by all actors featuring Corinna Harfouch as a doctor, \"Sexluder\" Jenny Elvers as a nurse, Dutch movie stars Huub Stapel and Rutger Hauer as gangster bosses, Ralf Herforth as dumb police officer, etc. Schweiger and Liefers are giving the best performances of their career, adding pain, sadness and tragedy to the all-action-comedy style. The photography, editing and the surf-rock-like sound track by Selig are also outstanding. Take a look at this example of best German nineties cinema!!!",
            "review_date": "2002-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "GREAT MOVIE",
            "content": "This movie is great, it should have been translated into English. It's often compared to Pulp Fiction by Quentin Tarantino. I can understand that to a certain point because it contains witty dialogues like Pulp Fiction but it combines them with tragic and still has it's funny moments.And because of it's tragedy it makes you think, unlike Pulp Fiction (now don't get me wrong folks, I just LOVE that movie). The effect holds on and you wonder: what would I do, if I knew I'll die within a week or a month,... (some very short time period)\nOne of the movies, that you can't just put in one genre, it's more than that. Brilliant.",
            "review_date": "2003-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "an awesome one",
            "content": "After watching the movie for 11th time i decided to share what i think of it.It is simply great. By great i mean the idea that is (supposedly) very deep inside. Perhaps it's about the ultimate goal, that everyone has and hasn't got time to fulfill it, and when the moment comes that makes one understand 'now is the right time'. Sometimes it's too late, sometimes one never understands it is time to change something, but for those two, life was a success. Quoting matrix (kill me), it's the \"free your mind\" style, when all problems go away and you can do whatever you want to do. It's actually a very thrilling experience, and hope this movie can inspire someone to change something in the rhythm of life they're currently living. I like movies that make you think different of things, and this surely is one that does so.",
            "review_date": "2005-06-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An underrated masterpiece",
            "content": "Martin and Rudi, two terminally ill hospital roommates decide that they have nothing to lose and after a wild night steal a car from the hospital garage. The car belongs to two unwitting gangsters transporting load of cash. Chased by the police and the car owners, the couple is determined to make the most of their last days.It's not the plot, it's the fast pace and the blend of humor and tragedy that makes this movie special and brilliant. I don't understand why it wasn't released worldwide.I see there's an American remake (The Bucket List: http://us.imdb.com/title/tt0825232/) scheduled for this year. While I am a fan of both Jack Nicholson and Morgan Freeman, I don't think it will match \"Knockin' on the Heaven's Door\".",
            "review_date": "2007-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Knockin' On Heaven's Door - 7/10",
            "content": "2 men who were sentenced to death by their doctors spent their precious remaining time together to experience something they never had chance to do before when they occasionally found a lot of money two stupid gangsters left.This is a crazy comedy with good entertainment, and because we know the tragical end, so the highly contrast of the hilarious story really make me have a bittersweet feeling which is wonderful.Their last wish is to see sea with their own eyes, a quite common wish but they never did before. We always think we have a lot of time to do things we want to do, but nobody knows what will happen tomorrow. We never have the courage to do something derailed from our normal track of life, and gradually lost the aim and fun of it, living numbly and waiting to the final destination.The cast is good and I Love Til Schweiger so much, really a charming role! Moritz Bleibtreu is outstanding as one of the moron gangster too.I rarely watch Germany comedic films, \"Knockin' On Heaven's Door\" is an exception even it might be too crazy for some people, still need a good recommendation.",
            "review_date": "2007-05-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect",
            "content": "I really love this movie. This is sad, funny and surprising in one. The only good German movie after that was the live of the others (2008) and now there are just bad RomComs or TV-Dramas... This is very sad because Til Schweiger shows in this movie that he is able to performe a good character. Jan Josef Liefers is a actor who can be awesome if he want. In this movie he show it, in the movies after this not any more... One of the best things in this movie is that it never become ridiculous and don't get to sadly. At least I want say that the age of the good German movies is definitely over, and I find that really sadly because with that movies the Germans had shown that they have the chance to do good Movies. So all in all is this in my opinion the best movie since the tin drum.",
            "review_date": "2017-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A shame on Hollywood for not showing it in the Usa",
            "content": "As a german and former huge fan of actor til schweiger it was very important for me to see this movie when it was released in 1997. I wasn't disappointed at all, because this is probably one of the best movies ever. It is so entertaining because it is including a lot of humor (probably a lot of german humor), action and drama. Also very good is the performance of Moritz Bleibtreu, who became well-known, because of his great play of a turkish-german gangster. But this is ,as far as Im concerned, only funny for people who understand german very well.It would be quite nice for american people to watch a REALLY good german movie, that is better as some hollywood movies counted together. If you have the opinion to see it , use your chance!",
            "review_date": "2001-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Decent watch, but nothing outstanding",
            "content": "\"Knockin' on Heaven's Door\" is a German film from almost 20 years ago that was written and directed by Thomas Jahn. It is easily his most known work to this day. It stars Til Schweiger, Jan Josef Liefers and Moritz Bleibtreu, a trio that could be considered the most known actors here in Germany right now. Fittingly, this film here is among the best-known German films too, also abroad. It is not a long movie, only runs for under 90 minutes and that includes a fair share of closing credits already.The film covers several areas, crime story, comedy, drama, moments of tragedy and how you deal with it etc. Certainly a very versatile film. Still I must say that to me it never really delivered 100% in any of these areas. It was not as touching as I hoped it would be and not as funny either Bleibtreu won a German Film Award for his performance here and I also liked Til Schweiger. Nice to see him get some awards recognition, easily one of his best performances, maybe even his very best. He is not the greatest actor in terms of range, but he frequently makes up for it through charisma. On the downside, this also confirms that Jan Josef Liefers is really not a particularly good actor at all. It sure takes a fair share of mediocrity to be clearly inferior to an actor like Schweiger, but Jan Josef Liefers succeeded. He is another actor who scored through charisma instead of talent and his popularity is absolutely not justified by his range.Anyway, the story here is probably the most interesting thing. Frequently, it feels extremely absurd, but if you approach this film by seeing it as fiction instead of reality, it can be a good experience. Nothing bad here, but nothing great either. All in all, a decent watch and I recommend it. Many familiar faces from German film in here.",
            "review_date": "2016-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "To see the sea",
            "content": "Incredibly interesting and clever movie! This movie is very popular in Russia. Why? I don't know. May be because of its excellent philosophical meaning. But it's a fact that this film is close to the Russian spectators (it's enough to see ratings and lists of favorite films). This film is a parable about the main aim of human's life. What's really the main thing in our life? What will you do if you remained to live only several days? These are very interesting questions. And the heroes of this movie trying to answer this questions... It's not so difficult to see the sea, as it seems.",
            "review_date": "2007-06-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "We should not overestimate it...",
            "content": "This movie is not bad, but it is not to good either. I would classify it as a fairy-tale. Rudi and Martin, to about 30-years old man, have both cancer and flee out of their hospital. They make a journey to the sea und use their last days to fulfil their wishes. By intention this movie is far from realism. For example, you never see symptoms of illness at Rudi, despite he is very sick of bone cancer. There are lot of gunfights, but no one dies or gets hurt. In one scene dozens of police cars chase the two guys. The two main gangsters, Henk and Abdul, are in their black suits a mixture of Tarantino-style guys and the typical german smalltown thug. That makes the movie very light-hearted, but a bit stupid also. To me good fun for 90 minutes, but I would not look it a second time.",
            "review_date": "2003-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best movies ever",
            "content": "The movie is great. Simply brilliant. Even if you try to retell the plot you'll miss the whole point, because this movie isn't about the chain of events - it's about the people, the characters, the life itself. There is not a single scene that falls out of the whole composition: even though the plot is not the key issue here, it still beautifully binds the whole story together, perfectly connecting all the dots. And have your tissues ready: no matter how many times I watch it I always cry at the end and I'm not usually very sentimental. As for my male friends who watched it with me several times they usually just stay very silent at the end. It is very emotional and overwhelming: both sad and somehow positive at the same time. I envy those who have not seen it and will watch it for the first time.",
            "review_date": "2011-05-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So cool",
            "content": "Soulful and funny movie. Good casting. Great and memorable soundtracks.",
            "review_date": "2020-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watch this film!",
            "content": "This is easily one of the best films that I have seen in a long time and certainly the best of its modern gangster genre.  The plot is maybe a touch formulaic but that fits well as the whole film pokes fun of many of the clichees that Hollywood pictures like Pulp Fiction take a little too seriously.  Actually, I have heard many people compare it to Pulp Fiction, but the only real similarity I found is in its frenetic style and odd sense of humor.  As for humor, the subtitles are well done, so you don't lose much in the translation.",
            "review_date": "2002-03-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A whole phenomenon in Russia",
            "content": "This movie is a whole phenomenon in Russia, it hits the first places of the local lists of \"must-see-movies\". Many persons aged from 14 to 80 don't stop enjoying it after watching it like 5 or 10 times. I tried to analyze what made this film so popular in this country and had a couple of ideas:First of all, this movie was shown in 1999 (or something) by a nationwide TV channel in prime time (and with a good translation!). This was a really respectful move from our TV makers which provided a solid audience for the film.The second (and the most important) factor is that the plot is a total fiction (bullets don't hurt, mafia can be nice, etc...) but still extremely sincere. This is what appeals to the Russian spectator. If becoming wiser will deprive me of believing in fairy tales - then down with the wisdom!",
            "review_date": "2013-03-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "great film",
            "content": "This is a great example of Movie Making. Europeans are gr8 in Movie making.All of us are talking about the Lead roles. But \"Abdul- Moritz\" was fantastic in the film. With his Arabic accent he was gem in the movie. Jokes he tells in the Movie and his body language is simply fantastic.The lead roles are gr8. The storyline is simple and it is made into a real good movie.I saw this movie in Russia, but it was a gr8 experience. Hollywood where r you. don't remake it just dub it.I would recommend someone to dub it in English with all accents and real jokes and fun. It will be a Super Hit..why has nobody translated it yet.. Surprised...!!!Nice movie to laugh and release tension.",
            "review_date": "2006-10-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A cracking film",
            "content": "I think this is a very decent movie. It does make you think and has enough depth and intelligence hidden in the characters alone. Its great the way the \"hard\" guy has a dream to do something nice for his mother and the more \"loser\" character wants to have sex with two women. This is a great way to juxtapose two characters and makes the film more interesting to watch. I liked the idea of the two guys meeting before the hospital scene. The jokes in the film are both visual and dialogue-based. Most of them are good and made me chuckle a couple of times. The choice of music was very good and the ending was a good concept. I knew the guy would die in the end but i thought they wouldn't get to the sea in time. I should have thought otherwise but the film is made cleverly enough for me to mistake the two outcomes/climaxes. Overall i think everyone should see this film if they get the chance.",
            "review_date": "2007-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "simple-minded and annoyingly adolescent",
            "content": "I do not agree at all with the enthusiastic comments listed before. Knockin' on heaven's door maybe conceived as the ultimate new German comedy (actor Til Schweiger participates as producer) - what came out is in my eyes a quite embarrassing product. The fulfilment of adolescent dreams of uninhibited consume (cars, girls, champagne - highly original) forms the base of the plot. Inserted are all types of clichés (from respected actor Moritz Bleibtreu as a dumb Arab mumbling in bad German, to the sentimental ending in the North-Sea-sunset). What really annoyed me is the dull kind of humor blank of every subtlety, which the movie celebrates from the beginning to the end. To say something positive, the camera word is fresh and at times inventive. As an example for a well-done and funny German comedy, see \"Frau Rettich, die Czerni und ich\" from 1998. Or else, stick to Laurel and Hardy.",
            "review_date": "2004-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Low-level chick-flick",
            "content": "This movie is not as good as it seems. The story is catchy maybe for 12-year-olds. I watched it in the movie theater at that very age and liked it. Just a few weeks ago i tried to watch it again and it was so terrible, i couldn't even finish it. Knocking on heavens door is full of stereotypes. The two goons, who are hired to get the car back act terribly and fulfill every cliché in the book. Til Schweiger really sucks at trying to be a sensitive macho. And all that talk about getting to the sea sounds like it's part of some low-level chick-flick.I really didn't enjoy a minute of this movie (the second time i watched it).I don't mean to offend anybody who actually watched this movie and liked it i just think that it doesn't deserve a rating 7.6. That would make it as watchable as 'Carlito's Way' (the older one), 'High Fidelity', 'Kontroll' (very good Hungarian movie), just slightly worse than House of the flying daggers' and even better than 'Chasing Amy'. Not that those movies are the best ones ever made. But i think all those movies are better than 'Knocking on Heaven's Door' and don't deserve the same rating. That's why i would give it a 4. Also i don't think that Quentin Tarantino would appreciate this movie to be compared with Pulp Fiction.",
            "review_date": "2006-04-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Oh, to die, so with the music! or A few days in the life of a terminally ill",
            "content": "Tragicomedy. Finally, a pancake miracle happened! Open the champagne! I treat everyone at my own expense! How long had to wait. Don't you understand what's the matter? So I'll tell you now, the fact is that I wanted to see this picture ten years ago. Ten years old Karl! But everything did not work out, then business, then study, then work, then other paintings were very much asked to be viewed and reviewed. And now, after I repeat - ten years later, I saw this magnificent and wonderful picture, which all my friends and acquaintances sincerely advised me to see even then, and here's my brief opinion - Oh, to die, so with music! I confess that I am completely delighted with this picture, and I would like not to write about some of the minuses that I saw, but I will write in a separate paragraph, while they do not spoil the overall impression, so let me focus on the expressive merits of this masterpiece tragicomedy German production.\nSo, here they are:\n1. The story told - the picture tells the story of two guys, Rudy and Martin, who, after a planned medical examination, find out that they are terminally ill, and they have only a few days to live. A common misfortune united, and they decided not to wait for death in a hospital ward - but to fulfill their dreams and live the fun time they had allotted. Add here an expensive car with a lot of money, a competent and well-developed script, for which the director Thomas Jan himself and Til Schweiger, who plays Martin, were responsible - and you will get an hour and a half of pure pleasure. In general, the script was written with pure enthusiasm, as you can see. But, if you go deeper, this is not just a story of a binge of two terminally ill - they put their soul into the script, and this can be seen with the naked eye. This is a deep and soulful story.\n2. Inner depth - I already started writing about this in fithe previous paragraph. The viewer literally becomes involved in the heroes' problems. The heroes' dreams become our dreams, we worry about them. And even more so, what would we have done in their place (God forbid from such things), but still? I am sure that the majority would not quietly and calmly wait for the old woman with a scythe, but would have rushed out of the hospital and would have gone all out, adjusted for each, of course. They would fulfill their dreams, accomplish what they feared earlier, would fill the remaining time with a riot of colors, in order to meet the old woman with a scythe, peaceful and happy, and go to Heaven without having nasty thoughts and feelings of a life wasted in vain.\n3. Humor - for the most part it is still a comedy, which even reminded me of \"Taxi\", but there were only three frankly hilarious moments here - but what kind! I can't say who was responsible for these jokes (Thomas or Thiel), but I shake hands with both! My sincere respect and admiration!\n4. Music - almost every viewer on our planet knows most of it, because the songs are not only well-known, they have also become cult, in fact, the original name refers to the cult song \"Knockin 'on Heaven's Door\" by the famous American singer Bob Dylan. Well, for the music that sounds in touching and sentimental moments - special thanks. Excellent selection, my compliments to the composers.\n5. Dialogues - especially about the sea - you can listen to it endlessly. By God, in performance it reminded me very much of the famous scene in the cult film \"Blade Runner\", where the hero of Rutger Hauer (who also appeared here in a small role) pronounces in the same languid voice. This, this, this is great! It seems like ordinary and everyday words, but how it sounds! Wonderful!\n6. Final - the famous final, where everything is clear without words. Magnificent shots, facial expressions of characters, emotions, surroundings, music - they told me about him even then, ten years ago, but this knowledge did not diminish my delight when I saw him with my own eyes. Magnificent and burning!\nWell, the cons, as promised, must be mentioned (although fans and admirers of the picture will throw stones at you for this), let's start: a few scenario miscalculations, the police behave very stupidly (even by the standards of Taxi), several dark scenes where there was clearly not enough lighting technology. That's all. A little, but as I said - all this does not affect the overall impression.\nA little about the main characters:\n1. Martin Brest performed by Til Schweiger is a serious guy who loves smoking with or without reason, charismatic, but with good humor, whose life turned upside down in an instant. At first, it may not cause sympathy, but soon the viewer already becomes interested in watching him and his friend in misfortune, Rudy. One of Thiel Schweiger's best films (if not the best). Well done!\n2. Rudy Wurlitzer performed by Jan Josef Lifers is a modest and law-abiding boy, for whom the news of a fatal illness was a real blow. But the acquaintance with the impudent Martin breathed new life into him, and fun began. Jan played this role very convincingly.\nThe picture did not collect a very large box office, which affected the director Thomas Yana, who no longer shot a single picture.\nWell, you don't wait as long as I did. Look at the picture right now. And if you have already watched it, then review it, because it deserves it. Is that so? This picture is from the category that does not lose its relevance and charm when viewed again, but on the contrary, with each revision it only gets better. Is not it so?\nAs a result, we have a masterpiece and cult tragicomedy about two terminally ill guys who made a real revelry goodbye, with an excellent script, jokes, music and excellent dialogues and moral conclusions.",
            "review_date": "2020-09-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Oh, to die, so with the music! or A few days in the life of a terminally ill",
            "content": "Tragicomedy. Finally, a pancake miracle happened! Open the champagne! I treat everyone at my own expense! How long had to wait. Don't you understand what's the matter? So I'll tell you now, the fact is that I wanted to see this picture ten years ago. Ten years old Karl! But everything did not work out, then business, then study, then work, then other paintings were very much asked to be viewed and reviewed. And now, after I repeat - ten years later, I saw this magnificent and wonderful picture, which all my friends and acquaintances sincerely advised me to see even then, and here's my brief opinion - Oh, to die, so with music! I confess that I am completely delighted with this picture, and I would like not to write about some of the minuses that I saw, but I will write in a separate paragraph, while they do not spoil the overall impression, so let me focus on the expressive merits of this masterpiece tragicomedy German production.\nSo, here they are:\n1. The story told - the picture tells the story of two guys, Rudy and Martin, who, after a planned medical examination, find out that they are terminally ill, and they have only a few days to live. A common misfortune united, and they decided not to wait for death in a hospital ward - but to fulfill their dreams and live the fun time they had allotted. Add here an expensive car with a lot of money, a competent and well-developed script, for which the director Thomas Jan himself and Til Schweiger, who plays Martin, were responsible - and you will get an hour and a half of pure pleasure. In general, the script was written with pure enthusiasm, as you can see. But, if you go deeper, this is not just a story of a binge of two terminally ill - they put their soul into the script, and this can be seen with the naked eye. This is a deep and soulful story.\n2. Inner depth - I already started writing about this in the previous paragraph. The viewer literally becomes involved in the heroes' problems. The heroes' dreams become our dreams, we worry about them. And even more so, what would we have done in their place (God forbid from such things), but still? I am sure that the majority would not quietly and calmly wait for the old woman with a scythe, but would have rushed out of the hospital and would have gone all out, adjusted for each, of course. They would fulfill their dreams, accomplish what they feared earlier, would fill the remaining time with a riot of colors, in order to meet the old woman with a scythe, peaceful and happy, and go to Heaven without having nasty thoughts and feelings of a life wasted in vain.\n3. Humor - for the most part it is still a comedy, which even reminded me of \"Taxi\", but there were only three frankly hilarious moments here - but what kind! I can't say who was responsible for these jokes (Thomas or Thiel), but I shake hands with both! My sincere respect and admiration!\n4. Music - almost every viewer on our planet knows most of it, because the songs are not only well-known, they have also become cult, in fact, the original name refers to the cult song \"Knockin 'on Heaven's Door\" by the famous American singer Bob Dylan. Well, for the music that sounds in touching and sentimental moments - special thanks. Excellent selection, my compliments to the composers.\n5. Dialogues - especially about the sea - you can listen to it endlessly. By God, in performance it reminded me very much of the famous scene in the cult film \"Blade Runner\", where the hero of Rutger Hauer (who also appeared here in a small role) pronounces in the same languid voice. This, this, this is great! It seems like ordinary and everyday words, but how it sounds! Wonderful!\n6. Final - the famous final, where everything is clear without words. Magnificent shots, facial expressions of characters, emotions, surroundings, music - they told me about him even then, ten years ago, but this knowledge did not diminish my delight when I saw him with my own eyes. Magnificent and burning!\nWell, the cons, as promised, must be mentioned (although fans and admirers of the picture will throw stones at you for this), let's start: a few scenario miscalculations, the police behave very stupidly (even by the standards of Taxi), several dark scenes where there was clearly not enough lighting technology. That's all. A little, but as I said - all this does not affect the overall impression.\nA little about the main characters:\n1. Martin Brest performed by Til Schweiger is a serious guy who loves smoking with or without reason, charismatic, but with good humor, whose life turned upside down in an instant. At first, it may not cause sympathy, but soon the viewer already becomes interested in watching him and his friend in misfortune, Rudy. One of Thiel Schweiger's best films (if not the best). Well done!\n2. Rudy Wurlitzer performed by Jan Josef Lifers is a modest and law-abiding boy, for whom the news of a fatal illness was a real blow. But the acquaintance with the impudent Martin breathed new life into him, and fun began. Jan played this role very convincingly.\nThe picture did not collect a very large box office, which affected the director Thomas Yana, who no longer shot a single picture.\nThere was also an actress in a small role, whose appearance reminded me of my very good friend.\nThis tragicomedy was appreciated by our viewers, and in Russia and other countries of the former USSR it has a cult status, and occupies quite high places in the lists of the best films, which is deserved.\nWell, you don't wait as long as I did. Look at the picture right now. And if you have already watched it, then review it, because it deserves it. Is that so? This picture is from the category that does not lose its relevance and charm when viewed again, but on the contrary, with each revision it only gets better. Is not it so?\nAs a result, we have a masterpiece and cult tragicomedy about two terminally ill guys who made a real revelry goodbye, with an excellent script, jokes, music and excellent dialogues.",
            "review_date": "2020-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best movies I've ever watched!",
            "content": "I don't want to repeat all these things so I just say that this is one of the best movies I have ever watched in my life. I recommend it everyone! It should be translated into other languages, too! On the one hand it is very funny and on the other hand very serious and sad! This movie includes two of the best German actors.",
            "review_date": "2002-05-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "my number 120 movie",
            "content": "Knockin on Heavens Door is my number 120 movie, because it is a fun action movie and it has good characters. I'm German, so I almost have to like this movie. I especially loved Abdul, the guy with the Turkish accent, played by Moritz Bleibtreu, who is a famous German actor. Maybe you know him from Lola rennt ( 1998 ). In Lola rennt he played Manni, the guy who has to get 20,000 DM within 20 minutes. The story : Martin Brest ( Til Schweiger ) has a tumor in his head and Rudi Wurlitzer ( Jan Josef Liefers ) is afflicted by cancer in his bones. Rudi has never seen the sea in his life, so it is a point of honor for Martin to get him there. During their trip they meet two car dealers ( Moritz Bleibtreu and Thierry van Werveke ). Martin and Rudi rob a bank, and steal a car of these two car dealers. But finally they get to the sea. Knockin on Heavens Door is a good German film with good characters + actors and a great soundtrack ( Knockin on Heavens Door by Selig ) . My favorite part in this film is the ending when that soundtrack is played. It stands for that there is always hope and so on. It is just a great ending.All in all, I rated Knockin on Heavens Door 8/10 and recommend it to fans who want to see fun movies. I consider KoHd as one of the best German films, along Lola rennt ( 1998 ), Die Brücke ( 1959 ), Das Boot ( 1981 ), Stalingrad ( 1993 ) and Der Name der Rose ( 1986 ). If you have any questions, feel free to ask them.",
            "review_date": "2001-02-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie",
            "content": "This is a great movie. I have seen a Russian translation of it, and it is now one of my two ever favourite movies. It is a great piece of art. I would watch it thousands of times if I could...It is a great story and has a great plot, which makes this movie perfect.This is a definite must see before you die! :)Unfortunate that it is not translated into English, for I would gladly see it again. The trouble is, it is insanely difficult to find it for purchase.I suggest this movie to all, even if there might be some sensuality, it is still a wonderful German production. Again, I recommend to all, and rate 10 out of 10.:)",
            "review_date": "2007-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "it's pointless to be afraid",
            "content": "Two young guys Rudi (Jan Josef Liefers) and Martin (Til Schweiger) being examined at the same time find out that they are terminally ill and have very little time left to live. And fate brought them together in one room. So the choice arises: to die quietly in the ward or to break away for the last time. Having drunk, they decide to fulfill their cherished dream - to go to the sea, which they have never been to, because in heaven they only talk about it. And an exciting story begins, in which there is everything: beautiful girls, money, a sky-colored car, chases, gunfights, funny situations and reckless actions.It is difficult to attribute the film to any one genre, here comedy, drama, action movie are intertwined and it all looks holistic, every moment, every detail and every phrase has a certain meaning. A story about the thirst for life, about real friendship that arose in a short time, about how friendship can influence people, forcing them to do seemingly unthinkable things.The last desire of both is interesting: the unceremonious Martin thinks in his last desire not about himself, but about a loved one, and the quiet Rudy wants to satisfy his sexual fantasy.Speaking about the main characters, one cannot but say that Leavers and Schweiger performed their role simply brilliantly. Throughout the film, with every second, you become more and more saturated with sympathy for their heroes, and you want their dream to come true.There are enough interesting characters in the film besides Rudy and Martin. The brightest Abdul with Hank and their boss Frankie. Abdul doesn't like when they *bring* his patience, can't drive, doesn't get into jokes even the third time, loves beautiful costumes, constantly pronounces words with errors, and Hank corrects him and makes sure that he doesn't break loose and do another stupid thing . Frankie pretends to be a big boss, he is constantly not happy with a couple of his guys, he considers them idiots. This criminal trinity evokes sympathy and makes you smile, although they are negative characters.The finale of the picture will squeeze out a tear from anyone. Here is a feeling of joy that they succeeded, they still did it, and bitterness because this is the end. Rudy and Martin are so attracted to themselves, they make them relive their last moments with them that tears involuntarily well up. Everything is just great: a cigarette, a bottle of tequila, the sea and all this to the beautiful song of Selig - *Knockin On Heaven's Door*\nAfter the finale, you understand that the film also puts before you the question, what will you talk about in heaven. You understand that so many things have not been done yet, so many things you want to try, but time does not wait. What are you capable of to achieve your dreams, how far are you willing to go? You involuntarily put yourself in the place of Rudy and Martin and ask yourself if I am ready for crazy things. Why only on the verge of death do you understand that you should not be afraid to live, because every day can be the last. Why do you understand the meaning of the phrase *live every day as if it were your last* when the end is near. Why do we whine that life is boring and meaningless, why don't we spit on everyone who stands between us and the realization of our dreams. Maybe it's time to change something, stop being afraid, do something crazy. Start fulfilling your dream. Or he can spit on everything and go to the sea.You cannot be indifferent to the film, it will definitely sink into your soul and stay there forever.This masterpiece is beyond all bounds, everyone should see it!",
            "review_date": "2022-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Strong. Nothing to add",
            "content": "The film \"Knocking on Heaven\" (1997) after the first viewing, left an indelible mark on my heart. It is strange that you begin to understand such obvious things as the value of life after a fatal diagnosis. You begin to appreciate every moment, every breath and every moment ...Two patients who accidentally become \"friends\" are poisoned by the sea. Since they gathered in paradise, and in paradise all the talk is only about the sea...I watched the movie and realized that all these aspirations are only because life is slipping away. If they had not received these terrible diagnoses, they would have wasted their lives ...The film is shot simply amazing. It was filmed by three countries: Belgium, Germany and the Netherlands in 1997.German actor Til Schweiger - well, you can't take your eyes off him. Beautiful, plastic, sexy. But I never thought that he would be so delightfully good in a \"death role\". Everything is natural, clear, the hit of the actor is 100%. I think that the authors were lucky with the selection of actors.I think the plot and the speed with which it develops are huge pluses.I like the musical arrangement and the ability of the authors to switch from tragic moments to subtle humor.I like the film very much. I strongly recommend everyone to watch.",
            "review_date": "2022-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Knockout!",
            "content": "Good German comedies are rarer than Loch Ness monster sightings, but \"Knockin´ On Heaven´s Door\" is an exception.  This is the flashier German answer to the equally excellent Austrian \"Indien\".Enough said already, now go see the movie.",
            "review_date": "2001-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Breath taking",
            "content": "I most certainly like it. Especially the scene when they hide in a Turk restaurant. He gone crazy in front of cameras.After a few hours later watching i realised there is so much on this film. Like the car in bucket list and sign of Trabzonspor in that restaurant, guess it can be both simple and detailed. Deserves to be watched again.",
            "review_date": "2021-07-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "knock knock",
            "content": "The best story about nothing exsept the reality's frienship, sea, and death. this movie made to see things in all their real costs indeed. hovewer all happinig fooly in only to imagine the end as death. )",
            "review_date": "2020-12-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Some Words",
            "content": "A kind of parody to famous Pulp Fiction. Lots of dark humor, gangster plot, and even some music remixed. But there is one big difference. Many gunfights - almost no blood. That makes movie more offensive. It has some very bright scenes and the whole idea of two men, having nothing to loose and trying to get to the sea at all costs is awesome. Despite sad moments it is optimistic. And it is funny - even in the grave man can laugh.",
            "review_date": "1998-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It is a wonderful movie about life in the context of time which we have",
            "content": "In the centre of the storyline there are two male patients whose days are numbered. They have fatal diseases, but they don't want to die in the hospital. So they decide to escape and enjoy the last days of their lives. There are a lot of films about the life's value but this is the most memorable one, in my opinion. Despite the fact that the theme of the movie is very serious, it is a great comedy. The main message of the film is \"Fear is stupid\". This movie makes you rethink your vision of life and leaves behind a sense of sadness and, at the same time the ease. It leaves you feeling the sea breeze on your face after watching. There is an interesting fact: this movie is full of so-called \"movie flubs\". For example, in one shot we can see legs of the camera crew, in the other - the crew is reflected in the glasses pf one of the actors, etc. Although I watched the film numerous times, I'd never noticed these flubs, until I read about them on the one website. For me this is a sign of the plot completely preoccupying the audience. I think that it's one of the movies you can watch over and over again and \"update\" your feelings and emotions on the transience of life and the absurdity of many of the conventionalities.",
            "review_date": "2013-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Both entertaining and thoughtful",
            "content": "A movie that is both entertaining and thoughtful. I discovered this movie while looking for a German movie to improve my language skills. So, it can also be useful for those who want to improve their German. Unfortunately, I was very late to discover. Definitely recommended.",
            "review_date": "2020-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Love literally all",
            "content": "That's a perfect movie which can make you cry, laugh and the most important- enjoy. Characters development, pacing, cinematography all is nailed and keeps my eye concentrated on the film. Definitely recommend and I will never stop rewatching it.",
            "review_date": "2022-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A truly delightful and funny movie",
            "content": "This movie has been subtitled into English in 1999 by the Special Broadcasting Service in Australia, and done very well I might add.A really entertaining film and well worth looking out for. Who ever said good comedy doesn't come out of Germany?",
            "review_date": "2001-04-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It is a trap! Overrated Amateur Film!",
            "content": "As you can understand from the title of review, this is an amateur film in every aspect. The screenplay is amateur, it is a ripoff of Holywood movies and full of plot holes. The acting is amateur, the two guys look healthier than anyone else. The mafia men and policemen are so foolish that they capture and let go of the two \"seriously ill\" men a dozen times. Despite all the mess, director tries in vain to dramatize the subject.The rating is a trap, you can watch it if you want to waste your time.",
            "review_date": "2020-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wholesome movie",
            "content": "The pace of the movie is very good, it's not long and not short, no filler, all action and Comedy, while having a true story and journey. War sehr schön.",
            "review_date": "2020-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent film",
            "content": "Fate brings the characters and pictures in the hospital, where doctors render their death sentence. By the time of their lives is important. Further events in the film unfold in a rapid pace. Stealing a car with a million German marks in the trunk, they escape from the hospital.They are pursued by hired killers, they become robbers Willy-Nelly, they are chased by the police, they fall into a brothel. But nevertheless continue to rush forward towards his destiny. While watching this film, I wanted to cry. This film left me only positive emotions. Happy to watch him again.",
            "review_date": "2017-04-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Brilliant Movie",
            "content": "This is really a great movie. The actors are great, too. This is movie with an intelligent story and its full of emotions. It´s a pity that this movie wasn´t released in the USA.",
            "review_date": "1999-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best soul movie)",
            "content": "\"Hurry up! you have little time! After all, in the sky, there is only talk about the sea and the sunset\"\nif you ask me about my favorite movie, then I will name this movie. there are no cool special effects here, but there is a soulful story here. This movie will make you think that life has everything. But evil fate can take life. And you will ask yourself: \"what you managed to do? What did you dream about?\" Hurry up to follow your dream!\nP.s i love Til Schweiger)",
            "review_date": "2020-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not released in USA? What a pity!",
            "content": "KNOCKIN' is a very cool movie that could be directed or written by Q. Tarantino (without any violence). But that this is a German movie is nearly unbelievable.I think it's very sad that this great piece of work wasn't released in the United States. This is probably one the greatest German movies ever made but only a few \"Not-Germans\" are able to see it. Perhaps there will be a subtitled version on the American market soon! But if you understand German, DON'T MISS THIS MOVIE!",
            "review_date": "1999-07-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Everyone should see the sea.",
            "content": "This is a dramatic film directed by German filmmaker Thomas Jahn. A story is about two men who are diagnosed with fatal disease while they are being treated in the hospital. They steal a car with one million of German marks and go to the sea because one of them hasn't been to the sea. During the travel they make one wish of each other come true.We won't have another life, make dreams come true, do what you feared before. Never put off till tomorrow what you can do today. I love this film and think that everyone should watch it.",
            "review_date": "2021-04-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Forget about The Bucket List!!!",
            "content": "One of my favourite German movies ever! I wonder how Hollywood could come up with a nonsense like 'Bucket List' more then 10 years after this awesome piece of filmmaking! The storyline is very creative and leaves a lot of space for surprises, the acting is fresh and really makes you feel with the main characters. The movie promises comedy, action and drama...so be prepared. It doesn't reach my 10 points, missing a bit of professionalism sometimes but in the end this makes it just more likable! So, even if it's not available in English, make the effort and watch it with the subtitles. In the end it's always better to watch movies in original language.",
            "review_date": "2010-09-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "good",
            "content": "It`s one of the best European films of 1997. Excellent!",
            "review_date": "1998-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing one, not to miss",
            "content": "Absolutely one of the best movies from the European cinema! Beautiful, sad and thoughtful, I cannot recommend it enough. The casting, the acting, the directing - everything is perfect, too bad it is not talked about enough.",
            "review_date": "2021-05-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Isch weiß, diese Film is gut Mann !!",
            "content": "This was the best EUROPEAN movie in 1997, no doubt about that. Til SCHWEIGER, i must call him the Brad PITT of GERMANY really performed well in his role as the tough guy, who really don´t give a damn. Despite the sadness, that both main characters are infected with deadly diseases, it really took me to laugh for several times. It has a touch of PULP Fiction and Natural Born KILLAZ in it. The only difference to that, there´s no blood in it, makes it more realistic. The funniest part is ABDUL, one half of the gangster-duo, watch him and his broken german language. Overall a great entertaining movie made by a german team.",
            "review_date": "1999-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An obligation for loving",
            "content": "There is a play which it's context is like that in \"Knockin' on Heaven's Door\". It's name is \"Two subtract\". Morever, we have watched other movie \"Bucket List\" before about two old man which scape hospital near their dead times. But \"knockin' on Heaven's door\" distinguish itself somehow from others by some different aspects. I think one of this different aspects exists about \"Aura\" concept! From my point of view, in this film there is an invisible aura around major characters and this aura protects them from all the dangerous things around them. Look at the sequence which they have been besieged from two sides by gangsters and police officers; however, they can run away. there is a spectacle Mise-en-scene here,too. Some vertical camera angles which shoot from up in the sky and exhibiting how that invisible aura protects two young man. \"knockin' on Heaven's Door\" is a lovable movie because there is an aura around it which make us an obligation for loving it!",
            "review_date": "2010-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nice",
            "content": "This film, which is the representative of the 90s flight Tarantino-like movies in Germany, is a wonderful travel film that blends action, comedy and drama genres very well.Frankly, I really liked it and I would recommend it to those who overlooked it so far. It is a perfect movie with its editing, acting, golden color, music, in short, everything.",
            "review_date": "2021-04-27",
            "lang": "en",
            "source": "imdb"
        }
    ],
    "vibes": [
        "dead",
        "fresh",
        "fair",
        "familiar",
        "inferior",
        "versatile",
        "indelible",
        "lucky",
        "musical",
        "natural",
        "sexy",
        "subtle",
        "bright",
        "loose",
        "emotional",
        "respectful",
        "solid",
        "wise"
    ]
}