{
    "title": "Drishyam 2",
    "rating": 8.2,
    "release_date": "2022-11-18",
    "num_reviews": 201,
    "genres": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "summary": "A gripping tale of an investigation and a family which is threatened by it. Will Vijay Salgaonkar be able to protect his family this time?",
    "reviews": [
        {
            "review_title": "A remake that retains its own identity",
            "content": "I have already seen the original 2021 Drishyam 2 hence while watching the Hindi remake, i knew what was coming. Still i watched it to see what changes the Hindi version makes to the original or is it just a blatant copy paste.The answer is NO! It is not a blatant copy paste. Let me tell you in points about them:-1. Having not seen the original Drishyam 1 but the Hindi drishyam 1, i didn't knew that Gaitonde's character is a unique addition to the Hindi version. This , even in Drishyam 2 is a masterstroke.2. Gaitonde lives up to that hateful character he had from the 1st film. The Hindi version has slightly altered the police station interrogation scene in the 2nd half and this is where the Hindi version outclasses the Malayalam version and the difference was Gaitonde.3. Akshay Khanna as the IG is another masterstroke addition who fills in the shoes of IGP Thomas . While Thomas was direct and strict, Akshay Khanna is sarcastic in his tone and has this evil way of talking that gives him his own identity. Another place where the Hindi version scores full marks. He's done a terrific job.4. Another thing that gives the Hindi version it's own popularity is the famous \"Satsang\" confession. When again brought up here, the crowd roared ! Shows you how this Satsang thing has had its own fan following as compared to the confession in the Malayalam version.5. The fact that certain scenes have been a little altered to avoid being called a blatant copy paste, for example the film begins with a person murdering another and then running in the jungles. The Malayalam version started straight from the running part without much showing the sequence why he was running.6. The elder daughter's illness was better captured in the Malayalam version. The Hindi one just seems to add it for name sake.7. The final climax courtroom scene was , imo, better executed in the Malayalam version. The Hindi one felt like it was rushing to the main points of the climax. Also that scene in the court where Vijay and the IG cross each other , this too was a little better in the Malayalam version where George kutty and Thomas crossed each other and that expression on Thomas's face was better.8. Tabu and even Rajat Kapoor have nothing much to do as the spotlight are taken by Vijay, Akshaye and Gaitonde.Overall, Drishyam 2 hindi is a very good remake of the original, just like Drishyam 1 was despite change in directors. It almost felt like Abhishek Pathak had the soul of Nishikant Kamat in him while making this film. At this point, we all can agree that the Hindi version has made an identity of its own , thanks to including new characters and property modifying certain scenes. A tight slap on the face of those who thought this was to be an ott film.",
            "review_date": "2022-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Master stroke",
            "content": "Sameer lodayaIt was a perfect master stroke from the makersThe makers have kept the brand image very well following from part 1 to part 2.the brand value of part 1 was so high that after so many years the movie still lies fresh in mind and the part 2 is no less this will also keep an image in your mind called DRISHYAMAjay was same like part 1 he continued the same simplicity and smartness..Akshay khanna was the limelight it was nice to see him after a long time in his new bald lookThe movie goes slow for the first 30/35 minutes and then after interval it picks up with all the twists and turns which will blow your mind..prosthetics were well placed and showed each character grown upEven though you have seen in Malayalam or Hindi dubbed and all though you know all aspects then too this version is worth watching.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Faithful remake",
            "content": "************ Movie Review *****Ajay Devgn's Drishyam, released in 2015, was simply superb which was an official remake of Malayalam film Drishyam starring Mohanlal thanks to its thundering climax and electrifying screenplay.The sequel, Drishyam 2, which releases today takes the story forward when the IG (played by Akshaye Khanna ) re-opens the case which led to the disappearance of son of Meera (Tabu), leading the trail back to Vijay Salgaonkar and his family.While the first film was directed by late Nishikant Kamat, Abhishek Pathak returns to the director's chair with slow-burn and yet engaging story written brilliantly by Jeetu Joseph with twist and turns enough to keep you at bay. Drishyam 2 starts off on a slow note but gathers the steam towards the second half. The series of events infuses life to the film and will keep you guessing with what-will-happen-next scenes. Of course, the editing could have better reducing the duration of the film, especially in the first half.It is the last one hour of the film which makes it an interesting watch thanks to the outstanding climax. The only actor who could match to the calibre of Mohanlal is Ajay Devgn . The actor expresses adequately through his eyes and gives a stunning performance. Akshaye Khanna is just turning out to be fabulous with each and every role he plays and this one is definitely on the radar. Tabu and Shriya Saran's character could have been better written.So, overall, Drishyam2 is worthy sequel to 2015 s Drishyam which should be applauded for its skillful writing, brilliant performances and astounding climax.-Ketan Gupta.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely unmissable!! Ajay Tabu and Akshaye Khanna rock!!",
            "content": "Film review - Drishyam 2\n#sanjuzzreviews #Drishyam2 #AjayDevgan #tabu #AkshayeKhannaSuperb, fantastic, fantabulous, inconceivable are some of the adjectives that will come to people's minds after watching this film. Even after watching the Mohanlal's 2021 Malayalam original, I enjoyed this Hindi remake immensely !!The story takes off 7 years after the incidents depicted the first installment happen, with Vijay Salgaonkar ( Ajay Devgan) and his family trying to move on with their lives. However the fear of the law catching up with them affects each one of them differently. The police, having lost round 1 haven't given up hope and are trying every trick in the book to nab Vijay !!Who wins this cat & mouse game forms the crux of the plot.The Hindi remake, like the original has a runtime of 2 hrs 33 mins & around 1 hr 30 mins are pretty laid back with the story proceeding at a leisurely pace. But dont get fooled by this as the movie picks up speed in the last one hour as it moves ahead with one dhamaka after another culminating in a mind-blowing climax.Performances by Ajay Devgan and Akshaye Khanna are exceptionally good. Tabu, Shriya Saran , Rajat Kapoor, Kamlesh Sawant and Ishita Dutta too are awesome!!An absolutely unmissable movie that remains faithful to the original. It was heartening to see audiences cheer Akshaye & Ajay's dialogues just like the good old times. Go watch it in the theatres .. you won't be disappointed for sure!!Going with 4 stars out of 5 .. Adios🙂",
            "review_date": "2022-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great performances, superb movie 👏🏽",
            "content": "It's a great movie. After a very long time I've been for a bollywood movie and i was very happy with Drishyam 2.Note: I had watched Malayalam Drishyam 2 on OTT, so i knew the story. But at no point i felt bored. The performances were unique and dialogue deliveries were excellent. Ajay Devgan and Tabu did great and everyone else enabled them to excel in it.The cinematography was amazing keeping you hooked onto your seats.The best part was the casting was the same as part 1. We could see how everyone has actually changed with time and could relate.The movie is skillfully made such that even if someone has not watched part 1, can enjoy this movie.Definitely a great movie to enjoy with family.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gasp-inducing twists n turns throughout with a solid unsettling atmosphere.",
            "content": "I saw this on the third day of its theatrical release with my entire family n extended family.Once again like it's predecessor, this one too aint ur regular Bollywood trash as there aint no songs, no dance, no unnecessary shirtless stuff, no gravity defying badly choreographed action, no jingoism n no melodrama.The cinematography is top notch n so are the performances.Akshay Khanna looks like he is heavily suffering from muscle wasting. He is a good actor but he needs to take care of his muscle mass n bone density.This one is better than Suspect X (2008), Perfect Number (2012) n The Devotion of Suspect X (2017).All are based on the 2005 novel The Devotion of Suspect X (2005) by Keigo Higashino.",
            "review_date": "2022-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best the year's finest thrillers.",
            "content": "I might not have been able to experience the magic of Drishyam, one of the best crime thrillers from Bollywood even though a remake, on the big screen, but I was determined to experience the sequel in cinemas at any cost. Also, this was my first experience of a night show, and that too without wearing any masks as opposed to my previous cinema visits. And man, I was wowed. Drishyam 2 delivered nonstop entertainment and lived up to the expectations.Unlike the first film where I didn't know what to expect from the plot, I knew about this one and hence expected twists from the beginning, due to which the first half felt slower. The previous one had a lot of twists in the first half alone, due to which comparisons are inevitable. But the first half isn't wasted in unnecessary songs or comedy. It cleverly prepares the conflict through introductions of characters both old and new, and like a proper slow-burning crime drama, gives ample time to the development of the plot. You might feel that the intermission block has arrived either too early or nothing too big has happened this far, but trust me, you're in for a surprise! What might feel unimportant in the beginning will turn out to be a major asset in hindsight!As the second half begins, the tension begins to rise. Casting Akshaye Khanna as the rival of Vijay (played flawlessly by Ajay Devgn) turns out to be a brilliant choice, as he proves to be menacing at times even though we know he is not a bad guy. There are references made to the previous film, which can both surprise and make you chuckle. Unlike big-budget blockbusters we've seen this year, Drishyam 2 isn't replete with otherworldly visual effects or songs to make you tap your foot.Then what is it that captivates you and makes you ignore the lack of the aforementioned elements? The story. Yes, you might buy the ticket for the stars as they're all big names, but you'll leave your seat impressed more with the story. I can't imagine the film without the intelligently written story which compensates for the lack of any masala or visual spectacle one might be mistaking this film to offer. Also, I would love to reiterate that the performances were all terrific, and provided just the right amount of support to the story and the overall product. The final act is the best part of the film where I couldn't believe what happened and also couldn't help but laud the genius writing.Even though a remake (I will check out the original and other remakes too), Drishyam 2 is one of the finest thrillers of the year and promises entertainment replete with drama, suspense and surprises worth the price of your ticket. It's good to see the film is running successfully even though there are new releases out in cinemas. I'm glad I didn't wait for the OTT release and instead went ahead with enjoying this masterpiece on the big screen. Recommended!",
            "review_date": "2022-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Expect the Unexpected (10/10)",
            "content": "I have always regretted not been able to watch Drishyam (2015) in theaters. But the day Drishyam 2 announced I decided to watch it in theaters for sure.I have literally no words to praise this masterpiece. This movie is gonna create history at box office for sure.Ajay Devgn and Akshay Khanna did fabulous work. When I watched Drishyam in 2015 I told one of my friends that it's my favorite Ajay Devgn movie but now it's Not. Now Drishyam 2.I don't want to spoil anything for you all, just go to cinema hall and watch this movie or you will regret it for sure.It is one of the best suspense thriller from bollywood.HIGHLY RECOMMENDED.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Very Gripping and Intelligent Sequel With Perfect Twits and Turns !!!",
            "content": "The sequel to Drishyam, which is adapted from a Malayalam thriller of the same name, begins where the 2015 film had left off-Vijay Salgaonkar (Ajay Devgn) emerging from a police station carrying a shovel. Seven years ago, the almost-perfect crime had a witness, and that's what gives the police impetus and ammo to revisit the Sameer Deshmukh missing-case investigation so many years later.Vijay is now a theatre owner who dreams of making a film based on a story he has written. His elder daughter Anju (Ishita Dutta) is still reeling from the shock of the traumatic events, while his younger daughter Anu (Mrunal Jadhav) is in her teens. Every member of the family, including his wife Nandini (Shriya Saran), is moving on with life as usual-but always on guard. And with a haunting sense of fear which never leaves them. A series of unexpected events turn the Salgaonkars' lives upside down when a truth threatens to change everything.Even the support Vijay received from his community seven years ago, begins to dwindle as the plot unfolds, and they begin to question if he actually committed the crime. The film gathers up steam when the police investigation led by Inspector General of Police Tarun Ahlawat (Akshaye Khanna), and Sameer's (who's accidental death in Drishyam formed of the crux of both the films) mother and former IG Meera (Tabu), swings into action. This time, they follow the leads without underestimating the protagonist.Following a similar pattern like the first, helmed by the late Nishkant Kamat, here director Abhishek Pathak takes things slowly in the first half. The family's dread and anxiety are palpable as he gradually builds the tension in the narrative. As the investigation progresses, every character serves a distinct purpose, and helps heighten the drama and suspense.Ajay Devgn shines as a protective father who loves his family unconditionally; he is a simple man with a razor-sharp mind. Akshaye Khanna, who in the past has played a cop, in films like Mom and Ittefaq, lends much gravitas to these gripping proceedings. Tabu is simply outstanding as Meera, a mother seeking justice for her son. Rajat Kapoor shines as her husband who eagerly wants everything to be settled soon. Kamlesh Sawant reprises his role as Gaitonde, who is still ruthless and bloodthirsty for revenge. Shriya Saran, Ishita Dutta, and Mrunal Jadhav, who play other Salgaonkars, have almost similar roles as they had in the previous part. Saurabh Shukla as writer Murad Ali plays his part well to resolve the mystery.Jeethu Joseph's original story is skilfully adapted by Aamil Keeyan Khan and Abhishek Pathak. They deftly weave in multiple threads, leading to a stellar climax packed with numerous twists that are as good as the first film. While the first one undoubtedly had a certain novelty to it, the sequel stands strong too, it intrigues and entertains. The story here remains unpredictable for the most part, however, some of the setups seem contrived and some situations too far-fetched. Having said that, making a sequel to a very successful first part wherein most of the characters are the same is quite a challenge.Amitabh Bhattacharya's song Sahi Galat that comes with the credits and the title track is upbeat. Saath Hum Rahein is slow but perfectly filmed to capture the bond family share. The background score by Rockstar DSP (Devi Sri Prasad) blends well and adds to the intensity of the drama.Overall, Drishyam 2 dishes out plenty of twists and turns to keep you hooked throughout, just like its predecessor. And the story of the Salgaokars will continue to remain in public memory.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "there is no terror in the bang, only in the anticipation of it.",
            "content": "Stepping into the theatre, it is natural for you to think, is there really the need of a sequel? Is it just gonna be another cash grab or there really is more story to tell which can match the complex narrative and high stakes of the first film which was so perfect in every way? Believe me, in the climax, you'll literally start clapping to the film's genius.The film starts off with the anticipation that Vijay and his family from the first film might, they just might get caught for their crime they committed 7 years ago and managed to get away with it by fooling the entire police department just on the basis of visual deception.The film starts off slow prioritizing the world-building and characters over the plot, but that's just the beginning, because the payoff it gives at the end (trust me, it's even more bonkers now) is just phenomenal. Having written a script myself (which took me 3 weeks by the way), I can only imagine of getting such wild and risky ideas to put in the climax. Cheers to the original writer Jeethu Jospeh for coming up with such unique concepts and connecting them to cinema.Ajay devgn once again beautifully portrays the protagonist (still scecptical on this one) Vijay Salgaonkar who appears stoic and calm on the outside but is planning everything to keep the secret \"buried\" on the inside. Tabu as this ex-cop turned grieving mother out for revenge and closure is just a perfect follow-up to the original film. Kamlesh savant returns in his role as Gaitonde and does not disappoint, he still oozes the same anger he had 7 years ago on Vijay for ruining his career because he was the only one who knew the truth behind it all but lacked the evidence to prove it. But, out of all the returning cast members, it was Akshaye Khanna, the new addition to this universe, that stole the show. Just his presence is enough to make the screen shine and his dialogue delivery is enough to give you the chills.The soundtrack once again, hits hard. Absolutely thrilling and apt for the scenes. Alhough, it isn't Vishal Bhardwaj who has composed it, Anil Johnson does manage to keep up with him and provide some good scores.One thing I would like to point out is that the film also delves deeper into Vijay's mindset as a person. It perfectly depicts how Vijay and his family with him will have to be in fear their entire lives just to keep the crime they committed a secret. Even though, they are free, freedom isn't with them. There is a beautiful line at the end of the film which goes like, \"even if Vijay manages to escape the cops with his wits forever, he will never be able to match eyes with the parents of Sameer Deshmukh (the boy who was murdered in the first film)\" indicating how ashamed he is and his life itself is his punishment.A perfect sequel, that's it. Vijay Salgaonkar is indeed, the smartest man alive.P. S.: this film does a few things different than the original Mohanlal film in order to streamline the runtime and it does manage to do so successfully, but deep down, I feel that it was Georgekutty's (Mohanlal) journey that comes a step above (you'll understand it if you watch the original Malayalam film) and shines just a little brighter than this.",
            "review_date": "2022-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This Hindi remake destroyed the most important scene in the original Malayalam Drishyam 2 and rushes the best parts of the climax in the original.",
            "content": "After watching the trailer of the hindi remake of Drishyam 2, I was excited to watch it even though I knew the twist after watching the original one starring Mohanlal.So finally went and watched it today, found the first half more interesting than the original and got hyped as the best part was yet to come.And then when the climax portions start, they go destroy the best part of the original movie which is the scene where the biggest twist is revealed.This is the scene where the judge reads the DNA report in the courtroom and reveals that the skeleton is not of Sameer.Now let me tell you what the difference is in both versions and how this remake ruined it:Malayalam Version - In the courtroom everyone is shell shocked, cut to police/Tabu gang - Tabu character stands up and yells 'Noooo'. Closeup of everyone in shock, great bgm and such an impactful scene. Top cop Murali Gopy in frustration says \"What was the damn climax?\"Hindi Version - Zero reaction from Tabu/Akshaye and gang! Seriously? What were you thinking? Such a big twist and everyone is just looking down as if they knew it all along and Akshaye just mumbles \"Woh doosra climax kya tha?\". As if twist gaya baad mein mujhe toh kahani sun ne ka hain! Even in court room just confused looks, not shock. And Ajay Devgn just stares in one direction. Look at Mohanlal, still in character looking down with shame for what has happened.Akhaye Khanna did a splendid job but they changed the role of the top cop in the original a lot which I didn't like. In the original it felt natural and more like an IG/police officer played brilliantly by Murali Gopy whereas Akshaye's role felt more like that of an income tax officer rather than a cop.Shriya Saran is a huge letdown because she can't act and just keeps moving her eyeballs in various directions to express fear or takes a big gasp and it looks so weird.The torture scene by Gaitonde was not required and I actually laughed out during that scene because Shriya Saran taps the table she is thrown on, which looks like as if she is in a WWE submission match.In the original it was more of a mental torture which looked more natural.So they improved few things from the original but destroyed the best scene and rushed the climax, made some bad changes as mentioned above.You may enjoy it if you haven't watched the original. But later if you watch the original one, you'll know what I'm talking about.",
            "review_date": "2022-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just ok...",
            "content": "Keeping it short, I just didn't enjoy this movie as much as I hoped i would. I've watched the Malayalam Dhrishyam 2 several times. Despite knowing the suspense that too. It's because the film apart from its strong story was also technically brilliant. Also the chemistry between its cast members was impeccable. That family looked like a legit family and Mohanlal and his wife looked like a traditional Indian couple. Absolutely flawless chemistry. Same thing unfortunately can't be said about this Hindi remake. There was zero chemistry here. Also the kids were forgettable unlike the original where you will clearly remember the kids in the family.I'm not against remakes as long as they are done perfectly. But this is, forget perfect, not even just good enough. I liked The Hindi part 1 and his absence in this part can be clearly felt here. This director doesn't hold a candle to Nishikant Kamat who made a remake also equally good as the brilliant original.I guess it's all due to comparison. My younger cousin seemed to like this and she hadn't watched the original. So maybe if you haven't watched the original Malayalam movie then you will like this but as someone who holds the original to his heart, this remake was absolutely disappointing. Very forgettable.",
            "review_date": "2023-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Drishyam 2",
            "content": "Drishyam 2 is a crime drama mystery thriller film directed by abhishek pathak. It is the official remake of the malayalam film 'drishyam 2' directed by jeethu joseph.Well, what do i say about ajay devgn. He is the living embodiment of 'be so expressive with your eyes, that your words don't hv much to do.' Again, he has acted full to his potential. His body language, dialogue delivery everything is on point. Shriya saran gave a decent performance according to me. Ishita dutta and mrunal jadhav brought the required aftereffects of trauma and distress. Akshaye khanna really elevated the scenes with his determined demeanor. He brought a sense of stoic presence in the film, a worthy opponent of vijay. Tabu and rajat kapoor did not have much space to do anything. The rest of the cast did their job. Kamlesh sawant as gaitonde again brings in that kick with his evil shades.Technically, this film is superior to any that you would find. Its cinematography uses a cold hue to saturate its frames, maybe as a picture to what trauma and PTSD feels like. The shottaking is good as well. The sound design and background score is enthralling and epic. In the scenes of high intensity and tension, the bgm elevates the film to a whole new level. Superb work!!The screenplay is tight and engaging. The first half builds up the characters, which honestly,\ni would have liked more. The second half brings in the mystery and tension which we are accustomed to with a drishyam film. The twists and turns are logical and have been justified as well. They really do surprise you. The two very superficial characters at the beginning are dealt with superbly in the climax. This also indicates how much realism and logic has went into the writing. Really loved it!!The dialogues are gold. And when you have stalwarts like ajay, tabu and akshaye with their gold dialogue delivery, its such a sweet pie. Dialogues have always been the strong suit of a drishyam film.I would have loved to see how late nishikant kamat would have handled it. RIP sir!! Nevertheless, this has been a bomb film with an excellent execution and superb twists and turns. Must watch!! 9.5/10.",
            "review_date": "2023-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful Story",
            "content": "Ajay Devgan delivers his first hit after debacles like Thank God and Runway 34. Nice selection of script he has probably done. Tabu as always gives a powerful and impactful performance after Bhool Bhulaiya 2. Like Part 1 the role she had done in part 2 it's awesome and better than part 1. Having a talented actor like Akshaye Khanna is what makes the film pull off in theatre's. Rajat Kapoor makes a brilliant comeback and performance again in Drishyam 2 unlike in part 1 he did. Saurabh Shukla delivers a good performance though his role could have been a little more. Overall full paisa vasool film go watch in theatres near you.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Outstanding film! Blockbuster",
            "content": "The movie starts off with a slow and smooth story line and grows into something crazy.. the entire movie is directed so well... story is top notch. The movie has a lot of twists and turns.Seeing ajay Devgan and Akshay on screen is just energising. Honestly the twist and end of the movie blows your mind, cause I don't think anyone can guess what's going to happen. The sequel lives up to the expectations and surely is bigger and better than the first one.Story: 9/10\nActing: 10/10\nDirection: 10/10\nSongs: n/aOverall a super watch, a must watch for the families and a complete entertainer.Hs reviews.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie is awesome.",
            "content": "Incredible movie .. i just loved it absolutely a masterpiece.Acting .. story .. climax everything is just perfect. Ajay devgun's acting is just mind blowing.I don't know how should i praise this masterpiece ..\ni'm speechless everything is mind blowing.Climax will hit you hard .. definitely a pure masterpiece.. the first half was slower but that's ok after the climax you will feel real experience of crime thriller.One of the best thriller i have ever watched in my life\nEverything is just on point in this incredible crime thriller movie .. i am sure everyone gonna love this movie .I just freaking loved it.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the biggest plottwists for any world class level cinema",
            "content": "Just came back from the theatre, I have no words to describe my inner excitement, and that \"Uffffff\" moment.... I would suggest, weak hearted people should avoid watching this movie. The plottwist was unexpected, and even after watching, you wouldn't believe. Screenplay, Direction, background music, heavy weight story, and acting everything was magnificent. I was at the edge of my seat, and the movie engaged me fully in the 2nd half. Though first half was a bit slow, but when the thrill started going high, chill went through my veins....... Undoubtedly, it was a world class level plot twist in the climax... ...",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Justifiable Remake 👍👍",
            "content": "*** Drishyam 2 Hindi Movie Review****Directed by Abhishek PathakStarring Ajay Devgn , Tabu , Akshay Khanna, Ishita Dutta Sheth , Rajat Kapoor, Mrunal Jadhav in lead roles...One Word Review.... Justifiable Remake 👍\"Some mystery remain to be unsolved which toils the peace of the victim\" & here Vijay Salgaonkar and family undergoes the same pain even after 7 years. Whether this time Vijay will be behind the bars??? Needs to be watched.Those who had watched the sequel of Drishyam 2 , malayalam version will definitely know the climax but those who don't, Ajay Devgn's Drishyam 2 will be an intriguing thriller movie experience.Those who have watched the original also might feel the thrill as here we could able to see how Vijay Salgaonkar, his family , the police handles this case..When talking about the performance, it was a pool of talents on one screen. Akshay Khanna cop presence was totally a different experience of what Murali Gopy had performed.Akshay Khanna's portraying as IG wherein he portrays as a cop with shrewdness, composed mind but knows where to hit. His screen presence was totally an add on flavour to the movie.Gaitonde inclusion in the script which is an addition from the original also brought a laughter and suspense kinda ambience.Apart from that, Ajay Devgn, Shriya Saran, Tabu, Rajat Kapoor again worn up their respective dresses of their characters and gave a stellar performanceSo, after a long time a well known remake movie but still refreshed to watch as this crime which is still refreshed after many years.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely brilliant film.",
            "content": "Absolutely brilliant film. Wonderful acting by all characters - but main role Ajay Devgan!! What a turnaround in plot after second half!!Although most of people know the story after watching malyalam version of drishyam 1 and 2, but the acting by akshaye Khanna, Tabu, Ajay Devgan's Family and Ajay Himself steals the show.About the film-\n1st part is little bit boring as they spend 1 hour in introduction of characters and their family life!! David who saw Vijay disposing the body could have told the police about him much earlier which can make the film end little bit earlier but since film is about maintaining suspense till last, it fits better.I would recommend everyone to watch this movie in theatres and not on ott.",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The story writing just blows your mind!",
            "content": "Usually when sequels fail in Indian cinema, drishyam 2 has held its ground very firmly and the writers have done a phenomenal job! The story, the build-up is superb. It's a must must watch. Loved it!The movie doesn't loose it's pace even once. The story before or after the intermission just kept us at the edge of our seats! I didn't even left my seat for a 2nd round of popcorn! Imagine! I wish to see this movie again.The cast is as usual amazing and the director has kept the time of the movie very much on point. No glamour. Just the story. That's what we expect the cinema to be. Great job to every contributing member of the crew and cast.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "DRISHYAM 2 is Winner for Sure..... Perfect Sequel.....",
            "content": "#Drishyam2 WOW THIS IS CALLED MASTERPIECE IN EVERY ASPECTSTORY, SCREENPLAY, BGM, CASTING EVERYTHING ON TOPNOTCHFirst Half is little Slow in Pace but You understand it when You watch Second Half, especially ClimaxAJAY DEVGN in top form from start to end 🔥🔥🔥Akshaye Khanna is Perfect for the story..... Great WorkTabu is Best as AlwaysShriya Sharan, Ishita Dutta, Saurabh Shukla, Rajat Kapoor and All others are done Good Job.....Devi Sri Prasad's Music is Mind Blowing. He will surely get more movies in Bollywood after DRISHYAM2And Lastly, Clapp for Abhishek Pathak. Phenomenal job Done by HimGO AND WATCH IT 👌",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not airtight but worth watching",
            "content": "Sequel to the much raved about Drishyam, Drishyam 2 redefines what it means to make a sequel. Bare minimum, yes, but in this age of constantly degrading depth and meaning in Bollywood, where sequels are nothing but a way to capitalise on the brand of a successful film, this is a heartening sight. That doesn't absolve Drishyam 2 of its flaws, though.The pacing in the first half is understandably slow, given its genre, but at times it leaves you restless. The film does reward you for most of it in the second half - specially the climax - but I believe the first half could still have done with a bit more judicious editing.There's also issues with direction. For instance, the film is naggingly obsessed with the slow-motion effect to the point that it overuses it and it inevitably loses impact even in scenes where it should have worked.The film's cast is fantastic. Be it the lead cast of Ajay Devgn to Akshaye Khanna or the supporting cast of Kamlesh Sawant (Gaitonde) to Siddharth Bodke (Braganza). The background music adds perfectly to the film and the cinematography captures the magic of Goa (and its relentless rains) beautifully. The film also hits the buildup right and has definitely set up the third part well with the revelations in the climax. However, a key part of the denouement relies on suspension-of-disbelief which for a realistic thriller like Drishyam 2 is bothersome. Without getting into the spoilers, I would just say this film isn't as airtight as the first part was. It's also not as engaging as the first part which got to the point much faster.Overall, Drishyam 2 is still worth watching for it is a rare thriller franchise that is both indigenously made and entertaining for the most part. I am going with 6/10. Bonus points for being the first film to use humor against the brainless and jobless boycottbollywood propagandists.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Original Have that essence but it....",
            "content": "Loved the acting of actors, what a performance.Storyline is slow but negligible.Akshay Khanna is Good as he is always.Tabu continues the same\nPerformance.Thrilling experience, Engaging storyline.Now the 2nd part of Review for those who have watched the original Drishyam 2 the Resumption.A worth watch to those who didn't watch the original but not actually for those who have watched it.I have no words, it's not like I'm appreciating the story.The copied everything, not a single creativity.Makers didn't even bothered to make a change, they thought original drishyam 2 was awesome, so they copied it all.Original have that essence but it doesn't have that thing.I have watched the original so this doesn't engage me, nor thrilling.I was not happy after watching it. Just a story which is just converted from south to hindi.But okay.A awesome work by Jeethu Joseph. Loved it. (the original one)Review of Drishyam 2\nitsbymayank Mayank Bharat Bhushan Louteriya.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good remake!",
            "content": "A lot has been spoken about this and the original so I'll do a minor comparison of both.The remake probably also began filming after lockdown, so that would have helped.Malayalam - slow burn, more of a drama until the end. Hindi - made for a commercial audience, shorter runtime and more 'cinematic' shots and dialogues.The build up of daughter's trauma, the friendship between Jenny and Shriya seemed rushed only on comparison - but you don't feel it when you're watching Hindi just by itselfThe IG 'reveal' seemed more 'dramatic' in the Hindi version.The sets in Hindi were TOO CLEAN. Why is Vijay Salgaonkar living in a palace? Georgekutty's place wasn't too big, was it?I thought Mohanlal and Meena looked more 'regular' than Ajay and Shriya, she looked like she was in a Sanjay Leela Bhansali movie. Adds to the plot? No. Takes away from the plot, no. So, not sure why.Overall - still a brilliant story regardless of if you've watched the original or not.",
            "review_date": "2023-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie is good for one time watch but not the same as mohanlal's drishyam watch it if you like the trailer just go to the nearest cinema",
            "content": "I watched this movie on the first day of the first show but I was really disappointed by the storyline starting 1 hour of movie they only showing on positive scene no mystery no investigation of tabu son's murder no action no thriller only family drama actually they've wasted one hour of audience it was too boring it's worth it when akshay khanna comes to screen he reopened the case and mystery was begun only last 30 minutes are mind blowing\nAnd they show real cruelty and film climax is also really good, come to the direction whole movie is frame to frame shoot just same as mohanlal's drishyam This movie director should learn direction how to direct and shoot the scenes, most of the scenes he spoiled over all movie is really good ajay devgan acting is good no doubt about it tabu and akshay played really awesome performance they fitted in the character,and background score is not that good but bollywood should stop making remakes cuz people are already fed up ,They didn't watch anymore people are already boycotting they must start with a new format Otherwise bollywood will disappear only seen in web series it's a average sequel . My genuine ratings to this film 05 starts out of 10 ⭐⭐⭐⭐⭐",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great watch!",
            "content": "Drishyam 1 had set the high expectations from this one and it doesn't disappoint for the most part.The storyline is great. The way they've brought the turns and twists keep you hooked. Some things do looked a bit stretched, in terms of imagination, but still a good plot and execution.The cast is pretty much the same, except the addition of Akshay Khanna. Very similar, amazing, performances from the repeat cast. They could have gone with someone better than Akshay Khanna, like Boman Irani or Raj Kumar Rao. AK struggles with expressions and doesn't seem to be contributing to lift the movie.Overall, it is still a good watch, especially if you have been a Drishyam fan.",
            "review_date": "2022-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb",
            "content": "Drishyam 2 is a superb power packed movie 1st half is little bit slow but 2nd half is excelent. Twists & Turns, Suspence is very good climex is superb. Ajay Devgan's Acting is superb Akshay khanna, Tabu, Shreya Saran, Ishita Dutta all doing good job. Story is good backgroud sound is superb. Climax is big plus point of this movie. Some other actors who played diffrent roles also doing good job. 1st half can be 5 to 10 minutes short. Some light comedy moments is also very good i think this comedy moments good for this type serious movies. So if you like 1st part of movie you will be like second part also. In my opinion a must watch movie for all cinema lovers.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Extremely Good and Suspenseful Script",
            "content": "Hi Reader,This is one of the best and breathtaking movies that someone can ever watch. The storytelling and storyline is so epic and very well constructed that no other movie could ever be.Spoiler could be nothing except for watching First part of this movie. Both the movies are very much interlinked with to one another.The characters in this movie have played an excellent role. I would definitely recommend watching this movie with part one.I am very well pleased to share my experience though these words and lastly would recommend watching this suspense full movie for om very beginning till end.Thank you for reading this far.Regards,\nSaurabh Krishan Gulab.",
            "review_date": "2022-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Flawless copied work",
            "content": "Right from the opening scene, each frame was well connected to the first version. The detailing for each scene was simply mind-blowing to watch. Most of the characters played in the first version were retained and only few new faces played their part in the sequel. All the new characters introduced in the sequel were perfectly synced with the plot. Director justified the new roles and their contribution for the twist and turns in the screenplay is quite amazing. Moreover, that build up is needed to create that tension atmosphere in the minds of the audience. In terms of making and screenplay the first version is too good but it is a worthy best try from the director to give us a edge of a seat thriller experience in the sequel.Overall, Drishyam 2 is a rare best made sequel.",
            "review_date": "2022-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An honest copy-paste makes for a thrilling watch to the freshers.",
            "content": "Drishyam 2 (2022) :\nMovie Review -Ajay Devgn, aka Vijay Salgaonkar, is back to save his family and fool the cops again. As he quotes, \"Sach ek din bahar aa hi jata hai,\" we were all prepared for the body to be found even before watching the film. Mohanlal's \"Drishyam\" (2013) was a sensation in Malayalam cinema and in the movie buffs' universe because nobody would have expected a cover-up thriller to be so good and captivating. Nobody would have imagined a sequel to the masterpiece suspense Drishyam had, but then we had Jeethu Joseph and Mohanal's duo pulling off an impossible and unimaginable classic sequel to cult Drishyam. The Hindi remake, \"Drishyam\" (2015), couldn't become a sensation and a huge blockbuster at the box office like the original Malayalam flick, but it gained a great fan following in the past 6-7 years. Now, the sequel is finally here, and it's another honest remake like the first one.Drishyam 2 takes place seven years after Sameer Deshmukh's murder mystery, as Vijay Salgaonkar (Ajay Devgn) and his family members are still looking for peace and happiness. Meanwhile, a newly appointed IG, Tarun Ahlawat (Akshaye Khanna), has started to investigate the same case to prove Vijay's crime. Suspended inspector Gaitonde (Kamlesh Sawant) and Mira Deshmukh (Tabu) try their best to find proof against Vijay to avenge the humiliation and personal loss. At last, the body is found, a few pieces of evidence are collected, and Vijay confesses to his crime. But will that be the end or has the fourth-failed Vijay Salgaonkar got some bigger plans to fool the cops? Go to the nearest movie theatres to know all the answers.Drishyam 2 was an easy script for the makers, as they simply copied and pasted the original source material. I don't know what changes Abhishek Pathak has made, as he claimed in media interviews, except for Gaitonde's addition to the narrative. The Malayalam flick is about the protagonist vs. The new IG, whereas the Hindi remake is about the protagonist vs. 3 cops (Tarun, Gaitonde, and Mira). This seems to have done injustice to Akshaye Khanna's character because the Malayalam flick gave full exploration to that character. The runtime is slightly less, but it didn't feel that engaging at all. Drishyam 2 does have a couple of scenes of its own, though, but nothing more impressive or better than the Malayalam thriller.Ajay Devgn's Vijay Salgaonkar is quite different from Part 1, and rightfully so. The gap of 7 years has to be filled with a few changes in appearances, and Ajay wore all the changes very well. Those intense eyes are at work again. Shriya Saran gives a top-notch performance, and Tabu is amazing in whatever few scenes she has. Ishita Dutta has grown up as a character, but it reflects on her performance too. I was expecting more from Akshaye Khanna, but he was slightly underwhelming. Mrunal Jadhav, Prathamesh Parab, and Saurabh Shukla barely appear to be noticed, whereas Kamlesh Sawant's Gaitonde still leaves the same impact. Overall, the acting unit has done fairly well, but the potential was greater because this was a performance-oriented film.We always say that an ideal suspense thriller shouldn't have songs and a runtime of over 100 to 110 minutes. Hollywood understood it in the 30s only, when they started making talkie cinema, but the techniques, storytelling, and viewing consumption have indeed evolved over the years. Drishyam 2 is neither songless nor less than 2 hours long, yet it doesn't feel boring. Don't know how, but the film has actually managed to do it. Malayalam Drishyam 2 did look longer, but it was a proper cinematic experience, which forced the viewers to overlook the length. The Hindi remake tries to work on the issue but doesn't add up to anything effective. The technical aspects are nice, be it cinematography, editing, or the background score.Abhishek Pathak is promising in his second film, but I think he has a lot to learn, especially in the cinematic sense of storytelling. You remember the courtroom scene in the Malayalam flick when the judge says it and the camera goes zooming in on George Kutty with slow motion visuals and a staggering background score? That was a damn classy frame. Believe it or not, but Abhishek Pathak has missed it here. Yes, you heard it right-he missed the best moments from the classic thriller while remaking it in Hindi. Jeethu kept it intact even in Venkatesh's Telugu remake, but Pathak just couldn't understand what it actually meant. He missed many important pauses, too. As you know, copy-pasting a story or film is easy, but copying somebody's vision is not possible. Drishyam 2 Hindi remake might prove it to you. Except for a few faults like this, there is nothing majorly wrong with the Drishyam 2. And like he says, hero to aakhir me jeetna chahiye! We all enjoy that.RATING - 6/10*",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome Sequel",
            "content": "Perfect sequel to the one of the best Thriller of the Indian cinema.I had watched the Malayalam version so I knew the story. Hindi version is frame by frame copy of the original malayalam version.All the cast did justice to their roles. Direction is top notch same as the first one.But, Real hero of such movies are the script writers like Jeethu Joseph who came up with brilliant scripts and the director Abhishek Pathak who did the justice with script. The outcome is another masterclass after Drishyam.9 out of 10 stars because I have watched the original Malayalam version(10/10) and I feel that Mohanlal was better than Ajay Devgan.",
            "review_date": "2023-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "BLOCKBUSTER !!",
            "content": "What you will do if you want to protect your family from a murder case ?! . Drishyam, it's a movie about small happy family but there life turned upside down because of a murder case . Before you watch the second part of the movie I advice you to watch the first part for the sequence of events . And honestly the movie needs Focus and attention .First of all , I would like to say that this movie is the best Criminal movie I have ever seen before . Its really the best and its a completed movie from all sides . The cast is amazing and the acting is so good , the way ajay devgan and tabu and that new police officer also the family members of ajay's they all acted amazing , but the most two people who acted really amazing are ajay and the new police officer and the daughter of ajay .The second thing is the plot . So many twists and so many things that makes your mind blow and burn , you can't expect it . You expect everything but not the plot especially the ending . The third thing I liked is the soundtrack and the music and the quality of the movie , it was amazing and suits the weather of the movie and really amazing . The last thing I liked and the most is the directing and how they showed the plot I mean the way they did is Fantastic and so creative .To sum up , I want to say this is the first movie since 2019 I didn't write the disadvantages and things that I didn't like because I really mean it that this movie a perfect completed movie and I liked evrything about it . Also I advice you to watch if you were free or bored and I advice you to put it on your Movies list don't miss it . Finally I would like to say that I rate this movie 10 out of 10 . Better to watch it !!",
            "review_date": "2022-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply mindblowing",
            "content": "Watched a bollywood movie after a long time and it definitely didn't dissappoint. Sequels in bollywood are always not much correlated but this one is just out of this world. Keeps you at the edge of your seat from strat to begining. Ajay devgan's acting is just brilliant. He never dissappoints. The other characters have also done their job very well. The direction is well knitted and you don't find a moment where you actually want to keep your eyes away from the movie. Most of the time when it comes to a sequel of a thriller movie, you don't really get connected and are made only for the sake of money. But this one has to be one of the best, of not the best.",
            "review_date": "2022-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Super se Uper",
            "content": "Fantastic movie by Ajay Devgan.. after Drishyam 1 another master stoke.Its better than Mohanlal's Drishyam..Both 1st half and 2nd half is completely engaged to audience... 10/10. Last 30 minute it was awesome completely suspense. Must watch. Drishyam 2 Excellent Sequel ,Outstanding edge of the seat thriller , poora paisa vasool 4 Star Firstly Big big big salute to Jeetu Joseph for this masterpiece original story for Drishyam 2 . Vijay Salgaonkar returns in the 2nd installment standing strong to save. Soo much detail as this is a direct continuation of the first one and it's very very good! I actually didn't think the fi.",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent Sequel",
            "content": "Indeed it was good, the story continued on the very same background of part 1.Firstly, you need to watch the first part of the movie, without it this second one will not make any sense.As the movie started, it took very long to reach the exciting part, but it was all story and plot being build, at one point i was a bit bored, as was not having the thrill as the first one. But the last 2/3 part of the movie, full on suspense unfolding, excitement being build and finally concluded.Very few Bollywood movie has sequels and this one was certainly very good.All actors, just like part one continued with this roles, exactly the same and superbly.Must watch.",
            "review_date": "2023-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Drishyam 2 Will Be A Blockbuster In Bollywood Cinema",
            "content": "The movie which I was absolutely waiting to see after seeing its part 1 - which was just mind blowing and absolute edge of a thriller. After seeing part 2 trailer the eagerness was much more and did it lived up to the expectations ????I haven't seen Malayalam version of this movie so I won't be comparing with it. This movie has amazing plot with some really outstanding twists and turns. Ajay Devgn, well no one can beat him in this style of acting, his eyes and his body language are dialogues for him. New entrant in this sequel - Akshaye Khanna was outstanding and probably he only could have taken up this role. Cos against AJ's aura everybody would feel like pheeka pakwan. But he stood and he delivered brilliantly. The twists & turns keeps you on the edge of the seat. An important sign of a good thriller is not building suspense but fulfilling the audience with truth at the right time and Drishyam 2 nailed it to the perfection. Credit to story writer for such a brilliant story and great execution by the director too.There are hardly few sequels which were worth making and watching it and this is one of them which you would love to see it. This movie is definitely worth a dekho and that too in theatre only. Nowadays you hardly find people clapping or whistling at the end of the movie, but I witnessed it today and after a very long time for a movie. It's a top notch suspense thriller !!!PS : In the end Vijay Salgaonkar should have been a given a punch line against Gaitonde.",
            "review_date": "2022-11-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Drishyam 2 an excellent sequel",
            "content": "A great execution of a brilliant suspense thriller story in decent backdrop of Goa by Abhisek Pathak and his Team. Cinematography by Sudhir Chaudhary & Sandip Francis's Editing is something classic. The Film drives by thrill factor. Tight crispy screenplay by Aamil Keeyan Khan and narration is simply superb. Brilliant mind blowing delivery by underrated Akshay Khanna, blasting performance by Ajay Devgan and promising performance by Kamlesh Sawant as Gaitonde, as usual unparallel by Saurabh Shukla, Rajat Kapoor, Tabbu.Aamil & Abhisek in one place missed the originality and that's ...in front of IG an suspended Gayetondke started slapping Ajay's family which is not possible. There are cameras all over the police station & senior officers can track it. It is against the rule that male officers will physically torture of female suspects. No men's allowed to touch a female even if they are the culprit, only female officers are allowed to handle them. At the time of Ajay's confession the lawyers need to be there because he has the right to ask a lawyer.Any way a Magnificent venture by Director Abhisek Pathak and his Team with marvellous music & background scoring by Devi Sri Prasad.At a costing of 50 crores Film already collected\napprox 250 crores.The Film has lot of twist & turnaround..\nIt was fun to watch.",
            "review_date": "2022-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Masterpiece indeed!",
            "content": "An excellent storyline with intense suspense after interval... The story gets it's true nature with the powerpact acting of Ajay Devgan and Akshay Khanna... The climax its just mind-blowing and no one can ever guess before the way story unfolds its secret... From the starting of the movie the background music helps you to sense the true suspense... The malaylam movie was diamond but is certainly a diamond with much more cuts and luster in it... Akshay khanna gives his powerful presence in almost every frame... The series is truly very very special for all the thriller lovers... Go and watch this must watch movie with no nonsense flawless story...",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing",
            "content": "We all have already witnessed what happened with vijay's family... and with that same thrill and suspense ... the second part will steal ur heart... though it is a remake of a Malayalam movie but most of us haven't seen that movie so if u haven't watched that film i am sure that u will gonna love this part too as much u love the first part... cast did a amazing job as they did in first part and u will not feel like sequel released after 8 years .. all the actors of the film holded their character so beautifully that is feel like they are living their character life for real and everything is going in continuity... last 15 min of the movie will give u goosebumps and will automatically makes u to give a standing ovation to our fav Vijay Salgaonkar... I deducted 1 star bcz as it is a remake that we can't ignore.. but overall nice screenplay, amazingly written movie and a must watch if u haven't watched it in Malayalam language.",
            "review_date": "2023-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A mediocre sequel...wasn't required",
            "content": "I am still not sure the intentions of the makers behind creating this sequel, and then with some clear loopholes in the storyline!!.. there are a few and then there are some weak writing and scenes.They made it so simple, with another person getting release from the jail, same after 7 years when police again started to look deeper into the investigation and very easily some police detective got hold of an evidence (in terms of some taped convo!!! Again the dumbo wife!)And I dont know why! I mean why even in the 21st century we show our wives and daughters so weak, confused and stupid!!! There are scenes which just doesnt make sense to me other than that, writers were lazy to come up with something more creative and stronger.Even after 7 years, the wife and daughter (and I can understand her issue to an extent after the killing episode) just dont seem to understand what has happened. Writers couldn't provide proper character arc for the wife. She doesnt have any depth in the character portrayal and unfortunately writers keep showing her as total dumb, even tho she looks and dresses so smart!!IThis is a story about a parent trying to save the daughter and family, but in typical bollywoodization they made it a One man hero show! I was expecting more depth, better and detailed scenes with strong and creative dialogues, but it was just a whimper, with usual bollywood masala of style over substance... The ending is underwhelming and we should just accept it because yeah it is gullible Indian audience and they are immature and cant control that the protagonist side can have ANY causalities! I Only watched for Tabu and whatever timeframe she was given on screen she did her best. Akshaye is dependable but he wasnt given much to do except to look serious and spit out some heavy dialogues....Try some more Bollywood!... OTT has surely made a difference and we know we have writers, directors, and actors that can lit up the screen with more creative scripts! Better luck next time!",
            "review_date": "2022-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another remake !",
            "content": "Watch the South version of Drishyam 2. It is outstanding. The thoughts behind the film , the characters, the language , the sentiments should be in tune with one another. Simply remaking won't fulfil the idea of popularizing the film. The hindi version will not touch the entire national mindset. Drishyam 2 south is a masterpiece. So the art and film society should make amends in popularizing this film in malayali with appropriate subtitles in almost all language, english is a must for NE Region.Apart from these Ajay Devagan doesn't fit well in the role of Mohanlal. He is well suited in the role of a criminal or a revolutionary. In part 1 also its the same issue. The idea itself doesn't fit well the Bollywood mindset , also not in tune with its fans. Since a work is done by spending money so a 2/10. But this is not worth !",
            "review_date": "2022-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disappointed!!",
            "content": "I seriously do not understand, why they have to come up with this Sequel!! Most likely they had nothing to really do and being bored sitting home during COVID and just want to write something up.......Drishyam was way better and gripping tale and on the edge Thriller.Drishyam 2 on the other hand, just doesn't make any sense, stretched out and very predictable....Acting was Good, Story was just a so so.....The guy who was in Jail, remembered seeing Ajay 7 years back after midnight in the dark, had showel in hand....walking out of the Police Station.....I mean SERIOUSLY!!!Let me repeat.....7 years back, after midnight, he remembered the exact location when they building was getting constructed.....he knew the spot 7 years later and Ajay's face in the dark with little light.....Doesn't really make sense.....I mean just showing whatever comes in the writer's head.....Way OverHyped Movie and nothing else.....",
            "review_date": "2023-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Highly Recommended 👍🏼 by Hit Ya Flop - Movie World",
            "content": "Drishyam 2 is a well-written sequel and a well-directed remake with some amazing performances. The story of the sequel is also brilliantly written by Jeethu Joseph that is packed with many surprise moments and an applause-worthy climax. Director Abhishek Pathak's last film was Ujda Chaman (2019) and after that, he has shown impressive growth and successfully delivered a faithful remake of a great suspense thriller film.Although the first half of the film was slow-paced, especially in the initial portions but becomes engaging soon due to the performances. The screenplay by Aamil Keeyan Khan and Abhishek Pathak is gripping in the second half. The audience will be glued to their seats till the end credits. The dialogues and the cinematography were also noteworthy in the film. Rockstar Devi Sri Prasad's background score is exciting and goes well with the thrilling premise of the film.Ajay Devgn, once again, delivers an outstanding performance. He gets back into the skin of the character of Vijay Salgaonkar and does entire justice to the character. Akshaye Khanna was a good choice for the sequel and he delivers a notable performance. Shriya Saran, Ishita Dutta, and Mrunal Jadhav were fine in their roles. Tabu, Kamlesh Sawant, Rajat Kapoor, and Saurabh Shukla had given decent supporting performances.Drishyam 2 Movie Rating:\nDirection 3.5/5\nActing 3.5/5\nDialogues 3/5\nStory 4/5\nScreenplay 3.5/5.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Next Level Movie...!!!",
            "content": "Drishyam 1 was already so awesome that wasn't expecting it so be exceptional but I was 100% wrong. This movie is equally great as drishyam 1 and may be better than it. Everything was on point and obviously because it's a sequel of drishyam, so the story was just something else. Acting of Ajay Devgun was also as good as the part1 and keeping the cast same as all the previous cast was also a great move which makes us feel like we're just continuing from exactly where we left. The comeback of akshay kanna was also great, he's a great actor. I'm finally happy to see bollywood doing something good. Anyway, I totally loved it. A must watch movie...!!",
            "review_date": "2022-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awsome Movie",
            "content": "Awsome Movie.. Climax is awsome.. Please go to theater 🎭 and watch this with your family 👪... Trust me your money is not going to waste... Full of suspense and story adaption from real movie is awsome. All the actors done fantastic job in the movie.. This is called remake.. If you love suspense movie then climax is going to thrill you and you are going to enjoy this movie... Director is awsome and I think this movie is 1 step ahed of part 1 because of climax.. I am happy to see akshay khanna as a cop his acting is superb.. All cast and crew worked fantastic..\nSo go to watch movie and do not spread spoiler..",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing remake, a great movie after a long long time",
            "content": "I watched Drishyam 1 in Malyalam and then in Hindi. When Drishyam 2 came out, I decided to watch the hindi version only and I was not wrong. This is genuine effort which has outclassed the Malyalam version. The story keeps you intact and it feels like it should never end. Every character has justified his role and Akshay Khanna is at his best. This movie was all Ajay Devgan and Akshay Khanna's movie and is amazing. Love it and a must watch for sure.I watched on OTT hence the songs were not present and it was all story and acting. When the whole story stitches together, an outstanding story comes out. The satsang was called out and it was the best part.",
            "review_date": "2023-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Too long and slow",
            "content": "Well I have watched drishyam ( the first part) the day before I watched this movie; and it was a mistakeThe first thing I felt was the suspense didn't even start till interval. I was like what is going on what m I watching and why?Then after interval it will get some pace and yes it was almost a good movie but boy do not compare it with its first part. Drishyam was far better like way better than drishyam 2.Ajay was cool but rest of the people failed to put their mark unlike the first part. May be the problem was one will continuously comparing it with its first part.But nonetheless it's a good thriller in this market. Cheers.",
            "review_date": "2022-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic storyline with mind blowing finish",
            "content": "This is an wonderful movie. Great storyline, mind blowing finish. And the important part is every actor done justice with the characters they have been allocated for. We have seen very good work by all of the actors in Drishyam part one. Here Akshay Khanna is a new addition in a crucial role of police IG who has re-opened the murder case. And I must say as usual he won't disappoint the audience. The good part is in this movie you never feel that storyline is getting repeated. Here everything is new and one must have to watch the part one for best understanding. But I was expecting some more contribution from an great actor like Saurabh Shukla. Anyways can't get everything from a movie. But I must say this is a full paisa wasool movie.",
            "review_date": "2022-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "little crispier than original",
            "content": "Drishyam2 is an absolute WINNERThe addition of AkshayeKhanna to the cast was a masterclass move. The man oozes a confidence in front of camera that will make you wish to see more of him at the moviesA tight & engaging script, a restrained & effective AjayDevgnSo Good 👏🏻\nand how bloody good is AkshayeKhanna in Drishyam2A character completely modelled differently than what MuraliGopy did in the original. There is sarcastic tone, wicked smile and spunk to him that really intensifies each sequence he features in.MORE OF HIM PLEASE 🔥Overall DRISHYAM 2 has enough THRILLS & DRAMA to make for a RIVETING WATCH; Rides on a POWERFUL second half, that keeps you on the edge of your seat, whereas the first half takes time to establish itself. The final 45 mins are sure to SURPRISE; Go watch.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "master piece",
            "content": "Ajay Devgan delivers his first hit after debacles like Thank God and Runway 34. Nice selection of script he has probably done. Tabu as always gives a powerful and impactful performance after Bhool Bhulaiya 2. Like Part 1 the role she had done in part 2 it's awesome and better than part 1. Having a talented actor like Akshaye Khanna is what makes the film pull off in theatre's. Rajat Kapoor makes a brilliant comeback and performance again in Drishyam 2 unlike in part 1 he did. Saurabh Shukla delivers a good performance though his role could have been a little more. Overall full paisa vasool film go watch in theatres near you.",
            "review_date": "2023-01-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Competent Storytelling but not without its flaws",
            "content": "I have been (and continue to be) one of the few loyalists who would rather see the Bollywood version of the sequel than the original Malayalam thriller (this may sound strange but people like us exist too).As a fan of Bollywood's version of Drishyam, I had purposefully waited months to witness this second instalment in theatres. However, due to some urgent issues at the time of release, I was unable to! Since then, I have been patient and waited for my turn to see it on the streaming site, and today, when it was finally made available on Amazon Rent, I immediately started watching.In no way, shape, or form is the storytelling flawless. There are, in fact, quite a few flaws against which you can present arguments. Nonetheless, this succeeds in numerous ways. The performances are strong, the score matches the bill, and the script, despite its modest imperfections, gave enough moments of suspense and surprise.My only big complaint is with the film's beginning, where the build-up takes center - stage and the organic progression takes a back seat. It took a substantial amount of time to start moving, but once it did (literally, when Akshay Khanna enters the frame), there was no turning back! Everything was set in action as it was intended.",
            "review_date": "2022-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dragged out BS.. 1 was way better",
            "content": "Murad Ali is your living witness that the story was given to him by vijay.. So is that security guard who was promised a role in vijays filmWhy is the body so important.. When you have a confession by wife recorded by undercover girl cop..IG is introduced as the smartest cop ever... But just simply went through the motions.. Not a single wow move except over acting..Why wait 7 years? Fake neighbors could've been sent earlier...Stupid forgetful neighbor witness remembers tiny details from a single night 7 years ago..Movie made for money and didn't give a F about logic. Waste of time and money.",
            "review_date": "2022-12-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a frame-to-frame remake.. enjoyably crisp! [+73%]",
            "content": "This remake stays mostly faithful to its source material, trimming some of its soapy flab, and making it crisper and engaging. One thing I didn't quite like is how Ajay Devgn remains wooden throughout the highs and lows of the film. Mohanlal in the original was subtle, but you notice a sense of brewing trouble in his body language the first time he's cornered. Tabu is the consistent performer here, and her presence is not scattered unlike Asha Sharath's. Akshaye Khanna also puts up an enigmatic show as the IG, offering the right balance between clever and intimidating. The major plot points are left intact, so the climactic scenes didn't surprise me. That said, the writing decision to bring back Gaitonde was a good move.",
            "review_date": "2022-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect as a sequel as well as remake!!",
            "content": "Drishyam 2 review :A direct sequel to Nishikant Kamat directed Drishyam (2015) and a remake of its Malayalam namesake released on OTT last year, Drishyam 2 turns out to be watch worthy on both fronts - sequel as well as remake. Infact, this is one of the best remakes seen in Bollywood after a long time.Cut to the plot, Vijay Salgaonkar (Ajay Devgn) is living a peaceful life with his family gradually tiding over the crisis they faced seven years ago. It is only when the newly transferred cop Tarun Ahlawat (Akshaye Khanna) comes to his town and re-opens Sam's missing case that Vijay and his family get in to trouble once again. Tarun is Meera (Tabu)'s ex-colleague and close friend and he vows to nail Vijay at any cost. But can he?!!Staring with a slow pace, the film skyrockets once Akshaye Khanna enters the frame and trust me, his introduction scene got as much ceetis and taalis as Ajay Devgn got earlier. The twist just before the interval is fantastic and the second half turns in to a practical hide and seek game which is truly fun to watch.The performances are first rate. Ajay literally shoulders the film on his own. Akshaye Khanna leaves a mighty impression as the investigating officer. Tabu shines even in a small role while Shriya Saran looks gorgeous even in a modest saree.Drishyam 2 is a thoroughly engaging fare which serves as a perfect sequel to first part. Personally, I found Mohanlal's original slightly better but this Hindi adaptation is also worth your ticket price. Book early as the shows are full.Regards,\nSumeet Nadkarni.",
            "review_date": "2022-11-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A genius protecting his family",
            "content": "This masterpiece doesn't need a review to explain its work.Acting, direction, editing, cinematography, background score everything is perfect\nWe didn't have time to notice what is wrong in this movie , starting to ending we were engaged with the characters with emotions\nThe technique and masterplan executed by the lead role and opposition party was perfectly placeI didn't watch the 1st part but it didn't confuse me\nI understand every detail, the way this goes from beginning , slowly I realised that how i missed this beautiful movieAnd that climax\nSatisfied me\nIt's a good movie watch with family\n👍",
            "review_date": "2023-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A decent sequel",
            "content": "The original movie was a good suspense thriller drama and one of the remakes which was executed properly. The story, screenplay, acting, suspense, thrill, drama, direction, execution everything was good. If I talk about the sequel, it felt the same as the first. The screenplay and execution felt little bit weak as compared to the original but overall everything was good or above average. One thing which I personally didn't like was the pacing of the movie. At some times, it felt like movie was too slow and in some scenes, it felt fast. In other words, the pacing was uneven.Overall, it was a good movie which you should definitely give a try after watching the first part.",
            "review_date": "2023-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Creativity at its best",
            "content": "A masterpiece by actor ajay devgan and director abhishek pathak. The plot has its own high creativity level and the movie has a beautiful direction and actors did a great job as well. But no one could have acted it so well as done by Ajay Devgan. An originally directed and written movie. Who would have thought that after so many flops bollywood will give a gold.About the movie, akshay khanna is a great choice for this role as a cop and everyone knows about the versatile taboo. The movie started slow but didn't get boring at all during the running time.The twists in the tales are very unexpected and no body can guess what the end would be.A must watch movie.",
            "review_date": "2022-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome thriller and suspence movie",
            "content": "Drishyam 2 is a story of a man do any things to protect his family. That movie is an inspiration for all a man to stand with their family in every situation , and never leave the family alone. In this movie the Performance of all the Stars and Co- stars are sooo Satisfying and entertaining ..Especially the acting of Vijay salgaonkar (Ajay Devgan) , and his wife nandani salgaonkar is very\nappreciable. The Story of this film is also sooo good . Overall the experience of the moive is sooo good .I watched this movie on my laptop.This movie is actually one of the masterpieces ever made in bollywood.",
            "review_date": "2023-01-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ajay proves that content is king!!!!!",
            "content": "Just came out of the theatres,and I am shocked, speechless at such an impeccable film! The way the story progresses,the tension brought in by akshaye khanna,Ajay Devgan's eyes,the brilliance of Tabu! And the most shocking plot twist you will ever witness! Don't miss this film in the theatres,otherwise you would be kicking yourself when you see it in a smaller screen! Brilliant! The music of DSP,the crisp editing,gaitonde sahab stealing the show,and some impeccable references to the original. This film will have its status as a cult classic,just like the first part. I know it's too early,but can't wait for the third part!!!",
            "review_date": "2022-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "awesome climax",
            "content": "Drishyam 2 is a story of how a dad and alsso a husband goes to any extent to protect his family. THis movie is an inspiration for all husbands, dad to stand with their family in all times, however worse be the circumstances and never leave the family alone. Nice acting by all the cast. I was really impressed by the acting of grave digger character (I can't find the name on internet-actor name). I was also impressed by the acting of Rajat Kapoor and Akshaye Kahanan and Sarabh Shukla and Kamlesh Sawant in the film. Very nice performances by all the cast. FIlm story was intriguing, engaging, thrilling, full os suspense. You won't know till the end what the picture climax will finally turn out to be. I also liked the songs and music of the film. Very nice lyrics and music. Lyrics and beats well matched to the situations in the movie. FIlm cinematography, editing was sharp nice not boring at all. You will get hooked to the story throughout watching the movie. I had a great time watching the movie. This movie started only with so much thrill and ended also in a suspense end. I really liked the message in the end of the film by AJay Devagan that even after he tries to defend his family he cannot watch eye to eye with the father of the boy their family has killed. This movie dialogue were also touching and really well written. I cannot remember that dialogue that I really liked. Very nice dialogues of the film. Story was also very nice, full of twists and turns. I had a really nice time watching this film. Really recommend you to watch this film. This is a paisa wasool film. Everything you get in this film, family story, drama, crime and murder mystery and a whole lot of suspense. I rate this movie 8 stars out of 10. I would recommend even more stars for the film. Not to forget Ajay Devgan and Shriya Sharan and Tabu being the main cast hold the story of the movie really well on their shoulders. Ishit Durra was also good. Mrunal Jadhav was cute. Siddharth Bodke one more star actor to watch out for.",
            "review_date": "2023-01-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Too far-fetched, yet entertaining",
            "content": "After seven long years, the story of Drishyam starts off from exactly where its first part had concluded. The family of a middle class person who has a penchant for movies is again in trouble for whatever had happened seven years ago courtesy an accidental eye-witness and some chess like clandestine moves made by the cops who have not closed the case by labelling it as unresolved. The case file of killing of a teenager is still open in the police headquarters. This middle class (and low educated) man may still be categorized in the middle class but now his class is the upper middle class. He has earned enough money to graduate from a cable operator to a theatre-owner. And he has been planning to make a movie himself, discussing his story with a well-known screenplay writer for cinematic adaptation. He has got the story published also in the form of a book (apparently) for copyright protection. What are his real intentions ? Is he still concerned for the safety of his family (from the claws of the law of the land) ?Well, to understand the things in the right perspective, we have to go in flash back, i.e., the story of the original (first) movie titled as Drishyam (scene) which had been released in Malayalam in 2013 and its various remakes in different languages were released in later years (all the versions filled the coffers of their makers like anything). Jeethu Joseph who had taken the credit of the story (calling it as his 'original') had only directed the Malayalam version. The truth of his so-called originality is that this story had been lifted by him from the novel of Keigo Higashino - 'The Devotion of Suspect X' which was first published in 2005. Anyway.The Hindi version, i.e., Drishyam (2015) was directed by (Late) Nishikant Kamat in which the protagonist's role was played by Ajay Devgan whose teenager daughter accidentally kills a spoiled teenager who was trying to blackmail her on the basis of a video of hers clandestinely shot by him. The dead boy was the son of a supercop Meera Deshmukh (Tabu) who is the Inspector General of Police of Goa (where the story is set, in Pondolem to be exact). Her businessman husband Mahesh (Rajat Kapoor) is a sensitive person but Meera is a ruthless cop as well as an aggrieved mother hell-bent upon seeking revenge from the killer. Now our hero named as Vijay Salgaonkar who is a less-educated person and fond of watching movies on small screen (as well as learning various things from them) has to dispose off the dead body in such a way and create such an alibi that himself alongwith his wife Nandini (Shriya Saran), elder daughter Anju (Ishita Dutta) who is actually the killer and younger daughter Anu (Mrunal Jadhav) remain uncaught by the scanner of the law-enforcers. And he successfully does it, checkmating the cops including the mother of the dead boy. Meera Deshmukh resigns from her job and the parents of the boy migrate to London, rendering a sigh of relief to Vijay.Since this well-made movie was hugely successful on the box office, making its sequel made sense. Now a story was required to put Vijay and his family again in trouble due to the killing that had taken place years back and showing the protagonist emerging as triumphant in the end once again (because that kind of end only is desirable for the Indian audience who cannot withstand their hero to lose to anyone including the law of the land). Since Jeethu Joseph only has claimed the credit of the story directing the original Malayalam version himself only once again, the question that propped up in my mind whether he has lifted the basic grains for the story of this sequel also from somewhere. Well, neither I have been able to figure that out nor any known film reviewer (at least till now). Hence let's give Jeethu Joseph the credit of the story which is more intriguing but less curious than its previous part because the novelty factor is missing. We don't know the plan of Vijay to safeguard his family members from the law in this reopened murder case (which as we have been told somewhere in the movie, had never been fully closed by the police), however we are always aware that something is going on underneath his various activities apparently unrelated to this 'case' and in all probability, he is going to outwit the cops this time also. In the prequel, everything done by the protagonist (leading his family members also in that) was before the audience alongwith his purpose, still the curiosity factor was bigger. In this sequel, everything done by him has a hidden purpose which is revealed much later (in the ending reels only), still the audience is not very curious. That does not mean that the narrator has failed in entertaining the viewers. The movie is entertaining, no doubt. The thing is that a lot of time has been taken for the build-up and the real tension which keeps the audience hooked appears in the post-interval session of the movie only. The protagonist is relaxed (at least he appears to be so). And so do we.The revived cat and mouse game between the cops and the hero picks up speed with the cat having many faces including a new I. G. of Police (Akshaye Khanna), the ex I. G. of Police and the mother of the killed boy (I won't term him as the victim because it was he who was victimizing the daughter of the protagonist) plus the suspended corrupt cop who has a score to settle with the hero with a few others whether in uniform or civil dress (i.e., undercover cops). The father of the dead boy is a sensitive (and sensible) person who wants to move on in life alongwith his wife and that's why he requests Vijay for the remains of the dead body of his son for proper cremation. However the mother wants to find them out on her own (with the help of the police, of course) so as to throw Vijay and his family behind the bars and in the legal trap thereafter. How Vijay saves himself and his family forms the remaining part of the story whose climax tells us that everything done by him in the narrative (prior to the climax) had the same purpose because he was always expecting the case to be reopened with a new box of troubles for them. In the same vein, it tells us that even the bit characters those had appeared in the narrative at various places were linked to his complex scheme. I found his scheme (fully revealed in the end) as amusing but too far-fetched. Popular Hindi pulp fiction writer (Late) Ved Prakash Sharma used to present such too complicated schemes formulated by the criminals in his novels. Vijay's scheme reminded me of them.New director Abhishek Pathak (as the director of the prequel Nishikant Kamat had passed away in 2020) has done his job well. However his job was not very difficult because he had to remake a Malayalam movie as it is without any kind of adaptation on the story aspect. He has changed only the milieu just like the prequel (changing the location from Kerala to Goa). However he has kept the length of this Hindi version shorter than the original which appears to be right considering the fact that now the Hindi movie audience of this era does not like too long movies. The fact that the hero and his family are able to live a posh life within a span of just a few years appears odd. Cinematographer Sudhir K. Chaudhary has captured the beauty of countryside Goa (not the happening areas) very well. Other technical aspects are also in order. Devi Sri Prasad has composed two good songs for the movie. All the same, it would have been better had the rap song which tells the essence of the story been kept in the movie and not played with the end credits rolling on the screen when the movie is over.Since the cast of the prequel has been carried over to the sequel, the actors have only replayed their parts which was not very difficult for them. Ajay Devgan is no match for Mohanlal (the great Malayalam actor who has played the protagonist in the original version) but no doubt, he has excelled in his role (just like the prequel). His eyes speak and indicate the churning going on in the interiors of his outer cool and calm personality. Tabu is effective in her low footage role also as she appears to be like a lioness waiting to prey upon the killer (or the killers) of her progeny. Akshaye Khanna presents nothing new in his cop avatar. He appears to be the same cop played by him in some earlier films.An esteemed film reviewer has rightly asserted that the story of Drishyam (including both the parts) has been liked by the audience so much because it's been woven around Indian middle class morality which advocates protecting own family at all costs and which glamorizes the underdog and vilifies the privileged. Another esteemed reviewer has also rightly asserted that the success story of Drishyam underscores this fact that we prefer what we feel right to what is right. Well, I have to agree to these views in the absolute sense. The killing which forms the basis of the Drishyam story had (inadvertently) taken place in self-defense. However the protagonist does not consider the option of coming clean before the law and get his daughter acquitted from the murder charge based on the self-defense plea. Instead he decides to play a hide and seek game with the law-enforcers. May be because the law enforcement agencies of Mera Bhaarat Mahaan, more often than not, indulge in harassing (and extorting) the underprivileged instead of ensuring justice to them.The lesson of the movie is very clear - the question is not what is in front of your eyes but what you are seeing (that's the real Drishyam or scene for you).I agree to it.© Copyrights reserv.",
            "review_date": "2023-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hats OFF Sir 🙇‍♂️🎉",
            "content": "Hi everyone. Please go watch this!! This is worth your money and time. If not watched, please watch the first part on Netflix or Prime Video.(in order to watch the second one). When you go watch this, first half is very much introducing new characters. Second half is very these characters are very useful and help build the suspense. Very solid acting by Akshaye and Ajay sir. Tabu ma'am's acting is very good and helpful. All rest of the family's acting was very solid. The story, plot and everyone acting will blow your mind. The climax is the nail biting part and where it will blow your mind. Once again, hats off!!!!",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A taut thriller which sets a franchise....",
            "content": "\"Drishyam\" was a taut thriller with some unexpected twists with a common man fending his family from law when his daughter accidentally commits a murder. The case is reopened after 7 years in this sequel, which is equally compelling and surprising to its prequel.The film just continues the saga with the same backdrop and characters, and the sequel retains the same freshness of the first part. Despite a different director and the time lapse, the film perfectly gels with the first part and nowhere feels a different territory which most of the sequels feel. The first half is a bit slow with the background getting built up with the reminiscence of the first part. The second half is fully surprising with the viewers left to ponder on what went reprising repeated viewings. Perhaps it sets a franchise in family thrillers with a next sequel to be anticipated in \"Drishyam\" franchise. Overall, the tremendous performances, family theme, and the low profile it keeps turns into a masterpiece.Rating: 3 stars out of 4.",
            "review_date": "2023-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Professor of India",
            "content": "He is really professor of India outclass story even I'm from Pakistan but appreciated. Delivering a gripping and suspenseful tale that will keep audiences on the edge of their seats. Mohanlal once again delivers a standout performance as Georgekutty, a man who uses his intelligence and quick thinking to protect his family. The film takes a new direction from the first film, introducing new characters and fresh twists that keep the story fresh and engaging. The writing is top-notch, with a strong narrative that will have you guessing until the very end. The film also features a talented supporting cast, who bring depth and nuance to their roles.",
            "review_date": "2023-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why should I watch it again!",
            "content": "After watching the movie I realised bollywood only knows to copy and paste South Indian movies. When the original movie is available online for free why again watch. Yes it was curious to know how different it's made in Hindi. I must say it's the exact scene to scene copy paste. There is nothing new to the original movie. Ajay Devgun is at his pinnacle of his acting whilst Tabu and others have justified their role. The only contest for this rating is for the director who shamelessly copies and tries to market it to other platform. Why can't he think of subject of his own instead of running success from other people. Yes it's a must watch and I recommend everyone to watch if you haven't watched the original Malayalam movie.Don't expect anything different from the original !",
            "review_date": "2022-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ajay devgan performance and stage presence were great, but the movie is not that good to watch starting one hour pathetic, watch it if you like the trailer.",
            "content": "Great acting by both actors ajay devgan and akshay khanna i watched part 1 it was massive success at box office overall movie is good for one time watch if you watch it again you'll get bored only last 30 minutes are magnificent it was literally Goosebumps\nWhen akshay khanna comes to screen and starts reopened the case and filed, finding buried corpse when tabu appears it was best moment in movie but it's not that good as we expect from ajay devgan films it's literally frame to frame same as mohanlal drishyam release on Amazon Prime just 1 year ago\nAnd come to the direction abhishek pathak should learn how to direct films how to shoot he just spoiled the film by his stupid direction and ideology we must want this movie get success in box office\nWhy bollywood keeps remaking now remakes won't work at all hindi cinema should take care of themselves otherwise bollywood will disappear only original content can save bollywood otherwise it can only be seen in web series on ott\nAs I said remakes won't work this times people are boycotting films in previous days many high budget films failed pathetically at box office over all this movie deserve 5 out of 10 ⭐⭐⭐⭐⭐⭐",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "UNPREDICTABLE...",
            "content": "Abhishek Pathak does the job this time. Though Nishikant Kamat is not there with us but still the movie has been made with the memory of him. First of all I haven't seen the original one so I can easily say this movie is an amazing experience for me. Movie starts where the 1st part ended but with the leap of 7 years. First half takes time to set up the scenerio as it should be but the entry of AKSHAYE KHANNA is where the fun begins. Totally unpredictable story with edge of the seat thriller experience. Everything is going on in front of you but still you can't even predict the single thing and that's the beauty of this movie. AJAY DEVGN is in insane form in this movie as the rest of the cast. Well as compared to 1st Drishyam second is little slow as it takes time to set up but still you can easily skip that portion of the film. If you are a thriller fan don't skip this. It's a must watch if you haven't seen the original.....",
            "review_date": "2022-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Average movie",
            "content": "I like drishyam one comparison of drishyam 2. When I watched drishyam 2 in theaters I didn't feel any excitement. First half of movie was so boring but Second half little bit ok comparison of first half. All characters was same except ( akshya khanna) Ajay devgan acting was so poor comparison of akshya khanna. Akshya khanna was Trump card of this movie. We felt so excitement after akshya khanna entry. Music and song of movies was not good. But this movies a family movies we can easily watch this movie with family no adult sence in this movie. Drishyam one was blockbuster because that time no one knew it this was a remake of South Indian movies. Nowadays bollywood are just focusing in remake of movie.",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Slowly builds up to a great climax",
            "content": "Whenever there's a sequel of a super hit film, there's this added expectation from it and makers are constantly reminded of it, and most of the time, they try to follow the same formula that worked the last time around.Unlike Drishyam, which keeps you invested right from starting, this one is a relatively slow starter, and there are a few moments in which your mind can wander off. But with Akshaye Khanna's entry, the script picks up pace. He is intimidating yet subtle. With him enters Gaitonde! At some point, he says he can forget his wife's birthday, but he cannot forget the events of 2nd and 3rd October, lol; the guy despises Vijay and his family, which hasn't changed in all these years. More than anyone else, Gaitonde made me want to watch the first film again.The climax feels rewarding, and it logically places all the pieces in place, which I think has become a trademark of this franchise.\"Shabdo pe nahi, drishyon pe dhyaan do, kyuki shabdo mein jhoot chupne ki jagah dhoond hi leta hai, lekin drishya. . . Drishya kabhi jhoot nahi bolte. Isliye,\nSawaal ye nahi ke aapki aankho ke saamne kya hai. . .,\nSawaal ye hai ki. . . Aap dekh kya rahe ho.\"",
            "review_date": "2023-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Master piece",
            "content": "Before watching this move i was fan of money heist series and its story, but after this money i am shocked. This move left back money heist series. The plottwist was unexpected, and even after watching, you wouldn't believe. Screenplay, Direction, background music, heavy weight story, and acting everything was magnificent. I was at the edge of my seat, and the movie engaged me fully in the 2nd half. And if you are BP patient dont watch this. The movie will make your hear beat up down .. They way story is twisted it is a huge mind game. And head off to the writer of the story. We indian cenima requires theses type of scripts and movies.",
            "review_date": "2023-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "hard to imagine topping the genius of the original",
            "content": "It is hard to imagine topping the genius of the original, or even exceeding it, but this sequel has succeeded. Once again the brilliant Vijay finds himself battling with the ghosts of past sins, except this time the grim reaper is the new, determined Inspector General Tarun, played well by Khanna. I am impressed they brought back all the old players and seamlessly jumped ahead 7 long years. I am even more blown away at how Vijay anticipated exactly how these threats would play out, down to the minutest detail. This time his manipulation of illusion extends beyond the local game to the system itself. His enemies never stood a chance, so well thought out is his every move, so well crafted the narrative defenses around his little world. There is a nice touch of closure to this sequel, with human kindness between enemies. It is hard to imagine how they can extend this amazing series to a 3rd installment.",
            "review_date": "2023-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good but the Malayalam version is so much better",
            "content": "This is a sentence for sentence remake of the Malayalam movie - Drishyam 2. Ajay has delivered fine acting and some supporting casts are good too overall but dialogues aren't on par with the Malayalam version. Even editing, music, and build-up of the twists/suspense is better in the Malayalam movie.Still, it's a worthy remake. If you don't want to watch the original with an English subtitle, definitely go for this movie.Talking about the movie, I'd say that it's as good as Drishyam-1, if not better. Few can predict that story like it unfolds. You'll know when you see it.I hope the makers go for another sequel - a part 3 - because this movie definitely has a built a good fanbase.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Commendable Movie 🙌🏻👏🏻",
            "content": "Brilliant movie 👏🏻\nThrilling , full of suspense, drama, action and emotions. This movie revolves around the Salgonkar Family and Meera a previous cop and her husband Mahesh Deshmuk and there son Sameer Deshmuk. Well in drishyam 2 there is a new entry of (Akshay Khanna ) as the New IG police who also tries to investigate the Seven years ago a case of Sameer Deshmuk who despaired and murdered and no sign of his dead body, no trace , he is a tough police officer and tried his best to break the case . The rest of the cast , characters are almost same.The movie is full of Twist and turns and it'll hook you to your seats till the end.The great direction, story line, writing and acting. Starring: Ajay Devgan, Tabu, Rajat Kapoor, Shriya Saran , Ishita Dutta, Kamlesh Sawant , Mrunal Jadhav , Akshay Khanna and etc.Definitely Recommend.",
            "review_date": "2023-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dialogues could have been better",
            "content": "The first movie was far better in terms of dialogues and dialogue delivery. Drishyam 2 feels dry and unemotional. Let's talk about each aspect of the movie one by one.Cast:The IG: Akashay was a good choice for the role but he should have been in his uniform as it could have given more power to his character. Plus, he was supposed to be serious, not funny.The shadow police: The two actors were not fit for the roles. The actors in the Malayalam version were a much better choice and they performed a lot better.The eye witness: Again, he was unsuitable for the role. The guy in the Malyalam version was a better choice.Former IG: Tabu should have been a little more worried and upset but his was expressionless half the time. So, I was unable to connect with the mother emotionally.Songs and background music:The songs were all forgettable as they were not enjoyable at all. Unlike Drishyam 1, the background music was not thrilling or suspenseful, which reduced the impact of intense situations in the film. I found the music pretty boring.Dialogues:The original 2015 film was fantastic in terms of dialogue and dialogue delivery but this one falls flat in this department. In the first film, every dialogue was catchy, powerful and beautifully delivered.Direction: This is one of the biggest flaws of this sequel. The new director failed to make the actors express their emotions in each situation. The actors' faces were almost flat even in intense situations.The first director could have done much better if he were alive. So, I think the director was a wrong choice for this film.So, I will give 5 out of 10 points to this film. It's a nice one-time watch unlike the first movie that I have watched a dozen times without. It was a perfect movie from all angles.Go watch this sequel as it's still better than a lot of Bollywood movies released over the past 10 years.",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb movie",
            "content": "This movie is the continuation of the first part and yes it has justified the continuation. You can say beautifully crafted and well executed. The movie's original version was out almost a year back. If someone has not watched the original they would find this interesting but if you watch it in original Malyalam version,you may find a different spicy flavor. This bollywood version is equally interesting and has its own flavor. But if you want more go for the Malyalam version,its on Amazon Prime. The ending is same but the second half of the movie is different. Watch both the version, they are available on amazon Prime,the Malyalam version is available with Prime membership and for bollywood version wait a little or you can rent the movie. Dont miss either of them. Both has their own flavour and will entertain you completely.",
            "review_date": "2023-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You are going to hate the Hindi version once you see the original",
            "content": "What a pathetic remake of the original movie except a few scenes.There is zero reaction from Tabu/akshay when the knows the story and you should watch the original to get the actual feel of itThe song portion in the first half was good, also a few extra added scenes from the original came out nicely.One of the best scenes in the original were the explanation of the timeline of the hero's night when the crime was done by the IG ( portrayed by Murali Gopi), was very very cold in the Hindi remake.If you watched the original, you gonna love the original and dislike the Hindi version for sure.",
            "review_date": "2023-01-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great but not as good as original - worse screenplay",
            "content": "Jeethu Joseph's sequel is phenomenal and deserves a 10. This too is gripping but Khan-Pathak duo's \"adaptation\" of the original screenplay has made it definitely worse. They have added the usual Hindi movie masala of a song & IG Ahlawat's visit's unnecessary drama (maybe to take advantage of Akshaye Khanna's abilities). To accommodate those additions, they have cut very relevant parts of the Malayalam version (which I watched in dubbed-in-Hindi form). Both the meetings with the writer & the watchman are reduced and that makes the ending fit less well than in the Malayalam version.Unless you are a super-fan of Ajay Devgn or just can't stand dubbed versions, I would recommend the original one over this in a heartbeat!",
            "review_date": "2023-02-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The right sequel",
            "content": "Whoever blamed Bollywood that remake is destroying it, they need to see this film and understand that it's not remake, it's the right execution that succeeds.The film tells story about how a father saves his family and himself from an inescapable crime. Watch the failure of powerful & intelligent investigative effort and still feel satisfied with the climax.Ajay Devgn, Tabbu, Akshay Khanna, & Kamlesh Sawant delivers their character so well. Others were just supporting characters who either didn't get enough to show their part and lack their convincing ability. I wish if Ajay Devgan had actually kept his look from the first film. It's still an awesome movie to see.",
            "review_date": "2022-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good but loosely framed",
            "content": "The movie is good watch but not entirely thought and doesn't look strong on certain aspects, that why couldn't they show the audio in the courtroom as a proof itself instead of just the recorded video, if the police investigation was that long and silently done, how come they just missed to think that the recorded video of Vijay may get called forced, where did the point even came from?2ndly when Vijay is so smart to plan out things n to think - nobody will look into their own house, he himself missed his own\nbugged house , n why didn't he keep his family on same page for some things for situations like this.Courtroom is weak, these people want to get him punishment for what he has done but aren't bothered to show up in the court and aren't carrying anymore solid proofs for any glitch inbetween if in any case this current confession is dismissed.Police is just shown stupid at their part that they were good at interrogation techniques but didn't plan it quite well knowing n quoting that their target is quite a smart person.Nobody tells how a book suddenly comes into a picture and nobody tells the court who wrote the book and nobody even connects the person who wrote the book since it was published just an year ago. Nobody even cares to read the book or keep it as a reference. Nobody asks who has read the book to claim the story is picked from there.Nobody cares about who was the other body planted (since they temper with the evidence) in the police station and who would have done it and how was that David guy so sure about it that he recalled an instance of 7 years back in such a case. Isn't it alarming there's a body in the police station buried for years n nobody knows a thing about it.The daughters were young, class 12 n class 6th students, n as they mention Anju is still in school , she should ideally be having a job right now, graduated from college and the younger daughter should be in class 12th and not that young still.No cameras in an institution? That too where evidence are kept. Surprising.",
            "review_date": "2023-01-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "MASTERPIECE!!",
            "content": "Such a well directed remake!!The first half feels slow but do not loose hope as its strings are connected with the climax.As the movie progresses minute by minute in the second half the twist begin which keeps you at the edge of your seat.Special mention to the climax\nTHE MOST UNPREDICTABLE CLIMAX EVER\nThe audience in the theatre were literally clapping\nSuch was the power of the story, screenplay and direction!!Hats off to Jeetu Joseph(Director of Original film made in Malaylam)&Abhishek Pathak they both just proved that true dedication towards story leads to creation of a MASTERPIECE!!",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Same as Malyalam, Not a single change in Original Script/Story",
            "content": "A well made remake and film succeeds to enthrall audience for sure. Primely it's a remake however sadly a scene to scene copy and also shot / filmed at very similar locations without any single change in original script! So those who have already seen Drishyam 2 of southern industry wouldn't find any newness. But yes those who haven't seen original would find this film exceptional and enjoy all the twists and turns more jubilantly. Film also maintains the seriousness towards it's storyline and makers have not added any unwanted spices which is good.Ajay Devgan, Akshay Khanna, Tabu, Shriya Saran and entire star cast has done a fabulous job on screen. AjayD looks rock solid with his acting & AkshayK steals the show with his killing expressions and dialogues. Tabu, ShriyaS and Ishita Dutta have made their presence felt with superb performances. Specifically ShriyaS dominates the emotional scenes by bringing the right kind of expressions on face. So casting is very apt here.Coming to the storyline then film shows the whole recap of first part in title credits and the same case reopens thereafter as Tabu & her husband RajatK visits India to perform some rituals for their son's death. AkshayK takes the charge and with his brilliance and aid from an eye-witness he finds out that body buried inside police station. He catches AjayD's family and tortures them inside prison and get the confession out. Now will AjayD be able to save himself and his family or not forms the crux of the film.As I said before, the script is kept unchanged, scene sequences are identical and film progresses in very similar way. Nevertheless film wins in all other cinematic aspactilike Dialogues, BGM, Screenplay, Direction, etc. I also liked the two songs and off the beat music of DSP here. Overall film offers nothing new as compared to the original and I would like to give it 3 / 5 (🌟🌟🌟) to it.*What I Liked Most -* The Chess Scene (Entry Scene of Akshay Khanna)*By - Niraj Solanki..!*",
            "review_date": "2022-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What AN ENTHRALLING PLOT!",
            "content": "From the first scene where they have successfully tried to glue the eyes of the audience on to the screen with the plot, the effortless entry of characters like TABU, AKSHAY, RAJAT, to the minute detailed expressions by Shriya Saran, it's quite unbelievable how the writer had us sympathise with the family! WITH THE REGRET OF not seeing the first part in the theater, I was really excited for this one and just when you think WHAT MORE NOW? The plot changes, your mind remains baffled for few minutes! It's a masterpiece for sure! And so is AJAY DEVGAN 👑 This movie has revived my belief in the fact that writers and good directors do exist! 👏🏻",
            "review_date": "2022-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Visuals Can Be Deceptive !! Drishyam 2 Packs A Punch ...",
            "content": "The sequel begins where the first part ends - with the murder case of Samir Deshmukh, son of IG Meera Deshmukh (Tabu), closed as 'unresolved'. The new top cop in town (Akshaye Khanna) reopens the file much to the agony of Vijay Salgaongar (Ajay Devgn) and his family who inadvertently gets embroiled in the case. The real hero of 'Driysham 2' is the cleverly written plot (Joseph), and the twists and turns incorporated at the right times before a befitting climax, which may not be as novel or notorious as in part one, but is nevertheless equally captivating due to its ingenuity. The suspense is heightened by some good acting by the entire cast which is easily relatable. One can feel their tribulations and trauma as the Salgoankar family go through another extended and excruciating round of police investigation as well as close scrutiny by their neighbours.Repeated close-up shots of the leading characters and effective use of slow motion scenes add extra impact to an intense plot which ebbs and flows right through.In the seven-year gap since 'Driysham', Vijay Salgoankar, the 'Chauthi Fail Aam Aadmi' and a complete Family Man, has moved on from being a cable operator to a theatre owner and a potential producer of a film while Meera Deskmukh is now retired but still in the hunt to find the killers of her only son Samir.Akshaye Khanna as the new police chief enters the scene from where he left off in Sridevi-starrer Mom, all the mannerisms included. His role and that of Saurabh Shukla as a writer, is a welcome addition to a tightly knitted star cast and adds a new element of suspense. Shukla as expected blends with his character despite limited time and space. Khanna, on the other hand, is suave and sensitive as a police chief hell bent on solving a complex murder case.You will enjoy 'Driysham 2' better if you watch it without any needless distractions, like, for example, wasting time on finding faults in it.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "BAR SET TOO HIGH",
            "content": "Before watching the movie I saw every review possible of the movie on YouTube and they just pumped me so high that nothing could have satisfied.The movie pick up after 7 yrs and straight away something just didn't felt right the family was not the same almost everyone is jealous of the wealth (I know it is natural progression) and something ps that are stuck in my head like why didn't Vijay change the house , why he sold a part of his house knowing that they can be spy (too confident ??) and also in the climax no cctv hm.. and police not noticing Vijay befriending the body guard i mean they were recording every secondAll said I still thoroughly enjoyed spending time in that tense atmosphere Akshay Khanna was brilliant it is my first film seeing him and the dialogue delivery that scene where he visits the house just send chills through my spine last plan of Vijay was hmm I don't know my feelings about that ya it was unexpected but I didn't enjoyed it like many others\nAnd ending remarks were just beautiful the father getting what he demanded and subtly showing that Vijay will always be in a jail.",
            "review_date": "2023-01-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watched this movie in intervals with breaks because the suspense felt like an orgasm control to feel a more intense one.",
            "content": "Absolutely Amazing. Suspense at like every 10 mins? Yes of course it is the genre of the movie. The title should pretty much sum up how much I liked the suspense in the movie and the way I was all EYES for watching Akshey Khanna and Ajay Devgn's expressions as the movie moves forward like..WOAH oh boy.. the best 2 hrs of my day right there..The way the very first drug scene of the movie was filmed with the thrill of getting caught every moment till the police came like- Oh boy I WAS SO impressed with the cinematography. The location of the movie..wouldn't have felt the same of course if it was shot in a metropolitan city because it is very easy to find evidences in here (CCTV). Please watch this..the best movie I watched till now. Would rate a 100/100 if given the option ngl. Go off Vijay! Anju queen slay!! (quite literally)",
            "review_date": "2023-01-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thrilling",
            "content": "Drishyam 2 is a thrilling and suspenseful crime drama that continues the story of the original film. The movie features strong performances from the cast, including lead actor Ajay Devgan, who once again delivers a captivating performance as the protagonist. The plot is well-crafted and keeps the viewer guessing until the very end. The cinematography and production values are top-notch, and the film is well-paced, with a good balance of tension and character development. Overall, Drishyam 2 is a must-see for fans of the original film and for anyone who enjoys well-made crime dramas. Do watch Drishyam before watching Drishyam 2.",
            "review_date": "2023-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Drishyam 2 is worth watching",
            "content": "Absolute gem.Top performance specially by Shriya Saran. Her expressions were top notch. Without uttering a dialogue she made the scene so cinematic as per the scene.Ajay devgan, tabu, akshaye khana, rajat kapoor, ishita dutta were good.Though its a scene to scene copy from mohanlal drishyam but performances were top notch. Those woh liked the drishyam 1 would definitely love this 2nd part.Music and Bgm was good.This part is directed by abhishek pathak and he has done good job. 1st part was directed by nishikant kamat who died of covid last year.Theatres were full today when i watched this. Saw the crowd again after bhool bhulaiyya 2.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Sequel Which Lives Up To Its Expectations - MAC Reviews",
            "content": "Dhrishyam 2 - An engaging Suspense Thriller which takes us back to where it all started. An out and out, edge of the seat thriller with a lot of unexpected twists and turns.+ves : Ajay Devgan's Acting - He did full justice to the character of Vijay. He acted brilliantly as usual. Same goes with other cast as well. Akshay Khanna was superb as usual. Whenever he comes on screen, you could feel his aura & presence. BGM & Dialogues were solid. Climax portion was brilliant as well.-ves : Slow screenplay in the first half. It takes a lot of time to reach its main point. 15-20 minutes can be easily chopped off from the first half. Music was so-so but that isn't the main concern. Tabu & Rajat Kapoor's character wasn't required in this movie as they had nothing much to contribute.To conclude, its a good suspense thriller which you could with your family on a weekend. Trust the process, 2nd half would worth your patience.",
            "review_date": "2023-01-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst Nightmare",
            "content": "Worst movie, after watching 1st part I had high expectations. Nowadays people are just creating fake hype and promote any bulsht movies. I have watched 50-100 plus thriller + Mystery movies in english and hindi but this is really boring and bakwas. To show a small twist they created this movie, not worth!1st half is so boring, nothing happens, I was almost asleep during 1st half. Acting of all actors are superb, direction is also great, videography etc nice, Editing and Story is weak. Which is the key component of any thriller film.I am afraid hindi movies are not great any more! Worst nightmare!",
            "review_date": "2023-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nail biting thriller",
            "content": "How often do you see everyone clapping in the climax of the movie or twist in the movie? Drishyam 2 is a brilliant thriller and engaging!The performance delivered by Ajay Devgan & Akshaye Khanna is just out of the box and fabulous to watch. The screen presence of Tabu and Rajat Kapoor adds the extra spice in the movie. Apart from that the performance by Shriya Saran & Ishita Dutta is also good. The cinematography, the cameo by Saurabh Shukla will blow your mind. The first half is bit slow but you will never feel bored. The movies increases the speed and and grip in the second half. A must watch!",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just a perfect duplicate of Mohan Lal's original!!",
            "content": "Bollywood is remaking south movies and think that people will throng to cinema Hall to see their \"so called\" stars to re-enacting other's original work. But, these tricks no more work on intelligent movie lovers. Story is already known, mystery is already revealed, then who will go to watch flop actors like Ajay devgan who has not given a single bollywood hit in many years except cameo on RRR which is also a south movie. Better watch Drishyam 2, kantara or RRR again than to watch this duplicate!! The trend of making remakes of south movies and nothing original on its sleeve is hurting Bollywood and movie goers like us!!",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better than the 1st one",
            "content": "I love the first one but that one was a great movies but it seemed to go from point A to B and so on to the ending. But this one was like watching a Chess match which was pointed out in the beginning of the movie yet I didn't realize the meaning of that till the end.The writing in this movie is very sound, the acting is great and does not seem at all forced or wooden. It flowed through out the movie. The actors like Ajay Devgn is my favorite. I love all of his movies I have watched and I've seen several. The characters all have depth and mystery to them that kept me glued and I felt engulfed. It was not like I was just watching a movie but some how a part of that movie. Then when the curtain, so to speak, was raised. It was like wait a minute. What? What? I didn't not see that coming. Then another twist and still I said, wait a minute. What? What? It was like peeling an onion with all the different layers. Till I was wondering if he went back in time to solve each problem as it came up or that Vijay is actually a genius and he too can play an entire game of Chess before even moving the first piece on the board? Unlike a actually Chess board his only had One King and the rest are pawns to be controlled and manipulated in very subtle ways, at least to me anyway. I thoroughly enjoyed watching this movie.",
            "review_date": "2023-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "#Drishyam 2 Ajay Devgan is creating a legacy in Hindi.Review by M. Siraj",
            "content": "#Drishyam 2 Ajay Devgan is creating a legacy in Hindi. Review by M. SirajThe beautifully encrusted Crime Drishyam 2 released in Hindi, the perpetual investigating story of Jeethu Joseph about a common indomitable man to protect his family till his last breath.Undoubtedly #Ajay Devgan and Shreya gave their best performance in their career for this film, I could not keep myself from comparing it with the Malayalam Version. Mohan Lal with his minute expressions keep the audience with crossed fingers, namely, when he come out from the Court room, seeing the Shadow Police with direct eyes for their no trustworthiness, lowering his eyes when he sees SP and her husband because of his guilty feelings, moreover his financial progress from an ordinary Cable operator to a theatre owner is convincingly narrated by #Jeethu Joseph, whereas Ajay Devgan's financial progress is something abnormal.Secondly, screen play has been changed, (may be to tune with Hindi Audience) but original screenplay in Malayalam was one of the best. The character of Kalabhavan Mani is not coming in the second part, but in Hindi that character (Kamlesh Sawant) appears again, to corner Ajay Devgan with full of venom. Regarding the role of Police SP played by Tabu simply overshadowing Nadiya Moidu with her look and perseverance in taking vengeance on Ajay Devgan, specifically her dialogues with the Poojari on her son's yearly death day.Finally, #AkshyeKhanna as IG gave a spectacular effect on the screen, but in Malayalam version Introduction of Murali Gopi as IG and the two Mohan Lal neighbours as Shadow Police pulls up the heart beat of the Audience for its unexpected twist, which is missing in Hindi.Finally, those who have not seen #Malayalam Drishyam 2, the #Hindi version definitely make you thrill and no doubt, it is going to be a Blockbuster in Hindi.Watched Drishyam 2 Hindi at Jeddah Al Andalus Mall, Empire Cinema.",
            "review_date": "2022-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An entertaining sequel!",
            "content": "After 7 years, Vijay and his family have somewhat gotten back to normal. Vijay now owns a cinema and is producing a movie. Meanwhile Meera Deshmukh isn't willing to let the family get away with what happened but they can't do anything about it. However, IG Tarun wants to prove that Vijay and his family did murder Sam with some evidence. Can Vijay his family from the police this time.Drishyam 2 is a well made film filled with bravura performances from everyone in the cast. The best were Ajay Devgn, Akshaye Khanna and Kamlesh Sawant. The direction in this film is also great.The first half is good however nothing too interesting takes place after the first scene. Akshaye Khanna has a late entry (a few min before interval) and the movie starts getting really good from here. The second half is just brilliant with an unexpected twist at the end.Highly recommended!!!",
            "review_date": "2022-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fabulous story!",
            "content": "The story and plots are very strong and unpredictable. Made without many annoying songs. I got a wonderful experience after this move. The climax always gives goosebumps.The first half of the movie is a little slow but the second half is just the main fun of the movie.I would say, although the first half was slow but it was necessary for the film. Every character also the character who has the least roll in the film has a important motive in the story which is disclosed in the second half. The actors did ther job perfectly but the person who informed the police about a important thing his acting was not perfect but average. But the acting of the lead character's wife was awesome.Should definitely watch it!",
            "review_date": "2022-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Below Expectations",
            "content": "Okay so the story, plot and twists in Drishyam 1 led to a lot of expectations from Drishyam 2.The movie is an absolute thriller yes, but could not live up to the expectations. The entire movie is only about the last 40-45 mins. Rest of the movie just explains you what happened in the first part. I understand that the backstory is important but telling it 3-4 times does not make sense.There is only one major twist in the story and that is also somewhat predictable.All in all, a decent movie but did not live up to the expectations created from the first part. (See I repeated the same thing again, it's annoying right? The movie does the same :)",
            "review_date": "2022-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "outstanding edge of the seat thriller,",
            "content": "#Drishyam2Review - First thing first - A HOUSEFUL Sunday morning show in itself looked like a treat for an ardent movie lover like yours truly.Jeetu Joseph's original story of Drishyam 2 has been remade into an outstanding edge of the seat thriller, specially the 2nd half. Vijay Salgaonkar continues his mission to save his family in a story where screenplay just flows organically, the twists induces seeties & the climax just blows your mind. Tight screenplay that never ever deviates from building the climax, astute direction, crisp editing and most importantly, the original caste of Drishyam retained entirely is a master stroke. All actors deliver to the promise.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "best film",
            "content": "Best film ever in bollywood.becaus of his storyline suspense thrile and first to fall ajay devgan is good actor because of his acting and akshay khanas acting is good and ihope it became a blockbuster film in bollywood on this time ajay adevgan and all actors like aksahy khana and tabu saves the bollywood on the time. I hope next year all actors saves the bollywood and give good pictures like ajay devgan drishyam 2 and i hope you make next part of drishyam and i tell the next film of drishyam series will not be a remake it is full of the orignal content drishyam content is so weard because of thril.",
            "review_date": "2022-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Almost perfect thriller",
            "content": "This movie is pure magic. We don't see such simple story telling which is so complex, detailed and well thought in nature.Each character has a role to play and is an integral part of the entire movie. I don't see a single scene which was forced or out of place.Overall awesome story, writing, screenplay, background score, acting - almost everything except few loose ends. I guess those loose ends are intended to lead us to part 3.Ajay Devgn, Akshaye Khanna, Tabu and rest all casts steal the show.Story has a nice built up and they spent good time to establish the world. Post interval the movie gets into its zone and leave you speechless at the climax.It's all about true content and genuine acting.Recommended!",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A great end to a mesmerizing story.",
            "content": "To fully enjoy this movie, you need to watch the first movie. While the first movie delivers a very neat and fitting ending, it seems that the story hasn't finished yet!Drishyam 2 gives a brief recap of what happens in the first movie through its opening credits. All the dramatic scenes are shown as slideshow to entice you. As you watch the movie, the overall first half of the movie is just a setup for the upcoming twist which comes in as the intermission roles in.The second half is more thrilling as your mind races through how the movie will end! The final punch is delivered in the last 40-30 mins which will make your brain go through a rollercoaster ride. The pay off is immense and makes you admire the writing.Personally for me i thought the setup was too long. There are lots of silence, pauses and slow shots which serves to lengthen the movie. But, the payoff at the end made it worth it.If you haven't watched the first one yet, take sometime out this weekend, watch the first one and then go to the theatre to watch this fine piece of movie.",
            "review_date": "2022-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the finest suspense thriller movies after long time.",
            "content": "No spoiler review. The film begins in the same timeline as the first Drishyam movie. This second installment of the series has a potential grip from its first minute. Throughout the runtime of the movie, every scene has its own meaning.The film takes a bit of time to set you up with the world and story we left off 7 years ago and it's worth it.What I liked the most in this movie is every single character from the first and second installments has something to do with the storyline.And when each character plays an important role in the movie it makes the movie so engaging.If you want to enjoy the ending of the movie, Don't miss the beginning.Direction: We miss the touch of Nishikant Kamat here but Abhishek Pathak has done a phenomenal job in direction. Suspense thriller movies mostly depend upon screenplay and direction and Abhishek Pathak has given justice to his work.Writing: Written by Aamil Keeyan Khan and Abhishek Pathak. Script and screenplay are the kings of this Franchise. Perfect writing.Cinematography: The cinematography is good. Cinematographer Sudhir K. Chaudhary has done good camera work. The framing, Composition, and color palette are so beautiful. It sets the tone of the movie from the first frame.Music and sound design: Songs are not so catchy but fine. The background score is so awesome. The background score plays perfectly in each scene. Especially when the time the Salgaonkar family interacts with the police.Thank You.",
            "review_date": "2022-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The story and linking is very good! Something good after a long time from bollywood!",
            "content": "A very good movie! There are so many twists before the interval and at the end as well! The story is good and well linked. Especially climax, its just mind-blowing and no one can ever guess what exactly Vijay is going to do and how! Overall it was a great experience and I think it has maintained that high class, where we could see the story is not flowing out of the way, no chaos and no unnecessary actions; music, cinematic view, shooting, acting, direction everything is excellent, and running calm and cool! I would say, bollywood has given something good after a long time! Drishyam 1 and 2, both are good movies. Interesting.. Must watch! 😊 8.5/10.",
            "review_date": "2022-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bollywood is back!!",
            "content": "Drishyam 2 Review\nMy Rating :-⭐⭐⭐⭐DRISHYAM 2 is Simply Brilliant an Edge-of-the-seat Suspense thriller which will keep you engaged throughout its duration. It's a Justified Sequel and gives a Paisa Vasool Experience due to its Power-Packed Performances By Powerhouse Actors,Scripts and clap-Worthy Climax.What Makes Drishyam 2 a BIG SCREEN experience is the dialogues and top notch background score by DSP.Ajay Devgan Excels as Vijay Salgaonkar again in this Expertly Crafted Sequel, Akshaye Khanna is a Impactful addition to the Franchise. His Face-off moments with Ajay Devgn are Amazing.Kamlesh Sawant as Gaitonde is Simply Hilarious and brilliant. Shriya Saran does a good job as Nandini, who is more vulnerable this time. Ishita Dutta shines as Anju once again in her scenes. Saurabh Shukla adds loads of spice and flavour to Drishyam 2.There's no need for fancy words to describe Tabu's supremacy. Meera Deshmukh is an iconic character that is a part of history, all thanks to the actress and her brilliance.Abhishek Pathak's attempt is Genuine.Keep your Mobile Phone Away Bcz Every Small details is Important.DRISHYON pe DHYAAN Do !!",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome",
            "content": "Ajay and akshay rule very extra ordinary.its be very good story craet josho I was 3 time watch this movie, strong story thats resan.Family role good\nAnd vijay salwalkar characters awosme may point of view this suspense movies good\nI compared original malayam movie\nThis movie story inspire by a novel\nI think. This movie ajay devgan careers second highest grossing worldwide. 1st ajay highest grossing movies ajay sir tanaji\nI hope bollywood some good news for this year\nAnd drishyam 2 movie\nAll crharchter all actress role very good\nI hope this movie gross worldwide collection 400 mark let see.best.",
            "review_date": "2022-12-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Glaringly obvious and full of loopholes",
            "content": "This movie was so dumb compared to the first part. The twist was so obvious everyone saw it coming. Just created extra hype and drama for 80% of the movie and rushed through the finish. Akshay Khannas character starts strong and then he just ends as some other idiot. Was disappointed. First is way better.Most of the movie is just hype and build up. It doesn't pay off. The connections are illogical. The logic is contrived and fragile. I was hoping they would do more with Akshay Khannas character and show more back n forth but alas. I guess the writers arent as smart as Vijay Salgaonkar. Disappointed.",
            "review_date": "2023-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A faithful remake",
            "content": "A sequel to Drishyam, released in 2015, the film takes place seven years post the events of the last film. Vijay and his family are moving on with their lives until the case is reopened by the IG ( Akshaye Khanna ). What follows is a cat and mouse game. Ajay Devgn and Akshaye Khanna are spot on with their performances. Tabu has little impact while Shriya Saran, Rajat Kapoor, Ishita Dutta and Saurabh Shukla were okay. The reintroduction of Gaitonde was useless regarding that he has little impact to the story. Certain scenes have been changed to make the story more original. The introduction scene of the IG was far better than the malayalam version. Though the court scene was ruined. The interrogation scene feels exaggerated. Certain scene also felt quite rushed. The background score was on point however the addition of the song saath rum rahein was unnessecary. Not as good as the original but still watchable.",
            "review_date": "2023-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "most deserving sequel..best movie of 2022",
            "content": "The main thing in this movie is the story it hook up you to the screen till it's ending. Acting, direction and all the little things to the point and logical. Not like any other Bollywood movie where everything is over the top but here story is well grounded and characters are quite believable and acting of all the star cast is big round of applause. Go and watch this movie you will never regret. The main USP of this movie is continuity from part 1 all the characters are same and the story is that moves perfectly and 2nd half of the movie is edge of the seat drama and mystery that unfold and compell you to stand and applaud for the character.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome Movie💥💥💥💥💥",
            "content": "I never review movies. But today I was forced. I can't explain my feelings. But i can honestly say that the movie is mind blowing. Ajay Devgan sir is the great artists. I want more movies like this to be made, because there is logic in these movies, there is no nonsense that cannot be watched with the family. I want everyone to watch this movie series. So I will tell all my friends to watch this movie. I understand that you have worked hard to make this movie. Thank you very much for that Movie. I don't know what else to comment. Actually I have to write 500 characters so I am trying to write more. And this movie will surely be less than the good things I say about it.",
            "review_date": "2023-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Great chalawa",
            "content": "I think it is the attach movie from the previous part 1 movie bcoz in Bollywood there so no logic when releasing the next parts but this movie becomes crazy. I just amazed bcoz I never seen this type of sequal.Every character doing a great job. The game played by Ajay Devgan was fab. Creative mind salute to the director that gaves us this type of movie.Next one I like the songs that played in the movie also the color effect included in the movie. The good performance of each of one.And I like the acting of the police man and I love the storyline that the baba said Ajay Devgan mere pass aya tha and he told me a story. It becomes mind blowing.",
            "review_date": "2023-02-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unresolved Limitations",
            "content": "Drishyam 2 is a fair remake of the original malayalam movie, however, it would have been better if it would have worked to resolve the loopholes that were present in the original one. Thus, the film automatically ends up falling in a trap that lacks originality of its own, despite the performances of great actors like Tabu and even Ajay Devgan. The film is not bad but from a personal point of view, I feel like I should have waited for this film to release on an ott platform rather than paying for the ticket. The only novel aspect was Akshaye Khanna's role who ruled the screen and definitely saved the play.",
            "review_date": "2023-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not worth the hype, a let down",
            "content": "I recently watched a Drishyam 2 on Prime Videos and I was let down by the plot. The first hour of the film was solely focused on family drama with no mystery, investigation or action, which made it extremely boring. The only redeeming factor was the arrival of Akshay Khanna, who reopens the case and reignites the mystery element. The last 30 minutes were the most captivating part of the movie and portrayed real cruelty. The climax of the film was also well executed.In terms of direction, the film was shot in a very conventional way, similar to Mohanlal's Drishyam. I believe the director could have done a better job in terms of scene composition and shot selection. The movie was not devoid of good moments, but the majority of the scenes were not handled well. Despite this, the acting of the lead actors, Ajay Devgn, Tabu, and Akshay Khanna was impressive and they all fit their respective characters well. The background score was not great, but that was not the focus of the film.In my opinion, Bollywood needs to stop making remakes as people are getting tired of it. People are already boycotting these remakes and the industry needs to come up with fresh ideas, otherwise, Bollywood might become limited to web series only. Overall, I would rate this film 2 out of 10. While it had its shortcomings, it was still an average sequel.",
            "review_date": "2023-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very long build up, equally short climax",
            "content": "The build up took way too long for my liking, i mean I'm glad they did not waste too much time in flashbacks but still, took way too long to get to the ending ,which, itself was nice but it was so brief and so quick that I couldn't enjoy it as luch as i would've liked. Unlike the first Drishyam, there wasn't much time to absorb and enjoy whatever was happening in Drishyam 2. I wish they paced it down (the ending) and detailed it a bit more so that the audience wouldn't be left trying to grasp everything everywhere all at once. The performances were nice though but apart from Akshaye Khanna it did not feel very new. Overall, just feel it could have been better.",
            "review_date": "2023-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A dish with an extra teaspoon of masala",
            "content": "I haven't seen the Malayalam version of Drishyam 1 and 2, so my review is just restricted to the Hindi versions.First of all, a shorter movie would have been better. They could have stripped the story of all the unnecessary frills and delivered the movie in two acts: one where the body is discovered, and two, where Vijay escapes yet again.Honestly, we were all expecting that the body would somehow be discovered, all we were waiting for is to see how Vijay would escape yet again. They could have focused on that part more. Instead, the escape is restricted to the final quarter of the film.The final quibble I have with the movie is the casting of Akshaye Khanna in his role. The movie was telling us that the new IG was supposed to be more dangerous, cunning, and intelligent than the previous one, but the only thing he does in the movie to prove this is have a weird conversation with Vijay's wife. Think about it, what else does he do in the movie other than giving funny stares and playing chess with himself? If this dark, mysterious, and dangerous appearance was what the movie was going for, Akshaye Khanna wasn't the actor for this role.I liked the twists in the story, but felt that it could have been made simpler. At times, there were stories within stories, which was maybe unnecessary. I am a fan of murder mysteries, and also a fan of the cheesy 'last-person-you-think-has-done-it.' But I still left the movie feeling that there was something extra, like a teaspoon of masala in an otherwise perfect dish.",
            "review_date": "2022-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A must watch",
            "content": "Two things I didn't like about this movie:\n1. The character of Akshay Khanna was informed as a very tough antagonist. It was built very appealingly, but he deserved a better plot. It felt like as the character was shown so promisingly genius didn't got to anything exceptional. Like everything happened to him on its own. We could've seen him creating much more difficult situation to the protagonist i.e., Ajay Devgn. The story was left one sided.2. Gaitonde deserved a serious punishment by the Protagonist. As the movie shows that the protagonist is who is so driven for his family's protection and safety from the very first beginning that he can literally cross any limits no matter what, didn't do anything even after eye-witnessing her family getting beaten and especially her daughter almost getting crushed under Gaitonde's boots. Gaitonde did the same thing with the protagonist's younger daughter in the first part but it was in his absence. But this time everything happened in front of his eyes.Keeping that aside, this movie deserves a watch by the audience. Really done well the filmmakers and the crew.",
            "review_date": "2023-01-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "good remake",
            "content": "Is anyone even taking the pains to making art? Music is remade, whole movies are remade. Moving on from the rant, the writing is tad one dimensional, very causal flow of the story, up until the setup is ready to gp full explosive climax. The music seems to be good since inspired from stravinsky. Although the mix is tad loud to have a clear audio reception of different dialogues. The cinematography is quite good and effective at storytelling. Some plots are writing just to ascertain that it would be used later on in the story, that's what felt like loose and unpolished setups. Dialogues felt tad unrealistic.",
            "review_date": "2022-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Appreciating PVR - nice seats to sleep",
            "content": "Why these people don't use brains at all while doing remake? No change from original movie. Copy same to same. Thanks to PVR and it's wonderful recliner seats, I could slept for almost for an hour. Super pathetic direction.No comparison in Malayalam and Hindi movie. Original remains original. Mohanlal is baap of all. Ajay Devgan isn't even 1% of him. Direction : this new kid (director of Hindi movie), he was not able to copy properly. He used his own thoughts and concepts (very very few, as they don't want to take risk) - but that's the disaster.Better to see this on OTT in few days. Don't waste money.Note - I'm writing this review from movie hall watching movie and there's nothing in movie that catches attention.",
            "review_date": "2022-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Your hands will give an applause Mind-blowing performance",
            "content": "Ajay devgan best performance till date....this is so far best malyalam remake of 2022 authentic and besides it being a remake movie still leaves a mark, performance by all the cast is so good that you will give an applause automatically.After Kantara this is the best movie of 2022.For gaitonde (police inspector) hats off to this man really he is so good at being a police man tipical maharashtrian police guy won't leave the screen without making you laugh.. even though this movie is suspense triller it is an emotional journey of a family must watch for all.FAMILY MOVIE, GOOD MOVIE, BEST REMAKE.",
            "review_date": "2022-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Good watch if you haven't watched the original.",
            "content": "1st half is dragged but that's for setting up the stage for second half. Suspense is well written but you somewhat guess it with the people slowly appearing throughout the first half. Background music is good when compared to that in 1st part but the songs and good music is missing.If we talk about acting, all actors have acted pretty good especially Shriya Saran. She is pretty good in few of the scenes. And Ajay is an actor known for acting through his eyes and that comes out in the movie here too.Could have been dragged a bit less but as its a copy paste of the original that is expected already.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie but falls just short of 1st part",
            "content": "Very good movie. Though 1st was a masterpiece and this one almost matches the 1st one though falling just short. While 1st one was giving twists every few mins, this one goes at a relatively slow pace with just 1 twist leading to climax. Climax is quite interesting though. Ajay Devgan does what he does best. Akshay Khanna has always been a great actor no matter which role he plays. Tabu is wasted big time here. Shriya sarans dialogue delivery could have been better. Movie keeps you engaged during akshay Khanna scenes and climax but gets bit boring during 1st half due to slow pace with which story goes ahead.",
            "review_date": "2022-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Buying reviews are we now!!",
            "content": "Damn what a waste of a nice Sunday evening to watch this bile of a movie! Yuck is the best description I can give you. Ajay Devgan gives his best performance by staring angrily at people and staring angrily into space which is his range 🙄 I refuse to know the rest of the cast for the simple reason that they are that unimportant to everything....spoiler? Just watch the Malayalam film guys...The DOP has done so much much better.... The actors everyone in that just sell you the plot....all bollywood does now is vacate it's bowels with people like Ajay D on you for 200 bucks.... YUCK like I said...if you still do watch it without having watched the much better OG than you may just like it because our standards are that f low these days....if I have to surmise my last 2 precious hours I would say EEW to everyone and everything in this rubbish parody!",
            "review_date": "2023-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "2nd part manages to match the 1st part",
            "content": "Drishyam 2 is engaging, crisp, and keeps you on the hook till the very end. Also keeps some premise open for the 3rd/last part of this franchise.Movie took first half to establish the premise of the new plot and introduces news charactes . Second half has enough twist and turn to blow your mind.Even after watching the original Malayalam part it doesn't bore you because of fine performance of all the lead cast.Special mention to Akshay Khanna (whom I consider a very under-utilised actor in this industry) who just blow your mind with his acting. The scene in Vijay home where he initimidates Vijay's family was a top notch performance. Tabu and Ajay Devgan as usual gives a top performance as both these performers have depth in their eyes.The background music of Devi Prasad is top notch.The director Abhishek Pathak justifies his credibility and you don't miss nishikant kamat (director of drishyam 1).",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Was worth the wait",
            "content": "First of all kudos to makers for proper sequel and not just part 2 to make money out of established franchise, after first part there were some questions unanswered like what happens to both families after such traumatic incident, is happily ever after possible? So rightly shown in part 2 the PTSD caused to elder daughter, and that too without wasting much time . The song \"kya re zindagi\" was missed offcourse, it's counterpart in Drishyam 2 was not as effective so i instead played kya re zindgi when this song was going to relive gulzar's magic. There are two kinds of thrillers one is like cat and mice race so both parties are equally having their moments and another is like \" sau sunar ki ek lohar ki\" where protagonist is victim throughout the plot only to have last laugh as winner this movie is second kind , but no where u feel bored of family getting constantly oppressed, the major reason was akshaye Khanna's superb witty acting skills and ofcourse Tabu family's too.I had watched drishyam Hindi and loved it. Since I read about the talks of having second part in malyalam version i was very excited but I wanted to watch Hindi version only , the only reason is attachment that you feel with the characters and actors playing it ( of course malyalam version must be great). And i m not the theatre guy, i don't like watching such intense movies with public around whistling and disturbing , so i kept my patience till today for almost 9 years to watch it on Ott and tell you what, it was worth the wait. After long and i mean really long time i felt i watched a good bollywood movie.Note- This is not being slave of moments, it's really good.",
            "review_date": "2023-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nail biting , absolute must watch",
            "content": "I think driysham has become one of the top thriller series and Ajay Devgan has proven to a be top class actor here. Watching the first one again a few days before the latest sequel is highly recommended, I did that . The director has done a good job by showing small shots of the first one to help recall the main events. This is world-class material and despite watching of thrillers in my life I still couldn't predict the actual plot however I was close . The movie also shares an important lesson that one should not under estimate anyone . Tabu character did realize however Vijay was way ahead.",
            "review_date": "2023-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Desperate attempt",
            "content": "Forcing the suspense, over dramatic. Our cinemas need fresh ideas not some old bogus thriller. Ajay needs to revamp or he will perish soon with his boring acts. If one wants to sleep in theatre, this one can help. Can watch it at home though on Amazon may be. Its nowhere near to part1. Director has tried using some thrilling sound effects which is only to create the mood and glue the audience. Side actors play an important role. Negative shade needed better approach. Tabu definitely could be more intense along with Akshay Khanna who was not really creating any screen chemistry. Hope they aren't planning for part3!!",
            "review_date": "2022-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "overall, Drishyam2 is worthy sequel to 2015 s Drishyam which should be applauded for its skillful writing, brilliant performances and astounding climax.",
            "content": "Ajay Devgn's Drishyam, released in 2015, was simply superb which was an official remake of Malayalam film Drishyam starring Mohanlal thanks to its thundering climax and electrifying screenplay.While the first film was directed by late Nishikant Kamat, Abhishek Pathak returns to the director's chair with slow-burn and yet engaging story written brilliantly by Jeetu Joseph with twist and turns enough to keep you at bay. Drishyam 2 starts off on a slow note but gathers the steam towards the second half. The series of events infuses life to the film and will keep you guessing with what-will-happen-next scenes. Of course, the editing could have better reducing the duration of the film, especially in the first half.It is the last one hour of the film which makes it an interesting watch thanks to the outstanding climax. The only actor who could match to the calibre of Mohanlal is Ajay Devgn . The actor expresses adequately through his eyes and gives a stunning performance. Akshaye Khanna is just turning out to be fabulous with each and every role he plays and this one is definitely on the radar. Tabu and Shriya Saran's character could have been better written.So, overall, Drishyam2 is worthy sequel to 2015 s Drishyam which should be applauded for its skillful writing, brilliant performances and astounding climax.",
            "review_date": "2022-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "After watching upgrade your mind. AMAZING",
            "content": "The story telling and background music is amazing. After watching Dhrishyam Part 1 I'm excited for the past and finely i watched today. All characters well deserve claps for they doing work well done. 1st half going smoothly but exciting and 2nd half going so far and goosebumps suspense and ending was unexpected.The story telling and background music is amazing. After watching Dhrishyam Part 1 I'm excited for the past and finely i watched today. All characters well deserve claps for they doing work well done. 1st half going smoothly but exciting and 2nd half going so far and goosebumps suspense and ending was unexpected.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Average+",
            "content": "Film was good but around 20 minute of film story is forcefully added. Rest last 45 minute of film is very good. They can make the first half of film to more interesting but unfortunately director, story writer, screenplay writer of movie have less stamina to create a full time mind bending movie.(but after a long time nice effort of bollywood). Other people action accept ajay devgan is not upto mark specially we are expecting from akshay khanna. I the conclusion during pendemic the indian society explore the story and acting skill on ott and now we expect same acting and drama from the indian . And indian actors are always fooling us in this.",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb movie",
            "content": "I didn't expect this movie from Bollywood. As everyone knows the standard of Bollywood is too low but then I found out that this movie is a remake of a south movie. That's how finally Bollywood got a good script. I am yet to watch that south movie but it's rating shows that it is really nice. Everyone who likes this movie should watch that one too.as we should appreciate that original piece of work.This movie I liked it a lot as finally after so many years saw something special in Bollywood as the Bollywood movies standard going down with no good script and acting level because the nepotism doing their role.Must watch movie with so much thrill and a really nice story.",
            "review_date": "2022-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Could have been less than 2.5 hrs film",
            "content": "The build up for the entire movie was a bit much, especially in the first half of the movie. For a thriller, it did not really kept me hooked as there were a lot of parts which i felt was not needed like the girl facing epilepsy and having nightmares around it and the IPS visiting their place for a \"friendly\" visit. People are saying that the movie is an exact copy-paste from the original, so the discussion on creative writing is not really needed here. The movie can be watched once if you have the time to, but not watching it wont really make any difference. And thats why a 6 by 10 rating overall! :)",
            "review_date": "2023-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Could be revival of bollywood",
            "content": "I never expected that Bollywood will make such a great movie like this. Ajay Devgan, Taboo, Akshay Khanna all were superb. The movie gives you goose bumps and will not let you leave. This is the first movie which makes me realise that I can't predict right everytime. The last part and the ending was totally unexpected and no one can predict it and that is for sure.This movie is what we call mystry and thriller movie.I recommend every one to must watch this movie.This story line of this movie is next level. I have no words to praise and this movie could be the revival of bollywood again.. Just WOW.",
            "review_date": "2022-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "3rd rate remake of a brilliant original",
            "content": "This's another example of Bollywood going nuts with a foolproof original. They have to go off template & add their stupid extras to make it look more appealing to the masses. Little do they realize that the masses have already evolved over time with an overdose of OTT content. Stop treating the common man as an idiot who'll just lapup anyhing that you dish out in the name of entertainment. If at all you're so creatively bankrupt that you need to buy a story, then just leave it as it us & don't try to add your stupid bhaiyya ideas to it. Don't forget that you had to make a remake because you never had the brains to make something remotely close to the original.",
            "review_date": "2022-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gripping Murder Mystery",
            "content": "I am not sure if they had to follow the same base of the story line of the original (which I haven't watched) but I felt the story could have been mixed more with spices on the second half.First half was slow yet got me hooked but the second part went away so fast. It could have been made more better if the climax was ploted more in depth rather than only touching the baseline. Tabbu's role in it was not much bold than it was potrayed in first part but yet the story itself explains how wounded she has become with passing time.Although this will be the massive hit for the mass plus the presence of same faces after years also revived the memory. Akshay's character was so much refined and it was great watching him in action.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just 3 Words - Wonderful, Wonderful, Wonderful",
            "content": "Expectations were very high from this sequel, and must say, They have not only meet our expectations but also raise the bar very high for upcoming movies. This is what we want from movies; Amazing story and perfect act from the cast. I know, it's a copy but it doesn't matter if cast performs well and stand upto the expectations.Ajay Sir, He is a gem and the way he performs his role is mindblowing. Talking about TABU, she is masterclass! Another gem, Akshay Khanna, we just can't ignore him in this movie; Standing ovation for him. Claps for shriya and ishita acting skills.Last but not least, A round of applause for director Abhishek pathak and amazing writer, sorry, THE MOST AMAZING WRITER Jeethu Joseph!I would say, Just watch it!",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Outstanding movie!!",
            "content": "After a long time Bollywood has produced speechless movie, from acting to twist of the plot everything is perfectly planned. I had watched part 1 three times and I knew it from the beginning that there will be second part due to success of part 1 and suspense too. I had stopped watching bollywood since long time after having bad stories and screenplay, I still would avoid many upcoming movies but this movie has just changed my mind. Go and watch this movie once and then you will realise yourselves, as movie will keep you active throughout, all credit goes to Ajay Devgan himself as acting is unmatchable.",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Top Notch",
            "content": "I got goosebumps, best Film produced after Drishyam.I must say that, this movie it's self is a master piece.The plot, the twist, the projection, the timing, the dialogues, the actors & the actress are all great selection for this movie.The direction given to this film is like a magic.The touch of the timing is like salt to any recipe.Well! I loved this movie.I have watched this movie alone because of housefull.I will definitely watch this specific movie with my family,\nmy friends & with the haters of Drishyam 1.Because, I want to see the expression on every one's face.I loved this movie 🍿🍿🍿 while eating popcorn.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disappointing to say the least",
            "content": "I went into this movie with high hopes, having seen the original and also the prequel. Sad to say, I was really disappointed with the film. It starts off strong, and then eventually just tapers off nowhere. The writing is flimsy, and the acting is hammy. As a lifelong ardent Ajay Devgn fan, I was really expecting a lot from this film. Ajay brings his own signature swag along for the ride, but it is difficult to save this sinking ship and by the time Akshaye Khanna arrives, it really is too late. The supporting cast is okay-ish at best, and do what they can to keep the bloated script from falling apart. Overall, not a great watch.",
            "review_date": "2023-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing Film",
            "content": "It's a great movie. After a very long time I've been for a bollywood movie and i was very happy with Drishyam 2.Note: I had watched Malayalam Drishyam 2 on OTT, so i knew the story. But at no point i felt bored. The performances were unique and dialogue deliveries were excellent. Ajay Devgan and Tabu did great and everyone else enabled them to excel in it.Acting .. story .. climax everything is just perfect. Ajay devgun's acting is just mind blowing.I don't know how should i praise this masterpiece .. i'm speechless everything is mind blowing.Climax will hit you hard .. definitely a pure masterpiece.. the first half was slower but that's ok after the climax you will feel real experience of crime thriller.One of the best thriller i have ever watched in my life Everything is just on point in this incredible crime thriller movie .. i am sure everyone gonna love this movie .I just freaking loved it.",
            "review_date": "2022-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I Love It",
            "content": "The movie was so good it's has its own suspension and thriller. In every time I would know that what was next . All go in theatre and watch it. I love trilling and all the people in our India live Ajay Devgan. I also know that it was an remake of South Indian movie drishyam but the remake has its own some of the best part in it that was not in original. In the movie the last ( climax scene ) has a very interesting where we can say there it was name at suspension. And in all movie watch time it name as triller. All know that a movie take much time to make and lot of money in cr. All we know if we not give the 100-200 on it , so we have note wright to watch movie in mobile and TV also.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome Movie",
            "content": "Awesome movie once again....but i Like first one more than this part, because first part was amazing from start to end but in 2nd part, it seems that all focus was given to the end of the movie...and end of this movie is really good 👌\nActing wise...1. Akshey khanna's acting was not much impressive. 2. There was unnecessarily extra fear were given by mother and her two daughters(i don't know these three actress name) that looked some over acting type... 3. Tabbu ma'am role is not much in this part. 4. Ajay sir was superb like always, his acting always look so real and it should be after all he is the only main role of this movie.. 👍",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Only Actor left in bollywood - Ajay Devgn",
            "content": "Ajay is the finest actor of bollywood. Currently all rest actors are flop. All the useless khans and Akshay are because of their blind fan base otherwise they would have been thrown out of industry very early. Ajay is the only actor who is hit since his 1st movie and have done all the type of movies and has been successful everytime.Only Ajay can justify such movie plots. Where hero is very simple and silent. Rest all khan and kumar dominates the movies. They even interfere in directors job thats why many film makers don't want to make movies with them.This movie is brilliantly made and total entertaining.",
            "review_date": "2023-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rare good remake",
            "content": "This for a change is a good remake. The screenplay has be adapted well. The best thing the makers did was to cast the original cast from the prequel. Some parts of the film are better than the original Malayala. The character IG Tarun Ahlawat played by Akshaye Khanna has added great deal due his approach to the role. And keeping the character of Laxmikant Gaitonde played by Kamlesh Sawant was brilliant, which the original Film didn't keep. Ajay Devgan has given a good performance. Siddharth Bodke has made a defference. The BGM is beautiful. The use of Goa is done para excellence. Do see it to know how a remake should be made.",
            "review_date": "2022-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I love the movie",
            "content": "Excellent Sequel ,Outstanding edge of the seat thriller , poora paisa vasool 5 Star. Firstly Big big big salute to Jeetu Joseph for this masterpiece original story for Drishyam 2 . Vijay Salgaonkar returns in the 2nd installment standing strong to save his family yet again , the film is shot in Goa , there are beautiful locales , the thrill factor drives the film , the narration & screenplay just flows organically and you just get engaged & enjoy the whole story telling ,such crisp is the screenplay . The twist in the 2nd half is commendable & the Climax thrill just blows your mind , it is soo brilliant and you just feel like clapping at the scenes , kudos to the director for such beautiful direction .. BGM is topnotch , cinematography is lovely , editing has been spot on .The amazing cast of Drishyam 1 is retained & to add to this we have absolutely wonderful actors i.e Akshaye Khanna as the new IG & Saurabh Shukla as the writer , both have aced their roles which ease and it was an absolute delight to watch them . Ajay Devgn as Vijay Salgaonkar delivers blast of a performance , Kamlesh Savant as Gaitonde is another highlight in the film . Tabu has got very less screen space in this instalment . All and all this film is an excellent sequel which you shouldnt miss in the cinemas, its a wonderful film after a long time that you will never regret watching . Just go for it.",
            "review_date": "2022-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Time & money waste",
            "content": "Why Bollywood is copying South's story rather creating ther own concept. Amazon Prime has the original Drishyam 1&2 (South movie) part available. Nothing new in this just the star cast so people can come and spend money for ther stardom. Bloody time and money waste. I feel sorry for those who are appreciating the director for this remake movie. For God's sake understand the difference between original and remake it has nothing new. Although the direction was good but it's also copied from them. I am sure the director will work hard next time to bring his own concept to the world not from some South movies.",
            "review_date": "2022-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect 2nd Part",
            "content": "DRISHYAM 2Usually 2nd part always miss his track but in this movie not that happened\nPerfect 2nd part for audience\nMakers keep the Banrd name of DRISHYAM\n2022 best remake\nAjay Devgan's eyes can act better then many more Bollywood heros. This movie will told you that. An action Hero proved Himself again that he can acting in any kind of role. If its 3rd part announced i will not be surprised for that becouse writers makes thag faith. Akshay Khaana's acting was fantastic. His entry will fall you in tensionWriters wrote the stories very cleverly and keep the sususpences. Hope everyone will enjoy the movie.THANK YOU.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Could have been better",
            "content": "The cast is amazing. It's always a treat to see Tabu in a grey light, wanted to see more of Akshay Khanna to. Also, Shriya Saran's character deserves justice cause we all know she is so much more than the character she played in the movie. The plot is pretty cool, but the execution is very bland, the first half of the film was so boring that I was zoned out and yawning throughout, and the second half was no good either I think I only enjoyed the last few 20 minutes of the film. The background music sort of overshadowed the thrill and the suspense, it was so loud that it made it hard to focus on what was actually happening. Still don't skip it if you get a chance to watch it.",
            "review_date": "2023-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An actual thriller",
            "content": "This is how a movie should be. Everything needs to make sense n justify y it's being done. The gradual build up that eventually adds up is finely done. The way of directing n some other elements like color theme n lighting being different from the original movie has added an extra depth n uniqueness to the movie . The cast especially ajay and akshaye have done a phenomenal job while giving justice to their roles. The script is a great example to all the movies about how equally great a sequel cab be.On a whole a very phenomenal ride n totally enjoyable. A solid 10. A perfect sequel . Hatts off.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome",
            "content": "Ajay Devgn's Drishyam, released in 2015, was simply superb which was an official remake of Malayalam film Drishyam starring Mohanlal thanks to its thundering climax and electrifying screenplay.The sequel, Drishyam 2, which releases today takes the story forward when the IG (played by Akshaye Khanna ) re-opens the case which led to the disappearance of son of Meera (Tabu), leading the trail back to Vijay Salgaonkar and his family.While the first film was directed by late Nishikant Kamat, Abhishek Pathak returns to the director's chair with slow-burn and yet engaging story written brilliantly by Jeetu Joseph with twist and turns enough to keep you at bay. Drishyam 2 starts off on a slow note but gathers the steam towards the second half. The series of events infuses life to the film and will keep you guessing with what-will-happen-next scenes. Of course, the editing could have better reducing the duration of the film, especially in the first half.It is the last one hour of the film which makes it an interesting watch thanks to the outstanding climax. The only actor who could match to the calibre of Mohanlal is Ajay Devgn . The actor expresses adequately through his eyes and gives a stunning performance. Akshaye Khanna is just turning out to be fabulous with each and every role he plays and this one is definitely on the radar. Tabu and Shriya Saran's character could have been better written.So, overall, Drishyam2 is worthy sequel to 2015 s Drishyam which should be applauded for its skillful writing, brilliant performances and astounding climax.",
            "review_date": "2022-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "EXPECT THE UNEXPECTED!",
            "content": "OMG The way they performed the resolution to the problem damn!!! The plot progression laced with clues and twist was just WOW!!! The balance and the overall maintenance of story and details!!! The audience was expecting the unexpected and the movie said YES to that!!! The acting and action was on point literally everything was on point! I literally stood up during the climax suspense! YEAH IT WAS WORTH IT!!! I LOVED IT MAN THANKS TO EVERYONE FOR THIS MASTERPIECE!!! BEST EVER I JUST LOVED IT. I thought drishyam part 1 is unbeatable and couldn't be of more accurate and there wouldn't be any better story than the 1st one but drishya 2 sincerely is a chef kiss! It truly fulfilled our expectations!!! Much love for every single person who contributed to this masterpiece!!! And thanks to audience as well! Good luck for part 3!!!",
            "review_date": "2022-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "loved it",
            "content": "Claps at the time of the final unveil. An excellent pay-off of a neatly made sequel-remake.There's no stopping this one.Sureshot Blockbuster & a certain long-runner\nMust watch for those who haven't watched the original.The new addition, Akshaye Khanna, elevated the film with his classy screen presence. He's the greatest asset of this film.Ajaydevgn did well to underplay his part.Tabu & Gaitonde - ferociousshriya & ishi dutta added depth by showing their vulnerability.1 star less because I had an issue with the screenplay of convenience (back when I watched the Malayalam version as well) & it still stands.But that doesn't matter much coz it struck a chord with the masses.",
            "review_date": "2022-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Drishyam 2 review",
            "content": "After 7 years the case is reopen, disappearence of Sam son IG Meera from 2nd October 2014.Can Vijay protect his family from police?Drishyam 2 is a perfect Remake for Hindi audience.The desicion of Akshay Khanna cast in this Film, was superb.The battle of intelligence between Akshay & Ajay 🔥🔥 great to watch, and their performance was outstanding. Akshay Khanna as cop unbeatable & no one can Play the role Vijay sanglekar except Ajay Devgan.Tabu's screen presenc was too short, but she also amazing.One negative side is compreratively drishyam other characters didn't get importance specially Vijay's family members.The last 20 minutes'of this Film is full of twist & turnsOverall it is good movie in the genre of thriller.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "I'm really glad they were able to keep the same suspense and thrill as the first one and the twist at the end in classic Vijay fashion was a spectacle to watch. The sequel was not needed but I'm glad that the story was able to be flushed out even more and feel like it's own thing on top of adding more to the original.",
            "review_date": "2023-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock once said\n\n\"there is no terror in the bang, only in the anticipation of it.\"\n\nwalking into the theatre, it is natural for you to think, is there really the need of a sequel? is it just gonna be another cash grab or there really is more story to tell which can match the complex narrative and high stakes of the first film which was so perfect in every way? believe me, in the climax, you'll literally start clapping to the film's genius.\n\nthe film starts off with the anticipation that Vijay and his family from the first film might, they just might get caught for their crime they committed 7 years ago and managed to get away with it by fooling the entire police department just on the basis of visual deception.\n\nthe film starts off slow prioritizing the world-building and characters over the plot, but that's just the beginning, because the payoff it gives at the end (trust me, it's even more bonkers now) is just phenomenal. having written a script myself (which took me 3 weeks by the way), I can only imagine of getting such wild and risky ideas to put in the climax. cheers to the original writer Jeethu Jospeh for coming up with such unique concepts and connecting them to cinema.\n\najay devgn once again beautifully portrays the protagonist (still scecptical on this one) Vijay Salgaonkar who appears stoic and calm on the outside but is planning everything to keep the secret \"buried\" on the inside. tabu as this ex-cop turned grieving mother out for revenge and closure is just a perfect follow-up to the original film. kamlesh savant returns in his role as Gaitonde and does not disappoint, he still oozes the same anger he had 7 years ago on Vijay for ruining his career because he was the only one who knew the truth behind it all but lacked the evidence to prove it. but, out of all the returning cast members, it was Akshaye Khanna, the new addition to this universe, that stole the show. just his presence is enough to make the screen shine and his dialogue delivery is enough to give you the chills.\n\nthe soundtrack once again, fucks hard. absolutely thrilling and apt for the scenes. athough, it isn't Vishal Bhardwaj who has composed it, Anil Johnson does manage to keep up with him and provide some good scores.\n\none thing I would like to point out is that the film also delves deeper into Vijay's mindset as a person. it perfectly depicts how Vijay and his family with him will have to be in fear their entire lives just to keep the crime they committed a secret. even though, they are free, freedom isn't with them. there is a beautiful line at the end of the film which goes like, \"even if Vijay manages to escape the cops with his wits forever, he will never be able to match eyes with the parents of Sameer Deshmukh (the boy who was murdered in the first film)\" indicating how ashamed he is and his life itself is his punishment.\n\na perfect sequel, that's it. Vijay Salgaonkar is indeed, the smartest man alive.\n\nP.S.: this film does a few things different than the original Mohanlal film in order to streamline the runtime and it does manage to do so successfully, but deep down, I feel that it was Georgekutty's (Mohanlal) journey that comes a step above (you'll understand it if you watch the original Malayalam film) and shines just a little brighter than this.",
            "review_date": "2023-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie, great acting and content by everyone.  A big salute to Ajay",
            "review_date": "2023-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good but too much cinamtic liberties to take in.",
            "review_date": "2023-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely mind blowing. Ajay is superb actor. He is the only actor currently in bollywood who has kept bollywood alive. Rest all khan and Akshay all are flop and overacting actors. Ajay is the only superstar who is still box office hit since his first film and purely because of his talent and acting skills. Rest all actors were only because of their blind fan base.",
            "review_date": "2023-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must watch this movie, it has logic as well as the unbelievable twist",
            "review_date": "2023-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is hard to imagine topping the genius of the original, or even exceeding it, but this sequel has succeeded. Once again the brilliant Vijay finds himself battling with the ghosts of past sins, except this time the grim reaper is the new, determined Inspector General Tarun, played well by Khanna. I am impressed they brought back all the old players and seamlessly jumped ahead 7 long years. I am even more blown away at how Vijay anticipated exactly how these threats would play out, down to the minutest detail. This time his manipulation of illusion extends beyond the local game to the system itself. His enemies never stood a chance, so well thought out is his every move, so well crafted the narrative defenses around his little world. There is a nice touch of closure to this sequel, with human kindness between enemies. It is hard to imagine how they can extend this amazing series to a 3rd installment.",
            "review_date": "2023-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a piece of brillient writting and good direction . This movie moves around Vijay(Ajay Devgn) and his family which met with an unfortunate incident 7 years ago on 2nd october 2014, when his daughter Anju(Ishitta Dutta) accidentally kills Sameer son of IG Meera Deshmukh(Tabu) . To protect her , vijay burries the body in garden , which at end of the first movie we understand that the body was burried inside the police station ,and this twist made Drishyam one of the best suspense thrillers of the time .Coming to the secound movie where vijay and his family are having good time when the new IG Arun(Akshay khanna) enters the movie and reopens the case for his friend Meera as they both were batchmates during there training. Unfortunately somebody sees vijay buring the body and opens that news to the police and police find the body and start the investigation again on vijay and take him and his family into the custody , Gaitaonde tortures his wife and daughters in front of vijay making him to confess everything .\nI could have written about the ending as well ,as i have already given so many spoilers but i really suggest you to take some time out and watch the movie available on prime video .The stars given to this movie are all based on the twists in the end . Overall movie is bit slow yet intresting .\nThanks \nSidhibaat NoBakwaas",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOVED IT!! The twist was sooo good! do recommend to watch!",
            "review_date": "2023-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I seriously do not understand, why they have to come up with this Sequel!! Most likely they had nothing to really do and being bored sitting home during COVID and just want to write something up.......\n\nDrishyam was way better and gripping tale and on the edge Thriller.\n\nDrishyam 2 on the other hand, just doesn't make any sense, stretched out and very predictable....\n\nActing was Good, Story was just a so so.....\n\nThe guy who was in Jail, remembered seeing Ajay 7 years back after midnight in the dark, had showel in hand....walking out of the Police Station.....I mean SERIOUSLY!!!\n\nLet me repeat.....7 years back, after midnight, he remembered the exact location when they building was getting constructed.....he knew the spot 7 years later and Ajay's face in the dark with little light.....Doesn't really make sense.....\n\nI mean just showing whatever comes in the writer's head.....\n\nWay OverHyped Movie and nothing else.....",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would recommend everyone to watch this movie, it just doesn't disappoint.",
            "review_date": "2023-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good suspense thriller mystery",
            "review_date": "2022-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very Obvious ending. Saala police pe hi copyright claim krdiya.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot couldn’t have been any better. I was mind blown! Great acting!",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing Storyline, best acting & full of suspense",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good.\nAbsolutely well done film.\nGreat twists and turns.\nGreat watch with the family film.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie tops expectations that has built on top of the last movie in the sequel. It was such a smart movie with so many technical correctness I had a difficult time believing that it is a Bollywood movie. The laws, the official work and the forensic part were so on point, and the climax makes you gasp and laugh at the smartness. A must watch",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akshay Khanna is like a glass of fine wine. His acting just gets better with his age. The movie is well written and Kees you guessing. This movie is superb.",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dang! What a movie…filled with plot twists, one after another. Disregard the critics’ reviews, the movie provides solid entertainment value.",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dont listen to the critic reviews, this movie is a MUST WATCH!",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a Ajay Devgn (Vijay Salgaonkar) and Akshaye Khanna (Tarun Ahlawat) show. The case reopens after 7 years the incidents of DRISHYAM. On the night of 2 October 2014, a man named David fled from the police after having murdered his brother-in-law. Hiding behind an unfinished police station, he sees Vijay exiting it. Afterwards, he attempts to apologize to his wife but ends up getting arrested. On the other hand Vijay Salgaonkar (Ajay) who was the owner of Mirage Cables has established a cinema and wants to continue his passion for making films. He's an aspiring producer now. His family is constantly living in tension about what will happen to them if the truth comes out. His elder daughter, Anju played by Ishita Dutta who's suffering from trauma after Sam's murder. His younger daughter, Anu played by Mrunal Jadhav is now a big girl and his wife, Nandini played by Shriya Saran is always living in tension. They have new neighbors Jenny and Shiv, a couple living next door. Meanwhile the police got a clue and reopened the case. Tarun Ahlawat is the new IG of the police played by Akshaye Khanna who's now investigating the case. The events formed the rest of the plot. Will Vijay Salgaonkar be able to save his family this time Or is it all over for him? Watch the film to know more. Performances of all the actors were awesome. Although my favourite performances were of Akshaye Khanna and of course Ajay Devgn. Tabu's role was limited but important. Others were brilliant. The STORY was the winner. GREAT WRITING. The FINAL TWIST left me FLABBERGASTED. Overall, it's a MUST WATCH.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant writing….simply brilliant and fairly logical twists. Great performance by Tabu and Ajay devgn but the show stealer is Akshaye khanna. This sequel doesn't disappoint whatsoever.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only Ajay Devgan❤️❤️✨️",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I got auditorium 1. Seat were too dirty and not comfortable. Sound was too loud and screen size was very small. Don’t go here waste of money.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good but not as good as the first one",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing acting and execution",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing. From the start to the end had all the thrills .",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very nice story and acting by all. Good directions",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First half was slow but the 2nd half was a rollercoaster of twists and turns.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was very capturing start to end. Intial thoughts were how can they carry it on, but within 10mins the anticipation grew and we were kn edge . A great act by Ajay Devgn",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant and one of the best climax ever",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOVED IT!! The twist was sooo good! do recommend to watch!",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Drishyam 2' is a highly effective sequel which ups the stakes and delivers with skillful writing, brilliant performances and an astounding climax.",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story able to connect with earlier part, great acting by all and its execution with convincing climax",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the best 👌 action, mystery and thriller movie of year 2022. The story line was superb 👌 I recommend go and see the film. If u have watched part one of the film then you will love the part 2.",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must-watch movie! Keeps you hooked till the very end. Great story, screenplay and acting. This one is not to be missed.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story with great acting.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ABSOLUTE MUST WATCH IF YOU’VE SEEN PART 1!!! Best movie I’ve seen in a long time. I would give 100 stars if I could. Please go watch!",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie! The whole family enjoyed it!",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waste of time. Extremely slow for the first 80%. Finally builds up to a rushed conclusion. Disappointing sequel. Over-acting and ridiculous dialogue which was almost laughable. Watch another movie instead.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love it!!!!!!!!! This movie is my number one favorite for all the time. This movie is the best movie I have ever seen. This movie is superb 100 hundred percent me and my family supported for the best movie. Our always fan is Ajay Devgan he is the main character that all our family loved!!!!!!!!! Love this movie for sure!!!!",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bollywood should remove their old trend and make these these types of Movies 😌😌😌",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must watch if you have seen drishyam part first, and climax is Thrilling. Good to watch as Ajay Devgan and Tabbu are still better performer then over hyped Ranbir Aliya duo.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        }
    ],
    "rt_rating": 9.7,
    "rt_summary": "7 years after the case related to Vijay Salgaonkar and his family was closed, a series of unexpected events bring a truth to light that threatens to change everything for the Salgaonkars. Can Vijay save his family this time?",
    "vibes": [
        "bloated",
        "flimsy",
        "hammy",
        "lifelong",
        "blockbuster",
        "bogus",
        "side",
        "inescapable",
        "investigative",
        "kind",
        "unsolved",
        "quick",
        "brief",
        "open",
        "necessary",
        "fancy",
        "hilarious",
        "iconic",
        "vulnerable",
        "unnecessary",
        "limited",
        "sound",
        "flat",
        "smart",
        "cinematic",
        "massive",
        "regular",
        "enjoyable",
        "total",
        "useless",
        "available",
        "afraid",
        "asleep",
        "bloody",
        "sorry",
        "shocking",
        "initial",
        "notable",
        "noteworthy",
        "upcoming",
        "fragile",
        "illogical",
        "commendable",
        "lovely",
        "topnotch",
        "fitting",
        "immense",
        "neat",
        "satisfied",
        "common",
        "crazy",
        "integral",
        "stellar",
        "disturbing",
        "unanswered",
        "witty",
        "classic",
        "legit",
        "traditional",
        "notch",
        "close",
        "cool",
        "stunning",
        "key",
        "fake"
    ]
}