{
    "title": "Let the Right One In",
    "rating": 0.0,
    "release_date": "2022-10-09",
    "num_reviews": 65,
    "genres": [
        "Drama",
        "Horror"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "It shows promise, but it is still a remake of a remake.",
            "content": "Both the original Swedish and its American counterpart borrow the Stephen King theme of making the horrors of adolescence into real monsters. The lead characters, Oskar and Ellie, are latchkey kids in a dismal blue collar town. Oskar lives and unhappy life of being bullied at school and making his own dinner alone at night. Ellie spends all her life looking out a window and hoping for a friend. They cure their loneliness by befriending each other.The book on which the movies is based is much more horrifying that either movie suggests. The relationship between Ellie (or Abby) and her father is not wholesome. Ellie's history is truly brutal. The ending is more graphic and gothic than hopeful.Each movie gets further from the original novel.So far, the series follows the path taken by the movies. It doesn't ask why. It doesn't care why. Instead, it wants to cure Ellie, when those of us who saw the movie know that Ellie doesn't want a cure.Whether or not the search of the \"original\" monster can sustain the series yet, I can't tell. It seems to meander, has way too many characters, and so far does little to develop the two principal characters. Since they are the heart of both the book and the films, that may be a problem as time goes on.Still, given the current state of drek when it comes to originality in Hollywood, I would rather watch the remake of remake of the film version of a novel than about 90% of programming.The actors are good. The story is interesting. And i hope the show continues to expand the story.Let's give it a chance.",
            "review_date": "2022-10-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tentative opening episode... Will future episodes improve? *update* yes they have",
            "content": "As Episode 1 of \"Let the Right One In\" (2022 release; 10 episodes of about an hour each) opens, we are introduced to Mark as he is on a train, with a large box next to him, later revealed as containing his young-looking vampire daughter Ellie. Mark and Ellie are returning to New York for reasons unknown. Neighboring their apartment is a single mom and her 11 or 12 yo son. AS it happens, the mom is a police detective and at the start of a grizzly investigation into a suspicious death,,, At this point we are 10 minutes into Episode 1.Couple of comments: you may recall that on 2008 a brilliant Swedish film \"Let the Right One In\" (based on the Swedish novel of the same name) was released, which in turn led to the 2010 Hollywood remake \"Let Me In\", quite good but not the sensation that was the Swedish original (and it bombed at the US box office). Now a decade+ Andrew Hinderaker (\"Away\") brings us this TV series, \"inspired\" by the Swedish novel. Based solely on the opening episode (the only one available at this time), I can't help but wonder what the point of it is. The premise is of course the same as before: a man and his vampire daughter who looks like a 12 yo girl but in reality we don't know how old she really is, try to survive the best they can (the opening episode is tellingly titled \"Anything For Blood\"), while in a parallel story the vampire girl befriends the neighboring boy. If you've seen the original Swedish movie or even the Hollywood remake, chances are that you will ponder one thought: \"why this TV series?\". That certainly is my sense at this point. It's not that Episode 1 was \"bad\" but it feels unnecessary. I'll certainly give it a couple of additional episodes before making up my mind whether to stick with it or whether to bail.I'm not sure why IMDb has this listed as Episode 1 premiering on October 9. I saw Episode 1 three days ago (October 6) when it started streaming on Showtime. Future episodes will be released on a weekly basis. If you are curious about the latest re-imagining of one of the best and most original vampire stories in the last 20 years, I'd readily suggest you check this out, and draw your own conclusion.*UPDATE* I've now seen the next 2 episodes. And I've upgraded my rating to 7 stars, even to my own surprise. Really liking the flow of this mini-series.*UPDATE* 11/21/22 We are now 7 episodes into this, and after a so-so start, this mini-series has really found its own groove. Episode 7 in particular in very strong, as it finally reveals the origin story of whatever happened to Ellie some 10 years ago, and also what happened to her mom.",
            "review_date": "2022-10-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Before you ask yourself \"Just how many right ones are there?\", have a taste.",
            "content": "I really wanted to dislike this series. In fact, I just KNEW I would dislike it because I loved the 2008 original and in my mind, there was a measure of: 'Why mess with a good thing? Contrary to popular opinion, I also liked the 2010 remake. It was in no way comparable to the original, but for the most part, IMO, it stood on its own, and more so, brought this highly original tale to the mainstream viewing public.\"Knowing\" that I would dislike it 😉, however, is quite different from not watching it. And so I did.The first few minutes proved me right. I hated it ... right before I really, really began to like it.To begin, both Demián Bichir (the main character's dad) and Ian Foreman (the \"boy\" main character) deliver stellar performances. Ian, as Isaiah, a bullied, demoralized, misunderstood outcast, brings just the right amount of feeling to every scene he is in. I think very few will not feel for him. In the same manner, Demián Bichir steals the spotlight with his portrayal of a father tormented by what lengths he is willing to go and what paths he is willing to traverse for his daughter. **Below, I have included his Episode 2 \"prayer\" for those who did not have an on-screen translation.**Ato Essandoh, as Isaiah's dad, is also pretty noteworthy.Other characters are bit less noteworthy. The acting from Madison Taylor Baez who plays the girl main character, Eleanor, is especially ... wanting. Some of her lines are delivered too crisply, too \"acted\". This is forgivable. She is young and there are times when she too does really well.The other thing that bothers me a bit is how seamlessly or coincidentally all these characters just HAPPEN to tie in to each other. One HAS to set aside a measure of incredulousness and reach way down for some extra believability in order to buy into it.Still, if one can manage to do that, the series, so far, works. I would like to know how it turns out for everyone.7.5/10********************************\nEpisode 2 - Spanish Prayer.\"Hear my words lord. We have wandered in darkness for ten long years. Enlighten us and show us the way. My God and Lord, I beg you to remove this chalice of death from Ellen's (Eleanor's) lips. Enlighten us and show us the way. Answer me when I talk to you! Merciful God, ease my sorrows. Have mercy on me. Listen to my prayers, damnit!\"",
            "review_date": "2022-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I've",
            "content": "Never rated anything this high right out the gate after only 2 episodes.. I feel this is one of the best done series i've seen in a while. I'm talking filming, editing, etc. We'll see how well eveything else goes as it progresses. I watched the original Swedish film many years ago and while I've never read the book ( so that doesn't cloud my judgement) I loved the 2008 film and so far I'm really liking this. I love Demian Bishir he is excellent in this the only thing is the relationship with Elenor and Isah makes the entire story and I feel the actor playing the boy doesn't doesn't have the skill for the part. Also on a side note why does the mother constantly berate her son in one scene tells him to take off the blazer/jacket it will make him a target?!? I understand the kid's bullied but her and her detective make derogatory comments about him? She seems to make him feel worse about himself? Any ways I'm going to have to rewatch last night episode because I started it a 4am and fell asleep half way thru. So far I am really liking this! I hope all 10 episodes live up to the first 2!",
            "review_date": "2022-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cancelled 😡",
            "content": "Well I just now read it's been canceled!I'm not happy. I looked forward every Friday to watching it! It was such a great series. I liked it so much more than the movie. Very disappointed!!!I wish another streaming channel would pick it up. Too many of the shows today are canceled after just one season. I read also that American Giglio was cancelled. Now Showtime and Paramount plus are combining. Everything is combining and then they cancel so many of our shows. Many shows in the CW were cancelled also. Very very disappointed in their decision to do away with this series. It was such a good show.",
            "review_date": "2023-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So far way better than expected",
            "content": "I was skeptical since a movie is being redone I to a series. That doesn't always work very well. I really wanted to give this a perfect score but just can't after only 3 episodes. The issues I had with the original movie as well as the American version is that I was left with so many questions. Immediately this series is giving the impression those questions may get answered. It has expanded upon the original story and seems to be setting up a nice plot for the viewer to get enthralled with. Add to it violence, gore, and effects that were only teased in the movies. All said this has the hal.arks of an excellent horror series with a likeable cast.",
            "review_date": "2022-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "WHAT!!",
            "content": "I absolutely love this show. It took a while for me to start watching, but when I did I was hooked. It kept me on the edge of my seat and after every episode I was left wanting more. It just kept getting better and better.Now, you are going to cancel it! You are literally going to leave it where people are always going to wonder what could have happened. You cannot not show what happens next! There needs to be at least one more season to create some kind of a descent ending to where it makes since. You left it where it's like MIDSTREAM, what the hell! If you're going to pull that with your shows, I don't want to watch any of them! I mean what's the point, get me interested, get me excited to see what is going to happen next season from what happened with the last episode and then you cancel midstream...That is not the way to win or keep an audience, bit its definitely the way to losean audience!",
            "review_date": "2023-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow Showtime just cancelled a great series!",
            "content": "Unbelievable. This series could had easily gone 3 or more seasons. I am sad. What a lost. The cast was great. The set up was there and it was ready to go. Not an expensive show to make. But streaming doesn't want to nurture shows anymore. They want ratings his out the gate. As someone said if Star trek The next generation was on streaming, it would most likely had gotten cancelled. We know Voyager and Babylon 5 too.Its hard to tell people to watch this show now after that cliffhanger but its a good series. I'm glad I had a chance to watch it and so did others. Showtimes just is lost at this point. And they lost a subscriber. I immediately unsub when I heard this news. Let The Right One In, ya'll!",
            "review_date": "2023-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Needs a 2nd season",
            "content": "I'm upset to learn that this show has been cancelled. I looked forward to watching it each week and was looking forward to a second season. Now, I'll have to add it to the list of GOOD shows that are canceled without being given a real chance. Shows like Downward Dog, Harlots, Imposters, I Am Not Okay With This, and Good Girls, while much less quality tv gets season after season.This show had a slow build, but it draws you in. Each character had dimension. Even the peripheral characters, like Isaiah's dad or Naomi's partner or Peter's caregiver, make you care about what happens to them. And for the most part, it's well acted. Eleanor needs a bit more practice, but the Isaiah kid is going places!Some people complain about how the characters changed from the original source material. Well, it's a reboot, not a remake. I, for one, am happy that they didn't try to remake something so great. Instead, they added a different dimension to the story - one of a parent's love and sacrifice. I found this dimension intriguing.This story has some scarier parts, but overall, it's not scary. It's the character development that gets you, and the grittiness of the real world and the decisions one has to face and make to survive in it.The cliffhanger! For that reason alone, we deserve a second season. 😝 But truly, it's a good show, with great characters and good actors.",
            "review_date": "2023-02-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really well done",
            "content": "If you haven't seen the original 2008 Swedish film version of \"Let the Right One In\", set in the suburbs in the 80s, definitely check it out. The tv series has actually been a really good adaptation of it. The series is set in urban present day. They have picked some excellent actors for these rolls. Especially as they largely focus around the 6 main characters. With the extra screen time you have a more detailed story line, so we're given a really good back story. All the classic vampire tropes are there: burn in sunlight, faster and stronger, must feed on blood- with a twist, only human blood, and only if fresh within an hour. They've had the sense to leave out the silver crosses, garlic and the other 'superstitions' as the vampirism is being blamed on a virus. EXCEPT, 'having to be invited in', which makes no sense. No reason a virus would cause you to instantly start dying if you aren't invited over someone's threshold. Ignoring that, the storyline is great. Prepare to be massively grossed out, tear-up a little, and definitely want to jump out of your skin!",
            "review_date": "2022-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Surprisingly good",
            "content": "I've seen both the original movie and the US adaptation. And always felt like it deserved a part two. This tv-series puts a nice twist on the original story by expanding the setting, introducing new characters and more. I really like what they did with it, honestly. I enjoy the fact that they are trying to give more details about the vampire virus while also focusing on what it's like for those suffering from it and their daily struggle to keep up appearances. I am glad that they changed some things and not just remake the movie into a tv-series. The casting is pretty good and after finishing the second episode, I am really hooked. I am curious to see where they will take the show. The reason why it's not so popular is because it's not on a major streaming service like \"Netflix\". But give it a try and you'll be surprised.",
            "review_date": "2022-10-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It could go either way",
            "content": "I'm one of those people who googles the entire cast after watching a series or movie I love. So I can't explain it but I love Grace Gummer ever since I saw her in Mr Robot so this is how I came across this show. The acting is pretty decent. So far I think it's a pretty interesting story as it feels like an original concept, more or less, but it's just about interesting enough to keep watching. There's nothing to blow your mind away right from the start; still room for improvement as it could be a promising premise so I hope it only gets better from here.I don't have any obvious criticisms, my only complaint is the groans and stomach growls sound a little over the top, you could still make them sound loud and sorta disturbing, but it sounds like you're hearing a recording of a speaker and a little unbelievable. That only happened in e01 so I guess it's fine.I love fantasy shows so I was really looking forward to this and I think it still has a lot to offer, just not showing it yet. Nothing bad and nothing to make it feel special yet but that's a lot to ask so early in the season. It's hard to form a concrete opinion after only one episode unless something's absolutely stellar or absolutely horrid so I'll be updating this later on because it could turn out great or just mediocre.A couple more episodes in and I'd say it keeps it's promise. It's not trying to be anything over the top, more often than not vampire shows will exhibit them as rich or cultured almost in a patrician way, but this is sorta like an everyday average middle class family which feels like a more niche take. If vampires weren't fantasy, I'd say it's a pretty realistic show with realistic stakes. Might be worth a watch if you're looking for something new in the genre.",
            "review_date": "2022-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fail",
            "content": "Another Hollywood rip-off of a fantastic foreign film. The original analyzes not only the intricate day to day existence of a vampire in a modern society but also explores the most simplistic form of vulnerability as a theme. The vampire teen in the film was obviously manipulative and uses men, or in the beginnings, boys, for her benefit. There were glimpses of her true self which showcased the complexity and depth of the story by displaying her truer age which goes towards her motives in courting the boy.The original never related that the man with her was her father and actually made it appear, especially further into the film, that he was indeed someone she seduced decades earlier. Much in the vain that she seduces her knew caretaker. It wasn't simply a story of vampiric survival or innocent misplaced affection, it is manipulation with selfish intent.This rendition is a shallow rebrand that displays the basest element of a storyline that is way more nuanced and complex. It is a way for Hollywood to make money off of the work and creativity of others by slapping together a weak version and running with the same name and fanbase. Hollywood has bastardized a thought provoking and interesting film and turned it into a way for them to make money from a singular element placating and pandering to the audience that they deem stupid.Three stars are for the performances and production which is subpar but passable. I would have been more interested in a furtherance of the original film and see how those two survive as two children through different eras. The film was set during the early 80's. So show them in the late 80's, 90's etc. Do something that links it to the source material but that would compel Hollywood to acknowledge a great film from a foreign country that had an original idea.",
            "review_date": "2022-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A modern classic tale gets the TV-Series treatment...",
            "content": "An expansion on the original mystic Swedish version, but this TV-Series digs deeper into the love, protection and devotion from a parent over their child. Either that child be a social outcast and bullied (like the detective's nerdy son, Isaiah, who loves his magic), or neglected (as with the case of Claire Logan who discovers dark family secrets hidden by her wealthy selfish father). But Claire's dilemma is that she was the mother figure for her dying brother, and sets out to find a cure from his vampirism.Most important of all is the case of the protagonist, Eleanor Kane, a child vampire protected by her father, Mark Kane, from committing evil acts that he instead performs himself - the true test and love of a parent. It is this relationship that the series will hinge on, and already you can sense the tension between daughter and father, as the young one yearns to hunt and kill for her human meal.In the gothic urban setting of NY, this series has set-up the premise of two outcast children out to make a connection through their loneliness and pain. While the third older child, Claire, seems to be on a quest to find a cure for the blood lusting disease, and in turn might help Eleanor's plight.At present I am not convinced with the forced-like set-up, and the too many coincidences that link the characters. But I will forgo that minor discrepancy as the eeriness and urban gothic visuals have drawn me in and left me wondering what is in store for Eleanor Kane - and how far will a parent protect their loving child.",
            "review_date": "2022-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So good! 3 episodes in and absolutely hooked!",
            "content": "I'm reviewing this after watching the 1st 3 episodes. I've also seen the original Swedish movie and American remake of that movie and loved both. Never read the book. So I went into this series with some expectations already.Let me just say this series far exceeded my expectations!! I decided to watch the first episode before bed one night and ended up watching all 3 currently available episodes and paying for it the next day at work lol. But I honestly love this series. I already hope it gets renewed for another season. The main story line follows the two movie versions I've seen. However, there's another story line I wasn't expecting that can easily morph into multiple seasons alongside the main plot. This storyline wasn't in the movies, not sure if it's in the book (being purposely vague to avoid spoilers).If you're a vampire fan, I think you'll love it. If you read the book, you may have some expectations that don't live up. But it's a dark, interesting story and a great \"realistic\" take on vampires if you're into that. Highly recommend!",
            "review_date": "2022-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "AWESOME & ADDICTING SHOW AND ONLY 3 EP'S IN!",
            "content": "Love it so far and I haven't seen the movies or read the book yet! Great writing and pacing and VERY suspenseful! Grace Gummer and Nick Stahl are two of the most underrated and convincing actors in the game and the rest of the cast truly knocks it out of the park. Really great blend of horror and violence with not too corny or over the top VFX either, especially considering the subject matter. The plot is great and original and pulls from that highly respected Stephen King realm of adolescent life meets horror genre storytelling. Stoked for new episodes every week! Showtime is killing it with this and \"Yellowjackets\" and the \"Dexter\" reboot all in the last year!",
            "review_date": "2022-10-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good",
            "content": "I am unfamiliar with the source material so my review is solely based on my opinion of this iteration. I enjoyed the series. It is an interesting concept and a different take on a vampiric series. I enjoyed the children's storylines and budding friendship, as well as their parents and their potential bond. The acting from these four was great. I enjoyed the questions of morality that the series poses in having to choose between saving your soul or saving your child. Some of the graphics looked really good, for example, the way the girl crawled on the floor and the vampiric eyes. Now for what didn't work: I was not as interested in the storyline regarding the brother/sister and henchman. I'm not sure if I just missed it, but I could not understand why the henchman was willing to go to such lengths to help the brother and sister or what his loyalty was to the scientist father. Whatever the reason, it was not compelling like the motivations were for the father and daughter duo. Some of the effects looked great, others not so much. The teen vampire's burned body was very obviously a body suit that you could see the wrinkles in when he moved. Also, a good amount of the supporting roles' acting needed improvement. The male cop, the father's best friend, the henchman, the male teen vampire and his sister's performance felt a little off at times. Despite room to improve, it was good enough to hope that it is renewed for a second season. Good series that is definitely worth a watch if you like the genre.",
            "review_date": "2023-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worth the Watch.",
            "content": "Just got through with the season, and was blown away. And I generally hate this particular subject since it is hard to suspend disbelief. But it just works. Ignore reviews that compare to the movie versions. This is its own thing. The kid actors do pretty well (which can be challenging), but all of the actors nailed it in this character driven drama. Special effects are minimal, but not really needed. The stories in this stretched out version are very suspenseful and easily pulled me in. The slower parts still kept me engaged since the explained some of the relationships between characters. Very Dexter-like feel without the narration and morbid humor.",
            "review_date": "2023-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I am (almost reluctanly) enjoying this series.",
            "content": "The original Swedish film is a horror classic and on my all time favorites list. The American knock off \"Let Me In\" is tepid entertainment with none of the creative boldness of its predesessor; worthy of one viewing but no conversation starter. This series is surprisingly ok, though I find myself wishing they had just created a new frnachise and left \"Let The Right One In\" out of it. The story is gradually becoming borderline sci-fi and cumbersome in its long list of characters and intrigues. However, while I am disappointed in the changes that were made to the characters and story, I am (almost reluctantly) enjoying this series. It's a good story, I admit. But when I saw the first billboards I was hoping to see a gritty, realistic continuation of Ellie and Oskar's adventures... or misadventures... that would carry the darkness and moral ambiguity of the original. The changes made to Ellie are my biggest problem since \"her\" character was so complex in the original. It easily deserves a 7 since I find myself anticipating the next episode, but I gave it a 6 as an admittedly meaningless protest. I am being petty perhaps, but while it's fun to watch, it just doesn't capture the horrific magic of the Swedish original.UPDATE: When I wrote the above review I was at around ep 3 or 4. I am now at ep8 and the show has been slowly circling the drain for a while. The things I didn't like about it have just become worse and it's turning into a bit of a tepid romance that doesn't seem to know what to do with itself. The initial mistake of writing Ellie as an innocent is blunting the edge of what is already a blunted character. I've gone from anticipating the episodes to just getting around to it later. Downgrade to 5.",
            "review_date": "2022-11-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unique and Supremely Interesting! Vampires done Right",
            "content": "I Love this new series! Such a refreshing change from the usual Buffy and Angel,Underworld,The Originals ect type of vampire depiction..Now I happen to also love those shows and movies but the vamps are always are alittle far out there in the way they are shown.. In this series, everything feels and seems so believable and realistic, its just really different and Very cool as well as sad.The actors are so good in their roles, especially the lead girl and her dad..\nIm also watching the other new series\nInterview with the vampire and it pales by comparison...Maybe its the gay theme,once again and ever present in just about everything these days,but I'm tired of seeing it pushed so much..Its great to see a series or movie where its not forced into the writing...I love seeing nick stahl again!Anyway, this is some great writing with some very good acting...the stories go by so quick,or maybe im just really into it! The only thing I wish here is that the stories were Longer...its That good! If you like vampire shows, definitely check this one out!",
            "review_date": "2022-10-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not sure this story is capable of a series",
            "content": "I loved the move \"Let the Right One in\" but this series makes some major changes that I am not sure work for what I liked about the original story. As others have mentioned this show concerns a young vampire Ellie. Here she is with her father Mark. Mark and her are returning to New York for, I think, to find some way to cure Ellie. Ellie meets her neighbor, a picked upon potentially LGBT, youngster named Isaiah. They become friends. In a totally different plot line we are introduced to a doctor who is searching for a cure for his son who is also a vampire. This does seem to be the bones for a series but from the initial episode it seems very sanitized.First, Demián Bichir is not right for this role. I never thought he was that good of an actor but his thick accent is irritating to me and takes me out of the story. I also don't like the way they made him Ellie's dad. In the original the man with Ellie had a much darker reason for being there.. while I know that probably can't be done on network TV, isn't this Showtime? It could go dark.Ellie is supposed to be more of a \"monster\" and here she seems like child with an illness (like cancer) than a dangerous and cunning creature, who, while in the body of a child, isn't a child.The young picked upon boy also seemed too sanitized. In the original the boy is neglected by his parents and alone a lot.. making you able to see how he could be enthralled by this creature. Here Isaiah's mom is very supportive and also a police detective, which kind of seems like it would be difficult to have a vampire in the next apartment who actively kills to get blood. The movie everyone was far more *out in the middle of no place* and not mention was made of their jobs.After finishing it I wasn't really that intrigued to watch the rest of the series. I suppose people would want to see if they find a cure, but after the things Mark does on a regular basis... even if they find a cure, is it too late? I think so.",
            "review_date": "2022-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Deserves a season 2",
            "content": "Honestly I've never watched the original movie and it's US version. To me this series is amazing great story. I'm not a guy that will try to find all the wrong thing with a movie.. if it's good it's good if not than ok.. but I can say that this show is great and the acting the suspense and so on (not trying to spoil).. But if this was on Netflix we would be hearing alot about it.. so give showtime a chance and watch the show you won't regret it... I'm just hoping that there will be a season 2 of the show cause the way it ended is killing me, and I'm hoping to see the OG Vamp in season 2 and just wanna see how this show goes.. lots of potential to be something great.. I mean if you can watch vampire diaries than this shouldn't be a prob at all ..",
            "review_date": "2022-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Solid",
            "content": "Season 1:\nThis show was a nice shock to me as I was unaware it was coming out.It is 10 episodes long, averaging at about 8/10 each with 1 or 2 9s in there also, the show drags a little in the middle here or there but nothing really bad.I like the twist that this show has put on the movie and book, I think the characters are all enjoyable and the story is interesting and solid.Ellie is a vampire and her father kills to feed her, the season is about trying to find a cure for Ellie while getting tangled in relationships as they move around to keep a low profile.There isn't a whole lot of vampire action but there are some pretty good stand out moments in the episodes that make up for itI'm looking forward for season 2!",
            "review_date": "2022-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not as good",
            "content": "I've read the book a while back. I've watched both the Swedish and American movies twice.The television show isn't as dark or chilling, and the characters do not have the same level of \"human\" connection and emotional chemistry. And the narrative and visual effects are mostly different and \"tone-down.\" That said, where is the horror?I am not saying it is a bad show. I am saying it is not as good as the book or the movies, in my opinion. I will continue watching the remaining episodes to see if the narrative gets better. So far, the first three episodes feels \"dragged out\" and slow in storytelling.",
            "review_date": "2022-10-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pretty shallow and immature rendition.",
            "content": "I havent seen the Swedish original, or read the book, but I've seen the American version with Chloe Grace Moretz which was excellent.This new TV series version of Let The Right One In is a shallow and immature version of the story and characters, with none of the darkness, lonliness or melancholy of the original films.In this version the scenes and characters are bright and friendly and the story plays on the cliches of happy family life, which frankly have nothing to do with a dark vampire story.Clearly this TV series is a poor immitation of the source material. It has the feel of a cheap TV show made to appeal to teenagers with little to no taste.",
            "review_date": "2022-11-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's ok I guess.",
            "content": "So let me start by saying that this show is not bad and probably worth a watch. With this said, I think it's important to note that it has hardly any resemblance to the souse material. I have read the book and have seen both films and liked them both, the original story is very dark and disturbing and leaves a lot for the viewer, or reader to work out for themselves. This series completely alters the relationships and personalities of the characters and makes the whole thing feel like a very diluted version of the original story. The Eli and father relationship is very different from the relationship she has with her protector in the previous versions and Eli and her friend feel like well grounded kids instead of the killer and outsider who make a connection. The homicide detective next door and vampire street drug storylines are not required in my opinion, but I get they need to add some drama and filler. I don't usually like to compare things against one another, however this series is so far removed from its source material I don't know why they just didn't call it something different. Would I recommend this show? Yes I think I would, but don't expect anything in the same tone of the films. 7/10.",
            "review_date": "2022-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Have liked since 1st ep.",
            "content": "Well, this series is really good. I know for a lot of ppl, it may be too slow in the first 6,7ish episodes & I hope that most stuck/will stick it out, because the payoff is well worth it, I mean episodes 8-10..just kicked it into high suspenseful gear! As I stated in the heading, I've enjoyed it from the start, I like the cast & who they all play, very well casted show. Whether pro or antagonist, I kind of liked everyone. Was a cliffhanger, so I am really hoping for a second season. Highly recommend. Great drama & suspense! Also remember, just because the story/genre is at its core, vampiric, it does not mean that this is a typical \"vampire story\". It is a very good suspenseful drama. With a tinge of romance.",
            "review_date": "2022-12-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Didn't work for me",
            "content": "As a person who had seen the original Swedish movie, read the novel and tolerated the American offering of Let Me in, I am sorry to express my disappointment in Showtime's recent adaptation.It does not follow the novel or the original storyline but makes up a new tale using the same characters and scenes from the original story.The original story is a coming of age tale with a strong focus on childhood bullying.I don't want to spoil the plot to others, but I highly recommend spending time to watch the original Swedish production before watching Showtime's spotty adaptation.Whereas the original film was a horror movie, I feel that too much extraneous subplots made this show tedious.",
            "review_date": "2022-10-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "They Disney-fied One of The Darkest Vampire Stories",
            "content": "I loved the Original Swedish, American version, and the book but they really screwed up the series in so many ways. The series is bubble gum.The originals were unapologetically bold and dark and put a fresh twist on an old story. This was during a time when things like Vampire Diaries and Twilight made it sexy instead of scary.I am five episodes in and with each one I can't wait for it to be over. The girl vampire is so wrong for this role. She acts like she is 12 even though she is much older. She is not scary at all and one dimensional. The boy character is adorable but again not right for this.The atmosphere and music is also bubble gum and the lighting is even wrong. It feels like any other generic series on NBC, CBS, etc. Nothing special here.If they are going to deviate SO far from the original characters and story they should have named it something else because it doesn't do any of the originals justice.The only thing that is similar between the series and the originals is she moves into an apartment with her keeper and is transported in a chest. That's it.",
            "review_date": "2022-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ummmm what did I just watch? Brilliance.",
            "content": "Ummmm what did I just watch? Brilliance. I do glad the writers to this story and these characters, each character on there own journey. Each episode gives you a little bit more and keeps you wanting more. We still needed more info about the people on these pills but the cops investigation and the sewer incident gives a look inside of what has been going on in the city. Forget the original show this is a NEW IMPROVED VERSION, WITH GREAT WRITING AND ACTING. WE NEED MORE.... I'M AN INVESTED FAN. The finale left me speechless, I just couldn't believe was I had just watched. Amazing..I can't wait for SEASON 2.#LETTHERIGHTONEIN. #LTROI.",
            "review_date": "2022-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Way better than the original movie",
            "content": "The original Swedish movie was a dreary, tedious affair. Extremely overated. Only the last 5 minutes were good. Then came the excellent American remake which was one of the best vampire movies ever made and finally showed us in terrific graphic detail what happens when a vampire comes in uninvited. Now we have this, so far terrific new series. The always reliable Bircher leads and the rest of the cast is great; though the girl vampire was a bit stiff ( though she seemed to loosen up in the second ep ). The series needed to expand the plot line of the two movies and so far it's quite intriguing with the scientist trying to find a cure for his son ( which I'm guessing turned Eleanor ). There is definitely a lot of potential here with a likable cast, good pacing, well written dialogue and directing.",
            "review_date": "2022-10-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Love this series!",
            "content": "I have seen both of the movie versions, wasn't expecting much from the series. Boy, was I wrong...the series hooked me from episode 1. I believe it is one of the best series showtime has produced thus far. This show manages to humanize vampirism...had me looking forward to the next episode and definitely the next season. Unfortunately, there is no next season...very, very disappointed with showtime, especially since the show ended on such a cliffhanger...not fair to the viewers to end it like this. Makes me want to cancel my subscription . There is so much badly written garbage on tv...it was very refreshing to find something new, different, well written and well performed. Shame on you showtime!",
            "review_date": "2023-02-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "LTROI Season 1 Review",
            "content": "Sweden has produced two inspirational people for me: The Author J. A. Lindqvist, and The Filmmaker Ingmar Bergman. Indeed, most of my favorite films and books are \"Foreign\". That said, it is, in my experience, challenging to translate a successful story from old European culture to American Hollywood.For instance, my Swedish Daughter-In-Law watched the English-subtitled film version of \"Let The Right One In\" (LTROI) with me. She complained, \"That's not what they said! That's not what that means!\" So we turned off the subtitles and sound and were still able to enjoy this magnificent film! This is a testament to the great acting abilities of Lina Leandersson (Eli) and Kåre Hedebrant (Oskar). This is, for better or worse, the standard to which the streaming series on Showtime will be held.So Season 1 of the \"Let The Right One In\" streaming series is done and being a huge fan of everything Lindqvist and especially LTROI, I will be giving my review using my personal Top 5 Elements of what makes a successful Drama/Horror story.Reflect current \"State Of Affairs\" to create Relatable Characters-5 of 5 Stars. No matter the language or cultural barrier, these characters transcend that in all four mediums of book, film, stage, and now series. In the last three versions, this is a credit to the fine pick of actors who just don't play a part. They become the characters and are therefore relatable in every sense of the word. For Example, The horrendous toll that addiction takes on modern society and families is a major theme in this Season and is portrayed with sincere realism.The Heart Of The Story-5 of 5 Stars. Capturing and accurately presenting what is considered to be the emotional core of the story is nothing less than an enormous undertaking for a storyteller. In LTROI, I feel that the \"Heart\" of the story is the redemptive and conquering power of love. If you nail this, which this series has, the occasional straying from the book's original storyline is forgivable.Political Correctness Without Being Preachy-3 of 5 Stars. Successfully pulling this off these days without a great deal of controversy is almost impossible without creating a \"Niche\" film that struggles to appeal to a wide audience. That said, this show did better than most. For Example, It has become a cliche in the rulebook of horror films of the past decade, that a main African-American character can be a victim, but they can't be the one to die first. Perhaps it is that most of the series' actors, characters, and showrunners are Hispanic and African-American. That sensitivity allows this show to succeed where others might fail.Physics Versus Metaphysics-4 of 5 Stars. This is where my 40 years as a Clinical Laboratory Scientist got me into trouble. Vampirism as a \"Communicable Disease\" instead of a \"Supernatural Condition\" that defies the laws of physics is only hinted at in the book. To me, if you are going to make the former the Main Theme of the storyline, you better get the science right. However, the Writer side of me, as well as the LTROI showrunners, must abide by the 2 dominating rules of Keep It Simple, Stupid (KISS), and Show, Don't Tell (SDT). KISS mandates that any story has to be told on the intellectual level of a 12-year-old to succeed. SDT means you let the story play out in the \"Theatre Of The Mind\" and not hold their hand and walk the audience through it. Thus, you have a jug full of whole human blood that doesn't turn into a gelatinous mass of clotted gook for the vampire to try to consume without the science of such a thing getting in the way.Show Me The Money-4 of 5 Stars. I only give this rating because of the narrow but profitable viewership demographics. The Prime (As in Money-Making) Demographic for this series is 16 - 30 year-olds. They have much more spending power today than I did at that age. Thirty-one and up will only stick around if there is Full Frontal Nudity (FFN). Sixteen to Thirty will subscribe to the streaming service (Showtime) if you can hold their attention span for longer than half a minute. They also spend money on Merchandise \"Tie Ins\" like posters, action figures, etc.... Without FFN, the only draw for 31 y/o and up would be gratuitous violence and gore. This has to be carefully managed to not be overdone for the younger viewers which, so far, has been accomplished even with the graphic cutting of throats and mangling of victims. It would be a slam-dunk draw for a wider (And older) audience, and a rating giant, however, if they could get 27-year-old Lina Leandersson to be a part of it. Maybe as a Director of some episodes or as a major character going forward.So there you have it. A solid 4.2 out of 5-star rating from me. I actually look forward to Season 2 if they stay with their present Showrunner(s).",
            "review_date": "2022-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great show got canceled I mean common",
            "content": "Everything was very good about this show , the plot , the actors performances , the drama , the emotions . It even contains a very deep side of our character Mark that thin limit between good and evil .I loved Madison's performance and ofc our dearest other actors like Demian , Anika , Grace and Ian Foreman I've falled in love with this boy\nI won't spoil so my review could be useful for those who haven't watched the show yet , but believe me IT WAS A GREATTT SHOW\nI don't know why it's canceled rights issues or something but we as fans ( for this show cz I haven't read the novel or seen the movies ) but we need this to be back so please\nWE WANT A COMPLEMENT FOR THIS STORY !!",
            "review_date": "2023-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very enjoyable",
            "content": "I personally liked this show a lot. Good production, good acting and good script.Good atmosphere and characters. Liked the different angle on the 'vampire theme'. Was different, in a good way.I won't go into any specific spoilers.But... some of the choices series creator Andrew Hinderaker makes to expand the story into a TV series land beautifully, particularly the emphasis on Mark's fatherly care for his daughter Eleanor and the toll and sacrifice of keeping her safe puts on him.Overall, this is a great show which builds up the story and characters throughout season one with some great moments. It's well written and acted. Stick with it. You wont be disappointed. Hoping for a second season - please !!!",
            "review_date": "2022-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Loved it",
            "content": "I actually thought the show was a bit slow moving, at least the first 4 or 5 episodes. Mostly character development. I though it did pick up but it took the last 2 episodes before I went WOW! Now I hate the thought of how long I have to wait for season 2, assuming of course there is a season 2. But judging from what I saw, there most likely will be. I loved both the original Swedish film, and I also loved the American remake with Chloe Moretz. This is different, but in a different way, and no less great. The story is somewhat different than the movies. For starters the child vampire actually is the daughter of the father figure. You also get an origin story. So the first 8 episodes are quite good, but I can't say they knocked my socks off. But still compelling. But episodes 9 & 10 were flat out great and left me wanting more. Allot more. That's it...sorry no spoilers...lol.",
            "review_date": "2022-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Potential",
            "content": "I think the series has the potential to run for at least 10 years because of the subject matter. I have seen all the movies and i wasn't happy for a series until i saw it and i was impressed. The players involved will be replaced according to the timeline but the series as a whole can have a long run. I look forward to see what new adventures await the series, it could have different locations, people, situations and the stories can just roll out effortlessly because of the ways it can be told and the different people, groups, ethnicities that could be involved. I would love to see where it goes after this initial series, i would love to see more of Ms Beaz, Mr Forman, they have hit the chemistry meter and knocked it of the wall.",
            "review_date": "2022-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Still part of a whole but different I like this version better",
            "content": "It may not follow the original storyline or the book but still, its character-driven, plus its different perspective is always welcome the characters are well-played and driven I like the mixture of talents used to make this series. I hope they will continue these stories to unfold a truth one can never give up. Expect the unexpected and remember there is justice at the end of the tunnel. I look forward to each episode told a few friends about it they like it also. It has grown into a deep mystery as to what we are being led into, I wonder if they will release more info on the coming episodes.",
            "review_date": "2022-10-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Chilling and Compelling story that separates itself from the original storyline",
            "content": "I saw both the the 2008 and 2010 movies. I liked them both but favored the 2008 version. What I really like about this series is that it's not trying to do a full remake of the original storyline. Instead it goes into the original a little for the set up but tells new stories to give the show a life of its own. Demian Bichir is amazing as Eleanor's father who will do anything from keeping his daughter from becoming the monster she could be. Madison Taylor Baez (Eleanor) gives a Masterful performance drawing you into her character leaving you wanting more. She is definitely the Star of this show.",
            "review_date": "2022-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Suprisingly good",
            "content": "I was hesitant to watch this series as I had heard that it strayed so far from the original and the book.Let me be frank: This is NOT a tv-series version of \"Låt den rätte komma in\" or even the American remake.There are three similarities between this show and the original film.1. The vampires name is Ellie which is similar to the original \"Eli\".2. The vampire is taken care of by an older male human who kills for her(her father in this case).3. The vampire befriends her neighbour boy.Other than that, the story is completely different, although it probably takes place in the same world.Why the showrunners decided to call the series this I don't know.Change the name of the female vampire and it could have been a stand alone series taking place in the same world, with different people, 40 years later and across the Atlantic.The series has good acting, good writing and a compelling story.",
            "review_date": "2022-12-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant",
            "content": "Oh yes love it done 3 episodes in one go what a refreshing show without any woke, up to now acting superb from all the cast. Cinematography great score brilliant seriously this is a boss show get on it. Characters are well written and executed to perfection all of them, you can tell they are putting 100% into it. This is my best show on tv now without a doubt and special mention to the young cast. Very dark but one of them shows each scene is enjoyable to watch this rating needs to shoot up as this is well to low honestly get on it you won't be disappointed 👍👍👍👍👍\nHappy days\nI love it, great job guys. Why this isn't am 8.5 or a 9 is beyond me.",
            "review_date": "2022-10-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just love it!",
            "content": "I know, I know, many compare this with the original 2008 movie, and yes, they're different.If you need to dissect both, you can. Even though both versions share several elements (the most important been the central love story between the vampire-girl and a boy which suffered bullying from other boys), you immediately need to understand the big difference: one is a movie (an excellent one by the way), and the other is a TV Show (also excellent in my opinion).Drama, love, not much gore (only the needed for the story to adds up). The acting in general is good (some better than others), the script is excellent, not only showing the story, the conflict between the need and the moral of a father to keep her daughter alive. 9 Episodes so far (and waiting for the last one). It's true that the first two were not probably as appealing as the followings, maybe because the writers needed to establish the story (actually, an important piece is shown latter). All in all, I think is worth watching it.And that been said, although I really think is a really good show, and I'm expecting to see news of renewal, not sure if keeping my hopes high will be good enough. These kind of shows (thrillers, good scripts, quality, etc), usually tend to \"not been renewed\" in favor of others more commercials ones (with teens, romance, sex, emotional conflicts and any other element basically consumed by teens). This one have something different: quality. I really hope for at least a 2nd season.",
            "review_date": "2022-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lot to like but not related to the original",
            "content": "The original movie has been remade a few times now, and here come the series. Well, at least the series do not pretend to have anything to do with the swedish movie or book other than of a child that is a vampire.This series it not bad on its own with the way they have taken the story. I love the cast, they are all quirky and a little creepy which fits well. The events are also believable enough and not completely made for tv nonsense, but it is not realistic at the end of the day. The series takes a lot of cliched things such as evil rich people, random organizations, military contractor meatheads and the usual plethora of mix between zombie movies and resident evil franchise. All of this is there which is curious to me because in season 2 they have so few ways to go there with this.There is a big trend in 2022 and 2021 for series to start off strong and then jam themselves into a certain questionable path after the first season. This is no exception because the storyline for season 2 is already set and it will just be more of the same really... And we can also see the elements of several love arcs being played with as background drama which will get boring soon (it is already boring as it is..) which were not really needed. Obviously forced for the sake of them existing type script writing.Anyway, acting is great, there are cool things happening and some boring things happening. The good thing is that the series so far seems to be ok with killing people easily which still gives me hope we will get some decent vampire slasher action later on - which it foreshadowed a few times already. Unless they decide to back off on that, we will see.Nothing to do with the book or original movie but for what it is, it is watchable for sure. Have to dock points for all the cliched arcs they put in..",
            "review_date": "2022-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "All I can say is WOW!",
            "content": "I am not one to give reviews, I leave it for others. But this show has compelled me too. The story line is hands down amazing, the battling emotions and morals, the backdrops, and the actors are all 100% authentic and completely draws you in.I first fell in love with Demian Bichir when I saw the Bridge, so I already knew he was going to be amazing. But these two young precious actors convey such love and emotion that I found myself emotional and crying in E9. They display a true unconditional love that goes beyond a friendship and love. They have a deep bond and desire to protect one another.All the characters have such strong life experiences and battles which makes them even more believable in my opinion. They have almost a jaded feel to them with the tiniest spark of hope. I love how there are moments when normalcy is felt briefly but felt.This show gives honor to the original movie and book \"Let The Right One In.\" Those are both unstoppable and invoking. Read the book by John Ajvide Lindqvist's international bestseller, then the movie. Do not watch the Let Me In.So if you are on the fence about watching this show, then jump down, get comfortable, and binge it over and over.",
            "review_date": "2022-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unfulfilled Promise",
            "content": "This had so much promise. The premise is tantalizing. The young actors are superb. Alas, the writing and direction are often formulaic, predictable and just plain lame. The key to a suspense thriller is the thrill of suspense. When you already know what's going to happen because you've seen it all before, there is no suspense. There is no thrill. I just finished the last episode, episode 8, the last episode for me that is. I'm done. So to the director and the writer of episode 8, thanks for making it painfully plain. You and the show are a disappointment. Perhaps you can learn from your failure. Failure often is the best teacher. Better luck next time.",
            "review_date": "2022-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic Variation on a Theme",
            "content": "Just finished this season, and while I could quibble the pacing in the middle and a slightly awkward meeting of timelines, I won't.I loved this show. The cast, especially the kids, were all excellent and the finale was a terrific, suspenseful pay-off.It made the relationships between vampire and keeper really matter in a way that even the movies couldn't quite manage. The violence was restrained and all-the more impacting for it, especially one particular scene in the New York sewers.Gotta say, I loved seeing the talented and very beautiful Anika Noni Rose back on my screen; she was great in Maid.Well done all. Really looking forward to Season 2.",
            "review_date": "2022-12-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Surprising!",
            "content": "The acting and story really grabbed me. I didn't expect this at all. I remember seeing the movie this was based on and really liking it, but this is much more in depth with the characters and relationships and the whole story.There is some gore and violence, which is to be expected in a show about vampires. And this is one of my favorite genres, so I'm a bit biased.The relationships between the kids and their parents is so neat to see. Sometimes you forget it's scary!I have recommended this to many friends and family. I hope there's a season two and that they win some awards. The adults and the kids do a fantastic job!",
            "review_date": "2023-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is one of my favorite new shows for sure",
            "content": "This is the best vampire tv series I have ever watched. For sure one of my favorite new shows .Very entertaining for all ages. I loved it and no I didn't see the movie so I can rate this without bias. I like scary tv shows and movies that aren't stupid. I've seen a few people, rate it low but mabey they are more of buffy vampire slayer fans. I'm not.. I only wish season 1 had more episodes and I'm hoping for a season 2. The actors were all great especially the kids and the story never got boring. The ending was perfect. This show from great from start to finish. I really hope they renew this show and cant wait for season 2.",
            "review_date": "2022-12-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why?",
            "content": "Really not sure why so many like this, the rating is way higher than I would expect, from what I saw, a lot of it is quite amateur, badly written, directed and shot.But there must be something I am missing?This, I understand, is perhaps not a useful review!?But I am just baffled at the rating!A side plot that was not in the book or previous films, some questionable choices in the writing, near the start of the film there is an event that is not logical and I do not know why it happened the way it did, no good explanation was given.The cinematography, Lighting, costumes, casting, script and performances of the first film adaptation worked so well, had a great melancholic atmosphere, I do not see that present here!If I had seen the trailer or some clips, or an episode, without knowing of the book or film, I would not have given this as long as I did, it is... just terrible in many ways.This has NONE of the artistry of its origins, I really wish it did!!I wonder how many people have read the book first?There are some major differences from the book, even from the book to the original film.I think you can enjoy this if you enjoy trashy tv shows, but I am always looking out for artistry, I feel like they made this... to make something.If you do not like chemistry between actors, good cinematography, good lighting, good direction (from experienced directors), informed writing with the wisdom of what is important to each character and the plot as a whole, if you do not like any of these, then this show is for you!!Still, people did make it, they put much time and energy into it, peoples lives, peoples money, peoples effort and time went into this, so I commend them, some of them, maybe all of them, loved it, or liked it, or are they doing it just to do it?Because finally they are doing a big series?I do not know.I just wish for a more faithful, carefully made, deeper portrayal of the source material with writing that doesn't ring so many alarm bells as this did.I can only recommend the book and first film.",
            "review_date": "2022-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "certain parts are dreary",
            "content": "The whole arc with Clair and Peter is dreary. Finding a cure for vampirsm? And Peter, unlike Eleanor is in constant pain? Why not just expose him to full on sun and let him die.I don't quite get why Eleanor's father seems to be looking for another vampire. Does he think that ending the vamp that bit her will cure her? She is not a ravenous monster in constant pain, like Peter. Why not go out into the world and try to find other vampires, like was done in the Anne Rice stories?I like the friendship between Eleanor and that little magician. He is so friendly and happy and to see those brats bully him is awful.",
            "review_date": "2022-11-02",
            "lang": "en",
            "source": "imdb"
        }
    ],
    "vibes": [
        "brutal",
        "dismal",
        "hopeful",
        "principal",
        "unhappy",
        "wholesome",
        "additional",
        "parallel",
        "suspicious",
        "unknown",
        "unnecessary",
        "vampire",
        "weekly",
        "peripheral",
        "upset",
        "vampiric",
        "unfamiliar",
        "adorable",
        "bold",
        "dimensional",
        "generic",
        "sexy",
        "likable",
        "reliable",
        "stiff",
        "uninvited",
        "relatable",
        "successful",
        "wide",
        "authentic",
        "comfortable",
        "international",
        "jaded",
        "precious",
        "tiny",
        "unconditional",
        "unstoppable",
        "amateur",
        "experienced",
        "faithful",
        "logical",
        "melancholic",
        "trashy"
    ]
}