{
    "title": "Vikram Vedha",
    "rating": 7.1,
    "release_date": "2022-09-30",
    "num_reviews": 274,
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "summary": "A tough police officer sets out to track down and kill an equally tough gangsters.",
    "reviews": [
        {
            "review_title": "Entertainment guaranteed!",
            "content": "A good Bollywood movie after so long. Though it is a remake of a Tamil film of the same name, it is indeed a mass entertainer.Hritik Rohan and Saif Ali Khan have delivered strong performances. For the first 10 to 15 minutes, I thought 'what is going on in the movie?' but the movie takes a grip just after that.With a very engaging storyline, strong acting by the lead actors, and top-notch direction, this is a very good movie.I haven't seen the original one, so I think I'm not well qualified to compare the original one to this one. Still, I can guarantee you that if you haven't seen the original one, you will enjoy this one very much.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hrithik Roshan's unmistakeable swag powers this faithful remake of a Tamil cult classic",
            "content": "The duo of Pushkar and Gayathri have enthralled audiences in the South, first with their original smash hit Tamil film \"Vikram Vedhan (2017)\" and now most recently with the hit Amazon prime series \"Suzhal (2022)\". But to make a smooth transition into the tumultuous world of Bollywood is a mean ask but the two capable filmmakers pass the test with flying colours, delivering a faithful remake of the cult classic, enhanced by the unmistakeable swag of superstar Hrithik Roshan.Roshan stars as the titular \"Vedha\" a ferocious gangster terrorizing the streets of Lucknow. Saif Ali Khan plays \"Vikram\", the trigger-happy encounter specialist cop leading the task force assigned with curbing the gangsters of the city. Although both actors don't the same range as the ace performers in the original film, namely National Award winner Vijay Sethupathi and R Madhavan, the directors smartly pivot the character to play to these actors' strengths. The confrontation sequences between the gangster and the cop are laced with mass and gravitas, with Hrithik especially excelling in the stunt sequences with his agility and panache.The gritty, serpentine streets of Lucknow are depicted in painstaking detail as the makers transpose the impact that Chennai had in the original movie, to a North Indian context. The storyline sticks to the original but with Hrithik's version of Vedha coming across as wackier, more gung-ho and fanatical than the smoother, more reserved depiction by Vijay Sethupathi.Bollywood remakes of South blockbusters seldom rise to meet the standards of their original versions. Ajay Devgn's \"Drishyam (2015)\" and Shahid Kapoor's \"Kabir Singh (2019)\" stand at one end of the spectrum, having delivered while most remakes end up in the trash pile, case in point being dismal efforts like \"Force (2011)\", \"Rowdy Rathore (2012)\" and \"Bhaagi 2 (2018)\". Thankfully, due to the deft direction of Pushkar-Gayathri and earnest performances from the two lead actors, \"Vikram Vedha\" ends up in the former category, as a faithful remake that also stands apart with its contextualized take on the Vikramaditya-Betaal folktale. A recommended watch in theatres!",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Highly Recommended 👍🏼",
            "content": "Vikram Vedha is beyond just a faithful remake. The makers deserve a standing ovation for delivering a perfect combination of a meaty mass and a class entertainer. If you have seen the original, this will surprise you with its twists and turns. The director duo Pushkar and Gayatri has done an excellent job again, after delivering a blockbuster Vikram Vedha in Tamil and one of the best thriller series Suzhal: The Vortex, they are back and given another impressive film to the Hindi audience.The pace of the film in the first 20 minutes is a bit slow but the movie gathers its pace once Hrithik Roshan enters the screen and you won't be able to leave your seat when both the lead actors are on the screen. The second half is, even more, engaging with its taut screenplay. The dialogue, cinematography, and the climax are other highlights of the film.The songs are just average. All the fight scenes are stylishly choreographed. Apart from the perfect direction and remarkable performance, the background score and writing are the film's biggest strengths. The intelligent writing surprises you at regular intervals.The script has given equal importance to both the lead actors and does not let one overshadow the other. Hrithik Roshan has done complete justice to the character of Vedha and delivers outstanding performances. Saif Ali Khan also gave a noteworthy performance. Radhika Apte, Sharib Hashmi, Rohit Saraf, and other supporting casts have done a decent job.Direction 4/5\nActing 3.5/5\nEditing 3/5\nStory 3.5/5\nScreenplay 3.5/5.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hindi movie Vikram vedha",
            "content": "Sameer lodayaPls see this movie as Hindi Vikram vedha and don't compare with the originalSuperb content of Vikram beetal which we use to see in childhood has been portrait in new way of cop and gangster story where cop is Vikram and vedha is the gangster..every time vedha comes and ask a riddle to Vikram and Vikram answers to justifies beetals crimesSaif overcame Hritik this time..Hritik was same a like as what was he in super 30..the language spoken here is of U. P..The directors pushkar and gayatri have repeated their fine job after what they did in the original one..alcholiya song is hit on charts and have Been made in a very large scale where you can see Hritik dancing merrily with a good number of dancers..tangy dialogues like \"marange kaan mein nikloge Japan mein\" and \"apne ko khone ka pain saala same to same \"gives good touch of U. P...the action with bgm and bullets is a hardcore oneSingle screen theatres will see a house full board and multiplexes audience will restrict a little bit due to heavy action scenesIf you want to enjoy this movie go to screen where audiences shouts ,whistles and dances.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A perfect balance of a Massy and a classy entertainer",
            "content": "Saw the first premier show here in US and after a long time saw an out an out Bollywood entertainer which kept me glued till the end. Perfect balance of classy and Massy treatment.The story we all know from the Tamil version but here there are few surprises and twists. The basic premises remains same. The director deserves standing ovation for keeping the narrative tight and engaging.Saif ali khan is superb as cool, composed yet mysterious cop! Radhika apte has small but effective role,But it's the one man Hrithik roshan who will outshine everyone with his finest act! The actor always challenges himself to outdo his last one. Here he is ruthless yet sensitive. Although initially the dialect may sound like Super30 but it doesn't hamper. With in 5 mins you are in his world. Outstanding act.It is little more violent but not nonsense. The logic doesn't go for toss! Recommended.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worth Watch But Original is far better.",
            "content": "Every Scene of HR, He Hits Different.Movie Makers tired well. Great afford of not letting the old story and that mass down. It's good.Some long dialogue parts, which makes it boring but power packed performancesWriting and Direction is good enough to make you engaged. BGM is good.First Half is Slow but Second Half is Good.The best thing is movie maintained the Mass and entertainment.Saif performed well but RMadhvan is RMadhavan.While Watching Saif A Khan, he was remininding me of his Movie - Race.Only Hrithik makes the movie intresting when it get slow. He did his best, from the first frame he is entertaining.Original is far better than this But this is enjoyable ride.Review of Vikram Vedha by itsbymayank - Mayank Bharat Bhushan Louteriya.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "POWER-PACK....",
            "content": "What a movie!! First of I'll remind you I haven't watch the original one and I'm glad that I didn't watch it. Because this movie is a perfect thriller with amazing direction. I'll congrats the directors Pushkar & Gayatri who had directed the 1st one also and has directed the remake too and I can honestly say that they have done a brilliant job. The storytelling of this movie is so unique and different that it felt like we are watching episodes wise and that is really cool. Movie will keep you engaged till the end of the scene and the suspense that they built throughout the movie even the audience can't judge who's the killer and that was perfectly done. HRITIK ROSHAN is the soul of the movie. Another best performance by him. The accent that he has carried throughout the film was just amazing. SAIF ALI KHAN is the backbone of the movie he keeps investigate till he reach to the results. Both the lead actors have done a tremendous job and its amazing to watch both of them on screen. Rest of the cast was average but they performed well too. Best part of the movie is the climax totally surprisable. Movie could've been trimmed little bit in the start but still it'll kept you engaged till the end of it. Bgm & songs are delight to watch. Specially BGM is fantastic.So if you haven't watched the original then don't waste a single minute go to the theatres and experience this perfect thriller. You will be satisfied....",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hindi Remake with better ending!!!!",
            "content": "Overall till best Performance by Hrithik in as negative Role! A Well directed film by the original Directors Pushkar and Gayathri. They incremented the original film and pushed it to the another level! Very well executed! Nice work.Those who have not seen the tamil version this film is treat to them.Those who have seen the tamil version will realize that making remake it not a bad thing. The remake give original film value because script is told in different tone and setting. Budget is increased too! So overall a best film of 2022!This will bring back the charm of Bollywood in different way!",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's Complete Blockbuster",
            "content": "All actors performance 10/10\nHrithik Roshan 10/10\nSaif ali khan 10/10\nBackground score 10/10\nDirections 10/10\nSongs 10/10\nAction 10/10Batter then original. Perfect Thriller perfect suspens and Actions Are Next level only Experience in theatre it's masterpiece screenplay well portrait hrithik saif and all co star\nYou remind the story of vikram Aditya and betaal\nSongs are 2 in this movie well listen to ear and satisfy dont miss the chance to watch vikram vedha It's a Hrthik roshan show\nThe best product of nepotism Is HrxThis is called content Wow.............................................",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very beautiful, touching and powerful movie What are we going to do when Hrithik roshan stops making films..?",
            "content": "#NoSpoilers\nA superlative movie this month Vikram vedha\n100 times better than I expected!!A great movie that needs to be experienced on a theater screen! If you have been longing for a good action movie... this is it!If you walked in to watch \"vikram vedha \" (as I did), confident that you knew what was in store, not expecting to be surprised you'd be right...and wrong, I watched this movie just because of legendary actor Hrithik roshan his facial expressions and dialogue delivery is amazing he proved he is the greatest actor no doubt his acting skills no one can beat. I've already watched the original version of this film with the same director Pushkar-Gayathri i went to theater for Hrithik roshan, on the other hand saif ali khan also played his character very well his cop looks blew audience mind just like in sacred game,in trailer many of audience judge that saif is not doing good but he did very well , I can't say enough good things about vikram vedha it's everything we need from a summer blockbuster. Get yourself down to your nearest cinema and see for yourself. It's Awesome. Vikram vedha takes you on an emotional nostalgia filled thrill ride that will have you on the edge of your seat. I was genuinely sweating just watching the incredible action sequences which should be on track for cinematography awards aplenty.I will watch this movie 10 times or more! Let me explain why Lots of action, humor, plot twists, good acting and special effects, cameos, a tight story, tension, and surprises. There's violence and language here, but you pretty much get what you expect if you've seen the preview.! Vikram vedha is a masterpiece of a movie, hell I would even say that it's one of my favorite movies of all time. After 20 years Hrithik and saif have seen on screen it's literally goosebumps and the background score is just no words to describe each and every cast of the film did their best and best director Pushkar-Gayathri. They deserve best director award they've spent day night making this gem.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant if you've not watched the original. Pretty decent, if you have.",
            "content": "The OG 2017 movie was a brilliant movie (Screenplay!! 😮 ) so, when the remake was announced, they had my curiosity. When they announced Hrithik was gonna play Vedha, they had my attention.Now that the remake is out, is it good? Is it better than the Tamil versions? Read on.First off, this is how you do remakes. Bollywood has fallen off over the past several years with the remakes (let alone the horrible originals) but this one was very well done. Is it because the directors were the same? Dunno. Doesn't have to be the case, but I'm sure it helped. Pretty much a frame-to-frame so perhaps, there wasn't much to change from a brilliant movie to begin with. Of course, cultural elements had to be altered to set the film in Kanpur/Lucknow.Vedha - I really liked how understated Vijay Sethupathi's Vedha was. Now, is that the character's meant to be? Or was it his personality shining through Vedha? I think it's the latter and whoever played this role would have made it their own and played it different. Hrithik's Vedha, on the other hand, was anything but understated, and given his personality, you can see why. Not that one's better than the other, both versions are just different.Vikram - Contrary to Vedha, I don't think Vikram could have had a lot of variation, I might be wrong. Saif played the role well, but I thought the internal conflict was better done by Madhavan. There were certain nuances and expressions that I was looking for, that were absent in the remake.Supporting Cast - The Tamil version had a lot of screen-space for everybody, both good and bad, other than the lead. The actors did a better job in delivering the limited time they were given, especially Vikram Prasanna as Ravi. Babloo bhiaya didn't feel as villainous. Didn't care as much for the brother and Chandra in this one. The cops were...so so.I always wondered why Madhavan wasn't cast as Vikram in the Hindi remake, or why someone else wasn't cast as Vedha in the Tamil version. I think having two actors of equal star power helped the 2017 movie but even though Hrithik shined in the new one, I felt that this shine might have taken some spotlight off the rest of the cast and the film itself.As a standalone movie, the hindi version is a breath of fresh air for Bollywood. For people who've not watched the original, this will be a feast. People who've seen the 2017 version, you'll still think 2022 is good but will say it's missing minor things here and there which made the OG the brilliant movie it was.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A whistle podu performance!",
            "content": "1. What an OUTSTANDING performance by\nboth the lead actors Hrithik Roshan & Saif\nAli Khan. Kudos to them!2. Good story, average screenplay,\nbit slow paced but since its a\nthriller it will keep you hooked till\nthe very end.3. Killer BGM, one scene had\nsuper bad VfX ngl, average music\nbut what amazing action scenes!!4. Swag and acting is whistle podu\nworthy!! The way cinematography is\ndone to capture slo-mo action\nsequence of Vikram & Vedha can serve\nas a lesson for budding film makers.Definitely a theatre worthy watch!5. In a nutshell, its a solid yes from\nme!! Not too amazing, nothing close to\nbad either. It oscillates somewhwere\nbetween very good and above average\non the scale.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pushkar-Gayathri Recreated Their Magic Again, Vikram Vedha is a Sure-Shot Terrific Masala Entertainer !!!",
            "content": "Crafted out of the Tamil hit of the same name, 'Vikram Vedha' is a neo-noir action thriller which is rooted in Betaal Pachhisi, a popular Indian folktale. Vikram, a top-billed officer of the Lucknow Police Special Task Force (STF), is assigned to find and kill gangster Vedha Betaal. However, Vedha surrenders himself to the police. During interrogation, he starts narrating stories to Vikram, which slowly start changing the latter's own perception of good and evil.Conceptually, the film has been written and throughout really well. Almost everything, even little props and minor satellite characters that play out in the film have relevance to the central plot. The directors, Pushkar and Gayathri, also the writers of the film, make it a point to leave the story's flow to the two central characters after establishing them sufficiently. Vikram and Vedha's parts have been written with a kind of finer detailing that works at so many levels. Like Vedha's love for Raj Kapoor songs, which has been used in action scenes. It's impressive how nuanced things like these have been woven into the narrative.Nearly, everything ties up neatly at the end, without much wastage. The exception here is the track of a prominent character like Parshuram bhaiyya who is still out there with his minions. It's left unfinished, though you keep hoping that it would tie up somewhere to the central plot at the end. The writers also could have focussed a little more on Chanda and Shatak's (Yogita Bihani and Rohit Saraf) love story which gives rise to a pivotal conflict in the film. You also yearn to experience a little more of Vikram, and dwell some more on how Vedha became as powerful as he is.In terms of execution, the film offers a degree of freshness, and stays true to its world. Even with a non-linear narrative, it's not tough to keep a track of the story's movement and the characters. Yes, the proceedings do feel slow at times, and the climax feels a tad stretched. But the film delivers on a host of accounts. Like the action scenes have been choreographed really well. Like the pre-interval action sequence where the police are combing an area for Vedha, and how he escapes to a container yard is quite slickly done. The use of Lucknow as a setting is quite neat. The film has a smattering of delicious local flavours - from the food to the bylanes to the neighbourhoods. The film's music album is above average. The Alcholia track becomes even better with Hrithik dancing in the video, but you wonder if it was really required.In terms of balance, the film tilts towards Vedha's character, which has been performed excellently by Hrithik. He's menacing, ruthless and yet, extremely emotional in parts. He imbibes the vibe of the character really well. He's effortlessly convincing as Vedha. You can't help but notice the dialect which reminds you of the actor from his Super 30 avatar; that needed a little more attention.Saif as an honest cop, who thinks he knows what's right and wrong, perfectly compliments Hrithik on screen. He's in control of his body language, he embraces the character's inner strengths, vulnerabilities and depicts the gradual change in his thinking really well. Yes, one would have loved to see a little more of Saif in the story. The actor is in his classic good form here, but he needed a little more to chew on. Ditto for Radhika Apte, who plays Vikram's wife, Priya.To sum up, Pushkar-Gayathri, the writer-directors of the film, have pretty much stuck to the blue-print they created for the original, including the way they weave in the elements of folklore in it. It's a plus that they haven't changed the roadmap too much. But they've also not tried revisiting the elements that they had at hand to make the redux better than the original. And yet, this one's worth a ride to the big screen.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece!",
            "content": "Better than the original one. The director duo pushkar and gayatri sir nailed it once again with their dierction.one of the best movies of bollywood till now. Hrithik roshan stole the show with his screen presence ane dialogue delivery. His acting was top notch and expressions were superb as always. His carrer best performance till date. Hrithik roshan once again proves why he is one of the most versatile actors of Indian cinema. Saif ali khan also nailed it as Vikram whenever he appears on the screen. Radhika apte's role was short but important and last but not the least the background music gave me goosebumps.Get ready for the Boxoffice tsunami 🌊",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mass action genre redefined.",
            "content": "Can the remake/adaptation be better than rhe original? Vikram Vedha makes you ask this question repeatedly. They have successfully recreated the magic of Tamil version albeit on a much much bigger scale and in a more commercial manner. Dialogues are sharp, BGM is outstanding but what makes it all the more special is camaraderie between Ferocious Hrithik and subtle Saif. With some new twists and surprises, this one is a pitch perfect action entertainer for hindi audience. Hrithik deserved a far better song than alcoholia to groove to. Support cast is well picked. Action and cinematography too need special mention.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This remake is no less than the original - Worth a watch..! 👍",
            "content": "Following the template of 'Baital Pachisi' which narrates how a smart king (Vikram) is quizzed by a spirit (Vedha) a Baital..!!And for every wrong answer he'll find himself further away from catching the 'master of chaos', the film features Vikram (Saif Ali Khan) hunting to eliminate wrong i.e. Vedha (Hrithik Roshan)*These guys serve fresh-hot entertainment in every frame* 👍When it comes to thriller genre.., bollywood can-not come near to south film Industry.., original Vikram Vedha is the best.., but this time remake *is also no less..!!*Story is the biggest star in this smart Hrithik Roshan-Saif Ali Khan thriller..!!Go for it..!! If u hvnt seen the tamil original version then.., worth watching ..!! 👍",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "who's right, who's wrong?",
            "content": "Wow. I hardly ever give out a 10 rating. And i know all those 10 ratings look suspicious. They would to me too. This is one terrific film. Good vs evil. Right or wrong. That's the theme. I know the title sounds familiar but trust me, this is far different than what you might have seen before. Vikram is a cop and vedha is the man with all the riddles for him to solve. Lots of back story, lots of action and lots to think about. The two leads are great. They play off each other with ease. Its hard to know who to root for. The \"good\" guy or the \"bad\" guy. Whatever you might think you know, this is not the some old story. Treat yourself to a good movie. So few around this year.",
            "review_date": "2022-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very beautiful, touching and powerful movie What are we going to do when Hrithik roshan stops making films..?",
            "content": "#NoSpoilers\nA superlative movie this month Vikram vedha\n100 times better than I expected!!A great movie that needs to be experienced on a theater screen! If you have been longing for a good action movie... this is it! I literally enjoyed the movie throughout and got goosebumps.If you walked in to watch \"vikram vedha \" (as I did), confident that you knew what was in store, not expecting to be surprised you'd be right...and wrong, I watched this movie just because of legendary actor Hrithik roshan his facial expressions and dialogue delivery is amazing he proved he is the greatest actor no doubt his acting skills no one can beat. I've already watched the original version of this film with the same director Pushkar-Gayathri i went to theater for Hrithik roshan, on the other hand saif ali khan also played his character very well his cop looks blew audience mind just like in sacred game,in trailer many of audience judge that saif is not doing good but he did very well , I can't say enough good things about vikram vedha it's everything we need from a summer blockbuster. Get yourself down to your nearest cinema and see for yourself. It's Awesome. Vikram vedha takes you on an emotional nostalgia filled thrill ride that will have you on the edge of your seat. I was genuinely sweating just watching the incredible action sequences which should be on track for cinematography awards aplenty.I will watch this movie 10 times or more! Let me explain why Lots of action, humor, plot twists, good acting and special effects, cameos, a tight story, tension, and surprises. There's violence and language here, but you pretty much get what you expect if you've seen the preview.! Vikram vedha is a masterpiece of a movie, hell I would even say that it's one of my favorite movies of all time. After 20 years Hrithik and saif have seen on screen it's literally goosebumps and the background score is just no words to describe each and every cast of the film did their best and best director Pushkar-Gayathri. They deserve best director award they've spent day night making this gem.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Vikram Vedha Review: Hrithik Roshan and his Beard Do Their Best to Distract You from the Flaws of this Remake",
            "content": "Even though it follows the original storyline with unwavering faith and is helmed by the same writers and directors, the Hindi version of Vikram Vedha is, on paper, not a Xerox copy of the 2017 Tamil film. While R. Madhavan and Vijay Sethupathi played cop versus gangster in the grey-toned metropolitan clutter of modern Chennai, the Hindi Vikram Vedha is set in Lucknow and Kanpur, which directors Pushkar-Gayatri depict as peak, north Indian exotica: Mughal architecture; a palette of saturated, warm colours; labyrinthine slums with brightly-painted buildings; Ram leela actors and explosive Dussehra celebrations in the background; Hrithik Roshan prowling with his trademark, feline grace in the foreground. Technically, all this should serve to make the Hindi Vikram Vedha look and feel different from the original. Yet barring Roshan's solo action sequences, there are few moments in this remake that don't make you nostalgic for the original.Read the full review at filmcompanion.in.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "There is nothing absolute right or wrong",
            "content": "When the story is adapted and remade it adds a heavy toll on the movie team to create the same magic. This movie doesn't disappoint the first time watcher however to the people who have watched original there is nothing new. Saif as vicky has pulled a good act however hritik sometimes looks like he is mimicking. Radhika's talent however I felt like wasted she is not a prop but not a strong character either.some of the scenes between radhika and saif looks artificial.The story premise is well crafted and loosely adapted from vikram betaal is itself an interesting move. As the story is unique, the story shows there is nothing such as right or wrong.Interesting movie might do good. Recommendation: a one time watch.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece!",
            "content": "Vikram vedha is solid!!!! Really didn't expect it's gonna be so amazing. Not a single dull moment from start to end. Highly recommended. The remake nailed it-It did justice to the original one and Hrithik ones again proves why he is one of the most versatile actors of bollywood. Hritik as vedha is his best combination of acting and star power since agneepath,Absolutely electric. The story keeps you hooked up till the end with lots of twist and turns. I did watch the original one but they nailed it all over again with this. Saif ali khan gets a great role and knocks it out of the park. Loved his emotional scenes.Get ready for the box office tsunami🌊Highly recommended!",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Riveting Hrithik elevates this above average Remake..",
            "content": "After 3 years, Hrithik returns to the big screen with a Crime Thriller that tests the boundaries of Good & Evil. Taking inspiration from Vetal Panchavimshati which put forth complex tales of morality, the film pits two heavyweights against each other with the backdrop of Lucknow Gang Culture. On one side is Vikram, an Encounter specialist who believes there is a definite line that separates good and evil people And on the other side is Vedha, an unhinged gangster who is not so sure about that line. Remake of a very popular Tamil film, this takes more of a larger than life commercial approach. Screenplay is full of intriguing scenes and revelations. Hrithik is phenomenal as Vedha, showing many shades of him with equal mastery. Saif Ali Khan provides a solid opposition to him. The supporting cast is really good also. The score is amazing and is highlight of the film. The action scenes bar one, are very stylized and full of slow mo which didn't do justice to the overall tone of the film. Some scenes had weak writing also. Overall a very enjoyable movie with some flaws, headed by an absolutely mesmerizing Hrithik Performance.",
            "review_date": "2022-10-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of time and money!!👎👎",
            "content": "If you have watched south Vikram vedha then you will feel waste of time as each n every scene has been copied same to same, now Bollywood has become bhandwood, they are expecting audiance to go n watch in cinema but they won't put the efforts to bring some quality content to bring audiance to cinemas, observing same copy paste since many years.Apart from that excessive ads from pvr cinemas will make you more frustrated, 2 & half hrs movie took almost 4 hours.Better you go n watch South Vikram vedha with Hindi dubbed there you can get goosebumps but watching this is waste of time and money.",
            "review_date": "2022-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Copying will not help bollywood",
            "content": "First of all, what does the director think, Hrithik ko Desi language me dialogue dekar local feel aayegi... rubbish dialogues, Saif has a hard time with his mobility, doesn't look like a cop.. I watched the original and then this version is just crap..... Don't waste your money on the copy.. watch the original available on apps. A film is supposed to entertain you, it's boring, bad screenplay, Desi acting which gives feel of road side actors acting. I would rather spend the money on something which is worth it than watching a copy. The directors today need to be more creative and present something new with good actors not the oldies.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Such a great film that make you think about the line between good & Bad",
            "content": "Vikram vedha is not only about cop chasing gangester, I think it's about choice that we make and descions we take and how it effect our lives and our destiny.What I loved about that film is realism of every character. They are humans who has those gray shades deep inside, they are neither an angels nor demons\nPerformance wise : Hrithik Roshan is as always treat to watch, he is right now the most versatile star actor in bollywood, He is not only acting vedha, He is vedha, it was a hard task do the character in his own way but he as usual did take the challenge and the result as far as I see is highly impressive\nIt's simply an award winning performance by him\nSaif Ali Khan as Vikram : I think Saif is an underrated actor, of course he made many wrong choices, But here he just aced this role.",
            "review_date": "2022-10-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "After a long time A masterpiece by bollywood",
            "content": "Every minute of this film , something is happening, I dont want to spoilers by trying this review this. Let me this ok so the movie is a thrill continuously and you won't feel that the time has passes by just like that. This is way better watch than bramastra trust me, I think this is not just the best film of 2022 but the film of the last three years. The reason I would recommend this film because the heroes are grounded and not shown larger than life like kgf and such films like that. This movie can be watched again and be absolutely enjoyed. So wat are u waitin 4 go watch the film right now.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece",
            "content": "One of the best remakes made in Bollywood. Since I haven't seen the South version these film really entertained me thoroughly. Full of thrill and suspense. From the start this film kept me engaged.Brilliant performances from Hrithik Roshan and Saif Ali Khan. It was a treat to watch two stars in a film together. Loved their chemistry.Already watched it twice. I would recommend those who have not seen the original should go and experience this masterpiece in the theatres.Hats to the directors Pushkar and Gayatri. For giving such a brilliant direction and story. And also the music. Just simply awesome.",
            "review_date": "2022-10-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Too many remakes and utter lack of originals",
            "content": "Vikram Vedha original is far far better and I am\nNot sure why Bollywood is so hell bent on staying away from originals.We, the audience, can't be paying for the original and then for the remake . This is the longest draught in Bollywood's original stories. Every release gives me a hope of an entertaining movie and ends with repentance.Producers should stay away from remakes because the audience, in today's world, watches movies in all languages not just Indian but international too.In future, I will rather wait for movies to be released on OTT platforms if they are a remake rather than spending time going to the cinema. In pursuit of a quality Bollywood movie; concerned movie watcher.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Massy, Absorbing, Exhilarating",
            "content": "Vikram Vedha is undoubtedly a big , brawling commercial potboiler with exhilarating performances and an absorbing cat and mouse chase laid in the form of an action drama. Presented as a hindi remake of the 2017 blockbuster of the same name which I have missed intentionally. Pushkar-Gayathri's film is a refreshing take on the battle between right and wrong, told flamboyantly through two fine actors. The characters development is beautifully done and are extremely well fleshed out. The thumping background score, the raw and hard-hitting action set pieces and well laid plot all boils down to making Vikram Vedha the much needed push for the masses to go to theatres.Both Saif and Hrithik have given superlative performances and are brilliant throughout. Saif as Vikram, a rough, strong headed police officer who sleeps well thinking he hasn't killed any innocent man and Hrithik as Vedha a self righteous gangster who thinks he does the right thing always. Instead of playing a Greek god, Hrithik, for once, attempts an Indian anti-hero in a larger-than-life scenario and consistently delivers, both in terms of performance as well as screen presence.Overall, Vikram Vedha is for the masses and a worthy big screen entertainer. A true commercial extravaganza which offers a gritty style of storytelling, powerhouse lead performances in addition to their screen presence, a chest-thumping score and exceptional one liners. Even if you have seen the original, you won't want to miss such a badass bollywood flick .",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Classic should not be remade!",
            "content": "In the original, there is chemistry between Madhavan and Sethupathy. Sethupathy is too brilliant. His shift from badass to mourning brother is brilliant! Madhavan also shows shades of gray so well. The theme song is woven brilliantly into the movie - so eery!But the remake is just a loud, VFX , foul language, where the title song is blasted everywhere. It's just noise.Hrithik is acting like Bachchan and his expressions are from Krish. Instead of looking evil, he looks like a clown. His idiotic grin is so annoying. No comparison to Sethupathy.Saif is just the same guy he plays in so many recent roles - like Sacred Games.Headache after the first hour. Go watch the original! It's on OTT and YouTube.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Bad Copy",
            "content": "Bollywood even can't do copy and paste nicely. Very bad and third class copy of original south movie. The acting of Saif ali khan is terrible I don't know what happened to the directors and writers of Hindi Film Industry. They don't have any creativity they are now just copying a hit south movie and remaking it to fool the audience. Not acceptable. Now I will not see any movie which is either remake of South Movie or any copied movie from any where. Nor I watch any movie which disrespect Hindu religion from any way. If they not changed then sooner bollywood will collapse, and it will be good for the country.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "🔥",
            "content": "First Review- Vikram vedha Paisa Vasool Mass Entertainer! Power Packed Screenplay, Dialogues & Climax. Hrithik gave Career Best Performance ever ! Totally Award Worthy Acting. Saif ali khan Stole the Show. One of the best movies of all time. Get ready for the box office tsunami. That aside, Vikram Vedha is a treat for the most parts, enjoyable not just for it's wonderful 'who to root for' conflict, but for the incredible acting of the leads and the spellbinding soundtrack. There's a thin line that separates a good movie and great movie. On which side does this film fall? That's the conflict I'm wrestling with.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another rubbish",
            "content": "For the uninitiated, this is an official adaptation of the another south film, Unfortunately, the track record of remaking/adapting films in general hasn't quite been a fruitful one every time. However, the one thing I can definitely vouch for - is that this is one of the worst ways of adapting movies that I have seen in recent times. All the doubts and scepticism about and if the film will do justice to the original can be well justified with this movie.More often than not, makers go textbook and pin out scenes not effectively making it suitable for the new target audience you are catering to. With this movie, actors and directors have successfully failed. Not only does the film become extreme headache with the subtle nuances but they are done with such unfitness and thought that it flows with all difficulties. Bad acting has affected the story or making sanitised but important changes to the more complex subjects from the original - it is indeed worst. Fortunately or unfortunately for the film, both halves compete with each other to make it worse. Amazingly, that was not the case with the original. With this movie, the pace and tempo fails drastically in the second half. As scenes get heavier with emotions, the writing takes a backseat and it is then on the actors in the frame to enhance it with their acting chops. That doesn't entirely happen and hence it starts becoming a worst movie.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "They made a remake",
            "content": "I'm huge Hrithik fan but this film sucks.It wasnt like The original was masterpiece the original became successful only because of Vijay sethupathi and the background score otherwise it was very ordinary film. I don't know what they saw in the original that they decided to make a remake.This film gave me headache the soundtrack was so loud i nearly fainted\nSuch a terrible film.Please stop doing remakes please I beg of you.The acting is tolerable but Hrithik is still in super 30 fame with his terrible Bihari accent for crying out loud you are better than this. Saif and apte did decent job but couldn't save the film.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Vikram and Vetal concepts in movie! 👌",
            "content": "A very good story with unsolved mystery for which audience have to wait till the end. And this movie will keep audience hook till the end.Love how Saif Ali Khan & Rittik Roshan has portrayed the part of Vikram and Veda. Totally loved the concept. Dialogues, songs, actions, mystery solved, family love and importance all in one package... Loved how others have done their part well.Screenplay, Cinematography was excellent. I think i had totally invested my time. In one word excellent movie with thoughtful concepts reminds me of the cartoon Vikram and Vetal...THANK YOU PRODUCER AND TEAM FOR this beautiful movie.",
            "review_date": "2022-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "MORE STYLE THAN SUBSTANCE!",
            "content": "All style and hardly any substance makes VIKRAM VEDHA a poor movie. The emphasis in the film was more on Hrithik's style,swagger and his ability to be totally unfazed by any danger of any sort including death. Once again as is the norm in Hindi movies for the longest while,logic takes a complete back seat in this film. The gunmen are literally spraying him with bullets and not a single one touches him. Not much attention is paid to the story. Once again the songs were totally unnecessary. Everything about the film at best was average.5/10\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of time",
            "content": "Pathetic movie and performances..Vikram an encounter specialist raids a place killing all the gangsters who work for a dreaded gangster Vedha but fails to get any information on his hide out. Vedha has spread his fear over the region by killing around 16 people and is currently underground due to fear of being arrested. This Vikram finds about his hideout and before he could leave with his team surprisingly Vedha comes and surrenders himself at police headquarters. During an interrogation Vedha is mum but opens up only when Vikram interrogates him where he reveals him about his past on how from small goon he turned a gangster. But within next few minutes Vedha is given bail by his lawyer Priya whose wife of Vikram. Vikram realizes that Vedha has some plan of getting himself arrested and then bailing himself out within no time leaving him with an unsolved mystery.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absurd story and over the top screenplay",
            "content": "Utter absurd movie trying too hard to be something it is not.They have remade a film made for south indian sensitivities scene to scene but havent tuned it for general audience. Characters r so irrelatable. Forced references to Vikram Betal folktale... and someone has to tell Hritik that less is more. Over the top theatrics, animated expressions and forced body language doesnt make ur acting impressive.A good actor transforms & u cant differentiate the character & actor. Hritik is trying too hard and it is evident with his unnatural accent and constant eye popping expressions.Saif is doing the same thing which he did in sacred games minus a turban.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "imbalance of a Massy and a unentertainer",
            "content": "Saw the first premier show here in US and after a long time saw again tollywood copy which kept me sleep till the end. A imbalance of a Massy and a unentertainerThe story we all know from the Tamil version but here there are few story breaking twists. The basic premises remains same. The director deserves 0Saif ali khan is no acting olny body show ! Radhika apte has small but same acting role,It is little more violent but nonsense. No logic does go for toss! Don t go to watch this film.Totally waste of time. Boycott all Bollywood movie because the have no content, no logic, only they spread ant India and anti Hindu narrative.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome Movie",
            "content": "Movie is too good......I really liked it..... Even when I hear from other people , they also appreciate the Acting of Hritik Roshan and Saif Ali Khan......\nThrillers are amazing and with Suspense excitement increased too much....\"Must watch movie\" ..... Such a good movie by Bollywood after long time !!!Actors done their job very nicely............Radhika Apte acting was also very nice.....................Every one should watch this movie...........,.Role of Hritik Roshan was Amazing And....................... Cop Role of Saif Ali Khan was also amazing..........\nEvery one WATCH IT...",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "GREATNESS",
            "content": "This movies is fire yo. The mofo with the big beard is so cool ima see it again. The cop is okay but the beard dude is menacing .The story is so intertwined got a morality check like in the joker batman movie. What's right what's wrong its all there to explore. The way with which it goes from the past to present to see the life of the gangsta and how every thing he does is well thought out is cool. Police aren't always right the main cop dude understands and how it depends on a person to person is beautifully explained. The supporting cast is tight and the background music is lit. Amazing indian movieThe ending is bonkers Amazing brah🔥🔥🔥🔥🔥",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very beautiful, touching and powerful movie What are we going to do when Hrithik roshan stops making films..? #NoSpoilers A superlative movie this month Vikram vedha",
            "content": "#NoSpoilers\nA superlative movie this month Vikram vedha\n100 times better than I expected!!A great movie that needs to be experienced on a theater screen! If you have been longing for a good action movie... this is it!If you walked in to watch \"vikram vedha \" (as I did), confident that you knew what was in store, not expecting to be surprised you'd be right...and wrong, I watched this movie just because of legendary actor Hrithik roshan his facial expressions and dialogue delivery is amazing he proved he is the greatest actor no doubt his acting skills no one can beat. I've already watched the original version of this film with the same director Pushkar-Gayathri i went to theater for Hrithik roshan, on the other hand saif ali khan also played his character very well his cop looks blew audience mind just like in sacred game,in trailer many of audience judge that saif is not doing good but he did very well , I can't say enough good things about vikram vedha it's everything we need from a summer blockbuster. Get yourself down to your nearest cinema and see for yourself. It's Awesome. Vikram vedha takes you on an emotional nostalgia filled thrill ride that will have you on the edge of your seat. I was genuinely sweating just watching the incredible action sequences which should be on track for cinematography awards aplenty.I will watch this movie 10 times or more! Let me explain why Lots of action, humor, plot twists, good acting and special effects, cameos, a tight story, tension, and surprises. There's violence and language here, but you pretty much get what you expect if you've seen the preview.! Vikram vedha is a masterpiece of a movie, hell I would even say that it's one of my favorite movies of all time. After 20 years Hrithik and saif have seen on screen it's literally goosebumps and the background score is just no words to describe each and every cast of the film did their best and best director Pushkar-Gayathri. They deserve best director award they've spent day night making this gem.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An action packed movie with a twist",
            "content": "There is a negative wave surrounding Bollywood film as they haven't done too well at the box office but having watched this film yesterday I felt this movie has managed to grab attention with an action thriller that plays mind game. The essence of this movie remains the same as compared to the original . Also Hrithik Roshan & Saif Ali khan playing cat & mouse game have their own quirks & characteristics . So the approach towards olaying the role is different .With his Greek god looks . Hrithik is never going to look like someone hailing from middle class . And Saif I personally feel nailed the role as a cop.I felt in the second half the scenes tend to slow down a little bit which may bore you , also unnecessary song which was not needed.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nothing much different regarding the story.",
            "content": "The story is exactly the sane as the original other then the characters are performed really well by saif and hrithik. But if you have seen the original like I have there's no point in watching this cause its only made 5 years after the original and its only been remade for the money. Its a shame bollywood can't come out with ant original stories and only do remakes. This movie is only worth it if you haven't seen the original, and if you're a fan of hrithik roshan cause he's coming on the big screen after the movie war.I would really recommend people to give ps1 a try even if you have to read subtitles its worth it.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bollywood can copy stories, names, songs and posters properly",
            "content": "Waste your money on your own risk, this is not at all like original. Only unemployment have been handled bu giving some work to Bollywood flop actors. As usable making fool of audience, people who are watching are also just fans of particular actor. Cinematography is frame to frame copy, but they forgot to copy acting skills of original. Overall dumb movie. I should have spent on PS-1 movie, chiyaan vikram is far better then these two unemployed Bollywood actors. Still you can go for one time watch to confirm the torture your self😅 stupid acting, stupid direction and hawaai success.😴😴 waste of timely.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another inferior remake, a movie which relies too much on Hrithik",
            "content": "Clashing with PS1 was maybe the biggest mistake the creators of VV could have committed, considering how VV is a remake of a Tamil movie and the audacity of trh creators to release it alongside the biggest historical Tamil project? Coming to the movie, it's your turn of the day massy action masala movie...it lacks the depth which the original one had, it tries to compensate for the lack of depth with over the top action scenes, not sure if the audience really appreciates such a compensation. The supporting cast do their part pretty well, the lead actors look cool flying and jumping around. A pretty average movie through and through.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "just another copy from BWood",
            "content": "No star at all, If you like this movie you are out of your mind. It is such a disaster movie. I can't even watch 30 minutes of the movie.It is super duper pathetic movie with dull screenplay, dialogues, direction. Watching this movie is just a time waste. Songs never make a movie hit. Neither budget makes. What matters is the story, script and acting. It lacks all of these. Wastage to time, you are better of sitting in a dark room then watch bad performances one after another. Saif khan is picking bad projects one after another. Poor copy.... worst copy. No one will watch this film second time. Would be better if it was daubed in English. Hindi dialogues are so poorly written.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent movie",
            "content": "I was watching vikram vedha a few days ago on ott\nOn the same day while scrolling you tube saw the teasor of Vikram Vedha then I stopped watching the dubbed version on that day\njust to watch Hritik Roshan in theater\nbrilliant movie for me just because for Hritik I went to watch\nAnd it did not disapponted me. VIKRAM VEDHA rests on the strong shoulders of Hrithik Roshan and Saif Ali Khan. Hrithik Roshan gets into the skin of the character and delivers one of his most accomplished performances. He carries the swag and the attitude with utmost ease and takes the film to another level.. It is enjoyable and even manages a few whistles and claps in a packed hall.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hrithik Roshan Show.",
            "content": "Obviously we already know the story of the movie. Hats off to R Madhavan and Vijay Sethupati\"s Tamil Blockbuster. Went to see Hindi version just to see Hrithik Roshan.Hrithik Roshan just nailed his part, his screen presence was just out standing. Saif was also cool.I was little disappointed by the songs, would have even better for hindi audience if songs were better.7/10 for coping story as it is. Ending could have been better for a remake. Bollywood had the chance to rewrite the excellent blockbuster story to next level but they choose to be good copy maker then a better movie maker.Overall it's a very good movie if you haven't seen the tamil version.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "VIKRAM VEDHA REBOOTED",
            "content": "I have seen original vikram VEDHA and I was expecting it to be remade in bollywood. But I was not sure it will be possible or not. And if anyhow anybody try to make it, I was suspicious about it's success. But amidst all the fear and confusion here comes the remake of vikram VEDHA 2019 in the form of vikram VEDHA 2022. To summarise in short, I must say that it's no less than the original one. Can you imagine the combination of Rhitik and saif. I mean it's just woww... Go watch it and make your self thrilled and excited. I am sure you will forgot the original vikram VEDHA. Rhitik and Saif ali khan both are outstanding perfectly and suited in the characters.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Horrible Copy",
            "content": "Trying to Copy a Classic performance by Madhavan and Vijay Setupathi was never going to be easy, but Saif and Hritik have proved to be buffons. While Hritik seems to be exposing his looks in every frame, Saif is pathetic in every frame.Few Indians in here who want to take their kids for exposure to India may go to watch this as it is cheaper than taking their children to India visit. So they may go ahead and watch it. But I am not sure how indians will be able to tolerate this cheap copy. Those who have watched Hindi Dub version of Vikram Vedha available free online, will leave cinemas at interval.After Lal Singh Chadda another classic ruined.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No match to Orginal Content and Acting skill Sethu..",
            "content": "After watching Sethu edition and Roshan, now I feel the acting is not about looks and cinema angle, it's all about content and person acting skill with expression.Since Roshan movie is substantially dubbed version in substance, review is limited to reduction in review star.Tone of Roshan is no way near to actual tone and expression of Awadhi language or Bhojpuri, its seems like expression by way of TAUNT.Real life gangster are like sethu, Roshan is wrong choice for this ROLE. Saif may be fitted for his charisma.Content, COPIED Exactly, I watched dubbed version of Sethu, even dialogue words are exactly same.It's like doing REHEARSAL by change in Character.Better to avoid watching by paying 300 to this CRAP , Wait for OTT platform but wasting 3hr, think twice.Avoid this movie for BETTERMENT, to teach TAIMUR father, viewers have not been told to WATCH this movie, why to pay for tickets. YOU MAKE, YOU WATCH this GARBAGE.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb movie..",
            "content": "Good to see such Bollywood movie after a long time. Superb screenplay... Length of the movie is more than 3 hours but will keep you engaged. Superb performance from both Hrithik Roshan and Saif Ali Khan. Masterpiece... Must watch.... Remake version of a movie is better than the original one. It's rare but here it's true.... Kept the story limited to Lucknow but makes sense.... They just tried to be in their limits.... Hrithik, BGM and storyline will not let you leave your seat.... You will feel it even after coming out of the theatre... Hrithik has nailed it.... Most probably best actor of the year 2022 will go to HRX.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Blockbuster Movies Must Watch",
            "content": "Hrithik Roshan And Saif Ali Khan Deliver Standout Performances.A remake is a remake even if it overruns with style and swag. Banish that thought and calibrate your expectations accordingly and Vikram Vedha, Pushkar and Gayatri's reshaping of their own 2017 Tamil smash hit of the same title, is a meaty mass entertainer that packs quite a punch.Working with a screenplay that has yielded dividends before and banking on a pair of Bollywood stars who give a solid account of themselves, the directing duo cash in handsomely on the film's intelligently assembled resources.Minor tweaks in the story, a drastic backdrop change and Hindi dialogue that alternates between the conversational and philosophical enable them to craft a movie that not only does not appear like a once-too-often exercise but also possesses the potential to pull the crowds in.Saif Ali Khan and Hrithik Roshan face off in a battle of attrition that is crammed with intrigue and energy, what with an array of characters orbiting around the cop and the criminal engaged in penetrating mind games. The two male leads, on their parts, deliver performances that stand out amid the orchestrated din.Fleshing out characters that have been drawn from a centuries-old folktale and placed in present-day Lucknow, the actors are aided in rising above the stereotypical nature of the two men - one a policeman, the other an urban brigand; one on the side of good, the other against it - by the out-of-the-ordinary situations and the questions of ethics and emotions that the screenplay hinges on.Senior superintendent of police (SSP) Vikram (Khan) is drafted into a special task force and pressed into an operation aimed at nabbing the sly and slippery Vedha (Roshan), who lords over the Lucknow underworld and keeps the law enforcers on their toes.Vikram Vedha kicks off with a shootout in which a few gangsters are killed, which sparks off a round of violent confrontations between the STF and the vengeful Vedha. The end of violence seems nigh when the dreaded Vedha turns himself in to the police.Vedha's surprise move is only the beginning. He has more up his sleeves than the cops anticipate. One of his trump cards is lawyer Priya (Radhika Apte), who happens to be Vikram's wife. A woman doing her job, her husband doing his and the two at loggerheads with each other - this recipe for marital discord adds a layer to the story that occasionally yanks it away from the hurly-burly of the police station and deposits it within the walls of domesticity.Thrice in the course of the narrative, delivered as a series of flashbacks that spring out of twisted and protracted tales that Vedha narrates to Vikram, the cop is close to eliminating (or at least outwitting) the criminal. Each time, the latter convinces the former to hear a story rooted in his own life. Every story ends in the manner of a fable with a question of moral import centred on good and evil, the nature of crime, policing and culpability, and the dynamics of revenge and justice.Inspired by the folktale Baital Pachisi in which King Vikramaditya sets out to capture a wily demon who repeatedly foxes the righteous ruler with riddles on whose answers their fate rests, Vikram Vedha transports the mythic tale to the capital city of Uttar Pradesh.Lucknow, with its historic structures, has a key role in the film if only as a physical setting that gives the film a distinctive visual texture just as Chennai did in the original Vikram Vedha.At three specific junctures, the police officer is forced by Vedha to confront an ethical dilemma regarding his role as a defender of the law and his firm belief that none of the encounter deaths he has caused was of an innocent man.If you are among those that have seen the Tamil-language original, be warned that this is by and large a scene-by-scene, line-by-line reiteration that is 20 minutes longer than the Madhavan-Vijay Sethupathi starrer. The film's ability to startle and shock is therefore severely curtailed. But if you are unaware of the plot, Vikram Vedha has enough twists and turns to hold your attention all the way through.Pushkar and Gayatri, perhaps the only husband-wife duo of directors in Asia, do well not to tinker with a successful construct. They fall back on not only the same Sam C. S. background score to shore up the action on the screen, but also on the director of photography (P. S. Vinod) and the editor (Richard Kevin).While the cinematographer has to make significant adjustments to factor in a new location and a significantly altered production design, the editor is not required to do much that he has not done once before. But familiarity does not take anything away from Vikram Vedha.Thanks to a new setting - Lucknow serves as a strikingly evocative backdrop to the fast-paced crime drama - and a fresh set of actors, Vikram Vedha has a colour palette of its own. Despite its length, it never feels stodgy or sluggish. The credit for that accrues as much to the technicians as to the writers (the directors themselves).If comparisons are to be made no matter how odious they may be, Saif Ali Khan makes a far better Vikram. He inhabits the character of the tough cop with conviction and exudes the external toughness that defines the man and his mission.Hrithik Roshan, who refrains from modelling his performance on that of Vijay Sethupathi, harnesses his star appeal and screen presence to deliver the goods and then some. It is well-nigh impossible to go one better on the inimitable Vijay Sethupathi. Roshan does not even try and that stands him in good stead.With two major Bollywood stars powering the film, the actors in the supporting roles suffer just a touch. Be that as it may, Radhika Apte, stepping into Shraddha Srinath's shoes as Vikram's lawyer-wife, Satyadeep Mishra playing Vikram's police academy mate SSP Abbas Ali (replacing the Tamil film's Simon), and Sharib Hashmi in the role of Vedha's foe-turned-friend-turned-foe Babloo add their mite to the film.The characters played by Rohit Saraf and Yogita Bihani - Vedha's younger brother and the girl in his life - somehow do not seem to make the impact that Kathir and Varalaxmi Sarathkumar did in the same roles in the 2017 movie. But these are but small blips in a power-packed, compelling action thriller that knows exactly what it is getting at and achieves its ends with aplomb.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very beautiful, touching and powerful movie What are we going to do when Hrithik roshan stops making films..? #NoSpoilers A superlative movie this month Vikram.",
            "content": "#NoSpoilers\nA superlative movie this month Vikram vedha\n100 times better than I expected!!A great movie that needs to be experienced on a theater screen! If you have been longing for a good action movie... this is it!If you walked in to watch \"vikram vedha \" (as I did), confident that you knew what was in store, not expecting to be surprised you'd be right...and wrong, I watched this movie just because of legendary actor Hrithik roshan his facial expressions and dialogue delivery is amazing he proved he is the greatest actor no doubt his acting skills no one can beat. I've already watched the original version of this film with the same director Pushkar-Gayathri i went to theater for Hrithik roshan, on the other hand saif ali khan also played his character very well his cop looks blew audience mind just like in sacred game,in trailer many of audience judge that saif is not doing good but he did very well , I can't say enough good things about vikram vedha it's everything we need from a summer blockbuster. Get yourself down to your nearest cinema and see for yourself. It's Awesome. Vikram vedha takes you on an emotional nostalgia filled thrill ride that will have you on the edge of your seat. I was genuinely sweating just watching the incredible action sequences which should be on track for cinematography awards aplenty.I will watch this movie 10 times or more! Let me explain why Lots of action, humor, plot twists, good acting and special effects, cameos, a tight story, tension, and surprises. There's violence and language here, but you pretty much get what you expect if you've seen the preview.! Vikram vedha is a masterpiece of a movie, hell I would even say that it's one of my favorite movies of all time. After 20 years Hrithik and saif have seen on screen it's literally goosebumps and the background score is just no words to describe each and every cast of the film did their best and best director Pushkar-Gayathri. They deserve best director award they've spent day night making this gem.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watch it if you haven't watched the original & for Hrithik! A worthy remake...",
            "content": "In a time before pan-India movies became all the craze, a Tamil movie titled Vikram Vedha blew everyone's mind. Released in 2017, this film boasted of stellar performances by R Madhavan & Vijay Sethupathi as modern day versions of the Vikramadityan and Vetal. 5 years later, the directors of the movie, Pushkar Gayatri are at the helm of the Hindi remake starring Saif Ali Khan & Hrithik Roshan.Set in Lucknow, Vikram is a law-abiding, honest cop, who believes that he is doing the right thing by killing gangsters. But when the dreaded Vedha willingly surrenders, Vikram is left baffled by the stories that he has to narrate.When filmmakers remake their own movies, you are bound to wonder what can they do to make the remake different or standout. But for most part (99.5%), the remake is exactly the same. The shift from Chennai to Lucknow only changes the nature of the crimes & the language.The remake gets the casting right. Hrithik Roshan is an actor worthy enough to step into Vijay Sethupathi's shoes as he brings his own charisma to the role. He is at his menacing best that will have you root for him from the moment he enters the frame. But on the flipside, Saif Ali Khan's Vikram is a stepdown from R Madhavan's rendition. Said & his onscreen wife, Radhika Apte's chemistry seems forced. The ideal combination would have seen Madhavan square off against Hrithik. Rohit Saraf, Yogita Bihani, Sharib Hashmi co-star.For all those who have watched the original (in Tamil and not the dubbed version), this remake doesn't have much to offer unless you are a Hrithik fan (then do go for it). And if you haven't watched the original, then definitely go for it. Pushkar-Gayatri's story must be seen irrespective of the language.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Interesting! But couldn't stand out in front of The OG",
            "content": "When I watched the Original Movie, that experience was tremendous! The Performance given by Vijay Sethupati can't be copied by any other actor. Simply, The Duo of Vijay and Maddy was just mind-blowing.Actually I have always been a big fan of Vijay Sir. I just love the natural performance of this man!! Even Hrithik did a great job as he's also good in experimenting with roles, But I am not satisfied by the performance of Saif, he could have been replaced by some other actor like Randeep Hooda or Vicky Kaushal.Although this Movie is quite different from the original one in some aspects but as we all know that *What comes first is always preferred!\" 🌚💗\nBest Wishes to the Movie ✨",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hollywood Worthy Storyline",
            "content": "Let me premise my review by let you know that I don't quite understand Bollywood but viewing this movie from a Hollywood perspective, it has one heck of a storyline. Love the subtle hints throughout the movie that leads to a pretty solid ending. The movie has some excellent moments of acting, timing, storytelling, flashbacks and some pretty good chase scenes. To be honest, I can do without the song and dance as well as the bit over-the-top soundtrack but that didn't take up too much time. The acting sometimes gets a little stilted but you can get through it easy enough. Some of the shooting scenes could have been a bit tighter and realistic in the sense of less swagger or more realism. Shooting a handgun is a serious endeavor and I personally prefer to see it portrayed as such on the screen. If you cut out the filler song-and-dance, some silly love scenes plus tightening it in a few spots and this would be one pretty solid 2:00 hour movie. Regardless, this is one of the better Indian movies I've seen and it is worth seeing. The storyline itself is very good and I can see Hollywood doing a remake on this one. Go out and enjoy.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lose my cash",
            "content": "If all they did was rubber stamp the boxoffice numbers, there would be no point. If their tastes don't align with yours then ignore them. Personally, I value the consensus of legitimate critics\nGuess what? Critics are hired because their tastes are more refined than the average moviegoer. If all they did was rubber stamp the boxoffice numbers, there would be no point. If their tastes don't align with yours then ignore them. Personally, I value the consensus of legitimate critics very much.Than actually reviewing a movie. No one really cares what moral philosophy or queer studies course influenced them at university and therefore what particular part of a film irks them or is \"",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great remake !!! Hritik and Saif r awesome!!",
            "content": "Film review Vikram Vedha\n#sanjuzzreviews #VikramVedha #hritikroshan #Saifalikhan\nBased on the Vikram Betaal stories, this film is a faceoff between good , portrayed by a bad ass cop Vikram ( Saif ) and evil, by Vedha, an equally bad ass gangster (Hritik) However, is the good that is portrayed to us actually good or is it the other way around is what the story is all about!! The film explores the grey areas where the lines between good and evil overlap.Hritik's screen presence, swag , dance and emotions portrayed are topnotch. Even then Saif has a strong role as a tough cop and has played it very well. Radhika Apte as Saif's wife , Satyadeep Mishra as Saif's cop friend and Sharib Hashmi as Hritik's sidekick too have played their parts very well.BGM is just wow and has a powerful impact on the narrative. Songs are catchy too. The film picks up pace from the first scene itself and is gripping throughout its 2 hrs 27 mins runtime.Twists & turns in the plot are many and suspense is revealed in a very logical manner as Vedha relates 3 stories to Vikram which leads to an explosive climax. Superb ending too !! The makers have also kept the back stories of certain characters to a minimum to avoid digressing from the main plot.I did not watch the original R Madhavan and Vijay Sethupathy film, but all I can say is that this one is entertaining as hell.Worth watching in theatres!! Full action, full dhamaal Go for it!!4/5 from me .. adios 🙂!!",
            "review_date": "2022-10-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Vikram vedha",
            "content": "Vikram vedha is an action crime drama thriller directed by pushkar and gayatri which is an official hindi remake of the tamil film titled 'vikram vedha.'\nHrithik roshan is the backbone of this film. The way he has brought the madness in this character is just awesome. You can observe his eyes during the action scenes and seriously his expressions are insane. Saif ali khan too delivers a very complete performance. He was emotionless at first but as the screenplay progresses you can see he is an emotional character and saif portrays the same. The supporting cast including rohit saraf, satyadip mishra, radhika apte and co do a commendable job. The character writing is interesting. The characters of vikram and vedha are very well written. Their character arcs are beautifully fleshed out. Vedha's interaction with shatak's character really pull at your heart strings. It happens primarily due to the conviction with which both have played their characters. You will see hrithik gets teary eyed whenever he interacts with shatak. Again, vikram and vedha's tussle was really worth the big screen. Abbas' character needed some more time to flesh out. So the writing is fairly good. The dialogues are pretty good. Pretty apt for a big mass movie. Not too much complicated but also has its density. The screenplay is very good but i guess in the third story the screenplay revolves too much and confuses its customers.The music is good. 'O sahiba' is a very good song and when the table enters it sounds impeccable. It also establishes the relationship between vikram and priya. 'Alcoholia' is pretty interesting. It starts with a generic rhythm but then vishal-shekhar' bring in their magic with the rhythm section going bonkers. Very good! And what to say about 'bande.' The song in sync with the bgm acts as perfect suit for the gritty sequences. The bgm is very good but i feel it has been excessively used. Whenever vikram or vedha enters the frame, the bgm goes on over-kill mode. I wish they used it more smartly.The cinematography is terrific. The colour grading giving vibes of a gritty drama suits very well. Also the lighting during many frames is absolutely breathtaking. One such sequence is when vikram first interrogates vedha. The one take sequence at the beginning sequence was also very well shot.This is a pretty good film. I rate it 8 out of 10.",
            "review_date": "2022-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's a xerox copy",
            "content": "In this world of OTT, where we can see any movie any time, stop remaking great movies, let the original have the credit. Vijay Sethupathy., RMadhavan were great, nothing new in this.Bollywood should Seriously get some good writer and directors, the should stop these kind of copy paste movies.Hrithik does one two movie in 5 years that too remake, rediculus, they should try something new, which Tamil Telugu movies always does. Good that now they are releasing all movies in PAN india. Bollywood really doesn't want take any risk.Don't spoil the original for the sake of remake and getting money. They could have just released the original one in dubbed version.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Way better than Tamil version",
            "content": "Saif is cool initially, slowly the movie will pull you.. And starts pulling you in the story till interval, At interval the story is at pick and rollercoaster ride begins after interval.. Suspense unfolds one by one, action and acting of Hrithik. The chemistry between Saif and Hrithik.. Must watch and Hrithik steals the show in each frame.. He creates hype and it goes on till the end.Dance number looks super, dialogues are up to the mark.Action scenes of Hrithik are way better than Sethupati.story connects with perfection.Whistle worthy action scenes and Hrithik's fantabulous performance make it a must watch on big screen.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Same nonsense of Bollywood",
            "content": "Bollywood need to smell the coffee, same old nonsense and copying south cinema frame to frame. The original movie is 100% better than cheap copy of Bollywood movie. Too much violence which was not there in original Tamil movie..The production value of the movie is very bad. Same is the case with screenplay. Climax is worst. Kind request to fellow North Indian to do not waste time and money rather watch the original Tamil movie with subtitles. One last thing, I do not want give even one rating to this movie but I have no choice to share my experience except when you rate the movie. Bollywood needs to change their attitude and come out of this Stockholm syndrome and make some good movies..",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masala Blockbuster",
            "content": "This movie is made for the masses and i mean MASSES, the movie revolves around Saif and Hritihik's cat-mouse chase, but what's intriguing is how every encounter they have is always different to one another, I watched the original, and i mean no disrespect but this one was just flawless. If Vijay Sethupati can don vedha as a calm and silent villian, Hrithik raises the volume with intensity and lunacy, even though the plot was same, there's this aura Saif and Hrithik have on screen that really conceives the bigger picture. This movie's supporting cast has also done an absolute unprejudiced justice, it feels like from Hrithik Saif to Rohit Saraf everyone was made for their respective roles.I'd definitely recommend this watching it at least once.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "can someone please bring down that bgm for some time?",
            "content": "Went to this movie with lot of expetations but no, it was a dud with a loud BGM from the beginning. Saifs entry and encounter scene was very very bad, the ease with which saif was walking around killing, it all looked comic. Plus that bgm was real mood killer.You cant simply connect with the story when there is style over substance, at least in 1st half, story is complete dud.Also the acting of both saif and hrithik was not any great. Radhika looked good but her role was very very small.Overall very less time given for audience to create some empathy for the characters on screen as most of the time heavy entry and action scenes are shown.Only saving grace was the twist in the 2nd half only if you are still watching the movie(as some people left the hall in 2nd half beginning only.)\nOverall avoid this movie to stay free from headache.",
            "review_date": "2022-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Top Notch work from Mr. Hrithik Roshan",
            "content": "My Rating : 8/10Famous for always playing the good guy with the dance skills, here in Vikram Vedha Mr. Roshan breaks stereotype to deliver a badass villain with killer action prowess as well as equally murderous dance moves.The dialogue-baazi, humour and storyline are all engaging and everyone of the actors do a splendid job. While 'Alcoholia' the item song thrown in is a bit of a stretch though tolerable in spite of the cheese factor.Great for multiple viewings, it's fresh and stands on it's own. I have watched the Tamil version and think it's a solid remake and rather a more interesting one if you are the Hindi-speaking audience. Go watch it on the big screen if possible, the background score alone makes it worth it!!",
            "review_date": "2022-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "ONE OF THE BEST MOVIES I HAVE WATCHED !!!!!!!!",
            "content": "The story line is very attractive and interesting. I have never seen this kind of movie before and it was pretty epic and everything was unexpected. This movie has everything in it from love to action. At first its very confusing but if you are quick learner you can predict whats gonna happen next. The best was hrithik roshan's makeup and character, best and perfect man selected for the role. The end when they both unite is the best part of full movie the theater was full of whistles and shouts and ahh saif ali khans encounter and crime scene analysis was pretty big brain moment in the movie. I loved this movie so much and i was so excited to write this review you better watch movie to feel the same.",
            "review_date": "2022-11-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "MAZAA BHI AYEGA AUR TAJJUB BHI HOGA..",
            "content": "Story telling 👍👍👍👍👍Acting 🔥🔥🔥🔥🔥Content 💯💯💯💯💯direction👌👌👌👌👌Alcoholia 💥💥💥💥💥Only and only Hrithik Vedha, charming, strong, ageless and confident as ever, couldn't take my eyes off that man.Saif, a unique performer and he evolves with every role with an unbeatable impact on his audience.I had seen the original movie but fun of watching this remake was something else!! What a way to tell the story.A remake of a south blockbuster, 'Vikram Vedha', directed by Pushkar - Gayathri is a complete entertainer! It boasts an engaging story, outstanding action, great bgm & a superb performance by all.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is how a remake should be",
            "content": "The chemistry/rivalry/companionship/fighting or anything you kill it. It was great between Hrithik Roshan and Saif Ali Khan. The story explores the legendary Vikram Betaal in present times and yes it gives you thrill of the present time. Although films lack any memorable song but I think this kind of story telling is better be without song.The female lead Radhika Apte and other supporting actors are also good in their roles.If you have seen the original than also it's watchable due to its adaptation in northern India and characterization accordingly. Deducted marks only because its a remake.",
            "review_date": "2022-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A good Hindi remake of a cult Tamil film!",
            "content": "With the release of Vikram Vedha-after a long time, a big Hindi action film has hit the screens. Though an official remake of the great Tamil film (which I guess most of us have already enjoyed on OTT as well) of the same title, yet there was anticipation for its release. Like the Tamil version, the Hindi remake has also been directed by the husband-wife pair of Pushkar-Gayathri. The characters of Madhavan and Vijay are replayed by Saif Ali Khan and Hrithik Roshan. The film takes its inspiration from the stories that the ghost Vetaal(Betaal Pachisi based) tells King Vikram(Vikramaditya) when Vikram tries to catch and carry Vetaal to his place. The Tamil flick was set in Chenna and the Hindi one is nicely set up in Lucknow. While the plot and almost scene by scene remain the same the novelty is the setting in the heartland of U. P. and the star cast of Saif and Hrithik. It's a tough job to remake a cult crime noir thriller, especially when the cast is perfect, yet I feel the makers along with the cast have done justice to the remake. Saif Ali Khan plays Vikram quite well, though in the initial parts he looks trying hard in the second half gets into the skin and carries the character well on his broad shoulders. Hrithik plays the stylised baddie Vedha(Vetaal) with panache and is a treat to watch. He makes the character very different from the stylised anti-hero he played in Dhoom 2. I agree that those who have watched Madhavan and Vijay in the Tamil flick will take time to see the Bollywood actors playing their parts, but trust me they have done a good job. The setting of Lucknow aided by dialogues is done rather perfectly. Instead of forcing things, the conversation, the locales and even the references are straight out of Lucknow of 2022! A lot of references are thrown for Lucknow food and so the Mutton Chops of Chenna become The Nihari Kulcha of Lucknow in the Hindi version. The film maintains its grip and the film is good technically too. The supporting star cast including Sharib Hashmi and others have done a fine form. So all in all I will say while the original is original yet, the Hindi remake is well made!!",
            "review_date": "2022-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Khan Review",
            "content": "The film released with out much publicity even with saif & hrithik in lead. This is surprisingly good full entertaining without a single dull moment. People are comparing it with original South well saif is much better looking than madhavan and madhavan can be said as an actor is much better than saif. Same goes for vijay he is good actor so is hrithik. Both saif and hrithik did good job but saif is looking too handsome in this movie. Radhika apte even with small role does a good job. The movie is three hours long but not a dull moment. If you are looking for full entertainment this is it.The film released with out much publicity even with saif & hrithik in lead. This is surprisingly good full entertaining without a single dull moment. People are comparing it with original South well saif is much better looking than madhavan and madhavan can be said as an actor is much better than saif. Same goes for vijay he is good actor so is hrithik. Both saif and hrithik did good job but saif is looking too handsome in this movie. Radhika apte even with small role does a good job. The movie is three hours long but not a dull moment. If you are looking for full entertainment this is it.",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better than the original!",
            "content": "VikramVedha : A well made remake with the essence of original retained as such. Both our men are excellent. Radhika is good. Should work both with classes and masses. A must watch for those haven't watched the original. Man your screen presence though\n@Hrithik_roshan. Also special mention to saif ali khan his acting was also top notch with great screen presence and dialogue. The background music gave me goosbumps. Sam cg delivers his best music ti ll date,what a talented artist he is. The amazing director duo pushkar and gayatri gets it right yet again with their directions. Get ready for the havvoc at the box office.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of time",
            "content": "Waste of time when will bollywood stop the trend of remakes when are they gonna stop this when will they make a content on their own what is the need of wasting money on this remake version when the hindi dub version of the original is already availabale\nHrithik can never match the acting skills of Vijay Sethupathi The one and only good thing about the movie is directors are the same and the background score is not changed bollwood (remakewood) should stop remakes and make their own content but stll cant beileve why pushlar and gayathri decided to give the rights of such a nice film to these bollywood producers.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not sure why it was remaked",
            "content": "We all know how good the original is ? What was the need for this remake ? Can't Bollywood come up with original concepts . See south industry doing hard work and research and coming up with movies like PS 1, Bahubali, RRR and many more and Bollywood is still stuck in remakes. Hrithik acting may be good but what new he has given to the audience. Nothing . Playing a character after seeing many times how an actor has already played will help certainly. To me there was no need for this remake as this is also available on OTT in Hindi and hopefully Bollywood will do something original.PS : its my view.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A brilliant movie with brilliant performances.",
            "content": "I haven't seen the original film so I didn't know what to expect from this movie. I ended up with a fabulous cinema experience.The movie revolves around Vikram (Saif Ali Khan) . He is a police officer hunting down Vedha (Hrithik Roshan), a gangster. What happens is an unexpected ride with these 2 characters.The performances are brilliant. The lead actors are just playing their parts in their way, not trying to be better than each other. This makes their chemistry perfect.I would highly recommend you to watch this film. It is an amazing Bollywood film and you would not be disappointed when you watch this film.",
            "review_date": "2022-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Diaster copy paste pathetic overacting",
            "content": "One more bollywoodiya disaster .. Bollywood again spoiled the one more good movies ..no one can beat the expression of setupati and madhavan ..pathetic overacting while speaking the Bhojpuri dialogs ..copy paste action . Sometimes feel like comedy while doing the action..no music ...very bad direction especially for the fighting scene...better watch the original Vikram vedha ,this movie will be flop bcoz of as is copy paste of stroy ..no music .. slow and dumb acting by saif Ali Khan and overacting by Roshan will make u feel like 3 hrs torture.Bollywood should stop making such copy paste movie.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Boring movie",
            "content": "The movie is not good enough. Don't just go to thethree and waste cash.Secondly, Business. Entertaining movies have a majority of the audience. These cult movies only cater to a niche. That's why critics need to judge these movies on their merit and not on entertainment value.Thirdly, each movie is subjective. Every movie is liked by one, disliked by the other. You should be wise enough to choose the ones to watch.If all they did was rubber stamp the boxoffice numbers, there would be no point. If their tastes don't align with yours then ignore them. Personally, I value the consensus of legitimate critics very much.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Scean to Scean copy from Original one",
            "content": "This movie is scean to Scean copy of vikaram vedha with useless action scean which doesn't\ndo justice with film like which Positivity is story but , Director added spices in movie and missed salt tlso the movie is felt boaring and predictable of you have watched original one nothing new to enjaoy potential wasted , Every one should understand we are living in era where 5g has arrived and Mobile data is not as costlier as it was on 2000-2014,15 Every one has internet and those who loves to watch good movies will not wait any director or actor to make reame in Bollywood with his favourite actors with no sense dances and songs .Let's talk about movie Saif no where match to R Madhavan in this film and Hrithik Roshan playing Up based gangster hasn't get Rid of his Bihari accent of Super 30 this looks funny .In Las tjust want to end with a note pls Bollywood do some creativity and bring some original content I think watching Dhokha and Chup is better utilisation of time rather than watching This copied masala creep.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A classy mass entertainer!",
            "content": "Vikram Vedha is a classy mass entertainer!The film keeps the spirit of the age old legend of Vikram Betaal alive. It has a strong story backed with enough twists and turns to keep you invested.Hrithik Roshan is a total dhamaal and steals the show. It's a delight to watch him in this massy avatar. He has an unmatchable screen presence. You simply cannot take your eyes off him. He alone is the strongest reason to watch the film.Saif Ali Khan is very good and matches Hrithik at every step. They both kill with this one!Having not seen the original helped as I was intrigued throughout. Go for it!!",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "CopyWood",
            "content": "Looking for some originality, authentic concepts , why we should waste money to watch that the re-make from down South .In fact, i liked the original one with Setupati & Madhavan. When will these people learn ? If they continue like this, soon their market will shrink and if no high investment, more mediocre product. Where are the creative people , are they not being recognized ? I feel like they are cheating the people. Are they making movie to please their families & friends like father Roshan? With people promulgating\nboycott & hatred on star kids, seems like the ship might be shrinking soon.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pure masala entertainer",
            "content": "When it comes to pure masala with right content kgf2 and pushpa is the best examples but in bollywood i haven't find any movie but this time i bound to say that vikram vedha is the perfect example though it was the remake of tamil vikram vedha so what i have no problem if it is directed by same directors i understand the vision of pushkar sir and gayatri mam seems it will gona true very soon.visual spectacle, seeti maar entrance,twist turns and acting skill make them one of the better remakes which they offered. Hrithik stole the show and saif lends good support. Pushkar sir and gayatri mam directions are top notch. Dont miss this.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie after a long time in Bollywood",
            "content": "A good movie after a long time from Bollywood. Hrithik is superb, saif is equally good. One star less for some loose ends in story and one less for nonsense first 20 mins. But still Bollywood need to show a original movie rather than a series of remakes. Vikram vedha is an answer to Brahmastra that a good movie can be made based on acting rather than VFX and needless romance. Hrithik is brilliant in this movie, a street goon which is different from his image of Greek god. Though I have watched original Vikram vedha but I feel the Vedha character in Hindi remake could have been shown more ferocious and more devilish.",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant",
            "content": "What a movie with with pin point performances. Hrithik Roshan was just outstanding.If u do a remake then this movie proves on how to do it.Apart from the action and performance, the background score was praise worthy.Huge respect to the original movie but this one is cut above..............................................................................................................................................................................................................................................................................................................................",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hrithik Roshan delivered an award winning performance",
            "content": "Saif gave a different and wonderful performance, but......\nIt seems like a celebration for the talent of one man who carried the whole movie on his shoulders! With his brilliant talent, presence, facial expressions and versatility, Hrithik Roshan gave his best performance OF the decade argubly.Pushkar and Gayatri deserve to be commended for this strong direction of the film. Cinematography and background music will give you goosebumps\nThe film is full of seeti maar dialogues,\nNotable performances by.radhika apte , Rohit Saraf\nBy the way don't miss. Sherib Hashemi's performabnce.Strongly recommened.",
            "review_date": "2022-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Full Paisa Vasooooooool",
            "content": "HRITHIK ROSHAN's show it is.What an actor, i don't have words to explain how great my man has performed. He is the best. Really proud to be your fan iHrithik#VikramVedha is a must watch movie. Celebrate this epic on the big screen. Full Paisa wasool movie.4.5/5\nSo many things to say. His entry,his performance,dialogue delivery, screen presence ufff. Every time iHrithik appears on screen,he owns it like a boss. And the story my goodness. PushkarGayatri take a bow. I love you guys for presenting our own Betaal Vedha.This movie is Hit.Saif is really good so is Radhika and each and every actors. The twists are mind-blowing. I just love #VikramVedha and have to watch it again on big screen. The bgm is still playing in my head. What a movie. #VikramVedha Garda uda Diya🔥🔥🔥",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Super action movie suspence thriller",
            "content": "BEST MOVIE. Wow what a movie ! Brilliant acting by Hrithik and Saif. Story is the heart of this movie. A MUST WATCH from both story and acting standpoint. Loved it.Brilliant performances , masterful cinematography,massy dialogues and a magnificent story make this work of art , a must watch. Hrithik roshan oozes out brilliance in every scene he is in. The beautiful surprise here is saif Ali khan who has not only wonderfully portrayed a policeman whose ideologies.Brilliant performances , masterful cinematography,massy dialogues and a magnificent story make this work of art , a must watch. Hrithik roshan oozes out brilliance in every scene he is in. The beautiful surprise here is saif Ali khan who has not only wonderfully portrayed a policeman whose ideologies.",
            "review_date": "2022-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Proper mass action masala film also for class audience",
            "content": "Superhit movie ,a perfect combination of mass and class ,Hrithik is absolutely amazing , his entries are worth watching ,a superhit performance by both Hrithik and saif ,it is a perfect remake with fair amount of twist and turns it is slightly different from original movie also the climax have been changed ,I also had watched original Vikram vedha but still I enjoyed this one completely and throughout each and every sequence is amazing I suggest everyone to watch it ,one of the best movies of 2022 in all over India.so you can go to watch this one and you will not get even a little bit disappointed.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watch an original movie PS 1 rather than a copied movie Vijram Vedha",
            "content": "Everything copied. The action, dialogues and all. Its annoyingoriginal vikram Vedha was better than this copied Vikram Vedhai would prefer watching an original soutth indian movie PS 1 rather than watching a movie which is copy of a south indian movie.Bollywood is a sinking ship.Pls go for PS 1, its fantastic movie._____dialogues and all. Its annoyingoriginal vikram Vedha was better than this copied Vikram Vedhai would prefer watching an original soutth indian movie PS 1 rather than watching a movie which is copy of a south indian movie.Bollywood is a sinking ship.Pls go for PS 1, its fantastic movie.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Winner all the way!",
            "content": "Guys I know it's remake but Hrithik as vedha has given new dimension to the character it's always engaging to watch him.. Complete entertainer , the best thing about the movie is bgm and story telling plus all the supporting characters played their roles properly and without vikram which is playing saif it made more memorable he was good and always commanding in every way as police officer and sharing the Parallel screen with Hrithik must have given him sense of acknowledgement as what it's about Hrithik what's makes him so difference. Original was epic but this is just upper hand to original.. Hrithik's swag all the way.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "NOTHING NEW, ORIGINAL IS BETTER.",
            "content": "Watch original on MX PLAYER\nin remake, Hrithik did a good job and saif was mehh...everything else was same. I regret going to cinema hall to watch it.It is the remake of a south movie with great acting with same name. It's available for free on MX PLAYER.There are alot of free movies and TV shows available on MX player, Jio cinema, telegram, YouTube etc. Why would audience go for an mediocre movie. Copywood never fails to disappoint. From songs to story, they copy paste everything. You know why? Because likes of you and me do watch their shtty work and pay for it. Well, not anymore.NEW INDIA WANTS TO BE RESPECTED AS AN AUDIENCE.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Huge set back for Bollywood again",
            "content": "One of big setback for saif ali khan and bollywood industry. I think its high time to consider the right stories and narration.Major minus for the film is saif ali khan.Hritik done his justice for the film. Screenplay is very good but saif ali khan rotting acting is setback for film. Totally waste of time & money, nothing creates excitement or special.CTRL+C CTRL+V.Tamil version is much better.. Bollywood lacks when it comes to content .One of big setback for saif ali khan and bollywood industry. I think its high time to consider the right stories and narration.Major minus for the film is saif ali khan.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another meh remake",
            "content": "Clashing with ps1 was maybe the biggest mistake the creators of vv could have committed, considering how vv is a remake of a tamil movie and the audacity of trh creators to release it alongside the biggest historical tamil project? Coming to the movie, it's your turn of the day massy action masala movie...it lacks the depth which the original one had, it tries to compensate for the lack of depth with over the top action scenes, not sure if the audience really appreciates such a compensation. The supporting cast do their part pretty well, the lead actors look cool flying and jumping around. A pretty average movie through and through.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "just a typical Bollywood action flick",
            "content": "This film has nothing new to show. All the mystery material, plot twists and surprise stuff gets boring after a while. If you are rating this movie above 7/10 then you're either 13 years old or you don't know what's a good film. The background score is poor, the acting feels a bit overdone, there are cringy 1 man Vs 10 goons action sequences and the list never ends!The first half is a bit boring and slow but the second picks up the pace and the story gets interesting. There's just a couple songs played throughout the film so that makes it less cringy and easier to make it through.There's no scene that contains sex or nudity.Violence and gore is on a moderate level.Frequent uses of the word \"saala\" so mild profanity.Lead character, Vikram, does a lot of smoking throughout the film and frequent scenes of drinking, so severe uses of smoking and alcohol.There are few frightening and intense scenes on a moderate level.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic and worth it Movie",
            "content": "Really amazing movie and story line is also Great .Music is really awesome and the swag and Vedha ka Ruab ...everything is fabulous.Saif and Hrithik both are amazing as usual and its totally worth it to watch First day First show.People's reaction are mind blowing on Hrithik's Entry....his Swag...his Dance Moves....and everything ...he just nailed it!!!!Hrithik Roshan brings in a different kind of swag and style than Vijay Sethupathi's Vedha.This Movie works as both a thriller and a masala action flick. It is enjoyable and even manages a few whistles and claps in a packed hall.Overall ....Great...Amazing...Fabulous.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One Of The Best Bollywood Remake - Hrithik Roshan, Saif Ali Khan Show",
            "content": "Vikram Vedha is an action pack entertainer and the best part about the movie is that despite being an official remake the makers haven't copied a single scene from the original. The screenplay is fresh. Saif and Hrithik's character face off steals the show. There is no dull moment in the film. The songs are relevant too, dialogues are catchy and cinematography is up to the mark. A mass entertainer audiences waited for so long and yeah they have it. You are a fool if you are here to compare it with the original coz this one is way different from the R Madhavan and Vijay Sethupathi film. Overall Vikram Vedha is a film you wouldn't regret watching on the big screens. Paisa Vasool.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another remake...give us a break",
            "content": "Clashing with PS1 was maybe the biggest mistake the creators of VV could have committed, considering how VV is a remake of a Tamil movie and the audacity of trh creators to release it alongside the biggest historical Tamil project? Coming to the movie, it's your turn of the day massy action masala movie...it lacks the depth which the original one had, it tries to compensate for the lack of depth with over the top action scenes, not sure if the audience really appreciates such a compensation. The supporting cast do their part pretty well, the lead actors look cool flying and jumping around. A pretty average movie through and through.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Doesn't Holds a Candle To The Original. Masala Disappointment",
            "content": "Pick a hit movie, try remodel it with local sensibilities but fail.. cuz copywood, add what you can in oodles - Loud music and Vfx, in-house cheerleaders will post rave reviews... & Then leave it on the fanbois to take your movie through the critical week.For good measures, throw in the tag line 'Don't Compare With The Original'The immaturity mentioned leaves no doubts why the actors couldn't bring in the required nuances. The original too was a masala entertainer brought alive due to the chemistry between Madhavan & Setupaty. But when you bring in average to less than average actors in a REMAKE, with other parameters falling apart... You will, and have, fallen flat.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply movie was super",
            "content": "Simply I say movie was super. Hrithik god acting, action, thrill, crazy Ness all things are just beautiful.Thanks to Gayatri-Puskar to give us a super movie. And again thanks them for pick Hrithik Roshan as Vedha. On big screen Hrithik Roshan amd Saif acting looks like they are don't play a role it is reality.Cinema is the most beautiful fraud in the world. ...\nIf you want a happy ending, that depends, of course, on where you stop your story. ...\nA film is a petrified fountain of thought. ...\nWhen people ask me if I went to film school I tell them, 'no, I went to films. Lastly I want to say you go just watch it.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Extremely Recommended,everyone should see this at least for a tremendous experience..!!",
            "content": "Totally perfect for all ages poeple; anyone can see this one with familly or friends. Saw the first premier show here in Kolkata and after Brahmastra i saw an out an out Bollywood entertainer which kept me glued till the end. Perfect balance of classy and Massy treatment.Both first & second part was extremely existing!!Story line didn't get boring. On the other hand you feell joy with this classy story! The story we all know from the Tamil version but here there are few surprises and twists. The basic premises remains same. The director deserves standing ovation for keeping the narrative tight and engaging. Here there are much action more tham tamil version,which feel anyone much exited.Hritik is totally unstoppable, composed as cool gangster! Saif ali khan is superb as cool, composed yet mysterious cop! Radhika apte has small but effective role!!But it's the one man Hrithik roshan who will outshine everyone with his finest act! The actor always challenges himself to outdo his last one. Here he is ruthless yet sensitive. With in 5 mins you are in his world. Outstanding act. As a hrithik fan i enjoyed it too much,speciall his action & intelligence performance..!Totally recommended with family or friends. You will enjoy with both!!",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A senseless masala flick which should have never been made",
            "content": "It was painful to sit through this movie, can't belive the creators made this and even had the audacity to release it alongside Ponniyin Selvan. The story lacks depth, the side characters are boring and don't contribute anything to the story, this feels like a one man show in which the man who is supposed to deliver fails to deliver and hence the whole movie sinks down the ocean. Don't waste your time on this movie,watch the original...it's far better and more engaging. The most annoying part about this movie was the way the fights were edited, a single punch has been shot in a bazillion frames, it treats its viewers like toddlers who clap when they witness peekaboo.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect Remake",
            "content": "Vikram Vedha is perfect Remake. Casting Hrithik as Vedha is the best decision taken by the director duo Pushkar and Gayatri. Hrithik was superb in his role. He did complete Justice to Vedha role. Saif Ali Khan was equally good as Vikram. Radhika Apte, Rohit Saraf and many more were good in their respective roles. Sam CS is another hero of the movie. His BGM was lit especially for Hrithik's elevation scenes. The screenplay was engaging. The dialogues between Vikram and Vedha during the interrogation scenes were better than the original. The songs were Ok, could have been better. Overall, a Fantastic Movie.",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ek kahani sunai sir? Ra Ra Ra Ra Ra",
            "content": "Vikram Vedha presents the story of a police officer and a gangster in a classy way. It's a treat for the audience.Hrithik Roshan has given the best performance of his life. He has indulged in the character of Vedha. You totally forget that you are watching HR. His dialogue delivery was mind blowing. Alcoholia song is a visual treat.Saif has done an amazing job. He has complimented Hrithik in entire movie.Pushkar Gayatri are worth the praise. Their storytelling skills are unmatchable.Background score is the biggest asset to the film. Overall it's a fun watch. Total paisa vasul movie. A must watch for cinema lovers.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must watch movie hritik roshan he just nailed.....it",
            "content": "Start slow for 15 minutes after that when hrithik arrived he just never disappointed u\nStory mashallah action subhan allah\nAur hrithik personality......his dance\nAnd famous dailouge\nEk kahani Sunay sir........la la la la la....music.1st half is just all about hrithik roshan his action his acting his swag man .......\n2nd half power pack dhamka .....story telling\nSaif ali khan in the end deliver nice thungi\nRadhika apte looking beautiful....\nBut story start only after hrithik..... Entry....\nI can't just rid of music the way hrithik walk...\nHis fighting scene\nHe just.......op....................",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Original One was much better",
            "content": "The Original One with Madhavan and vijay sethupati was much better.Even that movie was average, but still the acting and camaraderie between madhvan and vijay sethupati was commendable.I don't know why hindi cinema had suddenly become so short of stories and they only concentrate on stars and not on story.Would recommend that people should see original one first and can then compare themelves.Its more about the dialogues and way Madhavan and vijay sethupati interact with each other, their body language, their reactions are jsut awesome whereas both Hritik and Saif are a big let down. The way both actors respond to each other in different frames is utter bore.I would prefer to watch the original one again over this.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hrithik : The Saviour",
            "content": "The Vikram Vedha remake is a decent almost scene to scene to copy. It fails to create the tension, the thrill and the grip that original one did. Bgm and Hrithik are the only positives from the film. However, Hrithik will also bore you as the film is 2 hr 40 min long. Will not recommend it to anyone other than Hrithik fans.Direction is very very cliche and looks as if the directors haven't moved from the original.-i did not like the portrayal of vikram by R madhavan in the originial and again in remake as well I felt saif's portrayal didn't leave any impact.cinematography is lovely3 stars / 10.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Same overacting and boring screenplay",
            "content": "These people will never learn acting. Same overacting and same larger than life glorifying evil person. Disappointing and must be avoided if you want to save yourself from headache,Acting - below average\nScreenplay - poor\nBackground score - too loud\nPlot - predictedSince it's a copy of famous South Indian movie they could have tried something different but they failed miserably.As far as Box Office is concerned I guess this movie won't last long more than a week. Save your hard earned money and it's not a bad idea to watch the original Vikram Vedha movie.Your truly,\nMadhavi Shah - Gujarat Dainik Newspaper.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A unique, intelligent piece of writing, amazing acting and it will leave scratching your head",
            "content": "I have been waiting for an amazing movies like this for over 20 years. Since Dil Chata Hai and Zindagi Na Mile Ge Dubara, this is a master piece.You can see how hard the writer/director has worked to make this movie like Christopher Nolan does, it makes you pay attention to every single/small detail because every scene is connected to another one.This movie will keep you in your toes and it would make you think you have figured it out, yet you would be wrong, over and over again.Unlike other romcoms filled with 6-8 songs, unnecessary dancing/fighting scenes that have been repeatedly over done in the past 30 years of Bollywood movie industry, this is a masterpiece with only 2 songs, no unnecessary fight scenes, over acting or lethargic dialogue scene.It's well worth spending money and watching in theater. You will appreciate better acting skills from both the top stars and you can tell they have done their homework this time before shooting movie.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nice movie",
            "content": "Vikram Vedha-\nDirector : Gaytri - PushkarOne of the remake of South ,\"Vikram Vedha\"- the only reason for me to watch the film was to see the acting of 2characters which was very well written in the original (although same in this too). In the initial time, when I heard Bollywood is remaking this cult with Saif n Aameer. I thought they'// make Saif as the antagonist,\"Vedha\" but it was vice e versa. Although Saif played his character well as Vikram but in my opinion he should given the role of Vedha , due to his previous played characters (langda tyagi, Naga sadhu etc) , he could have fitted in that one. But altogether Aamir was also not a bad choice , due to his perfection,he can mould himself. But Aamir ,left this movie and makers roped Hrithik in it. Although Hrithik was also good but not an exact fit according to the character. I thought Hrithik could have put its charm n different aura the way he putted during Agnipath but this time you '// miss that thing. Although for the ppl who didn't watched the original they might accept the characters well as it has been portrayed. So for the makers it might be a win win situation. The other things, which the makers keep it similar to the original was the other characters were also not known faces apart from Babloo ( Sharing Hashmi) n Priya (Radhika Aapte) ( similar in original).Altogether it's a good flick and you won't be surprised if Hrithik Roshan would get a filmfare award for his performance.",
            "review_date": "2022-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of time",
            "content": "This movie is an exact copy of a south Indian movie. If this movie is available free of cost with the best acting, and direction. Then why should you go to the theatre third class movie I made mistake.Learn from my mistake, human always learns from other mistake.Again Bollywood proved that they can only copy movies. Exactly they have copied from the south movie there is no thrill to everything we already know. Only talent in this movie they exactly copy each and every scene. If you think your life is just a waste of time and time doesn't matter to you then go to hell watch this movie no one can help you.",
            "review_date": "2022-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disappointed",
            "content": "In simple words, original movie was far better and intense. Though this movie has some more scenes, but those could not do justice to the original masterpiece maybe because of actors. The actors in original movie did a fabulous job, they were so into character. Hritik has his own personality, therefore, he should not have tried to copy the original actors. Saif did a good job though not as brilliant as original. I wish I had not watched the original movie before going to theatre.Would advise to grab some snacks and watch the original one at home instead. However, if you still want to watch this remake, please don't look at original movie.🙏🏻",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not what was expected, really",
            "content": "They couldn't pull it off properly. It could've been way better to be honest. There was potential. But it just didn't click for me.I was going into the movie with a lot of expectations because I've watched the original. But that zing was missing. Although, silver lining was Saif's acting. But most other characters were not really into it. Seemed a bit out of place. When things are right, the story comes to life. It reels you in and makes you comfortable with the fictional world created by the filmmaker. But Vikram Vedha didn't really have that pull that I felt in the original one. Maybe, it was the execution of the script which wasn't done right.",
            "review_date": "2022-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Complex and Satisfying, Powerful and Compelling Journey into Moral Ambiguity: A Police Action Thriller with a Brain",
            "content": "First Day, First Show ... and well worth it.This engrossing tale gripped us right from the opening credit sequence. Simple animation recalled the thousand-year-old Sanskrit myth of 'Vikram aur Betaal' which probes the universal question of good versus evil and suggests that human life is more accurately understood as shades of grey rather than either. A \"good\" king Vikramaditya seeks to save his people by subduing an \"evil\" spirit/entity called Betaal (in many versions of the myth not precisely human) only to learn through a series of challenging moral questions posed by Betaal how nothing may be quite what it seems.Writer-director duo Pushkar & Gayatri deftly shift us into what seems at first a disarmingly simple police encounter that will nonetheless resonate later throughout the film: \"good\" cop Inspector Vikram (Saif Ali Khan) and his special police team ambush and annihilate the gang of \"evil\" criminal Vedha Betal (Hrithik Roshan). The central conflict of our story develops as Vedha stages his own surrender to Vikram in order to force Vikram to solve three great questions. And therein lies the unexpectedly deep and compelling tale.So satisfying, to walk out of the cinema with so much to think about!Hrithik Roshan yet again proves how he is not just an industry superstar but a super actor, completely submerged into the persona of a complex and challenging character who rivets our attention throughout. I loved how directors Pushkar & Gayatri deliberately keep his Vedha mysterious and almost unknowable ... he retains his secrets! ... perhaps in homage to the not-quite-human Betaal from the original myths. But in \"Vikram Vedha\" Hrithik portrays for once the catalyst, rather than protagonist, of our film. Saif Ali Khan's Vikram is truly our central character about whose evolving journey and discovery the whole movie turns. And I confess, it is Saif who really surprised me here. For all the ups and downs of his long and on the whole successful career as a leading film actor, never before had I seen Saif Ali Khan bring forth this much power and subtlety to any role. And the two actors, together, play off each other brilliantly.The supporting cast - particularly Radhika Apte as Vikram's wife who is also the lawyer defending Vedha and Rohit Saraf as Vedha's innocent younger brother - are uniformly excellent and well cast. But \"Vikram Vedha\" is never really their show. Here, and most rightly, all focus remains throughout on our two compelling title characters.Special shout-out to the exceptionally good art direction, which due to the horrifically deadly COVID-19 pandemic prevailing in India during time of production had to be largely Lucknow and Kanpur rebuilt on backlots overseas in Abu Dhabi.If the action choreography never quite reaches the international standard we'd seen in other recent Hrithik films such as \"Bang Bang!\" (2014) or \"War\" (2019), there are still some particularly memorable scenes. Any scene where Hrithik's Vedha and Saif's Vikram are going head-to-head, definitely. There is a Vedha gun battle scene shortly before the climax in a ruined roof-less structure with an open looping staircase that was nicely shot. My special favourite, though, is a mid-film rooftop 'parkour' sequence where the Vedha character escapes by nonchalantly walking - not running - up down and around while the feverishly seeking police madly hunt for him at street level: perfectly illustrated the character.Much recommended viewing!",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Complete mind boggling!!",
            "content": "The act, Direction, script, BGM, and story outline; everything's top-notch.Hrithik's performance is indigenous and Saif played out his act very well too. A balance between humor, cameos, plot twists, action, etc. And to top it all the duo of Hrithik and Said came out outstanding. I hadn't watched movies for a long time as no such other movie caught my attention as this one did. The movie's build-up was quite gradual at first but since Hrithik's entry comes into the play, the movie has been absolutely mind-boggling.I haven't watched OG but the story outline was such that you'd get thrilled when the movie starts connecting all the dots imprinted earlier.A complete blockbuster from my end. Hats off!!",
            "review_date": "2022-10-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb film",
            "content": "The Director Pushkar and Gayatri makes a good effort and produces a film with great visual spectacle to keep the audience engaged to their recliner seats. Hrithik Roshan gives a powerful performance, whistle blowing one, Saif delivers a better film after Jawaani Jaaneman debacle, perfect lead to be paired opposite hrithik. Radhika Apte does an ok types performance. Overall the film belongs to both lead actors. So it's a thumps up for vikram vedha to go and watch it in theatres nearby. Cinematography superb, story works in this film, screenplay awesome, Acting of all the artists is noteworthy and worth the praise.",
            "review_date": "2022-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hrithik absolutely blows everyone away",
            "content": "It's been 25 years since Hrithik shook the world and emerged as the new age hero of Indian cinema. 25 years later and Hrithik is still showing everyone why he is the ultimate actor. Let's talk about the movie first, the direction is very good but could have been better, specially the action sequence could have been choreographed better. This is just nitpicking, the movie has an amazing pace and the angle of deception is amazing, directors know how to tell a story. Lots of suspense and twist, you may think that the story is going in one way but then it will flip on it's head, Saif Ali Khan has put in a good performance, I wish the directors changed a few things more from the Tamil version. Watch it for the amazing performance by Hrithik Roshan.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece",
            "content": "I thought it dull in in front of south mega star. It is much better than south movie. Story is same exactly but action, cinematography, songs, wer awesome. Really liked a bollywood movie after very long time. Also what a sound! Must watch. Hrithik and saif is perfect replacment for madhavan and vijay setupati. I have been lived in lucknow for 4 years. I can relate each and every place and shooting scenes. Fantastic screenplay. Hrithik alcoholia dance is so cool in theater. Creater should think about second part of the movie as they have left the characters alive. Best scene is in climax part when hrithik and saif comes together .",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect Remake..!!! Very Entertaining..!!",
            "content": "Although it is a Remake of Tamil Movie. But the Remake is Soo Good. You will love watching it again if you have seen original one. And If you didn't watched orginal one. This is a must watch for yoi. It's a treat on Big screen.Hirthik and Saif Ali Khan has Nailed there respective roles, Supporting Cast has Done great Job, Direction is very Engaging, Background is superb.Apart from best Song Alcoholia, other song's are Okay. Movie is very engaging and edge of a seat. Watch this on Big screen. Very Entertaining.Although it is a Remake of Tamil Movie. But the Remake is Soo Good. You will love watching it again if you have seen original one. It's a treat on Big screen.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nonstop Entertainment!",
            "content": "This movie was literally a thrill to watch\nFrom start to finish. At first you dont understand anything but as you watch more, it gets it habitat and end it with absolute surprise that nobody expected.Also the acting of hrithik roshan and saif ali khan was gorgeous.The background music gave me goosebumps. Very nice work by the music industry.But there are some things that could have been better, like the\nMuzzle flashes looked kind of unrealistic.But in the end, these are small issues and the movies is strong from its roots and it gives unlimited entertainment so I have no issues with that.",
            "review_date": "2022-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Surprisingly nice for a remake",
            "content": "Wasn't expecting a lot based on the trailer. But the movie itself turned out to be a decent watch. Due to the fact that I had watched the Tamil version, I of course had biases and made comparisons throughout, but i liked how they changed a few nuances here and there. Especially liked how they tweaked Vedha's character based on Hrithik Roshan's acting. That was the main change. Then of course, the change in places and respective references based on that.Saif's character felt pretty similar to Madhavan's, but here too, didn't feel like as much of a drag as I expected it to be. Of course, the fact that the plot is so good probably had something to do with it.",
            "review_date": "2022-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Had headache due to too much sound.",
            "content": "The film dialogues and both the lead character performances were very good.But the supporting actors, minor role villians could have been better, the movie could have been more impactful. The main villian who backstabs hritik roshan should have been a strong character, but he was not convincing to his role.I am giving less stars only for the music. It was extremely noisy, i am sure many of us would have suffered a headache by the end of the movie.I loved Hrithik's performance all the way till the end. He stole the show. The dialogues were also very nicely written. Overall if the music department would have done better i would have given 8 stars.",
            "review_date": "2022-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worth watch! 🙂 Saif+Hrithik",
            "content": "Pre booked my tickets. First day and first show. I feel relieved and satisfied to watch such a nice thriller movie after a long time. What a combination and screen presence of Saif and Hrithik. Loved it !!!!!!!!!Everything is so good, right from content, dialogues, acting, screenplay. There were twists and turns in the story narration by Hrithik one after another. It will keep you engaged till the end and you will want more of it . If thoughts keep coming in your mind even after watching a movie which means it has definitely created an impact and is definitely a worth watch !!!!!!!!!!!!!!!!!",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nothing new",
            "content": "They just copy and paste the same script with very minor changes but still it looks very poor and flat in front of the original\nEach and every scene will reminds you the original scene and the tone to the Hrithik character looks wired don't works for me the fake looking accent\nR madhavan in original looks dedicated towards his works his life his morals but saif character looks very flat in some scene\nReaming cast has done what has given to them\nThe main bgm is also sounds same Little bit change made but original soundtrack in was lit evry time mady and vijay get face to face\nJust for the audience who hasn't seen the original.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good Entertainer",
            "content": "This movie is a remake of a South movie named the same vikram vedha but like Kabir Singh this remake is also an amazing remake story was not changed acting was great saw Hrithik Sir's movie after a long time and impressed very much I have watched the original one also but I liked this one too story is great scripting is great but a scene in which Vedha say that \"kisse saza denge aap krne waale lo ya krwane waale ko\" This line is recorded and pasted on original soundtrack while editing anyone can notice it easily and some time vfx feel so Unrealistic like in the scene in which vedha is shooting with gun so the lighting there was looking so fake overall the movie is great.",
            "review_date": "2022-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great plot",
            "content": "I really enjoyed the movie! I would rate it 8.5-9. There were a few parts of the first half that kind of got me doubting the movie but the plot really picks up after that and then it was great fun. The things that seemed a little off were that there were jump cuts that didn't always make sense in the action scenes and I felt, at times (in the first half), that Hrithik was bordering on overacting but in general, as a fan I really enjoyed his take on the character. Looking forward to watching more of Hrithik, he is clearly a very sincere actor. Saif and the others have also done a great job. I would definitely watch the sequel if there is one and in fact I might want to watch this again too!!",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Directors do a fine job. Saif & Hrithik make it better.",
            "content": "You just know it when a director has a strong grip on their narrative. This film is a perfect example of that.It has the one thing I love in stories.'Putting the character in a dilemma. The choice he ends up making and its impact on the universe of the story.'It segues between concept and massy stuff so effortlessly.Even the finer things like Saif's clothes going from white at the start to grey at the end is so subtle and sublime.The screenplay is so tight. It is cut beautifully. The music is gangsta.But what stands tall above everything else are the performances. SAIF & HRITHIK uffff. This wouldn't have been half the film it is without them. Two great artists coming together just delivers on screen every time.I haven't seen the original but I feel like it deserves a watch. See what madhavan and sethupathi have done with the characters. I'm sure they'll be brilliant.Big props to the directors/writers as well, this film uses the oldest gangster story formulae and delivers something so fresh and authentic.It's a good time at the movies. Definitely check it out!",
            "review_date": "2022-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Saif Ali is not Madhwan and Hritik is not Sethupati - remake could match the original",
            "content": "I don't understand why this copywood is not leading from the past.What they are doing I don't understand.I also don't understand why people would watch a poorly copied movie when the original is available in Hindi for free on MX player.Joke apart, Saif is not justifying the role at all. Hritik - okay okay but if you compare with the original, they are nowhere near to it.This could have been something that people like only if it were original. In remake people compares it with the original and in that case, I will give negative points to this movie. But fortunately or unfortunately there is no provision for the negative review star.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Massy and Classy Entertainer",
            "content": "Show Stealer : Hrithik walks in with class and swag & slays the silver screen!Hrithik has brought his own deadly, demonic and diabolical version of Vedha. Hrithik just embraces the heartbreak, backstabbing and disloyalty in Vedha's life and makes it his own, and he makes it look like he is thriving in darkness. However you feel along with him, knowing deep down that he is doing the right thing.Saif Ali Khan brings his unique persona and his presence accentuated the screen presence of Hrithik. VikramVedha is incomplete without Saif.Kudos to the enigmatic direction of Pushkar & Gayatri. The enlargement of your vision is very vivid in this. The BGM by Sam CS literally peaked the whole movie and my heart was literally thumping.In short, Its a M. A. S. S. Y E. N. T. E. R. T. A. I. N. E. R.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Can't support a remake. Even though it has Hrithik",
            "content": "Hrithik was superb and also Saif was above average, But couldn't enjoy this movie as it is a copy paste of Vikram Vedha Tamil movie. Knowing the entire story doesn't help me engage on a movie. Though we always say don't compare, but some how our mind always compare it with the original and I can say even though Hrithik has done a terrific job but Vijay Sethupathi was something special in the original movie which no one can outshine and replace. When Bollywood will learn and stop making remake that only god knows. I am giving three stars to this movie only because of Hrithik's terrific try to take his character near to what Sethupathi did in Original Vikram Vedha.",
            "review_date": "2022-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece",
            "content": "Saw the first premier show here in US and after a long time saw an out an out Bollywood entertainer which kept me glued till the end. Perfect balance of classy and Massy treatment.The story we all know from the Tamil version but here there are few surprises and twists. The basic premises remains same. The director deserves standing ovation for keeping the narrative tight and engaging.Saif ali khan is superb as cool, composed yet mysterious cop! Radhika apte has small but effective role,But it's the one man Hrithik roshan who will outshine everyone with his finest act! The actor always challenges himself to outdo his last one. Here he is ruthless yet sensitive. Although initially the dialect may sound like Super30 but it doesn't hamper. With in 5 mins you are in his world. Outstanding act.It is little more violent but not nonsense. The logic doesn't go for toss! Recommended.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie",
            "content": "Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik. Awesome movie.very good action and acting by hritik.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Finally something good in Bollywood",
            "content": "When you watch this movie then you know that movie is really good. And the main reason is Actor of this movie Saif and specially Hritik is something else ,his look ,his walking style , everything is well timed. When you hear the hook background music,that is something else. The direction of is decent, it could be more better but good. Songs are also decent not so much good and I think that director should add some more things in the story ofthe movie. And if they are planning for 2nd part please make patiencely and please work on detailing of every action scenes and other.this is worth watching go and watch in the theatre and enjoy the movie.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really enjoyed it",
            "content": "I haven't watched the original one so this was my first time watching this story. At first I thought it was a normal Chor police type of movie but by the end I was shocked to witness the creativity of the director and script writer .I would really advice every movie lover to watch this film as it's a perfect Masterpiece for this story and Hrithik Roshan has just mailed his character the psyching nature of Veda is chest amazing surface really sutle and all the other characters are just magnificent.The BGM of the whole film just is amazing you feel so highped you in the scenes is just fabulous the twist and turns are in perfect timings and the movie does not feel slow at any time period it's very entertainingremak. If you have went watch the original do watch it and do not say no to it as it's just a remake.",
            "review_date": "2022-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must Watch movie in cinema hall",
            "content": "I don't watch to many movies in cinema hall but this one is special. Hrithik left his mark! He was awesome throughout the movie🔥 From looks to action it was awesome! Yes, his UP accent can be bit issue but overall it was boom! Saif on other hand was perfect! From accent to looks to performance, everything was great! No issue with Saif's performance! He was spot-on for this role! I liked BGM which they didn't change from Original movie! Camera work was good but in alcoholia song, camera work was great! Action was good! Compare to Original movie, it was bit dramatic not real like what was shown in Original Vikram Vedha! But ofcourse it's big budget movie made for cinema hall! I enjoyed so much! Compare to Original, i would say Orginal was made more on realistic background whereas this remake was made for Cinema Hall full action!Once again I would say it is awesome and must watch in cinema hall not in mobile or in laptop or in TV!",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Exceeded my expectations...Story and Direction are top notch!",
            "content": "I didn't even know about this movie prior to the day I went to watch it in theater....but when my friends forced me...i searched a bit about the theme and realised it is based on the Vikram Betal story....which captured my attention....so I went and I have no regrets....\nThe movie was full entertainer and a roller coaster ride of our emotions and of our perception of good and evil....\nBoth the lead actors portrayed their roles brilliantly.... The story and direction are the best part of the film....not a single plotline was wasted....everything occurred for a reason which was perfectly revealed at the climax.....\nAction was great...only some of the Hrithik's scenes look jst a little bit larger than life...but that is ok...that was the only cinematic liberty the directors took.... The music...especially the background score was great....no vulgarity...no unnecessary romance....no forced songs.....\nAll in all it is the perfect entertainer and a thought provoking experience....\nGo for it guys you won't regret.",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Full On Entertainer",
            "content": "There is no denial that the original one is a Masterpiece and no one can match what has been done by Vijay Sethupathi and Madhavan.If not more the remake version is not less as well in any aspect, even if you have watched the original this one will keep you hooked on to your seat.Both Saif, Hrithik are brutal and have done absolute justice to their role, even though the movie is frame to frame copy still emerges as a full on entertainer.The style of Vedha is different in this one, thanks Hrithik for not trying to copy Vijay, while for Vikram there was too little to no scope for a change still Saif carried it well.The movie will not disappoint you you will like it for sure.As the story line is some thing different from what we see on a usual basis, you will like it for sure.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A cinematic master piece with a banger story line",
            "content": "Its a great movie with brilliant cinematography, ambience and atmosphere suits the movie and is engulfing. Havent seen a movie like this in Bollywood since ages. Great actors hritik and saif absolutely delivered and i would 200% recommend to watch for everyone.The whole movie was cohesive and the tension in the film was insane and it kept me at the edge of my seat throughout the movie. I haven't been impressed by Bollywood recently and had my eyes on this particular movie hoping that it would be good. It didn't disappoint,it was absolutely breathtaking with marvellous action sequences and had my eyes glued to the screen. It left me thinking about it for the next few days as well and i think its gonna stay in my mind longer now.",
            "review_date": "2022-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best Action Thriller made in Bollywood ever",
            "content": "One of the best Hrithik Roshan's movie. Brilliant acting done by him and by the other stars too. It's a must watch movie. Superb action and storyline. Kudos to the directors Pushkar Gayatri. Swag of Hrithik is the treat to watch. Outstanding dialogues written by Manoj Muntashir sir. Saif is also brilliant in this movie. Action sequences are extraordinary.. Hrithik is the most handsome Gunda bollywood ever produced 😀 Hrithik should do more movies like this. He is extraordinary performer, brilliant actor and the rarest talent.. he must utilise his talent and do more and more movies. There is nothing that Hrithik can't do.",
            "review_date": "2022-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A good movie from all aspects",
            "content": "After a long time, I could swear that I have watched an awesome movie. Superb acting by both saif and hrithik and also by other actors. Moreover i loved storytelling and the narrative of the movie so much so that it never left the audience bored. It was an enthralling cat and mouse game throughout. I would give the movie 10 stars. Didn't watch the original vikraam vedha on purpose since i didn't want to spoil the suspense of a good hrithik movie after a long time. Loved radhika's role as well . A few songs in the movie ensured that the story doesn't go haywire keeping the indian audience in mind .",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Massy Classy and StandOut by Hrithik",
            "content": "Hrithik , only for him we can watch it . But then Saif nailed it too. Wait a minute entire cast had an important character to be played. There are grey gore and game. Vikram Vedha is a classic example of how remakes should be and how to keep the essence of the movie with right touch. Hats off to the director duo and script. Its pakka theatre movie, loved Hrithik and his screen presence. He justified Vedha. Saif on the other hand , competed with Maddy. Vijay Sethupathi rocked the Tamil and Hrithik nailed it in Hindi. Overall i loved it, its a clear cut entertainer. This movie will officially uplift Bollywood in 2022.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "great movie , must watch",
            "content": "After Bhool Bhulaiyaa 2 , this was a movie i truly enjoyed watching in the theatres .Saif Ali Khan and Hrithik Roshan have both respectively given splendid performances , both fit their role perfectly .The story seems to follow the old tale of Vikram Betal and you'll understand what i mean when you watch it .The way the suspense unfolded in this movie was truly great , for those fans of such thriller and suspense movies and have watched dhrishyam , i can confirm that after dhrishyam this is the next best movie that compares that screenplay .The writers and directors have truly done a great job at this movie , 20 mins into the movie i was hooked and at the edge . You can never guess what happens next ( unless you watched the original tamil movie , i haven't so i cant tell you about that )All in All , a true entertainment and full worth the money spent.",
            "review_date": "2022-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Action Thriller of Epic Proportions!",
            "content": "Vikram Vedha! What a film! Take a bow, Pushkar and Gayatri! Absolutely an edge-of-the-seat thriller with action in abundance! It's totally a clash of giants! Hrithik is menacing and Saif is just suave!Cinematography, Background score, Casting and Dialogues, everything is top-notch! Sharib Hashmi deserves special mention for his powerful performance! Rohit Saraf is a star in the making and Yogita Bihani does full justice to her role.Hrithik is in a never seen avatar in the dashing dance number, 'Alcoholia'! This is a classy film with a mammoth mass appeal! A truly rare combination! Finally, a Hindi film worthy of a re-watch on the big screen!",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome Remake",
            "content": "Love the Vikram veda, the story keeps you engage and love the mystery solving. Both actor at it best level. Post this I saw the south one there is small changes but I say better changes love it after so long. The story start of Vikram betal mix is it self bring memory. Hritik looks total mad and into the role means he totally living the role and saif as Vikram no better character choose.It is worth of spend money on cinema with only one song it will make you sit to your sit not to watch with kids as they don't like the mystery.I wish they make second part love story remain pending 😝 it needs to reveal.",
            "review_date": "2022-10-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nice movies super duper hit",
            "content": "Wow what a movie ! Brilliant acting by Hrithik and Saif. Story is the heart of this movie ! GO watch the movie What are you waiting for?? Must watch guys !! Best action and story. Hrithik Roshan look stunning. Marvellous acting. Nobody could have done it better. A well written and directed movie.Enjoyed every bit of it. A must watch. Hrithik and Saif are fabulous to watch. Best action and story. Hrithik Roshan and Saif Ali Khan looks stunning. Marvellous acting. Nobody could have done it better. Brilliant moview. Hrithik is at his very best. Great presentation. Felt the movie was little long....",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "movie which shows the class of South Indian Cinema",
            "content": "A movie which shows the class of South Indian Cinema !Tamil Cinema reaches its high point with this film!Simply it is a movie which tells the story of an COP & GANGSTER with there own aspects in it,the great ending ,were the entire plot of the story turns and ...More\n254 people found this helpful.Profile image\nSivakumar Balachandran\n2 years agoPushkar Gayatri the husband wife duo directors hits the right chord to present an engaging, entertaining, gripping thriller. This is a Neo Noir movie which happens rarely in Tamil.Story is simple straight forward police and gangster cat and mouse or I could say hide seek game.The wow factor is the screenplay which is well crafted and characterisations are well etched. The perfect pace stands out first kept the audience thrilled and guessing till the end. Dialogues are sharp as knife and powerful as the gun shots in the movie. The BGM was rock solid which had added the feel to the play.Coming to the performances Madhavan as Vikram the protagonist a perfect police maintains his grip and emotes intensive emotions particularly when he feels he was used. Vijay Sethupathy on the other hand essays antagonist Vedha a most wanted leader of local gang pulling it off effortlessly seriously effortlessly like so much of assaultness the way he carries himself stands out unique particularly. Loved the in between short stories he threw. Both Madhavan and VJS with their exposed grey carried on their roles picture perfect. They present raw psychological thriller duo. All the other support characters were picked perfect. Varalakshmi's plays an extended cameo but stands out as well the new face lady who plays the lawyer and wife of Vikram.Subtle messages on guilt - revenge - emotions of gangster or the police were the special catch.I thoroughly enjoyed watching this Neo-Noir flick.Verdict : Don't miss it. Hats off to the team Vikram Vedha. Easy 8.5 on 10.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A refreshing new age cinema",
            "content": "Fantastic film with a concept that is both extremely mature and unflinchingly straightforward. Both Hrithik Roshan and Saif Ali Khan have demonstrated their superior acting ability in their respective characters. The plot develops gradually and then takes a number of unexpected and intriguing turns. It's been a while, but I hope to see more of Hritik Roshan in the future. However, that is quite the comeback. On each of his on screen entries in the movie, he was met with applause and cheers from the crowd. To sum everything up, it's a fantastic movie that the whole family will enjoy watching together. And being a child of the '90s, didn't you and I constantly look forward to hearing new Vikram betal stories?",
            "review_date": "2022-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "for Hrithik and for the story",
            "content": "A modern take on Vikram betal stories, kudos to the writers. Hrithik's screen presence is of MASS appeal, direction and story telling with flashbacks is precise and connects well with the audience, songs were not needed and could have been skipped altogether, Action sequences could have been better especially the ones with shootings were very plain. Background music is good, Actors played their roles well, A good comeback of the duo after a very long time, avoid taking kids to cinema as it has some violent action takes, dialogues are good and enjoyable.Overall a must watch film but it still gonna be a one time watch.",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "AWESOME MOVIE",
            "content": "It was an amazing movie, absolutely mind blasting, not a typical movie, very entertaining, action was awesome and Saif ali khan and Hrithik Roshan were just awesome, their action, acting, everything was superb, HIGHLY RECOMMENDED, action sequence was so awesome, even for 1 second I couldn't blink my eyes, so eye catching, plot was so fresh and amazing, for all Hrithik Roshan it's absolutely a treat for your eyes, very difficult characters but played beautifully, the tough character Hrithik played it was very difficult to play, but he did justice to that, I don't think so in the original movie they actually played the roles this beautifully the way Hrithik and Saif did, Great job guys !",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "All about great acting and direction..",
            "content": "Just go and watch it for Hrithik and Saif delivering great performances on an absolutely captivating story..\nI haven't watched the original one thankfully and therefore no comparisons to be made..\nIndependently this movie stands out as an entertaining movie with a gripping plot..\nHrithik has once again nailed this role and Saif has also done a good job..\nOverall after few very bad movies from Bollywood, this one looks like a saviour..\nKudos to the directors for keeping the storyline and action sequences very genuine and believable..\nJust go for it, you won't be disappointed, instead may have a great tym..",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "original is better",
            "content": "I have seen south version already so it does not seems to be good for me\nHritik Rohan and Saif Ali Khan although have delivered strong performances. For the first half a hour, I thought 'what is going on in the movie?' but the movie takes a grip just after that.With a very engaging storyline, strong acting by the lead actors, and top-notch direction, this is a very good movie. But the movie does not make mark on mind of audience. You can see one time, it is not that bad also, but not good as expected. I am giving six star to movie for action but i was expecting more from acting side but let see people final verdict.",
            "review_date": "2022-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Story is everything!!",
            "content": "I loved the story of Vikram Vedha! It is the center stage of the movie. Performances by Hrithik and Saif are top notch. Second tier actors have received good screen time and their performances have no questions. Background music is thrilling and direction is pretty good. I felt there was no need to have any item songs or in fact any songs in the movie. BGM is good enough for various scenes.I haven't watched the original but I don't want to compare. This hindi version is great by itself and I definitely recommend it to everyone.If you do watch it, pay attention to the start/introduction story and you'll enjoy the ending more.",
            "review_date": "2022-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "After long time Hrithick delivered a super class acting.",
            "content": "It's a remake movie but the class of Hrithick & Saif made this movie superb. Hrithick add some extra charms like he did in super 30. Great to see that Saif was everywhere. Saifs extreme acting made this movie greater then original. After long time great to watch Hrithick in action. Other characters except Radhika wasn't perfect. That was the poor part of the movie.Not added many songs on this movie and i think for the story director didn't but when you have hrithick and saif then hade option to add some more songs.I thought it's going to be flop In box office collection but after watching this movie i realised why they remake it.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best film of 2022",
            "content": "This is great remake. Hrittik and saif acting is outstanding... This remake should be apritiated.. Awesome screenplay and story... I love this film and it is better than remake. My rating is 10/10.. What a film!!! Just loved everyone effort who make the film.. Hrittik agression and saif acting just blowed my mind. Already 3 times watched it. Hrittik is really god of acting. Stunning... Everyone should watch the movie and decide how is the remake.. If remake made like vikram bedha then everyone should support the remake movie. Because story is same but acting is just perfectly done by Hrittik, saif and radhika.",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie is no where the Original one",
            "content": "The performance of actors in original movie was outstanding. You can only like this movie if you haven't watched the original one. The feel of the movie is no where the original one. There is no dialogue which can we be remembered. The same twist and exact scene they copied from original. At least they made some changes to the story. Rhey could have been used the concept of Vikram Vedha and design the whole movie with different scenes and twist in between. Bollywood does not want to work a little when it comes to story writing and execution. Just changing character with same script and storytelling will not be helpful.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An entertainer which requires whistles and brain both",
            "content": "An out and out masala entertainer was missing from Bollywood since 3 idiots which worked for both classes and masses! Vikram vedha could easily fall into that.Every 20 mins the layers keep coming off and one can't predict the next with some tight screenplay and energetic bgm.Hrithik roshan is the star of the show and it is a very complex character but he plays it with such finesse that you forget the Greek god in him. Terrific.Saif Ali khan is equally good and restrained with his act. Sharibh hashmi deserves special mention too.Push kar and gaya tri take a bow for making such intriguing story and packed it tightly.It's just 10 mins little long for my liking.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good remake",
            "content": "Acting of cast has handled the picture very well, just watch do not compare.Hrithik has done a wonderful job as vedha, Saif is good as Vikram (but both can't beat the original one's).Back ground sound is really good, story is known but every time it feels like you are watching it for the first time.Hrithik is look very good and indulged in the character. He apperance, beared look and he's killer smile.Overall, it a good movie to watch, if you have forgotten the story of original, than you'll enjoy it. If you knows the story than you may enjoy the acting of Hrithik , radhika apte and said Ali Khan.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant story, acting and gripping till end",
            "content": "Ek kahani sunaye Sir!! Brilliant plot and easily a must watch movie to bring hopes of watching good cinema in Bollywood. Bring back days of story, acting and strong characters in movies. Not like the over the top - no story no acting only skin show like KJo movies genre. For a change a movie where you need to take your brain and go and not keep it at home. Hrithik steals the show. Every time he is on screen it's gripping to watch. Can't imagine any other actor than Saif for that role. Though a south copy still refreshing to see such story and strong character based movies!!! Waiting for part2.",
            "review_date": "2022-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bollywood is BACK wirh VV",
            "content": "Ohh my man.. What a movie / What a performance / what a direction / What an acting by both lead.I have watched the OG and i liked but the slow pace was the issue but this version corrected it with so perfection. This movie has everything. You will be hooked throughout the entire movie, so many twists which OG didn't have it.+ Points.Sharib Hashmi - He turned out to be a dark horse.BGM - I have never experienced these kind of BGM in any movie.Twists & suspense - You will be blown away with so many good turns in this movie & you'll be forced to think how is this possible to write this kind of script?Saif - I was bit skeptical about him but he nailed it with perfection - No complaints.Hrithik - He is the highlight of this movie. I wish Hrithik only plays villain in every movie. Whoever was comparing him with Vijay sir will be fully satisfied with his stellar performance. For not even a single scene he loses his character.Negative pointsNo chartbuster songs apart from main theme and BGM. Only good thing about alcoholia was hrithik dance and expressions.10/9 rating.Go with the full expectations. This movie is truly for cinema experience not for OTT.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fabulous!!!",
            "content": "What a remake! Storng performance from HR, Saif, Radhika; It's the same old theme of a long-lasting fight between good and evil. But the story, presentation, direction, acting, and cinematography makes VV a legendary movie in various ways. Probably it is going to be the biggest Blockbuster of 2022. It might break many previous records set by past Bollywood movies. The biggest credit, I think, goes to actor HR for his brilliant performance. Every character in the movie has a significant role to play.As the story evolves mystery, suspense, action, all take an absolute shape in such a way that it becomes difficult to blink your eyes in wake of missing any crucial bit of a sequence.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Action thriller packed with powerful BGM 🔥",
            "content": "Vikram Vedha is a very good movie in the Action thriller genre after a very long time. It is a must watch in the theatres. Vikram Vedha is a movie which can bring masses back to theatres. The most positive thing about this movie is that it doesn't feel boring at anytime. Given the movie length is 2h 40m long it always keeps you invested in the movie. The main hero of Vikram Vedha is it's story. Hats off to the directors Pushkar and Gayatri , you guys nailed it once again though I haven't seen the OG Vikram Vedha so my perspective is for this one only. The BGM in the Action scenes is what elevated the movie more. Hrithik Roshan's performance without a doubt is one of his career best. He nailed the expression and attitude of Vedha. Saif whom I underestimated in the trailer , shined in his part and was neck to neck with Hrithik in most of scenes. The supporting cast does it's job very well which includes Radhika apte, Sharib Hashmi and Rohit Sharaf. The inspiration from Vikram Beetal stories is what makes and creates all the suspense and is intriguing. The music is ok not one to take away home with you except Alcholia. But story is good and that is what matters.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A bit underwhelming",
            "content": "Would have liked it more if I hadn't seen the original. In short, the original was more real and grounded, this is the 'Bollywood' remake of it, with glamour, style and 'stars'.Hrithik was the most underwhelming aspect for me, his Vedha was uneven like his accent, which was unnecessary to start with. His action scenes should have been more visceral and less slow motion. The sense of craziness in his character was fleeting, it felt like a wasted opportunity.A few minor things were also better in original. Screenplay and minor characters were more polished. On its own, it would have been a solid 7.5 movie, but that's the problem with remakes, there's always a bar in place, for me it didn't cross it.",
            "review_date": "2022-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "JUGGERNAUT BLOCKBUSTER",
            "content": "Electrifying performance by the legend, Hrithik Roshan.Saif Ali Khan is ever dependable.Vikram Vedha has all the right ingredients with Tight plotting, Spectacular & unforgettable action scenes...There's a powerful tone & atmosphere created by Pushkar & Gayatri Director duo with well-crafted action.Come to think of it, the first half has charming dialogues and engaging narration.All in all, a perfectly assembled cast (arguably) led by Hrithik Roshan with a truly marvelous performance.Bande theme song in the second half is truly an exhilarating experience.Best of all, marvelous climax with a winning combination of mass (masala) & (intellectual) class!From impressive cast to terrific script to the exceptionally eerie background score.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece",
            "content": "Give any role to Hrithik Roshan, he can play it flawlessly like he is not playing character but he is the character.Saif ali khan is also well shaped in cop character and no one would have done it perfectly.Storyline is best and both actors Aced in their Role.Few screenplays added to movie which was not on original one and that made this movie perfect and better than original one by Pushkar and Gayatri.Dialogue and BGM are great and well written for the movie.This movie is not remake but it is a remade by same direction fixing all the loopholes which was in the original one\nFor me 5 Star.",
            "review_date": "2022-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Standout performance from both Lead actors(Hrithik and Saif).",
            "content": "The standard set by the Original Vikram-Vedha was just amazing. Bt this one is also a masterpiece. The BGM, the performance from each character was just amazing. I never feel bored at any point of this film after I watch the Original one from very long time before. It was just amazing and climax was incredible. Hrithik back after 3 long years on big screen and when it comes to performance-wise he never disappoint.Personally, I loved this movie and I request you all to go and watch this movie atleast once. It doesn't matter if you watched the Original one because it doesn't get you bored. It gives a special kick while watching.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just Better than original !!!",
            "content": "This is a worth watching bollywood movie after a long time, the characters and everything is just so great and both leads are just damn.The makers have put a lot of effort for the great experience. From the point Hrithik enters on screen, from then you would be glued to your seats.Vikram Vedha a remake better than the original one.Vikram Vedha Review is a great movie, but I think it's better than the original. The plot was really well-paced and the characters were all unique and interesting, which is something I find in all of Vikram Vedha's movies. Also there are so many new twists that I didn't see coming, which made me enjoy it even more. A definite recommend!I couldn't agree more with you. There are many scenes in the movie that are remakes of scenes from the original one and we can tell which ones they are. But overall Vikram Vedha is a much better film than the original one was in my opinion!",
            "review_date": "2022-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pure entertainment, action and thrill!!🔥🔥",
            "content": "The Vikram Vedha movie is a Hindi remake of the movie Vikram Vedha which was originally a South movie released in 2017. Hrithik Roshan and Saif Ali Khan play lead roles in this Hindi remake.The film tells us the basic story of 'Vikram and Betal' from 'Panchatantra'. How Betal always put Vikram in a dilemma by narrating him different and intresting stories and asking questions about it. This film is also the same Vedha(Hrithik Roshan) narrates a story every time he meets Vikram(Saif Ali Khan) and put him in dilemma by asking him a question about that story. This thing goes until they find their final goal. And after watching the movie a question arises in our mind that is good really good and is evil really that evil?The acting of Hrithik Roshan is very amazing and up to the mark and Saif Ali Khan also played the stern and honest cop very effortlessly. Use of songs in this movie is decent but background music is very cool. It's a theme song of original Vikram Vedha movie. The only thing is that the first half of the movie is a little bit slow but let me tell you it's not boring. The Gayatri - Pushkar duo has done some great work while making this movie and action scenes are very cool and more realistic. So, summary is it's a great movie and if you want a package of good entertainment, action, twist and turns then you must watch this movie once.",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One time watch movie",
            "content": "Acting is very good from all the cast...story line could be better..\nAs always, Hritik Roshan's acting is up to the mark and vedha role suites him perfectly..\nAt first impression after watching trailer, i thought Saif will be playing just a side chaalracter, but he also comes out pretty well...\nRadhika Apte also did well...\nStoryline could be better if we see last part of movie.Many say that it is copy paste from original Vikram vedha but I think that Hritik comes out very differently in this movie and appreciate his efforts for the same.....\nMovie end could be better, hence giving 7 stars...",
            "review_date": "2022-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Outstanding",
            "content": "Hrithik Roshan is brilliant and outstanding in the movie. The movie also is very engrossing. One of the best movies of 2022. The background music is mind boggling. Saif is equally good. The entry scene of Vedha is excellent. And the climax is equally great. The director duo of pushkar and gayathri has done a phenomenal job. I would love to see a sequel made to this movie.The movie is 10/10. Hrithik and Saif chemistry is also something to watch out for. Hrithik deserves all the awards this year for his potrayal of Vedha Betaal.He has even made the most negative character cool.BRILLIANT BRILLIANT.",
            "review_date": "2022-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bindhaast..",
            "content": "You got to be well prepared to match Vijay Sethupati. But, what if you set a new standard, that's another point of view. That is exactly my point that Hrithik created a new Villain to match the story. Because the story can be explained in different ways. The style, the action, the determination, Hrithik deliveres everything in his unique way. Bonus- Dance Number Alcoholia. Also, Radhika Apte does her role well as demanded. Saif on other side is okay but I think Madhavan, if had given a chance would have done a better job although he have to just copy paste. I Like that with you all agreeing with me.",
            "review_date": "2022-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I like this movie .",
            "content": "The story is simply superb, especially when it relates to the real life of people, their, thoughts, confusions, decisions, actions, the good & the bad things in their lives. All the credits go to the story-writer, dialogue writer, Vijay Sethupathi Sir (a hero in terms of acting in this movie), & yet being the villain & a bad actor/doer in the movie. The logic, analogies, examples, co-relating incidents, are enlightening. The movie is made look realistically, that's the way it should be, & is very well executed, with no exaggeration, & hype, or fussing about unnecessary things. The movie is good.",
            "review_date": "2022-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Most entertaining engaging film of 2022",
            "content": "Vikramvedha is the most engaging entertaining seeti maar movie that Bollywood has seen in many years.Deserves 2b seen in a stadium like atmosphere on the big screen!Unique storyline, impeccable performances (Hrithik & Saif) & breathtaking background music.Hrithik deserves the Filmfare best actor trophy for this!Director due deserve an award too. The core strength of the film lies in its unique storytelling narrative, havent seen it before.The film has goosebumps moments galore and scenes where you will be hooting with the rest of the crowd.Don't miss watching this in the theatres, its a once in many many years experience. A complete massy entertainer with a riveting and unique screenplay, that requires intelligence, one of the best interval blocks and then a terrific suspense filled ending when everything adds up!",
            "review_date": "2022-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Vikram vedha 🤐",
            "content": "Nothing to comment but then too i couldn't connect with this movie\nBcoz i already watched original movie Vijay sethupathi performance was great\nBut Hrithik Roshan performance were also good but i already know how the story is and what is the climax i couldn't enjoy movie that much.You can watch if you didn't watch original version\nAnd if you are fan of Hrithik other than that\nNot worth\nMovie is okay but they should have got some innovative ideas of scenes it would have made some difference\nIn ott it is available in Hindi dubbing original movie so i think it is not that much fruitful to watch in theatre.",
            "review_date": "2022-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a gripping plot! Beautiful delivery!! No distractions",
            "content": "Such a good plot after a long time! Hrithik and Said balanced it really well with the folklore tale - very effective delivery.The plot had no distractions - no lovey dovey side, or unwanted comedy, or disconnected songs.My family and I tried to query every scenario at every turn on our drive back to see if the writers missed anything... Usually they do. But the 'devil was in the details 'This movie makes indians abroad like us very proud of how bollywood is capable of such a brick-strong plot and acting delivery. So DAMN GOOD!!!!!My only issue is how this movie is not listed in popular cinema timeslots , making it difficult to book.",
            "review_date": "2022-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A movie not to be missed... Hrithik explodes, Saif Roars",
            "content": "Vikram Vedha is a cinema not to be missed. Brilliant in all aspects. Story is superbly engaging & performances are Top class. Hrithik's stature as an actor should increase multifolds after this movie. He has literally lived this character. The emotions and all those nuances are on point. Saif Ali Khan is equally powerful. He has seasoned as an actor and this is his best performance till date in my eyes.Sharib Hashmi, Radhika Apte & even other supporting actors perfectly fit the bill. Above all, the captains of the ship, Pushkar & Gayatri, take a bow!Mind blown!Overall, Vikram Vedha is a wholesome movie, best experienced in cinema hall. And yes, DO CARRY your brains with you coz Vikram Vedha is a damn intelligent movie.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mind Blowing",
            "content": "Speechless... What a fantastic movie. Hats off to the duo directors Pushkar-Gayathri. Hrithik Roshan and Saif Ali Khan are exceptionally brilliant. Hrithik reminds mixture of Agneepath and Super 30. Saif reminds his role of Scared Games. The background musical score is simply outstanding and mind blowing. The casting director should really appreciated for choosing rightly other characters. The other characters played an important role. In the original Tamil version R Madhavan and Vijay Sethupati were extremely superb. Where are the fcuk***g Boycotter's ? They don't seem to be around here. B***dy Hate Mongers.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "BLOCKBUSTER",
            "content": "Suspence,Thriller,Emotions,Entertainment,\nAction packed Bollywood Bonanza is going to create History on BoxOffice. Hrithik nailed it as'Vedha'.Saif has given his best for the character of Vikram.kept the audience hooked throughout the film.in my view he deserves praise for his Brilliant performance.Take a bow Pushkar Gayatri very well written,Mind-Blowing Twists. Amazing music, The rhythm '''Thara ra ra ra''' is awesome and Background Music keeps your attention from beginning to endSmall but very good performance by Radhika Apte.Overall I will recommend to watch this movie.#VikramVedha.#MustWatch.#AwesomeMovie.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stupendous 🔥",
            "content": "The Hindi version is powered by the innate cleverness of the original concept, Pushkar-Gayatri's filmmaking chops, and Hrithik Roshan's effortless cool. Saif Ali Khan brings a nervy quality to his portrayal of Vikram, while Radhika Apte makes her handful of scenes count. But this two-hander was always meant to be a solo act. Scroll.'Vikram Vedha' review: Hrithik Roshan shines in an efficient remake with a dash of glam\nPushkar-Gayatri's Hindi adaptation of their Tamil film stars Roshan, Saif Ali Khan and Radhika Apte.Two smart decisions work in favour of Pushkar-Gayatri's Hindi remake of their Tamil film Vikram Vedha from 2017. The Hindi version, which bears the same title, retains the original screenplay's single-most attractive quality: slyness.The Tamil version of Vikram Vedha started out as a regular cop-versus-gangster movie before moving into a debate about moral relativism. Inspired by the Betalpachisi folk tales, Vikram Vedha was built around three conversations between the police officer Vikram and the gangster Vedha. Both have a long list of kills to their names. What is the difference anyway, Vedha wonders - a question that ricochets through the flashback-laden structure before taking the narrative into a wholly unexpected direction. The remake replicates the original film's beats, if to a somewhat more muted degree.The second clever choice is the handling of the actor tasked with stepping into the gargantuan shoes of Vijay Sethupathi, who brilliantly played Vedha in the Tamil production. Knowing well that Sethupathi is irreplaceable, Pushkar-Gayatri have moulded the Hindi-language Vedha around Hrithik Roshan, who brings immense star power to the role along with a newfound ease before the camera.Roshan has never been this relaxed, not even in War (2019), where his undercover agent left audiences in thrall to his presence. For Vikram Vedha, Roshan sheds the kilos, acquires an age-appropriate scruffiness and never makes the mistake of trying to imitate Sethupathi.The heavy lifting is left to a bulked-up Saif Ali Khan as Vikram. As a member of a special task force in Uttar Pradesh, Vikram is an expert in dressing up extra-judicial executions. Vikram and his team know exactly how to manipulate a crime scene to make so-called encounters look like retaliatory killings. Vikram's rationale for his actions is muddled by Vedha's counter-narrative.The cast includes Sudhanva Deshpande as Vikram's boss, Satyadeep Mishra as Vikram's colleague, Sharib Hashmi as Vedha's associate, Rohit Saraf as Vedha's brother Shatak and Yogita Bihani as Shatak's lover. Radhika Apte plays Vikram's wife Priya, a lawyer who is representing Vedha. I'm merely a go-between, Priya complains at one point, which pretty much sums up her place in a film that revolves around two strong-willed men on a collision.Despite being a faithful remake, there are times when Vikram Vedha feels like it has lost a few shades while being put through the photocopier. The source film's grunginess makes way for bright lighting, choreographed action sequences and slow-motion views of Khan and Roshan striding across the screen.Also eroded in the journey from Tamil to Hindi is the trust reposed in audiences to keep following the complex contours of the good-versus-evil debate. The often-banal Hindi dialogue by BA Fida and Manoj Muntashir, which is overlaid by deafening background music, is more concerned with rolling out punchlines than raising doubts about what we think we know about crime and punishment.The Hindi version is powered by the innate cleverness of the original concept, Pushkar-Gayatri's filmmaking chops, and Hrithik Roshan's effortless cool. Saif Ali Khan brings a nervy quality to his portrayal of Vikram, while Radhika Apte makes her handful of scenes count. But this two-hander was always meant to be a solo act.If the Tamil film was a Vijay Sethupathi show, the Hindi remake is a Hrithik Roshan joint. Roshan's full-tilt glam adds a fourth line of inquiry to Vedha's conscience-pricking triptych.Overall a masterpiece. Go watch it before it's too late. Goosebumps guaranteed. 🔥",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing movie !",
            "content": "The movie is amazing. I don't know why people are comparing it with the south version both are amazing, Hritik and said played their respective roles nicely. You should go and watch the movie. The story, screenplay, acting everything in movie is on point. The BGM of movie is just so good, I'm in love with it, definitely a must watch from hritik after a long time. Just watch it as vikram vedha and not as a remake, don't compare both the movie's. I liked the movie and to be honest i liked a bollywood movie after a long time. So go and watch it'll be worth your money and you will enjoy it. PERFECT MOVIE.",
            "review_date": "2022-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "BETTER THAN ORIGINAL!!!",
            "content": "Its the perfect mixture of MASS and CLASS.Comparing with original, its much better in direction, action scenes and acting by the starcast.Hrithik Roshan has done it again...he is just brilliant as VEDHA. His Entry scene, dialogue delivery, action everything... He just carries a different swag & perfection with him.Saif as VIKRAM as was never behind.. Perfectly mathed hR in each sequence.Other stars were also good esp. Sharib as bablu.Bgm and dialogues were good. Screenplay, twists suspense everything is TOP CLASS.Its grandeur and scale is much lasrger than the original. I bet u can't dislike this.Overall its a MUST WATCH.⭐⭐⭐⭐🌟 5/5.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a movie!!!!! Pure Class",
            "content": "If you haven't seen the movie(Tamil version), it's going to blow your mind..Such a terrific movie..\nThe story binds the entire film with impact acts and glamorous Hrithik.. it's a wow movie..\nTry not to know the plot, story before watching this..You will certainly love this movie..If I come to acting, Hrithik is the best actor at this moment in Bollywood..Though we do not get more of him..The on-screen presence is awestruck..\nSaif did a brilliant job.The story telling is amazing..Pushkar Gayathri did a fantastic work.The monopoly of this movie is Hrithik..Only first 15 mins of the movie is slow to build the tempo..After that it's boom.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome movie.",
            "content": "Brilliant performance by @Hrithik Roshan once again he has proved that he is real superstar what a class performance by Hrithik, everyone is knowing that Vijay satiputi had done magnificent in origin version despite the fact that hrithik roshan has accepted challenge and did his work superb. And well supported by Saif Ali khan has done very nice on Vikram character, this role suits on him very nice performance by saif even Radhika apte has done very good. The story has a lot of twist and it keeps your seat tight until the last scene. Full on entertainment.paisa wasool movie Must watch everyone.👏👏",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A perfect balance of action, thrill and suspense",
            "content": "I have watched the original one. Though it's a remake but I must Hrithik and Saif nailed it. They gave their 100% in this film. Specially Hrithik represented this Vedha character as his own style. He didn't try to copy of Vijay.Radhika Apte was great. This is a remake movie but it won't disappoint you at all. Superb action, superb thrill and Hrithik's maniac acting is top notch. Action scenes were great. Loved the \"Alcoholia\" song, it's a bit different style of dance what Hrithik usually do. The BGM was top notch in this film, the way they used those BGM was absolutely amazing.You may say that it's a remake or anything else etc.... But if you watch this film you won't regret at all.Those who haven't watched the original version, just go and see the this remake one, I swear you won't be disappointed.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece 💯",
            "content": "Vikram vedha is solid !!!! Really didn't expect it's gonna be so amazing . Not a single dull moment from start to end . Highly recommended . The remake nailed it - It did justice to the original one and Hrithik ones again proves why he is one of the most versatile actors of bollywood . Hritik as vedha is his best combination of acting and star power since agneepath , Absolutely electric . The story keeps you hooked up till the end with lots of twist and turns . I did watch the original one but they nailed it all over again with this . Saif ali khan gets a great role and knocks it out of the park . Loved his emotional scenes .",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hrithik Sir Upgrades Vedha",
            "content": "Always trusted him since Fiza. Never lost hope in him. Today he makes us (Fans) proud.I have seen the original since I heard the news of the remake. The original was good but this movie is on a high level. More action and emotions. When it comes to emotional factor, no one is better than Hrithik Sir. He can get into any character. He has upgraded the character with his skills. Time and history will mark him one if the greatest Actor in Indian Cinema. With this performance, I proudly sayAfter Dilip Kumar, Hrithik Roshan is Abhinay Samraat.Versility in just two decades but still your talent is vast as Ocean, Mr. HRITHIK ROSHAN.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "mind blowing",
            "content": "Conceptually, the film has been written and throughout really well. Almost everything, even little props and minor satellite characters that play out in the film have relevance to the central plot. The directors, Pushkar and Gayathri, also the writers of the film, make it a point to leave the story's flow to the two central characters after establishing them sufficiently. Vikram and Vedha's parts have been written with a kind of finer detailing that works at so many levels. Like Vedha's love for Raj Kapoor songs, which has been used in action scenes. It's impressive how nuanced things like these have been woven into the narrative.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Blockbuster loading⚡",
            "content": "Hrithik roshan career best performance.what I can tell you about Vikram Vedha is that it is a treat for the eyes, especially for Hrithik Roshan fans. Cinematographer PS Vinod helps Hrithik emerge as a massy hero yet again. Every frame celebrates Hrithik's stardom. Pushkar, Gayathri and Vinod have added numerous slow-motion shots and wide-angle shots that project Hrithik as a larger-than-life man. While these are a visual treat during the first half, the slow-motion scenes go overboard in the second half.saif was also good whenwvwr he appears on the screen. Radhika apte's role was short but important. Go watch it.Full paisa vasool movie⚡",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Vikram vedha super hits 😎🔥🔥",
            "content": "Really Vikram Vedha 2022 movie is very good and in it Hrithik Roshan looks like a flower and Hrithik Roshan's art is very beautiful, Saif Ali Khan has done a great job in Vikram Vedha movie it is a super hit movie no doubt. Best wishes to Vikram Vedha team. I hope all Hrithik Roshan fans will watch this movie and take IMDb by storm but for this everyone should watch the movie rating 10 I am sure Best of luck Vikram Vedha team and its cast Bollywood was looking cold since long but Hrithik Roshan's Vikram Vedha has once again won the hearts of the audience and the next Krrish 4 movie Sudha will be a super hit.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "loved it!",
            "content": "#VikramVedha : A well made remake with the essence of original retained as such. Both our men are excellent. Radhika is good. Should work both with classes and masses. A must watch for those haven't watched the original. Man your screen presence though\nHrithik. Go watch this movie full paisa vasool. Loved every piece of it. Hrithik roshan's best performance of all time with top notch acting and dialogue delivery. And hrihik dance was awesome as always, you will be amazed after seeing his dance moves. Saif ali khan was also exceptional with his performance. His career best perormance also. Radhika apte role was short but effective. Please watch and don't compare with the original one !",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Story, Acting, Screen Play, Screenplay and BGM!",
            "content": "Movie is amazing and must watch for Hindi Audience! Story is slightly different from Tamil version! But Essence of the story is still the same but has accentuated the baseline. Screen play is amazing and keeps you engrossed in every bit. Hrithik has given his career best performance, Saif has stayed true to his role, Rohit and Yogita are cute, Radhika Apte has short appearance but makes her presence felt as well! BGM is not over the top, it is well done ! All in all, movie has not be over done or under done, it has been tweaked in a very nice way to make it look for UP set up. Directors have fab job too!",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Only REMAKE that is WORTH WATCHING",
            "content": "Vikram Vedha 2022 is remake Hindi version of Tamil film Vikram Vedha 2017 directed by same Tamil husband - wife duo, Gayatri Pushkar. Hrithik as Vedha is phenomenal and you won't have a single complain from him. He clearly over shadowed the negativity spread on name of Vijay Sethupati. Saif as Vikram did decent job. Undoubtedly Vijay as Vedha and R Madhavn as Vikram was epic but Hrithik - Saif duo will bring out every single thing that was missing in original.Impactful Dialogues, Brilliant acting from both actors, mass action and god level directing, top notch lyrics from Manoj Muntashir and music from Sam. That's Vikram Vedha for you!",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing screenplay and benevolent story. It does not matter if it is a remake but the story portrayed by the actors is a hit in itself",
            "content": "Amazing screenplay and benevolent story. It does not matter if it is a remake but the story portrayed by the actors is a hit in itself. This was a classic film that reinstated Bollywood after such a remorse phase that they have been going through. Hat's off to the directors and actors of this film. The action, the scenes are fantabulous. I am so glad that i decided not to watch the Tamil make beforehand even though i watch a lot of tolly films. I was completely aw struck after walking out the theatre and i am so glad they could hit it off with such class and immense suspense that lasted till the end.",
            "review_date": "2022-10-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must watch.",
            "content": "Very good moive must watch, Hrithik performance another level Saif is also very good and radhika too. Full masala moive bgm also very good. Very good moive must watch, Hrithik performance another level Saif is also very good and radhika too. Full masala moive bgm also very good. Very good moive must watch, Hrithik performance another level Saif is also very good and radhika too. Full masala moive bgm also very good. Very good moive must watch, Hrithik performance another level Saif is also very good and radhika too. Full masala moive bgm also very good. Very good moive must watch, Hrithik performance another level Saif is also very good and radhika too. Full masala moive bgm also very good.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Looks stale. Original is much better.",
            "content": "If you watched the original by R. Madhavan and Vijay Sethupathi, don't bother with this. If you didn't, go watch the original. It's just sad that Bollywood is having such a low point and has to content with making remakes of amazing movies. Guessing all those decades of getting away by blatant plagiarism is catching up.At best, you can save some money and maybe watch it on OTT in a few weeks if you are going through a period of severe boredom and you find nothing else to watch and ran out of content from Netflix, Prime, Hotstar, HBO, Hulu and heck even YouTube and Instagram reels.Saif was much better in the well made Sacred Games season 1 and here he is as bad as the blah & silly Sacred Games season 2 or the 2014 headache inducing Humshakals.Hritik is trying his best to regain his old charisma in a movie where his role is at best a guest appearance.The music and songs are forgettable.Read the room Bollywood. You guys are bleeding fans who made you big in the past. Get well soon else soon you will end up only making Instagram reels.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A south indian masterclass",
            "content": "If you haven't watched the 2017 original Vikram Vedha and you are into the vikram betal comic or series than this is the perfect movie for you. The movie is a generic cop vs gangster plot but the way the story fuses with the 1985 TV classic is comendable and at times astonishing. The writer should be praised and recognized for this true masterpiece. The background score is a 10/10 and the acting is above average for sure with Hrithik yet again stealing the limelight. Saif was decent nd radhika was wasted. \"Bablu\" Sharib Hashmi, the sensational actor from family man has maintained his standards. All in all a one time must watch film if you haven't watched the Tamil version. The screenplay, cinematography, Action sequence are all at par with the modern best practices. The movie will get unrealistic at times but I guess that is what gives the south indian movies their flavour. Every movie gets to see a Super hero or a super villain flying around and effortlessly bashing 100 people all by himself, this is no different. The concept is one of its kind and I recommend reading or watching one or two episodes of the 1985 blockbuster tv series vikram betal to do justice to the original writer's epic creation.",
            "review_date": "2022-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mass entertainer,well worth your time and money,must watch",
            "content": "Vikram Vedha written and directed by pushkar and Gayatri is superbly written and presented films. The film keeps us glued to our seats throughout the movie. Hrithik Roshan's acting,dance, dialogue delivery is just another level. Well worth your time and money. If you are a Hrithik fan then you should definitely watch the quality movie. Radhika Apte and Saif Ali Khan played their roles well. If you are watching the film for the first time save yourself from spoilers. Watch this in theatre. The background music is also very great. In a nutshell it is a great movie you will enjoy it. Best wishes for the movie.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hrithik Roshan..do I need to say more",
            "content": "Well.. first thing first what a ride it has been..I was really compelled to write my first review because I can't see negative and people's with agenda destroy this fabulous movie.. from first frame to last everything works..acting, direction,dp, all complement each other so well.. whoever reading this go and watch it.. it's worth your time and money..And it's way better than original..if u saw original.it had it's moments but here the director's were simply magnificent in writing and balancing the whole movie..huge blockbuster.. everyone is good in their respective roles but u should be aware in a Hrithik Roshan film all u see and care about is HRITHIK ROSHAN...\nIn the end..do see and judge🙏",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cult classic",
            "content": "OPENING THIS WEEK\n'Vikram Vedha' review: Hrithik Roshan shines in an efficient remake with a dash of glam\nPushkar-Gayatri's Hindi adaptation of their Tamil film stars Roshan, Saif Ali Khan and Radhika Apte.Two smart decisions work in favour of Pushkar-Gayatri's Hindi remake of their Tamil film Vikram Vedha from 2017. The Hindi version, which bears the same title, retains the original screenplay's single-most attractive quality: slyness.The Tamil version of Vikram Vedha started out as a regular cop-versus-gangster movie before moving into a debate about moral relativism. Inspired by the Betalpachisi folk tales, Vikram Vedha was built around three conversations between the police officer Vikram and the gangster Vedha. Both have a long list of kills to their names. What is the difference anyway, Vedha wonders - a question that ricochets through the flashback-laden structure before taking the narrative into a wholly unexpected direction. The remake replicates the original film's beats, if to a somewhat more muted degree.The second clever choice is the handling of the actor tasked with stepping into the gargantuan shoes of Vijay Sethupathi, who brilliantly played Vedha in the Tamil production. Knowing well that Sethupathi is irreplaceable, Pushkar-Gayatri have moulded the Hindi-language Vedha around Hrithik Roshan, who brings immense star power to the role along with a newfound ease before the camera.Roshan has never been this relaxed, not even in War (2019), where his undercover agent left audiences in thrall to his presence. For Vikram Vedha, Roshan sheds the kilos, acquires an age-appropriate scruffiness and never makes the mistake of trying to imitate Sethupathi.The heavy lifting is left to a bulked-up Saif Ali Khan as Vikram. As a member of a special task force in Uttar Pradesh, Vikram is an expert in dressing up extra-judicial executions. Vikram and his team know exactly how to manipulate a crime scene to make so-called encounters look like retaliatory killings. Vikram's rationale for his actions is muddled by Vedha's counter-narrative.Saif Ali Khan in Vikram Vedha.The cast includes Sudhanva Deshpande as Vikram's boss, Satyadeep Mishra as Vikram's colleague, Sharib Hashmi as Vedha's associate, Rohit Saraf as Vedha's brother Shatak and Yogita Bihani as Shatak's lover. Radhika Apte plays Vikram's wife Priya, a lawyer who is representing Vedha. I'm merely a go-between, Priya complains at one point, which pretty much sums up her place in a film that revolves around two strong-willed men on a collision course.Despite being a faithful remake, there are times when Vikram Vedha feels like it has lost a few shades while being put through the photocopier. The source film's grunginess makes way for bright lighting, choreographed action sequences and slow-motion views of Khan and Roshan striding across the screen.Also eroded in the journey from Tamil to Hindi is the trust reposed in audiences to keep following the complex contours of the good-versus-evil debate. The often-banal Hindi dialogue by BA Fida and Manoj Muntashir, which is overlaid by deafening background music, is more concerned with rolling out punchlines than raising doubts about what we think we know about crime and punishment.The Hindi version is powered by the innate cleverness of the original concept, Pushkar-Gayatri's filmmaking chops, and Hrithik Roshan's effortless cool. Saif Ali Khan brings a nervy quality to his portrayal of Vikram, while Radhika Apte makes her handful of scenes count. But this two-hander was always meant to be a solo .If the Tamil film was a Vijay Sethupathi show, the Hindi remake is a Hrithik Roshan joint. Roshan's full-tilt glam adds a fourth line of inquiry to Vedha's conscience-pricking triptych. Do we believe Vedha.",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Honest review must watch it.",
            "content": "I really loved it hritik killed it\nReally a amazing story and when Hrithik said ek kahani sunau that story was awesome you must watch it.And acting was awesome and everything is far better than any others new bollywood movies and when hritik appoint shaifali khan's wife as an advocate that was really amazing the ending of the movie is really good but the starting 15 to 20 minutes of the movie maybe be disappoints you but after that everything is awesome and the starcast of the movie is also good you really enjoy it and one more thing let me tell you is the characters of the movie connects from starting and at the end of the movie. Damn!",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie after a long time",
            "content": "Vikram Vedha, finally a good movie after so long... Although I find the plot slightly chliched but the way story is portrayed and compared with historical characters like Vikram and Betal and their anecdotes keep one engaged throughout the movie and overshadows all its negative shadings.. Saif ali khan is superb, Radhika is as goog as always. Hritik shines on the screen with his screen presence. However I find his character slightly tilted towards his earlier played Anand Kumar in Super 30. Script writer is clear in his approach and the direction\nis in complete harmony.. Overall movie is good and can be considered a must watch..",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Blockbuster written all over it.",
            "content": "There was a time when Indian Cinema was celebrated, and the heroes were revered. Long gone those era, even longer gone are those larger than life charisma that pulled the audiences to experience the enigma, the passion on screen.Thank you Hrithik Roshan , that I had gone on to watch KNPH back in Y2K, and I never looked back. :)If Agneepath had your fire all over the screen, VV has nothing but the flare, added with a maniac who's submerged in his own world of Justice.Noteworthy applause should also go to Saif Ali Khan , that he has done some remarkable works in these recent years. This one's just a cherry on the top.Two brilliant actors, possibly one of the bests of our time, locking horns to offer a festive story of vengeance, gutted with some brilliant screenplay, background score, and camerawork.Each and every scene Hrithik enters, was shot to perfection. So much was the depiction that even my mom (who hardly watches action movies) had barely skipped a beat. And that is where a cleanly knitted storyline comes into the foray, and for that Pushkar and Gayatri deserves accolade.Thank you Hrithik, for this time and all the previous ones, for portraying yet another gripping character with all your Blood, sweat and tear. 🖤Forever a fan, and an admirer of yours. 🙏🏼PS : I haven't watched the original Telegu version of the same, hence no comparison whatsoever from my side. Cheers!",
            "review_date": "2022-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "Awestruck by the plot and hrithik and saif's acting.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterpiece A perfect remake and Hrithik was mind blowing 🥵🔥. Both HRI & saif nailed there characters 🔥",
            "review_date": "2022-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast paced slick thriller.",
            "review_date": "2022-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie. Plot was great and acting",
            "review_date": "2022-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hrithik is a treat to watch! Such great performance.",
            "review_date": "2022-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Storytelling was great.specially  vedha's character was magnificent.Hrithik nailed it...saif was good as a cop.",
            "review_date": "2022-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good script, good acting, good visuals  a treat",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many people are saying its a critic remake, don't listen to those cockheads the movie isn't a remake its the same director and watching it isn't like you won't fall for those bangers inside the content because you've watched before you'd still get goosebumps and it is a complete package drama, action, romance, dance, songs none of them would make you feel bored at any chance\n a flabbergasting acting done hritik and saif.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is real shitty movie, bad sound, nonsense edit, idiotic plot. The worst movie of 2022.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of Hrx . Proud to be a Hrx fan .",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hrithik was awesome.... great title track and bgm",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The screen presence of Hrithik is magnetic and will captivate you. I would go so far as to say that it matches peak Bachchan. The Story and screenplay keeps you absolutely hooked and on the edge of your seat. The Vikram Betaal folk used to structure is screenplay is amazing. It was my favorite Indian film of 2022 (as of October) and in fact my favorite since 2020. Don’t miss this one.",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't read the reviews, just go and enjoy the show. You'll love it!!",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw it five days ago and can't get it out of my mind.  It was a great movie that I saw after a king time.",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vikram - Vedha (2022)\n    If you're looking for what just might be recognized as the very highly tense action thriller of the last few years, then, go no farther, you'll find it all here . . I guarantee it.  This action-packed high octane film, rocks!\nAnd, if you don't agree to its hyper intensity, with special clashing twists and turns, you most certainly will upon the 'AlCOHOLIA' celebration!\n  When going to see this film\nbe sure your mind is sharp and alert, for all the intracacies that you will be exposed to.\n  The idea of 'Circles,' as presented in the movie 'Dark City,' (1998), will be further clarified in this action-packed thriller.  And, flavors of Ben Afflect's 'Accountant,' John Travota, and Nicolas Cage's, 'Face Off,' and, Russell Crow's 'L.A. Confidential,' will also be well noticed, where choices, punishment, corruption, and, just a simple one-on-one, and, varying phylosophies of rationalzation, motives and riddles, intervene.\n  And, let me run this by you, and see if you might not agree, upon an old Japanese saying, 'Life is an Illusion.'\n  This film is very well acted by all who participated in it.  I give it easily five stars.  My only pieve, was, it was awfully loud.  But, this may have been the fault of the projectionist.  I didn't want to miss the first part of this film, as I've complained up-front before about these things, so, I just jammed my ears with kleenex, in hopes that that, would curtail the concussive blows of the fuller force - if you know what I mean.  But, I must say it did enhance the special effects, when the base notes, and, emphasis, came into play.\n  I plan to soon watch, and, willingly pay the extra ticket price to see this in IMAX.  Be prepared for a doozy of an all-out war between rivals who clearly believe their reasons should be validly pursued.  \n                   Would you like to . . . ?\n                                    \n                                   by Doug Obujen",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twist n turn in movie plot. Love it. Kept u on the edge of the seat",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah,a good by performance by all there are many twist and turns and there is a suspense in end which fills you with curiosity.Must go to watch it.",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply masterpiece\nNot comparing the two movies but I must say this 2022 version really holds its ground\nThe cinematography, color grading, camera shots and angles, use of macguffin, direction, and obviously the performances of the cast really elevated the movie to higher level",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie.good action. Good acting overall best movie 👌",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping Screenplay and Awesome acting from Hrithik. Add Saif and the addictive BGM and you have a winner all the way.",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must See Twice SO GOOD .",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining plot and funny mostly.\nSometime phases felt bit draggy due to poor direction",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Out n out Hrithik Roshan show. Throw anything at this man, and he sure can find a way to come on top of it. This man can do anything and do it better than anyone else in the business. Everytime he comes on screen the entire hall just goes crazy. Hrithik is one of the very few stars who push the envelope with every movie they do. He has given one of his best performances. Irrespective of how this movie fares at the box office, this sure will go down as one of Hrithik's best works.",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best story, direction and music.",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action packed movie. Excellent lead actors. Highly engrossing till the end",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Bollywood movie after a long time. Amazing acting, great story, fabulous background music. A great movie that entertains, without shaming your sensibilities. A must watch!",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant movie 🔥 HRITHIK is just wowwww \nMust watch",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clashing with PS1 was maybe the biggest mistake the creators of VV could have committed, considering how VV is a remake of a Tamil movie and the audacity of trh creators to release it alongside the biggest historical Tamil project? Coming to the movie, it's your turn of the day massy action masala movie...it lacks the depth which the original one had, it tries to compensate for the lack of depth with over the top action scenes, not sure if the audience really appreciates such a compensation. The supporting cast do their part pretty well, the lead actors look cool flying and jumping around. A pretty average movie through and through.",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What to say about the movie the story the performances of starcast it was just Awesome mindblowing the direction stylish  action power packed dialogues Hats off to Mr hrithik Roshan for giving the knockout performance he has lived the character of Vedha Thank you  so much for the effort irrespective of its numbers more than numbers movie wins hearts of audience which is above All I give 4.5 out of 5 its amazing",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blockbuster movie and better than the original",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! Amazing performances and storyline. Would recommend to anyone! ❤️",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant piece of work. Amazing movie ",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is really a Booster Dose to BOLLYWOOD and INDIAN CINEMA. Thanks to Deadly Gangster Vedha(Hrithik) and Super Cop(Saif). I appreciate your energy, fitness and struggle towards this Mind Blowing Movie.",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great storyline and a Mass entertainer. Better than the Original in some point",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great watch. Hrithik is awesome",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is f***ing brilliant what a movie best story best action hrithik roshan won our heart man",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was very good but the recliner on the seat didn't work",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The lead actors did an amazing job and the story telling was extraordinary",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome storyline and suspense don't fall for bad reviews by critics.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb movie. Will watch again with my dost !! !! M4 BOYZ",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sound was too loud. the  script stretched. The original Vikram Vetal has more interesting stories.. The dance item was too  close to the taste of south than north and misused the skills of Rhittik .  I can go on and on.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All style and hardly any substance make VIKRAM VEDHA a poor movie. The emphasis in the film was more on Hrithik's style, swagger, and his ability to be totally unfazed by any danger of any sort including death. Once again as is the norm in Hindi movies for the longest while, logic takes a complete back seat in this film. The gunmen are literally spraying him with bullets and not a single one touches him. Not much attention is paid to the story. Once again the songs were totally unnecessary. Everything about the film at best was average.\n5/10",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good action pack movie",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Vikram Vedha' is an absorbing game of cat-and-mouse that delivers a faithful hero-laden visual spectacle.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb film,very well written and directed,all the actors have done a great job,saif ali khan impresses as vikram but hrithik roshan as vedha steals the show,hrithik is effortless and proves again that he is a phenomenal actor.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant script and screenplay. This is a very intriguing story that was well directed to make a highly engaging film. Hrithik Roshan is superb as the intelligent, ruthless and powerful Vedha.\nHe manages to deliver a hugely impactful performance in a controlled manner without any hamming at any point. Saif Ali Khan is effective as the Vikram who is the quieter character and who goes through a transformation.\nAnother thing I loved about the movie was the background score. It is really awesome, especially during action scenes and manages to give the movie an added dimension of fun/ gangsta vibe. \n\nOverall I loved the movie and would recommend it as a definite theater watch.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best action movie ever!!!!!!",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Few of those movies which are even better then original. Mind is blown by Hrithik's act..!! WoW ⭐️⭐️⭐️⭐️⭐️",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice story, good performances for all actorsmust watch",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was absolutely amazing!!! I liked everything and disliked nothing.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Storyline is very good. Cast and acting is excellent.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actions were great. Hrithik has acted very well. Great twist in story. Keeps you entertained throughout. Must watch.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong on testosterone. Decent plot. Charismatic leads.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw the first half n this movie is awesome. High hope on 2nd half.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vikram Vedha is an overall decent movie. I felt there was nothing bad nor good althought I loved seeing Saif and Hrithik. If you are planning to go to the theatres for Vikram Vedha I would recommend it but do not go with high expectations you will regret it.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "he is a good film 😊😊😊😊😊",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was an amazing movie!! Way better then I expected! I enjoyed every second of it!!",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie please watch it",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid movie lots of fun. The acting was good. The dance sequence in the movie came from out of nowhere, and didnt have anything to do with the plot, but it was still in entertaining Dan sequence. A cartoon at the beginning of the movie sets up the premise which it doesnt quite pay off, The premise of a trickster storyteller. But overall it was very enjoyable",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellently directed movie\nwonderful acting",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not interested in hindi and bollywood movies",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing definitely a watch",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is Lit🔥🔥🔥. The bearded Gangsta dude is so cool. The BGM and the action sequences were fire yo. The story about everting is not black and white there is always more to the gray is amazing. dark knight themes in the movie. Amazing 👏👏👏",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        }
    ],
    "rt_rating": 9.5,
    "rt_summary": "Vikram Vedha is an action-thriller showcasing the face-off between a tough cop Vikram and a dreaded gangster Vedha. The film underlines 'between Good & Evil, what you choose, defines you'.",
    "vibes": [
        "capable",
        "gritty",
        "smooth",
        "due",
        "satisfied",
        "emotional",
        "facial",
        "grey",
        "dull",
        "rubbish",
        "foul",
        "like",
        "fruitful",
        "unnecessary",
        "particular",
        "timely",
        "unemployed",
        "usable",
        "excited",
        "free",
        "moral",
        "visual",
        "ideal",
        "pan",
        "standout",
        "catchy",
        "impeccable",
        "multiple",
        "murderous",
        "ageless",
        "unbeatable",
        "famous",
        "human",
        "dramatic",
        "mobile",
        "dashing",
        "mammoth",
        "mature",
        "straightforward",
        "superior",
        "crucial",
        "stern",
        "blatant",
        "forgettable",
        "made",
        "astonishing",
        "sensational"
    ]
}