{
  "title": "Another Round",
  "rating": 8.1,
  "release_date": "2020-12-04",
  "genre": [
    "Drama"
  ],
  "summary": "There's a theory that we should be born with a small amount of alcohol in our blood, and that modest inebriation opens our minds to the world around us, diminishing our problems and increasing our creativity. Heartened by that theory, Martin and three of his friends, all weary high school teachers, embark on an experiment to maintain aThere's a theory that we should be born with a small amount of alcohol in our blood, and that modest inebriation opens our minds to the world around us, diminishing our problems and increasing our creativity. Heartened by that theory, Martin and three of his friends, all weary high school teachers, embark on an experiment to maintain a constant level of intoxication throughout the workday. If Churchill won WW2 in a heavy daze of alcohol, who knows what a few drops might do for them and their students? Initial results are positive, and the teachers' little project turns into a genuine academic study. Both their classes and their results continue to improve, and the group feels alive again! As the units are knocked back, some of the participants see further improvement and others go off the rails. It becomes increasingly clear that while alcohol may have fueled great results in world history, some bold acts carry consequences.… Expand",
  "critic_reviews": [
    "In a year when much of the world has been stuck at home, day drinking, Another Round is a welcome shot of bitters with a warm cognac chaser, and a bracing/revealing renewal of a grand Danish partnership, Vinterberg and Mads his muse.",
    "While Another Round inspects the varying effects of alcohol on daily life, it’s far from clinical. Waves of ebullience, love, humor and sorrow crash on top of each other, as anyone who’s ever been overserved can attest to. It isn’t prescriptive about drinking, and doesn’t seek to impart any message other than that life is hard, and sometimes dark, and sometimes ecstatically beautiful.",
    "Vinterberg’s ending offers an unlikely sense of catharsis, even though it isn’t truly happy, turning the film into something fresh and affecting. On top of all that, the film provides the opportunity to watch Mikkelsen give perhaps his best performance yet.",
    "Here, merriment and melancholy go hand in hand, partners in life’s dance just as a stiff drink is an accompaniment to life’s pleasures. The combination proves as intoxicating as the fancy-pants cocktails the boys whip up together—if not more so.",
    "In a word, Another Round is intoxicating. Vinterberg elevates what could have been a mope-fest with a magnificently defiant tone and a powerhouse performance from Mikkelsen.",
    "A peak-form Mads Mikkelsen stars in this hilarious and heartbreaking spellbinder as a Copenhagen high-school teacher who thinks day drinking might sharpen his faculties.  The Oscar for Best International Feature belongs right here.",
    "By the end, Another Round is a truly wonderful movie about trying to come to grips with life, anchored by terrific performances, infectious music, and a real understanding of the humming discontentment that all adults must learn to navigate in their own ways. It’s the sort of comedy fused with tragedy that may just best represent what life really is: a melancholy, glorious, slightly off-kilter dance.",
    "This is a movie about the joys of friendship, among many other things, and the possibility of change—for the better, not only for the worse, and not only through blood-alcohol adjustment.",
    "Vinterberg and Lindholm take a substantive look at substance abuse, placing it in character context and avoiding dramatic hysterics. Another Round is a film of more quiet desperation and a more thoughtful morality, and it goes down with a kick.",
    "The problem between Anika and Martin is the problem they had from the beginning: He is a shell of who he once was, lost in his own middle-aged melancholy. The problem is not the substance, it’s the person, and with Another Round, Vinterberg has crafted a beautiful dissection of that conundrum.",
    "Vinterberg is a master of storytelling and character here, bringing forth equal parts tragicomedy and suspense in a way that is refreshingly eager to be grounded in the ordinary realities of life.",
    "The cast is outstanding, with Mikkelsen leading the way in a nomination-level performance as Martin. Another Round is filled with memorable sequences.",
    "A stinging, gorgeously filmed tragicomedy about male insecurity and the power of positive drinking.",
    "Mikkelsen is at his best, but all the actors convey a range of emotions masterfully and share real chemistry. Add in Vinterberg’s careful direction of the wry screenplay he wrote alongside Tobias Lindholm, and you have a great dramatic comedy.",
    "Mikkelsen’s affecting performance is backed by an exceptional ensemble cast, who bring to life the fears and emotional scars that come with age, and the part alcohol can play in it, for better or worse.",
    "There are not “funny” moments or “dramatic” moments for their characters; there are simply “human” moments. Whether people react to them with laughter, pity or some combination of them both may say more about themselves than the film.",
    "There’s some familiar moral teachings, but Vinterberg at his most meditative and earnest is a joy to watch. Man isn’t cured of all ills – but he is acutely aware of just how many more rounds are worth having.",
    "Shot in chocolatey browns amid the more comfortable suburbs of Copenhagen, Another Round underlines its later, more cautious warnings by reminding us how inexhaustibly tedious the drunk seem to the sober.",
    "If it says nothing new about the dangers of over-indulgence, Another Round is funny and rich, a fresh, perfectly played, clear-eyed take on middle age ennui. Intoxicating.",
    "All in all, however, this is one of the director’s most absorbing works. It soaks you up, and its melancholy (a shot of Martin, say, eating cereal on his own, in the semi-dark) is somehow less disturbing than its sprees.",
    "The delight of the exuberantly bittersweet closing sequence comes from the way it fulfills a promise the audience doesn’t realize, until that point, has been made.",
    "Another Round itself often moves and swings like a piece of music: Staccato in its rhythms and symphonic in structure, it’s awash in Scarlatti and Schubert, bar tunes and patriotic songs, and climaxes with a jubilant blast of Danish pop/R&B. It sings, and it sparkles.",
    "Another Round (Druk) is a funny film which is also desperately sad, a superficially amusing indictment of drinking culture which is much more bitter than sweet.",
    "Even as the final act starts to get a bit manipulative by stretching some previously established realism, Mikkelsen holds it together, and then he comes out literally swinging in one of the best final scenes of the year. It’s such a jubilant moment that you may walk out of the theater feeling a little buzzed.",
    "Another Round doesn’t quite come across like a cautionary tale, and that’s because Vinterberg takes a refreshingly, well, sober stance on the entwined pleasures and pitfalls of drinking. He’s made the rare movie about getting shitfaced that’s somehow neither a wallow in the gutter nor a fantasy of life without hangovers.",
    "Mikkelsen has become perhaps Denmark’s most familiar face Stateside over the past decade. But he still feels most in his skin in roles like these, and in Round’s final ecstatic scene, the actor does what only true stars seem able to: Take the silly or messy or improbable, and make it fly.",
    "Thomas Vinterberg’s latest, like The Hunt, is ultimately a parable about breaking a social contract.",
    "It’s a sweet, strangely modest tragicomedy about the pleasures of (mostly banal) excess.",
    "Another Round ultimately has little fresh or profound to say about intoxication and addiction, but it is an engaging tribute to friendship, family and bacchanalian hedonism in moderation.",
    "Even if it springs few genuine revelations, this loping sine wave of a film still lands as an honest take on the high highs and low lows of a sodden Scandinavian lifestyle.",
    "It doesn’t hit the heights of former collaborations, but there’s a lot to drink in and appreciate here, and Mikkelsen’s all-dancing finale is one of the most exultant, triumphant moments in recent cinema memory.",
    "The performances are persuasive and watchable, especially Mikkelsen, the guys’ alpha-leader, who ruinously makes being drunk look pretty acceptable until it is too late.",
    "If Another Round had been presented as a farce, a trifle, it might, paradoxically enough, carry more weight. Good comedies have a way of cutting deep, maybe because they relax us just enough so that we let down our guard. But Another Round is both too serious and not serious enough.",
    "Another Round is the kind of movie that’s so into its cool concept that it doesn’t sweat the details. Yet the film’s sloppy broadness ends up fighting the Dogme style, which keeps telling us that these people are authentic."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "In 2012, one of the very best films of the year was Thomas Vinterberg’s tragic drama The Hunt, so it goes without saying that it’s great to see him return with Around Round and collaborate with many of the same actors again. It’s even betterIn 2012, one of the very best films of the year was Thomas Vinterberg’s tragic drama The Hunt, so it goes without saying that it’s great to see him return with Around Round and collaborate with many of the same actors again. It’s even better to say that he’s delivered another outstanding piece of work that’s also among this years best films. The premise is fairly straightforward in four grown men deciding to drink every day and keep a certain amount of alcohol in their system as they go about their daily lives dealing with their jobs and families. It even brings some enthusiastic and hilarious results. However, when the stakes are raised, the true nature and dangers of excessive alcohol consumption are exposed and Vinterberg’s not shy in challenging the darker side. It’s an evenly balanced film, though, with marvellous performances that showcase the characters’ humanity and vulnerability. Another winner from Vinterberg, Mikkelsen and co.",
      "review_date": "2020-12-19"
    },
    {
      "review_title": null,
      "content": "Mads Mikkelsen stars as one of 4 teachers who decides to conduct an experiment based on a scientific suggestion that people function more effectively with a small amount of alcohol in their blood. Their endeavor stars with enthusiasm andMads Mikkelsen stars as one of 4 teachers who decides to conduct an experiment based on a scientific suggestion that people function more effectively with a small amount of alcohol in their blood. Their endeavor stars with enthusiasm and success before things get out of control. This Danish import from Thomas Vinterberg revels in well-rounded writing and superb performances. There’s depth and warmth in the characters, as it observes their friendships and challenges. As with most of Vinterberg’s films, he takes a unique situation and brings it skillfully to life. NOTE: About 45 minutes in, there’s a hilarious montage of real world leaders who are obviously inebriated. (In Danish with subtitles)",
      "review_date": "2021-03-17"
    },
    {
      "review_title": null,
      "content": "“Do you find me boring?”‘Another Round’, also known as ‘Druk’ in Danish, is an hilarious and thought-provoking movie that deep dives into the themes it presents: Life, youth, friendship, alcoholism, and being loved. Because if things don’t“Do you find me boring?”‘Another Round’, also known as ‘Druk’ in Danish, is an hilarious and thought-provoking movie that deep dives into the themes it presents: Life, youth, friendship, alcoholism, and being loved. Because if things don’t go well for you in life, then give it another shot, if not, then hang yourself up to dry.The movie is about four close friends who so happen to be teachers at a high school. All four of them have mundane lives, who are stale at their jobs and social life, and are just unhappy with everything. Until one day they decided to get a little tipsy, maintaining a specific blood rate of alcohol in their bodies to be happier and more active in work, but more importantly feel less invisible by being more loose and fun.Through alcohol, you experience a certain type of happiness that can make you feel bubbly and lively. You laugh the hardest with the people around you. You do or say things that your sober self wouldn’t dare to do. You feel completely fearless. However, once you get addicted to that feeling, it can easily lead you to dangerous territory and things can spiral out of control. That’s this movie in a nutshell.Mads Mikkelsen, an actor that makes every movie so much better, delivers a fantastic performance that’s a perfect mixture of humour, charm, and gloomy. I was also impressed by Mads drunk acting during the small and big moments that felt believable. The same thing can be said with the supporting actors, Thomas Bo Larsen, Magnus Millang, and Lars Ranthe. I can tell this was a collaborated effort to deliver effective performances.The movie is worth seeing for the ending alone, as you get to see Mads Mikkelsen dancing and it is incredible to watch.So yeah, I highly recommend this one, but I also want to recommend another Danish movie called ‘The Hunt’, that came out back in 2012, which is directed by Thomas Vinterberg, the same man who brought us this movie and it also stars Mads Mikkelsen. It’s a heart-breaking movie that has one of the best performances from Mads. It feels overlooked in my opinion. So please check out ‘The Hunt’ and ‘Another Round’.",
      "review_date": "2021-02-08"
    },
    {
      "review_title": null,
      "content": "Strong Lead Mads Mikkelsen in Dark Comedy About Drinking Theory, Midlife Anxieties: \"Another Round - Druk\" is the latest film from Danish director and Dogme 95 movement co-founder, Thomas Vinterberg (\"The Hunt,\" \"Far From the Madding Crowd\").Strong Lead Mads Mikkelsen in Dark Comedy About Drinking Theory, Midlife Anxieties: \"Another Round - Druk\" is the latest film from Danish director and Dogme 95 movement co-founder, Thomas Vinterberg (\"The Hunt,\" \"Far From the Madding Crowd\"). \"Another Round\" is a dark comedy following the lives of four high school teachers in Denmark going through their own individual midlife anxieties. To loosen up, the four men decide to test a theory they found that states one's life can improve by spending the day slightly drunk, at a constant alcohol level of 0.05. The film features a strong, magnificent, emotionally wrenching lead performance by Mads Mikkelsen (Le Chiffre in 2006's, \"Casino Royale\"; Hannibal Lecter in NBC TV drama, \"Hannibal\") as history teacher, Martin.",
      "review_date": "2020-12-06"
    },
    {
      "review_title": null,
      "content": "Terminei o filme com a sensação de que o diretor Thomas Vinterberg tinha a faca e o queijo na mão, mas não soube como usar. O enredo começa a perder o foco pouco mais da metade do filme, entrando em um caminho superficial para o tema doTerminei o filme com a sensação de que o diretor Thomas Vinterberg tinha a faca e o queijo na mão, mas não soube como usar. O enredo começa a perder o foco pouco mais da metade do filme, entrando em um caminho superficial para o tema do alcoolismo e deixando rastros de confusão a respeito do objetivo do filme para quem assiste. Apesar disso, a atuação de Mads Mikkelsen, a interação dos quatro amigos e o uso certeiro da canção \"What a Life\", do Scarlet Pleasure, são destaques da obra.",
      "review_date": "2020-12-30"
    },
    {
      "review_title": null,
      "content": "Director Thomas Vinterberg and Mads Mikkelsen have delivered one of the best moviegoing experiences I've had all year. Check out my review for 'Another Round: http://youtu.be/BU4L39b14I4",
      "review_date": "2020-12-16"
    },
    {
      "review_title": null,
      "content": "The team-up of Thomas Vinterberg and Mads Mikkelsen has done it again. 'Another Round' is very funny and sad when it comes to point out the struggle of the midlife crisis. Indeed, the premise is ridiculous, but the danish writer/directorThe team-up of Thomas Vinterberg and Mads Mikkelsen has done it again. 'Another Round' is very funny and sad when it comes to point out the struggle of the midlife crisis. Indeed, the premise is ridiculous, but the danish writer/director manages it very well to deliver a highly engaging drama about accepting personal and professional failure.",
      "review_date": "2021-01-06"
    },
    {
      "review_title": null,
      "content": "I found this to be very boring.  I have no idea how it got the reviews it got.  Yes, the performances are strong, but overall, it is simply a boring movie in which very little happens.  I would pass on this one.",
      "review_date": "2020-12-21"
    },
    {
      "review_title": null,
      "content": "One of the best movies of the year - A most see for everyone that loves movies",
      "review_date": "2021-04-25"
    },
    {
      "review_title": null,
      "content": "There were very few movies that I liked in 2020. Almost none of them were American...\"Another Round\" comes from a famous Danish director Thomas Vinterberg. Not surprisingly, Mads Mikkelsen (\"The  Hunt\", \"Arctic\" and many others) stars there.There were very few movies that I liked in 2020. Almost none of them were American...\"Another Round\" comes from a famous Danish director Thomas Vinterberg. Not surprisingly, Mads Mikkelsen (\"The  Hunt\", \"Arctic\" and many others) stars there. In my opinion, Mads is one of the best actors living and acting today. The movie starts as a comedy but then turns into a drama with a somewhat uplifting end. A group of four teacher friends decide to test an idea that alcohol blood level .05 and higher could improve work performance and overall quality of life. It is a well known fact that alcohol, as any recreational drug, is a double - edged sword. It could often be fun and often a disaster. The movie is also about midlife crisis, desire to live, love and staying young.Overall, a very good movie, not to be missed.",
      "review_date": "2021-01-10"
    },
    {
      "review_title": null,
      "content": "The movie has its charm, because the 4 protagonists are sympathetic, many of us understands their problem and some of the scenes shows us some nice traditions in Denmark. But the movie is too predictable.",
      "review_date": "2022-01-07"
    },
    {
      "review_title": null,
      "content": "Can a film realistically straddle the fence of a controversial subject without getting its hands dirty despite the risk of angering proponents on each side of that controversy? That's what Danish director Thomas Vinterberg's latest offeringCan a film realistically straddle the fence of a controversial subject without getting its hands dirty despite the risk of angering proponents on each side of that controversy? That's what Danish director Thomas Vinterberg's latest offering seeks to do for the topic of drinking, one that brings with it alleged benefits and potential harm, as well as a boatload of sensitive cultural connotations. This edgy comedy-drama about four friends who conduct a dubious experiment about the supposed creative, professional and social merits that can come from intentional sustained alcohol consumption traverses thorny questions of responsibility, self-control and personal balance and how their handling can either work to our advantage or against our well-being. Needless to say, this is a tricky narrative path to follow, but the filmmaker manages to navigate through it rather skillfully, even if the final product is too unrealistically tidy at times with a closing sequence that's a little too long and arguably unresolved. This offering is sure to provoke strong responses either way, but no one is likely to come away from it without having a well-defined opinion.",
      "review_date": "2021-01-11"
    },
    {
      "review_title": null,
      "content": "\"To alcohol! The cause of and solution to all of life’s problems.” I have been waiting to see Thomas Vinterberg’s Danish film Another Round for months now and at long last the wait is finally over.Four high school teachers decide to try out\"To alcohol! The cause of and solution to all of life’s problems.” I have been waiting to see Thomas Vinterberg’s Danish film Another Round for months now and at long last the wait is finally over.Four high school teachers decide to try out a social experiment where they consume alcohol on a daily basis, keeping their blood alcohol level up and recording how it affects their social and professional lives. The desired state would be drunk enough to feel relaxed and confident but not so drunk as to negatively hinder their day to day lives too much. The main character, Martin (Mads Mikkelsen) is a withdrawn middle-aged history teacher. His work life and home life seem to be tedious and mundane, he’s not living in the moment and doesn’t seem to be present in either his marriage or the classroom. When the possibility of improving his quality of life with the “per mille theory” is presented, Martin and his colleagues Tommy (Thomas Bo Larsen), Nikolaj (Magnus Millang) and Peter (Lars Ranthe) decide to conduct this experiment themselves and record their findings. The experiment proves successful at first, with all four teachers finding their classes have greatly improved but as anyone who has enjoyed a good night out with a few drinks will know, things are always fun and a bit of craic up until a point. As things progress and the alcohol consumption increases the inevitable hangover will always catch up with you.Another Round is sure to bring you through a range of emotions. Yes there are some comedic moments but it’s sad, tragic and thought-provoking. Taking themes of midlife crises, alcoholism, loneliness and friendship with the result being a truly superb movie you won’t want to miss. The chemistry between the four main characters is so genuine you believe they have been friends and working together for years. Strong performances from all, particularly Mads Mikkelsen and honestly I’d watch him in anything. And if you’re still not convinced about seeing this movie, I guarantee it’s worth it just to see Mads spectacular dance moves. One of the best movies of the year. I absolutely loved Another Round and would highly recommend it for all.",
      "review_date": "2021-07-06"
    },
    {
      "review_title": null,
      "content": "A question as old as man: why or why do we drink alcohol? The plot makes us follow the protagonists closely and empathize with them in their audacious experiment, with a dose of humor that does not expect to make you laugh out loud; but thatA question as old as man: why or why do we drink alcohol? The plot makes us follow the protagonists closely and empathize with them in their audacious experiment, with a dose of humor that does not expect to make you laugh out loud; but that is not a defect, but on the contrary. Some of the best of European cinema.",
      "review_date": "2021-06-20"
    },
    {
      "review_title": null,
      "content": "Although Vinterberg uses an incredibly thin premise for his new film, he manages to remember that he has much more talent than he had been showing lately and delivers his best film since The Hunt of 2012. And what a surprise that he achievesAlthough Vinterberg uses an incredibly thin premise for his new film, he manages to remember that he has much more talent than he had been showing lately and delivers his best film since The Hunt of 2012. And what a surprise that he achieves it with the same actor from that film ; Mads Mikkelsen.Another Round tells the story of Martin, he's a history teacher and he's a man who seems out of place, both in his personal life and in his career.One night over dinner, he and three of his friends and fellow teachers decide to start drinking during their classes and at home, due to a talk about a psychiatrist named Finn Skårderud, who theorized that having a blood alcohol content of 0.050 makes you more relaxed and makes you healthier. The film is advertised as a story that through the same narrative device will talk about alcoholism and once you see what happens on screen when the characters decide to start their experiment, it's quite evident that things will not end very well.Therefore, that predictability does not help much, but Vintenberg does not weaken towards the simplistic and does not try to make this drama something simplistic. He doesn't do something extraordinary either, but rather that he constructs a story that wanders between the grounds of a tragicomedy and that's very clear with its last act, and especially the ending, because in my opinion it doesn't explore a resolution, but rather opens a door to another outcome that we will not see, but considering the trip, it turns out to be irrelevant.Another Round could be called simplistic, but neither Vinterberg nor Mikkelsen allow that to happen, and that's what separates it from the bunch.",
      "review_date": "2020-12-22"
    },
    {
      "review_title": null,
      "content": "A great mix of comedy and drama.  A beautiful, cautionary tale about the hardships of a midlife crisis.  That sometimes you need to look back and understand whether you are still the person you were in your youth, or life and its difficultiesA great mix of comedy and drama.  A beautiful, cautionary tale about the hardships of a midlife crisis.  That sometimes you need to look back and understand whether you are still the person you were in your youth, or life and its difficulties broke you and turned you into invisibility.  The film is about not being afraid to experiment for the sake of improving your life, because by improving your life, you may be helping someone else, as well as getting a second youth.  Must-see",
      "review_date": "2021-07-06"
    },
    {
      "review_title": null,
      "content": "'Druk', in its original title, is a disconcerting project. If story definitely seems to fall apart and to run out of steam from time to time, the events and the performance stilll remain impressive. Mads Mikkelsen's acting (Martin) is'Druk', in its original title, is a disconcerting project. If story definitely seems to fall apart and to run out of steam from time to time, the events and the performance stilll remain impressive. Mads Mikkelsen's acting (Martin) is absolutely terrific while other actors are completely overshadowed by his talent.Even if the majority of us were able to predict the logical continuation of the events after having seen the trailer, I still can't say that I wasn't surprised by such an intensity and empathy developed by such voluntarily hollow characters. In conclusion: yes, few notable turns of events but certainly great storytelling and outstanding performances.",
      "review_date": "2021-08-10"
    },
    {
      "review_title": null,
      "content": "(Mauro Lanari)Midlife crisis, demotivated teachers, shaky marriages: facets of the Kierkegaardian angst like his 3 \"Stages on Life's Way\" which, as that voluminous book states, must be addressed with the motto \"In vino veritas\"? Is binge(Mauro Lanari)Midlife crisis, demotivated teachers, shaky marriages: facets of the Kierkegaardian angst like his 3 \"Stages on Life's Way\" which, as that voluminous book states, must be addressed with the motto \"In vino veritas\"? Is binge drinking, the alcoholic culture of the Nordic countries, a remedy for Calvinist puritanism in order to obtain disinhibition from the social contract, released vitality, dionysiacally liberated mind and body, the ode to joy? Unfortunately Vinterberg is ambiguous to the point of suggesting something very different, the epicureanism of \"Let us eat and drink, for tomorrow we shall die\".",
      "review_date": "2021-05-18"
    },
    {
      "review_title": null,
      "content": "This film focuses on an interesting social issue - alcoholism, primarily from a middle aged, middle class perspective (although not exclusively). The plot is quite slow to build and it felt a bit bland in the first half or so but it picks upThis film focuses on an interesting social issue - alcoholism, primarily from a middle aged, middle class perspective (although not exclusively). The plot is quite slow to build and it felt a bit bland in the first half or so but it picks up a bit mid way through and the ending is certainly something to see, I'd say. Mads Mikkelsen gives a pretty decent performance, as a teacher unsure how much the drinking may affect his teaching. Its a quirky watch, more a piece of somewhat thoughtful social commentary than anything else - I wouldn't say its hilarious or really dramatic but its certainly not bad. A curious watch. I wouldn't expressly recommend this unless the plot really intrigues you or your a big fan of the cast.",
      "review_date": "2022-04-13"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nYes!!! This was so wonderful and charismatic and euphoric! Probably my favourite ending from last year, just a truly beautiful expression of joy - I couldn't stop smiling! It's also probably Mads' best performance and solidifies his place as one of the best actors working currently.",
      "review_date": "2021-02-11"
    },
    {
      "review_title": null,
      "content": "Una maravillosa película, Mikkelsen como siempre demostrando ser un gran actor, es entretenida y te cuenta de buena manera una historia. Definitivamente recomendada.",
      "review_date": "2022-02-13"
    },
    {
      "review_title": null,
      "content": "Very good! This Film was authentic, had really good acting in it, especially Mads Mikkelsen and was fun to watch. Being drunk was played very well, which is not very often the case in movies. I really enjoyed the Journey of the alcoholVery good! This Film was authentic, had really good acting in it, especially Mads Mikkelsen and was fun to watch. Being drunk was played very well, which is not very often the case in movies. I really enjoyed the Journey of the alcohol consuming quartett, which have to deal with a lot of variables and sad things on their way.The Experiment and the setting of the school and all being teachers perfectly matched together and was really well written. All in all a Movie you should see! 8/10 bottles of wine.",
      "review_date": "2021-12-27"
    },
    {
      "review_title": null,
      "content": "Director Thomas Vinterberg cannot be praised enough for this film. After four days of shooting, his daughter Ida was killed in a car accident. After a week of mourning, the Dane was back on the set. The idea for the film was also inspired byDirector Thomas Vinterberg cannot be praised enough for this film. After four days of shooting, his daughter Ida was killed in a car accident. After a week of mourning, the Dane was back on the set. The idea for the film was also inspired by his daughter. It tells how four middle-aged schoolteachers go through their midlife crisis based on a theory of the Norwegian psychiatrist Finn Skarderud, who says that a blood alcohol level of 0.05 makes people go through life more relaxed and free.Each of the four main characters gets their own storyline and lets us share in their suffering in life. Once the actually optimistic psychology teacher Nikolaj, played by Magnus Milland, who has to deal with bed-wetting children at home. Then the hapless choir director Peter (Lars Ranthe), who sees himself as an expiry model and cannot find love. Sports teacher Tommy (Thomas Bo Larsen), a coach who is actually loving towards his kids but lacks any motivation. And finally Mads Mikkelsen's character Martin. He accepts being a bore and goes through life virtually invisible, which has an impact on his marriage to Anika (Maria Bonnevie). The plot is told almost exclusively from Martin's perspective. Mikkelsen thereby appropriates pretty much all the facets a person can have. At first he is desperate, then through regular alcohol consumption he suddenly becomes lively and cheerful, before his emotional world is a constant up and down at the end. Mikkelsen disappears into his role and plays this character with a great deal of subtlety and sometimes impulsiveness. Not only Mikkelsen is fantastic, his three co-protagonists also act at a high level. This is especially noticeable in the scenes in which the four of them discuss their project, explore new spheres and go out together. In the individual moments, Mikkelsen stands out because Martin takes up the most screentime.Another Round is a funny film for the most part, although the dramatic moments predominate, especially towards the end. Only then do you really become aware of its seriousness and it takes you with it. Actually, many elements correspond to a classic tragicomedy. Vinterberg manages to lay out the film in such a way that this is not always obvious and you stick to one genre in every scene. It may be mainly about the (worrying) drinking culture among adults and young people in Denmark, but Another Round is also an appeal to life in general. Yes, alcohol can awaken undiscovered free spirits in people, but equally it can literally destroy relationships and lives. Vinterberg covers all these aspects brilliantly. Most of the film runs without any musical accompaniment. But when it does, the classical music adapts to the action. The same goes for the camera work and shots: When the characters are in crisis, the film drags. When they're on the edge, it thrills with outstanding pacing. Yes, Another Round may be tedious in places, but this “weakness\" is made up for by the explosive finale at the latest, which may be the best of the entire year.",
      "review_date": "2021-03-24"
    },
    {
      "review_title": null,
      "content": "This movie is a beautiful examination of a group of men going through mid life crisis and find themselves revitalizing their lives through alcohol. Mads is amazing in this film who plays a boring teacher turned adult delinquent with pureThis movie is a beautiful examination of a group of men going through mid life crisis and find themselves revitalizing their lives through alcohol. Mads is amazing in this film who plays a boring teacher turned adult delinquent with pure depth to his character. But, each character in the group does not get the same nuance or depth as the main character. As they participate in these alcoholic endeavors, we don't see the full of effects or motivations for each character. Still the group as a whole is charming and really sells the movie on its optimistic and hopeful tone.",
      "review_date": "2021-05-14"
    },
    {
      "review_title": null,
      "content": "An excellent film with a great storyline.  Superb acting from Mads Mikkelsen, who expresses so much even when he's not speaking! Made me laugh out loud at times, whilst also being a bit of a Greek tragedy.  Lots of depth and a great approachAn excellent film with a great storyline.  Superb acting from Mads Mikkelsen, who expresses so much even when he's not speaking! Made me laugh out loud at times, whilst also being a bit of a Greek tragedy.  Lots of depth and a great approach to mid life crisis!  Thoroughly recommended.",
      "review_date": "2021-07-30"
    },
    {
      "review_title": null,
      "content": "Rewelacyjny film ze świetną rolą Mikkelsena. Przedstawienie dorosłości, przyjaźni, problemów i alkoholu oraz radości życia w zabawnej i poruszającej formie",
      "review_date": "2021-07-06"
    },
    {
      "review_title": null,
      "content": "Another round is a movie which was worth waiting for.In a high tide of strange movies, which has constant thrill or moreover constant action, Another round is a pure moment of fresh air and has a universal scent that can be easly consumed byAnother round is a movie which was worth waiting for.In a high tide of strange movies, which has constant thrill or moreover constant action, Another round is a pure moment of fresh air and has a universal scent that can be easly consumed by the whole population of the world. From the last scenes I learned when to drink and how to act while doing that.Amazing dance of Mr. Mads.",
      "review_date": "2021-02-13"
    },
    {
      "review_title": null,
      "content": "very good movie, gets you thinking a lot about life itself and it doesnt drag the concept out too long and ends on a high note. the actors and photography make it seem very lifelike so one would think its a documentary, which helps elevatingvery good movie, gets you thinking a lot about life itself and it doesnt drag the concept out too long and ends on a high note. the actors and photography make it seem very lifelike so one would think its a documentary, which helps elevating the movie. best of 2020/21 so far, good job!",
      "review_date": "2021-03-12"
    },
    {
      "review_title": null,
      "content": "Martin, a high school professor, discovers that his students, peers and even his wife find him boring, apathetic, changed. It wasn't always like this: he was a brilliant teacher and a passionate companion when he was younger, but now he'sMartin, a high school professor, discovers that his students, peers and even his wife find him boring, apathetic, changed. It wasn't always like this: he was a brilliant teacher and a passionate companion when he was younger, but now he's kind of dull. In agreement with his colleagues and friends Tommy, Nicolaj and Peter, he decides to start drinking regularly every day with them, to make up for the lack of alcohol that man carries with him since birth, according to the Norwegian theory. Finn Skårderud. The experiment, which also has a scientific aspiration, immediately begins to bear fruit and Martin is once again an appreciated and special teacher. But friends raise, increasing the alcohol content and things take another turn.One of the best performances Mads Mikkelsen has ever offered and this film is one ofVinterberg's best and certainly the best from \"Jagten\" to date. A film that celebrates the thirst for life, the freedom of choice without forgetting to reiterate the importance of taking responsibility.",
      "review_date": "2022-04-28"
    },
    {
      "review_title": null,
      "content": "Mads Mikkelson should have been nominated and won Best Actor that year at the Oscars.",
      "review_date": "2022-11-24"
    },
    {
      "review_title": null,
      "content": "Gonna bring a water bottle filled with Vodka to work tomorrow and jazz dance around for 30 minutes wish me luck",
      "review_date": "2022-12-28"
    }
  ],
  "num_reviews": 65
}