{
    "title": "The Gentlemen",
    "rating": 7.8,
    "release_date": "2020-01-24",
    "genre": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "summary": "The Gentlemen follows American expat Mickey Pearson (Matthew McConaughey) who built a highly profitable marijuana empire in London. When word gets out that he's looking to cash out of the business forever it triggers plots, schemes, bribery and blackmail in an attempt to steal his domain out from under him.",
    "critic_reviews": [
        "The Gentlemen never ceases to surprise and amuse.",
        "Guy Ritchie's The Gentlemen plays like a tall tale, a yarn heard at the corner pub, filled with exaggerations and embellishments, where the storyteller expects you to pay his bar tab at the end. And maybe you won't mind doing so.",
        "The dialogue, the violence, the humor (largely provided by Grant’s character) and the intricacy of the storytelling make for a picture in which most everyone in it seems to be having a great deal of chatty, bloody fun.",
        "But like he seems to do with every project these days, Grant runs away with the movie.",
        "The result is a sequence of events that’s both intriguing and gossamer-thin. You enjoy the challenge of figuring out who’s doing what to whom and for what devious reasons, but it all goes out of your head once the story ends and the lights come up.",
        "For those that persevere, there is an entertaining gangster film at the heart of The Gentlemen. There's a frenetic energy to Ritchie's movie that comes in part from his directing style, and part from the cast's clear enjoyment of bringing the film to life.",
        "Featuring a stellar ensemble cast headed by Matthew McConaughey, Hugh Grant, Charlie Hunnam, Michelle Dockery and Colin Farrell, Ritchie's homecoming is a fairly familiar affair, but also refreshingly funny and deftly plotted, with more witty lines and less boorish machismo than his early work.",
        "The Gentlemen is nothing if not a callback to the Locks of yesteryear, star-stacked and defibrillated with enough juice to jolt a gorilla out of cardiac arrest.",
        "The Gentlemen [is] just stocked with an inordinately good cast. Filled with crosses and double crosses, the plot is mostly irrelevant, but the outlandish flourishes make for a good deal of foul-mouthed fun.",
        "Ritchie doesn’t handle the messages he wishes to impart as skillfully as he could — instead, he’s preoccupied with revisiting the beats that made his acclaimed gangster films work best: the sleek style, the staccato rhythm, the casual hyperviolence that begets more violence and an occasional laugh.",
        "It’s a diverting if slightly undercooked throwback that could offer more genuine intrigue, but that’s still worth it to see the cast gamely chuck out the window manners and vanity.",
        "Ritchie’s strengths as a filmmaker don’t include developing complex female personalities so Dockery’s Rosalind is more like a male fantasy caricature of a strong woman than an actual character.",
        "Finally, there’s Colin Farrell, who plays a boxing coach called Coach, who tries to keep his Jamaican-English charges on, if not the straight and narrow, the straighter and narrower. He and his lads all wear plaid tracksuits, and it’s a testament to Farrell that he makes this feel entirely natural rather than stunty. He is an underrated master who can do no wrong, and I wish this movie starred him.",
        "Ritchie papers over a paper-thin story with artificial twists and very funny turns by the likes of Farrell, Grant, Marsan and Dockery.",
        "The Gentlemen is so blinkered by its outdated (and often offensive) alpha male perspective that it's blind to the elements that could have made it great.",
        "A funny, violent, rambunctious shaggy-dog story of a crime caper featuring an ensemble cast studded with colorful characters played by name actors. In other words, it’s more “Snatch” than “Aladdin,” which was only the latest of Ritchie’s misbegotten attempts to achieve mainstream respect by retelling someone else’s stories.",
        "Ritchie may not be exploring uncharted territory, but you can bet it was more fun to make The Gentlemen than it was to make “Aladdin” or “King Arthur: Legend of the Sword.” It’s more fun to watch “The Gentleman” than those films, too.",
        "Ritchie makes a solid return to his wheelhouse with a crime yarn that turns the air so blue you can swim in it.",
        "What it lacks in freshness and depth, The Gentlemen certainly makes up for in cartoon-y bluster and fun details.",
        "The Gentlemen is a valiant, often raucous bid to drag the tried-and-true old Ritchie formula into the present, and while the result feels like he got about as far as 2005 – with lip-service acknowledgements of grime music and YouTube – for the purposes of this film, it’s close enough.",
        "Ritchie has made an entertaining return to his mockney roots.",
        "Too often, The Gentlemen creaks through the motions of Ritchie’s patented vision, absent the spark necessary to bring his fast-paced action and profane zingers to life. It’s like watching a reunited band struggle to recapture the energy of its glory days.",
        "Ritchie is looking back to the Lock, Stock and Two Smoking Barrels and RocknRolla roots as if nothing has changed since. The Gentlemen is simply those movies with extra everything except inspiration. And sometimes more is less.",
        "The Gentlemen is a mongrel of a movie. There are not enough twists and tangles for a proper mystery, not enough thrills for an action flick, and not enough laughs for a comedy.",
        "If Ritchie had been willing to reflect on his relationship to his own body of work a bit more – the tropes of British gangster films that he himself helped create – then perhaps The Gentlemen could’ve found that next gear that would’ve made it something truly special. Instead, Ritchie’s film proves he might be best served by walking away from the genre entirely.",
        "Hunnam’s presence, alone, keeps the movie grounded. But the movie time and time again exalts the gallantry of its gentlemen heroes at the expense of those unlike them. It gives this glass of Gritchie’s English Lore a bitter taste.",
        "As an evening’s entertainment, it’s almost passable — genially diverting one minute, sour and self-satisfied the next. As a men’s fashion showcase, it’s exemplary — a parade of neatly tailored charcoal waistcoats, colorful flannel tracksuits and a lovely ribbed cardigan that Charlie Hunnam wears like a second skin.",
        "The point is cleverness and looking cool, though, mostly the movie is about Ritchie’s own conspicuous pleasure directing famous actors having a lark, trading insults, making mischief. There’s not much else, which depending on your mood and the laxity of your ethical qualms, might be enough.",
        "In something as herky-jerky and convoluted as The Gentlemen, the viewer has enough to worry about keeping the whole story straight without dreading the next tone-deaf thing to come out of an esteemed character actor’s mouth.",
        "Visually unexceptional when it’s not plain squalid, shameless in its bid for a sequel, The Gentlemen is the film Britain deserves as it staggers backwards into the New Year under the questionable influence of an unabashedly populist leader.",
        "For a filmmaker who used to make these movies with a measure of anarchic glee, Ritchie appears to have bought into his own bullshit here.",
        "It should be fun – but it isn’t. Ritchie, who wrote the screenplay from a story he conceived with Ivan Atkinson and Marn Davies, veers into territory that’s possibly anti-Semitic and maybe a little racist. It’s all a lark, so we’re not supposed to care, but some of the gags still leave a bitter aftertaste.",
        "Take away the confusing plot and throwaway punchlines and the cast is by far the best part of the film — and the reason many will go see it. If only they were part of a different movie. The Gentlemen doesn't live up to the hype.",
        "The result isn’t exactly Lock, Stock Redux. Only the “stock” part remains.",
        "Movies shouldn’t have to meet a PC checklist so they won’t offend – who wants that kind of cinema? – but when they poke you in the eye one too many times, it’s fair game to poke back.",
        "The movie doesn’t end up going anywhere and serves as little more than an excuse to get the movie’s stars into dapper suits and flat caps.",
        "Guy Ritchie’s latest gangster comedy presents itself as a harmless romp, but behind its wink-wink-nudge-nudge humour is a bitter and dated worldview.",
        "The Gentlemen is a disposable crime caper on autopilot. Propped up by an all-star ensemble, particularly the sturdy Charlie Hunnam and scene-stealer Colin Farrell, Guy Ritchie reclaims the genre that brought him to fame but does little more than shuffle battered parts into an intermittently entertaining configuration.",
        "The actors, splendidly kitted out in autumnal suiting and knitwear by costume designer Michael Wilkinson, have what fun they can with such thin, dated material, but everyone here deserves better.",
        "For all its energy and vulgarity, The Gentlemen is a slog, a tedious and unnecessarily unpleasant tour of ground that Ritchie’s already covered.",
        "Of course, the real problem here isn’t that Ritchie isn’t Noel Coward, but that he’s not clever or funny in his own right. The Gentleman isn’t offensive, and it’s not even good enough to qualify as coarse. If it weren’t mildly annoying, it would be as close to nothing as an experience can be.",
        "The London of this film is practically a match for Guy Ritchie’s filmmaking: a characterless mockery of its former glories, smooth and bland and just a bit more monied than before.",
        "It was written with empty-headed desperation and directed with minimal imagination by Guy Ritchie, one of the most incompetent filmmakers of the century."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Love this movie!  Hugh Grant, Colin Ferrel, Charlie Hunnam are all hysterical. (Listen closely to cockney patter. ). Matthew McCoughney is fantastic as is Michele Dockery!",
            "review_date": "2020-01-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Remember when movies used to be fun? Remember movies like Snatch, Lock Stock, Boondock Saints, Lucky Number Slevin? This isn't a homage to those movies, it's its own thing, but it feels just as fun. This movie will keep you guessing fromRemember when movies used to be fun? Remember movies like Snatch, Lock Stock, Boondock Saints, Lucky Number Slevin? This isn't a homage to those movies, it's its own thing, but it feels just as fun. This movie will keep you guessing from start to finish. Well written, well shot, well acted. Instant classic.",
            "review_date": "2020-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic movie! If you love Lock Stock, and Snatch, you will love this. Guy Ritchie kills it once again. It's funny, it keeps you guessing, and of course the acting is top tier! Outstanding direction. Even if your not into a Guy RitchieFantastic movie! If you love Lock Stock, and Snatch, you will love this. Guy Ritchie kills it once again. It's funny, it keeps you guessing, and of course the acting is top tier! Outstanding direction. Even if your not into a Guy Ritchie film, it's still quality in so many ways!",
            "review_date": "2020-02-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Smart and witty. Hugh Grant is fantastic. Great cast and constantly moving storyline.",
            "review_date": "2020-03-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ritchie's return to the crime caper flicks that made him a household name is essentially what you expect. Well acted, talky, and a lot less smarter than it actually is. Its biggest weakness is that Ritchie has always tried to emulateRitchie's return to the crime caper flicks that made him a household name is essentially what you expect. Well acted, talky, and a lot less smarter than it actually is. Its biggest weakness is that Ritchie has always tried to emulate Tarantino's style and his mixed up timeline, but never really getting it right. It took such a long time setting things up that I literally got bored on its first half. After that though, things started to move at a more brisk clip, with a pretty good finale to wrap things up. A good watch, but nothing new here.",
            "review_date": "2021-05-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An extremely anemic attempt to bring back the success of Lock, Stock & Snatch. Anemic is actually an understatement. If you can make it through the first half hour without using your popcorn bag as a receptacle for the contents of yourAn extremely anemic attempt to bring back the success of Lock, Stock & Snatch. Anemic is actually an understatement. If you can make it through the first half hour without using your popcorn bag as a receptacle for the contents of your stomach, then you, like most of the viewing public at this point in the history of humanity, have lost all ability to discriminate...notice the difference between inspired creativity and a desperate formula. Matthew McConaughey is who he always is in every film, unwatchable. The script is supposed to be engrossing but it just doesn't deliver. It's like a train off the rails the entire time, plowing forward anyway, grating noise, going nowhere. The plot and dialogue are so utterly contrived and lame that I actually felt sorry for the actors, some of whom are quite talented, struggle to bring vitality to this total P.O.S. I can't even finish my review because it is making me ill to recall everything worth criticizing, suffice to say that this is more a public service announcement to not waste your time. It's really one of the worst films of this genre I have ever seen.",
            "review_date": "2022-03-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nBizarre casting, (Hugh Grant as a gay paparazzi stringer when he is a superb upper middle class twit, why fight it?), Matthew McConaughey completely miscast, almost everyone in the wrong roles here.  No chemistry or anything between the American gangster and his beloved moll wife.  There were fun moments but how did the Black London boxing guys become expert with automatic weapons, especially when Colin Farrell just told us they're his pupils at a boxing gym?  How did McConaughey survive a hhigh-speed crash with a lorry, with nary a scratch.  Why didn't someone in makeup shave that nasty rash of a beard off his face?  The opening credits were the best moment, it was trying to be Snatch but was typically Richie overdone.",
            "review_date": "2020-12-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThe Gentlemen is done dirty by a January opening. It's an April, at least. The movie is more of an experiment in ASMR sexual harassment on the part of some attractive no good doers from Ritchie's past projects. The story is a bit of a mousetrap of chronologies and unreliable narration, which makes it fun and tightly packed, well-paced, and oddly both more and less self-aware than some of his previous projects.I have a soft and blind spot for Guy Ritchie films. I don't usually know I'm watching one unless Charlie Hunnam is in it. I've passively consumed a lot of Ritchie's big budget films in my childhood and early adolescence. I am continually surprised by the ways that his aesthetic both parodies and plays along with some themes of toxic masculinity: the gestures toward gay- and race-baiting for humor, the way that self-aware British culture clashes with American sensibilities about masculinity, and the unexpected joy of a bro-y film that doesn't need to feel like a game of Cards Against Humanity with your edgelord friends from college. The Gentlemen is a who's who of Ritchie's oeuvre of caper and gangster flicks along with actors on the rise like Henry Golding and Michelle Dockery (of Downton fame), and Matthew McConnaughey saucily eye-fing the camera the entire movie. Spoilers ahead. Ritchie makes moves toward metatheatrical storytelling in his editing, his occasional illustrated captioning, an inset narrative, and the not-so-subtle parables wrapped in trailer material. The opening shot of this movie, in which McConnaughey dies, is startling, and the rewind and reconstruction of events, which has the room for embellishment and authorial focalization, are elements of novel direction, but there are other things that are less innovative, notably the rape threat, which amounts to maybe the biggest missed opportunity for a rewind. One cannot help but think of moments like these as unforced errors. It's not our job to explain away the sloppiness of these choices for \"time\" or \"movie length,\" because when you're movie has a full on music video of fight porn, you lose the excuse of having trimmed the plot to its barest bones. It can't be fun to be the critic finger wagging at the twee racist jokes of a much beloved genre director of dark comedies. I expect that everyone's sensitivities will be tested at some point or another in this movie, but I'm personally a lot less guilty about laughing at the casually racist jokes in this movie than I am about the constant undercurrent of faux homosexual tension that's pervasive in this movie. If this is a directorial decision that's supposed to satirize the BDE of the genre heroes, I am open in being persuaded to like it. In terms of fun ways that Ritchie defuses my anxieties about racist accents and the rest: the movement of our sympathies from the first time we meet The Toddlers and their original entry versus the final scenes or the Three Strikes joke (I'm reading this in my notes, I don't know what these means anymore) shows how Ritchie can play on our expectations of what a Bro-y movie with a lot of Anglo strongmen would think about a bunch of black and brown tykes with GoPros strapped to their heads. Even the way that Colin Ferrell educates the kids in the shop is an excellent twist to his own character, because it feels like he's toying with some inner city hooligans, in part, to deflate their egos, but we then learn that this is sort of his whole deal. The way Ferrell responds to his Toddlers when they ask, \"Is everything OK, Coach?\" with \"No, it's not fine\" and admonishment for their past actions does a lovely job of injecting their relationship with the pathos of a mentor. I guess there's some insidious racism implicit in the idea that the only thing standing between these boys and crime is a rough tongued Irishman, but honestly the conversation on race that the Coach and his student have does enough to show that the film is at least aware of criticism. Laugh out loud moments in this movie were reserved for the dragon fable and it’s rewind--Wife and Friend were both tickled by it and Wife went in unaware of the trailer, so I think it was doubly funny for her. The rewinds on Dry Eye's introduction are a way of being able to build character for the narrator and create a sense that our story is unreliable. The way that the inset narrative eventually leads to the present moment of storytelling is an excellent control of plot. The foiling of blackmail and new relationships that are blended together post the journalist's initial run through of the story makes for a powerful second act. I like the twisty chronology of the beginning moment of the McConnaughey's murder and the way that Hugh Grant's twist with the Russian oligarch changes the trajectory of the story. Might have to think on this one a little harder, but I definitely recommend.",
            "review_date": "2020-03-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A must see for anyone who likes crime comedies from Guy Ritchie. This film has everything that we love Guy Ritchie for: the best black humor, perfect dialogues, interesting characters, a twisted plot and amazing directing. An absoluteA must see for anyone who likes crime comedies from Guy Ritchie. This film has everything that we love Guy Ritchie for: the best black humor, perfect dialogues, interesting characters, a twisted plot and amazing directing. An absolute masterpiece from the master!",
            "review_date": "2020-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film was brilliant. It had everything, drama, action, HUMOUR (which is hard to find now days as everyone takes offence to everything in this ridiculously pc world) and memorable quotes. I loved this film as it was incredibly entertainingThis film was brilliant. It had everything, drama, action, HUMOUR (which is hard to find now days as everyone takes offence to everything in this ridiculously pc world) and memorable quotes. I loved this film as it was incredibly entertaining and well structured. It also had a brilliant cast who displayed an awesome performance and suited their roles perfectly. But not only do I see this as an entertaining film with a brilliant film I love how Guy Ritchie has still got the balls in 2020 to stand up to our ridiculous pc society with a bit of dark humour. I recommend that anyone who can take a joke watches",
            "review_date": "2020-04-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The perfect example of critics' rating being useless. Perfect characters, from Michael to Coach, really strong woman (not just a basic cliche one, but a believable character), setting, and, of course amazing director's work!",
            "review_date": "2020-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's actually a regular Guy Ritchie movie, but the list of actors that this film has does its job.Do not pay attention to the evaluation of journalistic publications.  Their evaluation is just an indicator of too high a level of toleranceIt's actually a regular Guy Ritchie movie, but the list of actors that this film has does its job.Do not pay attention to the evaluation of journalistic publications.  Their evaluation is just an indicator of too high a level of tolerance in our modern society.",
            "review_date": "2020-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "May not be enjoyable for all audiences, regardless of that it is an amazing cast and directing!Could watch it over and over again and genuinely get a kick out of it.",
            "review_date": "2020-06-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not a film for everyone and definitely not one for your nan. But, boy oh boy, what fun this is. Guy Ritchie directs with his tongue firmly in his cheek an absolutely entertaining gangster opus that is a joy from beginning to end. The scriptNot a film for everyone and definitely not one for your nan. But, boy oh boy, what fun this is. Guy Ritchie directs with his tongue firmly in his cheek an absolutely entertaining gangster opus that is a joy from beginning to end. The script is surprisingly witty and intelligent despite the plethora of four letter words and the players are sublime. Who knew that Hugh Grant could be this good. He steals the acting honours in a role that I could never have imagined him doing. Treat yourself to a real and unpretentious comedy.",
            "review_date": "2020-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I found this to be thoroughly entertaining and the acting was strong.  A good story line that took a little time to get straight on - who was up to what - but overall a very much enjoyed 2 hours.",
            "review_date": "2020-01-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An enjoyable movie with the same gangster humor as Snatch & Lock Stock 2 smoking barrels. Might not quite be as good as those but definitely hits a lot of beats.",
            "review_date": "2020-01-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Nothing too unexpected here, but it's funny and hugely entertainingThe Gentlemen is a return to the London gangster milieu where writer/director Guy Ritchie first made his name with films such as Lock, Stock and Two Smoking Barrels (1998)Nothing too unexpected here, but it's funny and hugely entertainingThe Gentlemen is a return to the London gangster milieu where writer/director Guy Ritchie first made his name with films such as Lock, Stock and Two Smoking Barrels (1998) and snatch. (2000). And yes, the film seems stuck in the last decade in more ways than one, it's highly questionable that the only gay character is a slimy man-whore into S&M, its only female character barely even manages to rise to the level of tokenism, and Ritchie does absolutely nothing new here, but The Gentlemen is still hugely entertaining. Most of the jokes land, the dialogue is as sharp and expletive-laden as ever, the cast are having a ball, and the self-reflexivity works well for the most part. The plot is as derivative as it gets, but Ritchie has injected real verve into it. The Gentlemen won't change your life, but it will make you laugh.The film begins as sleazy private eye Fletcher (Hugh Grant) arrives unannounced at the home of Ray (Charlie Hunnam), right-hand man to Mickey Pearson (Matthew McConaughey), an Oxford-educated American ex-pat who controls a huge marijuana empire in London. Several months prior, Fletcher was hired by tabloid editor Big Dave (Eddie Marsen) to dig up dirt on Pearson, and Fletcher has written a screenplay based on his investigation, telling Ray that unless Pearson pays him £20 million, he will hand over everything he has to Dave. Meanwhile, Pearson has decided to sell his whole operation, but when word gets out, all hell breaks loose, as the various interested parties vie for advantage. Most of the subsequent film takes the form of Fletcher narrating his exploits to Ray, explaining how he learned so much about Pearson and what he does.Aesthetically, The Gentlemen is very much in the mould of Ritchie's previous gangster movies. Because Fletcher frames his narration as a screenplay, it allows Ritchie to employ a multitude of self-reflexive devices – a smash cut coinciding with Fletcher asking Ray to visualise a smash cut; on-screen captions telling us who's who; animated maps; freeze-frames; rewinds; a shot of film running through a projector etc. At one point, Fletcher is discussing the merits of anamorphic over 1.78:1, and the film's aspect ratio changes accordingly. At another, he's arguing for the merits of 35mm celluloid over digital, and the film duly switches formats. Such playfulness means that it never for a second takes itself too seriously, and it remains immensely fun, with the more you know about the mechanics of assembling a film, the more humorously self-reflexive the film becomes – Fletcher even acknowledges his own role as an unreliable narrator.In terms of themes, the most obvious is the idea that the economic divide between gangsters and aristocrats masks their practical similarities. The smooth running of Pearson's business depends on both classes – the aristocrats who he needs to grow his product and the gangsters who distribute that product. The clash between the pompous insularity of the English upper class and the perceived uncouthness of the lower class has been done to death in both literature (Wuthering Heights (1847) springs to mind) and film (Performance, for example), and although Ritchie doesn't say anything even remotely new about it, it still forms an interesting textural background – gentrification is ever-present; there are ironic references to the posh areas of Croydon; Ray, a working-class Newcastle native, is a cleanliness freak who eats wagyu steak and lives in a mansion, and when he's dispatched on a mission to an uncivilised working-class area, he explains he \"just hates them junkies,\" seeing them as very much his social inferiors.One of the most central scenes sees Ray and his mn clash with a gang of machete-wielding thugs on a council estate, and there's a real sense of old vs. new – traditional gangsters fighting it out with internet-savvy hoodlums who don't give a damn about tradition or respect. There are a lot of laughs to be had with these issues, such as Ray and Coach (a scene-stealing Colin Farrell) having problems pronouncing the name Phuc. And again, none of this is presented as even remotely serious.The biggest problems with the film are probably its lack of depth, and the familiarity of the presentation, characters, and milieu – there's nothing here you haven't seen in previous Ritchie films. And as you would expect, there isn't much in the way of emotional maturity or narrative complexity. It's all very surface-level, and it makes no apologies for such.Nevertheless, I thoroughly enjoyed The Gentlemen. It's a funny as hell caper and the actors are clearly having terrific fun. It might be formulaic and overly familiar, but it's also immensely enjoyable.",
            "review_date": "2020-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is definitely not a masterpiece. Either is it not a movie that I will review in a year or two. Still, an enjoyable work, with a great cast, and solid writing as well. If you liked Ritchie's earlier movies (which unfortunately didn't ageIt is definitely not a masterpiece. Either is it not a movie that I will review in a year or two. Still, an enjoyable work, with a great cast, and solid writing as well. If you liked Ritchie's earlier movies (which unfortunately didn't age well), you'll probably like The Gentlemen.",
            "review_date": "2020-02-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"The Gentlemen\" is a terrifically entertaining film - all of the acting is perfect, the script is sharp and wickedly funny like \"Snatch\" before it...and there are strong echoes of the classic British gangster film \"The Long Good Friday.\"\"The Gentlemen\" is a terrifically entertaining film - all of the acting is perfect, the script is sharp and wickedly funny like \"Snatch\" before it...and there are strong echoes of the classic British gangster film \"The Long Good Friday.\"  Great stuff!",
            "review_date": "2020-01-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Guy is back in what Guy does the best - **** pigs, Russians, blood and humor, pure fun, must see !",
            "review_date": "2020-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of the best movies that I've seen in the last few years.  It was highly entertaining with a serious plot but comedic undertones.  It had one hell of a cast and very well done in my opinion.",
            "review_date": "2020-02-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie!!! Best of Guy Ritchie since snatch. Lots of fun, great snappy dialogue, and incredible cast.",
            "review_date": "2020-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Casting, plot twists, humor are superb! I'm surprised by some of the critic ratings, but I'm not a \"industry\" critic. Just like what I like. Go see it -- you'll have fun!",
            "review_date": "2020-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Loved every minute of this movie and believe me it's not my typical movie I seek out. It was so engaging I loved the cast... perfection",
            "review_date": "2020-02-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The plot often comes off as thinking its more clever than it actually is, but the fantastic characters and consistent laughs do more than enough to make up for it. Perfectly cast and well directed, the Gentlemen is an entertaining return toThe plot often comes off as thinking its more clever than it actually is, but the fantastic characters and consistent laughs do more than enough to make up for it. Perfectly cast and well directed, the Gentlemen is an entertaining return to form for Guy Ritchie.",
            "review_date": "2020-01-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Some call this a \"return to form\" for Guy Richie. To me this just represents another good movie from Richie although while he has gotten away from \"Gangster movies\" since Snatch, The Gentlemen is clever, funny, violent and vulgar in all theSome call this a \"return to form\" for Guy Richie. To me this just represents another good movie from Richie although while he has gotten away from \"Gangster movies\" since Snatch, The Gentlemen is clever, funny, violent and vulgar in all the right ways.",
            "review_date": "2020-02-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie, one of my favorite directors and finally he got to make as good as movie as Snatch and Lock Stock and 2 smoking barrels. If you were fan of those, you will love this. One of the best movies in last years for me - had action,Great movie, one of my favorite directors and finally he got to make as good as movie as Snatch and Lock Stock and 2 smoking barrels. If you were fan of those, you will love this. One of the best movies in last years for me - had action, funny jokes, sillyness but in a good way, interesting plot and great actors",
            "review_date": "2020-02-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A brilliant masterpiece with unique style. It starts rather slow, but half time passed it burns the ground. It has everithing you want. Humour, Fantastic style, twisted plot, cool and memorable characters and action. The COACH is the best, man!",
            "review_date": "2020-02-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Guy Ritchie makes wacky fun movies and the GENTLEMAN is another in the great movie making FUN that Ritchie produces!I loved it and was surprised a number of times by the great way Ritchie gives and takes info into scenes!\nThe Actors wereGuy Ritchie makes wacky fun movies and the GENTLEMAN is another in the great movie making FUN that Ritchie produces!I loved it and was surprised a number of times by the great way Ritchie gives and takes info into scenes!The Actors were all GREATThe ACTORS are all FANTASTIC!",
            "review_date": "2020-01-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "REALLY good British film. Guy Richie’s ideas are really amazing! I think it is a very good film.",
            "review_date": "2020-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Guy Ritchie has outdone himself yet again!I've watched this movie three times already and it gets better everytime .",
            "review_date": "2020-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hugh Grant's and Michelle Dockery's roles outstanding.Great plot and very good screenplay and 'narration' of the story within the story.Not bad for Guy Ritchie ... good value for the EIGHT BUCKS cinema entry fee.",
            "review_date": "2020-02-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The critics have been swing and miss a lot this season. But  Guy Ritchie is a filmmaker that they've developed a pattern for striking out on his genius. As the arguable Tarantino of Britain, Ritchie uses dialogue and a clever, interwovenThe critics have been swing and miss a lot this season. But  Guy Ritchie is a filmmaker that they've developed a pattern for striking out on his genius. As the arguable Tarantino of Britain, Ritchie uses dialogue and a clever, interwoven storyline to keep the audience ensnared, laughing, and sometimes shocked at the right moment. I never thought any man could make me tolerate Hugh Grant for as much screen time as he had, but Ritchie just became that man. 'The Gentlemen' is crass, hysterical and genius. And pity the critics who got their credentials driven too far up their a** to recognize that.",
            "review_date": "2020-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic movie! Plot twists, casting, humor are superb! Not very fair critics results but you know this shty tolerant industry today :)",
            "review_date": "2020-02-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was a fantastic movie. Not sure what tf critics were smoking, but this was well directed, well written, acting was spot on. I suspect that a good chunk of the negative reviews were done in bad faith because it doesn't go out of its wayThis was a fantastic movie. Not sure what tf critics were smoking, but this was well directed, well written, acting was spot on. I suspect that a good chunk of the negative reviews were done in bad faith because it doesn't go out of its way to be politically correct.",
            "review_date": "2020-04-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The last few Guy Ritchie films have been horrible IMO, this is more like Snatch.  What a great film and a lot of fun.  Colin Farrell steels the show with limited screen time.  Everyone is great though and if you haven't figured this out inThe last few Guy Ritchie films have been horrible IMO, this is more like Snatch.  What a great film and a lot of fun.  Colin Farrell steels the show with limited screen time.  Everyone is great though and if you haven't figured this out in 2020 yet, professional critics are not to be trusted, it's hilarious.",
            "review_date": "2020-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Before seeing this movie, I had never seen a Guy Ritchie film. So I really didn't know anything about the director. I don't know if this film fit his style or if it was like any of his other films. One thing I do know though, is that it was aBefore seeing this movie, I had never seen a Guy Ritchie film. So I really didn't know anything about the director. I don't know if this film fit his style or if it was like any of his other films. One thing I do know though, is that it was a real fun time. Each character had a charisma to them and were enjoyable in their own way. It felt like the the world and background of the film and characters was always moving and growing, with each character having their own job or role.It doesn't fail at delivering laughs when needed either. Overall, it's a good time.",
            "review_date": "2020-02-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Kind of reminded me of Snatch ,loved everything about this movie. Great cast ,nice plot with a bit of twist and laughs.",
            "review_date": "2021-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It’s an excellent movie. It’s definitely in the vein of other Guy Ritchie movies. Lots of action, lots of jokes , way better than Bad Boys 4.",
            "review_date": "2020-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A fun return to the British gangster film by Guy Ritchie that is not unlike Snatch and Lock, Stock, and Two Smoking Barrels although never quite achieves the same light. The movie is well written and stylishly shot with a web-tangle storyA fun return to the British gangster film by Guy Ritchie that is not unlike Snatch and Lock, Stock, and Two Smoking Barrels although never quite achieves the same light. The movie is well written and stylishly shot with a web-tangle story that comedically unfolds through Hugh Grant's wonderful narration to Charlie Hunnam's mild amusement and annoyance. Matthew McConaughey stars as the king of the streets and delivers a great performance that demands the screen like no other as they twist and turn through the mystery of the story. The pace tends to slow a bit but is never boring due to the writing and sheer madness of the characters we meet throughout. Standouts like Grant and Colin Farrell elevate the material they are given and Hunnam's straight man performance is enough to have fun when he finally does get involved in the violent chaos of the movie.",
            "review_date": "2020-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Now, this wasn't an artistically great movie, but I would consider it to be a rather enjoyable one. Matthew McConaughey was highly convincing in the part, with a brilliant supporting cast that is really able to sell their roles and theNow, this wasn't an artistically great movie, but I would consider it to be a rather enjoyable one. Matthew McConaughey was highly convincing in the part, with a brilliant supporting cast that is really able to sell their roles and the accompanying banter. I would say that it's definitely not for everyone - it is something of a gangster movie - but still amounts to something like a crime comedy, which Guy Ritchie is naturally good at. It isn't something that absolutely needs to be seen immediately in the theater, for sure, but it definitely is one to catch at some point for people into movies.",
            "review_date": "2020-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Brilliant movie. Great cast, very strong acting and a really great plot. Guy Ritchie does it again. Also I was very positivley surprised by High Grant.Cannot understand why the Critic Reviews are at a 51 - absolutley uncalled for in my opinion.",
            "review_date": "2020-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Who are the websites critics? And are they blind?  This movie is superb. The colours, the music, the acting. Guy Ritchie traditional movie. Must watch",
            "review_date": "2021-04-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I've watched this twice now and have been genuinely entertained both times.  Each character is brilliantly conceived, well scripted and well acted.  You do need to concentrate but the pieces all come together well at the end.  We ended upI've watched this twice now and have been genuinely entertained both times.  Each character is brilliantly conceived, well scripted and well acted.  You do need to concentrate but the pieces all come together well at the end.  We ended up taking about this the next day, which is always a good sign.",
            "review_date": "2021-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great active with epic Guy Richie dialog. Brilliant chemistry between the three main actors. Fun pacing and great action. Must see!",
            "review_date": "2021-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Stupid W.A.S.P centric gangster schlock that you've seen a thousand times before from Guy Ritchie. Ofcourse it's the White, Anglo gangsters that are the more ethical, honourable and competent ones, that come out on top because of plot armourStupid W.A.S.P centric gangster schlock that you've seen a thousand times before from Guy Ritchie. Ofcourse it's the White, Anglo gangsters that are the more ethical, honourable and competent ones, that come out on top because of plot armour and other rubbish. The users reviews seem to be spamming people with downvotes who didn't like this film for being crass and bigoted towards anyone that wasn't white or Anglo in this film and I can kindly tell those users to go **** them selves ;) Critics should've actually been more harsh.",
            "review_date": "2021-02-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Another movie that goes against the demonic control freaks that are the “progressive” left. Because of a little racism, they hit the movie with bad reviews. Because god forbid a little REALISTIC humour that actually does exist in the realAnother movie that goes against the demonic control freaks that are the “progressive” left. Because of a little racism, they hit the movie with bad reviews. Because god forbid a little REALISTIC humour that actually does exist in the real world. Because god forbid the men out number the women in the movie just like in the REAL world of crime. The left live in their little world of social media and want to make you believe that is how the real world should be like. But i continue to drink their delicious soyboy tears.  Guy Ritchie is back. The demonic hollywood can kick rocks. This movie is a gem. 4 more years.",
            "review_date": "2020-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I honestly don't know how this movie gets a yellow, maybe it was the cruder elements of the script. However, this was a SUPER enjoyable movie.  Not boring whatsoever, and containing interesting plot twists.  Don't let the middling criticI honestly don't know how this movie gets a yellow, maybe it was the cruder elements of the script. However, this was a SUPER enjoyable movie.  Not boring whatsoever, and containing interesting plot twists.  Don't let the middling critic reviews fool you, this is a really fun movie.",
            "review_date": "2020-01-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolutely loved this film, has it all one of the best movies I have seen in years must see!",
            "review_date": "2020-02-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is incredibly fun to watch. If you liked Guy Ritchie's style you will love this.",
            "review_date": "2020-02-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Matthew McConaughey heads this mostly-British cast as an American in London, who runs a very profitable marijuana empire. When he decides to sell it, all manner of schemes comprise the twisty plot. Given that the director is Guy Ritchie,Matthew McConaughey heads this mostly-British cast as an American in London, who runs a very profitable marijuana empire. When he decides to sell it, all manner of schemes comprise the twisty plot. Given that the director is Guy Ritchie, whose career started with this kind of brash, violent, streetwise scenario, it's interesting to see him back at it. Albeit, a bit more restrained in the pacing and violence. There's still plenty of fun in some of the characterizations (esp. Hugh Grant) and some moments of cinematic snazz. Even though Ritchie has certainly mellowed a bit, he hasn't lost his ability to craft an enjoyable, offbeat caper.",
            "review_date": "2020-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great cast, Plenty of originality and charm. I honestly went into this thinking I wouldn't like it and now I would highly recommend it. It's far more clever than I thought it would be.",
            "review_date": "2020-10-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Though some have found \"The Gentlemen\" to be a showcase of writer/director Guy Ritchie at his most entry level, it just so happens to be exactly what this reviewer was asking for all along. As someone who's clung so unabashedly to the notionThough some have found \"The Gentlemen\" to be a showcase of writer/director Guy Ritchie at his most entry level, it just so happens to be exactly what this reviewer was asking for all along. As someone who's clung so unabashedly to the notion that his \"Sherlock Holmes\" films are the best things he's ever done, I was wary of this return to the early days for Ritchie. I don't particularly dislike movies like \"Lock, Stock,\" \"Snatch\" or \"RocknRolla.\" I just find them a bit too showy and brash for my tastes. However, it seems the skills accrued via those jaunts through studio-dom have perhaps melded with the indie sensibilities that were already so present within the man. And the movie's all better for it. Yes, \"The Gentlemen\" is still undeniably Ritchie, but with just the right amount of focus, tact and accessibility to make even the most fervent of Ritchie-deniers leave the theater feeling satisfied. As shocked as I am to say this, I have to admit - I honestly think this is my favorite of the \"proper\" Guy Ritchie gangster flicks.",
            "review_date": "2020-02-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Thoroughly enjoyable gangster flick with great dialogues, wacky characters, surprising and often funny plot twists and a creative and dynamic story telling. A bit uneven perhaps, some scenes absolutely hilarious, but also a few tedious ones.Thoroughly enjoyable gangster flick with great dialogues, wacky characters, surprising and often funny plot twists and a creative and dynamic story telling. A bit uneven perhaps, some scenes absolutely hilarious, but also a few tedious ones. Biggest knock for me was that I didn't care for the main character (McConnaughey) as I did for the fringe ones. Collin Farrell and his 'crew' and Hugh Grant in particular stole every scene they were in. Very worth while watch.",
            "review_date": "2020-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Such a nice movie, like a breath of fresh air. Guy Ritchie definetly came up with the best he can do - British gangster movie. The humor, the action, the plot - everything is there as well as trying to catch up with the trends and culture ofSuch a nice movie, like a breath of fresh air. Guy Ritchie definetly came up with the best he can do - British gangster movie. The humor, the action, the plot - everything is there as well as trying to catch up with the trends and culture of the modern UK. The good aftertaste is also there as you are leaving the cinema.",
            "review_date": "2020-02-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie, great Guy Ritchie comeback. All you expect to see in criminal genre story is here. The plot is simple and stunning, the acting is amazing, style is perfect and ost is strong, each song and melody.",
            "review_date": "2020-02-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was an excellent film. As is the case so often, the users are a better judge than the critics. If I didn't know it was Guy Ritchie's film I would have thought it was directed by Tarentino. Hillarious in spots, thrilling, kept yourThis was an excellent film. As is the case so often, the users are a better judge than the critics. If I didn't know it was Guy Ritchie's film I would have thought it was directed by Tarentino. Hillarious in spots, thrilling, kept your interest throughout, and a very satisfying ending. Those track suits were funny as hell. Lots of dry humor sprinkled throughout. No complaints whatsoever. As for some of the critics, what lamebrains. Rex Reed, well, that old queen should retire. He must have some sort of grudge against Ritchie. A zero??!! That just skews the rating. If you didn't care for it, ok fine. Give it a 4 or a 5. But a Zero!!? Ridiculous. Throw that guy off the team. Anyway, go see it. I'm giving this a 9 to make up for some of the dopes.",
            "review_date": "2020-02-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In The Gentlemen, Mickey Pearce (Matthew McConaughey), the head of a large British marijuana ring, is planning to retire and sell off his business. However, things go awry when his empire is threatened. This was a fun film.This is directedIn The Gentlemen, Mickey Pearce (Matthew McConaughey), the head of a large British marijuana ring, is planning to retire and sell off his business. However, things go awry when his empire is threatened. This was a fun film.This is directed and written by Guy Ritchie, and like his Lock Stock and Two Smoking Barrels and, I believe, some of his other crime films (I haven't seen the rest) it relies on a lot of characters and twists-and-turns. What results is a good helping interesting moving parts, dialogue, and performances from great actors.The script isn't quite as tight as LS&TSB. The movie could've been a bit shorter. The character of a tabloid editor played by Eddie Marsan could've been cut without effecting anything. I also felt the last scene missed a bit of a punch.The previous criticisms are more nitpicks than major issues. Overall, this movie is a good time and I recommend it. It's not something you need to see immediately but should be given a shot.",
            "review_date": "2020-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a fun gangster movie full of twists and turns. Hugh Grant is so good as the slimy reporter. For me this is a one and done. Not much replay value this. This is all about the fun reveals. This takes me back to when movies are just funThis is a fun gangster movie full of twists and turns. Hugh Grant is so good as the slimy reporter. For me this is a one and done. Not much replay value this. This is all about the fun reveals. This takes me back to when movies are just fun and not preachy.",
            "review_date": "2021-01-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Guy Richie is back, great movie. Matthew Mcconaughey is perfect for this role.",
            "review_date": "2020-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Such a clever screenplay and acting, this one is a must-see for Guy Ritchie fans and casual cinema-goers.",
            "review_date": "2020-02-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Guy Ritchie is basically back. The Gentlemen brings back the British mob in the most fun yet violent way possible. This movie has a lot of twist and turns so don't be messing around on your phone or you will miss something. Charlie HunnamGuy Ritchie is basically back. The Gentlemen brings back the British mob in the most fun yet violent way possible. This movie has a lot of twist and turns so don't be messing around on your phone or you will miss something. Charlie Hunnam actually is great in this film which has been something I haven't ever been able to say. Maybe we should keep him with his accent from now on. While Mathew McConaughey is wonderful as a brutal mob boss he kept me wanting more. Hugh Grant was without my favorite character he kept you guessing what he was up to the entire movie making you want more and more. I loved this movie from the dialog to the twisty plot and believe it is a must rent of this year to say the least. I personally will be adding The Gentlemen to my blu-ray collection without hesitation.",
            "review_date": "2020-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Guy Ritchie is back. Haven't felt like this after watching one of his films since Lock, Stock, and Two Smoking Barrels, Snatch & Rock n Rolla. And the cast was absolutely perfect. Especially loved Farrell's performance.",
            "review_date": "2021-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wasn't sure what to expect from this one.  But the ensemble cast is perfect for the movie.  One of Ritchie's movies that I highly recommend.",
            "review_date": "2020-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie. A lot of emotions. I have watched it on one breath. Recommend.",
            "review_date": "2020-04-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Why do I love the whole Cockney gangster thing? While this movie may lack some of the stylistic choices of Lock Stock and Snatch, it's a great story with a fantastic performance by Matthew McConaughey and Hugh Grant is almost unrecognizable.Why do I love the whole Cockney gangster thing? While this movie may lack some of the stylistic choices of Lock Stock and Snatch, it's a great story with a fantastic performance by Matthew McConaughey and Hugh Grant is almost unrecognizable.  Had a lot of fun here",
            "review_date": "2020-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was rather slow. However it was intelligent, and the acting was excellent!!",
            "review_date": "2020-02-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolutely a great and funny movie. Guy Ritchie magnificent as always, and he proved again that he knows how to film a decent story with multiple novels inside connected to each other. Brilliant humor in brilliant dialogues.One of the fewAbsolutely a great and funny movie. Guy Ritchie magnificent as always, and he proved again that he knows how to film a decent story with multiple novels inside connected to each other. Brilliant humor in brilliant dialogues.One of the few movies that I want to see again in the cinema.",
            "review_date": "2020-02-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a great movie, I woul say even the best one from Guy Ritchie. It was impossible to disctract from the screen! Such a great humour, interesting angles, gorgeous actors and fascinating plot! I can understand that someone may not likeThis is a great movie, I woul say even the best one from Guy Ritchie. It was impossible to disctract from the screen! Such a great humour, interesting angles, gorgeous actors and fascinating plot! I can understand that someone may not like Guy Ritchie's style, but it is impossible  not seeing his rare talent. It is just about taste. I don't like Marvelmovies, because they are too obvious for me, but I don't call them \"sheet\".For those who say that he romanticize crime, I have just one question : Really? Who doesn't?! Maybe Marvel or DC? Or James Bond? Come one. If your taste is so poor, at least don't let people know about that ",
            "review_date": "2020-02-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This feels like snatch but with better cinematography. The performances are phenomenal, with Hugh Grant in particular standing out amongst the rest. With an easy-to-follow plot, great performances, and a clean, polished look to it, this couldThis feels like snatch but with better cinematography. The performances are phenomenal, with Hugh Grant in particular standing out amongst the rest. With an easy-to-follow plot, great performances, and a clean, polished look to it, this could go down as one of Guy Ritchie's best.",
            "review_date": "2021-01-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For once I agree with the critics. Snatch and Lock, Stock(and the rest) were incredibly entertaining movies with both brutal action and hilarious comedy. The Gentlemen is pretentious, predictable, completely unoriginal but worst of allFor once I agree with the critics. Snatch and Lock, Stock(and the rest) were incredibly entertaining movies with both brutal action and hilarious comedy. The Gentlemen is pretentious, predictable, completely unoriginal but worst of all incredibly boring. Good cast, but the acting was adequate at best. Grant stood out simply because his character of a sleazy cuck was very believable, I wonder why. Farrell did decent job as well, his character was the only one bordering on interesting. No iconic characters that will be remembered years from now though. I am glad i didnt watch this in a theater because I would walk out, took me a day to finish this in between watching something more interesting and even still i think it was a waste of time.",
            "review_date": "2020-03-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'd only consider myself a casual Guy Ritchie fan, having enjoyed some of his previous British crime films, such as 'Snatch' and 'Lock, Stock and Two Smoking Barrels' just fine. The cast and premise of this film were enough to intrigue me toI'd only consider myself a casual Guy Ritchie fan, having enjoyed some of his previous British crime films, such as 'Snatch' and 'Lock, Stock and Two Smoking Barrels' just fine. The cast and premise of this film were enough to intrigue me to give this latest outing of his a go. Matthew McConaughey plays an American-born drug lord residing in England, who plans to retire and sell off his business. However, it doesn't go so simply, as he's marked for death by many hitmen and criminals who want in on his fortune and position of power, which in turn, involves various other criminals throughout England. The cast is easily the best thing about this film! McConaughey gives an always reliably charismatic lead performance, along with some rather humorous supporting turns from Charlie Hunnam, Colin Farrell, and Hugh Grant to name a few. The action and fights are quite fun to watch, and there are some funny moments to be had. However, story-wise, it came up a bit short for me. Things get a little overly convoluted and the movie dragged itself out a little longer than I would've liked. The film took its time with a couple plot points longer than necessary too in my eyes. Overall, it's a welcome return to form for Guy Ritchie, as he's mainly been focusing on big budget fare like 'King Arthur' and the live-action 'Aladdin' as of late, and there's some funny lines and moments throughout, but the story's a little too convoluted and dragged out for its own good that it didn't quite justify the handful of moments I did enjoy. I anticipate those who are bigger fans of Ritchie's British crime films will enjoy it a little more than I did.",
            "review_date": "2020-01-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Horrible ending. Every main character had immense amounts of plot armour. It was okay up till the ending then got increasingly worse.",
            "review_date": "2020-12-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Typical Guy Ritchie movie. Love it! A couple things were unfinished, for example who was that uncle of Dry Eye or why exactly that pistol was presented but I definitely was enjoying the movie.",
            "review_date": "2020-02-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An organized crime comedy with many well-known actors, some clever dialogue, and a few surprises, but with a plot that often limped along noticeably. Not a lot of wit and originality but satisfying enough for a January movie when the weatherAn organized crime comedy with many well-known actors, some clever dialogue, and a few surprises, but with a plot that often limped along noticeably. Not a lot of wit and originality but satisfying enough for a January movie when the weather is gloomy and the holidays are over. I don’t mean this as sarcastically as it sounds, but you can do a lot worse in January if you’ve seen all the films nominated for various awards.",
            "review_date": "2020-01-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie is perfectly fine, don't listen to the so called critics, yet some parts of the movie is a little bit too dramatic to be believeabke, so the movie is getting an eight for me.",
            "review_date": "2020-02-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great storytelling, great performances, great colors, great music. It was a great experience for me. Don't to those '0' point guys.",
            "review_date": "2020-04-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI didn’t realize how sick I have become of Matthew McConaughey.  The movie was boring. McConaughey’s character revealed a familiar smarter than anyone else in the room trait, that he tends to gravitate toward, in his roles. I have to admit, that I was disappointed, when the character he portrayed, wasn’t killed during the attempt on his life, at the start of the movie. Hugh Grant must be really struggling to have accepted that role in that movie, my has his career taken a nose drive.  I would rate this only slightly better than “Beach Bum” another recent Movie he released.",
            "review_date": "2020-01-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Some good acting but lots of unnecessary nasty language which the perverts in the audience liked.  matthew mcconaughey gave a pathetic performance and should go back to making car commercials which is what he is best at doing.",
            "review_date": "2020-02-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Strange racist overtones that didn't serve any purpose.  Black C@#$, Chinaman, Pound of Flesh, it was off putting.",
            "review_date": "2020-03-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Within one movie I broke my 2 and only New Year's resolutions: 1) I will not go to a movie just for the sake of going to a movie especially if I know I won't like it and 2) I will walk out of a movie that I don't like! Yes, I like MathewWithin one movie I broke my 2 and only New Year's resolutions: 1) I will not go to a movie just for the sake of going to a movie especially if I know I won't like it and 2) I will walk out of a movie that I don't like! Yes, I like Mathew McConaughey, Hugh Grant, Charlie Hunnam, Colin Farrell, Jeremy Strong and since \"Crazy Rich Asians\" Henry Golding but nothing could save this movie.At first, it was interesting seeing Grant playing against type but 15 minutes in his heavy put on English accent (Yes, I know he is English but never like this) so I was glad he was working with/against Charlie Hunnam but that wasn't enough.I am not a fan of Guy Ritchie and believe I have seen only one of his movies but his having directed, produced and written the screenplay for this movie I have no desire to see them or anymore by him.  This is an old type gangster movie with a few twists and turns, a lot of violence, racial comments against Asians, throw in some anti-Semitism along with homophobic darts not to forget the f, the many c words plus pig porn and blood and more blood and then some more blood!The theatre was full and a few people laughed at some of the lines but I broke my 2 and only New Year's resolutions!",
            "review_date": "2020-01-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Boring! Kind of forgot where I was and what I was watching about 40 mins in. The movie attempts to come off like Oceans 11 or something of that nature but ends up seeming like a long-form Lincoln commercial.",
            "review_date": "2020-02-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Horrible. I walked out. Hard to follow, dumb plot. Weak and annoying storyline.",
            "review_date": "2020-02-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If, as Rex Reed writes, \"It was written with empty-headed desperation and directed with minimal imagination by Guy Ritchie,\" then why is it so much damned fun?",
            "review_date": "2020-08-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great film, perfect balance of humour and violence. Hugh Grant is astounding, didn’t realise the guy could actually ac! As usual, ignore the politically correct snow flake critics. This is a brutally brilliant British thriller comedy.",
            "review_date": "2020-09-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Classic getting Ritchie, great to see him return to form.  Well layered gangster flicks is where he really shines.",
            "review_date": "2020-03-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A simple yet entertaining ganster movie directed by Guy Ritchie. Good dialogues, many of those actually funny, the plot is pretty simple yet not overly predictable. The acting is good and the cast obviously had a great time shooting this.A simple yet entertaining ganster movie directed by Guy Ritchie. Good dialogues, many of those actually funny, the plot is pretty simple yet not overly predictable. The acting is good and the cast obviously had a great time shooting this. Grant, Mc Conaughey, Farrell and Hunnam all performed beautifully.While this movie may not be innovative, it's thoroughly entertaining and that's good enough for me.",
            "review_date": "2020-07-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Guy Ritchie is back in town, **** All the cocaine-paced scenes with great actors and a good old chaotic story.",
            "review_date": "2020-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ignore the critics. If you like Lock Stock... and Snatch, you’ll love this. Simple. If you didn’t, well, you probably hate it!",
            "review_date": "2020-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I very much enjoyed this flic. After a night of pulling hairs over the state of the planet, this gave me a couple hours of relief. Much appreciated.",
            "review_date": "2020-06-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A slick, stylish, snappy return to form for Guy Ritchie.The ensemble cast fires on all cylinders with stand out performances by Hunnam and Farrell.If you like Ritchie's earlier and grittier work, you'll like this",
            "review_date": "2020-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "“You really can't unsee it once you've seen it.” Guy Ritchie returns to his gangster roots in the underbelly of jolly good England. It’s crazy to think that this is the same guy who brought us last years ‘Aladdin.’ But this time Ritchie isn’t“You really can't unsee it once you've seen it.” Guy Ritchie returns to his gangster roots in the underbelly of jolly good England. It’s crazy to think that this is the same guy who brought us last years ‘Aladdin.’ But this time Ritchie isn’t on a leash.I honestly didn’t expect to enjoy ‘The Gentleman’ as much as I did. A little muddle and sometimes confusing to follow, but the movie has a certain sharpness to it that kept me interested throughout. It’s more in vein with ‘Lock Shock’ and ‘Snatch’. Ritchie has made a successful career being influenced by the work of Quentin Tarantino, hence his given title “British Tarantino”. The cast are all having an absolute blast with the material and I can tell everyone wants to be there. Hugh Grant is my personal favorite out of the cast and it’s great to see his enthusiasm in acting again. He plays Fletcher, a gay detective who documents the events in the story into a screenplay he’s writing, so in a way it’s told from his perspective. While debatable if everything in the movie was made up or not, cause “every movie needs a bit of action”. The thing I love about Grants performance is that he isn’t playing \"typical Hugh Grant\", but an actual character. Although I thought the running gag of him being openly gay and constantly makes flirty hints towards other male characters got old and awkward after awhile. A joke that out stay’s it’s welcome...kinda like Fletcher.I’m not a big fan of Charlie Hunnam as an actor, as I usually find him bland in everything I’ve seen him so far. However I thought Hunnam delivered a solid performance in this movie and might be his best. He plays Ray, Mickey’s (McConaughey) right hand man who is professional when it comes to business despite the countless idiots in his path. Imagine Russell Bufalino from ‘The Irishman’, but more physical and incredibly British. His comedic timing was pretty good as well that maybe if you give him the right material and character, he’s a better actor than I thought.Colin Farrell was terrific as Coach and my second favorite out of the cast. He’s ridiculously cool and shows who’s boss, but also display’s some comedic chops. Matthew McConaughey was chilled as Mickey, who is the weed Lord of England that likes things in green, which is money and marijuana. Out of all the colorful characters in the movie, I thought Mickey was the least interesting if I have to be honest. Either because of McConaughey's chilled nature or the less exciting material given to his character. The style and overall tone of the movie made the whole experience so fun to watch. Everything about the movie is quick. The dialogue is snappy and there’s plenty of clever banter between characters. It’s incredibly clear that Guy Richie loves cinema whenever he’s not held back like some of his previous projects and gets to freely express his passion behind the craft. The humor and jokes ain't for the faint of heart, but luckily I’m not that soft. Some of jokes didn’t quite land the mark and often times left me puzzled in terms of waiting for the punchline. Overall rating: A disjointed, but entertaining movie. Misleading title though. There’s plenty of man, but not so much on gentle.",
            "review_date": "2020-02-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great role for Matthew to play & perhaps the best acting job by Hugh Grant I've ever seen. Very entertaining film of which all I have discussed it with have given it a thumbs up.",
            "review_date": "2020-02-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An enjoyable movie with the same gangster humor as Snatch & Lock Stock 2 smoking barrels. Might not quite be as good as those but definitely hits a lot of beats.",
            "review_date": "2020-07-06",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 143
}