{
  "title": "The Last Days of American Crime",
  "rating": 2.1,
  "release_date": "2020-06-05",
  "summary": "As a final response to terrorism and crime, the U.S. government plans to broadcast a signal making it impossible for anyone to knowingly commit unlawful acts. Graham Bricke (Edgar Ramírez), a career criminal who was never able to hit the big score, teams up with famous gangster progeny Kevin Cash (Michael C. Pitt), and black market hackerAs a final response to terrorism and crime, the U.S. government plans to broadcast a signal making it impossible for anyone to knowingly commit unlawful acts. Graham Bricke (Edgar Ramírez), a career criminal who was never able to hit the big score, teams up with famous gangster progeny Kevin Cash (Michael C. Pitt), and black market hacker Shelby Dupree (Anna Brewster), to commit the heist of the century and the last crime in American history before the signal goes off.… Expand",
  "critic_reviews": [
    "In its final hour, The Last Days Of American Crime finally gets down to the business of its big heist, revealing both the propulsive entertainment value the filmmakers have been inexplicably stalling and the thinness of the whole enterprise.",
    "Even without the content of 2020 making the film feel even more unpalatable, Netflix's The Last Days of American Crime is a distractingly dull dystopian thriller with drab (and/or extraneous) characters and a squandered premise.",
    "The Last Days Of American Crime takes a potentially entertaining, if silly, premise and drains it of any reason to get invested. You can just imagine a John Carpenter would have doubled the thrills in half the time.",
    "A poorly imagined crime flick that comes nowhere near justifying its 2.5-hour running time.",
    "The caper is routine, the twists don’t — twist. “American Crime” just lies there, a corpse awaiting reanimation that never comes.",
    "It’s an offensive eyesore in which looting and anarchy are treated as window dressing, law and order come in the form of mind control, and police brutality is so pervasive as to warrant a trigger warning.",
    "A braindead slog that shambles forward like the zombified husk of the heist movie it wants to be, The Last Days of American Crime is a death march of clichés that offers nothing to look at and even less to consider.",
    "The only crime here is cinematic. It’s not often one sees a film as vile, ugly, and deeply incompetent as Olivier Megaton’s The Last Days of American Crime.",
    "The idea of putting these images out there at this very moment, and pimping it out as “entertainment” is, frankly, nauseating. It goes from being a crime against an art form to something a little more toxic. No. Nope. Nuh-uh. Netflix, what the hell were you thinking?",
    "Even if it had been released at a less tense and tender time, this thing would go down like an oversized flaming lead balloon.",
    "From top to bottom, The Last Days of American Crime is a lumbering referential malfunction. Nothing about it works; everything about it is offensive.",
    "\"I need something bad and fast,” criminal Graham Bricke says to a weapons dealer early in The Last Days of American Crime. The Netflix action film definitely fulfills one of those criteria: It is so, so bad — but it is ever eye-gougingly slow."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Jumbled storyline, leaving viewer to try & piece together what writers and directors should have presented.",
      "review_date": "2020-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Is the film a masterpiece? No. Does it go on longer than it should? Definitely. Does it deserve the amount of hate it's getting. Absolutely not. From what I can gather, a majority of the reviews who are hating this film, is those who can'tIs the film a masterpiece? No. Does it go on longer than it should? Definitely. Does it deserve the amount of hate it's getting. Absolutely not. From what I can gather, a majority of the reviews who are hating this film, is those who can't seem to dissociate reality from fiction. Specifically, due to last years \"fiery, but mostly peaceful protests\" and correlating the film with police brutality. One review stating: This movie is the perfect escapism for fascists & roid-heads. If you have time to kill, give it a watch and form your own opinion.",
      "review_date": "2021-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the most cliche and boring movies out there. There is so little really going on and you've heard the dialogue a thousand times over. With so many good movies out there, this is not worth the watch. The themes and backgroundThis is one of the most cliche and boring movies out there. There is so little really going on and you've heard the dialogue a thousand times over. With so many good movies out there, this is not worth the watch. The themes and background drop is quite great most likely due to this being an adaptation of a comic book. But the movie deals with all the boring aspects. Very mediocre.",
      "review_date": "2020-06-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "To be honest there is nothing good at all to say about this film. Maybe the original idea from the comic is good but how they came to run it is just sad so sad. My only thought while watching (could not end it) was what producers andTo be honest there is nothing good at all to say about this film. Maybe the original idea from the comic is good but how they came to run it is just sad so sad. My only thought while watching (could not end it) was what producers and investors would have thought when they saw it and actors while filming... so bad it hurts.",
      "review_date": "2020-06-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is terrible, save your time and watch something else, generic and pointless all around, very boring also a very plain story/plot.I have no idea how someone can even give this more than a 3 perhaps, if you're giving this movie 8 orThe movie is terrible, save your time and watch something else, generic and pointless all around, very boring also a very plain story/plot.I have no idea how someone can even give this more than a 3 perhaps, if you're giving this movie 8 or 9 points you must absolutely have no taste at all.",
      "review_date": "2020-06-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I just made an account in this website to help people save 2.5 hours of their life. This was painful written from start to finish. no twist, nothing.",
      "review_date": "2020-06-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I found the film a fun watch. No this isn't going to be an Oscar award winning movie but, it is a movie you can turn your brain off and watch some action.",
      "review_date": "2020-06-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "if you are one of those sheep who seeks approval of critics before watching a movie and finding it yourself how you like it, you should stay away from it. especially stay away from those self-righteous pricks who claim they will save you blaif you are one of those sheep who seeks approval of critics before watching a movie and finding it yourself how you like it, you should stay away from it. especially stay away from those self-righteous pricks who claim they will save you bla bla hours, they are just lonely and need someone in their boat with them.",
      "review_date": "2020-07-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is pure unadulterated horse **** It's mindless, souless and offers nothing of value and even worse does absolutely nothing with its 2.5 hour runtime. As if it needed a 2.5 hour runtime in the first place",
      "review_date": "2020-06-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really Bad Movie from Netflix. The storyline was terrible, too much unneeded scenes.",
      "review_date": "2020-06-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved the film. It is a gripping, gritty and unflinching action film with great performances. The film is based on a comic book series published over 10 years ago and somewhat predicted today’s reality, government controlling theI loved the film. It is a gripping, gritty and unflinching action film with great performances. The film is based on a comic book series published over 10 years ago and somewhat predicted today’s reality, government controlling the population, police state, and social unrest. But the movie doesn’t make any social statements, it’s just a fun and violent at times action film with great actors. Don’t read the biased and politicized reviews from overly sensitive people who were probably flipping through Instagram while watching. Just enjoy a great movie and classic piece of Netflix content!",
      "review_date": "2020-06-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Had to make an account just to warn viewers to stay away from this drek. It's ugly. It's loud. It's incomprehensible. It's poorly acted, poorly written. Hard to believe it came from Netflix.",
      "review_date": "2020-06-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you see the director's filmography, you will realize why this failed so miserably, but it also makes it clear that Netflix is betting more on garbage to fill out its catalog because of the incessant need of its subscribers for new content,If you see the director's filmography, you will realize why this failed so miserably, but it also makes it clear that Netflix is betting more on garbage to fill out its catalog because of the incessant need of its subscribers for new content, which forces them to saturate their own market with shameful results.The Last Days of American Crime is clearly the most ambitious film of its director and that's also why the whole things got out of his hands.He was completely unable to respond to his own ambition and he and delivered a tedious, confusing and excessively long film that is also poorly filmed and blatantly devoid of intrigue and emotion.I really don't know what he wanted the film to be but what it ended up being it's a pretty lousy product.Not disappointing, because I didn't expect anything from it, but pretty lousy.",
      "review_date": "2020-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "(Mauro Lanari)I don't think Megaton could have improved a 2009 graphic novel already weak of its own. Perhaps he could have divided the 149 minutes into episodes of a TV series, but the result would not have changed much. Impressive in(Mauro Lanari)I don't think Megaton could have improved a 2009 graphic novel already weak of its own. Perhaps he could have divided the 149 minutes into episodes of a TV series, but the result would not have changed much. Impressive in soundtrack the 2011 cover of \"I Wanna Be Your Dog\", fruit of the collaboration between the Russian bands Swanky Tunes & Hard Rock Sofa.",
      "review_date": "2021-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolute waste of time. Do not even try to approach that **** Can't be constructive about sth so low.",
      "review_date": "2020-06-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I took the time to create an account just to review this movie, wasted 2 hours of my life. Really nothing happens, it's boring af. Acting sucks, story sucks. It had potential but they ruined it",
      "review_date": "2020-07-19",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 29,
  "genres": [
    "Action",
    "Adventure",
    "Thriller",
    "Crime"
  ]
}