{
  "title": "Wolfwalkers",
  "rating": 8.7,
  "release_date": "2020-11-13",
  "genre": [
    "Adventure",
    "Fantasy",
    "Animation",
    "Family"
  ],
  "summary": "In a time of superstition and magic, a young apprentice hunter, Robyn Goodfellowe, journeys to Ireland with her father to wipe out the last wolf pack. While exploring the forbidden lands outside the city walls, Robyn befriends a free- spirited girl, Mebh, a member of a mysterious tribe rumored to have the ability to transform into wolves byIn a time of superstition and magic, a young apprentice hunter, Robyn Goodfellowe, journeys to Ireland with her father to wipe out the last wolf pack. While exploring the forbidden lands outside the city walls, Robyn befriends a free- spirited girl, Mebh, a member of a mysterious tribe rumored to have the ability to transform into wolves by night. As they search for Mebh’s missing mother, Robyn uncovers a secret that draws her further into the enchanted world of the wolfwalkers and risks turning into the very thing her father is tasked to destroy.… Expand",
  "critic_reviews": [
    "Kids will be enchanted, adults will be enraptured. It’s somehow light as air yet overwhelming, both ineffable and unforgettable.",
    "The heart, action and sophistication of the artwork make this folk tale the best animated film of the year.",
    "This isn’t just a hand-drawn animated feature. It’s a movie that wants you to know it was made by hand.",
    "Not only is Wolfwalkers easily the best animated film of the year, but a stirring masterwork, as stunningly gorgeous as it’s philosophically profound.",
    "In the decade since “Kells,” it’s not just the technological advances that make Moore’s latest so impressive, but the rapidly changing cultural conversations as well. He brings everything together by borrowing from timeless visual influences, leaving audiences with another stunning artwork for the ages.",
    "The beautifully rendered result proves to be even more than one had hoped for: a visually dazzling, richly imaginative, emotionally resonant production that taps into contemporary concerns while being true to its distant origins.",
    "Every aspect of Wolfwalkers is thoughtfully, beautifully rendered, and the story is full of twists that keep things unpredictable until the finale. It’s one of the most impressive films of the year, and the best animated film of 2020 thus far.",
    "Every detail here, every flourish, has a purpose, whether splashes of red on flower petals, soft edges around dusk-lit trees, or three-panel split screen sequences that read like the pages of illuminated manuscripts brought to life.",
    "Far and away the best animated film of the year so far (one worthy of such hosannas no matter how limited the competition has been), this heartfelt tale of love and loss is the most visually enchanting feature its studio has made thus far, as well as the most poignant.",
    "The only thing that can conquer fear is love, and Wolfwalkers loves its characters, their world, and the stunning beauty of human life. But most of all, it loves the truth that is buried within the myth.",
    "The film is terrific fare for kids. But the underpinnings of its fantastical story lie in tortured Irish history, English imperialism, and the use of religion to rationalize oppression; there’s a hum of yearning for a pre-Christian Hibernia of pagans, Druids and nature worship. Adults will be eager to see where it’s all going to go.",
    "It is the type of stirring entertainment that delivers both the thrill of the moment and the kind of sophisticated ideas that can lead to discussion and even debate long after viewing.",
    "Thematically rich and visually arresting, Wolfwalkers is an enchanting adventure into the very heart of nature, helmed by a classic, robust narrative that tugs at the heartstrings.",
    "So many strands, and when the full tapestry is unfurled, its captivating, beautiful, thrilling, and entrancing patterns are revealed. Wolfwalkers stands proud as a new classic.",
    "Stewart, Wolfwalkers borrows something from werewolf mythology, another thing from Irish history, and more than a few things from the animated fantasies of Hayao Miyazaki and emerges with a dazzling feature that ultimately establishes its own distinct pattern.",
    "Textured in ways that family entertainment is rarely allowed to be and even more visually ambitious that the other Cartoon Saloon films, this is a special movie.",
    "The many lessons that Wolfwalkers has to share, whether they’re about the relationships between children and parents or between people and nature, are ones you can never be too old to learn.",
    "Wolfwalkers deserves a new level of praise for the way it takes previous Cartoon Saloon themes (such as the porous relationship between man and nature) to new heights of artistry.",
    "A vibrant and expressive fantasy, magical and unyoked to realism without pulling any punches about the destructive folly of manifest destiny.",
    "Just like Moore’s previous films The Secret of Kells and Song of the Sea, a consistently mesmerizing Celtic flavor is imbued into the animation, music, and story.",
    "Exciting, thought-provoking and visually striking, it is everything an animation can and should be for viewers young and old.",
    "A treat. With astonishing craft and visual storytelling that howls from the screen, Cartoon Saloon have surely secured their place in the animation hall of fame.",
    "Wolfwalkers is a beautiful movie for fans of animation and families with young children. If you want to ween the little ones off Disney’s overproduced glitz and turn them on to alternative forms of animation and storytelling, Wolfwalkers is a great place to start.",
    "A lovely, satisfying saga, Wolfwalkers has the feel of an instant classic.",
    "The particularly imaginative handling of the shifts between the human and the more ethereal animal incarnations represent the film’s most rewarding aspect.",
    "The storyline’s edges are frayed just enough to give it the gentle distance of a tale recalled though the gauze of myth and memory.",
    "As much a joy as this movie . . . is to behold, its scenario is more than a little overbaked and overdrawn.",
    "This is a charming and thoroughly likable film."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Without a doubt, the best-animated film of 2020. 'Wolfwalkers' doesn't just deliver on the technical side, but with an amazing story with serious political implications. Warm, cruel, dark, but hopeful, this film will make you fall in loveWithout a doubt, the best-animated film of 2020. 'Wolfwalkers' doesn't just deliver on the technical side, but with an amazing story with serious political implications. Warm, cruel, dark, but hopeful, this film will make you fall in love with this studio. Cartoon Saloon has done it again",
      "review_date": "2020-12-13"
    },
    {
      "review_title": null,
      "content": "DAT!...Was feckin brilliant! I've yet to be disappointed in anything Cartoon Saloon has produced, and this is no exception, just exceptional! It's the best thus far for me. Every moment of this was stellar. Not a bit of fat on it.",
      "review_date": "2020-12-16"
    },
    {
      "review_title": null,
      "content": "I really hope this receives the reception and love that it so obviously deserves. The story, voice acting, sound design and ofc the animation are all so distinct and beautiful. My favourite movie of the year so far!!!",
      "review_date": "2020-12-13"
    },
    {
      "review_title": null,
      "content": "It's a masterpiece! I am serious! :)Art style (aesthetics) is top notch!The idea is brilliant and clear.The plot is a bit naïve and could be a little better, but it's good as it is.Also, remember people - WE are the monsters, NOT animals!",
      "review_date": "2020-12-13"
    },
    {
      "review_title": null,
      "content": "Cartoon Saloon strikes again, with what could be their best movie yet. Wolfwalkers isn't just the best animated movie of 2020, but also one of the best movies i've seen in a long time. Phenomenal animation mixed in with great voice acting, aCartoon Saloon strikes again, with what could be their best movie yet. Wolfwalkers isn't just the best animated movie of 2020, but also one of the best movies i've seen in a long time. Phenomenal animation mixed in with great voice acting, a fantastic cast of characters, lots of heart and emotion, and a solid story with powerful themes that'll definitely be talked about long after you've seen the movie, Wolfwalkers is easily an amazing achievement in filmmaking, and it perfectly shows and proves that 2D animation is still alive and strong.",
      "review_date": "2020-11-22"
    },
    {
      "review_title": null,
      "content": "It’s not just one of the best animated films I’ve seen in my life, it’s one of the best films overall and the piece left in this puzzling year.There’s not a single stroke of pencil or brush that does not belong here, in a moving andIt’s not just one of the best animated films I’ve seen in my life, it’s one of the best films overall and the piece left in this puzzling year.There’s not a single stroke of pencil or brush that does not belong here, in a moving and visually incredible masterpiece.",
      "review_date": "2020-12-11"
    },
    {
      "review_title": null,
      "content": "Outstanding! I wish more animations like that one were made. It sounds, it looks, it speaks. You should definitely watch this one.",
      "review_date": "2020-12-13"
    },
    {
      "review_title": null,
      "content": "The biggest surprise of 2020 for me. I was privileged to watch this before it’s released to the general public at the Savannah Film Festival. There’s a lot here to appreciate. The animation is one of them. It’s simplistic but it still looksThe biggest surprise of 2020 for me. I was privileged to watch this before it’s released to the general public at the Savannah Film Festival. There’s a lot here to appreciate. The animation is one of them. It’s simplistic but it still looks incredible. Every character, every building, every tree is different and unique from the next and the way they frame these shots is great. The animation style makes these environments look rich and beautiful. The performances are great too. Each cast meme we did a great job portraying their characters especially Sean Bean and these portrayals made the emotional beats hit much harder and this is all due to the great character development and writing. Every main character has a purpose and an arc they go through like the father realizing that just because something may look dangerous on the outside doesn’t mean they are dangerous on the inside. The story here is simplistic and that’s what I think holds this film from a 9/10 or a 10/10. Elements of the story feel a little basic but that’s okay because it’s not geared towards adults. This was an incredible animated movie and I’m thankful that I got to check it out early. Please watch this when it comes out later this month. It’s probably the best animated film of the year and I don’t see anything else topping it.",
      "review_date": "2020-12-07"
    },
    {
      "review_title": null,
      "content": "BEST anime movie 2020. The voice has a good accent, as if the real timing. The story is a very strong friendship between nature and people / child and parents.",
      "review_date": "2020-12-12"
    },
    {
      "review_title": null,
      "content": "I love it. It definitely is the best-animated film of 2020. It also has such good music. I love AURORA!",
      "review_date": "2020-12-18"
    },
    {
      "review_title": null,
      "content": "A spellbinding masterpiece!Took the kids to see this the other day and it managed to achieve the impossible task of keeping a 4, 6 and 7 year old (and a 43 year old) utterly captivated for the entire experience. Magnificent art work whichA spellbinding masterpiece!Took the kids to see this the other day and it managed to achieve the impossible task of keeping a 4, 6 and 7 year old (and a 43 year old) utterly captivated for the entire experience. Magnificent art work which goes without saying considering the other reviews but the story-line is perfect and never strays from a consistently masterful quality. No matter who you are, no matter how young or old, upbeat or downbeat, you will love this film.",
      "review_date": "2020-12-23"
    },
    {
      "review_title": null,
      "content": "Absolutely incredible and this is coming from someone who usually cannot stand movies the animation is incredible its a beautiful art form the story was beautiful too when I watch movies (when extremely rarely) I start it off after half hourAbsolutely incredible and this is coming from someone who usually cannot stand movies the animation is incredible its a beautiful art form the story was beautiful too when I watch movies (when extremely rarely) I start it off after half hour I'm like meh and skip not with this it really made me feel young again it made me feel alive and like I was the the person in the movie and one more thing like I said I don't really watch any movies this is the first ever time I felt it was needed to rate best animation of 2020!!",
      "review_date": "2020-12-15"
    },
    {
      "review_title": null,
      "content": "After the Oscar nominated success of the brilliant, Irish animated gems The Secret of Kells and Song of the Sea, director Tomm Moore and his animation studio Cartoon Saloon offer yet another treat with Wolfwalkers. As he’d done previously, heAfter the Oscar nominated success of the brilliant, Irish animated gems The Secret of Kells and Song of the Sea, director Tomm Moore and his animation studio Cartoon Saloon offer yet another treat with Wolfwalkers. As he’d done previously, he once again delivers a work of exquisite beauty imbued with magic and folklore. He truly has a wonderful imagination and creativity that can rival anything that Studio Ghibli has to offer and he transports you to another time with stunningly rendered animation and immersive storytelling. Yet another triumph from Moore.",
      "review_date": "2020-12-19"
    },
    {
      "review_title": null,
      "content": "The story may not be special, but it's charming, and the animation is simply outstanding.A great surprise.",
      "review_date": "2020-12-22"
    },
    {
      "review_title": null,
      "content": "I just watched it and its one of the best Movies of my live it come before Princess Mononoke I really loved it, I hope for a second movie",
      "review_date": "2020-12-26"
    },
    {
      "review_title": null,
      "content": "This movie is very creative and imaginary,. The Best movie animated of 2020.",
      "review_date": "2021-01-11"
    },
    {
      "review_title": null,
      "content": "Excellent and beautiful animation. Fantastic graphics. Soothing music. Every moment of our film involved the story. Excellent characterization",
      "review_date": "2020-12-27"
    },
    {
      "review_title": null,
      "content": "I like the style of this animation movie. Also the story was wonderful and lovely. In addition I enjoyed the irish/english accent.",
      "review_date": "2022-01-08"
    },
    {
      "review_title": null,
      "content": "+Superb stylized hand animation like quality+Excellent voice cast and soundtrack+Decent screenplay\n-Slightly shorter runtime could've improved it's pacing a touch\n\nWasn't sure what to expect going in, but this is superior 80's-90s era top+Superb stylized hand animation like quality+Excellent voice cast and soundtrack+Decent screenplay-Slightly shorter runtime could've improved it's pacing a touchWasn't sure what to expect going in, but this is superior 80's-90s era top quality style animation. Very pleasing on the eyes ears and heart.",
      "review_date": "2021-02-14"
    },
    {
      "review_title": null,
      "content": "Really enjoyed watching it. Animation is gorgeous and the characters are fun. Easy to recommend.",
      "review_date": "2021-04-23"
    },
    {
      "review_title": null,
      "content": "If Princess Mononoke put you in orbit, Wolfwalkers will launch you to the Moon. Based on the legends of Irish folklore, it is an epic work of animation that emphasizes the interaction of man with nature, and the importance of protecting it.If Princess Mononoke put you in orbit, Wolfwalkers will launch you to the Moon. Based on the legends of Irish folklore, it is an epic work of animation that emphasizes the interaction of man with nature, and the importance of protecting it. Without forgetting a beautiful sub-story of friendship. This is one of those movies you must see before you die, or you will regret it later.",
      "review_date": "2021-10-03"
    },
    {
      "review_title": null,
      "content": "Absolutely unique traditional animation with interesting characters and universal environmental message. A must watch for parents and children",
      "review_date": "2023-01-09"
    },
    {
      "review_title": null,
      "content": "Wolfwalkers me hace reflexionar sobre lo que se ha convertido no solo las películas animadas en si, sino el cine en general. Muy pocas películas para mi han destacado realmente, y sorprendentemente Wolfwalkers lo ha conseguido, o al menos enWolfwalkers me hace reflexionar sobre lo que se ha convertido no solo las películas animadas en si, sino el cine en general. Muy pocas películas para mi han destacado realmente, y sorprendentemente Wolfwalkers lo ha conseguido, o al menos en su mayoría. Ha conseguido destacar y convertirse en una de mis películas animadas favoritas en mucho tiempo. Increíble historia, hermosos gráficos y personajes super memorables. Me hubiera gustado que contaran un poco mas sobre el pasado de los Wolfwalkers y su origen, pero sigue siendo una película sobresaliente, una película que esta por encima de la media.",
      "review_date": "2021-07-17"
    },
    {
      "review_title": null,
      "content": "Every time I hear someone say \"I wish Hollywood still made 2D-animated films\" I always point them to Cartoon Saloon. While their stories can be simple, the artistic style that Tomm Moore brings to his films are astounding and Wolfwalkers justEvery time I hear someone say \"I wish Hollywood still made 2D-animated films\" I always point them to Cartoon Saloon. While their stories can be simple, the artistic style that Tomm Moore brings to his films are astounding and Wolfwalkers just may be the prettiest animated film I have ever seen. The art style is striking, the character designs are appealing and the first person perspective shots are animated beautifully and absolutely captivating. I can't praise the visuals of this film enough and in my opinion, is enough to warrant even just a cursory look into the movie.As for the plot, much like their other works, is pretty straight forward and doesn't have the emotional punch that we can get from the likes of Pixar's best. But wolfwalkers doesn't need to be a Pixar film and it may actually be to its detriment. Tomm Moores films have been going for more of a fairy tale feel for his films and he executes them in a way that makes the world feel magical rather than just a film with magic in it. Wolfwalkers is no different and the story does read like an old Irish tale. To get into specifics, the story is about two girls from two different worlds (one from a human town and the other living in a magic forest) who meet and become friends. We've seen this plot before, but being familiar does lend itself to the fairy tale aesthetic that the film is going for. The characters are likeable in both their portrayal and in their designs and serves the story that they are trying to tell. In short, the story isn't new and exciting, but it is the way that they tell it and the visuals that they accompany with the story telling that makes it wolfwalkers compelling.",
      "review_date": "2021-07-25"
    },
    {
      "review_title": null,
      "content": "This is yet another beautiful Cartoon Saloon film. A beautiful folklore-ish story/plot with intriguing characters, enchanting animation and some lovely folk music played in the background. What's not to love? the animation isn't neon brightThis is yet another beautiful Cartoon Saloon film. A beautiful folklore-ish story/plot with intriguing characters, enchanting animation and some lovely folk music played in the background. What's not to love? the animation isn't neon bright like some kids films - this is a film both children and adults can enjoy, its not dumbed down or anything, like the other Cartoon Saloon films, its just...lovely. A very enjoyable, sometimes sad but ultimately a great film. I felt it was somehow, somewhat uplifting too. Highly recommended.",
      "review_date": "2022-08-11"
    },
    {
      "review_title": null,
      "content": "When you spend this much time on the animation, you should spend at least as much time on the script. Not so here. An astonishing visual landscape is given the short shrift by a repetitive and imprecise screenplay. The Wolfwalkers are humanWhen you spend this much time on the animation, you should spend at least as much time on the script. Not so here. An astonishing visual landscape is given the short shrift by a repetitive and imprecise screenplay. The Wolfwalkers are human while awake but during sleep they “astral project” themselves into wolves – the entire plot hinges upon the capture of the Queen wolf, but all she had to do to escape was wake up. Stupid. Add to this about three dozens scenes where the villain threatens the main characters with increased servitude – plus shrill voice acting from two teenage leads – and you’ve got yourself a film that looks far better than it actually is.",
      "review_date": "2022-10-10"
    },
    {
      "review_title": null,
      "content": "I wish to get a Slovenian Citizenship after watching this film. Thank you the Republic of Slovenia! Recommend it for sure!",
      "review_date": "2021-11-04"
    },
    {
      "review_title": null,
      "content": "Una muy buena trama, personajes memorables, animación llamativa y una grandiosa banda sonora; es una excelente película animada. ¡TOTALMENTE RECOMENDADA!",
      "review_date": "2021-03-04"
    },
    {
      "review_title": null,
      "content": "Режиссёр явно сочувствует Ирландской Республиканской Армии. Мультфильм интересен именно своей социальной и политической тематикой. Здесь затрагиваются темы оккупации, гражданской войны, классовой борьбы, то как власть при помощи религииРежиссёр явно сочувствует Ирландской Республиканской Армии. Мультфильм интересен именно своей социальной и политической тематикой. Здесь затрагиваются темы оккупации, гражданской войны, классовой борьбы, то как власть при помощи религии оправдывает свои преступления. Мультфильм явно показывает что мирное решение подобных вопросов невозможно. Как всегда всё решается грубой силой, войной. А война это продолжение той же политики просто другими средствами.",
      "review_date": "2021-05-02"
    },
    {
      "review_title": null,
      "content": "I can't really find things i didn't like in the movie..The story is amazing as well as the soundtrack and animation!!This movie is for adults and older kids as one",
      "review_date": "2021-02-14"
    },
    {
      "review_title": null,
      "content": "Just watch it and you'll see why it's so good, you can watch it on kisscartoon.love or apple tv",
      "review_date": "2020-12-23"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nCreate something like this in 2020 is amazing. Amazing music, art style, and story, and everything. I am glad that the end of the story is a happy end.",
      "review_date": "2021-01-07"
    },
    {
      "review_title": null,
      "content": "A amazing animated movie with great symbolism, characters, and music. Also Cartoon Saloon's best animated movie so far.",
      "review_date": "2021-05-01"
    },
    {
      "review_title": null,
      "content": "This film has enchanted me a lot, since its animation is something unique to see and compare with its rivals, such as Disney. Besides the music and the good effects and sounds of the wolves, that you see them with tenderness. I liked theThis film has enchanted me a lot, since its animation is something unique to see and compare with its rivals, such as Disney. Besides the music and the good effects and sounds of the wolves, that you see them with tenderness. I liked the story a lot and for me, there is a message about the fear of the human being to the unknown and magical. If I even saw what the wolves are to blame for attacking them if human beings are ravaging their forest, how this happens in reality. Well, the best thing is that this movie would have won the Oscar, but I prefer that both had a golden statue instead of just one, which took Soul. Thanks to this movie, I fell in love with wolves.",
      "review_date": "2021-08-21"
    },
    {
      "review_title": null,
      "content": "The best word to describe this unique masterpiece:  GLORIOUSTHE BEST ANIMATION MOVIE OF 2020.IT'S A FACT AND THERE IS NO DOUBT ABOUT IT",
      "review_date": "2021-07-06"
    },
    {
      "review_title": null,
      "content": "Wolfwalkers is beautiful in every aspect, characters, story, animation, seriously in everything",
      "review_date": "2022-04-02"
    },
    {
      "review_title": null,
      "content": "Tengo muchas cosas que decir de esta pelicula , primero que nada y lo mas supericial , la animacion , simplemente fabuloso , me encanta como recrearon todo esto al 2D y digo que es lo mas superficial pq la trama y los personajes es lo que masTengo muchas cosas que decir de esta pelicula , primero que nada y lo mas supericial , la animacion , simplemente fabuloso , me encanta como recrearon todo esto al 2D y digo que es lo mas superficial pq la trama y los personajes es lo que mas brilla de esta pelicula",
      "review_date": "2021-11-29"
    },
    {
      "review_title": null,
      "content": "All of this, break my Soul, literally speaking about movies, to become the best animated movie of the 2020.",
      "review_date": "2021-12-13"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIt was the best movie i ever seen!Story have stunned me for all wathing.Best of 2020 and even some modern films!2D graphic looks great.THE MUSIC.THIS MUSIC MAKE ME FALL DOWN FROM MY CHAIR.Like this movie!You will not think about why has you watch it, you will never forget those expirience!Irland fairy tales now life in me heart.",
      "review_date": "2022-06-30"
    },
    {
      "review_title": null,
      "content": "Robyn Goodfellowe is like Ky Kiske, in this essay I will explain why Robyn Goodfellowe of Wolfwalkers is very similar to Ky Kiske from Guilty GearTo start, Robyn and Ky both are blonde ponytail wearing religious prodigies hailing fromRobyn Goodfellowe is like Ky Kiske, in this essay I will explain why Robyn Goodfellowe of Wolfwalkers is very similar to Ky Kiske from Guilty GearTo start, Robyn and Ky both are blonde ponytail wearing religious prodigies hailing from Europe (Robyn from England and Ky from France). They both harbor a hatred to creatures they have been trained to hunt being Wolves for Robyn and Gears for Ky. At the start of their stories they are eager to hunt. However upon meeting a person from the other race (Mebh for Robyn and Dizzy for Ky) they begin to question their once staunch views. This leads to Robyn and Ky both going against the major political powers (the Lord Protector and the Conclave respectively) and becoming a part of the race they hated at the beginning of their story. With them even become close to the people they met with Robyn and Mebh becoming sisters and Ky and Dizzy marrying.",
      "review_date": "2022-09-03"
    },
    {
      "review_title": null,
      "content": "Stunning film. The narrative is treading on similar ground that films such as Princess Mononoke have already explored, but it's rendered with a level of sincerity and visual intentiveness that few films achieve. In particular, the way thatStunning film. The narrative is treading on similar ground that films such as Princess Mononoke have already explored, but it's rendered with a level of sincerity and visual intentiveness that few films achieve. In particular, the way that the loosely-penciled forests are contrasted with the bold, blocky towns-buildings is a highpoint for Cartoon Saloon's artistry. It's also wonderfully acted and richly scored; the remix of \"Running With The Wolves\" has been on my Spotify repeats since I saw the film in theaters.It's criminal that this didn't win Best Animated Feature.",
      "review_date": "2022-09-26"
    },
    {
      "review_title": null,
      "content": "The animation is absolutely fantastic here and the story and characters are very well written.",
      "review_date": "2022-11-24"
    }
  ],
  "num_reviews": 70
}