{
    "rating": 9.4,
    "release_date": "1959-11-16",
    "num_reviews": 230,
    "genres": [
        "French(France)"
    ],
    "summary": "For young Parisian boy Antoine Doinel (Jean-Pierre Léaud), life is one difficult situation after another. Surrounded by inconsiderate adults, including his neglectful parents (Claire Maurier, Albert Remy), Antoine spends his days with his best friend, Rene (Patrick Auffray), trying to plan for a better life. When one of their schemes goes awry, Antoine ends up in trouble with the law, leading to even more conflicts with unsympathetic authority figures.",
    "reviews": [
        {
            "content": "A flawless film about childhood dificulties from Francois Truffaut.",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite simply, one of the greatest works of art of the 20th  century. I will never tire of it. Kudos to Criterion for including two commentary tracks, one in French (with subtitles) from Truffaut's friend since childhood, who was the inspiration for one of the characters.\n\nThe single negative review – mistakenly dated by Rotten Tomatoes as 15 September 2021 – is by Manny Farber in a publication called \"The New Leader\" and was published in the issue dated 22 February 1960.  Farber's article is entitled \"New Low Pressure Films by French Amateurs Start Small and Cold and Stay That Way\".  The magazine's last print edition was in 2006 and it's last online edition in 2010.\n\nDoes this sound open-minded and relative to any of today's readers?\n\nWere it not for this \"review\" the film would take its rightful place as 100% Fresh.",
            "review_date": "2023-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, sad, and frank. Great performances too.",
            "review_date": "2023-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I was unsure at the beginning, I found this film touching and almost documentary-like. You get a real sense of authenticity and I particularly liked the ending.",
            "review_date": "2022-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the ending scene is one of my favorites",
            "review_date": "2022-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A landmark of French cinema, the highly influential The 400 Blows tells the story of Antoine Doinel, a young boy who feels alienated by his seemingly unloving parents, school authorities who have labeled him unfairly (or so he believes), and a society that he is unable to understand. Francois Truffaut's debut film is a powerful examination of disaffected youth, filled with memorable and explosive scenes that never fail to ring true.  While often considered a cornerstone of the French New Wave, Truffaut's film lacks many of the stylistic excesses (no jump cuts!!) of the movement and is content to let the events play out in a more traditional visual style.  The 400 Blows is quality cinema from beginning to end, thanks to Truffaut's restrained direction and the performance of Jean-Pierre Leaud as the young protagonist.",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the defining films of the French New Wave, it is not only film snobs that will be moved by the raw freedom of 'The 400 Blows'.",
            "review_date": "2022-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The 400 Blows\" captures the challenges of being a kid and feeling helpless. This movie feels a lot more honest than many other movies about adolescence. The movie is somewhat bleak at times but it remains fascinating in its story and character portrayals. It is one of those movies that I appreciated more than I enjoyed but it is definitely the type of film that can be discussed forever, and that gives it that timeless feel. Overall, it is a good film that makes many bold statements and is tougher and more honest than a lot of other films in the same genre.",
            "review_date": "2022-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot was original and worthy of a story, but despite the short runtime, it sure dragged on due to the repetitive, predictable, and unenjoyable events. It may be well done artistically in several respects, like the unique opening where the camera circled the Eiffel Tower, but it's not an entertaining, thought provoking, or emotional film. However, some of the main characters had some depth to them, like the dad being a nice chap half the time. Furthermore, the acting was well done, the sets/props/costumes were excellent, there was some nice cinematography and symbolism (e.g. the shots through the bars/fences), the visual effects (e.g. for the spinning ride) were decent, and the soundtrack had some beautiful bits in it. Some cinematography was too handheldy though.",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Antoine running in the wilderness, without music, panoramic presentation, all natural ambient sound, one minute and twenty seconds. For the vast majority of people in this world, freedom exists only on the run, meaning only the complete release of long-repressed emotions, freedom itself is confused and fragile.",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With an extremely long and boring prologue of about an hour, \"The 400 blows\" rewards the viewer's patience with about 20 minutes of the purest cinematographic art. It was not the best of the best as everybody says. 6/10",
            "review_date": "2021-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite possibly the greatest and most influential first film any director has ever made, and a masterpiece to boot! Sure, you can try to point to Citizen Kane, but where CK has pizazz, The 400 Blows has substance. This isn't the story of a narcissistic megalomaniac, told by a narcissistic megalomaniac, this is the work of a true artist, willing to pour his own soul onto the page. Truffaut is certainly in the top 5 greatest of all time.",
            "review_date": "2021-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blobbo not see much point in bigly overrated old movie.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic French slice of life movie about a delinquent kid facing harsh treatments from unsympathetic adults. \n\nThis was a pretty slow burn movie. The first 2/3 was about the kid being a kid: making troubles at school, playing around town, and having childish thoughts. Some parts were pretty funny and relatable. This was where I had an entertaining time with the movie. \n\nHowever, the last part came, and the story became more heartbreaking and sad. It revealed a harsh side where kids were misunderstood and mistreated. \n\nOverall, a pretty entertaining and sad story, although it was a bit slow at times. 7/10",
            "review_date": "2021-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best French films of all time and one of the most memorable movies of all time.",
            "review_date": "2021-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charming adolescence melts together with the sorrow of neglect. A must watch!",
            "review_date": "2021-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a sensation, a sort of fear that every adolescent has, in which school, parents and all of the major authorities combine their strengths to overthrow the adolescent, he who only wanted to affirm himself, who only wanted his little portion of control and, hopefully, freedom.",
            "review_date": "2021-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the film that ushered in so much of what we take for granted in modern film today. It was written, directed and produced by the ground-breaker of the French New Wave: François Truffaut.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film hit me quite hard personally. To summarize it, the film is about a boy who is shifting from childhood to adolescence. Most of the story revolves around Truffaut's chhildhood memories and because of it, the characters are very well-written in a way that audiences can both synphatize and understand them, making 'The 400 Blows' one of the finest films ever made in the history of world cinema.",
            "review_date": "2020-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have always heard of the masterpiece \"The 400 Blows\" but once I checked it out I thought that it was a coming of age film that felt extremely dull. The performances are great, but halfway through I found myself bored at the repetitive nature and the predictable ending. The one thing I did enjoy was the style of the director and the shooting locations were great.",
            "review_date": "2020-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Films are meant to be either profound or entertaining. This is neither, more like paint drying. What a waste of time. One for the film critics.",
            "review_date": "2020-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "François Truffaut's directorial debut and the first installment of Antoine Doinel's life, The 400 Blows is a heartbreaking and heavy handed portrayal of a neglected youth that already seems to contain most of the elements that would later characterize the French New Wave Movement.",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just can't get into these new wave Frenchies. Too incohesive for my taste. And the theme was not helping as a coming of age story in an era that seems so distant and harsh.",
            "review_date": "2020-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seeing this for the first time, it doesn't seem particularly exceptional for large segments, but that's because this film was such an innovator in modern film elements that have since become standard: the unveneered honesty and realism, in this case aimed at troubled adolescence. One of the seminal works of the early French New Wave that is both narratively and visually distinct from its predecessors. (4.5/5)",
            "review_date": "2020-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I definitely watched it once. Mmmmm. I am sure that happened.",
            "review_date": "2020-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartbreaking but intelligent in its naturalism and craft. Sympathetic look at childhood.",
            "review_date": "2020-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "often as grownups, people are overwhelmed by the obscurity and stressfulness of modern life that they tend to forget that childhood is a venture in its own right. no matter how insignificant may they seem, to a child, the little endeavours that he has to face are giants that need to be taken down. this film serves as a memento to the long-forgotten period, or at least the troubles of it. this film is a staggering achievement and is certainly one of my favourite films of all time. It is an essential work of art.",
            "review_date": "2019-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A near-masterpiece of cinema, and very truthful to the harsh conditions and nightmares many have of what their lives could have been.",
            "review_date": "2019-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending still haunts me.",
            "review_date": "2019-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I finally got around and watched this classic, and most of the film I was wondering about the meaning of the title... so if you are interested in that too, here you have it: \"faire les quatre cents coups\", in french means: \"to raise hell\", which makes way more sense. There are already a lot of reviews about this Nouvelle Vague defining film, and cinema lovers will have to watch it no matter what, so the title meaning will be my only contribution. ",
            "review_date": "2019-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb film that deals with burgeoning adolescence and family turmoil. We get a glimpse in the life of Antoine Doinel, an at risk teen whose neglect propels his actions to be his own man. This film is a must see for any youngster who will sympathize with Antoine's plight.",
            "review_date": "2019-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An honest look at childhood without the frills.\n\nThe 400 Blows (1959) is Francois Truffaut's brutally honest and emotionally in tuned take on a coming of age drama with his French New Wave style. Truffaut wrote a devilish clever script full of euphemisms and wit. He brings up his own past with the autobiographical story told through the lens of the young boy Antoine Doinel.\n\nTruffaut's direction is stunning with long panning shots down Parisian streets, extended tracking shots of running down a road, steady close ups, and aerial perspectives alike. Truffaut's use of the camera gives us full view of all the events in The 400 Blows. He makes sure you see each hit against his adolescence. The cruel words, hard strikes, and devastating decisions made herein are fascinating to witness.\n\nLean-Pierre Leaud is remarkable as Antoine Doinel. His youthful rebellion and affectionate despair is very believable for such a young actor. His face reveals an inner sadness and thoughtfulness most actors never achieve after a lifetime of acting, yet Leaud transforms the film into something deeply empathetic. You feel his pain and excitement with each scene and face.\n\nThe supporting cast in The 400 Blows is incredible as it is full of intriguing figures. Patrick Auffay is great as the mischievous friend Rene Bigey. Claire Maurier is fantastic as the disaffected and disheartened mother Mme. Doinel. Similarly, the father M. Doinel is wonderfully portrayed by the amiable and stern Albert Remy. Lastly, the horrifyingly cruel and abysmally serious teacher is excellently executed by Guy Decombie.\n\nLastly, Jean Constantin's score to The 400 Blows is unforgettable. The classical and French  jazz influence is palpable. The sweet melodies start to feel sadder and more depressing as they repeat. The music really makes the finale on the beach all the more hopeless and poignant. I love The 400 Blows' score.\n\nOverall, Truffaut directed a dramatic masterpiece as his directorial debut film. The 400 Blows will stay with me long after I have seen it. I cannot stop thinking about it.",
            "review_date": "2019-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was great.",
            "review_date": "2018-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story of about a young mans life. This story shows a realistic depiction of adolescence. It is honest ,emotional and true the stage of adolescence.",
            "review_date": "2018-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Please, allow me to describe this movie with two overused idioms without blaming me that I use clichés; The 400 Blows is a movie that avoids mawkish melodrama, and has a story that is often imitated, but never duplicated. Because, honestly, I haven't seen any movie in my life that deserves these two phrases more than Les Quarte Centre Coups!\n\nIn his directorial debut, Truffaut gave us a very sympathetic, and beautifully heart-wrenching story of a troubled young boy that you can easily tell that it came out of the legendary filmmaker's heart. I don't say that because this movie is, quite literally, the director's autobiographical story, but because it's impossible to relate to a protagonist such as Antoine Doinel so much like this unless his story is told by someone who really put his heart into this masterwork.\n\nWe see Antoine as a class clown and troublemaker student, then we see him as a thief. He is also a liar, and above all that, his character is very stoic. So it's very clear that this character doesn't ask for sympathy, neither the movie, in its first act, wants us to empathize with and feel for Antoine.\n\nNevertheless, and as I mentioned above, The 400 Blows is, in fact, a very touching and heartbreaking movie, but how it can be so with such a hateful protagonist. Simply, because Truffaut wittily builds sympathy in the audience by displaying both his misdeeds and the reasons he commits them that are also more than enough to justify them. But both the free technique Truffaut used to unfold the movie's plot, and the freewheeling use of the wide-screen frame also added up to the experience, and made the movie exceptionally engaging and relatable.\n\nJean-Pierre Léaud would go on to a major career in films, but in this movie he gave a truly outstanding performance that I think is one of the best child performances I've seen ever! As the bad qualities of Antoine are displayed on screen, it was necessary that the actor who plays this character would be very talented so he can prove that Antoine is actually a poor down-on-his luck kid, and it's his uncaring parents are those who are responsible for making what Antoine is. And Léaud's expressive and honest facial expressions, and genuine and authentic acting were perfectly adequate to convey all that.\n\nHowever, Francois Truffaut did tend to our feelings a little bit at the end of the second act by using a sensitive score and showing some emotional moments that added an extra layer to Antoine's character, which is his sensitivity. But he didn't do that until he really became totally sympathized with Antoine due to the misfortunes he suffered from. That said, I think that could have happened more gradually.\n\nI found the second act a bit hollow, and I think it would have been more captivating if it was richer. But, this very act really grew on me after the movie's final act. I don't want to delve deeper, but there are some similar heart-wrenching moments the two final acts share that became more stronger and meaningful at the third act. In fact, they turned out to be quite disturbing and overwhelming, and made me say; this is how to cause a catharsis in the audience!\n\nThe real major unforgivable issue I have with this movie is how Antoine's mother's feelings for him changed a great deal halfway through the movie. I understand what Truffaut wanted to do with the story, and why he shifted her character like this, but that didn't work for me at all. I think this shift made Gilberte an extremely problematic character instead of serving the plot. Also, I think by doing so, Truffaut had wasted a great chance to make this character more compelling, and therefore, made the plot more complex, considering the vital role Antoine's mom play in his character arc.\n\nThat being said, these flaws can't take away the greatness from this bona fide classic that you can tell it has inspired many filmmakers today. It's also one of, if not the best movie that explored the troubled adolescence. And it, unquestionably, marks one of the most impressive directorial debuts in cinema history!\n\n(8/10)",
            "review_date": "2018-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love these types of movies, the ones that explore the ideas of childhood and what makes a kid change. In this case, its exploring adolescence. One can watch this movie and feel the troubled sides of Antoine Doinel. Its always a shame to see him punished when the adults in his life like his parents and his teachers do some pretty bad things to him as well yet he is the one punished for it. Its brutally honest and heartbreaking but still a sympathetic portrayal of the struggles between childhood and going into adolescence.",
            "review_date": "2018-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 Blows is a tale of a young boy who continues to struggle with life and doing what’s right. He never seems like a kid who has bad intentions, he’s just misguided. This makes the movie difficult to watch because we have to see him continue to face one punishment after the next, instead of just talking about and dealing with his problems. I’m not sure how much of this movie reflects a cultural difference, but I was surprised how the characters handled some of the behavior of these children. And the way that the parents react to their son disappearing was strange. The story goes in circles a bit until it finally reaches the point of an unforgiveable crime, and then they have to take extreme measures to deal with that. I feel like I should have been more emotionally engaged, but the entire movie was not clicking for me. My favorite character was actually the father played by Albert Rémy, because he was more light-hearted and fun. Good child actors are often hard to find, so it was impressive that they cast a number of decent kids for this movie. Jean-Pierre Léaud was not the greatest, but at least you could sense where he was emotionally from one scene to the next. I think The 400 Blows does a good job of telling its story, but it wasn’t a story that I connected with on a personal level, so for me the movie was only OK.",
            "review_date": "2018-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a true masterpiece of French cinema. \"The 400 blows,\" tells a real and a genuinely heartbreaking tale about a young boy growing up a delinquent. with superb acting, excellent writing and direction, this is a rare art film that not only succeeds as being an art film, but also succeeds at telling a moving story that mainstream audiences can enjoy.\n\n4.5/5 stars",
            "review_date": "2018-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you feel like the world is against you as an adolescent, it is a disheartening situation. Often critical roles of power positioned to do what is best for you -is not. Truffaut pierces our hearts with his narrative through Jean-Pierre Lead superb portrayal of a timeless coming of age story.",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The whole thing is beautiful, but the ending is so haunting the image never fades from my mind. Absolutely one of the best movies I've ever seen.",
            "review_date": "2017-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The 400 Blows\", released in 1959 is the story of a young boy trying to belong in the world. The film made me feel sad and heartbroken as the story went on. Throughout the film, I just wanted for the boy to succeed. Every time he had something great happen to him, something bad would follow suit. It is a film that is much truer to life in that it isn't happy go lucky throughout as so many films are. Written by Francois Truffaut and Marcel Moussy, I felt that the script overall was superb. I appreciated the many dynamic contrasts employed in the script with the extreme ups and downs that Antoine experiences, such as having a great night out at the cinema with his family one night and getting into trouble with his parents and school the next day. Directed by Francois Truffaut, I enjoyed that he used shots that took more time. Nowadays, we are so used to quick cuts and scenes that are big and fast, where Truffaut favors long and slow. Edited by Marie-Josephe Yoyotte, I enjoyed the end sequence of Antoine running to the water. I appreciated that the editor stayed on the shots long enough to where we aren't quite sure where Antoine is going or what he's doing. It added a bigger punch to the very final sequence of the film. Henri Decae was the cinematographer of the film and I felt that he did a superb job. I always feel that it's difficult to tell the quality of lighting in a film when the film is in black and white, however, I felt that Decae brought a softness to the film that differed from films of that period of time. Overall, I thoroughly enjoyed it!",
            "review_date": "2017-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An admirable portrait of adolescent angst, and anti-establishment realism. But, whatever you make of its importance to the 'Nouvelle Vague' movement, The 400 Blows is nothing remarkable.",
            "review_date": "2017-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 Blows is Francois Truffaut's masterpiece of character emotions, music, and camera shots of the lovely France in this Arthouse classic",
            "review_date": "2017-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly stunning classic that reminds of us our youth with simplicity and zero schmaltz, brilliantly captivating us with its sympathetic, however flawed protagonist. Very funny, very sad, but overall a brilliant depiction of childhood.",
            "review_date": "2017-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 Blows is one of the best foreign language films I've ever seen, it's beautiful and heartbreaking.",
            "review_date": "2017-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "French drama from 1959 that was to herald the French new wave of cinema.\nShot in black and white and set in Paris it focuses on the young life of a French boy with apparent behavioural problems Antoine Doinel.\nAntoine has difficulties at school and a troubled home life in a poor household living with his adulterous mother and not his actual father.\nAntoine lies, steals and inadvertently sets fire to his house by lighting a candle etc.\nThe only escape Antoine has from his troubled life is perhaps his love of the cinema.\nAntoine eventually ends up in a French Borstal like institution as his parents despair at his behaviour.\nThe film ends as Antoine escapes the institution and runs towards the beach and sea that he has probably never seen.\nThe film is said to be a semi-autobiographical film by the director François Truffaut at the time a young filmmaker. The film marked his debut feature.\nI must admit to some confusion at the plaudits this film has received however on reading about the film I began to observe some merits.\nThe film is well shot despite the grimy black and white image. The Parisian locations are a highlight.\nThe camera movements including the final shot capturing a freeze-frame picture of Antoine's facial expression of 'fear.'",
            "review_date": "2017-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So much childlike energy and personality in a film created by an adult and also have seriousness all around and within the child lead with incredibly believable on-screen experiences and relationships are a few reasons why this film is a classic.",
            "review_date": "2017-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 Blows (1959) explores the 13 year old sensitive rebel Antoine Doinel, who in many ways is director François Truffaut's own alter ego. The film examines the misunderstood Doinel's family life and mischief, and it quickly becomes a blunt, nostalgia-free exploration of adolescence. A key film of the French New Wave movement, The 400 Blows focuses entirely on Doinel - the performance of the young actor playing Doinel carries the film. Doinel's life is a rollercoaster, as is the audience's viewing experience. The film's laugh out loud moments are swiftly followed by tragic reality. Within Doinel's story is an honest examination of Parisian society in the 50s. The film explores the various forms neglect can take particularly powerfully. At the film's end, audiences are brought back to reality with a bump as the impact of the injustice that Doinel experiences really hits. It's uncommonly absorbing. The 400 Blows (1959) is a refreshing film to watch in 2017. It proves that you don't need 100 twists or a fantastical universe to be powerful.",
            "review_date": "2017-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut's first film is a look at a hopeless juvenile delinquent that rings true and stripped of Dickensesque romanticism.",
            "review_date": "2017-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie that tells a heartbreaking story through the eyes of a troubled youth in revolt.",
            "review_date": "2017-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless work of genius. It's been nearly sixty years since this film was originally released, and it feels as though it hasn't aged a day. The low expectation of the incoming generation, the complex parent-child relationships; it all feels so familiar, and yet it was made halfway across the planet by a man who lived a life I haven't in a culture that I'll likely never experience. That's great cinema.\n\nWe understand that Doinel is simply a misguided kid that is acting in direct consequence of the lackluster parenting he's given. That's why so much of what he does frustrates us so. We want to have high hopes for him, but we know that he has to experience the bottom before he can be better. It hurts to watch. That's part of the magic trick that Truffaut brilliantly performs; he puts us in every possible point-of-view to this kid's life. We're his parents, his teachers, his friends, and, most importantly, we're him.\n\nComplicated, rich, natural, and honest. This is a masterpiece. The perfect coming-of-age story.",
            "review_date": "2017-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4/5\n\nThe 400 Blows is a brilliant and honest exploration of a youth that many if not all people are aquainted with in a deep level, showcasing the narrative and formal interests of an unseen aproach at the time to film .",
            "review_date": "2017-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kid has bad luck and gets into lot of troubled adventures.",
            "review_date": "2017-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly funny and entertaining.",
            "review_date": "2016-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 Blows is one of the most realistic and honest coming-of age films in all of cinema.",
            "review_date": "2016-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant cinematography and acting. Emma 8/10. Lucy 9/10.",
            "review_date": "2016-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nakedly based on the childhood of co-writer/director Francois Truffaut, The 400 Blows offers a candid study of a troubled adolescent (Jean-Pierre Leaund). The camera never flinches away from this young man as he acts up in school, cuts class, commits petty larceny, and is utterly failed by his absentee parents (Albert Remy & Claire Maurier). One of the most significant films of the French New Wave, The 400 Blows inspires the viewer to rage, sympathy, dismissal, sadness, passion, repugnance, and confusion. Its raw structure, piercing honesty, and rich complexity are big factors in why it's one of the most studied and revisited movies of its era.",
            "review_date": "2016-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut takes an artistically subject such as the need of freedom and rebellion and gave us a really interesting point of view from the eyes of a child, delivering a heavily compelling drama that always goes far enough.",
            "review_date": "2016-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Flowed continuously and interestingly.",
            "review_date": "2016-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent coming of age drama, adhering to (and inaugurating) the tenets of the French new wave without them being obtrusive.",
            "review_date": "2016-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is marvellously shot and directed, you can feel the easiness though it's still the 50s.",
            "review_date": "2016-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It will make you laugh and it will make you cry.  It makes my visit to Paris even more special.",
            "review_date": "2016-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular look at the troubled upbringing of a young boy in Paris.  His home life is a mess and his parents blame him, which spills over to his school work.  Director FRancois Truffaut creats a mesmerizing world that beautifully progressed the New Wave cinema of the late 1950's.",
            "review_date": "2016-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To not have a mother's love is one of the most heartbreaking things in life.  Antoine Doinel is an example of a kid who, on the surface, has a stable home life - with a roof over his head, a decent school, and parents who look out for him, albeit with them sometimes taking turns as one or another is often out at night.   However, as the movie progresses, we get glimpses of just how difficult the young man's life is - his mother's infidelity, overheard arguments, and their careless comments.  The way Truffaut slowly reveals the details is masterful, which is all the more impressive given this was the director's first film.  \n\nDoinel is played by Jean-Pierre Léaud, who at 15 was taken under the 27-year-old Truffaut's wing as a kindred spirit of sorts, and he turns in a remarkable performance - natural, honest, and highly realistic.  We see him acting out in school, cutting class, and getting into trouble.  Even when he does try to apply himself, reading Balzac, it ends wrong at home, with the candle he's lit in a small shrine of sorts starting a fire, and at school, where out of inspiration he paraphrases Balzac so closely that he gets an F for plagiarism.\n\nThere are many great shots, and the film is beautiful.   The street scenes in Paris.  A swirling centrifugal carnival ride.  The shot from atop a tall building, which follows a school teacher as he leads the kids down the street, only to have groups of two and three of them peeling off along the way to get into mischief.  Little children watching a puppet show, with rows and rows of faces reacting with such natural animation, and unmistakably telling us of their emotions.  The interview with the psychologist, shown from her perspective, as Doinel answers her questions about why he lies and steals in a straightforward manner.  That's a very powerful scene, and one that really ties it all together emotionally.  \n\nThis film will impact you.  Its ending leaves the young man's fate unresolved - just as in life.   He's at a crossroads of sorts.  He may get into further trouble and spiral, becoming a criminal, or he may be saved by a passion for something, as Truffaut himself was with cinema, or by his inner good nature.  We certainly hope for the latter, but can't help but worry.   Put up with by his stepfather but unloved, a nuisance to his mother and deep down unwanted, labeled a bad kid by his teachers and put into the system - these things go deep into his core.  In a non-cloying way, the film explains why some people turn out as they do, and makes us want to be more understanding and kind.",
            "review_date": "2016-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Antoine Doinel: I need some money for lunch, dad. Only 1,000 francs.\nJulien Doinel: Therefore you hope for 500. Therefore you need 300. Here's 100.",
            "review_date": "2016-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This French cinematic classic is a highly engaging film still to this day. What truly sells this masterpiece is the combination of Francois Truffaut's direction and Jean-Pierre Leaud's acting. Together, they lead the audience on a journey through young Antoine's life. Initially you're led to believe that you're simply following a playful, mischievous, end even irritating child through his days in Paris, but then you slowly come to the realization that you're watching a very frightened and alone little boy. The last 30 minutes especially are perhaps some of the most gut-wrenching and beautiful storytelling you'll ever see. In the end, while there are admittedly a few moments that drag, this is an excellent character study and might just be the closest we'll ever get to a Catcher in the Rye movie.",
            "review_date": "2016-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The title of François Truffaut's debut drama film, The 400 Blows, was literally translated from the French idiom, \"Faire les quatre cents coups,\" which means \"to raise hell.\" That it did when, from 1959 to 1960, it won the Cannes Film Festival Award for Best Director, earned an Academy Award Nomination for Best Writing, totaled over 4 million admissions in France, left critics clamoring to have their words of praise heard over the rest, and induced thousands of parents of young adolescents to walk out of the theatre while shaking their heads and vowing to love their children more. \n\nThe hellfire spread by the cratering impact of The 400 Blows mirrors the tale (no, chronicle!) it tells. Presumably set in late 1950's Paris, The 400 Blows follows Antoine Doinel, a creative and tough twelve- or thirteen-year-old boy (played by the equally creative and tough Jean-Pierre Léaud who skipped school and travelled miles to audition for the part) who struggles to conform to the demands of his cold mother Gilberte (Claire Maurier), jocund but pathetic father Julien (Albert Rémy), sourpuss school teacher (Guy Decomble), and every other authority figure he encounters. In mere weeks, he lies, steals, runs away (and even alludes to seeking the company of prostitutes before the film's events), all in an attempt to satiate his physical wants and emotional needs, leaving hellfire in his wake.\n\nBut why? To reach freedom, of course. But as he desperately swipes morsels of freedom time and time again, and (most dramatically) when he finally escapes from bars and stumbles onto the seabed he has dreamed about, when the camera freezes and inspects his face like a detective on a crusted blood stain, Antoine is confused, perhaps a tinge disappointed. He has his freedom, but still not his happiness. Who is to blame? His family, his friends? Society? Himself? Or just terrible luck? If Truffaut were here today, he might drily respond with a smirk on his face, \"All and none of the above,\" because he does not care to explicate how Antoine would escape his unhappiness. This film is a statement about the inevitable desire to escape and seek freedom, but not the inevitability of happiness to follow. Yes, it is about escaping sadness and finding freedom from a dull life, but not about escaping to happiness or finding the freedom to be happy. \n\nThese ideas were clearly relevant to post-World War II France, who had won her freedom but still lacked vitality, excitement, bright and shining energy. Seen in this light, it is no wonder why The 400 Blows \"raised hell.\" \n\nTruffaut channels this sentiment into the lifelessness of Gilberte, who has a home, son, career, and yet still shirks her motherly duties to seek freedom with a secret lover. Truffaut also channels this feeling of empty freedom into Gilberte's foil and husband, Julien, who, too, has a home, son, career, and yet still shirks his fatherly duties to seek freedom with his cars.\n\nThis sense of constraint tinged by morose sadness seeps into every cinematic tendon, ligament, and bone bracing this film. Firstly, the sets underlie this tone throughout: Antoine and his parents are stifled in their almost-hilariously-miniature apartment; too many mischievous children are shunted into the classroom of a restrictive teacher; Antoine finds himself being moved from a cramped jail cell to an even smaller, child-sized jail cell. Even when Antoine finally finds himself at sea in the open air, the camera quickly closes in on his face and excludes the space, much like his dry disappointment closes in on his spirit. \n\nJust as sculptors chisel blank faces of rock to reveal looks of lust or jubilance or perhaps even sly inquisitiveness, the camera, too, masterfully extrudes the raw emotions and ideas about escape and happiness from seemingly bare and sloppily-designed sets. Scenes are often unfocused, the camera bounces and jolts or pans across the screen, and sometimes we follow a single shot for minutes at a time. Why? From the unfocused scenes, Truffaut seems to be quipping, \"This shot, like Antoine's and his mother's and his father's and everyone else's life, is imperfect,\" and as audience members, we have no choice but to accept it. From the bouncing and jolting and rapid panning, we feel (or perhaps, want to feel) hope that things are picking up for Antoine, but just as suddenly as the rocky filming starts, it ends, and so, too, do our hopes of Antoine uncovering the freedom to be happy. From drawn out and aesthetically unpleasing scenes, like the unforgettable tracking shot of Antoine escaping from his prison or the point-of-view shot of Antoine fidgeting to fight the centrifugal force of the round up amusement park ride, we are reminded that escape is rarely the result of a single, well-executed attempt, but a long and arduous process that, just as often as not, ends in no escape at all. \n\nPerhaps what lends to The 400 Blows's thematic development even more than the sets and deliberate camerawork is the genius soundtrack. In the opening credits, as we tour the outskirts of the Eiffel Tower, just close enough to see this lasting mark of artistic expression but not enough to touch it, we hear a bouncy, jazzy score rife with the xylophone, piano, flute, and violin. Soon, however, the melody become more somber, instruments drop out, and we are eventually left with the lone plucking of the violin, the only instrument to have pushed through to the end of the score. Even the violin finally eventually slows, fades and dies out. This line is remarkably foreboding of the rest of the film: Like the violin, Antoine tries to establish his own place beyond the one hastily allotted him by his parents and other authority figures, but ultimately fails and fades. The lone plucking recurs whenever Antoine is alone, when he is arrested, wandering alone at night, and finally, when he reaches the sea, only to realize that despite the freedom, he is still alone.\n\nNow, over sixty years after its release, is The 400 Blows still relevant? If Truffaut had waited until now to debut his first feature-length film, would it still \"raise hell\"? Would it win the Cannes Film Festival Award for Best Director, earn an Academy Award Nomination for Best Writing, total over 5 million admissions in just France (adjusted for population growth), leave critics clamoring to have their words of praise heard over the rest, and induce thousands of parents of young adolescents to walk out of the theatre while shaking their heads and vowing to love their children more? I believe the answer is, \"Yes. Absolutely, yes.\" We have our freedom, our technological escapes from the cruel crusts of life, but does that mean we have our happiness? More than ever, I think that answer is, \"No. Absolutely, no.\"\n\nOver sixty years after its release, The 400 Blows still raises hell. Truffaut seems to be saying, Seek freedom, and you shall learn more than you expected to find, but feel less than you had hoped in your stomach, veins, and mind. These ideas-conveyed by the sets, camerawork, music, characters, and plot-make this cinematic masterpiece more relevant today than ever before.",
            "review_date": "2016-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have watched this movie twice now, and just don't get what all the hubbub is about. Perhaps I just don't care for French New Wave films. I think Godard's Breathless is the most overrate movie of all-time (Apocalypse Now is second).\n\nI do relate, in some ways, to the main character, Antoine. He's not completely lacking in intelligence, but often does stupid shit. I suppose that could apply to many kids out there. Maybe that is the appeal that is to be had in this movie.",
            "review_date": "2016-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a debut feature, this is so self-assured. The pacing is perfect, the camera always where it should be, and, unlike other French New Wave films I've seen, this one seems to care deeply about its protagonist. The confessional scenes at the end are a well-timed and sympathetic payoff. Entertaining, moving, and directed by a flippin' 27 year old!",
            "review_date": "2016-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible movie!  I know the ocean scene had underlining meaning, but it was done painstakingly poorly.",
            "review_date": "2016-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An accurate depiction to portray childhood distress.",
            "review_date": "2016-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first Truffaut. What a beautiful film. Very sad, but also bursting with life and energy and hope.\n\nTechnically it's a masterwork, and the lead child actor is amazing. \n\nLoved the undercurrent of social and political critique, and the celebration of youth. Also really evoked the hypocrisy that often underlies disciplinarian approaches to 'trouble' kids.\n\nFavourite scene was the backgammonsmokingchaosinbed...",
            "review_date": "2016-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classical masterpiece, a deep insight into childhood.",
            "review_date": "2015-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "had to look up what the allusion was in the title.",
            "review_date": "2015-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic film for good reason: the leading child actor is awesome. CDW",
            "review_date": "2015-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Usually considered the first of La Nouvelle Vague, Truffaut's fictionalized \"re-examination\" of his own troubled youth remains a powerful film. It is hard to believe that this movie came out of the 1950's. While it is \"dated\" -- what happens in the film and the way it happens and concludes is very \"current.\" This is a simple and yet complexly masterful film. It is because of this film that I had a hard time actually enjoying the more recent Linklater film, Boyhood. This film manages to explore more about the ways damaged parental relations impact a child's views and expectations of his world. Unforgettable and remarkable.",
            "review_date": "2015-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"This is the most french movie ever!\" I thought to myself while enjoying the scene where father discovers his son smoked cigarettes, and he only tells him \"he would deduce it from his allowance\".\nI actually enjoyed every scene of this beautiful movie - whether we were driven through 50's Paris or running with Antoine to the ocean, to the better future.\nJust watch how standpoint of camera changes - at one point, we are entering the classroom, and in next we see Antoine walking to the seat - as if we were him, or close to him like some colleague in class.\nCertainly the last scene and shot add credibility to the theory that point of view plays pivotal role in the film - that's why I said 'running with Antoine' because we can really feel sand beneath our feet and in the end have him look into our eyes, thus realizing that we are tête-à-tête with Truffaut.\nThat it's why much was said of this poignant movie, because it is authentic - it doesn't exploit sad story risking going pathetic, nor it does become grotesquely humorous in some pretty funny scenes. \nSometimes film is joyful, but mostly is \"sleeping-in-the-printing-house\" hard - just like life.\nBut we are all sometimes given a chance, a hope to run to the better future and only we can decide what to do of it - as Balzac devoted his life to describing whole spectrum of his France, Truffaut devoted his life to show us - but firstly, he needed to start with himself.",
            "review_date": "2015-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It shows a totally honest and touching view of the difficulties of childhood, which might also set a back-firing example on younger viewers. Otherwise, it's a superbly crafted film.",
            "review_date": "2015-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OHHHHHH MAN! Such a film! I really did connect with it. I can relate to a kid who skips school with a friend and goes to the cinema to watch a flick! Such gr8ness. Maybe in my top 10",
            "review_date": "2015-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Equal parts hilarious and melancholy, \"The 400 Blows\" touchingly tells the story of a young man cursed ambivalent parents who's desperate for some sense of self-fulfillment. The societal systems he exists within are eager to brand him a failure, unaware of his inner-potential; the ambiguous ending doesn't allow for an easy answer as to whether or not he'll ever escape them. It's an experience for everyone: the film's layered, self-reflective approach to cinema earns it its critical acclaim, and the moving story earns the audience's wholehearted admiration.",
            "review_date": "2015-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another 'angry young man tales-French style",
            "review_date": "2015-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite being made in 1959, the 50 years has done little to diminish this film's power or relevance. Full review later.",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure I was totally with this film the whole time, meaning, I'm not sure that I totally got this film. I watched it simply because they were discussing it on one of the many podcasts I listen to, and I enjoyed a fair amount of it. But I wasn't sure what everyone was into, until I listened to the conversation about it on the podcast. These two critics got much more out of it then I did, so I can understand the love for it. However, it was a film, for me, that was entertaining and meaningful enough, but I didn't get everything everyone else did.",
            "review_date": "2015-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "im going to say right now that this film is overrated in my opinion but that doesnt mean it isnt good. some of the stuff in here was executed so well that it pains me to give this movie a low score. the atmosphere was great, the acting was great, and i love how truffaut drew inspiration from his life. how ever i was expecting a much darker drama which it tried to do but it came across to me as just your basic 1950's film with a little more to it. i can see why people like it and recomend film buffs see it but i dont consider it one of the best films of all time.",
            "review_date": "2015-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure what the point was",
            "review_date": "2015-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most deeply touching movie ever made. It was my first  François Truffaut movie, I have no words to express this beautiful but hauntingly astonishing filmmaking experience. This is one of those kind of films that will get better and better after more viewing. A timeless masterpiece of French new wave phenomenon.",
            "review_date": "2014-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece in film making! This film is beautifully shot, powerfully written, and well acted! Its the definition of high art film making!\nOne of the biggest recommendations I can give! 10/10",
            "review_date": "2014-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an incredible French New Wave film by one of my favourite directors.",
            "review_date": "2014-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before there was Boyhood, there was Les Quatre Cents Coups.",
            "review_date": "2014-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What was the point? Yes the movie moved along pretty quickly and held my attention throughout, but honestly what was the damn point? The ending in the middle of the storyline seriously is lackluster and stupid and unsatisfying. I mean just because the film is set in beautiful france and shot in black and white doesnt mean its art, its pretentious and annoying. All i got from this movie is that kid was raised in a chaotic household moving around a lot and with little to no supervision that led him to act out constantly until he gets sent to a reform school. Some parts of this I could relate to because I grew up in chaotic household and also acted out a lot but little does that make a movie. Sometimes growing up isnt so nostalgic and wonderful as we like to remember or portray and for its honesty its gets two stars but nothing more than that because its not really a story its just a snippet. I hate french new wave and this is no different.",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the very definition of the French New Wave, Francois Truffaut's touching exploration of teendom is a tender, timeless classic.\nTruffaut's semi-autobiographical film captures the fleeting highs and swooping lows of adolescence in a portrait so perceptive, so achingly honest, you'd have to be made of stone not be moved. Every ounce of Antoine Doinel's frustration, pain and indignation can be felt through all four corners of the frame. It's beautifully scored, immaculately shot, wholeheartedly immersive, and quite simply one of the finest films about misunderstood youth ever made. Magnificent.",
            "review_date": "2014-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 Blows is an honest portrayal of troubled adolescence marred by tonal inconsistencies.",
            "review_date": "2014-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With terrific acting, fantastic character development, great score, beautiful cinematography, superb direction and grounded approach, The 400 Blows is also a deep, moving, very realistic, relevant and entirely compelling and fascinating look at the troubling period of adolescence and it treats that subject as it deserves - seriously and in an unbelievably honest way. It is a wonderful achievement for the director, a movie that is called a classic and masterpiece for a number of good reasons and it is the best film of the year.",
            "review_date": "2014-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well filmed and a realistic feel to the dialogue and story but not much happened in the story as it goes on which made me lose my interest somewhat...it was worth a look though.",
            "review_date": "2014-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'The 400 Blows', Truffaut's debut feature film, marks the beginning of his screen persona, Antoine Doinel; it's one of the most noted films of the French New Wave, and one of the most intriguing stories on adolescence. The most brilliant aspect of it is that it doesn't have a particular agenda, and just lets us witness everything going on in the life of a misunderstood teenager as it is. It's the thoughts and acts most teenagers go through, maybe in different ways. I think, most people would relate to Antoine at some level or the other.\n\nIt's the story of a misunderstood child who faces trouble both at school and home, and tries to escape both these places. He senses neglect at home, and and his taste and talent being ignored or (misunderstood) by the teachers doesn't help either. Lack of affection is the main cause for most mischief and rebellion at that age.\n\nThe background score is mesmerizing, and it really sets the tone of the movie from the beginning credits scene showing us entrancing visuals of Paris - beautiful, innocent, yet rough like the main protagonist. The wide-angle camera is used quite effectively (it's 1959).\n\nThe acting is terrific. It's said that Truffaut auditioned hundreds of teenagers before finalizing on Jean-Pierre Leaud, with whom (he said) he found many similarities of family neglect, talent, mischief and rebellion. Jean-Pierre is incredibly talented and charms us with his acting; the shades of innocence, fear, rebellion and curiosity are portrayed quite adeptly by him. His monologues with the counselor are quite captivating. He goes on to play Antoine Doinel in four other Truffaut movies.\n\nMost memorable scenes from the movie include: The 'Wheel Of Death' scene, which is actually the first scene in the movie that completely fascinates and thrills you. The single shot of the kids on a morning jog with their PE teacher, where they bunk the class by slowly detaching themselves from the main group; it's incredibly amusing. Antoine's sessions with the counselor. And of course, the beautifully-shot open-ended climax scene.\n\n(Note: The film's French title comes from a French idiom \"faire les quatre cents coups\" which means \"to raise hell\", but I can't figure out why they went for the literal translation for the English Title; it doesn't make any sense at all. In short, it's a terrible and misleading English title, and has got nothing to do with the film.)",
            "review_date": "2014-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's farther from mediocre than great when it's around closer to good than really good. It's a French foreign film with an average enjoyment by its storytelling and performances in a different language with typicality of being a great masterpiece.\n\nThe main focus was the word adolescence. It defined how the main wild child was shaped by the way he was treated with harshness and unfairness and rare respect, shaping him up to follow the film's main word of the story. The way he was being treated throughout was just sad to watch. So that's the reason why this foreign film fell short to a 3.5 from a typical, predicted 4. (B)\n\n(Full review coming soon)",
            "review_date": "2014-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Francois Truffaut's moving semi autobiographical coming of age story is beautifully told, acted and directed.",
            "review_date": "2014-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nSo far I have seen only two French New Wave films, and both of them were from Francois Truffaut. The first I have seen was Jules and Jim, which I felt was a bit of a disappointment due to its lack of empathetic characters and lack of drama. The second would be The 400 Blows. I came into this film not knowing how I would feel as my feelings towards the director's works have been like a see-saw, and the hype for this was large but I tried my best not to let that affect my viewing of the film, and wanted to take the film as it is.\n\nThe core element that made this film stand out is its protagonist, Antoine Doinel, as unlike Truffaut's other films, we are given a character that is universally empathetic. The boy goes through problems that are both genuine to reality and also entertainingly dramatic. One can simply look at this as a portrait or representation of children who grew up in a life of crime and rebellion, exploring the emotional and psychological factors that led to it, but the film could also be seen as a time capsule of our own memories and feelings during our youth. Even if our experiences aren't superficially similar to Antoine's, in its core it is the same; who hasn't had any trouble in their school or home life, and who hasn't stolen anything from anybody before? The only thing that is different is how we deal with it, and Antoine's coping is what makes him a unique individual.\n\nTruffaut keeps the film's perspective the eyes of a child, every problem and personality that surrounds the protagonist are seen and felt exactly the same way that our protagonist sees/feels it. Antoine is trapped by the crushing power of the adult figures in his life, even when the intentions from these figures are for his benefit; the audience is still able to relate to our protagonist's feelings. Truffaut isn't encouraging younger people to become more rebellious and go against the strict rules and values of society, he is trying to speak to the already mature adults to let the young people speak about their emotions and problems, instead of always speaking for them, as this sort of attitude is the core reason for their physical and emotional distance. \n\nAntoine Doinel was played by the adorable and charming Jean-Pierre Leaud. Truffaut made a smart choice of having him play the role as he demonstrated that sense of genuineness that a professional actor just couldn't produce. Leaud's performance was all the more convincing due to the fact that I have seen his performances in the films that succeeded this film, \"Antoine and Colette\" and \"Stolen Kisses\". The actor's best scene in the film is clearly the end of the film, accompanied with a wonderful tracking shot, as it felt so authentic to the character's feelings.\n\nThe 400 Blows is a powerful character study, delivering a character and a story that everyone can connect with. There is no doubt that during my next viewing, I would love this more and add it to my list of Great Movies",
            "review_date": "2014-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nSo far I have seen only two French New Wave films, and both of them were from Francois Truffaut. The first I have seen was Jules and Jim, which I felt was a bit of a disappointment due to its lack of empathetic characters and lack of drama. The second would be The 400 Blows. I came into this film not knowing how I would feel as my feelings towards the director's works have been like a see-saw, and the hype for this was large but I tried my best not to let that affect my viewing of the film, and wanted to take the film as it is.\n\nThe core element that made this film stand out is its protagonist, Antoine Doinel, as unlike Truffaut's other films, we are given a character that is universally empathetic. The boy goes through problems that are both genuine to reality and also entertainingly dramatic. One can simply look at this as a portrait or representation of children who grew up in a life of crime and rebellion, exploring the emotional and psychological factors that led to it, but the film could also be seen as a time capsule of our own memories and feelings during our youth. Even if our experiences aren't superficially similar to Antoine's, in its core it is the same; who hasn't had any trouble in their school or home life, and who hasn't stolen anything from anybody before? The only thing that is different is how we deal with it, and Antoine's coping is what makes him a unique individual.\n\nTruffaut keeps the film's perspective the eyes of a child, every problem and personality that surrounds the protagonist are seen and felt exactly the same way that our protagonist sees/feels it. Antoine is trapped by the crushing power of the adult figures in his life, even when the intentions from these figures are for his benefit; the audience is still able to relate to our protagonist's feelings. Truffaut isn't encouraging younger people to become more rebellious and go against the strict rules and values of society, he is trying to speak to the already mature adults to let the young people speak about their emotions and problems, instead of always speaking for them, as this sort of attitude is the core reason for their physical and emotional distance. \n\nAntoine Doinel was played by the adorable and charming Jean-Pierre Leaud. Truffaut made a smart choice of having him play the role as he demonstrated that sense of genuineness that a professional actor just couldn't produce. Leaud's performance was all the more convincing due to the fact that I have seen his performances in the films that succeeded this film, \"Antoine and Colette\" and \"Stolen Kisses\". The actor's best scene in the film is clearly the end of the film, accompanied with a wonderful tracking shot, as it felt so authentic to the character's feelings.\n\nThe 400 Blows is a powerful character study, delivering a character and a story that everyone can connect with. There is no doubt that during my next viewing, I would love this more and add it to my list of Great Movies",
            "review_date": "2014-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fond look back at a delinquent childhood.",
            "review_date": "2014-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Distinguished by its intensity of feeling and freewheeling use of the wide-screen frame, the film ranks among Truffaut's best. A seminal French New Wave film that offers an honest, sympathetic, and wholly heartbreaking observation of adolescence without trite nostalgia. Henri Decae's black and white photography helped Truffaut enormously but what the director himself provides is a sense that though there is no easy answer to the problems of growing up, there is a hope that will never be wholly denied. Truffaut's ode to his childhood is an engrossing watch that is alluring in its simplicity and brilliant in its direction. It flows nicely at its own pace, never allowing melodrama to ruin its realistic and voyeuristic atmosphere. It's a cornerstone of the French New Wave, and one of the greatest movies about childhood, from anywhere, ever. An enduring masterpiece...Truffaut's autobiographical fiction shows an admirable equanimity by depicting the highs and lows of boyhood. A movingly sympathetic and perceptive portrayal about an unwanted rebellious adolescent.\n\nVERDICT: \"Instant Classic\" - [Positively Acclaimed Reaction] Usually I give this rating to a movie that I believe is absolutely outstanding and has little to no flaws in it. Audiences, who haven't seen this film, must see it right now! (Films that are rated 4.5 or 5 stars)",
            "review_date": "2014-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the all-time greats of world cinema....part of the French New Wave, it's absolutely amazing how fresh this film feels even though it's 55yrs old.  I hadn't seen it since film class,but I am so glad I revisited it, such a great story and fascinating film from Master filmmaker Francois Truffaut.  This movie is a MUST for every serious film fan!",
            "review_date": "2014-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Donniel is a charachter we can all relate to. The 400 Blows is certainly one of the best movies of all time.",
            "review_date": "2014-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty awesome movie. Good lesson to not make mistakes as a child in France. I found it a bit predictable, but it was very entertaining and the acting and story were great.",
            "review_date": "2014-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "beautifully written and show diverse facets of the kid. It's very rich and have to say its sad that this came from all the different bad influence!",
            "review_date": "2014-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense and touching story of misunderstood young adolescent brings a heartbreak.. This film has to be observed scene by scene in detail to feel more in the story and the main role, because it's quite hard to understand directly (at least 2 times to watch as I did). No doubt, this is a masterpiece in film, and so one of the best and most remarkable coming-of-age drama film all time.",
            "review_date": "2014-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No matter how many times I see this movie, it never gets old.  This film is a masterpiece.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartfelt film about a troubled boy that is sure to reach out to people emotionally. It it shot very well and has a strong leading performance from Jean-Pierre Leaud.",
            "review_date": "2014-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I've ever seen. A great look at the French New Wave with great characters. I can't get the image of Antoine running out of my head. Beautiful. The ending to....ugh! #4",
            "review_date": "2014-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though it was made/released over 50 years ago, Truffaut's film still resonates and remains a powerfully relevant film. Masterpiece of not only the French New Wave, but far outside of that boundary. A must-see.",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rare five star rating and likely Top-100 inductee for the 900th movie I've seen.",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In scenes such as the amusement park centrifuge sequence, Truffaut doesn't hesitate to stray from the story for moments of poignant emotional detail, and the young Jean-Pierre Léaud, in an intense performance helps convey them astoundingly. The final freeze frame, a portrait of existential angst is one of the most powerful moments in new wave cinema.",
            "review_date": "2014-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah, the magic of Truffault. The French New Wave saw some amazing cinematic spectacles but none as epic as \"The 400 Blows\". It captures childhood innocence like no other movie has ever done. It's a sad, but meaningful picture.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest film about childhood.",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Timeless and true, heartbreakingly sad. Every frame is beautiful and natural.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "classic piece of French cinema from the nouvelle vague this film is a little jewel of creativity and freedom. We are thrilled to follow the story of this rebellious kid who's lack of conformism attracts him all sorts of troubles. A very beautiful film!",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I recently saw this at the Austin Film Society - it is much better with an audience. I then rewatched it from the Criterion Collection with the commentary on. For example, I did not know the freeze frame was the first instance of this technique.",
            "review_date": "2014-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My knowledge of Frances Truffaut's work consisted of his solid performance in Close Encounters of the Third Kind and a few snippets from this film back in college. I liked what I saw back then and seeing as he is one of my heroes' hero(Spielberg), I thought I take a look. Wow, was I an idiot for taking so long to see Truffaut's autobiographical masterpiece. Antoine Doinel is a kid who ends up doing some bad things, minor but still bad enough to land him in hot water with every authoritative figure in his life, including the police. His mom sees him as little more than a burden and is only nice to him when he finds out her secret. His stepfather is a good man, but he doesn't know what to do with Antoine, no one does, little of all Antoine himself. He longs to join the Navy to escape his loveless life, a life in which his room is a bed in the corner of a kitchen that has a bath tub and just happens to also be where the front door is. Harry Potter's room under the stairs is the Presidential Suite at the Waldorf compared to Antoine's situation. Jean-Pierre Leaud gives perhaps the greatest performance by a child actor ever. His expressive face tells you more than his words ever could. With Truffaut's penchant for long takes and natural sound, it's hard not to get sucked into Antoine's world. Once Antoine finally sees what his heart has desired, it is at once beautiful yet terrifying, mysterious and exciting. Unknown. Is that what becoming a teenager is all about? Time to explore some more Frances Truffaut.",
            "review_date": "2014-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "touching on subjects decades ahead of its time.",
            "review_date": "2014-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moving yet unsentimental view of adolescence in all its misery, François Truffaut's semi-autobiographical debut is as emotionally engrossing as it is visually.  A tragic coming-of-age story with slick direction and beautiful cinematography.",
            "review_date": "2013-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often considered the premiere film of The French New Wave, I also feel that Truffaut's debut film has aged even better than later films of the era. Perhaps the reason for this is that the movie is just such an honest portrayal of childhood, that makes us sympathize with Antoine Doinel (inarguably Truffaut's on screen persona) in a truly deft way. Effortlessly able to switch the film's tone from whimsical to harrowing, we as viewers find heartbreak at all the right moments, and it should strike one as sincere whether you've come from a harsh upbringing or not. Featuring poetic use of complex filmmaking (freeze frames, aerial shots), the lovely camera work in this film would be imitated by legions of film makers for decades to come, but none would perfect it in the way this film did. 400 Blows is nothing if not a masterpiece of the highest order.",
            "review_date": "2013-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story of how a boy is formed into a young man - though which kind of man he will become is open to conjecture. Also one of the few films to show the literal and societal grime of Paris. Truffaut's young hero is just the right age to have been conceived in the final months of WWII, but who knows what nationality the mom's lover was on that night? A believable art-house film.",
            "review_date": "2013-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good approach and definitely influential in the art house cinema. But the authentic half biography of François Truffaut has never really turned me in to have empathy with Antoine.",
            "review_date": "2013-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great camerawork. But let's face it. The kid was trouble.",
            "review_date": "2013-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Relentlessly hopeless. Life as seen through the eyes of a powerless child. Both a victim of his surroundings and his own self destructive naivety. A difficult film to watch but worth the emotional exploration, or perhaps reminiscences.",
            "review_date": "2013-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films of all time, Francois Truffaut's \"The 400 Blows\" is the French New Wave director's greatest achievement.  Brilliant.",
            "review_date": "2013-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Goddard is the Nouvelle Vague's \"Experimentalist\", Trauffaut is its \"Storyteller'",
            "review_date": "2013-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is flawless. \nTruffaut creates like a thin layer of magic. There isn't much happening on screen but does it enchant the viewer. \nI found myself in another world, the street of Paris felt so real. \nTrauffaut did such a good job explaining the intricacies of life.\nIt's a movie about so little but in reality it encompasses so much.\nThis movie is tour de force of cinema. A pure work of art.",
            "review_date": "2013-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart wrenching and awesomely french, this film will delight smart viewers",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never wanna be grown up.",
            "review_date": "2013-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest child actors of history.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly great movie and a very moving story. You got to watch it - it's truly just a masterpiece.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and brilliant French film about how difficult adolescence was for Francois Truffaut's preteen alter ego.",
            "review_date": "2013-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feel fearful and powerless when watching this melancholy but still interesting story. Accurate description of an \"unlucky\" childhood. Like the music and lens language",
            "review_date": "2013-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding!\n\nHowever sincere and well-meant some people may be in interfering some else's wayward life and actions, results would most likely still turn out to be disastrous. All of us are intellectually capable in knowing simple \"if's-and-then's\" in life and that we all want to pursue pure and noble intentions; but what each of us needs is to feel genuinely loved and be understood.\n\n Beautiful, heartbreaking film. An essential viewing for people who might know someone who is misunderstood by surrounding people; and for parents as a sort of cautionary tale.",
            "review_date": "2013-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it seems an everlasting movie - masterpiece in all class.",
            "review_date": "2013-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is an astounding depiction of trouble in adolescence. It's a film every teen should see, including Kes among others. Directing and cinematography much ahead of it's time. It's thematically smart and relevant to youth inadequate discipline today.",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "French New Wave's magnum opus, THE 400 BLOWS is director Truffaut's feature debut and my third entry after JULES AND JIM (1962, 9/10) and THE LAST METRO (1980, 8/10), Jean-Pierre Léaud as Antoine Doinel (Truffaut's alter ego), a 12-year-old schoolboy, continuously clashes with his parents and teachers, after a spell of happy-go-lucky mischief with his best buddy René, Antoine is sent to a delinquent center, after a flippant escape and a long shot of his running, the film abruptly climaxes with him reach the seaside, staring straight at the camera and zooming his indeterminate future right into the spectators mindset, which is listed as one of the most influential endings in the film history. \n\nTruffaut's expertness in camera movements is so remarkable and it is beyond the fact that it is only his first film, take the centrifuge ride shots for examination, both rotating ones and stationary ones are novel to commingle together from different angels, a feat can only be amazed. Another much-appreciated long shot is about a gym teacher leading a group of schoolboys jogging on the streets, the sky-roving camera meticulously and jovially captures the process of boys sneaking away from the procession by turns, such a benevolent and ingenious skit, the same can be referred to a little boy's ink-smearing writing scenes, the close-up records the entire happening resolutely, these paragraphs augment a touch of enlightenment and virtue of innocence which resides inside every kid's heart in spite of the story per se is a tale of woe. Antoine's familial life suffices all the negligence and misery that will impair any unsullied soul, it is a tragedy has omnipotent repercussions on everyone, Truffaut and his co-screenwriter Marcel Moussy inject great dedication and patience into Antoine's character, it is for sure the most acute and iconic portrayal of a child ever on the silver screen!\n\nThe grainy texture and vintage monochrome of the film has an immanent allure to film buffs, apart from Léaud, Claire Maurier and Albert Rémy as the mother and stepfather of Antoine, both resemble a kitchen-sink superficiality and lifelike casualness as the rest of the cast, Léaud's naturalistic responses towards fate's rough handling is a boon, it is explicitly emotive and the film has earned its prominence fair and square, a must-see should not be missed by aficionados.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know, I'm late on this one. Better late than never. This was the first film from Francois Truffaut, and one of the earliest films of the French New Wave, the revolutionary mid-century movement in French film led by directors like Truffaut, Jean-Luc Godard, and Alain Resnais. This film is less boldly experimental than Resnais's work, and less coldly intellectual and theoretical than Godard's; it's actually a fairly warm and naturalistic film, and it has aged extremely well. \n\nThere's a story here, but not an easily summarized plot. It's a character study of a troubled fourteen-year-old boy named Antoine (Jean-Pierre Leaud), a nice kid who keeps running into trouble with his parents, teachers, and the police. It was apparently largely based on Truffaut's own youth. Despite the fact that he's almost constantly in trouble, Antoine is a decent kid; many of his problems are the results of misunderstandings. \n\nLeaud is entirely convincing as Antoine, perhaps partially because the character is not all that different than Leaud himself was. Unlike many child actors in older films, he never seems to be acting or putting on a show; there's a constant feeling of total realism to the character. The adults who surround him don't particularly care about him, not even his mother, but they're also not portrayed in an overly villainous way (as were, say, some of the adults in the recent Precious). No one in this movie is especially evil; they all just kind of keep screwing up.\n\nThe style of the film is more straightforward and less self-conscious than some of the later films of the New Wave would be. There are only a few noticeably elaborate shots, and they're well-integrated into the story of the film. I particularly liked the overhead shot of the PE class running around town and constantly losing kids. Truffaut here is never maudlin or sentimental, but he also avoids the coldness and disdain that, say, Godard might have brought to the material. Although the movie was released in 1959, it feels more contemporary than many films from only, say, 10 or 15 years ago. It's a great movie that doesn't feel like it needs to make a point of its own quality.",
            "review_date": "2013-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without doubt, this movie defines the French New Wave, and it also marks the French New Wave as one of the most important events in the history of film. The late François Truffaut managed to capture the hardest points of his childhood and then incorporate it into the character we know as Antoine Doinel. Antoine Doinel is one of the best characters in French cinema you can imagine, he was performed excellently, and in a way, we feel lots of sympathy for someone like him. \"The 400 Blows\" is an excellent film.",
            "review_date": "2013-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aesthetically, The 400 Blows looks like it could have been made yesterday.  The story is challenging, even by today's standards.  People must have been floored upon its release in 1959.  The incredible camera work, direction, and raw acting makes this a rare and special timeless film.",
            "review_date": "2013-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hate to jump on the bandwagon here, but this pioneering entry of the French New Wave is truly a delightful film. It's charm and angst kept me entertained throughout. The camera work and unique editing choices were quite interesting, and the musical score was vibrant and beautiful. I look forward to following Truffaut and Antoine Doinel into further cinematic adventures.",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely wonderful movie centered around the trials and tribulations of a 13 year old delinquent. The characters are excellently written and the acting is great. My first Truffaut movie and I will be looking for more.",
            "review_date": "2013-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The 400 Blows\" is director Francois Truffaut's way of making us sympathize and understand the so-called 'juvenile delinquents.'  It is about a boy named Antoine Doinel who lives with his careless mother and his clueless step-father. The opening scene is key to the film. A picture of a half naked woman is passed throughout the class. When it is handed to Antoine, he looks at it for too long and the teacher notices. We see that he is penalized for something that everyone did just due to luck. Welcome to the life of Antoine Doinel. He carries so much responsibility and pressure which ultimately leads to failing in school. He is a trouble-maker, but Truffaut brilliantly shows that anyone in his situation would be one. After he sees his mother cheating on his step-father, who he has lived with most of his life, he starts a downward spiral into crime. His parents do not really pay any attention to him even though he has a small friendship with his step-father. Although the film appears to be quite depressing, it is highlighted with moments of great comedy and happiness. Especially when Antoine and his friend skip class to go to a carnival. Truffaut always portrays school life with complete truth and realism. Our childhood memories start to come back to us. I really like how Truffaut shows that parents or guardians are extremely significant in a child's success. The actor who plays Antoine Doinel, Pierre Leaud, has got to be the best child actor in history. He does not overact his emotions, but he does make the role his own. I think his acting consists of 40% of the film's success. The screenplay is perfectly constructed. All of the scenes are very important and powerful. They all have an significant place in the film's chronology. The cinematography and editing play a big part in the film especially in the end scene where we see a freeze frame of Antoine smiling on a beach for the first time who has escaped from a detention center. \"The 400 Blows\" demands required viewing with its carefully constructed screenplay, excellent performance by Pierre Leaud, director Francois Truffaut's touching direction, and significant impact.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 Blows is one of the most stunning debuts in the history of cinema, Truffaut shows an amazing attention to detail in his filmmaking, while also writing a screenplay that is as emotionally tragic and insightful as any ever written. The film depicts a boy, Antoine Dionel, who to us, seems like a normal fun loving kid who is actually a little more responsible than most kids, but to everyone around him he is a troublemaker, and headed for a life of crime. However, Antoine just wants to go live his own life and make his own living, he reads Monore de Balzac, he is much more mature than the average child his age. But he feels somewhat alienated, no one around him understands him, and he doesn't understand them, so he wants to be able to make his own decisions. It could be said that Antoine is one of the greatest existential characters in cinema's history. Besides the script though, Truffaut gives this film an artist's touch, crafting a film that has memorable scene after memorable scene, and keeping a close eye on his camera angle, lighting, and mood. Each frame has the exact setting, music, and lighting to evoke the atmosphere of the scene. With all this in mind, I would agree with any who said this is one of the greatest films ever made.",
            "review_date": "2013-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enough has been written and said about the New Wave of French Cinema, but you can't really appreciate it unless you see it for yourself. Enveloped in supreme style and driven by a new found energy and freedom Les Quatre cents coups is quite simply a wonderful film. Truffaut takes us on a journey with Antoine Doinel, who fights in his own way for everything that the French identify with from their youngest days . Whether or not he achieves any of it is up for debate of course, but I marveled in his fervor from the very beginning of the film. The film gives us a look at youth and all its magic, but here it's also contrasted with adulthood and its hardships, which serves as a wonderful contrast. Rene and Antoine, when walking in the streets of Paris at times resembled tiny gangsters making their rounds, while never feeling overwhelmed by the sheer size of the city which is as much a character as them in the city. The black and white color palette gives the film a stylish look and the camera work, while not smooth by any stretch is more in line with the story and the emotion emitted in the film. Recommended for anyone that loves film.",
            "review_date": "2013-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw it and it immediately leaped to the front of the list of my favourite Truffauts. Gorgeous tale of a misunderstood youth and how he tries and tries to deal with life's misfortunes.",
            "review_date": "2013-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While this film was very close to getting four stars, I feel that it is one of far too many \"great\" films that are highly regarded by critics but are really just Freudian sessions between the director and the audience. All of these \"dysfunctional childhood\" pseudo-auto-biopics all start looking the same after a while.",
            "review_date": "2013-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It hasn't sink in yet. So many of us can identify with this \"misunderstood youth\". Definitely deserve multiple watch.",
            "review_date": "2013-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wednesday, May 15, 2013\r\n\r\n(1959) The 400 Blows\r\n(In French with English subtitles)\r\nDRAMA/ NEO-REALISM\r\n\r\nFrançois Truffaut's first cinematic film debut which is something like an autobiography. The movie is completely plot less starring Jean-Pierre Léaud as Antoine Doinel which is basically stating his life as a 12 year old, and how he converses with his step mother and father living mediocre, and then offering an explanation to his actions somewhere toward the end.   Received one Oscar nomination for \"Best Writing, Story and Screenplay - Written Directly for the Screen\". This is also the first of four or five movies François Truffaut made with Jean-Pierre Léaud sometimes reprising his role again and again as Antoine Doinel but to in my opinion the first one will always be the best.\r\n\r\n4 out of 4 stars",
            "review_date": "2013-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully tragic story of a troubled youth in Paris. You want to cry for this boy who is unwanted everywhere he goes, yet the ending is poetically optimistic, esp when you consider the autobiographical nature of this profound piece.",
            "review_date": "2013-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think there's such a thing as a 'perfect film' but this certainly comes as close as anything you'll find. Vibrant with subtleties - you'll see something new with every viewing.",
            "review_date": "2013-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This classic  French, new wave movie, directed by Francois Truffaut, is the best film I've watched in a long while.  Jean Pierre Leaud plays Antoine Doinel, a troubled and misunderstood adolescent who has problems at school, lacks attention at home and gradually spirals into a life of petty crime.  \nI was confused by the title until I learned that it is a straight translation of the French but misses its meaning; the French title refers to the expression \"faire les quatre cents coups\", meaning \"to raise hell\".\nThe striking contrast between the (rare) happy times  Antoine experiences with his parents - (his happiness being almost painful to watch  in light of its rarity), and the ugly scenes where he is berated, neglected, or physically punished are crafted perfectly.  Although the central theme is rather grim, there are wonderful bursts of humour, innocence and adventure throughout The 400 Blows.  \nAntoine is clearly distanced from 'regular', happy children and nowhere is this more apparent than in the scene where he and his best friend, Renee, played by Patrick Auffay, are planning  Antoine's 'running away from home' in a packed auditorium of children watching a Punch & Judy-like show.  As the camera pans around the small children's faces we can see how utterly absorbed they are by the show while Antoine and Renne stand apart from the crowd, only absorbed by the difficult tangle their lives have become.\n\nThe 400 Blows sometimes gives one the feeling that a mere string of unfortunate events are solely to blame for how Antoine's life turns out but his dysfunctional home, defiant nature, yearning for  independence and contempt for authority play a big role too.  This is a beautifully made, intelligent, absorbing movie and I cannot fault it one iota.",
            "review_date": "2013-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very interactive approach in one of the original French New Wave films.  We follow Antoine throughout (he's nearly always on screen) his troubled adolescence into juvenile detention.  Truffaut tells an embarrassing tale at his own expense and that of his parents who were apparently, appropriately mortified by this film.  A must see for ever film fan.  You haven't seen greatness in foreign cinema, or any cinema for that matter, until you've seen Les Quatre cents coups.",
            "review_date": "2013-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful film about a troubled adolescent.",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A harrowing and poignant look into the nature of youth. Absolutely beautiful.",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It will grab you and not let go.",
            "review_date": "2013-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Antoine Doniel is a juvenile delinquent. He disrespects his teachers, lies even when the truth might suit him, deceives his parents, cuts class and is generally a trouble-maker. This is bad enough. What makes him a delinquent is the fact that he defaces school property, commits numerous acts of theft (and not just by sneaking money from his parents) and trespasses. He thumbs his nose at all authority.\n\nBecause Antoine is the hero of Francois Truffaut's semi-autobiographical first film THE 400 BLOWS, we are apparently supposed to forgive all that. After all, he's got the soul of an artist...he lights up when watching movies and perhaps has an insight into them beyond his years. His parents did not show him significant enough amounts of love. So it's okay that he can't follow the simplest rule, or even care to try. He does what feels good to him, regardless of who it inconveniences or hurts.\n\nOn its surface (and below much of the surface too), THE 400 BLOWS is a film with an utterly unlikable central character. I give the kid no credit for being a \"misunderstood artist.\" He's clearly excited by what he reads when he first encounters Balzac, but rather than taking inspiration from the word, he plagiarizes it for a homework assignment. Word for word. So for me, an appreciator of arts and artists...Antoine is a snot-nosed kid who needs a comeuppance.\n\nTHE 400 BLOWS is set in `50s France, and was on the leading edge of the French New Wave in film. I'll readily admit I know little about those films, and the more I read about the socialist ideology of many of its purveyors, the less I care to know. It is all filmed on location, with many fantastic shots of this marvelous city. Paris is as much a character as Antoine's mother or father. The gorgeous black and white exterior shots are a treat. The viewer really gets a sense of being immersed in a primarily lower middle class city. The film is very briskly paced, even as relatively little of real consequence happens. Although the film is primarily a slice-of-life drama, it is full of funny moments, characters and vignettes. I greatly appreciated its breezy tone and the naturalistic filming approach. While it's too self-consciously a movie to have a documentary feel to it...I did appreciate the clearly improvisational nature of many of the scenes.\n\nAnd, while I dislike the central character, I really liked the remarkable young actor Jean-Pierre Leaud who played him. He's got a soulful face, and filmed right on the edge of his teen years, he's got a cherubic affect to go along with his far more mature misbehaviors. I never rooted for the character, per se...but I couldn't help smiling at his many malfeasances, even as he exasperated me. He has an attractive mother who clearly isn't enamored of being a mom (and has a few more secrets I won't spoil), but for much of the film, I also appreciated that he had a gruff but remarkably patient and understanding father. The father clearly understood that Antoine was a source of irrational irritation on the part of his mother, and worked hard to shield the child, even when his own temper was tested. I found his character to be interestingly complex. And he too has some secrets. Other characters, such as the schoolteacher, teeter too close to caricature. Yes, he's an awful teacher. But given what teaching was like in those days, is he deserving of the utter derision Antoine pours on him?\n\nI know for some, THE 400 BLOWS is some sort of testament to either the miseries of being a misunderstood \"artist's soul.\" For others, it's a statement on how too little love can damage a kid. Or the harshness of society, etc. etc. I find any messages like that to be unconvincing and delivered with too heavy a hand. However, the fast pace, gorgeous cinematography, lovely locations, generally solid acting and generous doses of humor to make this a film worth recommending despite my hesitations.\n\nI viewed the Criterion Blu-ray, and must say that the bonus materials are particularly fun. There are numerous interviews over the years with Truffaut...who is a lively subject. And there are some great shots of young Leaud as he auditioned for his role, and during interviews while making the rounds at Cannes. He's an interesting person to learn about. The bonus essay was a bit skimpier than I'm used to with Criterion, but worthwhile nonetheless. Once again, Criterion has done an exceptional job. THE 400 BLOWS is an important movie in film history, and Criterion has given it an appropriate showcase.",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Francois Truffaut really hit the mark with this one. The 400 Blows is probably one of the best movies i've ever seen about youth, growing up and becoming more independent.",
            "review_date": "2013-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Filling in gaps in my Truffaut viewing for Movie Shame Monday, this one was very watchable and engaging, making me keen to follow the later films in the series, as the director revisits the life of the lead, who is a thinly-veiled stand-in for Truffaut himself from what I understand.\n\nDefinitely worth a look.",
            "review_date": "2013-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect in every way.",
            "review_date": "2013-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless coming-of-age film from François Truffaut, The 400 Blows captures the ups and downs of adolescence with an honest voice, humor, and a great deal of sympathy. The 400 Blows is a classic film through and through, and its easily among the best of its genre.",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartbreaking film. The 400 Blows succeeds as an honest film, featuring a perfect script and an outstanding cast.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This French New Wave film directed by Francois Truffaut, more aptly titled The Wild One or Raising Hell, is about a young boy named Antoine. He comes from a working class family and his parents are struggling and frustrated. In school he gets poor grades and his teacher often punishes him. Annoyed with his life, he runs off for a time committing petty crimes and exploring the streets with a friend. That ends when he is caught stealing his father's typewriter. Fed up for the last time his parents send him away to an observation center for boys. After he arrives Antoine escapes and runs to the ocean a sight he has never seen. With that the camera zooms in and we clearly see the face of this troubled, young boy. It is easy to appreciated this film because it does not glamorize the situation but tries to deal with it sensitively. Truffaut made a very good one here reflecting on his own experiences.",
            "review_date": "2013-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Francois Truffaut's directorial debut and great coming-of-age story 'The 400 Blows' stands as one of the best of its sub genre. With a great lead performance and assured direction, Truffaut handles this autobiographical film with remarkable ease and aesthetics. This film about a troubled youth growing up in Paris still stands as one that helped define the New Wave era in France.",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd first heard of the French New Wave many months ago, when I'd first toyed with the idea of becoming a director. At first, I saw no point in watching French movies (I didn't know the language), and reading subtitles for the entire movie wasn't exactly the kind of thing I was looking forward to... but I gave it a chance last weekend. I first started with Breathless, the most famous of the New Wave films, and I was dazzled, but... not impressed. I thought I'd give the New Wave another chance the following day, starting with this movie, The 400 Blows.\nIt was around 10:00 on a Thursday night, my entire family was asleep, and I was studying for the final exam I had the following day. I thought I'd just use the movie as background noise, some pretty french voices to make me feel smarter. At one particular scene (the gravity wheel), I gave up on my studying for the moment, and watched the rest of the movie. Let's just say I failed my final exam on the following day, and cried my eyes out for the remainder of the movie.\nI've never seen a film that's touched me as much as \"The 400 Blows\" has. It's one of those movies that everyone has to see at least once in their lives, and they'll never regret it.",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shockingly good, but overall rather depressing. Excellently made, however.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful story of adolescence.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful story about growing up and about the dreams of a child!",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Psychiatrist: ''Your parents say you're always lying.''\n\nAntoine Doinel: ''Oh, I lie now and then, I suppose. Sometimes I'd tell them the truth and they still wouldn't believe me, so I prefer to lie.''\n\nTroubles with parents. Troubles at school. Troubles being a misunderstood adolescent. What other alternative can one have but to rebel? I think most people can identify with the story, either personally or through knowing someone else who has had similar problems. Truffaut's debut is empathetic and universal, and as I understand it, semi-autobiographical -- it just goes to show how personal experiences, when transferred to celluloid, can be the most impactful. So simple, yet profound. On the technical side of things, I loved the camerawork and the music; both were really beautiful. A great performance by Jean-Pierre Leaud as Antoine Doinel in the lead. And the ending on the beach? Wow! It's one of the very best I've seen yet. ''The 400 Blows'' deserves all its plaudits of being coined one of the greatest films ever made. I found it to be a wonderful work of art. Absolutely loved it. Must not miss.\n\nP.S - I've read both director and actor carried the character into other films, exploring the various stages of his life. I find that really fascinating and ambitious. I'm interested.",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A remarkably sincere tale about a young boy's experiences through both a joyless and loveless existence. Repeatedly chastised by tin-pot authoritarian figures for attempting to extract some feeling of what it is to be a normal, mischievous boy.  Instead, he's left to contend with an adult world that he cannot fit into and rebels by default, until there's no end in sight.",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: 2.5 stars\nArthouse Rating: 3 stars\nI have mixed views on Trufatts \"The 400 Blows\". While the French film has some great eye candy scenes, the story starting feeling repetitive and was like watching a dog chase its tail for 90 minutes. I didn't see anything fascinating about the lead character Antoine, and didn't fall in love with him as many have, but instead found him a pest. The writing was clever, but the plot it created truly wasn't. Didn't find it sad at all, gloomy at most, and it didn't meet my expectations.",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut's masterful piece of New Wave cinema is an unhesitant look at adolescence, sporting no sentimentality or over-dramatic flare. Truffaut's use of space is undeniably clever, and the main characters to follow are an exemplary look at a controlling and disappointed society. Among its most interesting of features is its conflict of generations.",
            "review_date": "2012-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that is watchable but not as great as its made out to be. It moves along at a nice pace but never really gets going. A nice watch but nothing more.",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 blows is a heart wrenching film that manages to stay intriguing and honest throughout. It is slow in some parts and can tend to be dry, but this only adds to the realism. The cinematography and music are also beautiful.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The final sequence is unforgettable. This film is unforgettable. Beautiful. Timeless.",
            "review_date": "2012-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The 400 Blows\" is a groundbreaking piece of film-making that perfectly balances humor and drama. This is the first of Francois Truffaut's films i've seen and i'm definitely looking forward to seeing more of his other work. The film is full of likeable characters and bears a well thought out story that will make you laugh as well as make you think. \"The 400 Blows\" is a film everyone should experience, i highly recommend it.",
            "review_date": "2012-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I forgot how good this movie was.",
            "review_date": "2012-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An artistic look at childhood with an ultra-realistic style and some pretty deep themes.",
            "review_date": "2012-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film about adolescence and the neglect one can face. There's a very dark sadness throughout the film which worsens as it nears the end but it all works perfectly. I want to give it a higher score but I think I'll need to see it a few more times.",
            "review_date": "2012-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The title of the film comes from the French idiom \"faire les quatre cents coups\", meaning \"to raise hell\". It is an unflinching look at a boy quick descent into misdemeanors and petty crime because of negligent and insensitive adults.  Jean-Pierre LÃ©aud is a real tour de force.",
            "review_date": "2012-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie make me cry and ending scene just... [watched since Feb. 2009]",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely heart breaking. Something about this film really hits home. It captures a system blaming a child for a broken system, and parents blaming a child for bad parenting. It's clear that Antoine's problem's won't stop at the end of the movie. Very powerful.",
            "review_date": "2012-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best movie ever made",
            "review_date": "2012-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the film and I get the significance, but I just get bored with the story. It just seems like things happen. That's it. Things happen. Then other things happen. Then one more thing happens.",
            "review_date": "2012-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful glimpse at youthful rebellion and curiosity, and the perils that co-exist with innocent, playful mischief-making. One of the greatest endings in the history of cinema, in my opinion. Antoine Doinel escapes and runs not only for personal freedom, but for his very own idea of paradise. Perfect!",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually compelling and bursting with complex characters, Francois Truffaut's autobiographical drama proves to be a fulfilling study of adolescent hardship.",
            "review_date": "2012-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great french film. Slow and your not sure where it is going but when it gets there you recognize true great story telling and film making.",
            "review_date": "2012-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At twenty seven, Truffaut had already discovered his genius.",
            "review_date": "2012-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without a doubt, one of the best films I have ever seen. You probably shouldn't die before seeing this movie...",
            "review_date": "2012-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "depressing, but lots of symbolism to keep you busy",
            "review_date": "2012-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well-done film about adolescence by Truffaut.",
            "review_date": "2012-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece in French Cinema from the legendary new wave director Francois Traffaut (to film lovers) or the French Scientist from Close Encounters of the 3rd Kind for others.\n\nThis is a simple touching film held together purely by the talent of the young lead, it's fly on the wall approach is fantastic but it's simple effective scenes & the realism of purely 'on locations' locations really make the film.\n\nThere are so many clever fantastic shots that are so individual & ahead of it's time cinematically & the use of camera to build the emotion is second to none. It's a film about a good kid deep down slowly going down the wrong path, a essential French film to view....",
            "review_date": "2012-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 Blows is an influential French New Wave picture that provides an authentic, thoughtful, and absolutely tragic examination of childhood devoid of corny sentiment.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This interesting piece of French new wave gives the haunting story of a young kid being left behind by society, and rebelling as a result, sending him into a downward spiral. Moving, entertaining.",
            "review_date": "2012-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film. See it",
            "review_date": "2012-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my very favorite film, its complete in all ways, a masterpiece, and surely an inspiration!",
            "review_date": "2012-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most powerful and deep stories I've ever Seen so amazing and Touchable as any other picture!!!",
            "review_date": "2012-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This review makes more sense if you consider that I wrote it after watching Les 400 coups and The Shawshank Redemption back-to-back.\n\nLes 400 coups mise en scÃ¨ne par FranÃ§ois Truffaut est aussi un bon film. Shot in black and while with hand held cameras, it stands out from other films produced in studioes at the time. Some scenes are comical, other tragic. Truffaut paints a compelling picture of a youth trying to find his way in post-war Paris.\n\nLike the Shawshank Redemption, Les 400 coups turns the tables by making an outcast the hero and an authority figure the villain. Perhaps linking the two films is a bit of a non-sequitor; perhaps not. They share a first person perspective, some themes about adversity, keep the interest of the audience throughout and can be rented from Bay Street Video.",
            "review_date": "2012-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 Blows is not a coming-of-age movie, as some reviews suggest.  The child protagonist is not necessarily moving toward a deeper understanding of life or preparing to become a fully-functional member of society.  He is a largely static character to whom events happen, and the movie follows his attempts to navigate and perhaps exert a limited sort of control over his less-than-ideal circumstances.  He lacks any particularly precocious qualities or quirks, so his behavior and manner of expression are not that of some child prodigy.  He behaves for the most part as a normal child his age would in similarly-challenging situations, and that makes him more relateable than many adolescent figures in film.  I'm not sure I've ever seen better acting from a 14 year old, and the DVD version contains an interesting interview with the actor recorded a year or so after the film wrapped.",
            "review_date": "2012-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of the French new wave era.",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The title of the film comes from the French idiom \"faire les quatre cents coups\", meaning \"to raise hell\". It is an unflinching look at a boy quick descent into misdemeanors and petty crime because of negligent and insensitive adults.  Jean-Pierre LÃ©aud is a real tour de force.",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a really great movie. You can't really say anything new about it. Jean Pierre Leud gives a fantastic performance, the camera work is flawless, the atmosphere is potent, and it's extremely entertaining. Just a really awesome movie.",
            "review_date": "2012-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 400 Blows is an emotional tale of a troubled child, sounds liek a very simplistic plot, and this movie is indeed simplistic. With simple themes and plot, this film relies on the performance of Jean-Pierre Leaud as Antoine, the troubled boy. Running at only approximately 100 minutes, the film leaves viewers wanting more. This film is one of the greatest films i've seen about adolescence. The 400 Blows is a masterfully made film and should be recognized for it's touching result. \n\nFavorite Scene: When Antoine finally reaches the shoreline of the ocean after escaping",
            "review_date": "2012-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the first foreign films I ever saw, and it perfectly touches on what it's like to be a kid. Everyone's felt like Antoine at one point or another, and the cinematography on this film is astounding. Loved every minute of it.",
            "review_date": "2012-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most heartbreaking and gripping films of childhood.",
            "review_date": "2012-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have never cried so hard at the beauty of an ending. Antoine Doinel has to be the character I have identified with more than any other. I don't have a clue how Truffaut realized the beauty in the whole running sequence, it has to be the most beautiful things I have ever seen, I'm not sure why. This film has affected me no other film will ever be able to achieve. You know that Antoine is a good hearted child, but he just wants to be free and enjoy the world. His parents and school continue to get in the way of him trying to be free, and they continue to win until near the end of the film. That is when Truffaut takes over with his obvious cineaste to make my personal favorite ending ever. Not to mention the hands down greatest performance from a child. He certainly has an intriguing attitude and look to him. He was irreplaceable for the role in this film. Though the things that Antoine and Rene do are quite bleak occasionally, the way Truffaut presents the world to us, in such a life affirming way, is absolutely stunning. This is a film that should affect everyone in a personal way, whether you love cinema or not, this is made to reach deep down into the core of us.",
            "review_date": "2012-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The films hangs on to your emotions, compelling you to sympathize with the trouble-making protagonist. You can't stop watching, because it's got you by your emotions.",
            "review_date": "2012-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen this movie numerous times. It never grows old or stale. Each time that I watch \"The 400 Blows\", it seems like the very first time. This movie is superb on all levels: acting, direction, cinematography, script and the music! Watching Jean-Pierre LÃ (C)aud's character \"Antoine\" develop on the screen totally captivates me. Antoine is a rascal and creates his own problems, but he is a product of his environment: he is rejected by his mother and his stepfather. In their eves, he cannot do anything right. He sees them as rank hypocrites. He has no role models to follow. His teachers are crass and demeaning to their students. As the result of these influences, Antoine is forced to carry a burden that is too much for an adolescent to bear!",
            "review_date": "2012-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyed this film, but I prefer Jules and Jim.",
            "review_date": "2012-06-14",
            "source": "rt",
            "lang": "en"
        }
    ]
}