{
    "rating": 4.0,
    "release_date": "2013-03-01",
    "num_reviews": 85,
    "genres": [
        "Horror",
        "Thriller"
    ],
    "summary": "As Nell Sweetzer tries to build a new life after the events of the first movie, the evil force that once possessed her returns with an even more horrific plan.",
    "reviews": [
        {
            "review_title": "Love Means Never Having to Say You're Possessed",
            "content": "The Last Exorcism Part II (2013) BOMB (out of 4) Shortly after the events in the first film, survivor Nell (Ashley Bell) tries to put her life back together as well as she can but she soon realizes that whatever was wrong with her is still there and coming back for more. THE LAST EXORCISM PART II is without question one of the worst horror films I've seen theatrically in a very long time. Year after year bad horror films are released but this here is at the very bottom of the barrel. After a quick look at the events in the previous film, we're introduced to an incredibly unscary pre-credit sequence, which pretty much tells you we're in for a dud. There's not a single thing that happens in this film that is scary. The majority of the attempted scares come from soft music playing before there's a loud bang with loud noises. This cliché is just so boring and so tiresome that you wish people would stop using it. Director Ed Gass-Donnelly deserves a lot of the blame because there's just nothing interesting here. The visuals are all rather boring and predictable. There's not a bit of atmosphere to be found anywhere. For a horror movie the lack of scares is a major disappointment but what makes them even worse is that they're all so poorly staged and delivered. The screenplay also deserves a lot of blame. As with the first film, this one here has a lot of character development early on. We see Nell struggling to get on with her life. We see her at work cleaning hotel rooms. We see her fall for a boy and we see her and her girlfriends going for walks. After a while you start to wonder if the filmmakers forgot they were making a horror film. I don't mind character development but none of the characters here are all that interesting and this includes Nell. Not for a second did I care what happened to her and I certainly didn't care to find out the secrets behind the first film. The performances aren't too bad but did you really come here for that? THE LAST EXORCISM PART II is a really horrid sequel to a decent movie. It's funny but the first movie came to a close with a horrid ending and then this film pretty much picked up that horrid and carried it to a new level. And don't even get me started on the ending here.",
            "review_date": "2013-02-28",
            "lang": "en"
        },
        {
            "review_title": "Just TERRIBLE. Unnecessary sequel, pitiful writing and poor execution.",
            "content": "The Last Exorcism Part II is simply put a terrible movie. I absolutely loved the first film but Part II is like the Blair Witch Project 2 of the original Blair Witch Project. Its unnecessary, it doesn't accomplish anything and it doesn't push the story forward. All this film was made for was to show you how Nell tries to recover after the events of the first film. THATS IT! The scares are few and far between the story is just downright dumb from the beginning and you never really feel for any of the characters from the get go. I wouldn't recommend seeing this film even for the fans of the first one. Besides a daring opening sequence, a few moments of suspense and interesting character moments this movie is a complete fluke. The Last Exorcism accomplished a sense of true horror and dread. You actually felt for the characters. Part II I see more of as a Dark Comedy. You can't even take this movie seriously at times. It seems the only reason this sequel was made was because the first film made 100 million at the box office. Thats it! 3 out of 10 stars. This movie was just bad. Simple as that!",
            "review_date": "2013-03-01",
            "lang": "en"
        },
        {
            "review_title": "Scare Flick with a Twist",
            "content": "Before I start I must say I love the first movie, great story and acting. Normally I dislike the amateur camera story telling, but the camera shots were well handled and was only distorted when the theme calls for it which fuse well with the dramatic ending.I really don't believe this movie (the sequel) deserves all the negative reviews and here is why.From a technical perspective, I thought the cinematography was superb, lots of beautiful artistic shots adding to the mood of the movie. The build up of hopelessness and dread, it lays solid foundation to the climatic ending. I was expecting something similar to the last movie but the change was quite refreshing.In terms of acting, Ashley Bell did a terrific job as a terrorized girl with no one to trust and no where to turn. Granted the story is simple on the surface and shot with many of the \"jump from behind\" scene to startle the viewer. It may seem like \"god\" has forsaken Nil as she was chased by the demon throughout the film and finally the ones who was suppose to help her tries to kill her as they realize they are no match for the demon's power (clearly no one is looking out for Nil). The ending is non-traditional where Evil wins over good, but is the \"good\" deserving? (Girls watching YouTube videos to makes fun of Nil, the Order whom tries to kill Nil when they are frightened by the demon's power, the care taker is perhaps the only one none deserving of his fate)This type of ending is more frequent in Japanese horror where the dark force cannot be conquered by man and shows how small we are in nature. Perhaps the slight to our all controlling north American ego and an attack on \"God\" failing to step up as the mighty protector is the reason behind all the negative comments placed on this film.In summary I give a 8/10 rating to this film and looking forward to a final installment in the completion of a trilogy.",
            "review_date": "2013-06-09",
            "lang": "en"
        },
        {
            "review_title": "Good horror flick!",
            "content": "Nell Sweetzer tries to rebuild her life right after the events depicted in the first film. Now living in home for girls she tries to forget the horrific events she experienced only to find out that they are all too real.This is a good sequel to the first in which the demons true intentions are revealed. It uses classic horror tactics and stays away from the traditional exorcism films. The plot was well grounded and the acting specially from Ashley Bell was outstanding. This was not filmed in the found footage style which adds more depth to the story. The ending to this film was definitely my favorite part and I enjoyed this good old fashioned horror flick.I was rather skeptical at first due to the low ratings on IMDb but I keep forgetting that horror films are not for everyone but if you do enjoy them this is a must see!! 7/10.",
            "review_date": "2013-06-11",
            "lang": "en"
        },
        {
            "review_title": "Beware the horror movie rated PG-13 . . .",
            "content": ". . . as this is sort of a contradiction in terms, and unlike 1930s horror, it nearly always denotes a half-hearted attempt to warm up leftover effects, characters, and plot points from earlier movies. The scariest thing about THE LAST EXORCISM PART 2 is that the producers have been making the rounds threatening to release a LE Part 3, etc. Make no mistake: this does NOT have the potential to be a SAW franchise, or even FINAL DESTINATION. This sequel is even more a lame imitation of the hundreds of previous possessed-by-the-devil flicks than was the original. At least the first movie had some credible conflict in the characters of the pastor and the film-maker. The sequel simply tries to trot some of the dead characters from the first movie into the second in a muddled attempt to blur the line between illusion and reality. This simply succeeds in confusing the majority of viewers. Since the movie is PG13, there is not the necessary level of sex and violence to sustain a modern horror flick. The only thing that could salvage such a bad situation would be an original plot and good acting, but THE LAST EXORCISM PART 2 is sorely lacking on both scores.",
            "review_date": "2013-03-08",
            "lang": "en"
        },
        {
            "review_title": "A Nutshell Review: The Last Exorcism Part II",
            "content": "This sequel will go down as one of those that have gone horribly off tangent to its source material and original, which is a pity because the first film had a solid finale which left it as a cliffhanger of sorts, but this direct follow up junked every good thing about the movie in no less than 5 minutes into the film, and had everything go downhill after that. For writer- director Ed Gass-Donnelly, I'm sorry to say that while you have had good intentions and decided to forward the story without the use of the found-footage gimmick, I wonder why you didn't choose to be less derivative from classics such as Carrie and Firestarter.The first film worked because of a couple of reasons. First and foremost, it was a compelling premise, where a jaded pastor-conman decided to spill the beans in his profession, and herein lies the actual reason that it was found-footage because of an embedded documentary crew that followed him around while he exposed the secrets in his shady trade. Then there's proper character building, where we empathized with Cotton Marcus (Patrick Fabian), and understood why he decided to make good the wrongs in his life, and this worked into a tale of faith. Then the antagonist, spearheaded by Ashley Bell's wonderful portrayal as Nell, contained all ingredients necessary that blended horror and mystery together, plus her ability to contort herself in all angles imaginable. And who can forget that goosebumps raising finale.Not a lot of people took to that film of course, but it worked well for me. Then came Gass- Donnelly and his idea of continuing directly where the first film left off, was quite brilliant. Naturally there isn't any reason to pursue this in found footage again, so the major decision was to come up with a straight narrative film, following Nell as she ends up in a girls' home, since she did not bear any memories on what had happened in the final few moments of the first film. And here is where everything turned south as far as the story went. We get introduced to characters who were as flimsy as they were cardboard, and a romance that was totally flat from the get go. Yes we know that Nell is given every opportunity to assimilate back to normal society, but this was boring as hell when translated for the big screen, because there wasn't much emotions involved, and made it look very artificial, with scenes included because they just should. There were attempts to spook the audience, but even this relied on the tried and tested techniques which didn't offer anything new, especially when threats were issued usually through scratchy voices that may have come from imagination. To add further insult, there wasn't much of a \"last\" exorcism here, so the title was nothing more than to remotely link this film to the previous one, which had every reason to be \"last\", because well, that's what had happened. Here, while the exorcism performed was of a different style, it was so small a portion of screen time that it was quite negligible, especially its outcome.What made it worthwhile was went Gass-Donnelly shifted gears to add a sense of urgency into the narrative in the final act, and things were really looking up especially when we had Nell confront her inner demons, and pick a side to root for. But then the brakes got applied again when you suddenly realize that the director had gone the direction of films such as Carrie and Firestarter, both written by Stephen King, and you wonder whether that's all that Gass-Donnelly can do, to become nothing more than a derivative of those two works. This film could have been labeled as \"Nell\" and perhaps it may win over some thought that it's about the misadventures of a possessed character, rather than the process to get her exorcised for good. Rewatching the first film will give you better value, and thrills.",
            "review_date": "2013-04-07",
            "lang": "en"
        },
        {
            "review_title": "What a snoozer..",
            "content": "Sometimes a next chapter,is not really needed.\nThis part 2 added nothing new & the quality felt amateurish.\nLead actress isn't all that great,have seen her in other things too.\nThe people that are going to help,kill her off so quick into the exorcism..\nWas like really? They acted as though,they never done one.\nFelt rushed by their actions,which I guess was to close out the movie & her deciding to be evil.\nJust many poor choices on how to tell this story,not even worth seeing again.\nCinematography, acting,music & overall general feel was bad.\nGo watch a better movie,on the same subject matter.",
            "review_date": "2021-03-18",
            "lang": "en"
        },
        {
            "review_title": "I wish I had read the User Review First",
            "content": "Never do I rate a movie 1, and the only reason I did on this movie as there was not the ability to rate it a zero or less. The Last Exorcism Part II is a complete waste of time. It is NOTHING like other Exorcism movies, nor is even come lose to being scary. About all you get out of this is a lot of deep looking facial expressions by Ashley Bel who plays Nell. I was so disappointed in that there was nothing really scary, some possessed people who just talk scary, yet the demon is never really there. The scenes were so disjointed, and after 30 minutes, I felt like OK, this has gone so slow up until now, something really scary is going to happen next... I was mistaken. After 45 minutes, I waited, after an hour, I waited, then figuring that this was going to be a great and scary ending.. I waited.. Then the credits roll! ARE you freaking kidding me? This has to be the G rated version of scary movies of all time. Like another review hit on, the only reason it seems that this movie was made was to pry money from those that saw the first movie and thinking this will be a continuation of that. Here is the fact of life, if you go see this movie thinking it is a scary or demonic movie, the Joke will be on you as the movie maker laughs all the way to the bank.",
            "review_date": "2013-03-03",
            "lang": "en"
        },
        {
            "review_title": "Even the evil spirits will be bored by this film",
            "content": "New Pope Francis 1 should ban exorcism films as they insult the intelligence of viewers. This film is so boring and derivative. What's the big deal about Nell floating above her bed.She hears the usual weird noises and sees funny things, typical in all exorcism films.This film plods along at a leisurely pace until the exorcism, which is so weird that you have to see it to believe it.WHO brings a heart monitor, a chicken and salt to an exorcism???? Ha ha.www.jeffleemovies.com",
            "review_date": "2013-03-14",
            "lang": "en"
        },
        {
            "review_title": "Deceptive Conclusion of an Unnecessary Sequel",
            "content": "The seventeen year-old Nell Margareth Sweetzer (Ashley Bell) is found completely insane and obsessed by the demon Abalam. After medical and psychological treatment, she is sent to the Deveraux transition house in New Orleans managed by Frank Merle (Muse Watson), who helps her to start a new life. She finds a job of hotel housekeeper; befriends her roommates; and has a crush on the teenager Chris (Spencer Treat Clark). But soon she is haunted by people from her cult and by an evil force that wants to possess her. When Nell meets Cecile (Tarra Riggs), she tells that she has been following Nell since the hospital. Further, she discloses that she belongs to the sect Order of Right Hand that can protect her from the evil and Nell goes to her house. Will Nell be protected from the powerful evil force?\"The Last Exorcism Part II\" is an unnecessary sequel of \"The Last Exorcism\". The movie is not so bad as described in many reviews, but the conclusion is a great deception. Ashley Bell has good performance but the story is weak and pointless. My vote is four.Title (Brazil): \"O Último Exorcismo - Parte 2\" (\"The Last Exorcism Part 2\")",
            "review_date": "2013-09-20",
            "lang": "en"
        },
        {
            "review_title": "The demon returns to take his host in The Last Exorcism II",
            "content": "Somehow the found footage genre still seems to be churning out films even though most of them are just bad. The Last Exorcism was one that worked pretty well as it made sense to the story and the overall film was executed pretty well, despite the lame ending. To no one's surprise the success of that film spawned a sequel that intelligently decided to move away from the found footage style and make it a normal movie that looks to be pretty cool, despite it's somewhat silly name.The Last Exorcism II follows Nell as she tries to build a new life after escaping the events of the original film, but when things seem to be going well the evil that once possessed her returns to take back its host. Much like the Blair Witch Project, Exorcism decided to go this other route with its sequel, but unlike it tried to keep the story intact. The story is perfect for the direction to keep this story moving, but sadly the film doesn't offer all that much. If not for Ashley Bell, reprising her role, this film would have fallen apart fast. She is so great in this role delivering all the emotional torment and innocence needed to make this character work. Beyond here there is really little going on in this movie other than her wandering around Louisiana. We all know that the formula of the possession films is the slow build, but when we already have an established story and character there is no need for it to be this slow. The few moments of \"haunting\" that you do get work well enough, but nothing like the powerful imagery of the first film that made it stand out so much.This is one of those sequels that wasn't needed but welcomed in hopes to make up for what they did with the silly ending of its predecessor. Make no mistake this isn't a horrible movie, it is actually still pretty entertaining on some levels, just doesn't push the limits like it should have. The ending proved to be a bit of an interesting direction to continue the series, but was just a bit too little too late to pack the punch it needed.",
            "review_date": "2013-03-04",
            "lang": "en"
        },
        {
            "review_title": "You'll be missing out if you read the negative reviews",
            "content": "I'm really confused as to why this has received such bad user reviews, i'll admit the title of this film kinda contradicts itself but i honestly believe this was an attempt to redeem the crappiness of the first movie, and it succeeded! Afterall \"Evil Dead\" had a sequel because the first one was rubbish and thats one of the best movies out there.. This isn't your typical possession film where you watch your generic 19 year old girl speak in a monotone demonic voice and you don't really care what happens to her because you've seen it a hundred time before. The girl in this you will actually feel sorry for, she is being taunted by the demon though everything thats actually good in her life and it's a shame, coupled with the fact she is a really good actress makes it a decent film, it tries to inspire emotion through flashbacks which is a really nice touch too. It will also become clear why it's called \"The Last Exorcism\" too! These negative reviews obviously come from people who had the whole script written in their heads before they pressed play, and it's a shame that their disappointment may affect others that just want to watch a movie and be surprised! Anyway it's 80 minutes and it's a pretty decent film, give it a shot if you have the time",
            "review_date": "2013-08-01",
            "lang": "en"
        },
        {
            "review_title": "terrible",
            "content": "After the millions that made The Last Exorcism the producers must have been cursed by some evil spirit to summon the money out of horror buffs to see this awful second entry into the story of Nell (Ashley Bell). I thought that Ashley would show her abilities again of moving her body in weird ways but it just didn't happen. It's a slow builder, the evil entity comes slowly in the life of Nell but once it does it never develops. There's nothing frightening or nothing even works out fine here. After a while it even became rather boring. I don't understand that a ,name like Eli Roth, involved here didn't make it worth watching. And when things go wrong and Nell is getting possessed the evil is shown off-camera. The final was even laughable when Nell is driving away. The Last Exorcism part 2 was made just for the money, let the devil curse the producers. Luckily Ashley Bell looked believable. Gore 0/5 Nudity 0/5 Effects 0/5 Story 1/5 Comedy 0/5",
            "review_date": "2013-11-06",
            "lang": "en"
        },
        {
            "review_title": "The type of flick most horror fans would say is 'so bad it's good'.",
            "content": "'THE LAST EXORCISM PART II': Three Stars (Out of Five)Sequel to the 2010 supernatural horror film about a minister being followed by a documentary crew while he performs his last exorcism. This film takes place directly after the original and focuses on Nell Sweetzer, who was the girl being exorcised in the first film (and one of it's sole survivors). This installment is not filmed in the found footage format though and centers around Nell now living in a home for girls, while still possessed. The film was once again produced by indie horror master Eli Roth but it was directed and co-written this time (with Damien Chazelle) by Ed Gass-Donnelly (another indie filmmaker). The film is not nearly as inventive or fun as the original but it is a decent sequel and not nearly as bad as a lot of the reviews it's been getting. After a series of flashes from the first film, reminding us what mostly took place, we find Nell (once again played by Ashley Bell) sneaking into a couple's home late at night in New Orleans. She's catatonic and animalistic when the couple turns her over to a local hospital. She's then placed in a home for girls ran by Frank Merle (Muse Watson). She makes friends with the other girls staying there, lead by the mischievous Gwen (Julia Garner), and even garners the attention of a young man named Chris (Spencer Treat Clark, who was the kid in 'UNBREAKABLE' and also appeared in 'GLADIATOR' and 'MYSTIC RIVER' at about the same age). She gets a job at a local motel as well and everything seems to finally be going good for her but those annoying demons just won't let her alone and continue to harass her throughout the rest of the film. The movie is cheesy of course but it's supposed to be; it's a B horror film! It's much better than a lot of other crap out there that gets much better reviews (I personally found it a lot more entertaining than the 'PARANORMAL ACTIVITY' films). It's a bad movie but it's amusing and it's the type of flick most horror fans would say is 'so bad it's good'. It of course doesn't live up to the original but that had it's haters as well (I personally loved the original film). Bell is very good in the lead role once again and the directing is decent for this sort of film. The script is about what you'd expect from a movie called 'THE LAST EXORCISM PART II' as well. I saw the movie as part of a double feature (I created, at Regal's $5 movie night) with the youth gone wild party film '21 & OVER'. This wasn't as good as the latter but it was nostalgic and a lot of fun to see two 80s style teen movies (a B horror film and a youth sex/party flick). If nothing else it's at least good for that.Watch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=sH2nsN_uuBI",
            "review_date": "2013-03-13",
            "lang": "en"
        },
        {
            "review_title": "It must have been hard to make a film this dull",
            "content": "Okay, I try to do a little more than just blatantly slag off a film, but with 'The Last Exorcism Part II' it's kind of hard not to.I didn't expect to enjoy the first film and, amazingly, I was in for a pleasant surprise. It may have been a 'found footage' film, but it was enjoyably creepy, despite being an overused genre about an overused subject matter.Therefore, based on the first movie alone, I decided to watch the sequel. I really wish I hadn't. It's a completely different type of film for a start, i.e. not 'found footage.' I guess the film-makers wanted not to just do a rehash of the first movie and try something different. What they came up with was simply one of the more boring films ever made.We follow the girl from the first story, now trying to lead a normal life. But she can't. The spirit she fought before wants to be in her again. Things bump around wherever she goes, therefore, in turn, making her jump. That's about it. She has a gaggle of female friends who do little more than giggle and make clichéd remarks. Plus there's a love interest for out main lead. It adds nothing to the plot, other than detracting yet further from anything vaguely scary.The Last Exorcism (part one) was nothing that special, but at least it was watchable enough to be enjoyable (if you like low budget horror flicks). Part II, on the other hand, is just dull with no redeeming features.Maybe I should have known better than to watch a sequel to a film with the word 'last' in the title. Dear film-makers, PLEASE make part II the absolute last this time. I won't be watching 'The Last Last Last Exorcism' if it ever sees the light of day.http://thewrongtreemoviereviews.blogspot.co.uk/",
            "review_date": "2014-08-31",
            "lang": "en"
        },
        {
            "review_title": "OK - neither good nor bad",
            "content": "Nell, traumatised by the events preceding and following her exorcism in The Last Exorcism, spends time in mental hospital and then a halfway house, trying to find a way to a normal life. Unfortunately, it appears that the demon Abalam may not have finished with her.Nell's further adventures are chronicled in a film which, thankfully, abandons the \"found footage\" approach of its predecessor, and delivers a perfectly acceptable tale of a young woman, earmarked for demonic possession, trying to escape what fate has in store for her.Ashley Bell's performance doesn't have the double-jointed physicality of the first film, but it is still effective in showing all sides of an ordinary but tormented girl. The plot advances constantly, though never in an unexpected direction. The New Orleans setting adds some atmosphere, and the movie is suspenseful rather than scary - most of the scares are of the loud noise variety.Overall, I thought it was better than the inaccurately named The Last Exorcism (it wasn't the last one at all, there was another one in this film).",
            "review_date": "2013-06-14",
            "lang": "en"
        },
        {
            "review_title": "My Review Of \"The Last Exorcism Part II\"",
            "content": "\"The Last Exorcism Part II\" continues the story of Nell and the demon who wants her-Abalam. With a new director but the same actress as the first film, Ashley Bell. \"Part II\" is straight up horror story telling in a classic format. There is no documentary style footage present save the internet shot of the footage from the first film so the opportunity to really utilize basic but brilliant gimmicks for shock and thrills are very well in hand for this film. Which I think the director managed to use quite well without being too obvious or any real \"fail\" issue for the most part. The story has Nell moved to New Orleans and on her way to rehabilitation for a new start with new friends. However Abalam is not done with the young girl and there will be no salvation for her in the city.As far as the film's ability to bring the scares I have to say that the film did it's job. There were moments that normally would not have been scary nor interesting in the film but because the director utilized the trick of closed in frame shots, in most of the scenes, random moments became thrilling. The story is more focused and open to the viewer with no real hidden plot, which allows for more imagery and dogma that surround the whole possession culture. It allows for a more mystical icon-ism to play a big part in staging the story. It is a true classic horror story in all ways. That normally would seem like a bad thing but thankfully this director knew how to shoot the film and set up the moments that needed to be scary or exaggerated enough to make the movie work. Until the ending of course. That I have issue with. I appreciated the twist that says not every one gets a Hallmark moment but for me it came off cheesy and that boiled down to the use of CGI when more organic FX would have came off better for what the director was going for. \"The Last Exorcism Part II\" is a better story and movie than the first film but the first film had a way better ending. There must be a third film in the works because there where some elements of the over all story that were only vaguely highlighted and need to be unveiled in this character's grander story.",
            "review_date": "2013-03-03",
            "lang": "en"
        },
        {
            "review_title": "terrible film with no point to seeing it.",
            "content": "The Last Exorcism Part II (2013) Shortly after the events in the first film, survivor Nell tries to put her life back together as well as she can but she soon realizes that whatever was wrong with her is still there and coming back for more. this film is without question one of the worst horror films I've seen in a very long time. Year after year bad horror films are released but this here is at the very bottom of the barrel. After a quick look at the events in the previous film, we're introduced to an incredibly unsecured pure-credit sequence, which pretty much tells you we're in for a dud. There's not a single thing that happens in this film that is scary. The majority of the attempted scares come from soft music playing before there's a loud bang with loud noises. This cliché is just so boring and so tiresome that you wish people would stop using it. Director Ed Gass- Donnelly deserves a lot of the blame because there's just nothing interesting here. The visuals are all rather boring and predictable. There's not a bit of atmosphere to be found anywhere. For a horror movie the lack of scares is a major disappointment but what makes them even worse is that they're all so poorly staged and delivered. The screenplay also deserves a lot of blame. As with the first film, this one here has a lot of character development early on. We see Nell struggling to get on with her life. We see her at work cleaning hotel rooms. We see her fall for a boy and we see her and her girlfriends going for walks. After a while you start to wonder if the filmmakers forgot they were making a horror film. I don't mind character development but none of the characters here are all that interesting and this includes Nell. Not for a second did I care what happened to her and I certainly didn't care to find out the secrets behind the first film. The performances aren't too bad but did you really come here for that? the film is a really horrid sequel to a decent movie. It's funny but the first movie came to a close with a horrid ending and then this film pretty much picked up that horrid and carried it to a new level. And don't even get me started on the ending here.1/5 StarsBmorecrafty-Bmorebloger",
            "review_date": "2013-03-06",
            "lang": "en"
        },
        {
            "review_title": "Ashley Bell does a good job in slow unscary movie",
            "content": "Nell Sweetzer (Ashley Bell) is trying to recover from the events of the first movie. She is sent to a safe house in New Orleans with other girls trying to restart their lives. She is an innocent, and still haunted by the demon Abalam. She gets a hotel housekeeping job, and even a boyfriend Chris. But she can't escape Abalam, and mysterious Cecile may be able to exorcise the demon once and for all.The original had the benefit of an indie realism. That is to say that it pretends to be real like 'Blair Witch Project'. It also had Ashley Bell bending over backwards in a (is she?)/(isn't she?) story. This one is much more traditional. Ashley Bell is quite effective as the naive Nell. The movie has a slow moving gentle feel. But when the time comes to pump up the scares, they pull all the punches. The kills are happening off screen. The traditional camera moves just aren't there. If Ashley Bell wasn't there, I would definitely fail this movie.",
            "review_date": "2013-10-12",
            "lang": "en"
        },
        {
            "review_title": "Intriguing",
            "content": "Unlike so many others (general audience not critics) I count my self a fan of the original Last Exorcism. I found the film to be throughly engaging. Funny with some creepiness and a burst of disturbing at its unexpected if slightly hammy conclusion. The no. 1 thing I loved about that film was Cotton the Reverend, the second thing Nell played by Ashley Bell in a physically daunting, creepfest performance. So when I heard they were developing a sequel I was game Because the first film had created characters that I liked. But as the release loomed closer I realized that Cotton wasn't going to be part of the mix which was a little bit of a let down. However even though the trailer looked a little silly, well a lot I wanted to give the film makers props for not going with the know annoying found footage routine and updating out main characters story to something more classically cinematic. The results are mixed but it's safe to say that there's enough to merit a soft recommendation. The film picks up the moments after the events of the original where Nell is found traumatized and brought into a girl's halfway house. Everything seems well enough at first as she begins to adjust to everyday activities. It's a little lifetimeish as she listens to her first ipod, wears some lipstick and has her first real kiss but we like the character and Bell keeps it engaging. But strange things begin to happen and we slowly but surely discovering that the demon from the original is still looking for her to fulfill a prophecy of horrific proportions. It all sounds a little generic but the way in which the material is approached is somewhat interesting because you see the demon has in fact fallen in love with her and is sort of courting her destroying the life around her. It's a n intriguing concept sadly not fully explored but hidden inside this is great one and had they had more a budget to hide this hokey effects (cartoon cgi fire ugh), A more in depth screenplay and a harder rating which would have allowed them to show more this could have been a real blast. There is potential that runs throughout the film populated by solid performances especially for the genre, some decent scares, a creepy indie atmosphere and some really nice cinematography (the shadow work is impressive). But in the end it fails to really deliver on any of its promises which is sad and with its dismal box office and a feisty finale which could have led to something pretty cool it doesn't look like we are going to see another entry. Maybe we'll get lucky and they will explore the concept further on a direct to DVD sequel. But regardless of the films faults of which there are many it's a lot better than most of the big studio crap they've been releasing like The Possession and The Apparition at least there's a story here an an intriguing one at that. 3/5",
            "review_date": "2013-03-06",
            "lang": "en"
        },
        {
            "review_title": "Really not good...",
            "content": "\"The Last Exorcism Part II\" is a really not good sequel of \"The Last Exorcism\" movie of 2010. In this movie we have again Ashley Bell who after the first movie in which the evil force has possessed her and finally left her now it returns.I did not like this movie because I think that it is not the sequel which many people expected to be and because it was really awful. This movie makes you believe at the beginning of it that it will be a nice movie but after that you will change your mind.Finally I have to tell you that if you want to have a comprehensive view of this movie sequel you have to see it and then regret it.",
            "review_date": "2014-01-19",
            "lang": "en"
        },
        {
            "review_title": "Shame on you CBS!",
            "content": "The first problem with this movie is that it is PG-13. I think this movie could have been a million times better had it been rated R. This happens because the movie studios are only concerned with selling tickets instead of making a good film. I also want to make it clear that Ashley Bell is an amazingly talented actress. The way she portrays her innocence and confusion regarding what has happened to her is soul shaking. She really makes you feel every emotion that she is feeling. That being said, it is not her job to make the entire movie scary all by herself! The first movie was so good and solid, so creative\u0085 This movie is just lazy, unoriginal and disappointing. A huge let down to fans of the first and I can only describe it as being slightly better than a made for TV movie. The only thing I thought was entertaining about this movie was Ashley Bell's awesome acting skills. Other than that, the story had no substance and when you finally get to the end, they treat it with kid gloves when they could have gone seriously terrifying. Huge disappointment. The only reason I give it a half decent rating is because Bell was so good.Please like me on Facebook! We love getting suggestions and warnings on everything horror: http://www.facebook.com/pages/I-Heart-Horror/338327476286206",
            "review_date": "2013-03-01",
            "lang": "en"
        },
        {
            "review_title": "No better or worse then the first",
            "content": "I did not like the first one at all, I thought one of most boring movies I Have seen, Did not once get scared or creeped out at all, I thought it was The Worst Exorcism movie but then we suffered for even worse with Devil Inside 2 years later! Least this Last Exorcism 1 had some scarce scenes at least and tense moment in (Which Didn't work for me as saw them coming) and there in that movie unlike Devil inside and this sequel to the first movie Nell is trying to put her life back together and she has blocked out all things that happens to her in the first movie but soon they what her back again. This was really bland from start to end, there was not one moment that actually felt anything scary was going to happen any where in the movie, The only good think I can say about this movie is that, last 10 minutes of the movie was so-what watch able and something was finally hap ping in the movie and again it wasn't that scary at all and most of that scene see the trailer . I didn't mind the movie ended but story didn't really end! Yet another movie that show 95% of movie in trailer, Just watch the trailer skip this movie One other good think I can say about this movie is that the acting was really good from the cast but shame about the rest of the bland movie. 3 out of 10",
            "review_date": "2013-04-14",
            "lang": "en"
        },
        {
            "review_title": "Only Half As Horrifying as the Original!",
            "content": "\"The Last Exorcism Part 2\" doesn't conjure up half as many chills as its polished predecessor. Mind you, nobody performs an exorcism in this predictable but eerie PG-13 rated follow-up. Nothing here will afflict you with nightmares. Some of the surprises may catch you off-guard. Basically, this CBS Films release proves just as immaculate in its depiction of blood and gore. The throat slitting scene exemplifies the approach of less is more. Similarly, it substitutes physical contortions for violent outbursts. Mild would best describe the discretion with which everything is orchestrated. As sequels go, 'The Last Exorcism Part 2\" remains faithful to the original but doesn't surpass it. The second film picks up the narrative thread from the first and makes a slick segue. Ashley Bell reprises her role as Nell, while Lewis Herthum encores as her father. Otherwise, aside from the demonic spirit Abalam, the entire cast consists of newcomers.\"Small Town Murder Songs\" director Ed Gass-Donnelly co-scripted this edgy, 87-minute, paranormal horror chiller with Damien Chazelle. Occasionally, genuinely scary stuff occurs as in the first half of the film. More often than not, however, he resorts to a yapping canine, jangling telephones, or decibel-heavy musical cues that generate goose bumps. Red herrings are almost as stimulating as the genuine jolts in a fright flick. Often, the false alarms amount to pranks. \"The Last Exorcism\" appropriated the 'found footage' approach for this reason. If you've seen neither the recent \"Paranormal Activity\" franchise or long before it the 1999 ground-breaking \"The Blair Witch Project,\" you're acquainted with the 'found footage' technique. Nevertheless, like \"Book of Shadows: Blair Witch 2,\" \"The Last Exorcism Part 2\" shuns the 'found footage' format. The filmmakers take a straightforward, chronological approach to their material. Consequently, the level of irony that enhanced the thematic value of the original is as conspicuously absent as any sense of humor. The Reverend Manley and his wife served as comic relief in the first film. Donnelly relocates the action primarily to New Orleans, and the ambiance of the Crescent City lends itself atmospherically to the supernatural shenanigans.Since the hypocritical Reverend Cotton Marcus perished in \"The Last Exorcism,\" Nell Sweetzer has to carry the burden of the plot in \"The Last Exorcism Part 2.\" The premise this time around is that our heroine must pick up the pieces of her life and begin her recovery. Nell scares a couple when she breaks into their house and they find her in a catatonic state in their kitchen. Afterward, she undergoes a battery of psychological tests and then moves into the Deveroux Halfway House in New Orleans before she can re-enter the world on her own. When she isn't suffering from 'bad dreams' in this psychiatric outpatient clinic with other girls, she lands a job on the outside as a motel maid. Those of you who skipped \"The Last Exorcism\" should know that Nell was the sacrificial virgin in the original. She delivered Abalam during a satanic ritual performed in the sticks of Ivanwood, Georgia after sundown. Reverend Marcus and his crew forfeited their lives during that frightening scene. Predictably, the demon stalks Nell every foot of the way because he wants to dominate her. At one point, Abalam possesses Chris (Spencer Treat Clark of \"The Last House on the Left\") with fatal results. Not surprisingly, Nell wants nothing to do with the Devil. She struggles to live her life in the present rather than lingering on the past. Frank Merle (Muse Watson of \"Hollywood Vampyr\") supervises the girls in the half-way house and he tries with little success to convince Nell that nothing about her predicament is supernatural. Despite her ambitious plans, she finds that her notorious past has reared up to challenge her after found footage from the original surfaces on the Internet and propels her into the spotlight. Whereas the first film pitted Christians—albeit it bogus Christians—against the Devil, \"Part 2\" replaces the Christians with Voodoo witchdoctors. Unfortunately, despite some shocks and surprises, Nell doesn't emerge as a strong protagonist compared with Cotton Marcus from the original. She survives her encounters with mortality at the hands of the voodoo disciples. The happy ending is disconcertingly consoling when everything should be nerve racking. Ashley Bell manages to convey vulnerability and tenacity in a subtle performance, but her character is so one-dimensional that she lacks charisma. Ultimately, \"The Last Exorcism Part 2\" does bend over backward to horrify but little about it is spine-tingling.",
            "review_date": "2013-03-01",
            "lang": "en"
        },
        {
            "review_title": "Repent...?",
            "content": "I had my doubts about this Movie, but I do not feel any repentancewatching it. Part one is mostly shot in POV which is, I Think, very limiting dramaturgically since you are forced to tell the story through the person holding the camera. Part two, however, is shot in conventional third person.Plot: possessed girl from part one struggles to reintegrate into society, but pieces from her past make it difficult.The problem with this sub-genre is that it is hard to reinvent and to make it look \"fresh\". Disregarding the title, the devilry, so to speak, is fairly subtle, at least more subtle than my countryman's (Mikael Håfström) the Rite which is over the top but otherwise well-made. There are some illogical moves as well, for example how the girl is approached by the supposed exorcists.However, all in all it is a good low budget flick with descent acting and sfx.I'll give it 5 out of 10 since it lacks real suspense and that the Movie fails to create sympathy for the lead role.",
            "review_date": "2013-06-01",
            "lang": "en"
        },
        {
            "review_title": "Somewhat enjoyable and entertaining sequel",
            "content": "Hoping to move on with her life, a young woman finds that the demonic possession that had previously plagued her has returned and threatened to destroy more than what happened last time around, forcing her into a battle for her soul.This was quite an enjoyable and really entertaining effort that has a lot going for it. One of it's better efforts is the fact that this one really manages to work the demon possession as something to be feared and dealt with in this, as the amount of time spent here is where this one really works out nicely. Not only is this something that torments her as she tries to go about her daily life, it also shows signs of doing this in her personal life as the new job and life among the rest of the girls in the halfway house are certainly enough for this one to get some chilling moments in by managing to infuse numerous amounts of demonic whispers and flash visions that interrupt her attempts to move on which are quite nice at building this atmosphere of her being tormented and targeted quite well throughout here. Likewise, the personal relationships including her boyfriend and those around her manage to come under attack with a slew of scenes including her being psychologically assaulted and levitating in the middle of the room which is where this all scores rather nicely by throwing these sections together to effectively showcase the intent of the possession throughout here. That leads into the film's biggest plus, which is the rather enjoyable exorcism scene here. Rather than relying on the traditional Christian methodologies that have been done dozens of times over here, the novel approach of a voodoo ceremony to accomplish the same thing makes this seem a lot more creative and unique than it would be without the tactic which also results in this one making for some exciting action as well to really go all-out in this one. There's not a lot to dislike here, though they are pretty heavy as this one really has a problem wandering around in the beginning without really getting anything accomplished. The film has a problem with variety as this resorts to continuous use of whispers and voices for its scares yet doesn't do much else to really utilize its' scares so this one really tends to drag on in the first half with a long wait time to really get interesting in terms of pacing since it does the slow-burn build-up instead of the rapid-fire pacing that makes for a lot more enjoyable tactic. As well, the finale is quite lame and doesn't really do much to restore faith in it's decision-making as the weak look and rushed feel definitely impact this overall. Still, it's got enough to make for a decent-enough watch.Rated PG-13: Violence and Language.",
            "review_date": "2014-12-17",
            "lang": "en"
        },
        {
            "review_title": "only see the first part",
            "content": "Part 1 was so creative and good\npart 2 is Unnecessary and poordont bother seeing, it will ruin the movie.. just seems sloppy nothing special nothing good enough to get a 5",
            "review_date": "2020-05-31",
            "lang": "en"
        },
        {
            "review_title": "Silly movie, with a good idea just as the credits roll....",
            "content": "The girl from 'The First Last Exorcism' is back, and now she just wants a normal life, so she moves in a home for troubled people, and starts flirting with the boy who nearly shot Bruce Willis in Unbreakable.Not long after the credits though, the shadows come back, and the flies start to buzz, and the director thinks its a great idea to make a very loud noise every now and again to make the audience jump....The first movie was fun, but the ending was silly and ruined the rest of the film. But the idea was sound, and the performances were great, and it was scary for the first two acts.This film however, goes in the opposite direction, the film for the most part, is rotten to the core, and I feel sorry for Bell, because she really is good in her role. But back to the film. It's devoid of any scares, plot, character development and was just made to make a quick bit of cash for the company.It failed miserably here in the UK and never even made the top ten, but the sting in the tail is the ending, it flashes an idea that could have been good, and then finishes.So all in all, its a stinker, a really bad clunker that has a great performance from the lead and a good idea come the last minute, which makes me dislike the film even more",
            "review_date": "2013-06-16",
            "lang": "en"
        },
        {
            "review_title": "Surprisingly good. Much more enjoyable than the original.",
            "content": "The Last Exorcism part 2 abandons the found footage gimmick of the original and returns to more standard direction and storytelling style. This was a good choice because it really allowed Ashley Bell - who is the main strength of the movie - to show off her acting chops, and boy does she have them. She pulls off confused, afraid, isolated, innocent and then smoothly transitions into downright menacing in the final act. This is an actress I hope to see a lot more of in the future.There's nothing particularly original about the script, no real twists or turns that you don't see coming, especially if you're a common viewer of this type of film; but it's satisfying enough. The pleasure comes from a gentle, slow-burn directing style that focuses much more on creating an atmosphere of dread than on jump scares or gore. As a result, TLE 2 feels in some ways like a 70s horror that lost its way and found itself in the new millennium. I suspect that's why it's got such an unfairly low score on IMDb so far - because it really isn't made for the low attention span crowd.In a nutshell, an average script elevated into a more solid movie because of some thoughtful direction and a brilliant performance by the lead. 6/10.",
            "review_date": "2013-06-29",
            "lang": "en"
        },
        {
            "review_title": "Unnerving, underrated and utterly, unfairly treated.",
            "content": "'The Last Exorcism Part II', is an atmospheric horror that more than lives up to the first. Producer Eli Roth decided to take the original 'Lost and Found Footage' concept and turn it into a deep thinking, more traditional narrative. Set in New Orleans, which being the home of Voodoo and blessed with a natural underworld vibe, is just as creepy as hell. The great actress Ashley Bell, is (once again) amazing as the possessed young lady Nell. Can't understand the poor reviews at all, even from fans of the very first. Not sure if they will bother to make a third installment now but I'll certainly watch if they do. Ignore the poor reviews and get part 1 and 2 as a popcorn double feature (albeit a disturbing one).",
            "review_date": "2020-03-21",
            "lang": "en"
        },
        {
            "review_title": "A complete waste of time",
            "content": "This movie was really really really boring to sit through. Especially for someone that has seen quite a bit of horror movies. The first one was at least compelling and had a decent build up. This one has a horrible build up with bunch of cheap jump scares. They ditched the found footage direction and went with this piece of crap of a movie. This movie is just horrendous on so many levels. That it would take a long drawn out essay to describe everything that is wrong with this movie. And I am not even one of those audiences that are nit-picky. The actress that plays the lead in this did well in the first one. Since it had a lot of scenes of her acting abnormal and having demonic seizures and stuff. Not to put down the actress, but when she tries to act normal she just didn't seem to fit the lead very well. It like the people working on this movie hardly put any effort or just didn't care. I am surprised this movie actually made it into theaters.Rating: Awful",
            "review_date": "2014-05-13",
            "lang": "en"
        },
        {
            "review_title": "Not found",
            "content": "After the first movie being Found footage, this goes the \"traditional\" (\"normal\" movie) route. Of course it does make sense to have watched the first movie, before going into this. It does work without it (especially because you do get remarks and everything else you need to part 1), but it works better if you have seen the first one.When I saw the rating, I was expecting something much worse. And while it does have clichés and you will know where this is leading to (beware of some nudity and sexual situation if that \"destroys\" a movie for you), it also has some very nice touches - no pun intended. We get some people from part one reprising their roles (some expected some unexpected). Not great but still way better than generic stuff such as \"Nothing left to fear\".",
            "review_date": "2014-02-01",
            "lang": "en"
        },
        {
            "review_title": "Better than part one...",
            "content": "While \"The Last Exorcism Part II\" isn't a particularly great or memorable movie, it was at least better than part one. That being said, then the second part doesn't rise above mediocrity though.Story-wise \"The Last Exorcism Part II\" is an improvement up from the dull story in the first movie. Director Ed Gass-Donnelly does manage to build up the movie nicely and set up a continuous growing sense of thrill, which unfortunately comes to an untimely end in a very, very anti-climatic moment. Which was a shame, because up to that point it is not fully clear as to what is really going on. And from thereon it just went downhill.Ashley Bell really outdid her previous performance with \"The Last Exorcism Part II\", compared to part one. And she helped the movie along really well with her acting.The ending was actually interesting and did set up something potentially phenomenal. Yes, it was corny and predictable, but it was just the right ending for the movie.If you have seen the first movie, you definitely have to watch part two.",
            "review_date": "2015-12-31",
            "lang": "en"
        },
        {
            "review_title": "Yet another unnecessary sequel...",
            "content": "Oh, look, Nell is back for another round of possession. Jeez, how many false scares can you cram into one movie? There was a lot going on here without anything happening. It was like a bunch of ideas put together, but did not form a concrete plot or story. It felt like it was going in circles. This was a completely unnecessary sequel. There are some nice effects during the climax, but I'm afraid I've lost interest by then.",
            "review_date": "2018-06-04",
            "lang": "en"
        },
        {
            "review_title": "Great Looking B-Movie\u0085Forsakes Found Footage\u0085But",
            "content": "This Sequel has a Few Things going for it. The Rich and Beautiful Cinematography, the Creepy Ashley Bell Performance, and the Decision to Abandon the Found Footage, Shaky Cam Format that Spared the Viewer Nausea and Another Tiresome Trip into that Most Irritating of Modern Conventions. Curse You Blair Witch Project (1999).The Movie is Hampered and Buried by the PG-13 Rating that Inevitably brings about Jump Scares (no blood, gore or violence required) and there are at Least a Half-Dozen in the First Thirty Minutes. The Pacing is Slow and the Exorcism Itself is Anything but Exciting or Scary.The Ending is Sequel Friendly and it does Work to the Benefit of the Character's Demon Possessed Persona. The Movie is just too Laid-Back and Stiff, Managing to be Only Mildly Successful. But Most of all it is going to be Disappointing for Fans of the Original and Horror/Supernatural Buffs. Overall, Worth a Watch but it Ultimately is too Restrained and is Not Fully Loyal to its Subject Matter or Audience. Curse You PG-13 Horror.",
            "review_date": "2014-06-12",
            "lang": "en"
        },
        {
            "review_title": "Brilliant sequel",
            "content": "I don't agree with all the negative reviews. This film got going quickly. Nell was trying to get on with her life while there was a constant undertone and darkness that something still isn't right and abalam the demon is very much still there. I liked how the videos from Nell's exorcism end up on you tube and things go from bad to worse with creepy men in the shadows and enough frights to keep you glued to the seat. There were lots of good jumps and realistic effects. I ended up really rooting for Nell, and loved the ending when she turns evil... Leaving a wave of destruction in her path. Brilliant end.. Normally the demon gets expelled and hid in a box somewhere but Nell becomes abalam. Loved it all start to end.",
            "review_date": "2014-02-25",
            "lang": "en"
        },
        {
            "review_title": "Spoilers follow ...",
            "content": "This sequel to the 2010 film fore-goes the 'found footage' style in favour of a more polished, straight-forward manner of continuing the story. Happily, Ashley Bell returns as the previously possessed Nell, found skulking, glassy-eyed and terrified following her earlier ordeal. She is placed in a psychiatric hospital, which carefully helps her to adjust to 'real life' where she gets a job, tentatively begins a relationship with a boy and makes friends with the others who live in the home for girls where she has been placed. But bad dreams, sinister nurses, imaginary (or otherwise) happenings and dreams of an increasingly dark sexual nature are never far away.It's a slow moving picture, which may explain why it didn't eclipse the success of the original. And yet the time is taken to really allow us to know Nell as a person, and sympathise every time her delicate nature is fractured either by supernatural events, or the betrayal of her friends: in a clever development, the 'found footage' from the previous film has been loaded onto YouTube, and through that medium the other girls from the home become familiar with Nell's.Ashley Bell is excellent throughout. She conveys Nell's scripted unease with the world beyond her sheltered home-life with touches of surprise, curiosity and anger at the new strangeness around her, never quite sure of the apparitions she sees are part of 'normality', or fragments of her imagination \u0085As well as this notoriety, Nell has also been observed for some time by The Order of the Right Hand, a group who promise to help her. Calder (David Jensen) and Jeffrey (E. Roger Mitchell), who run the group, conduct an exorcism but the demon Abalam is too strong, and they inject Nell with a lethal morphine dose (cure or kill, it seems). The demon appears to her as she dies, in the forms of people she knows, beseeching her too take their hand. When she does, Abalam finally possesses her fully and she sets about killing all those who have let her down. To show Nell is truly irredeemable by this point, she becomes a fan of that (inexplicable) modern horror staple, heavy metal – because clearly, all horror fans also love hard rock music (we don't)! Despite that last detail, this film is a thoroughly enjoyable sequel and a good story in its own right. Even if it had been more successful (it still turned in a $10 million profit, so it didn't fair badly), it is difficult to imagine how Nell's story could possibly continue.",
            "review_date": "2016-02-13",
            "lang": "en"
        },
        {
            "review_title": "Pretty poor horror movie",
            "content": "The last exorcism part 2 (2013) is a very lackluster attempt at making a scary, entertaining horror movie. The film has many different things that are done wrong. The acting from the cast members really isn't very good, the lead has moments where her performance is believable, but overall I felt like her performance was very lacking. Her performance, while not that great, was at least better than the the rest of the cast, I'm not sure if the cast just didn't have a lot to work with material wise or if they're just bad actors, but either way, I was very disappointed. The writing is very basic, it seemed pretty bare minimum. It's like the screenwriters wrote just what they had to for it to pass as a movie and then just left it at that. The effects are so so, really there is nothing at all to marvel at in the special effects department. I really wasn't impressed at all by anything throughout the entire movie. There were a couple scenes where I was kind of interested and wanting to know what would happen next, but ultimately, that just lead to disappointment. In the one or two interesting scenes, the scenes immediately following are huge let downs. I was hoping they would do something interesting and really original at the interesting parts, but they just resorted to old tired bad horror movie clichés that most movie goers are very sick of. Unfortunately, the last exorcism part 2 gets a 3/10.",
            "review_date": "2017-11-12",
            "lang": "en"
        },
        {
            "review_title": "Middling",
            "content": "THE LAST EXORCISM PART II is the 2013 follow-up to the found footage hit and a sequel that tries to do something a little different. Ashley Bell is back as Nell, recovering from the events of the first movie and trying to regain something of a normal life by living in a halfway house and getting a job as a hotel maid. Unfortunately for her, the events of the past have a way of catching up with you and Abalam may not have finished with her just yet...I quite enjoyed the first movie, giving it a 6/10, but this sequel is a slightly lesser. It's not a found footage film this time around, more of a traditional psychological horror story, quite obviously low budget but fairly well acted and told. The first hour is overreliant on those jump scares that are the bane of modern Hollywood horror but things get better at the dramatic climax. Not great, but worth a look for fans of the original.",
            "review_date": "2021-04-22",
            "lang": "en"
        },
        {
            "review_title": "I shouldn't have listened to the bad reviews",
            "content": "For so long I avoided this film simply because of the awful ratings. I mean 4 on IMDB?!? Must be garbage, right? Wrong.If you saw The Last Exorcism 1, then do yourself a favor and finish the story. Don't go in expecting the world or anything, but it's an entertaining ride and finding out how things end for Nell is not a mistake. Was well worth the 88 minutes I spent watching, which, in the end, isn't that what matters?",
            "review_date": "2021-11-30",
            "lang": "en"
        },
        {
            "review_title": "Had potential, but failed to deliver.",
            "content": ">> MINI REVIEW << This film was just as average as the first. I was hoping it would be an improvement on the first, but I soon realized it wasn't. The story was nothing ground breaking, the \"horror action\" was lacking as I was wanting more blood or something, but it was like it was cut or something as every time you thought you'd see some gore, it would either pan away from the action or not show you anything. But what was I expecting when the film is only rated PG-13. My fault I guess. But this movie could have been something better if they had made it a higher rating and showed more carnage in my opinion. So I was disappointed by this film, so all I can give it is a 4 out of 10, because it had potential.",
            "review_date": "2013-06-12",
            "lang": "en"
        },
        {
            "review_title": "The first one should have remained the last one...",
            "content": "The first movie was incredible...especially since I didn't think I was going to like that one and almost didn't bother seeing it. However, this sequel doesn't match the first one's epic presentation in the least.Never have I seen a horror film sequel drop so dramatically with its quality than this film. The acting is awful, the plot is messy, the story is needlessly pointless and really didn't need to be told and, like the first film, there's no scares to be seen. However, unlike the first one, I can't forgive the lack of scares.In the first film, it didn't bother me that it didn't scare me at all because the acting was great and the story was interesting beyond belief but this one has none of that magic. It's flat, sloppy and the acting is nauseating.The first film should have been the only film because this film was just a failure.",
            "review_date": "2013-08-15",
            "lang": "en"
        },
        {
            "review_title": "HE'S COMING FOR YOU",
            "content": "I love the irony of having a part 2 to a film called \"The LAST Exorcism.\" That would make the first film \"The Next to the Last Exorcism\" a title that wouldn't sell. Since this is Louisiana, it should be \"Far From the Last Exorcism.\"First the disclaimer. I disliked the amateur attempt of the first film with the hand held camera. They dropped the hand held camera and opted for better effects.Nell is at a half way house via a medical ward. She has a day job as a maid and suffers from major \"hallucinations.\" It seems in order for the demon to get loose, he must impregnate a somewhat pure vessel and Nell is apparently the last Christian virgin on the planet. The plot was rather mundane for demonic possession films. The acting could have been better, but was par for a sequel. The movie opens with a quick, distorted, ineffective flashback that does nothing to help anyone who hasn't seen it.On the plus side of the film was the scare factor. It was able to effectively use sound, shadow, screams, background noises, and disappear/ reappear to create suspense and tense moments that would make most kids in a dark room go nuts. I liked the film for this reason, although I was not gaga about it. They at least did their homework. Now to bring it home with an effective script would be the next step. Makes for a satisfactory horror film rental if you just want the effect.Parental Guide: 1 F-bomb shouted by Nell. No nudity or sex.",
            "review_date": "2019-06-15",
            "lang": "en"
        },
        {
            "review_title": "A movie without a story to tell.",
            "content": "This film is the sequel to \"Last Exorcism\" and shows Nell's life after surviving the events of the first film and being found alive. However, the past will come back to haunt the girl once more. Being a sequel, I rarely have positive expectations and, in fact, I find the first film much more original and interesting. This film adopts a more canonical record and cinematography but has little history in that screenplay. More than half of the film is the young woman trying to rebuild her life, in an excessively long preparation for supernatural events. Here is missing a story, there is no real main plot and this is the biggest flaw of the movie. The film also fails to try to scare us with the jokes provoked by sound effects. It irritates more than it scares. Blame the unfortunate and shameful Ed Gass-Donnelly, director of this misery, or Damien Chazelle, who wrote the script, probably, on a kitchen notepad. What still keeps the film minimally cohesive is the regular performance of Ashley Bell, the protagonist. Even so, she does not shines as she did in the first film because of sheer lack of material to work with.",
            "review_date": "2017-02-15",
            "lang": "en"
        },
        {
            "review_title": "another \"Exorcist\" reject",
            "content": "\"The Last Exorcism: Part II\" is a run-of-the-mill tale of demonic possession whose every \"thrill\" is telegraphed miles in advance.Ashley Bell is a young woman who is sent to live in a home for troubled girls in New Orleans after her family is killed, probably as a result of their membership in a satanic cult (I have no idea if familiarity with the first film is helpful in understanding this one, but it probably couldn't hurt). Weird things keep happening as the forces of evil mount their assault on the most hapless, put-upon little Nell since \"The Old Curiosity Shop.\"It's hard to tell which is more tiresome and hackneyed - the demon-possession scenario replete with oodles of exorcism rituals and Satanic mumbo-jumbo, or the employment of every horror movie staple from false scares to levitating bodies to figures skittering by in the foreground of the picture. There's very little about the movie that feels original so we're left to ponder all the better versions we've seen of the same story while ticking off the minutes till the closing credits come crawling by.",
            "review_date": "2013-09-11",
            "lang": "en"
        },
        {
            "review_title": "The Vidiot Reviews",
            "content": "The Last Exorcism 2 If repossession is as recurring as this title suggests than we might as well consecrate hairdressers.However, this horror movie isn't too concerned with combing cranial conveniences.Nell (Ashley Bell), the notorious demonic vessel, is recovered after her exorcism went viral.Unresponsive, Nell is placed in a girls' home where she slowly begins to come out of her shell.But just as things normalize, and she meets a boy (Spencer Treat Clark), Nell is revisited by the demonic spirit that possessed her previously.While it urges her to unite with it in order to unleash Hell on Earth, Nell resists its proposition with the assistance of a clandestine organization.The unsatisfying sequel to the surprisingly spooky original, Part 2 picks up after its predecessor, but fails to follow in its fear-inducing footsteps.And to finally get over Nell, all this demon needs is someone to have a one-night possession with.Red Light vidiotreviews.blogspot.com",
            "review_date": "2013-06-25",
            "lang": "en"
        },
        {
            "review_title": "Troll movie",
            "content": "Well, I'm not a filmmaker but I'm pretty sure this has got to be technically one of the worst movies ever made. Although I think the 1st one is actually a pretty decent movie with a good mystery plot and a good opinion on a faithless preacher, this sequel seems more like a troll movie they released just to laugh at how many people would actually pay to watch this lazy piece of work.It is like they only had a loose idea on the plot and just decided to fill in some random scenes until they achieved 90min of footage. There are many scenes which just doesn't make any sense followed one by another, and when you see a horror movie trying to scare you with a barking dog in a daylight street scene, you know you've reached a new low standard.Its pretty sad to see movies this bad being released. This seriously shouldn't even be considered \"professional work\". Don't waste time with this movie.",
            "review_date": "2013-08-04",
            "lang": "en"
        },
        {
            "review_title": "This Film Needs Exorcised.",
            "content": "The Last Exorcism, Part 2 (2013): Dir: Ed Gass-Donnelly / Cast: Ashley Bell, Julia Garner, Spencer Treat Clark, Tarra Riggs, Muse Watson: While the first film had amusing elements regarding phony preachers and the whole reality take on things, this sequel is standard and boring. We are given flashes of the first film during the credits then possessed Ashley Bell ends up in some strange couple's bed and eventually in their kitchen. Then she ends up at a halfway house in hopes to make her normal. She is in the wrong film for that sort of help. Bell is a talented actress but her role here is laughable. Apparently the demon possessing her gives her massive orgasms in her sleep while her body elevates and arches above her bed in a display that would leave pornographers in envy. Julia Garner plays the standard brat out to make Bell's halfway house experience more embarrassing. Spencer Treat Clark plays that standard guy out to possess Bell sexually. Tarra Riggs is laughable as this spiritual woman out to exorcize her. Muse Watson has the laughable role of landlord of sorts for a home for girls. Perhaps these girls were locked away so that they could not flee the set. This is all visually well made and directed but very bloody stupid. It is just a money grab with no other reason to exist. This film is so bad that the only good it can do is to be tossed in a garbage disposal and possess that for a few minutes. Hopefully Miss Bell will not be remembered for this forever but one must wonder whether she would react with the same facial actions if this junk ends up summing up her career. Best wishes for her. Score: 2 / 10",
            "review_date": "2015-05-15",
            "lang": "en"
        },
        {
            "review_title": "I hope this has indeed been \"The Last.\"",
            "content": "The first The Last Exorcism had some attraction. Maybe because it was new, maybe the idea of ​​camera in hands cause some tension, committed actors, motivated direction. But the small success seems that rose to the head of the producers of this 2nd movie. Apparently it was thrown on the market anyway, relying on the \"charisma\" of Ashley Bell, which, face it, is not enough to carry a movie. Thus, poor direction, cast idem and shallow script as a saucer resulted in a little less than lousy movie. The lack of imagination and objectives is visible all the time. No suspense, everything is predictable. The \"exorcism\" itself is unworthy of the worst movies of possession. And the final verged on the ridiculous, with special effects of 5th grade. The producers, please , ask God to help make the next movie.",
            "review_date": "2014-01-26",
            "lang": "en"
        },
        {
            "review_title": "Very Lackluster Sequel",
            "content": "After the previous events at her farm home, Nell is found insane when trying to explain what happened to her and her family. After medical and psychological treatment, she's sent to the Deveraux transition house in New Orleans managed by Frank Merle, who helps her to start a new life. As Nell starts to become more confident she finds a job, befriends her roommates, and develops a crush on a coworker. As time passes, though, Nell starts to see visions of her father and he seems to warn her that the demon who previously possessed her still has a hold on her. Seeking help, Nell meets Cecile who tells her that she has been watching her since her hospital release, and that she can help. Now it's a race against time to try and exorcise the demon before it takes complete control of Nell once again.OK straight to the point here....the first movie wasn't bad....this one sucked. The 1st movie was decent because it was a \"lost footage found\" movie and was pretty creepy, but this sequel is shot as an actual movie and is most definitely is not creepy. The main reason why it was so bad for me is that it just didn't go anywhere or do anything. It was in no way creepy or scary and it most definitely didn't have the same eerie atmospheric feel as the 1st film. There is the odd moment here and there where you think \"finally - it's going somewhere!\" only to see that it comes to a dead end once again.Ashley Bell, while doing a decent job as Nell, didn't really play the part as good as she did in the 1st. There were too many moments where she jumped at different situations and looked like a rabbit caught in the headlights. Although, after living through the events of before I guess Nell WOULD be jumpy and timid.The best part of the movie by far is the last 10 minutes or so, and it's this that saved it from getting a lower rating for me. Overall, The Last Exorcism II is boring, non-eventful, and just really a waste of time.Do yourself a favour - give this one a miss.",
            "review_date": "2015-01-18",
            "lang": "en"
        },
        {
            "review_title": "Painfully slow and stupid",
            "content": "BORING. Nothing much happens, no fear, bad acting, just a painfully slow experience.",
            "review_date": "2021-03-14",
            "lang": "en"
        },
        {
            "review_title": "Sequel outdoes the Original",
            "content": "I wasn't a big fan of the \"The Last Exorcism\"; for myself it was an average scare flick, not a really a gem of the genre. The creatively titled \"The Last Exorcism II\" however is an inspired and creepy journey towards one woman's and perhaps humanities doom. The low score you'll see on the home page is due to a lack of imagination in today's average movie goer. A great deal of suspense built into this movie is visceral...it's what your NOT seeing that is disturbing. And that is what ticks me off about the low scores. Okay...so there's no monster chopping off heads or people being physically tortured or women showing their breasts. So it burns a little slow...so it uses atmosphere and environment to build tension, is this a reason to rate it low? If you have no imagination and can't focus on a movie for more then 10 minutes if there's no blood or CGI monsters to be found then yes....I guess it is. The director's behind this little gem hopefully are off to make even better movies and I look forward to what they can do in the future. Well done! Fans of demonic movies with a little bit of intelligence...this flick is for you...fans of gore and sex ONLY...steer clear.",
            "review_date": "2014-06-20",
            "lang": "en"
        },
        {
            "review_title": "A sequel to the LAST exorcism...let that sink in. If you liked the first one you will like this too...maybe. I say C-",
            "content": "\"He's still out there, Abalam, the demon.\" After Nell (Bell) the only survivor of the fire is placed in a home to restart her life she is worried that her past will catch up with her. It's no surprise when it does and the demon begins to not only affect her but those around her, and this time it's more powerful. I have to start by saying I thought the first one was lame, so if you liked it keep that in mind with this review. There are few technical problems I had with this movie to start with. First the title...Last Exorcism 2, either it's the last one or not make up your mind. Second the first one was a fake documentary type and this was filmed like a normal movie, why the change in style? That nitpicking out of the way I feel the same about this one as the first one. Very boring and nothing really happens. She pretty much walks around trying to be normal and everyone reminds her of her past...over and over. So if that's what your looking for have fun. There really is nothing else I can say about this, I did not enjoy it. Overall, if you liked the first one you may like this one too. I didn't. I give it a C-",
            "review_date": "2013-05-08",
            "lang": "en"
        },
        {
            "review_title": "A bad horror movie that only a true horror buff would love...",
            "content": "Certainly not the best horror movie ever, but certainly not the worst either. Many of the reviews say this is the worst movie ever, but I disagree. It fits the genre of what it came from perfectly, with all it's bad writing and boring scenes and lame attempts at scaring you with loud noises and whatnot. I actually wish they would have delved more into the story and explained a little more, and also wish they would have made the last few scenes more gory and dramatic than they were, but it lives up to my expectations.Of course, I really enjoyed the first one much more because I am a fan of the Blair Witch camera-jumping-around documentary-type horror films, and although I am sad to see that missing from this one it was still worth watching. Could it have been better? Definitely. Was it the absolutely worst waste of time in a film ever? Not at all.Perhaps it depends on what type of movies one enjoys, but me, I prefer anything bloody, anything twisted, anything paranormal or supernatural and anything scary, but maybe to a more mild movie-goer there are better movie choices than this one, as far as bad horror goes, I have seen my share and this one really was not -that- bad.I would admit to hoping they'd make a third! However, based on the ending I think they are calling this storyline quits. But, I wouldn't mind seeing this story continue.",
            "review_date": "2013-06-20",
            "lang": "en"
        },
        {
            "review_title": "\"The Last Exorcism Part II\" is as absurd a horror film as its title suggests",
            "content": "Sony Pictures Home Entertainment has generously released \"The Last Exorcism Part II\" on Blu-ray and DVD for those smart enough to have avoided it in theaters, but brave (or stupid?) enough to give it a chance at home. I know it's too late for some. Hopefully, my review can still save thousands of others from making the same mistake I did.Eli Roth's \"The Last Exorcism\" was a \"found footage\" movie I really wanted to like. Against my better judgment, I went to see it in the theater and weathered through the first 70 minutes fighting off motion sickness the entire time. I was pleased with it until it unraveled in the last 5 minutes into a disappointing blend of \"The Blair Witch Project\" and \"Rosemary's Baby.\"\"The Last Exorcism Part II\" picks up with Nell Sweetzer going to live in a girl's home after the tragic events of the first movie. Things seem to be going well as she settles in to her new life by making friends, getting a job, and experiencing her first romantic relationship. Unfortunately, the demon Abalam has followed her to New Orleans and is jealous of her newfound friends and love life. He wants Nell for himself and will stop at nothing to re-take her soul.How I thought a follow-up with the ridiculous title \"The Last Exorcism Part II\" would undo any of the damage done by the first film's pedestrian conclusion remains to be seen. It's my own fault for having ANY expectations going into this completely unnecessary sequel. To say there's no reason for this to exist would be foolish, as the box office take proves otherwise. Good or bad, it paid for itself and made enough money to justify its existence financially.There are a couple positive aspects I can talk about in regards to \"The Last Exorcism Part II.\" Ashley Bell's performance as demon-oppressed Nell Sweetzer is so captivating and heartfelt that it gives the movie an emotional depth it doesn't deserve. She's been rightfully compared to Sissy Spacek in \"Carrie.\" Bell is destined to shine in much better films in the future.The second thing that makes this movie easier to stomach than the first is its lack of shaky-cam cinematography. What you see on screen might be mediocre and dull, but at least your eyes can focus on it. You'll have no need for an airplane barf bag when watching this.Everything else found in \"The Last Exorcism Part II\" is recycled filler at best. We're supposed to believe the demon is in love with Nell. This is displayed in an awkward scene where she is levitated off her bed \"Exorcist\" style and then sexually manhandled by the invisible Abalam. All this is happening right next to her sleeping roommate.The physical embodiment of Abalam is laughable at best. Basically, it's a person in regular street clothing and hoodie wearing a mask for a masquerade ball. This is the best idea Co-writer Damien Chazelle and Director / Co-writer Ed Gass-Donnelly could come up with?Although the rest of the movie is nothing to get excited over, the climax and ending of the film is where it completely falls apart. Once again, a horror movie about demon possession finds the \"good guys\" seeking out a solution to the problem through other avenues besides the obvious. It's convenient that in every one of these movies there's never a priest or pastor around who truly has strong enough faith to exorcise the demon from the victim.This time, a secret organization known as the Order of the Right Hand who use Haitian voodoo rituals and the conjuring of Baron Samedi is called upon to lure the demon out of Nell's body. Use the powers of a Haitian Voodoo spirit known for disruption, obscenity, debauchery, and his love of tobacco and rum to battle a demon intent on possessing a girl? If it doesn't sound like this strategy makes a lot of sense, it's because it DOESN'T!Extra features for the DVD release of \"The Last Exorcism Part II\" are more entertaining than the movie itself. A featurette entitled \"Hair Salon Scare\" shows people getting groomed in front of a two-way mirror. The image of a freaky girl resembling Nell appears through the glass and scares the customers. The \"Shooting in New Orleans\" featurette will interest anyone wanting to watch Producer Eli Roth make a fool of himself by admitting he had any part in the making of this dreadful film.\"The Last Exorcism Part II\" is as senseless story wise as its name. It's a string of redundant horror movie clichés only held together by Ashley Bell's wonderfully plausible and overly qualified acting. Count yourself blessed if you haven't already wasted your time watching this mess.",
            "review_date": "2013-07-16",
            "lang": "en"
        },
        {
            "review_title": "Worst then the first movie of The last exorcism and that was awful.",
            "content": "This movie got a 4 which is not that good. But still this is such a bad movie 4 is overrating it. I can not believe how bad the story line is in this movie. I never thought I would see movie worst then The last exorcism. This movie is so stinky. It is not scary. It is just really stupid. It is nice to see that people don't like it. Because some really dumb crap has been popular. I was afraid this might have been popular because it is so stupid and pointless I was afraid people might like it. But people don't like sequels when there good. This is a sequel that is crap. The ending is awful. Do not wast time and money. Do not see this movie. It is pooh pooh.",
            "review_date": "2016-03-11",
            "lang": "en"
        },
        {
            "review_title": "Can I sue people for wasting my time...?",
            "content": "...apparently not. To be honest, it didn't waste all of my time, because I dozed off on my first viewing. This is NOT an exaggeration. I LITERALLY fell asleep, while watching this movie.So I had to re-watch it, while battling myself, not to play with my smart-phone, read twitter, surf the web, check if my attempt of fixing the dripping tap in the kitchen worked, watch the paint on the carport dry or cut my front-lawn with a nail clipper......in other words, this movie is boring. It picture is a tedious waste of time and it's only reason why it was made, is to cash-in on the moderate success of a decent horror-movie. The most annoying thing is, that the basic idea behind its plot is really clever but the execution... is exactly that: An execution.",
            "review_date": "2013-08-05",
            "lang": "en"
        },
        {
            "review_title": "The last time a trust a sequel",
            "content": "This second movie brings to the spot-light on Nell Sweetzer, the girl possessed by a demon in the first film. She is found in the woods alone and terrified. Is brought to a hospice for girls to try to rebuild her live and find peace, so she is offered a job as housekeeper and meets a boy but her problems do not end because she has delusions and dreams that make her remember the ordeal she went through. With the help of Mrs. Cecile she finds that the demon hasn't left her and some of it is still inside of her, so now with the help of a few friends of Cecile will have to remove the demon from her.A movie even worse than the first, one could follow but this is too much. It's more like a joke.Not only the fact that the whole movie nothing happens and when towards the end finally did but even then it's just as disappointing.",
            "review_date": "2013-08-27",
            "lang": "en"
        },
        {
            "review_title": "A banal horror",
            "content": "A banal horror with not many pretensions with some scary points but for the most part quite senseless with a plot difficult to understand because wrongly intertwined. The finale wants to be a twist where the protagonist stops fighting against her demon and accogles him but in reality it is made meaningless and very in a hurrye coarsely.",
            "review_date": "2021-07-25",
            "lang": "en"
        },
        {
            "review_title": "Seen it before, see it again, and again. Plese I haven't had my fill yet.",
            "content": "Um, what's there to say, it's bad. But it's that weird kind of bad. It's full of weird people, and plot points, and just plain weird scenes. The characters and their acting range from bland to....a lighter bland. Before the last ten minutes, it was pretty straight forward that Nell is batsh-t insane, there ain't no demons, came on. This is pretty much the things people in the real experience, and claim to be some possession BS. I honestly couldn't tell if any of the characters were good, they were all just so strange, I was suspicious of everyone. Really, I juts can't focus my thoughts, this film was so jumbled. There are so many pointless moments, like that guy commanding some light tree thing, right after Nell was having her...sex...dream thing. Or that statue guy during the parade. I don't know, this movie was overly sexual, numerous times throughout the film Nell listens in on people doing it, she dreams about it constantly, she looks like she wants some Gwen, she at the end she even licks her face. It's just stupid, maybe it symbolizes the fact she has to be the Devils baby mama, it's just dumb. It's time to talk about clichés. First on the list, birds flying into the windows, that's three horror films in 2013 alone that have that happen, my god. Second, the static T.v., that plays mysterious video of Nell. I'm surprised there is no levitation or contorted movements, oh wait, you'd at least have to put some scary scenes in the film to do that. Yeah that right, not one, and I am dead serious when I say not one, single second of this movie tried to be scary. People having seizures, not scary. Creppy guys on demonic phones, not scary. There isn't even any of that stupid jump scare music, or any loud noises for that matter. Even the lowest budget, quarter ass-ed, garbage on Netflix tried harder than this. And yes, Nell looks like she's at least 30 in this film, even though she is only 17, they did even try to hide her aged face.And lastly, the ending. Nell switches over to the dark side, she magically UN-restrains her self from the table, and takes the imaginary devils hand. She really just grasped at the air. Oh, yeah this had a 30 second exorcism scene, YEP, 30 seconds, wow. Then they just gave up and pumped some poison into her, which was clearly a mistake in such a time sensitive moment. They should have just bashed her head, but no, the film wants to set itself up for a continuation. It ends with Nell becoming some type of X-men/Carrie wannabe.Now I remember why I didn't go to the theatres to see this, well it's still better that The Conjuring, whoops.",
            "review_date": "2013-09-02",
            "lang": "en"
        },
        {
            "review_title": "Hard to say...!",
            "content": "When seeing this film, I wasn't expecting much. Watched it with an open mind!It was an OK sequel, no amazing! The first one was original, but this one just didn't have as good a story-line! It starts out with some flashbacks from the first film & Nell is trying to put her life back together but doesn't remember much from what had happen in the first film. It then turns out that the evil spirit is still after Nell & she sees things like the ghost of her father! She starts getting suspicious of certain things etc.It was an OK film! Although the reason for my 5/10 rating was down to the ending! Yes, the ending! I found it hard to grasp weather they were killing Nell or helping her! It didn't add up! Plus she excepts being evil? Come again? Didn't like that whatsoever! Then she kills them goes back to her home & kills frank & the girls. Goes into Frank's truck & drives around while crash catch fire & blow up? That ruined the film! Big time! Just didn't cut it for me!I'd say the ending was the biggest let down here the rest of the film was good! I was hoping that the ending would be a case of Nell getting cleared of the demon possessing her moving on with her life then the film ending on a positive note! But no! A Crappy ending had to be done!Overall an OK film with a crappy ending! 5/10",
            "review_date": "2013-03-15",
            "lang": "en"
        },
        {
            "review_title": "An Exorcise in Bad Movie-making",
            "content": "If you were one of the many viewers of The Last Exorcism who was pleasantly surprised at it in terms of quality and scariness, consider me among your peers. Joining the ranks of movies like REC and Troll Hunter, The Last Exorcism was another example of the strengths of using the mockumentary/found footage style popular in horror today. These films dictate that less can be more when conveying scares. The Last Exorcism Part II, however, is an example of how building on those successes with a bigger budget and wider platform does not equal automatic quality. In fact, The Last Exorcism II is just terrible. The story continues the tale of Nell, the subject of the doomed documentary of the first Last Exorcism. We last saw Nell held captive at some kind of satanic ritual before the film ended in grim fashion. In the follow up, time has fast forwarded some and Nell has not only somehow survived the events of The Last Exorcism, but she has escaped to the big city and been placed in a halfway house for troubled women. At first it seems like she may be able to move beyond her troubled past, until of course \"creepy\" events transpire that show things clearly aren't getting better.There really is nothing redeeming here at all. As the plot develops, viewers are treated to run of the mill scare tactics that were played out the last ten times they were copied in equally abysmal films. Any semblance of creativity that was present in the original Last Exorcism has been replaced with economy rate, cookie cutter filmmaking. The end result is so yawn and eye roll inducing that it could easily make my most disappointing sequel list of all time.",
            "review_date": "2013-08-12",
            "lang": "en"
        },
        {
            "review_title": "The \"second 'Last' Exorcism\" probably should've been a prequel, eh?",
            "content": "Although not a wholly unwatchable effort, at one point I half expected Col. Sanders to strut out of the closet draped in his seersucker suit while wielding a chicken leg in one hand and a slice of cantaloupe in the opposite. Not that this movie is just simply dripping with disdain and the \"soft bigotry of low expectations,\" but it certainly lends proof that west-coast studios should stop making 7 million dollar movies in New Orleans just for the tax credits—especially when the directors appear to have never really been outside the French Quarter during a Mardi Gras stint. I can almost see them between takes just a slurppin' away on their sugar-infused \"hand grenades.\" I'm not an African American or an apologist for anyone, but this movie drove me up the wall with its predictable stereotypes of black southern culture. Take for instance the use of, \"Good Lord, Chile\"???—wooow, thanks for that nugget of brilliant and original screen writing. Why not just add a: \"uh, yessa Massa, I'll get you a new quill pen right away\u0085\" Or maybe a:\"Hey Absalom, have you seen my mint julep anywhere?\" And despite what the liberals in Lalaland, CA obviously think, not everyone that is a janitor or a caretaker in Louisiana is an African-American wearing a hairnet like the lunch lady. And I thought I might get lucky, but nope—apparently horror movies \"in da' bayou\" require at least one pseudo-Voodoo hair cutting scene replete with the fedora wearing, slide-guitar playing black man belting out redemption songs like we're still running the Underground Railroad up to the Promised Land. Thanks again for those little misnomers—sure not promoting any stigmas down here. But to his credit, at least our \"Buffalo Soldier\" was tearing up the minor pentatonic scales pretty convincingly.So in the land of over-sized Drosophila flies, analog radios, and tube TV's as big as a Prius, you might find a mild interest in this sequel-should-have-been prequel if you immensely enjoyed the original. But you'll probably find more justice in watching \"the first Last Exorcism\" for the second time. Salvage some of your dignity by flushing this one straightaway, and asking \"why?\" later.",
            "review_date": "2013-06-21",
            "lang": "en"
        },
        {
            "review_title": "This demon should have stayed away",
            "content": "So, the exorcism is back with a vengeance. The producer earned such a lot of dough from the first movie that he thought he would try and repeat his success with a second part. However, this time around the movie is so filled with cheesy horror clichés that it felt like the exorcism was being performed on me. The ending is equally bizarre where the girl who was runningfrom the evil forces all throughout the movie from fear of destroying herself and the world suddenly accepts him. I thought she would be happy to die. There are no real scares and this time you are served with bland rubbish. Stay away or go for the \"The Conjuring\" or rewatch \"Insidious\".",
            "review_date": "2013-08-16",
            "lang": "en"
        },
        {
            "review_title": "More like \"The Last Time I'll Ever Watch The Last Exorcism: Part 2\"",
            "content": "\"The Last Exorcism: Part 2\" follows literally every single horror movie cliché in the proverbial book. Of course, the movie has a scene of an evil priest spewing awfully written, cryptic dialogue about how the demon will win. Of course, while our somehow plain but incredibly attractive protagonist sits in a church, birds smash against the windows, killing themselves. Of course, there is a scene where our lovely, gorgeous (I am single) protagonist sits around a kitchen table with some mystic who tries to reach out to the spirits for help, and it goes wrong. Of course, there is a scene where our beautiful, 10/10 protagonist gets upset and her anger causes the person she's upset at to convulse, collapse, and die. Of course, there are talks of a prophecy. Of course, there are scenes of masked men eyeing up our protagonist from afar (but can you blame them?). Of course, there are dream sequences, there are scenes where someone magically floats up in the air while they are sleeping, there are scenes were our protagonist thinks she's crazy and other people are telling her to relax and that the demons and devils are all in her head, someone is at the other end of the street and they suddenly disappear whenever a car passes them by, stop me if you've seen literally all of this before, perhaps in the 1960s when these things were actually clever.God damn it, I'm really an easily amused person, and I fu*king love movies. I own thousands of movies, I've spent thousands of dollars on DVDs, nothing, and I mean nothing, is off limits for me to watch. I'll watch something with low scores and enjoy the hell out of it because of the sheer entertainment value, I'll watch something with high scores and find it pretentious and boring, but I'll still revisit it a second, a third, even a fourth time in order to pick it apart and see what I missed. For example, I gave \"Blade Runner 2049\" a low score, but I still bought it and watched it again to see if my opinion changed (it didn't). The point is I. Love. Movies. They keep me going. I'll watch anything, but horror movies especially are important to me because of the sheer amount of variety that can be displayed in them. So believe me when I tell you that I have never seen a lazier attempt at a \"horror\" movie then this, and this is coming from someone who absolutely adores \"The Last Exorcism\" part 1.I've read the directors AMA on Reddit, and he seems proud of this film. Good for him, I mean it, because that guy is making movies and I'm not. But for the love of God, why, why, why did he choose to throw in absolutely nothing original and nothing creative? It's like instead of thinking up something himself, he instead recently watched \"The Omen\" and decided to copy direct scenes from that film, and every other horror film ever made.Because of that, this film is so God damn boring. I'm a patient man, but I couldn't watch this movie in one sitting, I couldn't do it. I watched an hour and then went to bed because of how excruciating it was to watch, and then I finished up the remaining 30 minutes the next day, first getting plastered from chocolate liquor and whiskey to prepare myself because I'd be damned if I was going to watch the rest of this mess sober.When it comes to the chocolate liquor, I'm a 22 year old man who still lives with his mother so I had to make use of what was stocked in the cabinets. My mom enjoys mixing chocolate liquor with chocolate vodka, but I decided to not even mix the 2 and just to take shots of both separately. The liquor smelled and tasted exactly like chocolate syrup, and if that sounds gross to take shots of then you'd be right. The vodka was somehow harder to stomach. While it did smell like chocolate, it burned my insides up real good. Literally, just a sip made my chest burn, almost as if I was the one getting possessed and not Nell. Either way, after 3 shots of each I was sufficiently drunk enough to sit down and finish watching \"The Last Exorcism: Part 2.\"0/10No I'm just kidding, the movie isn't that bad, even though it is a generic piece of studio produced trash. I have to admit that the actress who plays Nell, Ashley Bell, is undoubtedly good, playing her with enough nuance and emotion that in a better film she may have even been nominated for an Oscar. Julia Garner is also a ton of fun to watch on screen, and she has the nicest hair I've ever seen on anybody, I mean good God she rocks that hair, she flexes nuts. Now, I may or may not still be drunk while writing this but think about what I just said. Ashley Bell, and Julia Garner, are the only good things about this movie. Their level of dedication to this film is admirable, and their care for the material and acting ability really does shine in this. Those two women are the only enjoyment you'll get out of this movie, and is the only reason this film is worth watching. That being said, I would never recommend this film to anyone, under any circumstance, ever.\"The Last Exorcism: Part 2\" is a colossal disappointment, and it doesn't even star Anne Hathaway. If you want to watch this movie, don't. I should've taken the advice of every other critic ever, because this movie was a battle to sit through, a battle I felt like I lost because instead if giving up, I decided to watch the entire movie. If you watch this, you'll be bored out of your mind and you'll find yourself praying to Abalam for sweet, sweet release. Come to think of it, maybe that was the intention all along...2/10",
            "review_date": "2018-10-31",
            "lang": "en"
        },
        {
            "review_title": "This movie is excellent!",
            "content": "I cannot believe some would slam this movie, the tension is over the top, the plot and undertone is exactly what Horror is about. If you like Monster movies like Jason part eighty-nine or Michael comes back as a poodle, then this isn't your movie, but if you like that which is truly scary... welcome home. This movie is flipping amazing. The Exorcist is and will always be the best Horror flick of all time, the Omen series is a close second, I feel that this movie is in this class as is the first. The end fills your head with evil joy and left me craving more. No, this is not full of super scary moments and constant action and fear moments, the fear is much more in the mental undertone keeping you wondering Holy Hell w.t. $%&^!!!",
            "review_date": "2013-06-18",
            "lang": "en"
        },
        {
            "review_title": "Worst horror movie ever",
            "content": "I haven't watched the last exorcism 1 but the 2 disqualifies everything...\nMovie is booring, meaningless, and has low and poor suspence. What's the big deal about Bell floating over her bed\nThis whole movie is fluke",
            "review_date": "2021-01-05",
            "lang": "en"
        },
        {
            "review_title": "Save yourselves from evil!",
            "content": "Poor Nell Sweetzer, having given birth to a demon-rape tentacle baby she is now surely entitled to relatively happy life right? Maybe find a little job cleaning out motels? Perhaps even a dorky boyfriend to eat some frozen yogurt and hold hands with? Wrong! Hooray! The Last Exorcism (part two!) has come along to do a great big smelly poo on Nell's nice normal future. Our intrepid bendy scream queen has somehow survived the horrible events of the first last Exorcism (part one!) and has now been popped into a home for wayward girls in the spooky town of New Orleans. Most people go to the Big Easy and have a lovely holiday exposing themselves in public, stuffing their faces and getting drunk being top priority. Not poor Nell. It seems her demon has fallen in love with her and wants her back forever and ever\u0085and EVER *maniacal laugh* Enter the voodiennes and exorcists for another cage match with Satan's little helper.I liked the Last Exorcism, there I admitted it. I am a sucker for found footage and mockumentary. Where its predecessor had an interesting premise executed in an interesting way with humour and a good dose of fun, this sequel does not. Nell does not really have enough of anything about her as a character to justify a whole movie based around her quite simply. The story is nonsensical devil-in-my-daughter pointlessness culminating in an ending which invites more stupid sequels which are seemingly now inevitable.Utter stupid idiocy which actually makes me pity the makers of the Scary Movie franchise, perhaps it isn't their fault those movies suck so badly. It is pretty hard to parody something which is bloody dire to begin with after all. As a horror fan, I am almost embarrassed that I sat through this film, I will give most things a watch and the first movie was pretty fun so I gave this one a try. Save yourselves the trouble and don't bother. Watch the first one again instead or something- urrrgh I'm lost for words!",
            "review_date": "2013-06-22",
            "lang": "en"
        },
        {
            "review_title": "Not a bad sequel, but not great either",
            "content": "Not sure why this movie evoked so many negative reviews. A sequel always has more potential if it tells the next chapter in a story, rather than repeating the same story again. THE LAST EXORCISM II does that, following Nell Sweetzer on her journey from the farm to the big city, and how the demons still haunt her and want to possess her permanently.Make no mistake about it, this is an Ashley Bell movie. Her amazing physical dexterity shown in the first movie is used again in this movie, along with a greater range of emotions than just sweet and innocent turning into demonic rage. And the vehicle that the script uses to further the attempt at her possession is a sexual one, rather than a violent one. Fortunately, the movie chooses to be suggestive rather than gratuitous, and could have easily fallen off the slippery slope of being too overtly sexual. What didn't work in expanding Nell's character in this way is that she is supposed to be 17, yet she and the other girls living in the halfway house all look to be in their mid 20's, far past the time when schoolgirl crushes and giggly behavior look plausible.The title of this movie is a bit misleading, as only a small portion of it is dedicated to exorcising her demons, and that section is too quickly glossed over. And the man leading the exorcism transitions from supremely confident to frightened and incapable as if his character's placement in the movie was an afterthought.The ending shows Nell overtaken by her demon, paving the way for a third installment, rather than proclaiming some sort of victory or redemption. Kind of a letdown, but not nearly as much as the ending of the first movie.",
            "review_date": "2014-09-28",
            "lang": "en"
        },
        {
            "review_title": "The Last Exoricsm Part II: Made to fool you all.",
            "content": "I couldn't wait to watch The Last Exoricsm Part II as I was impressed by the first, and we were left with a cliffhanger which made me feel like I had to see more. But that's where I was wrong. The trailer and film cover made it look exciting, the trailer was showing the best (the only) good parts of the film. The story focuses strictly on Nell rebuilding her life after the events of the first film but the demon is still wants control of her. Throughout I was waiting for the story to unfolded but that moment never came. The exorcism itself was left until 10 minutes until the end and wasn't what I expected to see for that huge build up. I barely connected with any of the characters apart from Tarra Riggs who played Cecile who did a fantastic job of performing a ritual at the end of the film. The Last Exorcism Part II is not on my recommendations list because the director has fooled you all by making this unnecessary film and is probably laughing as he takes your money.",
            "review_date": "2013-06-09",
            "lang": "en"
        },
        {
            "review_title": "This is not a Horror Movie",
            "content": "At first I'm really interested when this movie is going to launch because I really like the first one. But lately after I watch this movie I want to say \"What The Hell I'm just watching.\" The prologue is good, it tell about the first movie like a synopsis. But after that, the movie is just like a drama. The Horror Feeling is suck and I can't feel the horror at all. After 20 or 30 minutes or so I just kept fast forwarding this movie little by little until the horror began. But there's no horror at all. Just Drama. And then I ask my friend who already watch this movie and they agree with me. It's just Bad. The maker of this movie just ruin all the greatest horror movie from the first one.",
            "review_date": "2013-06-18",
            "lang": "en"
        },
        {
            "review_title": "Not a Worthy Watch!",
            "content": "The ending was a bummer, especially since the girl was so interested in fighting off and leading a normal life .... after all, committing suicide is wrong ... not being killed ... she could have rather saved her soul than giving up and embracing evil!! A VERY wrong message sent to youngsters out there ... it is IMPORTANT to understand there's nothing that God can't do .. we just choose not to LET HIM! She had a choice ... she just chose to go to the devil ... Be warned and stay away from giving in to such beliefs ... Demon is and was NEVER powerful than God ... Stay steadfast in faith and don't fall his deception! God is there for us always and died for us ... he is ready to do everything to save us ... Just Pray and Trust Him.",
            "review_date": "2014-11-09",
            "lang": "en"
        },
        {
            "review_title": "Not too bad.",
            "content": "How can anyone say this is rubbish. The first film...now that was cheesy rubbish and I couldn't take it seriously. This one is much better and deserves to have the horror tag. The first was sooo annoying because everything the priest saw with his own eyes be always discarded and it was getting boring in the extreme.Forget the bad reviews this is ok.",
            "review_date": "2019-04-17",
            "lang": "en"
        },
        {
            "review_title": "Not a bad movie all. Worth watching",
            "content": "I did not see the first movie and maybe I'm better off for that. Perhaps a better title would be once possessed. Until near the end the character might have been imagining things. I found it entertains through out.",
            "review_date": "2021-04-24",
            "lang": "en"
        },
        {
            "review_title": "The Last Exorcism Part II gets a big NO-NO from me",
            "content": "I don't know why IMDb tried to trick me with this synopsis. There is nothing remotely frightening or sinister in this movie. While the first The Last Exorcism did the part quite well, in making me sense the dread and the horror, the sequel is an abomination of horror genre. No effects, no creepy atmosphere, no jump-out-of-your-skin moments, a lot of gaps and mistakes, nonsense throughout the movie. It took me two nights to finish it. The first night I sat there bewildered of what was happening on screen and thought \"Am I actually seeing this? Were they serious when they made this?\" and I had to close it and chose something else. And because I never leave a film unfinished, especially when I'm the one who picked it, two nights later, here I was, on my post, trying to get some meaning and purpose to this ridiculous sequel. Even the title is nonsense. They should've called the first one The Last Exorcism Part I but they weren't prepared for a continuation and when it got 100 million in the box office, they decided to just do it, since they've already gotten the cow. And I'm thinking their decision went like this: \"Hey, everybody is doing a sequel, let's do one too, right?. Think of how much money we could make? We'll call it The Last Exorcism II\u0085 No, wait, that's an oxymoron, we'll call it The Last Exorcism Part II, implying that the first was part one of a series. Think about it. They love sequels after sequels after sequels.\". Oxymoron or no oxymoron, they're still morons. The entire movie is nonsense. Whenever I thought that something was going to happen, which I believed it would've made sense and would've been logical, the entire plot takes a drastic turn. I bet when they wrote the script, they thought the audience could guess a possible outcome to a particular situation, so they changed the outcome\u0085 radically. Now, I always applaud unpredictability. I like the shock that I'm not always right when it comes to a character or a story. I like to be surprised and I appreciate the mind games. But in The Last Exorcism Part II, the script was an utter absurdity. The demon was hilarious. Seriously, it felt like a parody of Little Nicky (which is kind of a parody on its own). And the girl, Nell, was incredibly stupid and annoying. I was offended on behalf of Supernatural. I know the practice of salt as a protection against an evil spirit/demon isn't originated from the depths of the Supernatural writers's minds. Not even the black eyed demons. But Supernatural is the only show that uses these two elements at the same time. And guess what, now crappy sequels use them too. The Last Exorcism Part II(and I can't emphasize enough how much it annoys me this \"part II\") gets a big NO-NO from me. 1/10http://moodyclappers.wordpress.com/",
            "review_date": "2013-06-23",
            "lang": "en"
        }
    ]
}