{
    "title": "Caddyshack II",
    "rating": 0.0,
    "release_date": "1988-07-22",
    "num_reviews": 183,
    "genres": [
        "Comedy",
        "Sport"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Sub-Par",
            "content": "\"Caddyshack II\" tries to continue the comedy of the first, but never does really come together the way it was intended to.  Chevy Chase is the only returner from the original and this hurts the film.  Jackie Mason, Robert Stack, Jonathan Silverman, Dyan Cannon, Randy Quaid, and Dan Aykroyd do their best, but the material is just not present.  The direction is also poor as few viewers will really care what happens by the end of the movie. 2 stars out of 5.",
            "review_date": "2000-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Utterly dreadful",
            "content": "Every time I watch this movie blood comes gushing out of my eyes. Yes, you read that correctly: I've watched this wretched, foul thing more than once.Caddyshack 2 went wrong for so many reasons: Harold Ramis dialing in a script and abandoning the direction duties, Rodney Dangerfield (wisely) walking away from the project because they wouldn't allow him to tinker with the script, Bill Murray showing excellent judgement and not being part of it, and a puppet being pushed forward as the feature player of a cast who deserved much better.I can't help but think of Dyan Cannon in this and wonder why she's perpetually laughing and smiling. The only conclusion I can draw is that she is indeed the face of pure evil. Stay with me a moment. She must have been watching as the film came together and revelled in the untold agony that it would inflict on countless soon to be extremely sorry movie goers who would have this film inflicted on them. She may also have been extremely drunk. That's what I need to be right now to wash the foul taste of this complete and utter failure out of my mind. If I'm lucky it'll be washed out forever.I have seen this film several times. I blame several of them on childhood and being a very dull and dim-witted boy who apparently had no aesthetic sensibility. Perhaps puppets are just funnier when you're a kid. No, the Muppet show is funnier now ... guess I was just dull. Caddyshack 2 is that rare kind of film that is so extraordinarily disappointing on so many levels that you convince yourself after the end credits that it couldn't have been as bad as all that. It WAS. It IS. It will only get worse with time.My reasons for going back to this film, mercifully, are becoming fewer. Randy Quaid is limited in his role as Jackie Mason's lawyer. His opening scene isn't bad and brought out my only chuckle. We see him a few more times but it becomes as tired as the rest of the movie and descends with unfortunate rapidity from incidentally amusing to vapid wasteland. Randy Quaid acquits himself well, and this film owes him big time because if there was reason to watch this film as anything other than a torture tactic, he was it.Maybe that's the trick of the movie. It has enough potentially endearing qualities that people watch it, are horrified at what they've done to themselves but later because the pickings were so slim can remember only what did actually amuse them. Years later they unwittingly watch it again and the cycle repeats.Jackie Mason takes a lot of the blame for this film but in fairness, I'm not sure he deserves it. He's really trying out there but it is impossible to not to notice that he spends the entire movie doing a Rodney Dangerfield impersonation. That's who the movie was written for but I'm not sure even he could have saved it. Ultimately this fails miserably through terrible direction, bad editing (shall we count continuity errors?) and a rehashing of the same story with none of the wry humour or heart that made the first film endearing.Dragged kicking and screaming up to a three out of ten instead of two by Randy Quaid's bulldog determination. It isn't even bad enough to laugh at. I've definitely seen worse, but trust your memory -- this one is a dog. If you've never seen it you've made excellent life choices and I salute your excellent judgement.",
            "review_date": "2005-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fun, but stupid",
            "content": "After all seeing the very funny movie Caddyshack, I was looking forward to seeing the sequel, but I have to admit that I was nervous because I heard a lot of bad things about Caddyshack 2. I was also reading on the internet how this was voted one of the worst sequels of all time, which is sad. But I wanted to see the movie still, just at least see if it was really that bad. So I rented it anyways and watched it the other night. Now, I agree, this movie is really stupid, but it's a funny stupid that's very light hearted and has a few really good laughs. I know Randy Quaid can be annoying at times, but he really steals the show and his comedy is outrageous. I didn't like how they were trying to replace certain characters from the first film, but I let go and ended up laughing and having fun with Caddyshack 2.Jack Hartounian is what you might call, \"New Money\", but he's a very successful in construction and is worth millions. He's a bit out there, personality wise, and dresses a bit crazy, but knows the hard work of the common man. His daughter, Katie, begs him to join a golf club so she could be with the upper class elite. But he makes a fool of himself and wants revenge on those who made fun of him. He buys the club and turns it into an amusement park! But this doesn't stop the elite from trying to tear him down.Caddyshack 2 is stupid at times, like the gofer, they took the joke a little far. And Dan Aykrod's character, I love Dan so much, but it's like he took on Bill Murray's character from the first Caddyshack and made Dan really annoying. Jackie Mason is a bit out there and can't stand up to Rodney Dangerfield. But Caddyshack 2 still has a few good laughs, I mean, if you couldn't laugh at Randy Quaid and how he delivered his lines, check your funny bones. Caddyshack 2 is a silly movie, but it's all in good fun, but if we are just going to keep comparing to the first movie, then you're not going to have a good time.5/10",
            "review_date": "2008-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pretty Lame...",
            "content": "The near-classic first film is really a great comedy, whereas, this one recycles some of the jokes, and doesn't do nearly as well. There was a magic about the first film where everything just worked, whereas this time around, nothing worked and for the most part was rather unfunny. Watch the first ten-twenty minutes for the return of Ty Webb, and then go about your business...",
            "review_date": "2001-01-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The old, funny, classic shack, isn't back",
            "content": "Here's another example of a sequel that falls into \"the too late, and why bother category\". It has one asset: Jackie Mason. He's a classic, and rightfully likable guy, where Bushwood won't accept him, so he retaliates and that he does with personal malice, by planning to knock it down and put up an amusement park. All the magic to the original Caddyshack has gone, save for a couple of original stars, including that notorious gopher who we see more of, in this. Chevy Chase chatting up some hotties, uses some rude, tasteless lines that kind of mirrors how this quality whole movie comes across. Dan Ackroyd, donning a real high squealy voice, comes across as really annoying, a pain in the butt, which is where he gets shot with an poison arrow. Watching Weekend At Bernie's Jonathan Silverman at the start, getting used, by a snotty heartlss bi..h, that has him running many yards to fetch her a soft drink, made me thirsty, which had me thinking later, this scene was pointless and unfunny, although I'll always remember it. Mason and some hotties are really the only things, this movie has going for it, oh, and that gopher. Off by many tees.",
            "review_date": "2014-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better than you think",
            "content": "Look nothing is ever going to touch the original movie. However this sequel is funny and has some good performances as well. I will admit the character of jack isn't the best but I've seen worse. The Gopher is funny and the soundtrack led by Kenny Loggins is great. So judge for yourself and give it a look.Tim Treakle.",
            "review_date": "2021-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This one isn't nearly as good as the first, but it isn't one of the worst movies ever.",
            "content": "While this one certainly is not the original, it certainly isn't bad enough to be on the list of worst movies ever.  I found some of the jokes to be funny and it wasn't a complete waste of time so I just don't see how it has such a low ranking.  Well maybe I do.  The main problems I had with this one are the story and its focus.  This movie really has nothing to do with caddies, other than Silverman's character there are no other caddies that are focused on.  In fact, other than the fact it is a country club, Chevy's character is back, and the gopher it really doesn't have much else in common with the original.  Jackie Mason is the focal point here taking the Rodney Dangerfield role from the first.  Here is one of the problems; he isn't nearly as funny or likable as Dangerfield.  The scenes with his daughter also get annoying as it gets somewhat serious at times.  Chevy reprises his role as Ty, but other than the fact he goes \"nananana\" he almost is a different character.  Dan Akroyd sort of takes the place of Bill Murray's character and has a few funny lines, but his performance will not make anyone forget Bill Murray from the first one.  Also, you do not have special appearances in a movie, when that appears it just makes your whole movie seem a bit generic.  Also, both Chevy and Dan were in the movie more than say Marsha Warfield who is listed ahead of them.  There are some good performances though...I liked Randy Quaid's character and Robert Stack was rather good too.  It is good for a couple of laughs and I do not really think it is all that awful, but if only they could have done a better job with the central story in this one.  I just don't think Jackie was very good and he kind of pulls the movie down a couple of notches.",
            "review_date": "2004-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "watch this movie",
            "content": "Watch this movie .....only to truly appreciate how good the original is. I'm not real hard to please, but this was one of the worst movies I have ever seen. It hurt me deeply, because I like Chevy Chase, Jackie Mason, and Dyan Cannon. The writing was just terrible! I thought Chevy would have at least ad libbed some better stuff than he did. There was hardly anything to laugh at in this movie. I went into it wanting to enjoy it. I wanted to laugh but nearly cried. In the beginning credits it read Special Appearance by Chevy Chase. This worried me from the start. Chevy is actually in more than I thought he would be. It's more than a \"special appearance\". Too bad the appearance wasn't special. Mason's character would have been a good secondary character but got old as a main. I would rather have seen more (much more)of Dyan Cannon. At least her character was fun, if not well written. I also missed the gratuatis teen sex scene. Mr. Gopher went from being cute and innocent to a pesky rodent that deserved to be blown up. Jonathan Silverman is the only character that interested me and we didn't see enough of him.I take it back. Try..to watch half of this movie, then...remember the Alamo, the Maine, and CaddyShack I.",
            "review_date": "2005-04-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Plebeian manners",
            "content": "Rich contractor Jackie Mason has at the urging of his daughter Jessica Lundy gone\nto mix with the establishment at a posh country club. Her best friend is Chyna\nPhillips who is the spoiled rotten daughter of club president Robert Stack and\nDina Merrill. She also has a brother Brian McNamara who is equally spoiled and\ninterested in Lundy.So Mason goes there and truly does not fit. What does he do but start a social\nrevolution of sorts as was done in the original Caddyshack.Only Chevy Chase and the gopher return from the original cast. The chemistry\nin the cast of the original is missing. Caddyshack II is not the classic low brow\ncomedy that the original was.Some funny stuff is present though. I liked the brain dead Dan Aykroyd and his\nbattle of wits with the elusive gopher. Guess who comes out on top?Definitely second rate. Like a road company production of the original Caddyshack.",
            "review_date": "2018-05-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst. Sequel. Ever.",
            "content": "It's eight years after the mega-hit \"Caddyshack,\" and the studio wants to milk that cash cow again, but it all went horribly, horribly wrong. They couldn't get Rodney Dangerfield, so they went with the third-string facsimile, Jackie Mason. Ted Knight? No, Robert Stack. Bill Murray? No, a bizarre and whiny Dan Ackroyd, in what has to be the worst performance of his career. I guess Chevy Chase's phone wasn't ringing off the hook, since he reprises his role as Ty Webb.And it all went downhill from there. Where else could it go? Randy Quaid is just awful (surprise!) as is Dyan Cannon, Jonathan Silverman and Dina Merrill. The script could have been written by a high school drama class (and probably was), the direction is tepid and unfocused, and the whole thing is a limp and deadly mess.Save your time and money and brain cells. It was like watching a car wreck--you want to avert your gaze, but you just can't believe what you are seeing. The worst sequel of all time. Ever, ever, ever.",
            "review_date": "2012-07-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The amazing thing about this one is that SOMEONE actually thought it was a good idea and would make money!!!",
            "content": "Have you ever heard the old expression \"you can never go back\"? Well, regardless, the saying definitely holds true when it comes to \"Caddyshack II\"...a film that fails in every way to capture the magic (such as it was) in \"Caddyshack\". Part of the problem is that this sequel came out eight years later....the other part is that almost no one from the original film is in this one. The sole person playing the same part is Chevy Chase...and he was the worst part of the original film!In this story, a young girl from humble roots has inexplicably made friends with a cold and nasty spoiled brat. The brat's father runs a countryclub and so the girl's family is invitied to visit the place. However, the Hartounians are anything but the types for countryclubs and Jack Hartounian (Jackie Mason) soon ends up making a mess of everything with his low-class ways. All this results in great embarrassment for the Hartounian daughter who wants to fit in with the nasty rich jerks that are members of the place. And, it results in the club members not only giving Jack Hartounian the cold shoulder but trying to destroy his business...out of spite. And, naturally, Hartounian returns the favor!Because of the dearth of original actors who reprised their roles, the filmmakers made a very bad decision. While the cute groundhog was one of the best things about the original film, here in the sequel they elevate its part significantly....which is NOT a great idea when you're talking about a puppet! Now, the puppet can actually talk (a bit) and its antics are no longer cute but boorish and stupid. Add to that lots of farting, a horse that laughs. the most idiotic golfing scenes in history as well as joke after joke after joke that fall completely flat because they aren't funny, and you've got a film that is a chore to watch.I would have to agree with comments like \"it's the worst sequel ever\"....as I can't think of a worse one off the top of my head. However, it has a few tiny laughs here and there so it manages to eke out a 2...hardly a glowing endorsement for this mess! It's inept on every level...and especially where it counts...with the god-awful writing. As for the acting, it isn't good...but Dan Akryoyd is simply god-awful....worse than he was in \"Dr. Detroit\" or \"Neighbors\" or even \"Nothing But Trouble\"!",
            "review_date": "2018-09-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "unnecessary...VERY unnecessary",
            "content": "I saw \"Caddyshack II\" when I was ten and I mostly laughed because of the horse scene. I should have realized that the movie was as empty as...I can't come up with a good comparison. It's stupid and not even really funny. The cast members from the original who chose not to star in this made probably the best choices that they ever made in rejecting this; why, oh why, did Chevy Chase return?! And how on earth did Jackie Mason, Robert Stack, Dyan Cannon and Dan Aykroyd get involved in this swill?! I bet that every person who had his/her name even remotely attached to this junk (e.g., the caterer) is ashamed beyond redemption. So, all in all, it's beyond dreadful, terrible, and everything such. Avoid it like you would the Ebola virus.",
            "review_date": "2006-04-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "no",
            "content": "A while ago I attempted to sit through the entire Caddyshack epic back-to-back, but part II took me three sittings.  I toughed it out though. I'm not a quitter.What happened here?  What somehow made the original a classic lies with the filmmakers' decision to toss the script more-or-less and rely on the improvisational genius of the veteran comics.  Here, the viewer is dragged though a lifeless, by-the-numbers 80s light comedy PLOT and left feeling hurt and confused and certainly not filled with mirth.  Oh sure, you've got the talents of Jonathan Silverman AND Marsha Warfield (I keep waiting for some forward thinking, cutting edge network to bring back her talk show) vying for your attentions IN THE SAME MOVIE!  And you get to see Jackie Mason in a lead role!  That's not enough?  Well, the two returning characters, Chevy Chase's Ty Webb and the gopher certainly pull their weight.  Chase has no shame and everybody knows it.  Robert Stack could make Hooked On Phonics sound like Crime and Punishment, so there's no fault there.  Quaid and Akyroid are annoying as always....Oh, I thought of something good!  The Kenny Loggins theme song is fantastic! Far superior to his contribution to the original Caddyshack.  Whenever I face a challenge in life, I am heartened by thinking of this inspirational song.  \"I'm goin' all the way\"!  I was pleased to see that it appears on a 2 disc best of Kenny Loggins.  Good call.",
            "review_date": "2003-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie",
            "content": "I have no idea why everyone hates this movie to call it garbage a travesty an unexceptable sequel is just unfair i mean what else could they have made for a sequel then. Cause seriously I think it should have had a sequel (Rodney Dangerfield) says: hey everyone were all going to get laid and then a little dancing goffer and thats it thats the end of Caddyshack even though the film rating on first one was (R) and the second one was (PG) it was still lots of fun .(7/10)",
            "review_date": "2002-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Does what it sets out to do. Creats laughing. :)",
            "content": "ahh, digging in the $5 dvd bin.  come up with this controversial doozy. Still remember being almost 13 looking forward to this movie.  Having never totally understanding film at the time, I loved it.  Today 2004...  I still like it.  Provides a decent laugh.  Sure, it probably doesn't deserve the name that it's under...  but neither did the Italian Job.  (which I prefer to call The American Job.  )  But hey, you just don't go into this film expecting  the first movie.  If you did, you'll be crying for decades. Fortunately, I see the movie for what it was.  More of a parody of the original.  Nothing can beat the original. Caddyshack II doesn't bother to try.  And I love that for it.  :)5/10Quality: 0/10 Entertainment: 9/10 Replayable: 10/10",
            "review_date": "2004-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A hard watch",
            "content": "It took eight years for a sequel to Caddyshack to get made, perhaps the greatest \"hijinks ensue\" movie ever made. I say that phrase because it's such a simple concept: a quick statement like \"A day in the life of a golf course...and hijinks ensue.\"The beauty of the original film is that despite the out there characters like Chevy Chase's Ty Webb and Rodney Dangerfield's Al Czervik, the story is really about the struggles of Danny Noonan (Michael O'Keefe), a working-class kid forced to follow the whims of the incredibly rich in the hopes that he can work toward a better life. It also comes from actual life, as writer Brian Doyle-Murray, his brothers Bill and John, too -- was a caddie at Indian Hill Club in Winnetka, Illinois. His brothers Bill and John Murray, and director Harold Ramis had all been in Danny's caddy shoes at one point. Most of the people in the movie were all based on actual members of the clubs that they had worked at.Ramis told the A. V. Club that he went in with the right intentions: \"They said, \"Hey, we've got a great idea: The Shack is Back! And I said, \"No, I don't think so.\" But they said that Rodney really wanted to do it, and we could build it around Rodney. Rodney said, \"Come on, do it.\" Then the classic argument came up which says that if you don't do it, someone will, and it will be really bad. So I worked on a script with my partner Peter Torokvei, consulting with Rodney all the time. Then Rodney got into a fight with the studio and backed out. We had some success with Back to School, which I produced and wrote, and we were working with the same director, Alan Metter. When Rodney pulled out, I pulled out, and then they fired Alan and got someone else. I got a call from co-producer Jon Peters saying, \"Come with us to New York; we're going to see Jackie Mason!\" I said, \"Ooh, don't do this. Why don't we let it die?\" And he said, \"No, it'll be great.\" But I didn't go, and they got other writers to finish it. I tried to take my name off that one, but they said if I took my name off, it would come out in the trades and I would hurt the film.\"This moment of wondering why this movie is being made and feeling is that it's the wrong idea? That will come up throughout the discussion of this movie.So instead of Rodney, we get Jackie Mason. Sure, they're both older Jewish comedians who married much younger women late in their lives, but that's about all they have in common. Rodney's character was an everyman who seemed to be using the audience as his therapist, bemoaning the way he was treated with lines like \"I know I'm ugly. I said to a bartender, \"Make me a zombie.' He told me that God beat him to it.\" To me, Mason always felt like he was lecturing the audience, somewhat above it*.Dan Aykroyd is one of my favorite actors, but he's basically coming on to be Bill Murray. And while Jonathan Silverman and Michael O'Keefe are somewhat interchangeable, there's a large divide between Robert Stack and Ted Knight. And that's no slight to any of these actors, but when you're placed in the same exact role as a movie that is beloved, you're going to get compared. After all, Ted Knight is my favorite villain in any movie. He's perfect in his role. And while I love Robert Stack, I can only see him in heroic roles or parts that make fun of his heroic nature.I mean, I love Randy Quaid, but his role was written for Sam Kinison, who would have destroyed audiences with that part.To be fair, Dangerfield was to be in this, but a month before production, he bailed, realizing that it wouldn't work. He kept adding to his contract, demanding final cut and royalties and getting everything he wanted, except to be released from the film. This all ended up with him facing a $10 million dollar lawsuit.But there still needed to be a movie.As for director Allan Arkush, he told Sports Illustrated \"I should have never made this movie! What was I thinking?\" He told us -- in an interview we were honored to get to conduct -- \"You should never make a movie for the wrong reasons. You should only make movies about something where you know no one else can make it better than you.\"So what's it all about, you may ask.Kate Hartounian (Jessica Lundy, who was in Bright Lights, Big City and Vampire's Kiss the same year this was released), the daughter of real estate developer and working man Jack (Mason), seeks to improve her social status by following the advice of her friend Miffy Young (Chynna Phillips) and asks her dad to join the Bushwood Country Club.Of course, seeing as how her dad builds housing that normal people can afford, he doesn't fit in with club members like Chandler Young (Stack), his wife Cynthia (Dina Merrill, Operation Petticoat) and Mr. Jamison (an always welcome Paul Bartel).Sure, hijinks ensue, but it's hard to get behind the blustering Mason, who strangely attracts Diane Cannon, making this into something of a science fiction movie. The gopher can now talk (someone get Frank Welker in the booth stat!) and Chevy Chase shows up for all of five minutes, most of which consists of him being a sexist boor to scare off multiple women in a scene that may have seemed funny in 1988 but seems beyond gross in 2021 (I know, I know -- let's not place our modern values on movies from the past; I'm also the guy who brings you all sorts of aberrant Italian and Spanish gut-churning filth, right?!? But maybe I just agree with the \"medium talent\" assessment of Chase).The hardest thing to deal with in this movie that it's made by incredibly talented people placed into a thankless struggle to make something halfway decent. I mean, Harold Ramis and PJ Torokvei (who wrote Armed and Dangerous, Back to School, WKRP in Cincinnati and Real Genius) wrote the script with rewrites by Jeffrey Price and Peter Seaman, who wrote Who Framed Roger Rabbit together**.The thing that really sticks out to me is that Caddyshack works whether or not you play golf, but if you love the game, you can see the nuances and enjoyment of the sport within the movie. In the sequel, golf just seems to be something in the background, other than the miniature golf course finale that closes the movie.I guess you should add the phrase, \"Don't remake Caddyshack\" to other important lessons like \"Never fight a land war in Asia\" and \"Never go against a Sicilian when death is on the line.\"In our aforementioned chat with the director, this movie was summed up quite simply:B&S: So why Caddyshack II?ALLAN: Yes, exactly. Why Caddyshack II? There are no more questions to be answered.*Indeed, Arkush said --after seeing Mason perform two nights in a row -- \"I started to get a very different impression of him. The thing that occurred to me was that he didn't connect with the audience in any sort of personal way. That's not necessarily a good thing for someone who's supposed to be your lead. At least when Rodney says, \"I get no respect,\" there's an empathy that he evokes from the audience.\"**To be fair, they also wrote Wild Wild West and How the Grinch Stole Christmas, so perhaps...",
            "review_date": "2021-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hole in one",
            "content": "I like the bit where he hit the ball really hard and got a hole in one on a par 4",
            "review_date": "2020-04-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "i think i'm the only person in the world that likes caddyshack 2 better than the first",
            "content": "caddyshack 2 was great. i liked it a lot better than the first. the first one was a bit dull and not that funny. caddyshack 2 is not one bit dull never unfunny, and always entertaining. i give it *** out of ****",
            "review_date": "1999-03-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful! Just awful!",
            "content": "This film should never have been made! It stinks, it's awful, it's no good, it's bad, it's terrible. Starting to see a pattern here? Jackie Mason is certainly no Rodney Dangerfield. Gone were Ted Knight and Bill Murray, who, along with Dangerfield, were essential to the first film. It seems that the three of them (the stars) all knew a stinker of a script when they saw one. The one who didn't have the good sense to bow out of this was Chevy Chase, who stuck around but was extraneous to both films in my opinion. This film is quite simply NOT FUNNY. Nor does it have any other endearing qualities. This thing relies heavily on anti-Semitism to work and it works to it's detriment. I hated this thing. A waste of everybody's time.",
            "review_date": "2002-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant Crappy Film",
            "content": "Ok this is No Oscar Winner BUT it STILL made me Laugh why? Because it was so STUPID i just couldn't help not to Laugh at all the Really Stupid Jokes and Such. The Cast was rediculice they all pretty much knew they were just making a Crappy Film and had a good time making it. Randy Quaid as the Lawyer was very Funny. The main Rich Father was also Hilarious. He was only in like 20 Films all together. Of course the put in the clumpsys Rich Smart Golfer Man. That was in the Other two films. I am so BAD with name's I can't remember his real name. But he is in Tons of Film's. Oh Chevy Chase Lol 🤣 that is great putting him in the Film.",
            "review_date": "2021-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It At Least Lives Up to Its Reputation",
            "content": "Caddyshack II (1988) BOMB (out of 4) One might see CADDYSHACK II and right off the bat thinks it's just a cheap, piece of trash thrown together quickly to cash-in on the success of the first film. I mean, this here is often what happens when you have a hit film but that's not exactly the case here because this came eight years after the original so they certainly had time to come up with something better. You can read the various production problems elsewhere and you can also read the plot summery elsewhere. No matter what you read or see, CADDYSHACK II is without question a horrid film that lives up to its reputation as one of the worst sequels ever made. Chevy Chase is the only person back and then we have Jackie Mason, Robert Stack, Dyan Cannon, Randy Quaid and Dan Aykroyd basically playing rip-off characters of what were seen in the original. Again, it's clear that this here was a horrible idea right from the start as the cast and writers have freely admitted this. It's still shocking to think that the studio wanted something like this but I guess they thought it would be easy cash. The entire screenplay is just so unfunny that you can't help but wonder why anyone signed onto it. The entire finale dealing with a competition runs way too long and it takes forever to get where it's going. There's really nothing working in this picture, although there might have been one or two small smiles throughout the entire running time. The cast are just annoying and you know you're in trouble when a fake gopher gives the best performance.",
            "review_date": "2013-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The original was juvenile with only a few genuine laughs, this is about the same",
            "content": "Honestly, CADDYSHACK has always been overrated in my book, and frankly, this sequel is just as funny, which is to say-neither are classic comedies. As a kid I thought the first film was juvenile, and I was disappointed that Dangerfield, Chase, and Knight, three of my comedy favs, were giving weak performances when I'd seen them do much better elsewhere. AS an adult, rewatching, I have the same reaction. There are moments-like Murray eating the Baby Ruth that just chased everyone from the pool when he realizes what it is-that are laugh worthy, but too few and far between. The rest of it is just overacting silliness that tries to hard and flops. And this second movie is much the same. I thought Mason did a decent job given the material, and Dyan Cannon is always worth a watch but Jessica Lundy really shown here in rather a thankless straight role. Beyond that, this is pretty much the TV cast sitcom version of CADDYSHACK, and it is what it is.",
            "review_date": "2020-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "They never should have bothered",
            "content": "What were they thinking! The original Caddyshack was brilliant and should be considered a classic. Everything worked even though it shouldn't. I still quote lines from it 25+ years later.The cast of the original was superb. For Caddyshack II however none of them seem right. There is no chemistry at all. All the jokes fail badly. I just felt sorry for both Mason and Akroyd (maybe they realized that they missed out on a fantastic movie the first time and were trying to make up for it) I generally will sit through just about anything I've paid $3 to rent but after 20 minutes I couldn't handle any more. Its THAT bad.",
            "review_date": "2007-05-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A equal That Exceeds the Original",
            "content": "Everyone is entitled to an opinion. The only critic who counts is yourself. I think this is a great movie. Much better than the original.In \"Caddyshack\", Rodney Dangerfield is funny, but obnoxious. He was asked to do the sequel, but things got in the way. Jackie Mason shows the saying that \"less is more\". He is funny, but a man with real family issues, a more rounded person. It's no drama, but a movie that makes you feel. Actually in some points, you feel sorry for Jackie Mason, especially when his daughter walks out on him.It has a good soundtrack, and overall, a good sorry. A good end to the series.In the TV show \"Alf\", Alf says that he cried in \"Terms of Endearment\". The wife , Kate Tanner, played by Anne Schedeen, also says he cried at \"Caddyshack 2\".",
            "review_date": "2005-09-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You will love this movie",
            "content": "If you liked the first then you will like this to\nit has a few similarities to the first but in some ways its even better\nI wish more of the original movies actors came back but they probably had prior commitments\noverall it's a great movie.",
            "review_date": "2022-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So it's not Caddyshack. What's the problem?",
            "content": "Caddyshack 2 has a dreadful reputation, due only to the fact that it is a sequel to a highly-held classic. People have criticised the film on a lot of grounds, but they all ultimately hark back to the fact that this is not Caddyshack.I would begin by saying that we should just take Caddyshack out of the equation and consider this film on its own merits, but I think that would be unfair. The movie does have a lot in common with its predecessor. The class-related themes of 'snobs versus slobs' and the desire to fit in to a class above your own are as prevalent here as they were in the first movie. The two things that are truly lacking here are Bill Murray and Rodney Dangerfield, who are replaced with Dan Ackroyd and Jackie Mason respectively.Now I am not about to try and argue that Ackroyd comes close to Murray in the movie, but Jackie Mason is an admirable successor to Dangerfield. He comes off as a cross between Dangerfield and Arnold Stang, but without biting too heavily on either. I wouldn't say that he is anywhere close to being as funny as Dangerfield is in Caddyshack, but there is a whole lot more point to his character and his dilemma in the film.Chevy Chase only pops up and handful of times in the movie, which is another common complaint. Maybe these particular naysayers didn't notice that he only popped up a few times in the first movie. For my money, his scenes here are a lot funnier, if somewhat over-directed.While I'm on the subject, it is really the over-direction of this movie that brings it down. It comes across as far more self-conscious in its attempts to get a laugh. Many of the jokes are laboured and there's far too much of the Gopher, who seems to have taken on a far more anthropomorphic personality and a voice, just in case we didn't grasp the idea that its meant to be funny.Characters are similarly hammered home, particularly the smarmy yuppy kids. Jackie Mason rarely misses a beat, and is consistently likable and very funny, but we didn't need the tango sequence at all! The director is clearly not of the same school of thought as Harold Ramis. Not to suggest that Caddyshack was subtle, but the jokes here are just a little overcooked, and most of them are unnecessarily embellished with a quirky music cue.All things considered, this is a fun, goofy movie with something to say about class and identity that very few movies at the time were saying. Don't be put off by the appallingly low rating on IMDb, check it out for yourself.",
            "review_date": "2007-08-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not as good as the first",
            "content": "I liked the original Caddyshack, so thought I'd give this one a go. I agree with oher reviews, its not as funny as the original.\nThere is the same character as before, someone that is hated by everyone in the club, that is richer than all of them. Same as before, why repeat the same storyline?\nThe caddy in this version isn't even the main role, like the first.\nThe only thing that made it for me, funny wise, was Chevy Chase, and maybe the auction bit...",
            "review_date": "2019-07-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A far cry from the first Caddyshack...",
            "content": "Why is this one no good when the first one rocked?   Try the fact that they attempted to replace Rodney Dangerfield with Jackie Mason!   Please! That's like replacing the Beatles with Wierd Al.  Randy Quaid is the only one that saves this movie from a zero.However, don't let this stop you from watching the first movie which was outstanding.",
            "review_date": "2003-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why does this movie exist?",
            "content": "I loved the first Caddyshack so when I saw this movie for sale on DVD at the now-gone Liquidation World, I asked my grandma to buy it. I watched it all the way through and it felt like I was watching a movie that shouldn't exist in this universe. The only returning cast member was Chevy Chase reprising his role as Ty Webb.It felt like a movie that wasn't supposed to exist. I have no idea where grandma's DVD of this thing is now, probably in a box gathering dust in my grandpa's bedroom or god-knows-where after it was donated to Salvation Army.",
            "review_date": "2017-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not completely horrible but...",
            "content": "Only Chevy Chase and the gopher are back. The Bushwood country club are getting new electric golf carts and the caddies won't be needed anymore. Jack Hartounian (Jackie Mason) is the inappropriate construction boss with a golfing daughter Kate (Jessica Lundy). He doesn't fit in with the snobby high class members especially since some of them from the historical society want to stop his low income apartment building. The only true friends may be Ty Webb (Chevy Chase) and caddy Harry (Jonathan Silverman).Rodney Dangerfield doesn't come back and they replace him with Jackie Mason. I respect his old school comedic style. He manages to put some of those jokes in here. I find it endearing at first. Chevy Chase is back but he's just a supporting player anyways. This is Jackie Mason's movie. I don't even know why the gopher is back. It's really just a mascot without Bill Murray. The movie isn't as horrible as one may expect, but the lost of so much comedic power could never be truly replaced. Dan Aykroyd is probably the only one of the new cast who actually gets this sense of humor ostensibly to take over Bill Murray's comedic spirit. One must judge this without the Caddyshack name. Even then, this is a bland comedy.",
            "review_date": "2014-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Shack Ain't Back!",
            "content": "A truly horrible sequel that shows some of the cast from the first film cruising through an awful script. Bill Murray has left, leaving Dan Akyroyd to chase the gofer around. No hilarity ensues.Rumors have recently arisen of a new \"Caddyshack\" film. I just hope they don't make it as bad as this.1/5 stars -John Ulmer",
            "review_date": "2003-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A swing and a miss of golf comedy sequel...",
            "content": "Eight years after the original 1980's classic comedy, the world was gifted with \"Caddyshack II\" from writers Harold Ramis and PJ Torokvei. Now, after having seen this 1988 sequel, it is hard to believe that Harold Ramis was actually involved in this train wreck of a sequel.The storyline in \"Caddyshack II\" is essentially just a watered down rewrite of the original \"Caddyshack\" movie. Yeah, that was about the originality that writers Harold Ramis and PJ Torokvei could muster in an eight year span between the two movies.The storyline was a swing and a miss, it was lacking in originality and it was lacking in laughs. So you're not in for anything particularly grand when you sit down and watch \"Caddyshack II\". So don't get your hopes up for this movie from director Allan Arkush.And not even with the likes of Robert Stack, Jonathan Silverman, Brian McNamara, Randy Quaid, Chevy Chase and Dan Aykroyd on the cast list was there much to be enjoyed in this watered down version of the first movie.Well, sure, if you are a die hard fan of the original movie, then there is perhaps some enjoyment to be found in \"Caddyshack II\". But I was just a casual viewer, so this movie didn't really cut it for me. But hey, the gopher made an appearance, and truth be told, then the gopher was mainly the reason why \"Caddyshack II\" managed to stay afloat.My rating of \"Caddyshack II\" lands on a four out of ten stars.",
            "review_date": "2022-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mediocre",
            "content": "Caddyshack Two is a good movie by itself but compared to the original it cant stack up. Robert Stack is a horrible replacement for Ted Knight and Jackie Mason, while funny just cant compete with Rodney Dangerfield. Ty Webb is funny, being the only character from the original. Most of the other characters in the movie lack the punch of the original (Henry Wilcoxon for example) except for the hystericly funny lawyer Peter Blunt, being played by Randy Quaid. Every line he says reminds me of the originals humor, especially the scene at his office (I don't go in for law suits or motions. I find out where you live and come to your house and beat down your door with a f***ing baseball bat, make a bonfire with the chippindale,maybe roast that golden retriever (arff arff arff) then eat it. And then I'm comin' upstairs junior, and I'm grabbing you by your brooks brothers pjs, and cramming your brand new BMW up your tight a**! Do we have an understanding?). Offsetting his small role however, is Dan Acroyd, who is obviously no replacement for Bill Murray. His voice is beyond irritating and everything he does isnt even funny, its just stupid. Overall Caddyshack II is a good movie, but in comparison to the awesome original it just cant cut it.",
            "review_date": "2000-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "There's only one reason to watch this film......",
            "content": "And that's because Randy Quaid rocks!!! This part is along the same lines as Cousin Eddie of National Lampoon's Vacation Fame. He's insane, over the top, and hysterically funny. Just watch the scene where he goes golfing with \" Chandler Young.\" As for the rest of the movie, it's amusing, but falls well short of the original.",
            "review_date": "2000-09-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's NOTHING compared to the original, but still quite amusing in its own right",
            "content": "Eight years after the classic original Warner decided to do a sequel to Harold Ramis' director debut. Only Ramis isn't in the chair this time (surrendering the honors to sitcom director Allan Arkush), but he did pen the script.The only returning characters are Ty Webb and Mr. Gopher. There were supposed to be more but Bill Murray and Rodney Dangerfield hated the script and Ramis would not let them make their own changes, which I think was a huge mistake and quite arrogant and out of character for Ramis. Taking Murray's place is Dan Ackroyd as Captain Tom Everett, a mentally-scarred war vet turned mercenary, and Jackie Mason as Jack Hartounian, another boorish, blue-collar millionaire property developer. He's entertaining, but he's certainly no Al Czervik.Ted Knight passed away in 1986, so Judge Smails couldn't return either. Instead we have Robert Stack playing the villainous Candler Young. Again, I like Stack, but he just can't live up to Ted Knight.Hartounian agrees to join the prestigious Bushwood Country Club to please his teenage daughter who is desperate to fit in. The snobs don't take too kindly to his unsavory humor or his connections to the local working class. Together they conspire to shut him down, but Jack Hartounian doesn't give up easily.Almost everything that made Caddyshack so good is dumbed down in this sequel. The R-rating, the raunchiness, the complex character interactions...all gone. Though they somehow still managed to squeeze in a single F-word (courtesy of Randy Quaid's obnoxious lawyer Peter Blunt) in a PG, which is very rare. Caddyshack also had dozens of speaking roles and didn't care if the audience couldn't keep up with it. Those kind of quirks make it endlessly watchable, while Caddyshack II is merely good for a laugh only once in a while.The theme of the working class clashing with greedy snobs who have had everything handed to them might be a little more relevant today, I just wish that they hadn't comprised the film so much. Had there been more continuity with the original we could have had another classic.Not as bad as its reputation suggests, and there are a decent amount of laughs. But just not enough.I do appreciate the Mad Magazine and Root Beer references though.",
            "review_date": "2000-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Caddyshack 2: A Cautionary Tale of Bad Sequel Making",
            "content": "Caddyshack 2 is a study in god awful sequels. Along with Blues Brothers 2000 and Beverly Hills Cop III, CS2 is in the trinity of terrible sequels to 80's comedy classics.The basic plot of CS2 is the same as the first: a vaguely ethnic new-money guy crashes the WASP-y Bushwood Country Club. There are subplots about a groundskeeper and a gopher and young people learning to stand on principle, and it all climaxes in a golf match. But the original Caddyshack felt like a raunchy celebrity roast; the sequel feels like a lame afterschool special. CS2 was rated PG while the original was rated R. This highlights sequel kiss-of-death # 1: the studio wanted it to appeal to a wider audience (read: something for the kiddies). No part of the first Caddyshack is for kids; even the Gopher is more like a good acid trip (does anyone else see that dancing gopher?) – than a family friendly puppet. CS promoted sex and drugs and a contempt for authority. That's because it was directed and headlined by comedians who also promoted sex and drugs and a general contempt for authority. But the studio wanted a family accessible sequel since the PG rating is generally seen in Hollywood as better for box office returns. And so there are literally Looney Toons cartoon characters in Caddy Shack 2. Instead of Rodney Dangerfield's hilariously profane Al Czervik, we get a cornball Jackie Mason as a developer-with-a-heart-of-gold. Instead of the class warfare middle finger of Caddyshack, CS2 brings a saccharine \"Up-With-People\" message about self-acceptance. Bill Murray's brilliant comedic menace as the burned out Carl the Groundskeeper, is replaced by a grating Dan Aykroyd. Aykroyd is best as the straight man (Elwood Blues on SNL, Joe Friday, Louis Winthorp ). When he goes for zany like he does in CS2 he is like the unhip but well-meaning uncle at a family gathering who likes to do funny voices for the tots but then uses the same shtick when coming over to talk to the adults. CS2's second sequel kiss-of-death is the lazy attempt to recycle the original film. Even though Chevy Chase was the only original cast member to return, CS2 limply retreads most of Caddyshack's other character types. Robert Stack is no Ted Knight and Jonathan Silverman is too bland to fill Michael O'Keefe's shoes in the Danny Noonan role.Coming back as Ty Webb, Chase's one stab at edginess in CS2 is a bizarre and unnecessary scene in which he chases off a table full of attractive women in the club's lounge by propositioning each of them with silly euphemisms for sex. The joke falls woefully flat and is out of character with the charming Ty of the original. The third sequel kiss-of-death plaguing CS2 is its troubled development history. Harold Ramis, who co-wrote and directed the original, was reluctantly coerced into scripting a sequel. Rodney Dangerfield initially pushed hard for a sequel, but later pulled out over creative differences with the studio. Ramis also dropped out and urged the studio to let the sequel die. Instead the studio brought in other writers and director Allan Arkush who had more experience with TV than big screen filmmaking, (which may explain why CS2 feels like a made-for-TV project). Other than Chase, none of the original cast wanted anything to do with the sequel. Lawsuits popped up over the use of characters and unfulfilled contracts. All indications were that CS2 was a project that should have been terminated in early development but, as is the case with many Hollywood disasters, the suits saw dollar signs and ignored the warnings of the creatives. Caddyshack 2 is simply unacceptable. It's only redeeming value is as a cautionary tale for future filmmakers and studio execs about how to kill a comedy classic's name by attaching an abominable sequel to it.",
            "review_date": "2014-06-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A rather blatant jab at the world of high society",
            "content": "This movie is a blatant attack at high society. It is a very left wing movie at attacks the conservative, prejudice ideas of the rich. The movie is based around a building developer of mixed origin who is building a low cost apartment block in a very upper class district of an unnamed city. The residents resent this because they do not what lower class people living among them so they push for an injunction, based on a historical horse shed which is only seventy years old, to have the development stopped.The daughter of the developer is the member of a country club in the area that is also frequented by the upper class people of the area. She is welcomed among them, but her father does not like these people. Instead he prefers to play poker with the builders and loose so that they might have extra money to take home. He was one of the proletariat who though a lot of hard work managed to become incredibly wealthy, yet he still considers himself one of the proletariat. He does not hoard his money, but is rather willing to loose it.He is contrasted with the rest of the country club. It is a community of people with a lot of money. They are portrayed as the bad guys. They do not want the poor living in their area and will do anything to stop it. They hoard their money and this is seen with the slave auction where $5000 was raised for charity the previous year even though a lot more could have been made. The quote is that the slave auction is held when they feel guilty about the amount of money that they have, yet they are not willing to let go of it. The developer does not consider his money as his security blanket and thus is able to let go of over $110,000 to purchase all of the people. He then puts them to work on the building site: which shows their incompetance when it actually comes to hard work. Stack's comment about not know what work really is like is contrasted with this scene where he simply bumbles everywhere. He claims to know real hard work, but the workers on the building site are true workers. He simply lounges in his exclusive country club.Robert Stack reminds me of Troy McClure from the Simpsons. It is hard to imagine him in anything else other than Unsolved Mysteries (the US version of Australia's Most Wanted, except they also focus on the supernatural). It is funny seeing him playing a role in a movie, and even then it is one of the rich bad guy.It is interesting though to wonder if the makers of this movie really to consider the rich to be like this and are more like the developer, or if they live this way yet criticise the rich for living like that. It makes one wonder if the filmmakers of Caddyshack II are in fact hypocrits or not.",
            "review_date": "2011-11-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Faulty Cloning at work",
            "content": "Have you heard the theory of cloning redundancy, where a copy is poorer than the original?  Caddyshack 2 is a perfect example of that.  They try to duplicate everything from the first movie.  Now, in a few cases this work. Robert Stack is actually a little better than Ted Knight, when they play essentially the same character.  I actually like Randy Quaid, who is no more or less offensive than Bill Murray in the original.  But Jackie Mason is no Rodney Dangerfield, and worse of all, C2 demonstrated once and for all that Dan Ackroyd is one of the worst comedy actors of all time.  There is very little that I like him in, and C2 nailed the coffin shut on his \"comedic\" career as far as I'm concerned.  He seems to feel the same, sticking more to tuffy like Driving Miss Daisy and hosting Psi-Factor.  Other than that, it's mostly, \"been there, done that\" for Caddyshack 2.  Watch the original twice rather than each version once, and you'll get more for your rental money.",
            "review_date": "1998-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome movie",
            "content": "I have seen this before in the 80's watched it again yesterday. I laughed and giggled through the whole movie.",
            "review_date": "2021-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a hole in one but at least a decent par",
            "content": "This inevitable sequel to the raunchy 1980 comedy classic falls a little short of its hilarious predecessor and winds up being a bit too annoyingly slapstick. Not a bad film but it could've been much better especially if much of the talent from the first film had returned here instead of miscasting a bunch of series newcomers. This sequel was aimed at more of a family audience than the adult oriented original and that may be one of the problems. Live action family oriented comedies that cast people who are known for their levels of raunch barely ever really work. Still, some fair laughs are generated in this tale of a snobbish millionaire (Jackie Mason) who figures that he can easily buy a country club but instead he winds up in heated battle with its current management who is not willing to sell it to Mason's terms. His idea is to combine a miniature golf course and amusement park along with their regular golf course. It causes some disagreements. Chevy Chase is the only returning cast member but his role here is much less showy and Dan Aykroyd attempts to fill in the void left vacant by Bill Murray and only moderately succeeds. Letting the gopher return to the golf course as well provides more boredom than laughs because he's not really funny anymore. His presence is unnecessary. Still, it's an OK sequel but the absence of much of the original film's success often makes the viewer think about what could've been.",
            "review_date": "2002-11-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Caddyshack 1.5?",
            "content": "One of those comedies you just sit there and stare at as if you were numb. Not a laugh to be had in the whole movie. Dan Aykroyd has committed some amount of acts against cinema and his Captain Tom Everett character is up there with the worst of them.",
            "review_date": "2022-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Garish, lame, substandard, and ludicrous",
            "content": "Garish costumes, lame wisecracks, a substandard replacement for Rodney Dangerfield, all make for a ludicrous example of 1980s comedy. What a pathetic sequel to a great comedy.",
            "review_date": "2020-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why?",
            "content": "Caddyshack II is one of those pictures which makes you ask 'Why?' As in; 'Why was it funded?': 'Why was it made?' and 'Why was it released into the public domain?'.To say the least it's a bad film. It serves little purpose but to underline how superior its prequel was by setting an almost identical set of characters against each other in a similar storyline as a 'New money' land developer attempts to buy out the establishment's golf course sanctuary. Right off the bat making the follow-up a whole 8 years after the original is somewhat bizarre. I mean if your going to cash in on highly successful picture such as the first one then you have a window of a few years to do so. But leaving it 8 years means that the formula is hardly fresh enough to simply do a follow up, or poor imitation as this is, so your sort of obliged to reward fans of the original by giving them at least reference to if not indeed actual contributions by the actors who made the first one so memorable. But there's little if any of this.Instead we get cheap imitations. Okay the passing of Ted Knight in the interim years would have made it impossible to bring back the memorable Judge Smails but Robert Stack's inclusion as 'Chandler Young' (a fellow WASP elitist akin to the Smails character) is unimaginative and seriously lacking in the sort of anarchic frustration that made Knight's turn so watchable. Jackie Mason's 'Jack Hartounian' is a feeble attempt at recreating the non stop wisecracks delivered by the Al Czervik (Rodney Dangerfield) character of the first. While Dangerfield's role was endlessly quotable Mason's is completely forgettable. Bill Murray's laughably ridiculous groundskeeper 'Carl Spackler' and his war of attrition with the pesky local gofer is substituted for his Ghostbuster's co-star Dan Ackroyd's role as the militant 'Capt. Tom Everett' who's high pitched voice just splits your sides with frustration as opposed to the intended laughter.Randy Quaid , brilliant as Cousin Ed in the National Lampoon's Vacation series, is quite the opposite here playing Hartounian's unstable lawyer. The looks of disbelief shown by the actor's looking on at Quaid's character's intended to be hilarious acts of inappropriate violence echo that of the audience. Your not laughing. Your just asking 'What the hell is he doing?'Chevy Chase shows up, all be it occasionally and wisely rather fleetingly considering the disaster that's perpetrating itself around him,as club pro 'Tye Webb' in the films only direct reference to the original not withstanding the golf course itself that is. With his deeply tanned skin and loud Hawaiian shirts Chase looks like he's just got back from a lengthy summer vacation and needs a paycheck. He distances himself from the events in the actual picture enough that he takes little of the blame and leaves with some, all be it little, credibility still intact. Jessica Lundy as Mason's daughter 'Kate' takes over from the 'Danny Noonan' role of the original as teenager struggling against class divides. Sounds ridiculous doesn't it? At least in the first Danny (an Irish Catholic from a blue collar family) and his laughable attempts to make inroads into the White-Anglo-Saxon-Protestant dominated world of the golf club mover and shakers was played out to some memorable set pieces such as being dismissed by the resident Lutheran Bishop as well as being mocked by the offspring of the local yacht club. Lundy's embarrassment of her father's inability to fit-in is hinted at being because of his Jewish roots. That aside it may also have to do with him being a classless moron but such intricacy's are swept aside though I stopped caring long before they were resolved. At the end of the day Noonan was trying to get ahead in life. Miss Hartounian's biggest problem is getting the hob nobbers at the local golf club to like her multi-millionaire father so that she can get a date with the club's prodigal white kid. Or so I gathered. Anyway in summation its poorly written, badly scripted with lame set pieces and wastes a lot of talent. Indeed kudos if you were able to sit through it to it's conclusion. It really is a penance. There is that question mark though of why did so many of the original actors not return as opposed to being replaced by performers who on paper at least looked their equals. Maybe they just weren't asked. Or perhaps I suspect they actually read the script. Stick to the original!!!",
            "review_date": "2009-07-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not as bad as people would have you think ...",
            "content": "Seriously. If this had been the first Shack movie, it would have been passable as funny, silly and goofy. Light satire commentary on the class system would make this an enjoyable late-night rental.However, everyone wants to compare it to the first film, and maybe that's not fair. The first film is a cult classic; what could possibly follow it up? Nothing. So take this second film as a stand alone, and it certainly has its moments.Jackie Mason is amusing, doing his best Rodney-wannabe impersonation. Is he as good as Rodney? No. Are his lines as good? No. But he is funny. The rest of the cast falls in line as being decent, but not outstanding. You'll recognize faces amongst the cast and wonder how they got to where they are today.The film is predictable, but aren't most in this genre? Again, it's not the best comedy you'll see, but if you like Cannonball Run-type fun, you'll enjoy this one.",
            "review_date": "2006-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A huge leap downward from the original",
            "content": "When a hardworking entrepreneur is rejected from a prestigious country club, he starts a battle between the members and eventually buys it from Ty Webb(Chevy Chase) and turns it into a theme park/golf course in which everyone can join.This is by no means a good movie, but it is still slightly amusing at times. Almost all of the comedy is cheap slapstick and bad jokes except for Chevy Chase. Chevy Chase plays one of his greatest roles as Ty Webb for a second time and plays it great. He is not only the funniest character in the movie, he is the only funny character in the movie. Even Dan Akroyd fails to bring humor to this film which aspires to be a great sequel to a classic comedy but falls to rubble with others shown on Comedy Central. The movie might have been better if Ty Webb(Chase) had a larger role but instead he was reduced to a minor character and the star became Jackie Mason(Who??) They should have brought back all of the cast and made a sequel the right way! This is a perfect example of what not to do when making a sequel to an already great movie. Overall, Caddyshack II is humorous but a large mistake.I do not recommend this movie.",
            "review_date": "2005-10-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "what? are you kidding?",
            "content": "i am in a vast minority here. i also didn't much care for the original caddyshack, aside from the chase/murray duo scene and select rodney jokes. okay, break it down: rodney vs. jackie- both jewish and have similar humor. rodney's a bigger name and more distinct. jackie has an incidental and more observational approach to his jokes and is more 'up yours' in this sequel. jackie's attitude toward everything is memorable and in a way, inspirational! his quick lines and over-confidence left me wishing i could express myself in such a way. rodney was good, but there wasn't enough of him, and he was more 'in your face' and dismissive. jackie, in a rare film appearance, makes a perfect sub for rodney (come on, a gun shaped hair dryer?!?!) really, look at the little things!stack vs. knight- both play snobby yuppies very well. ted knight, despite his wonderful tv/film career, kinda shows his age. but, he does pull off the snobbish demands of the part and we want to see him fall. ted looks kinda weak and is pretty annoying, playing his anger and frustration too slapstick, while stack is more incidentally snide and vengeful; you really hate him and enjoy see him constantly fail. stack wins with me.\nmurray vs. aykroyd- well, both had great, vintage SNL-like scenes with the ever-present and enjoyable chevy chase (ty webb). i did like the murray/chase one better. murray plays his great, annoying, chatty character with obvious improv skill and is loveable- yet annoying. and the exact same can be said for aykroyd. both get annoying after a while, but it's a tie.i really loved part 2 over the first. they are 2 totally different mooded films. part one is more drug/bathroom/sex humor with a cast full of great names. part 2 uses golf as a backdrop for a 'stick-it-to-the-rich' type of comedy that makes one feel better about being working class. 80s script? yes. a bit far-fetched? yes, but wasn't the first? an insult to the sport of golf? yes, it's a movie. thin story? yes, it's a comedy with actual humor- not 'dances with wolves'!! besides- part 2 has a much better soundtrack!! PLEASE- DON'T EXPECT THIS TO BE A SEQUEL TO PART ONE!! IT IS 98% ITS OWN MOVIE AND SHOULDN'T EVEN HAVE THE NAME 'CADDYSHACK' IN IT. that said, i am a big fan of caddyshack 2 and it is a great exponent of 80s fluff entertainment with quality humor. VIVA JACKIE MASON!!! to all the reducers- lighten up! it's a great comedy of its own. randy quaid was wonderful, jonathan silverman was wonderful, heck, everyone was!! all this chatting and now i feel like watching it! i think i will",
            "review_date": "2002-04-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst then first movie of Chaddyshack and that was an awful movie.",
            "content": "This is an awful movie. 3.7. This is such a an awful movie that 3 is overrating it. This is a 1. The fist movie of Chaddyshack was awful and this is worse. This movie is not funny. The story line is awful. The hummer is awful. Do not see this movie. Life is to short and like most comedy movie this is just a money grab. Do not see this movie. There are good comedies out there. This is not one of them. You have been warned. Do not see this movie. Most sequel are better then the fist movie. But not this one. It is just awful. I hope there is not going to be a Chaddyshack remake. And if there was it would probably be better then this movie.",
            "review_date": "2017-09-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "not as bad as the first one",
            "content": "i actually almost liked this this movie.i thought it was witty and better written.the dialogue is better than the first one.there are also a few amusing moments.i even chuckled a few times.plus,i thought the characters were better and the movie had a better,more substantial story.having said all that,i still didn't think it was a great movie,but at it was watchable,even entertaining at times.the rating for this movie,on this site(3.4/10)is even less than half the rating of the first Caddyshack movie,and i am truly mystified.i will never see the appeal of that movie.as for Caddyshack II,not the best movie every made,but nowhere near the worst,either.my vote for this movie is a 5/10",
            "review_date": "2007-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Boy this is a tough room.\"",
            "content": "So says Jackie Mason, not replacing Rodney Dangerfield (who could?), but playing a brand new role that is nowhere nearly as funny or likeable which is why the movie audience remained closed mouthed to his antics. This sequel to the semi-modern comedy classic is closer to a follow-up, or rip-off, lacking the laughs and likeable slobs and the fun to hate snobs. You've got a professional cast hired to replace the late Ted Knight and the non participating Bill Murray and my favorite, soap matriarch Lois Kibbee, who was a perfect Margaret Dumont like straight woman to Dangerfield's insults. Chevy Chase participates in a limited role (owner of the Bushwick Club), but it's just his schtick and unimportant to the story other than to come in here and there and ultimately humiliate the new set of snobs. The gopher's back too, and he needs to end up in the country club kitchen as dinner.Wealthy contractor Mason wants to join the country club but is snubbed by the wealthy Robert Stack, who wants to keep Mason out, aided by his charity head wife Dina Merrill and the stuffy, dislikeable Paul Bartel. Mason attracts the attention of fun loving rich lady Dyan Cannon who seems to relish these types of roles as a pretty lady who has a thing for funny men whose looks are funnier. She lacked out on the funny part with Mason who is far too forced to really get the audience in the palm of their hands.For the teen audience, there's caddy Jonathan Silverman, abused by Stack and Merrill's daughter Chynna Phillips (a big block of ice on film) yet liked by her friend Jessica Lundy who turns out to be Mason's daughter. Merrill seems to enjoy being knocked around and doing things you wouldn't expect one of the world's wealthiest heiresses to do (like being chased by a giant steam shovel, forced to do manual labor and get knocked into a truck of manneur bags) so she comes off fine, but comic gems like Randy Quaid and Marsha Warfield seem to be thinking that they don't get paid enough to look ridiculous. Dan Ackroyd is eye rollingly unfunny in a variation of Murray's role, truly embarrassing. Like \"Airplane II\", this ends up being one of the worst sequels ever to a classic comedy. The gopher ain't all right this time around.",
            "review_date": "2021-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad!!!!",
            "content": "Why was this movie ever made?They have tarnished the original Caddyshack with this crap.I was only able to watch half of it and i didn't laugh once.At least i didn't pay to see it because it was on t.v. but i won't get back that hour of my life that i spent watching this dreadful mess.There wasn't one original star from the first except for Chevy Chase and he probably regrets doing this film.Jackie Mason was supposed to be the outrageous,funny buffoon like Rodney Dangerfield was in the first but Jackie Mason wasn't funny at all.Jackie Mason is no Rodney Dangerfield.If you want laugh,watch the first Caddyshack.If you like terrible movie's,then this you're movie.This movie stinks like a barnyard in july.Avoid at all cost.",
            "review_date": "2004-07-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not great",
            "content": "Despite the fact that there are some funny parts, this movie is pretty dumb. Chevy Chase is barely in it, the new characters aren't really funny, except for Randy Quaid's, and the atmosphere is really boring.",
            "review_date": "2021-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Vile",
            "content": "I have vague memories of this movie being funny.Having seen it again either I have changed or I was thinking about a another film altogether.It seems as if we are supposed to be sympathetic to Jackie Mason's character however nothing in the movie actually engenders that emotion. Its notable that he is really the only person accorded tender dialogue with loved ones. No-one else's character is allowed to rise to the status of even vaguely human.I don't even like golf but as the film went on I found myself really rooting for Robart Stack and the club guys, really hoping they would repel Mason and Chevy Chase.",
            "review_date": "2009-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely NOT funny!!",
            "content": "This is long overdue - which movie sequel was much worse? To me, it was either \"The Jerk, Too\" or \"Caddyshack II\"? I hold reservations for both wastes of celluloid, and just by a pinky finger, this follow-up to the 1980 laugh-fest seemed to gather even a chortle from me.Sadly missing is not only Chevy Chase, but the late Ted Knight, Michael O'Keefe, and Cindy Morgan. So instead, they have the totally unfunny Jackie Mason, the stoic Robert Stack, and of all actors, Dan Aykroyd replacing Bill Murray! I was appalled by Aykroyd's role I just wished that Murray would have popped in for at least a cameo. Even Rodney Dangerfield was not his zinger-filled self. I just wanted to leave the theatre early, but I was on a date and didn't want to be rude. Yet she agreed that this was arguably the stupidest sequel of a 1980s hit to ever be filmed or released.Skip this, burn your DVD or VHS tape...for the sake of humanity! Just not funny.",
            "review_date": "2019-02-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Six is generous, I know, but,,,",
            "content": "As just about everyone agrees, this is a curate's egg of a movie, namely good in spots. The problem, of course, lies with the script which is neither as funny nor as inventive as the writers, the players, the producers and the director so very obviously think it is. I also blame the editor. The Warner Brothers DVD runs 99 minutes and should have been cut down to 89 minutes at the very, very most. The sticking point, of course, is which scenes to cut. For a starter, we have far too many unsympathetic characters and these are made up of just about the entire male cast! And personally, I didn't take to the animation sequences with Mr. Gopher either. They were well staged, but I didn't think they were particularly amusing. When you are editing a movie – and I have enjoyed some experience in this field – you have to ask yourself, \"Is this scene really necessary?\" Preferably, each scene should advance the plot or reveal some aspect of the characters, and yet be amusing, gripping or suspenseful in itself. This simple dictum was not followed in this film. I'm sure the producers – and there are three of them, would you believe – said to themselves, \"Everyone who saw the original Caddyshack will want to see this one too, so it really doesn't matter!\" Available on an excellent Warner Brothers DVD. Incidentally, the short Bugs Bunny sequence is missing from this DVD.",
            "review_date": "2016-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "NOT Caddyshack!!!!",
            "content": "The only conceivable flaw of this film is it's title!! Please stop comparing it to the first! I did in my previous review only to separate it from the first. If you haven't seen the movie and are curious, TOTALLY forget about the first and invent a different name for this. There is nothing alike and has a mood all its own. This is a great exponent of screwy mid-80s comedy. I seriously doubt such big names in this cast did the movie because they were broke or even wanted to remake the first. Anybody who ever wanted to give a kick to the snobbish aristocracy should love this little opus. I maintain, the only reason this is in the IMDB bottom 100 is because of its title. I usually hate movies like these (i.e. adam sandler, will farrell, farrelly bros....), but this movie just keeps me laughing hysterically. I dunno, maybe it's like a bad relationship I can't get out of or just a ridiculous guilty pleasure. Either way, this is the single most underrated movie of the 80s behind 'The Stunt Man.'Robert Stack- WE LOVE YOU!!! (1919-2003)",
            "review_date": "2003-05-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I actually like this movie...let me tell ya why.",
            "content": "OK first off I'm not gonna say I like this film more then the original, that would be crazy and completely absurd. That being said I think \"Caddyshack 2\" gets a lot of undeserved hatred and ridicule. I must admit when I was a kid I saw \"Caddyshack 2\" way before I saw the original so I think I had the luxury of not comparing the two films to each other and experiencing it as a stand alone movie. I have since watched the original many times and it's one of my all time favorite comedies. So many great quotable lines from so many great comedians make it a classic and far superior, but the sequel has some pretty damn funny parts if you give it a chance. The characters in the sequel don't go by the same names but are quasi-replacements of the original characters (except for Chevy Chase). Now this is a good thing and a bad thing as at first it seems very weird to do such a thing, but I think they made the right choice. To replace the actors and keep the same named characters would have been a much bigger mistake and would have been sacrilegious so they made the best of a bad situation and made that decision. Robert Stack, Dan Aykroyd, Randy Quaid and Jacky Mason aren't Ted Knight, Bill Murray and Rodney Dangerfield but they're not chopped liver either and that's my case for the sequel. While it's not the original it has it's moments so give it a swing and see if it's a hole in one, a bogey or just above par.",
            "review_date": "2014-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I have things to do...",
            "content": "Jack, a good-hearted real estate tycoon, applies for membership at a country club, but is blackballed by members, led by Chandler Young.As revenge, he simply buys the club outright and turns it into a garish amusement park.Chandler wants to win the property back by challenging Jack to a golf match, but he hedges his bets by hiring a deranged mercenary, to eliminate his competition.So this movie is rightly derided by the makers and the stars of the first movie, but what about everyone else? Yes its a film that should have never have been made, but this was the eighties, and these films with this plot and narrative were made every couple of months, you know the one, the rich people want to keep the club for themselves, and the outsiders want to share it with everyone.No, I didn't laugh once, but it never bored me. That's because it's such a wonder of a film. Chase and Ackroyd show up for extended cameos, and add nothing but more curiosity to see it, and while Mason is fine, he is no foil to Rodney Dangerfield, but is watchable never the less.The rest of the cast are there, but nothing more than caricatures of better characters we have seen before in better films. Quaid is the one stand out, absolutely going balls to the wall with his performance, and really, he should be in a different film altogether.So all in all, it's a complete disaster, but it's one of those films that has to be seen to be believed.",
            "review_date": "2022-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Quite frankly, one of the greatest film achievments of all time...",
            "content": "I don't think anyone gets it. Caddyshack 2 was the pivotal film of the 1980's. It has certainly told me a thing or two about film-making. Whilst perhaps you couldn't realistically name Allan Arkush as a director-god, there surely must be some similar accolade which can be bestowed upon him. In this film, (or should I say 'piece of work'?) Arkush reintroduces us back to the intense situation from the first film, but this time with different characters. With some show stealing performances from Sid Conrad, Ben Hartigan, John MacBride as the naked men, Diana James, Trish Ramish, Mary Stavin, Tamara Steffan as the girls in bar, and the unmatchable Carlos Cervantes (I), Dennis Bowen, Mark Christopher Lawrence, and Kenny d'Aquila as the construction workers, Arkush has managed to maintain sobriety and kept a cool directing hand during production.There's no film that can better it...",
            "review_date": "1999-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "as highlander II was to Highlander, so was caddyshack II to Caddyshack",
            "content": "It sucked.I returned the video after watching half of it. Not funny,just a cheap and desperate attempt to cash in on a very very funny original.  junk, forget it, don't waste your time etc etc",
            "review_date": "1999-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stinker!",
            "content": "Caddyshack was an hilarious film with three different plots tied into one main landscape, a golf coarse. Bill Murray after the gopher, Chevy Chase and his caddy, Rodney Dangerfield and his gambling on golf games and the film was a hit. Then came Caddyshack II, bad move. The film is to stupid to enjoy, no funny jokes at all, and if it's a sequel where is the original cast? We got Chevy Chase and that's it! We got the gopher but he is not needed at all. Jackie Mason is to obnoxious to be enjoyed and Dan Akroyd as a soldier paid to help the villain cheat at golf, he is totally gay in his part. The cast is up in the air with bad talent! A few good performances here and there like Randy Quaid or the gopher but the film lacks! Nothing original. It just ends up the same with Jackie and the villain playing golf with the bet on leaving the golf club at stake and it's totally predictable. Jackie wins, woo who! But here's something the last film didn't have, special affects! We have Jackie using weird mechanical golf clubs that look totally cheesy, like they're wrapped up in tin foil, and they come with special tactics that look like crap! The Special Affects are cheese, not good at all. I loved the original Caddyshack but this film is a total bomb. Where's the plot, where's the original cast, where's the entertainment? Down the tube. This film gets the big 4, they tried but they tried with little effort. Avoid this film, not recommended unless you like to get a good nap.",
            "review_date": "2005-06-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not nearly as good as the first",
            "content": "While this lackluster sequel isn't nearly as good or funny as the first, it's got a few laughs and is likeable enough.I'm not much of a Jackie Mason fan, but was amused by his performance here. Randy Quaid was hilarious as always and stole the movie from Mason.I also got a few chuckles here and there from the golf course makeover.So, don't expect much, but it's good for a few laughs and worth catching on HBO...",
            "review_date": "2001-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not the worst",
            "content": "I remember my late sister and I watched this all the time as kids. Honestly without the Kenny Loggins song it would be a 5/10 imo. Granted it's not the slapstick R rated comedy like the first but for the PG-13 kids it's enjoyable. I have seen a lot worse sequels than this one.",
            "review_date": "2022-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Utter Pants....",
            "content": "If you loved the first - do yourself a favour and don't put yourself through 1hr 20 minutes of utter hell.I would like to pretend that this movie never existed.  It amazes me how a talented man like Ramis could have come up with such a p**s-poor sequel. The things people will do for money...The only \"humour\" in this film comes from Mason.  That said,he is still only a pale inmitation of the great Rodney Dangerfield.Caddyshack II remains to this day a disgrace to the original.",
            "review_date": "2000-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "really underrated",
            "content": "I was really expecting to hate this, I'd heard so many bad things about it. So maybe that's why I liked it more than most of the reviewers here. I didn't have such high expectations that it would be as good as the original. Well, it isn't as good as Caddyshack of course, but it is good on it's own merits, & very funny at times. I thought Jackie Mason was just terrific in this, he has great comic timing even when his jokes are old ones that I'd heard before. Even his delivery or his mannerisms make me laugh. The supporting cast were all real good for the most part, especially Chevy Chase who had some great one-liners, & Dyan Cannon was real good & fun to watch as usual. She looks really beautiful in this, considering she was in her early 50s. The girl who played Jackie Mason's daughter was pretty good too, & really nice to look at. The worst part of this movie was the Dan Akroyd character. Bill Murray would have been so much better. Also, the movie is just too silly, and just plain dumb at times, the gopher is used too much, and Marsha Warfield is in it (but thankfully, not too much). So, if you don't expect much, you might enjoy it. It's not a great comedy, but it's not embarrassingly bad like most people say it is. The problem with those people is they want to compare it to the original. You can't really blame them for that. But when you watch it, try to forget about the original and accept it as something separate from that. I wish Rodney & Bill Murray were in it too, but they're not. So what? I wish John Candy was in it. He would have been great too. But he's not, so what? It's still pretty funny. Hey, if I liked it than it can't be that bad. My standards are pretty high.",
            "review_date": "2009-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good thing I don't throw in with ratings!!",
            "content": "Amazing, one of my favorite movies way down at the bottom. Guess I can take some pride in not liking what \"the general populace\" tends to go for. Jackie Mason is hilarious in this movie, and so's Randy Quaid. I can never get enough of his \"strong-arm\" tactics, just like in Moving. He was also notable in National Lampoon's Christmas Vacation. Love that guy.",
            "review_date": "2004-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a hole in one",
            "content": "If you had to choose this to either be A) The worst movie of the 80s. B) The worst sequel. C) Worst sport movie or D) All the above. I choose D. I saw Caddyshack a year before I saw The first one, and that was back in 1992 when ABC decided to air this movie as part of their Saterday night movie night. To be honest here. This movie is not good as any of the movies that came out in 1988. The only good one I seen that year was Willow. The main problem was that it did not compare to the first. The cast in this one did not have same type of cemenstry that the cast in the first one had. First of all they replaced a red head Michael O Keef w a dark hair cool new comer Johathan Silverman, then they Replace Bill Murray who save the first one w another Ghost Buster Dan Aykoyd, then they replace Roddney Dangerfeld w an obnoxious Jackie Mason. And then Harold Ramis decides to give Allen Arkush the directing job and has not directed another movie since this one. The rest of this film was just slow and dry. Just remember that this was one of the first movie that Warner Brother put a new thing called DVD. The DVD cost $5.00 at Walmart and there no special feather. Just the movie in full screen along w chapter names.Food for thought. If its a nice and sunny day and its 70 degrees outside. Instead of spending $5.00 or or watching this movie. Why not go out the country club and treat you and your friends to a nice game of gold. Or if its a nice and sunny Sunday afternoon. Take the family to the miniature golf course and play a nice round of miniature golf",
            "review_date": "2011-04-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "7/10",
            "content": "It's really not that bad! Give this one a chance. It's not brilliant, but it's a fun movie from the late 80's. Great writing. Chevy Chase returns in his usual comedic form and the rest of the cast is pretty solid. Be the ball!",
            "review_date": "2020-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must Be Seen to Be Disbelieved",
            "content": "Caddyshack 2 is so bad it must be seen to be disbelieved (and I loved Caddyshack). It is an insult to movies, golf, gophers and humanity in general and must rank as one of the worst movies ever made.It's not bad in a bad Adam Sandler movie way either. It is so bad its surreal. It is so strange and poorly written you will be convinced that the screenwriters must have been dropping acid. Everyone in the movie is embarrassingly awful and Dan Akroyd, who speaks his lines in a strange, high-pitched voice, should have his SAG card revoked for his performance as a crazed grounds keeper.The movie \"stars\" an incredibly miscast and unfunny Jackie Mason, and his love interest is played by an ancient and cadaverous looking Dyan Cannon (I am not kidding). To give you an idea of how old Dyan Cannon is, she was once married to Cary Grant. For masochists only.",
            "review_date": "2011-09-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Who thought this was necessary?",
            "content": "I'm rating this a 1/10, because they wouldn't let me rate it lower. Jackie Mason is awful to listen to, doing his best, worst Dangerfield impression riffing and \"trying\" to be funny. Chevy Chase seems embarrassed to be in it while he's giving his lines, and the premise is downright stupid. This is bad even for a money grab, silly, supposed to be bad but funny movie.",
            "review_date": "2022-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Horrible unfunny trash",
            "content": "This is quite possibly the worst sequel ever made.  The script is unfunny and the acting stinks.  The exact opposite of the original.",
            "review_date": "1999-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watchable but not very funny.",
            "content": "\"Caddyshack II\" is not a very funny movie but it does have a few laughs. Although I enjoy the original \"Caddyshack\" it is not sacred territory to me. The idea of a \"Part 2\" doesn't bother me but \"Caddyshack II\" is not nearly as good as the first one. Jackie Mason is a poor substitute for Rodney Dangerfield. Mason has a few good lines but he's in way too much of the movie. When the star of your movie is Jackie Mason, you're in trouble. The rest of the cast is mostly fine. Chevy Chase is funny. Dan Aykroyd is not. \"Caddyshack II\" is an okay but mostly forgettable movie. Honorable mention: Robert Stack.",
            "review_date": "2019-08-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This \"movie\" Is without any merit, whatsoever !!!",
            "content": "I very much wish that I could give this movie a zero, or a negative number. The talents of these enormously talented actors - Jackie Mason, Robert Stack, Dyan Cannon, Randy Quaid, Chevy Chase and Dan Aykroyd were enormously wasted in this film that took away 98 minutes of my precious life. Were the writers, producers and the director of this tragedy on some kind of hallucinogenic drugs, or were they just so lacking in talent that they could not produce a much, much, much better sequel than this disaster??? I feel like I totally deserve to receive every penny of the money that I wasted going to see this bad, really bad flop of a film. I expected a much better film than this monstrosity. There is some debate as to which movie made, throughout the history of film is the worst. Well, this \"film\" puts an end to the debate. It is the worst movie of them all. It was not even slightly funny. In fact, nothing in the movie made me smile, let alone laugh. I will never understand why in the world the big talents I mentioned earlier didn't merely walk away from this movie after reading the script. Even the gopher was UN-funny. It was just another annoyance in this totally rotten tomato of a film.",
            "review_date": "2017-01-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why the Bad Reviews?",
            "content": "No, its not Caddyshack... but it made me laugh out loud which is what I needed. Personally, I liked Jackie Mason. The movie is not an Oscar winner but who cares when you want a light film that doesn't require a lot of brain power.",
            "review_date": "2021-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "very stupid, but hilarious flick",
            "content": "This move is incredibly stupid, but I find it very amusing to watch.  It is an 80s movie, so it is off to a bad start before the first scene!  The best part in this is definitely played by Dan Aykroyd as Captain Tom Everett.  He is trying to bash a gopher's head into oblivion.  He also is hired to blow up a golfer because Robert Stack as Chandler Young wants to win a golf match.  During the course of the film, Aykroyd as Everett blows up a Rolls Royce, drives an RV with a hot dog stand attached to be in-cognito, shoots himself in the tailpipe with a poisonous arrow and hits an explosive golf ball at a watermelon in a noose!  What the hell kind of script does this sound like?  Yes, a terrible 80s script, but the movie is very funny. Another good part is when Todd is sliding down a water slide and trying to show off for a chick.  How the hell can you show off by going down a slide, you just go down it, right?  He claims \"Yeah!  Oh Yeah!  and is pumping his fists as he slides down a waterless slide and burns his ass.  An entertaining movie with a very stupid plot, what else would we expect from the 80s!?",
            "review_date": "2001-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I know I'm gonna get booed for saying this, but......",
            "content": "This was better than the original. Yeah, it wasn't an outstanding film, but the first one was just a stupid satire of waspy golf clubs and the poor catholic caddy who gets to live the good life (real original). It wasn't such a bad movie either, but this one has Jackie Mason (what a combination!) who is the center of the film. The whole class struggle hooey theme is still in place, but its easy to block out. And Mason's jewish accent is always music to the ears, and his interesting take on life comes across in all his performances. When he used the word \"fanzanoon\" (which isn't even a real word in any language) and then explained what it meant, me and my friends exploded with laughter. Even though this movie won the Razzie award for worst song, and worst supporting actor, Dan Ackroyd, and was nominated for worst film, while Jackie himself was nominated for worst actor, I recommend seeing this film, which is often on comedy central, the WB, and premium cable.",
            "review_date": "1999-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Inexplicably Terrible",
            "content": "Still can't believe someone produced this atrocity, yet thought, \"Yes! This is it! This is exactly my vision! People are going to laugh at this!\"Hands down, one of the worst movies ever made.",
            "review_date": "2022-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's not THAT bad...",
            "content": "...although I'll be the first to admit that it's not that good, either.Fans of the original Caddyshack probably won't like this film (I can tell that right off from many of the reviews here). If you want to see this, it might be better to try and see it as a movie by itself and not as a sequel. It has its moments, but it isn't the original.*May contain spoilers*A mere 8 years after we first visited Caddyshack, all of the original members are gone except for two (the first hint that it won't be the same). We meet Kate Hartounian, a college girl and daughter of a wealther- not to mention goofy- building contractor, who is hoping that a membership at the posh Bushwood will net her some badly-desired popularity. The people she is trying to impress just happen to be suing her father for some apartments he is building near the country club, so they turn down his membership and he vows to get revenge...in his own goofy way.The film has some bland humor. The only two original characters that came back in this one are Ty Webb (Chevy Chase) and the gopher. Fans of the original will find three very different things about this film, compared to the first: The movie is Caddyshack 2, yet we aren't seeing anything about the caddies as we did before. The movie isn't racy at all, except for one hot little dance number, and finally, the gopher is present but he doesn't play any kind of \"major role\" as he did in the first one. He makes a few cameos to do something funny, but that's it. There just isn't any toilet humor in this film that will appeal to fans of the first.I liked it, but mostly because I'm a fan of Robert Stack. So I say- give it a chance.",
            "review_date": "2003-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Totally unfunny and stupid",
            "content": "This movie sucked big time. I never saw the first one so I am not comparing it to the first one. I saw it because a friend gave the DVD to me as a gift and I couldn't return it. SO I had no choice but to check it out. Most people who hated this movie were right. The snob characters were so one dimensional and carbon copies of each other. Robert Stack's character was snobbish and outwardly mean and nasty for no reason. His friends were snobbish and outwardly mean and nasty for no reason. His daughter was snobbish and outwardly mean and nasty for no reason and so on. Why on earth would Jackie's daughter want to hang out with them?Jackie Mason should take target practice because he was shooting off 20 jokes per second and totally missing the mark. Every time Chevy Chase would show up, I would hate him. As the movie progressed and he shows up again, I hated him even more. None of his jokes or weird antics produced even a smile. What the was Dan Ackroyd doing in this movie and why did he go after the gopher after it stole his twinkies?The movie was predictable and has no redeeming quality to it. Maybe Randy Quaid shined in it alittle but that is not saying much. Don't waste your time and make sure to tell your friends not to get you this movie.",
            "review_date": "2004-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad follow-up to Caddyshack",
            "content": "When I first viewed this movie, I didn't know the title of it. I realized it had Chevy Chase in it with the same name he had in Caddyshack so I had an idea this was Caddyshack 2. At the end of the movie when I did find out it was Caddyshack 2 I was disappointed. They could have done better. Dan Akroyd I thought was bad. The whole story was bad. Call this movie by another title, but don't call it Caddyshack 2. You give that great movie a bad name. Jackie Mason's daughter when I first saw her looked like his wife. How old is this girl? Geez. How about making this movie a little believable. I thought Chevy Chase was good.",
            "review_date": "2005-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "When does the hurting stop?",
            "content": "In this dreadful follow-up, Jackie Mason stars in the role that was custom-made for Rodney Dangerfield.  Unfortunately, Mason is no Dangerfield. Also missing from this poor excuse for a sequel are jokes, a plausible story, and (most important) Bill Murray.  Chevy Chase does make a few appearances that surprisingly ease the hurting, but his contribution is nowhere near enough to save this death camp of a film.",
            "review_date": "1998-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't bother",
            "content": "If you enjoyed Caddyshack then don't bother with this film as you will be sorely disappointed. Just another example of Hollywood trying to milk the success of an original with an all round poor sequel",
            "review_date": "2019-03-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Give Jackie Mason a chance -- he's an underrated comic genius.",
            "content": "Like Richard Pryor, Mason never got the material he deserved. Whatever you know of him is probably wrong. Get past the accent and go see his stand-up. You'll be very surprised -- he's one of the best stand-ups I've ever seen and I have seen a lot of stand-up comedy (from Lenny Bruce to Eddie Murphy to Jerry Seinfeld to Chris Rock -- Jackie Mason is definitely up there). He's known for being a comic's comic. Even Howard Stern said he is one of the top 3 funniest comedians ever.The accussation that Mason is no Dangerfield is ridiculous. Dangerfield is known for having been a huge Mason fan. Dangerfield's career was going nowhere for a long time until he started following Mason's shows. That is when Mason provided Dangerfield with inspiration for his, \"get no respect\" routine. While I think Dangerfield is great, see them both do stand-up and you'll see Mason is the better comedian.",
            "review_date": "2002-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "NOT GOOD, but for the circumstance NOT TOO BAD",
            "content": "Caddyshack II is NOTHING compared to the original Caddyshack. But, there are legitimate reasons for it. (1) Rodney Dangerfield was supposed to be the ace of this film BUT he didn't like the script, wanted to change it, his request was denied, so he didn't do the film. (2) It was low budget, Bill Murray had grown to superstar status. Ted Knight passed away in 1986, and Chevy Chase the \"so called ace\" of the first movie (although it was Rodney all the way)couldn't't be on more than 5 minutes, because it would cost too much to pay him. BUT you had Dan Aykroyd, Robert Stack, Randy Quaid and Jackie Mason, all serviceable substitutes, who none had their best performances.",
            "review_date": "2005-09-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just terrible!",
            "content": "I'm an absolute Chevy Chase nut but this is the worst. Ramis was right, this thing should have been scrapped before it was made. Terrible writing. Terrible storyline. Chevy Chase is the only positive in such a train-wreck. Akroyd's character is terrible.",
            "review_date": "2022-06-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just a tiny tap!",
            "content": "I didn't like Caddyshack much, and was very pleased when I saw its sequel, on which I am commenting.  Soon after the movie starts, a gopher (or is it a beaver?) has a diet root beer and sets the \"tone\" for the movie.  The self-made millionaire at the posh club also has his say while riding the hurdles.  Cryptic references aside, this is the story of a social clash that originates and is resolved on the links.  Loads of humor, and with various characters blended in, such as Chevy Chase as a big shareholder, Dan Aykroyd as the alternative problem-solver, and Randy Quaid as the attorney who can shout out the wrinkles in your suit while being polite.",
            "review_date": "1999-05-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A movie for lazy golfers",
            "content": "This movie is just as dumb as the first one. The purpose of these movies is for rich, country club, golfing, lazy, morons can enjoy. These movies rip on the working class, and just have the chessiest humor in them. But what would I know ? I live in middle class suburbia, and don't play golf. So, I guess I can't be in the \"Caddyshack Posse\"",
            "review_date": "1999-09-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not horrible; Just not very funny",
            "content": "This is considered one of the worst sequels (maybe even movies) of all time, and I really don't think it deserves that distinction. The only real problem with it is unlike its predecessor it just isn't very funny. I maybe laughed two or three times compared to lots of genuine laughs that its predecessor had. Granted since Chevy Chase is the only person from the first movie to return for this sequel, (even though it says special appearance he was in the movie more than I expected) the rest of the cast tries it's best to make this a good movie so their effort is there, they are failed by a script with practically no humor in it. Jackie Mason just isn't a match for Rodney Dangerfield's over the top irreverence. Robert Stack tries to recapture Ted Knight's snobbishness from the first film, and even though he was very funny in Airplane! he had a script with genuinely funny lines and visual gags in that movie, which he has none of here, and as a result he is just a total wasted bore. Dyan Cannon is underdeveloped and more opportunity for her character to do something could have made this a much better movie, same with Randy Quaid as Mason's lawyer. Dan Aykroyd steps in to Bill Murray's role and does horrible. Granted, I blame the script and direction for that. He could have been a great substitute for Murray if those things were better. Chevy Chase's schtick you saw in the first film and much better at that. According to Harold Ramis who wrote and directed the first movie the studio begged him for a sequel with Rodney Dangerfield returning as Al Cszervick from the first movie. Dangerfield wanted to do it but he got into a fight with the studio and dropped out of the project. Had he accepted this could have been one of the few sequels better than the first because he made the first movie the classic it was in my opinion, but he backed out and other writers decided to do the final project that is this inferior sequel. They also wanted to broaden it for a wider audience. The first was an adults-only R rated comedy whereas this is an edgy PG rated flick. By abandoning the irreverent crude humor this film failed. If Caddyshack was supposed to be a franchise, they needed to remember the irreverence that made the first so funny and carry it over to the sequel. By abandoning that the film was just desperate for humor, and we have barely a laugh to be had and actors trying to bring life into lousy material and failing. Its not as bad as you have heard but stick with the first film only and pass this one up because unlike the first this just isn't that funny. They should have scrapped this when Rodney Dangerfield decided he wouldn't do it.",
            "review_date": "2019-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Aykroyd.....",
            "content": "I was surprised after watching Dan Aykroyd in Caddy2 to see that he was ever hired for another movie after that. I mean, I know the script was terrible but that had to be worst performance by anyone that I have ever seen. It wasn't funny at all but just annoying. I think that it was Aykroyd's character and acting that really put this movie in the bottom 100.",
            "review_date": "2003-08-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a good movie, just misunderstood",
            "content": "I liked this movie.No one I know likes it, but I do.I didn't like it as much as the first one but it was still good. The script and plot may not have changed at all, but the story was better than Caddyshack 1.The only reason I didn't like Caddyshack 2 is...NO RODNEY DANGERFIELD!I think the movie would be better if Rodney Dangerfield had Jackie Mason's part. Although I did like Jackie Mason in the movie, it would be alot better if they kept Rodney Dangerfield.Another flaw in the movie, that I didn't hate as much, was Dan Akroyd. The movie was done 8 years after the first one. Bill Murray, \"Carl\", could've quit his job as an assistant greenskeeper and joined the military, you know? If Warner Bros. had thought of that, it could've made the movie better, also.This was my comment for Caddyshack II.I give it 8.2 out of 10It could've been better, but good nonetheless.If you've seen Caddyshack 1 and are debating on whether or not to see Caddyshack 2, I say give it a try.",
            "review_date": "2003-02-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "very funny and enjoyable",
            "content": "Some of you people out there are just pathetic. You give this movie a bad review because it is not quite as good as Caddyshack. This is a great movie and no sequel could stand up to the original but thats no reason to give it a bad review. This movie and is very entertaining and I think the cast was great, not as good as original cast but adding a few very funny actors including Robert Stack, Dyan Cannon, Randy Quaid, Jackie Mason, Jonathan Silverman and Jessica Lundy just to name a few and all these actors did a very good job, especially Robert Stack who was hilarious as Chandler Young. Sure Rodney Dangerfield was not in this movie but it did not need him, and again some people prefer to put down this movie just because he appeared in the original and not this one. Jackie Mason is great as the main character and fills in nicely. If you loved Caddyshack and you don't enjoy this movie something is just wrong with you, as sequels go this is one of the better made movies. To everyone out there who gave this a bad review you are mental, I suggest you seek help.",
            "review_date": "2007-07-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A good movie, not as bad as many say it is.",
            "content": "One of the most interesting things is that this 1988 film is highly touted as an `in-name only' sequel.  There's nothing wrong with that except this: The return of Chevy Chase as Ty Webb. This connects the viewer to this character (from the original Caddyshack in 1980,) and makes fans thinking or wanting Caddyshack II  to be similar to the first one.There are rumors that Rodney Dangerfield was supposed to return.  He carried a big part of the first film, so his return would have put Caddyshack 2 over the top.  Jackie Mason  is the `new' Rodney for this movie and does a decent job, even though their comic deliveries are way different.  Dan Aykroyd was great but not in the film enough.  He should have been involved to the tune of how much screen time Bill Murray got in the first one.  Robert Stack (Airplane!) was good in the `new' Ted Knight/Villian role.  (We miss you, Ted!) Danny Noonan should have been back.  So many others could have returned to show us what happened to their characters eight years later.  Bushwood should not have undergone the total makeover it did.  Instead, the characters involved, rather than the club itself, should have been the main focus like they were in the first one. When you watch this film, keep in mind that it isn't a major sequel and you may think it's another good or bad eighties comedy.  Fans of the first should see it but don't be shocked when the comparisons between the original and Part II are so far apart.",
            "review_date": "2004-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unexceptional sequel, but cute.",
            "content": "Very few sequels are up to par (excuse the pun) with their predecessors, and this is no great exception.  It's far-fetched, and out there, but seeing the underdog come out on top of a bunch of snobby, rich, perpetual yuppies is kinda fun.  Chevy Chase's character is an amusing distraction as well.",
            "review_date": "1998-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Who's Reviewing This?",
            "content": "Anybody who gives this a 1 should slap themselves. The original is not only a Classic, but also an all time movie. No sequel lacking the original cast could duplicate what the original accomplished, so they didn't bother to try. Caddyshack 2 sets out to be a semi slapstick comedy, and it succeeds completely. The jokes are stupid, and that's the point. It isn't a low budget movie that's just bad, it's a full fledged Hollywood production that tells goofy jokes from start to finish. It pulls off good guy vs bad guy perfectly. It didn't try to be part 1 so only blame yourself if you are mad that it isn't.",
            "review_date": "2019-10-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you don't compare it to Caddyshack I, you'll be okay.",
            "content": "Alright, so Caddyshack I was better in all respects. Perhaps I didn't seem to hate Caddyshack II as much as everyone else because I wasn't expecting all that much and I wasn't comparing it to the original. But please, it is not that bad. I see other people on here giving it a one or a two, and that's uncalled for. There are far worse movies out there, and Caddyshack II has a couple of funny moments, (especially those with Dan Aykroyd). True, the storyline is weak, and Jackie Mason, (although funny), is no match for Rodney, this movie does not deserve all of the criticism it gets. It's still mildly amusing. However, I will agree with others on these following aspects: Randy Quaid was terrible and incredibly annoying in his role, the story with Hartonian's daughter added a sappiness to the story that was so trite and predictable, the carnival idea was definitely not funny, Chevy Chases cameo seemed desperate and detached, and it was too long. At least Aykroyd was funny, and was maybe, dare I say it... as funny as Bill Murray. Thats right, I know it sound like blasphemy to Caddyshack I fans, but when he said \" I read you loud and clear Mrs. Esterhouse\" I almost fell of my chair. That was funny. The rest of the movie... not so much. Just don't knock it until you try it, but don't expect a homerun, or in this case a hole in one.",
            "review_date": "2009-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "biggest waste of my time since disaster movie",
            "content": "the other day a friend asked me about \"Caddyshack II\" he asked if it had Rodney Dangerfield and Bill Murray, i said nope, he said why make it without them? thats the question everyone has about this movie, WHY? why no Rodney? why no Bill? why no Harold Ramis? thats right Harold Ramis didn't direct this one, left it to Alan Arkush, the man who used to make trailers for Roger Corman movies as well as \"Rock & Roll High School\". in this film Jack Hartounian (Jackie Mason) and his daughter join Bushwood CC, and the club Owner Chandler Young (Robert Stack) hates him, so Jack buys Bushwood from Ty Webb (Chevy Chase, the ONLY actor from the 1st film). instead of Bill's Carl Spackler, we get Dan Aykroyds annoying Tom Everett, who shoots himself in the @$$ with a poison tip crossbow. The Gopher is, for some reason, able to talk (voiced by Frank Welker) and Chevy is reduced down to a cameo. this movie needed Harold Ramis directing, Rodneys one-liners, Bill Murray hunting gophers and most of all it needed to be funny.",
            "review_date": "2010-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Far removed from the original on many levels",
            "content": "Caddy Shack II pretty much bombed for many of the reasons already mentioned by those here who already panned it. And I agree that it's essentially the story, not the actor's fault as the cast comprises of good actors, but this was not enough to save it. Those who opted out of doing the sequel like Rodney Dangerfield and Bill Murray chose wisely and avoided this cinematic flop. If it wasn't for Chevy Chase reprising his role as Ty Webb, this movie would have ZERO connection to the original, but despite this, Caddy Shack II is still faaaaar removed from the original.The fist major flaw, which totally threw the movie for me is the congruence - it's painfully obvious that Bushwood Country Club is in a entirely different locale than the first movie. It is my understanding that the first Caddy Shack was filmed at a country club in Florida, and the entrance gates of the club shot on Sunset Blvd - so would it have been that complicated to at least send a second unit film crew to the original locations to at least capture various footage to use in Caddy Shack 2? And while you all are at it, get some shots of Ty Webb's Zen pad, as he never lived in a castle on a mountain. Seriously. Both the club locale and where Ty Webb lived ruined it. And the only reason I stuck it out watching is for Ty, who was quite the ladies man in the first Caddy Shack, but totally came across like a creep to women in II.But in final - Caddy Shack II story line was literally a re-hash of the first version; country club vs.. Real estate developer. WTF? I could continue my rant of other things gone horribly wrong about Caddy Shack II - but I think the other contributors at IMDb.com have it covered.",
            "review_date": "2017-11-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"CaddyCrap\" should be the title of this movie",
            "content": "caddyshack II does NO justice for the caddysack.  thin plot, thin actors(exception of randy quaid).  the ONLY thing that is decent with this movie is the soundtrack..maybe.  this movie should have been destroyed when the script was written.",
            "review_date": "2001-06-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a worthy sequel but there's a few good laughs",
            "content": "I wouldn't recommend this movie to anyone but die-hard Caddyshack fans. Only they would probably get some fun out of seeing The Bushwood Country club back. The movie is slow paced and not all that funny, but Chevy Chase's scenes are hilarious. Ty Webb is one of Chase's best characters. The laid-back absent minded golf expert who dosen't even keep score when he plays golf, definitely makes this movie worth watching.",
            "review_date": "1999-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You can see Chevy die a little each time he speaks",
            "content": "Hampered by a PG rating and rarely landing with its funny bits, this movie has a reputation for being one of the worst sequels of all time. While not the worst film ever made, it's not really worth watching if you enjoyed the first. There are some funny moments to be found in the film for those that persevere, but nowadays you could simply find the clips on YouTube.It still holds that 80s soundtrack charm at least, thanks to Kenny Loggins.",
            "review_date": "2021-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "not gonna do for me what Caddyshack did",
            "content": "Caddyshack II is an inferior sequel to Caddyshack I, no matter which constituent of the film is examined. Caddyshack II uses the same script and character basis as Part I, thus not expanding on a story but rather making a sorry attempt at recapturing the laughs and good feelings that the original generates. Jackie Mason, starring as Jack Hartounian, makes a pitiful attempt at retracing the steps of Rodney Dangerfield, who played a very similar role in the original as a havoc-raising real estate owner. Jackie not only fails to par up with Rodney's performance, but degenerates the film even more when he inserts his own style of humor into the sequel. His lack of energy, perhaps a result of age, kills any power that the other characters may have been trying to produce. Caddyshack II is flashy and fake, while the original Caddyshack seems to express realistic emotion. What am I referring to? Take for example the improvisational comedy scene between Bill Murray and Chevy Chase in the original. Their chemistry is that of long time friends, thus their stage time really shines. Chevy and Bill, or Ty Webb and Carl Spackler, work well with one another while the sequel's characters' relationships' lack the flare that makes the dialogue and scenes come alive. Caddyshack II is like an animated Disney film. it greatly represents the film fashions of the 1980s, and since Caddyshack was made in early 1980, We can safely declare that the film may have been preserved from a Hollywood style that may have done more damage than benefit.",
            "review_date": "2002-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "LOL, the funniest 01 hour: and 38 minutes ever!!!!!!!!!!!!!!",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After years of searching I've finally found the worst movie ever made. Bad movies come in different flavors; some are bad because the film makers were inept, some are bad but good because the film makers were completely clueless but sincere. Some can be entertaining as something to mock. Some are amusing by the sheer \"brilliance\" of the movie makers utter failure. Some are bad because they're ill conceived, poorly paced and ultimately boring. This isn't one of those. This is an insult to film. This is a bald faced cash grab with no vision, no originality and no entertainment value. There's nothing funny about it. There's nothing even amusing about it. If it were shown to prisoners it would be considered cruel and unusual punishment. It's actually painful to watch, painful in how every bad joke falls flat, painful in the waste of talent and painful that some studio exec had so little regard for their fellow human beings they would release this thinking people would like it. This is the stupidest movie ever greenlit by greedy execs. It's so bad I can't mock it. It's so bad I can't watch it because it makes me angry. It's absolutely horrible.",
            "review_date": "2022-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The remnants of Caddyshack is stripped down and replaced with a discount Dangerfield as the protagonist. Aimless direction and even less consistent in quality than the original. Caddyshack 2 is the perfect example of a cash-in sequel.",
            "review_date": "2022-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as bad as the ratings say. It's not even close to the original, but there are some funny moments in the film. 5/10 for me. First caddy shack is 9/10",
            "review_date": "2022-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It seems almost impossible that one of the best and funniest adult comedies of all time could be so badly decimated as Caddyshack 2 does to its predecessor.   The witty, well scripted, and well played comedy of the classic does not exist in this knock off.  It is horrible.   The talents of otherwise talent people are wasted, or even ruined.  Even Chevy Chase, who shines in the original is not funny at all in this one.  Jackie Mason sitting in as a Rodney Dangerfield type and Robert Stack playing the Ted Knightesq. character are simply not good.   The attempt to reveal issues of class warfare fail to reach the levels of the first.   The attempts to elevate the Gopher from a tool to showcase Bill Murray's talents to a primary character is infantile.  Dan Akroyd's attempt to be Bull Murray is painful to watch. What is good about this one?  Ok. Here is something positive.  Dyan Cannon is always delightful to watch.   A young Jonathan Silverman as the Danny Noonan type is watchable.  Jessica Lundy is very appealing as Mason's daughter.  Marsha Warfield has a few laughs.  Skip this one.",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took eight years for a sequel to Caddyshack to get made, perhaps the greatest \"hijinks ensue\" movie ever made. I say that phrase because it's such a simple concept: a quick statement like \"A day in the life of a golf course...and hijinks ensue.\"\n\nThe beauty of the original film is that despite the out there characters like Chevy Chase's Ty Webb and Rodney Dangerfield's Al Czervik, the story is really about the struggles of Danny Noonan (Michael O'Keefe), a working-class kid forced to follow the whims of the incredibly rich in the hopes that he can work toward a better life. It also comes from actual life, as writer Brian Doyle-Murray, his brothers Bill and John, too -- was a caddie at Indian Hill Club in Winnetka, Illinois. His brothers Bill and John Murray, and director Harold Ramis had all been in Danny's caddy shoes at one point. Most of the people in the movie were all based on actual members of the clubs that they had worked at.\n\nRamis told the A.V. Club that he went in with the right intentions: \"They said, \"Hey, we've got a great idea: The Shack is Back! And I said, \"No, I don't think so.\" But they said that Rodney really wanted to do it, and we could build it around Rodney. Rodney said, \"Come on, do it.\" Then the classic argument came up which says that if you don't do it, someone will, and it will be really bad. So I worked on a script with my partner Peter Torokvei, consulting with Rodney all the time. Then Rodney got into a fight with the studio and backed out. We had some success with Back to School, which I produced and wrote, and we were working with the same director, Alan Metter. When Rodney pulled out, I pulled out, and then they fired Alan and got someone else. I got a call from [co-producer] Jon Peters saying, \"Come with us to New York; we're going to see Jackie Mason!\" I said, \"Ooh, don't do this. Why don't we let it die?\" And he said, \"No, it'll be great.\" But I didn't go, and they got other writers to finish it. I tried to take my name off that one, but they said if I took my name off, it would come out in the trades and I would hurt the film.\"\n\nThis moment of wondering why this movie is being made and feeling is that it's the wrong idea? That will come up throughout the discussion of this movie.\n\nSo instead of Rodney, we get Jackie Mason. Sure, they're both older Jewish comedians who married much younger women late in their lives, but that's about all they have in common. Rodney's character was an everyman who seemed to be using the audience as his therapist, bemoaning the way he was treated with lines like \"I know I'm ugly. I said to a bartender, \"Make me a zombie.' He told me that God beat him to it.\" To me, Mason always felt like he was lecturing the audience, somewhat above it*.\n\nDan Aykroyd is one of my favorite actors, but he's basically coming on to be Bill Murray. And while Jonathan Silverman and Michael O'Keefe are somewhat interchangeable, there's a large divide between Robert Stack and Ted Knight. And that's no slight to any of these actors, but when you're placed in the same exact role as a movie that is beloved, you're going to get compared. After all, Ted Knight is my favorite villain in any movie. He's perfect in his role. And while I love Robert Stack, I can only see him in heroic roles or parts that make fun of his heroic nature.\n\nI mean, I love Randy Quaid, but his role was written for Sam Kinison, who would have destroyed audiences with that part.\n\nTo be fair, Dangerfield was to be in this, but a month before production, he bailed, realizing that it wouldn't work. He kept adding to his contract, demanding final cut and royalties and getting everything he wanted, except to be released from the film. This all ended up with him facing a $10 million dollar lawsuit.\n\nBut there still needed to be a movie.\n\nAs for director Allan Arkush, he told Sports Illustrated \"I should have never made this movie! What was I thinking?\" He told us -- in an interview we were honored to get to conduct -- \"You should never make a movie for the wrong reasons. You should only make movies about something where you know no one else can make it better than you.\"\n\nSo what's it all about, you may ask.\n\nKate Hartounian (Jessica Lundy, who was in Bright Lights, Big City and Vampire's Kiss the same year this was released), the daughter of real estate developer and working man Jack (Mason), seeks to improve her social status by following the advice of her friend Miffy Young (Chynna Phillips) and asks her dad to join the Bushwood Country Club.\n\nOf course, seeing as how her dad builds housing that normal people can afford, he doesn't fit in with club members like Chandler Young (Stack), his wife Cynthia (Dina Merrill, Operation Petticoat) and Mr. Jamison (an always welcome Paul Bartel).\n\nSure, hijinks ensue, but it's hard to get behind the blustering Mason, who strangely attracts Diane Cannon, making this into something of a science fiction movie. The gopher can now talk (someone get Frank Welker in the booth stat!) and Chevy Chase shows up for all of five minutes, most of which consists of him being a sexist boor to scare off multiple women in a scene that may have seemed funny in 1988 but seems beyond gross in 2021 (I know, I know -- let's not place our modern values on movies from the past; I'm also the guy who brings you all sorts of aberrant Italian and Spanish gut-churning filth, right?!? But maybe I just agree with the \"medium talent\" assessment of Chase).\n\nThe hardest thing to deal with in this movie that it's made by incredibly talented people placed into a thankless struggle to make something halfway decent. I mean, Harold Ramis and PJ Torokvei (who wrote Armed and Dangerous, Back to School, WKRP in Cincinnati and Real Genius) wrote the script with rewrites by Jeffrey Price and Peter Seaman, who wrote Who Framed Roger Rabbit together**.\n\nThe thing that really sticks out to me is that Caddyshack works whether or not you play golf, but if you love the game, you can see the nuances and enjoyment of the sport within the movie. In the sequel, golf just seems to be something in the background, other than the miniature golf course finale that closes the movie.\n\nI guess you should add the phrase, \"Don't remake Caddyshack\" to other important lessons like \"Never fight a land war in Asia\" and \"Never go against a Sicilian when death is on the line.\"\n\nIn our aforementioned chat with the director, this movie was summed up quite simply:\n\nB&S: So why Caddyshack II?\n\nALLAN: Yes, exactly. Why Caddyshack II? There are no more questions to be answered.\n\n*Indeed, Arkush said --after seeing Mason perform two nights in a row -- \"I started to get a very different impression of him. The thing that occurred to me was that he didn't connect with the audience in any sort of personal way. That's not necessarily a good thing for someone who's supposed to be your lead. At least when Rodney says, \"I get no respect,\" there's an empathy that he evokes from the audience.\"\n\n**To be fair, they also wrote Wild Wild West and How the Grinch Stole Christmas, so perhaps...",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can really see Chevy Chase die a little each time he speaks. \n\nHampered by a PG rating and rarely landing with its funny bits, this movie has a reputation for being one of the worst sequels of all time. While not the worst film ever made, it's not really worth watching if you enjoyed the first. There are some funny moments to be found in the film for those that persevere, but nowadays you could simply find the clips on YouTube.\n\nIt still holds that 80s soundtrack charm at least, thanks to Kenny Loggins.",
            "review_date": "2021-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than most ratings indicate, though Chase, Aykroyd and the chipmunk all did poorly.",
            "review_date": "2021-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed the first 30 minutes of \"Caddyshack II\".  There were a lot of fun comedic bits and it even has a good message; however, the rest of the movie kind of drags.  Not unwatchably bad, just not that great.  As a PG movie, I'd recommend this if you have a young kid around and you are looking for something to watch together.  I think this movie gets a worse rep than it deserves because it is not the same kind of movie as the original \"Caddyshack\".  The sequal is more about delivering a positive message that is geared at kids, rather than being the raunchy R rated comedy of the first one.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out.",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a great film, comedy mid-steps throughout, but also some that work well like seeing snooty Robert Stack hauling cement and Jacky’s Wacky Golf has its moments. I think people resent the characters played by Jackie Mason and Dan Ackroyd as being not as good carbon copies of Dangerfield and Bill Murray, but they both contribute laughs and even some quotable moments, “Mrs Esterhaus, I presume?”. Even the soundtrack is smack dab in the middle of okay with some new Kenny Loggins power pop songs. So, not as bad as the 4% reputation it gets, more like 44%.",
            "review_date": "2021-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely unwatchable.",
            "review_date": "2020-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A horrible sequel that failed to have the spirit and wit and even humor that made the original \"Caddyshack\" a gem.",
            "review_date": "2020-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Take all the fun and laughter out of Caddyshack. This is the carcass.",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did they make this it's just terrible. No person should, for any reason watch this ever.",
            "review_date": "2020-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny here and there but not as good as the first.",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s not that bad. Not great — but not that bad.",
            "review_date": "2019-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "C'mon folks, try to remember all the happy times you had watching this flick. When that horse jumps over the guy from Unsolved Mysteries and farts on him, I laugh every time. Classic. Second favorite movie right behind Attack of the Clones!",
            "review_date": "2019-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first movie is an absolute classic and while this got a few laughs out of me it is just not as funny as the original. Jackie Mason does a funny performance but nowhere near as funny as Rodney Dangerfield. Dan Aykroyd tries way too hard in his performance and takes it over the top while Bill Murray took the performance where he wanted it and didn't have to try hard to get laughs. Chevy Chase was funny in this movie but looked like he did not want to be there kind of like when he was The Chevy Chase Show. Randy Quaid got the most laughs out of me and in my opinion stole the show a lot like how he stole the show as Cousin Eddie in the National Lampoon's Vacation films especially in Christmas Vacation and Vegas Vacation.",
            "review_date": "2019-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I literally just watched this movie not five minutes ago and thought that it was so bad I needed to write a review.  While I love all of the actors in this movie the writers just ruined the whole thing.  They made Ty Webb a sad man who I honest to God felt pity for.  They tried to recreate Al Czervik and failed miserably.  They made Bushwood into a cheesy amusement park, and the whole movie had enough dangling plot threads to make a sweater. Through the whole movie I found myself rooting for the rich people.  All in all they lost what made the first caddyshack great.",
            "review_date": "2018-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know we all would definitely agree it has been a longtime since we've seen the movie Caddyshack are we ever going to see the movie Caddyshack come back are Bill Murray",
            "review_date": "2018-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original but I still enjoyed it.",
            "review_date": "2018-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute disgrace. I only ask, why?",
            "review_date": "2018-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Essentially, the same plot as the original. Not good by any means, but there are laughs to be found.",
            "review_date": "2017-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The aspects of the film I liked were: Jackie Mason, the gopher, the soundtrack, and the shenanigans. Not as good as the first film was.. If the had gone to an R rating, it would of been more fun to watch.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No Murray. No Knight. No Dangerfield. No good.",
            "review_date": "2016-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have the stones to admit I like it. It is stupid as can be but the nostalgia of seeing a pre-crazy Randy Quaid trading acting chops Robert Stack in all his wooden glory, while Jacky Mason tosses in  jokes that were dusty 30 years ago makes me smile.",
            "review_date": "2016-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not so much this is 1 of those disappointing now where near the first pic sequel",
            "review_date": "2015-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hadn't watched this since I was a kid, and really wish I hadn't re-watched it.  The film is just so bad.  Jackie Mason can't act and shouldn't have starred in this.  The script is awful, and Chevy Chase seems bored out of his mind.  No laughs.  Just avoid this!",
            "review_date": "2015-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whoever is out there who wants to make a movie do not make a movie that you want to turn into a series.",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious even though distinctly separate from the league of the original.",
            "review_date": "2015-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A favourite as a kid.  There are moments that are funny but the whole thing is pretty flat and having Jackie Mason in the lead was a bad idea.",
            "review_date": "2015-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't conceive of something this abominable if I tried.",
            "review_date": "2015-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic......they dumped all over a classic with this witless sequel.",
            "review_date": "2015-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "no, just trashy trash this movie is, no stars -5 stars",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pitch meeting at Warner Brothers in 1987. \"So here it is. 'Caddyshack II!' And not the number 2, mind you, but the Roman numeral II. We replace Chevy Chase, Bill Murray, Rodney Dangerfield and Ted Knight with Dyan Cannon, who hasn't worked since 1977, Jackie Mason, who hasn't been funny since Sullivan in 1959, Robert Stack, who isn't cognizant of his surroundings, and, best of all, Jonathan Silverman. THE Jonathan Silverman, star of 'Girls Just Want to Have Fun,' the major motion picture based on a 2-minute-56-second Cyndi Lauper song that doesn't even feature Cyndi Lauper singing the song. And, to direct, we get Allan Arkush, the guy who directed the Andy Kaufman-Bernadette Peters robot love story 'Heartbeeps.' And this is key, instead of an R rating like the original, we keep things to a PG. Not a PG-13! A PG. How can we go wrong?!\"",
            "review_date": "2014-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Caddy shack II does NO justice for the Caddy sack. thin plot, thin actors(exception of Randy Quaid). the ONLY thing that is decent with this movie is the soundtrack..maybe. this movie should have been destroyed when the script was written.",
            "review_date": "2014-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The star-studded cast are powerless to inject humor into this lethargic, unoriginal pacified sequel.",
            "review_date": "2014-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why was this abomination of a movie made. I can never watch the original caddyshack again causes of this garbage.",
            "review_date": "2014-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jackie Mason tried to save this, but truthfully, this movie is a tremendous flop. The original is pretty bawdy, but so much better.",
            "review_date": "2014-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though the lead is likable, nothing else comes anything close to what made the original Caddyshack so good.",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Na, na, na, na...\"  The wacky adventures at Bushwood Country Club continue in Caddyshack II.  Harold Ramis delivers yet another weak script that focuses heavily on class warfare.  This time the owner of a construction company tries to join the Bushwood Country Club in order please his daughter, but he proves to be more blue-collar than they care for.  Featuring Jackie Mason, Robert Stack, Dan Aykroyd, and Chevy Chase, the cast isn't that bad.  But the performances are terrible; Mason in particular is out of control and toxic to the film.  While screwball comedies tend to be pretty zany, Caddyshack II is overloaded with craziness; making it incredibly stupid.",
            "review_date": "2014-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So-so sequel should be PG-13. Ages 12+",
            "review_date": "2014-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8 years later, and it did take a lot of trying, but Warner Bros. were determined to make a sequel to Caddyshack, this time enlisting Allan Arkush (Rock 'n' Roll High School (1979) and Heartbeeps (1981)), to direct the film, with Harold Ramis returning to write the film, but most of his work was heavily re-written. Plus, the film is essentially a retread of the first film, although with a different cast. Set at Bushwood Country Club, local Jewish businessman Jack Hartounian (Jackie Mason) and his daughter Kate (Jessica Lundy), apply for membership at the club, but Jack's reputation of building low-cost housing for poorer families doesn't go down well with the snooty members, including Bushwood President Chandler Young (Robert Stack). But, Jack gets the last laugh when he goes to Ty Young (Chevy Chase), and buys his majority share in Bushwood, and decides to open it up to general public turning it into an amusement park, much to Young's absolute disgust, so he hires Captain Tom Everett (Dan Aykroyd) to put a stop to it. While there are one or two laughs here, it's just the same as the original, with Chase doing little more than an extended cameo, it smack of studio compromise and cynical cash-in. They did try to get much of the original cast back, but they were all disgusted by the quality of the script, and it is all over the place.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My Favorite Comedy Film Is 1933's Duck Soup.",
            "review_date": "2014-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is one of the worst movies ever made. don't watch it because you can't un see it.",
            "review_date": "2014-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before seeing Caddyshack II I had never seen Caddyshack, and considering how many Golden Raspberry Awards Caddyshack II was nominated for it would clearly have to be poor material. But I figured watching it before Caddyshackwould make it of slightly lesser poor quality.\n\nCaddyshack II doesn't have enough golf for a sports comedy, or enough laughs for a good comedy, so it's a failure as a sports film and as a comedy film. To put it simply, Caddyshack II is a failure and I'm certain it worst quality is that it bears the name Caddyshack in its title when its predecessor is such a critically acclaimed comedy classic.\nThe concepts in Caddyshack II are clearly unoriginal and dull, and the entire film is laugh free. The script and storyline are uncreative and there is nothing new that it brings to the table like the first Caddyshack did. All it supplies is lame actors at their career low points trying to capture the dying spirit from the comedy classic Caddyshack but failing abysmally most of the time.\nAnd the production team were clearly a bunch of gophers, because whoever they hired as the voice actor for the horses needs to get a different career pattern, because it was so unconvincing, pathetic and unfunny that it just brought down Caddyshack II's already low credibility. If it was Frank Welker then I blame the director, because bad voice acting can never be his fault.\nCaddyshack II suffers as a terrible and unfunny flim as well as being a bad sequel that suffers from all the issues that a bad sequel usually does, including the lack of fresh material that its predecessor supplied and a cast which fails to match the ensemble set up by Caddyshack, as well as characters that aren't interesting or worth paying focus to. Alan Arkush's inexperienced direction is no better here than it was in Deathsport, except that this time he is working with talent which he and his terrible movie manages to drag down, and his terrible direction is a serious cause of the blame here. But then again, so is Dan Akroyd's performance.\nDan Akroyd, well, whoever the hell told him to give an abysmal performance like that has suffered serious brain damage. If it was his idea, then clearly Dan Akroyd's comedic spirit must be in spirit prison. His voice itself is more ridiculous than the aforementioned terrible horse voice, and it gets very annoying to listen to very fast. It isn't funny, its Golden Raspberry Award material. Luckily they realised that and awarded him the Worst Supporting Actor award, and hopefully that would help the filmmakers distinguish between good comedy and utter stupidity.\nThe only real good qualities of Caddyshack II are that the puppetry of the gopher and the silly dynamics that he goes through are both decent, and the presence of Chevy Chase again is genial because he gives a decent performance. Caddyshack II is also shot well on some good locations and features fine cinematography to back it up.\n\nBut really, nobody could have thought that Caddyshack II was a good idea, yet it didn't stop the money grubbing producers who must have learned their lesson from this Golden Raspberry Award winning box office bomb.",
            "review_date": "2013-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why even bother without the original cast, or an R-rating?",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just another failed sequal attempt on recreating the humor of the first film.\nAnd Dan Aykroyds attempt to mimic Bill Murray's character was just plain out shameful.",
            "review_date": "2013-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More family friendly outing. Much wackier. Ray Stanz is also not as funny as Peter Venkman.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I died a little inside as I watched this movie.",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is it with comedy sequels always being awful!?",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movies like this are the reason why people don't trust sequels.",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen half of the first one and this has no similarities!? Aykroid and Chase are hardly in it!",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the first, with Mason really stealing the show. Stack is great as the villian.",
            "review_date": "2012-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although not a complete disaster, this sequel should have been shelved the minute Rodney Dangerfield backed out instead of replacing him with Jackie Mason.",
            "review_date": "2012-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not that good really, but if you watch this movie in the right mood then it still has some good laughs. Chase and Randy Quaid have some good moments but it's Dan Aykroyd that steals the movie, not as funny as Bill Murray in the first movie but still very funny.",
            "review_date": "2012-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "try watching this without killing yourself.",
            "review_date": "2012-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A scene-stealing gofer, a funny Jackie Mason, and a great contribution from Chevy Chase are the highlights of this ho-hum sequel; the gags are too sporadic and Dan Aykroyd delivers the most annoying and off-putting performance of his career.",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unbelieveable,.. A movie called \"CaddyShack II\" with nary a Caddy or Shack to be found in the whole fucking movie. What a piece of Shit!!!",
            "review_date": "2012-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst sequels of all time",
            "review_date": "2012-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pathetic excuse for a sequel",
            "review_date": "2012-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not as good as the first one...",
            "review_date": "2012-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as prolific and star-studded as the original, but still a fun movie.",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What were Dan Ackroyd, Chevy Chase, and Randy Quaid doing in this film? I can only assume it was a favour to someone, and probably one they regretted. The rest of the cast were very weak, as was the comedy, without the famous three mentioned above, I'm not sure there would be any comedy at all actually. Jackie Mason, the main character, is incredibly annoying, and as a sequel, there are too many similarities wtih the first film for it to earn any credibility of it's own.",
            "review_date": "2012-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first...Still, classic!",
            "review_date": "2012-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This sucked. Terrible movie.",
            "review_date": "2012-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This never never should have been made.",
            "review_date": "2012-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The rest of the original 'Caddyshack' may not be present in this comedy sequel, but at least Chevy Chase can still golf below par. At below average quality, I don't find any jokes funny here.",
            "review_date": "2012-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I really enjoyed the first 30 minutes of “Caddyshack II”.  There were a lot of fun comedic bits and it even has a good message; however, the rest of the movie kind of drags.  Not unwatchably bad, just not that great.  As a PG movie, I'dI really enjoyed the first 30 minutes of “Caddyshack II”.  There were a lot of fun comedic bits and it even has a good message; however, the rest of the movie kind of drags.  Not unwatchably bad, just not that great.  As a PG movie, I'd recommend this if you have a young kid around and you are looking for something to watch together.  I think this movie gets a worse rep than it deserves because it is not the same kind of movie as the original “Caddyshack”.  The sequal is more about delivering a positive message that is geared at kids, rather than being the raunchy R rated comedy of the first one.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out.",
            "review_date": "2021-08-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Garish costumes, lame wisecracks, a substandard replacement for Rodney Dangerfield, all make for a ludicrous example of 1980s comedy.  What a pathetic sequel to a great comedy.",
            "review_date": "2020-06-05",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "rt_rating": 1.7,
    "rt_summary": "Jack Hartounian (Jackie Mason), a boorish but good-hearted real estate tycoon, applies for membership at a snooty country club, but is blackballed by the old-money WASPs, led by Chandler Young (Robert Stack). As revenge, he simply buys the club outright and turns it into a garish amusement park. Chandler wants to win the property back by challenging Jack to a golf match, but he hedges his bets by hiring deranged mercenary Tom Everett (Dan Aykroyd) to eliminate his competition.",
    "meta_rating": 6.4,
    "meta_summary": "When a crass new-money tycoon's membership application is turned down at a snooty country club, he retaliates by buying the club and turning it into a tacky amusement park.",
    "vibes": [
        "bland",
        "cult",
        "passable",
        "terrific",
        "extended",
        "snooty",
        "appealing",
        "delightful",
        "infantile",
        "primary",
        "upper",
        "guilty",
        "previous",
        "foul",
        "detached",
        "trite",
        "uncalled",
        "rude",
        "absurd",
        "alone",
        "sacrilegious",
        "undeserved",
        "heroic",
        "deadly",
        "hit",
        "limp",
        "tepid",
        "unfocused",
        "whiny",
        "electric",
        "local",
        "alive",
        "flashy",
        "pitiful",
        "realistic",
        "available",
        "gripping",
        "inventive",
        "male",
        "suspenseful",
        "unsympathetic",
        "wrong",
        "witty",
        "painful",
        "dead",
        "elusive",
        "interested",
        "general",
        "absolute",
        "confused",
        "forward",
        "hurt",
        "lead",
        "lifeless",
        "veteran",
        "nervous",
        "clear",
        "loud"
    ]
}