{
  "title": "Glengarry Glen Ross",
  "rating": 8.1,
  "release_date": "1992-09-29",
  "genre": [
    "Drama"
  ],
  "summary": "A group of real estate salesmen in Chicago compete for the best \"leads\" at a small firm selling property in \"resort\" areas, such as Florida and Arizona. When a hotshot executive from the head office arrives and proposes a vicious sales contest, competition gets stiff, and salesmen who have worked a lifetime for the company find their jobsA group of real estate salesmen in Chicago compete for the best \"leads\" at a small firm selling property in \"resort\" areas, such as Florida and Arizona. When a hotshot executive from the head office arrives and proposes a vicious sales contest, competition gets stiff, and salesmen who have worked a lifetime for the company find their jobs in jeopardy. [Artisan]… Expand",
  "critic_reviews": [
    "Few contemporary writers for the stage, TV and cinema have come close to David Mamet for the quality, quantity and variety of their work. Among its peaks, and characteristic of his highly individual ear for American demotic at its most creatively and colourfully obscene, is Glengarry Glen Ross.",
    "The reason the film prompts laughter, and finally elation, is not because it's jolly or has any feel-good words to live by. It's because of the utterly demonic skill with which these foulmouthed characters carve one another up in futile attempts to stave off disaster.",
    "The pleasure of this unique film comes in watching superb actors dine on Mamet's pungent language like the feast it is.",
    "The movie version, directed with unobtrusive precision by James Foley, stays amazingly true to the play's feisty spirit.",
    "All-expert cast.",
    "A searing indictment of all sorts of American dreams, Glengarry Glen Ross is a welcome if foul-mouthed reminder of just what it takes for a lot of folk to make it through the working day.",
    "The single greatest pleasure of watching this film is seeing great actors reciting Mamet's lines. It's rumored that members of the cast came to the set on days when they weren't scheduled to film so they could watch their fellow stars perform.",
    "It is, in short, a strange and unrepeatable success, driven by its own uniqueness as much as anything else.",
    "Gets most of its legs from the acting and the dialogue, which has such a rhythmic grace that scenes from the movie can be played and replayed with no loss of thump.",
    "Mamet's dialogue has a kind of logic, a cadence, that allows people to arrive in triumph at the ends of sentences we could not possibly have imagined. There is great energy in it. You can see the joy with which these actors get their teeth into these great lines.",
    "Alec Baldwin is on camera for barely eight minutes in Glengarry Glen Ross, the tightly wound — and actually very fine — film adaptation of David Mamet’s play. But his big speech, whipping up the assembled real estate salesmen with reptilian gung ho, could stand as a compressed version of what makes Baldwin, when bad, so good.",
    "David Mamet's play about the wheelings and dealings of real-estate salesmen gets dedicated playing from a splendid cast, but gains nothing by the transfer from stage to screen..",
    "A searing showcase for a remarkable ensemble cast.",
    "All the performances are exceptional.",
    "David Mamet’s harsh, hard-talking drama about shady, desperate real estate salesmen makes for an actors’ showcase with a surprisingly conventional whodunit backdrop in the movie version of Glengarry Glen Ross.",
    "It's blackly comic - though the humour creeps up on you slowly, and you're seldom sure if you should really be laughing.",
    "But it doesn't quite all come together here as it did onstage, and relentless scabrousness, heavy claustrophobia and a vaguely dated feel are among the elements that will keep mainstream audiences away.",
    "Hammers away at the plot so relentlessly that you can feel the nails entering the back of your skull.",
    "There is no evidence of life outside the immediate world of the movie.",
    "Interesting to watch like well-performed gymnastics but it never really connects."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Anybody who voted less than 10 hasn't worked in sales. This gritty performance is absolutely spot on acting. And perhaps one of the best casts ever assembled. I wish they'd made a second one.",
      "review_date": "2009-05-19"
    },
    {
      "review_title": null,
      "content": "My all time favorite movie probably, so excuse me both for being biased AND for not being an expert on movies enough to say anything remotely deep or accurate about it. I honestly don't know what to say, I remember I was amazed by the factMy all time favorite movie probably, so excuse me both for being biased AND for not being an expert on movies enough to say anything remotely deep or accurate about it. I honestly don't know what to say, I remember I was amazed by the fact that despite being a movie relying solely on dialogue I wasn't bored in the slightest, but that's comparative and also from the PoV of a modern hyperactive kid or something, so disregard that: on its own merit, it made me care about most characters, wonder about who was the \"culprit\" at the end, and they were all detailed in their own way. I read aferwards that it was actually an adaptation from a famous play, and after rewatching it, I could totally see the theatrality in it: the characters coming in and out of the scene, the intertwined plots. I really don't know what to say, all the actors were amazing and the story was awesome and it described the grim reality of something as mundane as salesmen, and even managed to slip in some suspence with the final theft thing among all that beautifully crafted dialogue. I liked it very much!",
      "review_date": "2014-06-27"
    },
    {
      "review_title": null,
      "content": "Perfect dialogue and performances meet a tidal wave of drama, hilarity, and intrigue  \"Glengarry Glen Ross\" is an impossibly entertaining piece from David Mamet's repertoire.",
      "review_date": "2013-04-30"
    },
    {
      "review_title": null,
      "content": "Most films rely on pretty visuals and cool sound effects. Not many are talk-heavy like this 90's classic. Glengarry Glen Ross not only pulls in the viewer with it's harsh, realistic feel, but does it only by the characters talking. No oneMost films rely on pretty visuals and cool sound effects. Not many are talk-heavy like this 90's classic. Glengarry Glen Ross not only pulls in the viewer with it's harsh, realistic feel, but does it only by the characters talking. No one ever does anything except talk. That's what makes this film so different. You could literally just listen to the film and you'd still understand it. Also, I should mention that this is the best acting I've ever seen in a movie. All the actors talk like real people, and the fantastic writing goes with the superb acting. As long as you're paying attention to it, Glengarry Glen Ross is sure to please.",
      "review_date": "2014-02-23"
    },
    {
      "review_title": null,
      "content": "A drama school essential for every actor striving to be proficient at their craft. This movie is an inspiration with standout performances from Baldwin and Lemmon.",
      "review_date": "2019-04-22"
    },
    {
      "review_title": null,
      "content": "Classic, great movie that is as good as the play and just as effective. Dialogue and performances are superb. Beyond well written. A pleasure to watch all- around.",
      "review_date": "2005-09-14"
    },
    {
      "review_title": null,
      "content": "I haven't seen this movie in quite a while. If I recall, the acting was some of the best and intense I'd ever seen in a contemporary movie - especially, Jack Lemmon, Ed Harris and Alec Baldwin. But all the acting was great - Arkin, I haven't seen this movie in quite a while. If I recall, the acting was some of the best and intense I'd ever seen in a contemporary movie - especially, Jack Lemmon, Ed Harris and Alec Baldwin. But all the acting was great - Arkin, Pacino, Price, Spacey. Technically, I don't recall much - just the acting. I suppose Foley did a good job with the pacing of the movie - but again, the acting was impressive.",
      "review_date": "2006-03-13"
    },
    {
      "review_title": null,
      "content": "Real estate agency, poor sales, owners send man to motivate them, after a week the two best sellers keep their jobs, rest get fired.Great cast, good fast-paced script, sweary & dramatic.Really well acted (Al Pacino plays himself, Hoo Ha)Real estate agency, poor sales, owners send man to motivate them, after a week the two best sellers keep their jobs, rest get fired.Great cast, good fast-paced script, sweary & dramatic.Really well acted (Al Pacino plays himself, Hoo Ha) but Jack Lemmon steals the show for me as Shell \"The Machine\" Levine.",
      "review_date": "2010-08-24"
    },
    {
      "review_title": null,
      "content": "Gripping, intense, and some of the best acting you will ever see in a movie. Ever actor in it is so great. Love Pacino in it, but Lemmon steals the show.",
      "review_date": "2011-06-08"
    },
    {
      "review_title": null,
      "content": "the entire film took place in a small real este office in one evening and next morning.within this the director superbly crafted the entire cast. all you can see is crucial dialogues everywhere and classic performances...must say glengarrythe entire film took place in a small real este office in one evening and next morning.within this the director superbly crafted the entire cast. all you can see is crucial dialogues everywhere and classic performances...must say glengarry glen ross is a well directed corporate drama",
      "review_date": "2011-09-10"
    },
    {
      "review_title": null,
      "content": "I have to say, I was kind of disappointed. The story didn't seem to go anywhere, it was fairly eventless. That said however, there are some awesome quotes and though the entire film consists of dialogue, it's quite meaningful. I canI have to say, I was kind of disappointed. The story didn't seem to go anywhere, it was fairly eventless. That said however, there are some awesome quotes and though the entire film consists of dialogue, it's quite meaningful. I can appreciate the film, but I don't see why it's so highly rated.",
      "review_date": "2014-04-13"
    },
    {
      "review_title": null,
      "content": "Every character is unlikable from the very beginning and the movie feels somewhat claustrophobic by being in one setting the entire time. Dialogue was decent but boring at times with all nonsense being said.",
      "review_date": "2015-05-14"
    },
    {
      "review_title": null,
      "content": "Undeniably a very good film. Lots of things happening, though you do have to pay attention to pick up on them, but largely, this one is a character study of multiple different characters, which is a very interesting thing to see. This one isUndeniably a very good film. Lots of things happening, though you do have to pay attention to pick up on them, but largely, this one is a character study of multiple different characters, which is a very interesting thing to see. This one is ultimately all about the script and the acting. David Mamet's script is brilliant and rife with brilliant dialogue and near perfect pacing. It feels as if we know every character by the end and everything they all say is pitch perfect. The acting from this star-studded cast of Al Pacino, Jack Lemmon, Alec Baldwin, Ed Harris, Kevin Spacey, Alan Arkin, and Jonathan Pryce, is predictably good. No one expected anything less and they delivered a complete home run. It is rare to see so many good actors sharing the screen together, so it is a real treat when they do. Ultimately, Glengarry Glen Ross closes the deal.",
      "review_date": "2014-11-08"
    },
    {
      "review_title": null,
      "content": "Lights, camera, talk!  Sit back and watch the words fly.  It's not called Mamet speak for nothing.  This is Mamet's best work, and the same could be said about any of the actors.  Pacino got the nom, but Lemmon should have taken home an Oscar!",
      "review_date": "2012-09-26"
    },
    {
      "review_title": null,
      "content": "The acting is natural and the plot is amusing, unpredictable, and pivots not around one individual.",
      "review_date": "2013-02-20"
    },
    {
      "review_title": null,
      "content": "The profane dialogue and direct acting are all at a higher level of acting; a realism that most dramas are lacking. But 'Glengarry Glen Ross' is a short but very well paced and poignant film that examines the high pressure atmosphere theseThe profane dialogue and direct acting are all at a higher level of acting; a realism that most dramas are lacking. But 'Glengarry Glen Ross' is a short but very well paced and poignant film that examines the high pressure atmosphere these salesmen live in. Simple, but well effective.",
      "review_date": "2015-02-13"
    },
    {
      "review_title": null,
      "content": "Glengarry Glen Ross is the type of movie where if you enjoy it once then you will enjoy watching it again. Why? It has excellent dialogue and acting, which do not get used up in one viewing (vs. special effects or plot twists). Jack LemmonGlengarry Glen Ross is the type of movie where if you enjoy it once then you will enjoy watching it again. Why? It has excellent dialogue and acting, which do not get used up in one viewing (vs. special effects or plot twists). Jack Lemmon gives a stand-out performance, great characterization and reactions. This is a film you will want to view since it may become one of your all-time favorites.",
      "review_date": "2015-10-01"
    },
    {
      "review_title": null,
      "content": "Heated words fly for one hundred minutes as the pressure mounts and no one escapes the firing line. Sharp witty dialogue grabs the plot by the scruff of the neck and pulls it through with class. Pacino and Lemmon live up to their charactersHeated words fly for one hundred minutes as the pressure mounts and no one escapes the firing line. Sharp witty dialogue grabs the plot by the scruff of the neck and pulls it through with class. Pacino and Lemmon live up to their characters sentiment showing how it was done in the good old days. A classic.",
      "review_date": "2017-02-01"
    },
    {
      "review_title": null,
      "content": "This movie, if you're of the type to be pulled in by dialogue, mood, and good old fashioned Quality Acting, is simply Flat Out Amazing!!! I've watched it, LITERALLY, dozens and dozens of times, into the triple digit mark. For nearly 6 months,This movie, if you're of the type to be pulled in by dialogue, mood, and good old fashioned Quality Acting, is simply Flat Out Amazing!!! I've watched it, LITERALLY, dozens and dozens of times, into the triple digit mark. For nearly 6 months, my business partner and I, when prepping for a catering gig at the house, would put this on for both motivation, background \"music\", and plain old entertainment... That was 3-5 nights a week!!! And this was after we'd already SEEN IT together a dozen times! You deserve to be taken and shaken by this film; and then, Watch It Again... And LEARN THE LINES!!!",
      "review_date": "2018-01-10"
    },
    {
      "review_title": null,
      "content": "the movie at the beginning was so interesting but in the end, I was disappointed I didn't like the plot at all",
      "review_date": "2020-01-11"
    },
    {
      "review_title": null,
      "content": "A movie that's all about wit and sharp dialogue. Just what you'd expect from a Mamet adaption.The performances from all the cast are first rate.",
      "review_date": "2021-01-21"
    }
  ],
  "num_reviews": 41
}