{
    "title": "Yi Yi: A One and a Two...",
    "rating": 0.0,
    "release_date": "2000-12-16",
    "num_reviews": 208,
    "genres": [
        "Drama",
        "Romance",
        "Music"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "utterly compelling",
            "content": "Admittedly, I was a little skeptical that this long and fairly slow-moving movie would be able to hold my attention throughout its 173 minute running time - how wrong I was to be skeptical! Yi Yi is a thoroughly captivating film that I enjoyed immensely, and I completely enjoyed every moment of it. The director's technique of filming a lot through windows and at wide angles gives it an almost voyeuristic feel, but this doesn't alienate the viewer, instead it gives the feeling you're watching real lives unfold, a kind of privileged 'fly on the wall' style, and the 'slice-of-life' term often used to describe Yi Yi is appropriate. The film manages to balance humor, sensitivity, and emotion. It's beautifully shot, sensitively directed, and incredibly well acted by all involved. It sounds like a cliche to say it, but it is one of those movies that has everything: cute kids, family dysfunction, reminisces of decisions made in the past, regret, love, hope, and beauty. It's an uplifting piece of filmmaking but also tinged with sadness, very human, and utterly absorbing.",
            "review_date": "2003-01-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a \"foreign\" film; but a universal one",
            "content": "The family may (or may) not speak another language than you do, and they may or may not have a different color skin, but this family is the 21st family complete with the joy of a young child throwing water balloons off of buildings; a loving husband who loves his wife enough not to cheat on her with an old flame, yet wonders what might have been; a wife lost in depression and lack of purpose, a grandmother's death, a wedding, and a mall with a food court with lonely teenagers trying to connect, two of which do, and yet don't. There is something in this film I can describe only with one word: humanism. No, I can't relate every actors name, but when I saw this film years ago, and I was stressed out, I went to a theater in another to see it, and after the three hours -- which flies by like a summer breeze -- I saw real people both on the screen and in the theater. It's a relaxing, human film, well worth the time to rent or screen for another time.Sadly, the director of this film left this life too prematurely, but he and everyone associated with this film left us a real family and the joy of being human, despite all our faults, and all of life's cruelties, in a film set in a corporate world with lots of reflecting, cold windows (one of the recurring images of the films) and loneliness, but this world also a real family that has love and hope in it.",
            "review_date": "2009-03-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Such universal human interactions you'll rarely see so honestly...",
            "content": "Yi Yi (2000)Losing director Edward Lang recently (he died in 2007) was hard on the film world in general, as well as on Chinese language films with an international reach. And \"Yi Yi\" is a great, offbeat and yet accessible, likable film. What happens is very simple--an extended family is portrayed over several months as they enter relationships and life takes its usual tragic-comic toll. In a way, nothing in particular happens. There is no grand focus to the film in the usual sense (a murder, a love affair, a business deal gone wrong) but instead all of these things happen and overlap.Some viewers will surely find it too dull and slow to withstand, but most viewers (the majority) once you give it a chance, will find the humanity bracing, the honesty of the acting and the writing (also by Lang) alive and well. It is filmed with straight forward storytelling expertise, but it is paced and edited with a higher order of intelligence. The sequence of disparate events, as young and old people fall in love and have close calls with death, is meshed together with intuitive brilliance.It might somehow not be a great film. It might lack the larger turning point drama to make it stand out and make a viewer stand up. But it's a quiet, almost magical film with terrific acting. Maybe the largest thing I took away from it is how universal people's activities are. True, this is Taiwan and not mainland China, so things are more Westernized, but we can identify with everything so acutely it's quite amazing. A gem of a film, too long, but still a gem.",
            "review_date": "2010-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Contemplative and Contemporary",
            "content": "This movie is a beautiful piece of art. Every shot of the movie is like a painting in its own right. Hats off to cinematographer Wei-han Yang for getting so many splendid images on film. From his serene reflective shots against a city nocturnal background, to innovative bird eye-view shots, to neat mirror shots, to the perspective of the bedridden grandmother in a coma, to cars passing by in front of the actors, to gorgeous corporate buildings... everything on camera was meticulously thought out.Director Edward Yang uses this visual candy diligently and incorporates it nicely into his narrative. His script is very poetic and allows for a lot of reflective pause... which is, you've guessed it, supported by silent stunning images. The characters feel very real and their problems and concerns move us. The little boy is simply adorable and his perspective on life is quite refreshing. The dialogue is rich and intelligent and if you listen carefully you'll understand why this movie is so long... But the length does not drag the movie. Rather it allows us to think and to appreciate. There is enough material in this movie (both words and images) to have anyone musing for days if he so desires.The ending of the movie is very well done and you don't really know if you feel like laughing or crying at that point, but you certainly know that you have just witnessed an amazing movie, a movie without proper description. Because like Yang chose to do, I should just be silent and let you enjoy.",
            "review_date": "2001-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Nutshell Review: Yi Yi",
            "content": "I have found another film to put into my all time greatest list, and that is Edward Yang's Yi Yi. After watching all his earlier works, this one marks that epitome of perfection, of a craftsman's finest after honing his skill through time, that most outside of Taiwan will probably remember the great director by, if not for it being easily available on DVD compared to the rest of the early ones. While those are no pushovers themselves, Yi Yi is perhaps something that can be said as complete, covering like most of Edward Yang's films, a spectrum of human emotions, here centered on an upper middle class family and unravelling its close to three hour runtime through three broad narrative threads intertwining together perfectly, with sensitivity, humanity, and poignancy even.Bookended by a wedding and a funeral, Yi Yi follows a family where each member struggles with their own personal demons, with their respective story arc taking place to address just that, and providing that slice of life from their respective perspectives. There's the father NJ (Wu Nien-Jen) who battles two fronts involving work, where his fellow company directors are seeking a new line of business through a partnership with a famed Japanese game maker but with conflicting business ethics and ideology with himself, and that of his personal life, with his family put on a thin line as he spends considerable time away in Tokyo with his first love Sherry (Ko Su-Yun), reminiscing the good old days with that hint of a temptation whether he's about to throw everything away, for one old flame.Then there's the budding first brush of love and a love triangle between his daughter Ting Tin (Kelly Lee), and their neighbour Li Li (Adriene Lin) and her boyfriend Fatty (Yu Pang Chang), where complication arise from being best of friends with Li Li, and yet filled with the dilemmas stemming from the indecision of others, offering a good contrast between two teenage girls who deal with their emotions in vastly different manners, leading to a tragic outcome. Then there's the scene stealer with Jonathan Chang's Yang Yang, the youngest son in the family who's having a horrid time in school, being the thorn in the eye of a female prefect hell bent on making his life miserable. His story arc is perhaps one that brings us back to our own childhood, with nary a care in the world, and living life in quite cavalier terms with various shenanigans, some comical of course, and like most children, live in their own world through the picking up of a hobby, and yet having lessons to impart to adults.There are minor subplots galore in this film, with support characters providing that rich tapestry for Yi Yi, which is also subtitled A One and a Two, strokes in the Chinese language that identical strokes horizontally turns the character One into a Two, sequentially one after another, like a musical beat promising a grand oeuvre to come from Edward Yang the conductor. There's the comatose grandmother whose recuperation of sorts at home brings about some stress to Ting Ting because of her guilt conscious, and that of NJ's wife Min Min (Elaine Jen), who disappears mid way into the film from a depressive breakdown. And Yang Yang's uncle Ah Di (Chen Hsi Sheng) who has to juggle placating his wife Xiao Yan (Xiao Shu Shen) toward the presence of his ex Yun Yun (Zeng Xin Yi) whom he gravitates to given the ups and downs in his financial status.In some ways Yi Yi is a film that puts the spotlight on the various aspects of romance, about the first love who had proved elusive, of past romances and the examination of What Ifs. There's a scene which was expertly and brilliantly edited and intertwined between NJ's arc and his daughter's relationship, hinting at a possible repeat of events that happened one generation earlier, that really hammered home the eventual outcome from a parallel under very uncanny circumstances. This theme may not be new in Edward's repertoire of films, but the way it was handled here just made it very much heartfelt, inevitably allowing us to pass judgement on the characters involved, though in no ways objectively done.It's three hours long, but it's the three hours you will not want to end as you get pulled into the family issues, and find yourself engaged on the emotional level and feel that sense of belonging with the central family, brought to life through wonderful performances all round, from the little Jonathan Chang to the veteran Wu Nien-Jen. Edward Yang's voice cannot be more pronounced through each of the characters put into the film, revisiting themes and issues discussed in earlier films, or in this one, I really liked how he crafted Ota (Issei Ogata) the Japanese game maker, with dialogue that really made plenty of sense, dispensing keen observations and life lessons to impart from the filmmaker.For a film about life and its struggles in general, Yi Yi comes up tops, and I felt it had inspired other similar films that attempted to examine urban family life across a full spectrum of emotions, such as that in Kiyoshi Kurosawa's Tokyo Sonata very recently. Yi Yi is without a doubt one of Edward Yang's greatest and one of my personal favourites to date, and is a film that has to be experienced at least once by any film buff, and be prepared to be emotionally blown away by a filmic masterpiece. A must watch!",
            "review_date": "2011-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "breathtaking",
            "content": "Films like American Beauty give rise to a huge amount of hype, they are hailed as being intelligent and having things to say. The reason that they stand out so much is that in the multiplexes in which they are shown, the cause of their difference to the family comedies and juvenile violence, is by actually having something called 'Character Development'.This would appear to be a foreign issue to the majority of film makes. But luckily for some cinema goers, it is not a foreign area for people like Edward Yang. 'Yi Yi' is an exquisite observation of a family in which all the ages are represented at varying stages of life. From the father struggling to retain his sense of thinking that work is still important, his wife struggling with the illness of her mother. And his children learning in their own ways about what life has to offer, both of which like everyone else in the film are superbly acted.Life rolls through every one of these characters and the annoying stereotypes that to a certain extent ruined American Beauty, for me anyway, are not here. Every character is superbly drawn and fantastically beautiful. For some people no doubt this film would be hell. Three hours of dialogue and a story which purports to show nothing more than life being lived. It is a great example of the art of writing however, that the characters remain with us long after the film has finished.Although the entire cast was terrific one performance, for me, rose above the norm. It was Issey Ogata in the role of the cutting edge games designer Ota. His speech of our fear of newness when surely every day is unique really did take my breath away. It is a superbly shot film but the editing is excellent. So many times there were cross-fertilisation of ideas and story strands. When we could see the same relationship being played out in three very different stages amongst the members of the same family.People may complain that maybe not a lot happens, that people don't really go anywhere and nothing is resolved. To me, however, this is a slice of life. Of all of our lives as we try to make sense not only of those around us but of ourselves. The closest recent film that i have seen to this is 'Magnolia' and while i would certainly recommend that whole-heartedly, there have been very few films that i have felt so accurately portrayed people as being people as 'Yi Yi'. This is a film that reminds me of how good films can be. It also reminds me of how lucky I am to be able to enjoy and appreciate being moved by three hours of skill and effort. Simply breathtaking.",
            "review_date": "2001-05-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "About as good as film can get",
            "content": "This is without a doubt the best film of 2000, a masterpiece of sublety and understatement. It is long--just under three hours--but during that three hours, the entire range of human experience is covered. It is about life--that's it. But, to make a statement about life, you have to illustrate it with lives, and this Yang does exquisitely. There is a tragic undercurrent running through this film, and while I was watching it I thought of Thoreau's observation that \"most men lead lives of quiet desperation.\" Yet, in spite of the travails the film's characters undergo, it is ultimately a work of affirmation. This is about as good as the art of cinema can get.",
            "review_date": "2001-02-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Do You See What I See?",
            "content": "Yang Yang the boy character in the film takes pictures to help those around him see what they cannot, and Yang the director takes pictures to help us see what we usually do not - that every moment of life is beautiful, deep, wonderful, rich.Yang masterfully uses the everyday things of life on a least two levels - the literal and the figurative - beginning with the title of the film, which means literally \"one one\" (in Chinese) or \"individual\", but is presented as a Chinese \"one\" on the screen, followed slowly by another Chinese \"one\" appearing on the screen below it, which then becomes \"two\".  (In Chinese, one is a single line, and two is two singles lines, one above the other.)\nWe are individuals, together.  Our lives involve us, and others.  Our lives involve relationships, get their meanings from relationships.\nRelationships like that of little boy Yang Yang's encounters with girls, violent at first as they poke him from behind (in the back of his head, where he cannot see), and he pops balloons in their faces, scaring them. And then as the electricity builds between them, between Yang Yang and the girl in his school, just as in the nature film in the science lesson presented in the audio-visual classroom, passion as an electrical spark comes to his life.There is Yang Yang's sister Ting Ting in the school of life too, with her ever-present potted plant that cannot seem to bloom.  In class, she is told that overfeeding can cause it not to bloom - and Ting Ting herself tries too hard to bloom, longing for \"music in her life\" as she listens to the concert duet played by a man and a woman while she glances at her date, the boy called \"Fatty\" - he is slim but does he dine too much at life's banquet? (That question is answered later, as violent storms - storms of love, of life - pass overhead, not expected again \"until Thursday\".)  Ting Ting wears white, and could be at her wedding, but she is not.Their dad, NJ, does manage to find the music of his life once again when he encounters Sherry, the flame of his youth.  They take a train back into time they remember as simple and romantic, but the memories of the past veil the complexities that existed then, and now, for the two of them.NJ's wife Ming Ming wishes to escape.  Her work colleague Nancy asks her, \"You're still here?\" to which she replies \"Where can I go?\"\nIndeed, where can we go?  No, we must stay and wake up each day, and try to remember that each day is a first time, that we never live the same day twice, as enchanting Mr. Ota, NJ's potential business partner, reminds him, and us.",
            "review_date": "2003-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Consider Phlebas",
            "content": "\"People adore fences, but Nature doesn't give a hoot. Solitude is a human presumption.\" - Barbara Kingslover Like all of Edward Yang's pictures, \"Yi Yi\" is set in Taipei, the capital of Taiwan. Framed by a wedding and a funeral, and so union and separation, the film charts the trials and tribulations of at least four generations of Taiwanese men, women and children. Translated into English, Yang's title means \"one one\", or \"each one\".The film itself is preoccupied with \"ones\". Though Yang immerses us in a tapestry of relationships, each of his characters remain irrevocably alone. There's a dying grandmother, two schoolgirls, several men, women, husbands, wives, co-workers, past lovers...a smörgåsbord of interpersonal but impersonal drama. Everyone's oblivious to everyone else, forever trapped in their own private boxes.\"We haven't yet surpassed fighting and killing games because we haven't fully understood ourselves,\" a character says. \"Yi Yi\" itself posits human suffering as a failure of both perception and self-reflexivity. Our characters don't know what they want, why they hurt, act, how others see them or why and how others feel. Rectifying this is a character called Yang Yang, a precious eight year old who delights in taking photographs of \"hidden\" and \"invisible things\", including the backs of the heads of others. \"You can't see it,\" he says, \"I'm helping you.\" It is through Yang Yang that Edward Yang develops the film's autobiographical subplot. He turns the film's eight year old into a miniature version of himself, a budding sage who explores the catacombs of Taiwan and stumbles upon profundities which everyone else ignores. \"Can we only know half the truth?\" the kid asks, and resolves to become a photographer, determined to push the limits of human perspective.More than Yang's previous films – most of which are essentially Antonioni with rice - \"Yi Yi\" portrays contemporary capitalism as alienating, isolating and conducive of depression. \"I'm never happy,\" one character mourns. \"How can we be happy when we don't love what we do?\" comes the reply. The World Health Organisation itself estimates that depression will be the second largest contributor to global death/disease by 2020, but such rates in urban Japan and China are already exorbitantly high; the very conditions capitalism requires negatively impacts children and workers.But if Antonioni is noxious and suffocating, \"Yi Yi\" portrays a more beautiful form of alienation. Yang's film is filled with boxes, squares, human beings immaculately framed by walls, windows, doorways or lost in the aural cocoons afforded by headphones. Lovers meet under bridges, humans pass one another in hallways, brush anonymous shoulders in elevators or hang suspended above highways in their pressure-cooker apartments. Yang's urban spaces are harsh, but beautiful, with sprinkles of green and patches of warm blacks and red. With Yang, characters and environment seem inseparable. Often his static shots of places and spaces seem more interesting, and thrilling, than the human beings who mope before them. Elsewhere his images evoke Edward Hopper (\"Night on the El Train\", \"The Wine Shop\", \"Automat\", \"Night Windows\", \"House at Dusk\", \"New York Movie\"), with their obsessions with layered windows and frames within frames.Like Robert Altman's \"Short Cuts\", Yang has scenes bleed into or foreshadow others. Unlike Altman, these connections are obvious: the laughter of one sequence morphs into the cries heard in the next, a husband's recounting of his romantic past is inter-cut with his daughter's baby steps into first love, and the sound of a thunderstorm on a school presentation becomes the literal raindrops which assault a street corner.\"Overfeeding may not improve growth. It may hamper reproductive drives. Some of you can't bloom,\" a teacher says, a speech with speaks to the ills of Yang's cast, but also bleeds into the very next sequence. Here a child is gestating, the baby's ultrasound image echoing the teacher's words: \"It begins to acquire signs of human life.\" \"Yi Yi\" ends with the death of a grandmother, a moment of mysticism borrowed from Kenji Mizoguchi's \"Ugetsu Monogatari\". The woman's death, which corresponds to the birth of the aforementioned child, shatters everyone, but also, for the first time in the film, unifies Yang's cast in their suffering. Private, differing anguishes then become one singular anguish, at which point Yang Yang delivers a little metaphorical monologue in which he urges people to \"listen\", \"discover where others went\", \"tell everyone\" and \"bring others to visit\". The film then ends on a note of irony. If opening scenes portray alienation amidst a social gathering, Yang's climax portrays hugs and kisses at an event in which humans are brought to be torn apart. Twos become ones, divisions become erased, though only in a fanciful sense. Taipei is Taipei and nothing's changed. \"I feel old,\" Yang Yang says. Edward Yang died of cancer in 2007. \"Yi Yi\" was his last picture.8.5/10 – Overlong but exquisitely shot. See \"The Devil Probably\" and \"La Chinoise\".",
            "review_date": "2014-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "We'll Look Back on This One as a Masterpiece",
            "content": "\"Yi yi\" is a lovely film, pulsing with warmth and humanity. It tells the story of a Taiwanese family coping with the everyday fears and anxieties of which life is made. In the end, the movie suggests, there are no trivial moments in our lives, even if they seem so at the time -- any one person's life is an accumulation of both the trivial and the significant. What makes it worth getting out of bed every day is the fact that we will never live a day exactly like the one before it.The structure of \"Yi yi\" mirrors its theme -- the film is a gradual accumulation of quiet moments that build toward something deeply moving. We watch the father of the household reconnect with an old flame, only to see his disappointment when the realities of his past don't match his idealized memories of them. We watch the mother battle depression and the overwhelming sense that she lives day to day doing nothing with herself or her life. She seeks meaning by leaving her family to spend time at a religious commune, but she learns that the answers she's looking for aren't to be found there. We watch the adolescent daughter timidly flirt with sex and dating, a young girl only beginning to unearth the complexities of what it means to become an adult. But my favorite character is the 8-year-old son, who takes pictures with his camera because he wants to show other people what they're not able to see for themselves. He's a little boy who is old enough to understand that there are things he can tell people that they don't already know, but he's too young yet to know how to communicate those things. One has to wonder if this character is the young alter-ego of the film's writer and director, Edward Yang.\"Yi yi\" isn't flashy. It doesn't intertwine all of these characters' story lines with clever narrative sleight of hand; it doesn't pile coincidences on top of coincidences like these multi-narrative ensemble films frequently do. It's not histrionic, and it doesn't build to some overheated climax. It's not interested in doing any of those things. It unfolds the way life unfolds, and it makes us deeply care about these people, and even makes us love them in a way, flaws and all. It reminded me very much of an Ozu film, with its static camera that chooses to sit back and observe rather than tell us how to feel.\"Yi yi\" feels like a modest work of art while you're watching it, but it lingers in the head and its power builds the longer you have to muse over it. It's the kind of movie I have a feeling we'll look back on in twenty years and recognize as a masterpiece.Grade: A+",
            "review_date": "2008-03-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Reflections multiply the beauty of this film beyond anyone's rating system",
            "content": "I'd love to do a systematic investigation of every reflective shot in this movie. I can think of 10 stunning examples off the top of my head. In the director's comments track on the DVD you can hear Edward get noticeably excited when another reflective shot presents itself on screen. He points them all out, and it's true that the shots do seem to present themselves to the director. Although you must assume he had something to do with them, he confesses that it was magic that he discovered when he got to the location. Neither he nor I can explain what effect the superimposition of a night cityscape on a dark office space has on our understanding of the emotional world of the character sandwiched between the layers of light.It seems there is magic at work all around. But it is not magic at all, as we learn from Mr. Ota's card trick -- merely attention. Maybe it's the reflection's ability to split out attention out into many streams of thought and quickly focus it back down that gives his scenes their vertiginous exhilaration. How else to explain the rush one feels from looking at a completely static shot where you can barely make out the actors?He set out to make a film about family but I think he discovered he also wanted to make a film about life in Taipei. The reflections are the device that lets him make two movies at once. I think that's what is most special about each reflective shot. It is the instantaneous visual realization of an epic goal, and a reminder to the audience of both themes working in the movie.His assuredness and gentleness astounds me.",
            "review_date": "2001-05-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "insightful masterpiece",
            "content": "This insightful, beautifully written and directed film contemplates on many things concerning the modern individual. The focus is a family in Taipei, the feelings, struggles, conflicts of family members at different life stages. The architecture is used as a part of the story, the surroundings the characters are in, always seem to tell us something about that particular situation. The effects of modernity and capitalism on the individual and traditional values are aptly analyzed and basic human emotions like love, loneliness, commitment and frustration are contemplated with a hard to match observation and tenderness. The little boy seems to verbalize the director's approach to film making: \"We only understand half of everything because we can only see what's in front of us.\" and Yang's camera aptly shows us \"the other side\" of every situation. As a character says \"with films, we experience many more lives than we actually can in one lifetime\" and this film is a whole life experience in 3 hours.",
            "review_date": "2003-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Quiet Masterpiece",
            "content": "Yi Yi is about life and everything it contains. It's about love and heartbreak; remembering and forgetting; creating and destroying; budding friendships and vicious rivalries; success and failure; marriage and infidelity; happiness and depression the beauty of music and also of silence; the passage of time; and most of all life and death. How does this one movie say so much about so many things? It takes it's time, it expects the viewer to pay attention and work with the director to create a world that expands beyond the edges of the frame. It allows you time to appreciate what's happening in front of you, but it also asks that you bring your own prior experiences with you. This is a film that I believe could be watched at various moments of your life, and you could get something new from it every time. It's a film that looks at the curious age of young childhood, the uncertainty that comes with being a teenager, the regrets of middle age, and the reflection of old age. Edward Yang takes time in crafting wonderfully memorable characters that feel tactile and believable. The trials and challenges faced by the members of the Taipei family are not world changing, but they do change their lives. They're an everyday family, trying their best to live life to the fullest (whatever that means), doing their best to figure out where they fit in the world. To call this film anything but a masterpiece would be an insult to cinema.",
            "review_date": "2019-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Soap opera in excelsis",
            "content": "I don't think the term \"soap opera\" existed before the widespread growth of TV when it started to be used to define a genre of entertainment that dramatised the everyday lives of a cross section of interrelated characters that could theoretically go on for ever.  The formula for the success of the longest running, the British \"Coronation Street\" and \"Eastenders\" for instance, is self-identification, the depiction in a heightened dramatic form of the sort of problems we all live with, bringing a degree of comfort and assurance to the audience watching a fictionalisation of its collective angst.  When we liken a finite form such as a film to \"soap\" we tend to use the term in a derogatory sense isofar as we see it as dramatising trivia. However we must be careful about this as there have been examples of very high cinematic art that conform to the conventions of soap opera, \"The Best Years of our Lives\" for instance in the '40s, the German \"Heimat\" a few years back and more recently Edward Yang's \"A One and a two\".  It is that very element of everyday anxiety viewed with such perception and truth that makes the Taiwanese film so compelling.  Yang has moved away from the youth violence of \"A Brighter Summer Day\".  His middle class family is involved with commerce and careers.  However noone has an easy time of it.  Each member of the family is plagued in their different ways by their inadequacy in coping with the infirmity of their eldest member.  At the same time the father is troubled by his work and the complication of the reappearance in his life of a woman he met many years ago, his wife is seeking spiritual advice from a Buddhist guru, his teenage daughter becomes the butt of romantic jealousy from the girl next door.  But it is the 8 year old son who seems most able to come to terms with the vicissitudes of life.  He survives the spiteful taunts of his little girl peers and a bullying schoolmaster. His defence is an enquiring mind which he applies to his surroundings with a Kaspar Hauser fortitude and innocence.  We already know that if any of these characters will be a survivor it is this youngest.  Yang shoots the film with an almost Ozu-like purity, preferring long held shots rather than camera movements, although unlike Ozu he does not make a fetish of this. Often we see action through windows but not  at a distance as in \"Rear Window\" so everything has an immediacy.  It will need a few more viewings to assess whether \"A One and a Two\" is on the same level as Yang's earlier \"A Brighter Summer Day\".  At the moment something tells me that is does not quite measure up to that savage masterpiece.  Its very gentleness could be the reason, although I recognise this is hardly a valid argument.  After three viewings it remains for me a rather elusive work, compelling in its way but curiously difficult to evaluate.",
            "review_date": "2002-04-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Kaleidoscope",
            "content": "The action takes place in Taipei like it could take place in any other modern town of this world because the dramas that occur in our urban bourgeois society are the same everywhere. In fact we see here a very westernized society in terms of values and living standards both material and moral. The movie develops itself in a succession of apparently incoherent sequences which nevertheless are bound by a conducting wire that has much to do with life in itself concerning a chain of different generations, from the dying grandmother to the small boy who is not the less important character here. This succession reminds us of Godard's movies though this one and the sequences themselves are full of meaning. Even the silences they contain are very eloquent sometimes. The scenery is usually very neat, clear and quiet in terms of furniture, urban views and people and camera movements which doesn't make the story less dramatic at all. Particularly interesting and very well shown is the counterpoint between the love meetings of teenagers and the meeting of the fourtyish couple of the former lovers who meet for the first time again 30 years after their courtship had been broken in dramatic circumstances. Problems concerning the meaning of life and the real nature of love are shown mainly through the very incisive dialogues making us thinking once more that love is a much more complicated thing than romanticism depicts. It has features and ups and downs that remain unexplained sometimes. This movie is one of the most significant ones I have seen in which concerns human nature and its conflict with the values of modern bourgeois society on the one hand and also universal values of all times on the other. We watch here problems of children and teenagers but also of adults either marital, professional or spiritual. And all this told in a smooth and quiet way portraying normal people leading normal lives. This movie presents itself indeed like a kaleidoscope of real nowadays life.",
            "review_date": "2005-04-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Yi Yi\" - few things are as simple as ones and twos...",
            "content": "In the early new century, late Taiwanese director Edward Yang broke out from under the radar with his epic modern masterpiece and last film Yi yi (2000), a tender refreshing subtle drama centred around a domestic family. Remaining one of the most critically acclaimed films of the century, it's a shame that Yang left us before making another film but did broaden eyes to his other obscure works such as A Brighter Summer Day (1991) and The Terrorizers (1986); as all the practiced methods in these films come to their highest point of intimacy in Yi yi. Shuffling between a range of moods and themes, the focus and basic premise of Yi yi is a middle-class family in Taipei over the course of one year, beginning at a wedding and ending at a funeral. The characters disband and we follow each subplot discovering and developing each of them; the father (N.J.) spends time with his long lost first love, imagining what his life could have been and studying his past behaviour; the mother (Min-Min) who feels trapped in her status of housewife; the daughter (Ting-Ting) who discovers first love; and the son (Yang-Yang) who evaluates his surroundings. Other prominent characters include the husband and bride of the afore mentioned wedding and the soon to be deceased.The pivotal theme of Yi yi is in general the love we give and receive all throughout life – although this is not demonstrated in any chronological order within the film. First, there's the love a baby receives (which the bride from the wedding carries throughout the film) from the whole family and the parents – of which this mutual and constant love remains for eternity. Then as a young child, Yang-Yang, he just begins to notice girls and the effect they have on him. His sister plays the teenager representation, who seeks the opposite gender for sexual attention; a supposed illusion of love. As an adult, or when maturity is apparently complete and they're getting married, there's the love from the family and the strong attraction between the couple themselves. Later in middle age, when possibly this appeal fades (as presented by the fact N.J. and Min-Min take some time apart) there's the assumed love from ones children, peers and the sensation of reminiscing past 'loves'. Once one reaches old age there's the love from and to the whole family. Another theme is the representation of modern family life, working on superstition, traditions and behaviour. This being shown by the fact the entire family lives near or together, especially when one is weak. Also, the wedding is intentionally set on a particular date just because it's a supposedly lucky day on the almanac calendar (also giving their child a 'lucky' name). It also shows how materials and possessions are useless without any form of love.N.J. is one of my favourite and most fascinating characters in cinema. He's passive, understanding and rarely aggressive; even stereotyped by his colleagues as the 'honest-looking type'. For example, when he witnesses an unfriendly brawl due to an unwelcome guest, he avoids joining in and waits for it to calm down before considering making his entrance. But by this disturbance, he feels the occasion is ruined and kindly refuses to join though he doesn't judge any of the people involved. When Yang-Yang prefers to eat McDonalds rather than food at the wedding he indulges and makes no fuss. After this particular scene, he encounters an ex-girlfriend by an elevator who confronts him for standing her up at a date several years ago. N.J. does not respond. Throughout a much later set meeting in the third act, we discover that N.J. was in fact the nervous type, which leads us to evaluate his current behaviour against his old one – there's the use of parallels by having his study of his past behaviour over his daughter and her boyfriend's first date, following these patterns. Though he has reached a new stage in his life and he's finally comfortable with the woman, he doesn't feel the attraction. When it comes to business, he is very calculating, understanding what to do but when he feels pressure he escapes to music. Plus he is co-operative but not dominating.Due to all these themes and the effect of personal impact it had on me, I refer to this film as the most enlightening and life-affirming film of all-time for me. This is mostly because the film has entirely convinced me that its theories are true and they are very comforting and therapeutic, despite the equal balance of happiness and sadness. According to the director, Yi yi literally translates to \"A One and a Two\u0085\", like the phrase bands say before their performance. It's as if everyone is only getting ready and this is one big rehearsal. Or it is one big irony because, as Edward Yang has stated; 'few things in life are as simple as ones and twos\", unlike the situations in the film. It is an incredibly rewarding and satisfying experience, if emotionally draining. There's also a very reassuring quote from the film I love; \"My uncle says\u0085 we live three times as long since man invented movies. It means movies give us twice what we get from daily life. For example, murder. We never killed anyone, but we all know what it's like to kill. That's what we get from the movies.\" This is the natural beauty of film and my inspiration. I think the thought of this film could carry me throughout my whole life.One of my favourite films of all-time.10/10",
            "review_date": "2008-11-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely beautiful",
            "content": "This is a movie that very slowly enters your heart.\nAt first I wasn't sure I was totally invested, but before I realised, I was overcome with emotion.It gradually gives you little moments of pain and happiness that build up to a very emotional conclusion.It's three hours long and yet it never felt long. It was slow, but never boring.Mt favorite scenes where the ones between NJ and Mr. Ota, the japanese bussinessman.\nThere's something incredible warm and comforting about their conversations that contrast greatly with the more painful relationships in this beautiful film.",
            "review_date": "2020-05-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why Yi Yi?",
            "content": "With beautiful and expressive shots, sensitive and eloquent direction, incredible acting by all involved, and a plethora of brilliantly quotable lines, add to that the fact it's considered a \"slice-of-life\" film, Yi Yi really could have been easily one of my favourite films of all time. Alas, I can't even say that I liked it!Two main reasons this film didn't resonate with me nearly as much as I expected are that: I didn't find the vast majority of the characters to be interesting, and I couldn't see why this is considered to be a slice-of-life film in the first place.The only character I was almost constantly interested in is Yang-Yang. I found the relationship between N.J. and Sherry quite absorbing and engrossing as well as the scenes with N.J. and his Japanese friend; I can't say I really cared about the character of N.J. as I was supposed to be.I couldn't care less about everything related to N.J.'s wife, teenage daughter, brother and business partners. Apart from one scene N.J.'s wife shares with N.J.'s mother that was a bit emotional, I found the film emotionally flat and almost fell asleep every time I see these above-mentioned characters. I found the story-line of Ting-Ting to be one of the most boring and uneventful I've seen in any film. Let alone the fact this film is 3 hours long!A slice-of-life is a term used to describe a piece of art or literature that shows or depicts the ordinary details of real life. And I'm enamored of any film or novel that can be classified under this, so to speak, sub-genre. The thing is I couldn't see that Yi Yi fits this description. What I saw, in the first 30 minuted in particular, are many of uninteresting characters acting in an absurd way. I really couldn't see that this film has mundane real-life events as most people do.(6.5/10)",
            "review_date": "2019-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "We can't see how our head behind us looks like",
            "content": "Edward Yang's Yi Yi is a film made in Taipei, the biggest city in Taiwan, and he demonstrates the sadness of the people who work hard but can not find out the meaning of life. He successfully uses many reflection-frames to suggest to people that life is not just working hard and making money. The first reflection-frame happens when grandma is suddenly sent to the hospital. Yang has the camera focus on the hospital windows during the dialogue between NJ and his brother-in-law, A-Di, so we can see their reflection on the windows. Reflection-frames in each film do not always have the same meanings and they depend on different situations. Therefore, I suggest that Yang tried to show that people can see their reflection by windows or mirror anytime, but they are too busy to look and see how they have changed.Also, they are afraid to face the truth in the reflection because the truth is not what they want. A-Di's reflection on the windows shows us his dishonesty. He always has trouble with money, and his promise that he will give back NJ's money soon is not true. On the other hand, NJ actually does not care much about money. Moreover, in this reflection, there is one window frame set between them, and their reflection is separated by that window frame. The separation suggests that NJ is different than A-Di, and the value of money is not as an important to NJ as A-Di. Also, A-Di's reflection in the framed window takes up more space than NJ's reflection. Yang may suggest that the majority of people in the big city are like A-Di who has the ambition to make a great deal of money. People in the city are unhappy and unsatisfied with the property they have, so they spend more time to make more money. However, NJ taking up a small space in the framed reflection represents the minority of people who struggle to find work that is interesting to them. Mostly, people whose work interest them can not make enough money for their family. Besides, Yang can be connected with NJ's reflection, which takes up a small and narrow space in the frame. He chooses the work which he is interested, but his films hardly make money even through he makes great films. Referencing to Yang's background, he graduated from an electric engineering department in good school. He can work in a highly technical company and have a good paying job, like NJ. However, he predicts that he will be unhappy as NJ is. Therefore, he chooses to make films as his job and enjoy it whether or not his film can make money as commercial film. The reflection-frame in the hospital is an ironic: NJ is worrying about the situation of his mother-in-law, but A-Di is worrying about his financial trouble. Because A-Di was born and raised by the person who is in the emergency room, he should show more worry than NJ, but A-Di doesn't. This situation reminds me of Noriko in Ozu's Tokyo Story (1953). Noriko shows more care to her dead husband's parents than other members in the family. Ozu is a Japanese and made \"Tokyo Story\" half a century ago; however, Yang is a Taiwanese and made Yi Yi almost fifty years after \"Tokyo Story\". Even through they use different film techniques, both Ozu and Yang arouse viewers to balance the importance between money and family.",
            "review_date": "2004-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Less than meets the eye",
            "content": "I find myself largely at odds with the  overwhelming and unanimous praise that \"Yi Yi\" has won. While my reaction to the film was positive, my enthusiasm is far cooler than most. There is nothing innovative about \"Yi Yi\". True, not many movies observe the trials and tribulations of a pretty ordinary family. The fact that Yang does this for close on three hours while holding ones interest certainly is an indication of his directorial skills, as are the convincing performances by all.  But when it's all over not a lot remains. Ordinary lives can been fascinating when perceived with an astuteness which is informative and enriching for the viewer. That is not the case with \"Yi Yi\". The characters are portrayed with a certain compassion and affection, but far less is gleaned than one would expect having given close to three hours of ones times to the film.My guess is that the supposed foreignness of a Taipei family holds much attraction for western audiences, though nothing in their behavior highlights any appreciable difference between east and west. This adds to the film's accessibility. Prior to his Hollywood career, Ang Lee's \"Eat Drink Man Woman\" was too an observation of a Tapei family and vastly superior in all ways to \"Yi Yi\". Lee's film was indeed an emotionally and culturally enriching experience.My attention was drawn to this film by the vast amount of rave reviews it received. It is difficult to remain impartial to such endorsement, hard as one may try and naturally my expectations were high.While worth watching, I feel it's a case of less than meets the eye.",
            "review_date": "2003-07-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Modern life haunted by the ghost of Nicholas Ray (spoilers)",
            "content": "In the 1950s, when Nicholas Ray wanted to reveal the tensions and emptiness behind the economic super-confidence of conformist America, he located social problems in the family, and made melodramas like 'Bigger than life' and 'Rebel without a cause'.  Ditto Edward Yang in 2000.  'Yi yi' begins with a wedding, and a child being bullied; ends with a funeral, and a child asserting his creativity - in between we get all the major pointers of life - birth, work, suicide, friendship, mid-life crises, murder, adultery, etc. \nBut although these are the events that comprise life, they don't feel like life.  My comparison to Ray wasn't entirely gratuitous - in many ways, 'Yi yi' plays like an update of 'Rebel', with the focus shifted from the alienated, frustrated, emotionally abandoned children, onto the weak 'failure' of a father.  It's not just the colour coding that informs the film, the struggle between bright reds and cold blues - not simply a conflict between passion vs. sterility/melancholy, or whatever (the reds often seem like a desperate, delusive attempt to galvanise passion into emotionally paralysed situations), but as a pointer to the artificiality of a society that is supposed to be based on, to feed and protect the 'natural' unit of the family, but simply succeeds in alienating, fragmenting, even destroying it. \nIt's not just the very Ray framing, which sees the quiet, passive characters repeatedly blocked in by their surroundings, framed through barely open doorways, or tiny figures in complex multi-frame compositions, trapped in Chinese boxes of their own creation.  These box-like frames (windows, mirrors, televisions etc.) naturally point to the box we're watching, the cinema screen, and the film, among so many other things, contains an internal debate about life and society mediated in a highly media-dominant culture - the arguments about cinema's relationship to life; the brutal murder apotheosised as a computer game; the crucial figure of the child, a stand-in for Yang himself, trying to show people the whole picture, not just because they haven't got eyes behind their head, but because even their forward vision is too restricted.  It's not just the insistence on melodrama - extreme, domestic, 'soap opera' situations - as the most appropriate form to capture the extremes of life, forcing events to such a pitch of tension that relief, as in 'Rebel' and most melodramas, can only come in murder.  It's not just Yang's even-handedness, that can see a betrayed child's need to blame his or her impotent parents, and yet so sympathetically understands that impotence.Maybe I'm going too far here, but the most important character in 'Rebel' is Plato, the true outsider needing a surrogate family unit, yet spurned in love.  That character speaks for most of those in this film.  But Plato, or course, is the philosopher who pretty much founded Western culture, a culture now dominant in the Taiwan of this film.  In basic terms, Plato denied that there was any such thing as 'reality', that we were all shadows and dreams.  I'm not suggesting that 'Yi yi' is based on Platonic theory or anything, but it is remarkable how often Yang undermines the substantiality of this society and the monumental buildings that represent and uphold it.  So many scenes are shot in window or mirror reflections, as if characters are no longer real people but so alienated from themselves, the identities they have constructed for themselves, work, family, their past ideals, etc. - that they have become shadows.  Or dreams - is it a coincidence that the entire narrative coincides with one character, representative of an older Taiwan, lying in a coma, while her granddaughter, with none of her certainties, cannot sleep, stumbling bleary-eyed in a living nightmare.  There is one awesome shot where Yang shoots NJ through his car window, his business on the verge of collapse, his family life a sham, where the whole city seems to sink  in his window. \nThis is why so much time is spent on the business deal with Ato, with its themes of doubling, reproduction, inferior copies - all linked to a cycle of life (e.g. the birth scan) becoming increasingly less life-like.  Just above the synthetic modern world exists an older one, of clouds, rain and moonlight, revealed to Yang-Yang in a counterpart to 'Rebel''s Planetarium scene, an ignored metaphysics accessible through music (the 'melo-' part of melodrama) or film, and potentially life-changing if we'd only slow down to notice.  It is significant that the grandmother's funeral takes place in a more traditional, unWestern environment.",
            "review_date": "2001-04-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Overlong, dull, obvious",
            "content": "The biggest problem with YiYi is that it lasts for at least an hour too long, without saying much in the process. Another major flaw was the way that it spells everything out, without trusting to the audience to pick up subtly expressed connections and motivations. Two examples readily come to mind. When the characters one at a time talk to the comatose, but off-screen grandmother, I realized that this was akin to a form of traditional ancestor worship. Then the main character, the businessman, says directly that this talking is like praying. A more blatant example was the inter-cutting and overly obvious parallels between the father's past as discussed in Tokyo and his daughters present back in Taipei. This is where good editing could have made the film more thought-provoking, less obvious and more interesting.Another problem for me was the fact that I couldn't connect or care about any of the characters. Possibly this was because they had trouble expressing emotion and interacting with each other, but I felt uninvolved with all of them. A pretty disappointing feat for a nearly 3 hour family character study. The camera work was also very static and dispassionate. At first, views through empty doorways, awaiting characters to walk through them, and long shots of couples seemed interesting. But their repetition and lack of variation made these distancing techniques become stultifying. This was especially true of the many long takes that occurred towards the end of the film.I also thought the main character showed a fairly limited acting range, while some of the crying scenes were given over to poor acting. Overall, I was left mostly bored and wishing I had chosen a better and shorter film for the evening.",
            "review_date": "2006-07-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eric Rohmer of Taipei?",
            "content": "I do not for a second understand the high praise heaped on this film. Though the premise was somewhat interesting, I found its execution to be unbelievably dull and emotionally cold and distant.Some have praised the cinematography, but that is actually where my criticism starts.  The camera is unbelievably static throughout this picture, and shot selection lacks the kind of interesting variety necessary to keep a 3 hour film engaging.  Time after time we are shown two people walking and talking at such a distance that we are not even able to see their lips moving, or the expressions on their faces. \nIn fact, we are rarely shown the actors' faces close up, so it is hard to ever get an up close and personal impression of their thoughts and emotions. In terms of filmaking style, I would say that this film shares a lot with the work of french director Eric Rohmer.  His films too are extremely talky, and feature very static camera work.  His plots are equally uneventful, sometimes comically so.  What sets Rohmer apart, though, is that his films are usually a very palatable 90-100 minutes.For a film that has so many boring and mundane elements, 3 hours was quite simply too long for me to handle, and if I had been the producer, I would have sent the director back to the cutting room with orders to cut out th 60-75 minutes of flab weighing this picture down.",
            "review_date": "2003-08-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This Family",
            "content": "It begins with a wedding, so you're wary, despite the raunchiness and hilarity and gossip. Comedies begin with funerals, but tragedies with a celebration. Yet Edward Yang's sprawling film, almost three hours in length, is not a tragedy, it is not a portrait of a family in crisis when grand ma has a stroke and goes into catatonia. It's a family in a series of crises, each individual member going through some tough times that seem to bear little relationship to any of the others; indeed, they each seem unaware of the troubles the others are going through, and it's thereby a portrait of what a family is -- not must be, but is in this case. They live together, but their lives don't overlap much. Each is expected to do his or her work, whether it's the small boy going to school, the man who is expected to bring home the paycheck, or the grandmother who is expected to listen. That's what the doctor says: talk to her, and it will help her arise from her state and rejoin them. Except that no one does so.Will grand ma live or die? Who will take over her work? What is her work, what does she do for the family? Is there actually a family, or just a bunch of strangers living with each other?",
            "review_date": "2020-07-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Life in its Subtleties",
            "content": "A movie that is true and honest to its audience, Yi yi captures you in your seat for 3 hours, and then stays with you for many more. Watching a movie on a big screen we get used to seeing larger than life images and situations. This movie brings all those back down to a level where you can relate to. So much is going on in this film, yet the presentation is so subtle that the 3 hours is barely enough to see what exactly is unfolding infront of your eyes. The characters are NOT representations of certain archetypes defined by a character phrase. Instead, they are as simple on the outside and as complex on the inside as you and I. Snippets of yesterdays memories, todays hopes and tomorrows expectations arise and we eventually see a fact that we have been ignoring for years: That our eyes are on the front of our heads therefore we can only be seeing half the truth and whatever happens behind us remains unknown. This will make more sense after you see the film... A one and a two and a ... Gimme a break, gimme a break... Break me another piece of that Yi Yi Bar...",
            "review_date": "2001-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Masterpiece.",
            "content": "Robert Altman and Paul Thomas Anderson could stand to learn a thing or two from Edward Yang.  The ensemble cast of this film had me spellbound, and although the plot was hardly tied up in a neat little bow at the end, it was a greatly satisfying experience.  I've watched it twice, and plan to watch it again, and introduce it to more people.  Get to know these people!",
            "review_date": "2004-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yi Yi traverses the generational intersections of life through reflective horoscopic love.",
            "content": "What is life? What is love? What is death? Everyday, society wakes up to perform their daily routines, resembling crucial components in a cognitive machine. Everyday, humanity subconsciously questions the dissatisfaction of the mundane life they preside over. And every night, civilisation sleeps. Only for the repetitious cycle of daily endeavours to loop once more, until death beckons for our souls. Humanism is a contemplative philosophy, profound with its resonance to the heart, enabling the regular challenging of daily fulfilment. Work, education, love and family. Is it ever enough?The Jian family, representing a perceptive portrayal of cultural and generational differences, encounter various trials and tribulations that personify the natural order of humanity. Middle-aged father NJ increasingly growing dissatisfied with work, a business occupation surrounding itself in the venomous greed of plutocracy. NJ's wife succumbs to a midlife crisis after her mother regresses to a comatose state after a stroke, retreating to a Buddhist temple to seek enlightenment. Their teenage daughter Ting-Ting ensnared in a troubling love triangle, whilst solely consuming the blame for her grandmother's stroke. And the youngest son Yang-Yang, developing an interest in photography to overcome the persistent bullying from his childish female classmates.Yang's intrepid final directorial feature before his untimely death is a slice of societal life through the perspective of middle-class Taiwan. Commencing its ornate grandeur with a joyous wedding, only to culminate in a melancholic funeral. Yi Yi, translating to One One, parallels idiosyncratic emotional turmoils between each generation gap of the same family to perpetuate the difficulties of humanistic stability and its eventual deterioration. For example, life. NJ emotes the representation of depression with his lethargic energy and solemn facial expression, indicating his general unhappiness to the corporate environment. He then meets Japanese software mogul Ota, whom provides a much required mental realignment through a spectacular sleight-of-hand card trick, after highlighting NJ's strengths in earnest personality. His honesty. Ting-Ting, a reserved bookworm undergoing puberty, unabashedly welcomes the first male counterpart to show admiration for her. Only to inevitably end in heartache, as most school crushes do. Yang-Yang is at an age of curiosity. Coming to terms with the apparent social ineptitude by discovering a newfound hobby that would allow him to express his emotions through stills of people's necks. Bestowing them the \"whole truth\".These internal complications then transgress into parallels of love. NJ reuniting with his former flame Sherry, whom desperately yearns to participate in his life once more. The two discuss their lost love, describing the first encounter they had vividly remembered. Comparatively paralleling Ting-Ting's first date. Holding hands whilst experiencing sweaty palms. The sudden surge of temporary emotional stability. Yang, through a simple yet hugely effective narrational parallel, uncovers the emotionality behind love and how it can determine one's life for the subsequent years to follow. His delectable screenplay never deters from the engrossing characters on screen. These aren't plot devices for a hyperbolised dramatic endeavour. These are reflections of reality.Accompanied by sublime cinematography from Yang, whom encapsulates the foundational imprisonment on mundane life, and Peng's orchestral score that heightens the disparity within the Jian family, and the feature becomes an epic tapestry that invades every sense. Beethoven's Moonlight Sonata especially enhancing the quaint nature of Yang's characters. Every single frame of the near three hour runtime has some significance, no matter how minuscule its staying power is. From seamless tracking shots of concrete office blocks to the picturesque clouds supplying the blue sky with personality. Anything and everything corresponds to an emotional stimulus.That's the beauty of Yi Yi. Much like life itself, the adornment is found in the details. The employment of Chang and Lee as first-time actors. The extensive distance between the camera and cast. The multitude of poignant emotional breakdowns presented by the stunning performances all-round. These ripples of life echo across the generational gap that reverberate across every family in existence. Yi Yi refuses to be just a film about life. It is life. As quiet as background ambience, yet fundamentally existing. Yang's final feature is, undoubtedly, a cinematic masterpiece of supreme resonance. One that allows Yang-Yang's final words to latch onto my subconscious forever. For \"I feel I am old, too\".",
            "review_date": "2020-05-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sweet Portrait of Extended Family Relationships",
            "content": "\"Yi yi\" is a Taiwanese cross between PBS's Loud Family of \"An American Family\" and Barry Levinson's \"Avalon.\"Edward Yang's quite leisurely, still camera feels documentarian, particularly when the characters have more silences between them than dialog, but they are very pregnant moments.But the sudden plot turns remind you this is fiction as it traces a family through a wedding, birth celebration and funeral and in-between. Each person in the very large, extended family and their orbit is seeking answers -- through spiritual quests, through gambling, through nostalgic retracing of past relationships, through work or school or romantic success, and each ends up the opposite of what you expected when they started: the stable ones get shook up, the hysterical ones calm down, the dissatisfied ones reconcile, etc. So it's about life. My mind did wander sometimes in the middle as I got a bit confused about the ensemble of people, but the last half I was really involved, and judging by the sudden intakes of breath and appropriate laughter so was the rest of the audience.The kid is absolutely the most adorable, natural child actor ever-- especially when you find out what kind of photos he's been taking all through the movie, as a stand-in for the writer/director, and for all of us people watchers.I felt like I was still watching the movie when the couple next to me on the subway was arguing about whom to invite to their wedding and the guy kept touching her and wheedling until he got her to agree to invite all his obnoxious friends. And then they had an argument about whether they wanted their first kid to have brown eyes or not, evincing a wincibly bad knowledge of genetics. Well, there's research that shows that a long marriage of arguing keeps both participants alive longer.(originally written 2/12/2001)",
            "review_date": "2005-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ouch",
            "content": "Like watching paint dry. Tries to pull off a \"magnolia\" but fails to keep the viewer interested. Too long for too little. Waste of 3 hours. Boring piano accompaniments the whole way through. Grandmas in a coma,so Everybodys gotta talk to grandma every day. Gimme a break. This is a movie without any suspense, pure middle class drivel. I can't believe this was given thumbs up. I challenge any critic who enjoyed this to watch it a second time. Talk about being in a coma...there's some stuff coming out of China, but this and other painfully slow-moving scripts (like \"2046\") don't make the cut. It seemed like there was nothing in this movie that you wouldn't see walking thru a shopping mall. Business man questioning his existence? How cliché is that? The scene with the young couple watching the celloist in performance was so long I wanted to puke. If I want to hear cello music I'll put on yo-yo ma.",
            "review_date": "2008-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Deep, Thoughtful Film",
            "content": "\"Yi yi\" is a deep, thoughtful film, one that you need to view with a friend, then go to dinner and talk about. It reminds me somewhat of a Paul Thomas Anderson movie, but at a slower pace. Superficially, it's about an upper-middle class Taiwanese family, their ups and downs as its three generations move through life. At a deeper level it's about the meaning of life: of paths taken and not taken, of the limits of friendship and loyalty, of those mysteries that we can never fully understand.\nI didn't do the film justice in the preceding paragraph. It's difficult to describe, and you'd have to be in the mood for a movie like \"Yi yi\", or I fear you'd be disappointed. Another factor against it is that it's long, almost three hours running time. But if you are in the mood for a thoughtful film, then it is highly recommended.",
            "review_date": "2003-03-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Too much angst",
            "content": "While the characters are well-developed and the acting is superb, the plot itself leans far too much into angst, with very little positive to keep the viewers' eyes from wandering after about 45 minutes.  I lived in Taipei for a while, and the movie does do an excellent job of capturing the spirit of the city, especially all of the drinking.",
            "review_date": "2001-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Few moments not worth 3 hours",
            "content": "Edward Yang's film is bleak. If life, love and dying were this depressing, I'd wish to remain forever 8 years old. While there were a few poignant moments, these were few and far between, causing numerous people in the audience to leave before the touching conclusion three hours later. Most of the characters seemed to dread life, love, and the emotions that come with being human. And the women all seemed bent on destruction, sexually, spiritually, and emotionally. Breakdowns, crying fits, and indecision seem to plague these women with no sign of joy, humor, or compassion seeming to trickle into the cracks of their self-pitying prisons. Where are the redemptions, the creative sparks, and the connections with each other that keeps us alive?  Only the young son and the Japanese software genius, Ota, seem to have a grasp of the beauty of giving something wondrous back to the world while also enjoying the pleasures and humor in life. Sorry to disagree with the majority of critics, but I can only recommend this film to foreign and art-house film lovers.",
            "review_date": "2001-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Umm, I don't get it.",
            "content": "As a lover of foreign cinema for it's very different approach to movie making than Hollywood, I was excited about seeing this film. Unfortunately, the reality of seeing this 3 hours film was unable to live up to my expectations.First off, the film is WAY WAY WAY to long. 3 hours long. This leads to it's grinding pace. I had no idea it was this long, but while suffering through the film, I found myself asking \"when does this end\" more than once. Not a good sign for me.Next, if the character development had been more significant or the characters more interesting, then I am sure I would have liked it. The main characters to me were transparent, contrived, and acted badly.Oh well, you can't like them all.",
            "review_date": "2006-09-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The most of beautiful film I have seen.",
            "content": "This is the first film I've seen which prompt me to comment about it. \"Yi Yi\" is the most beautiful film I have seen. It deals with issues revolving around a \"typical\" Chinese family in Taiwan, focusing on the father, his daughter and son. All of this is revolve around a grandmother who is in a coma.The father (NJ) was a family man, who had to deal with pass relationship and his opportunist business partners. He as Ota (his Japanese associate) puts it: \"A good guy\". He is also a rather reserve person, holding onto his opinion without making the other person \"loose face\". Finally I felt NJ was loyal both towards his partners and family. To me NJ represented typical Chinese \"composure\" and emotion compare to Westerners, such as not hugging his wife when she was distraught or not being blunt with his thoughts.Ting-Ting, the daughter had to deal with relationship and friendship issues, at the same time she seemed to blame herself for her grandmother's condition. I felt Ting-Ting expressed the most emotion in the film due to her role as a teenager growing up.The gem of the film was NJ's 8 year old son. The youngster IMHO sums up what were in other's mind. He was naive, determine, playful and thoughtful and such a natural in front of the camera! His letter towards the grandmother's funeral at the end well, bought tears to my eye. *sniff*I also like the performance by Ota, I love his ways of explaining things. Could this be the Japanese way of doing business? :)I love the subtle camera work such as focusing on NJ's wife's confession via the table mirror. Or of linking Sherry/NJ's stories of their childhood relationship to Ting-Ting's relationship with her date Fatty and or with the son's obsession with the school monitor. I also like how scenes were lingered on longer then usual to create more atmosphere and makes the viewer wonder. One thing I did wonder about was the lack of soundtrack throughout the film, why?This is the first film I've seen directed by Edward Yang and I was most impressed with it and it has prompted me to check out his previous films.",
            "review_date": "2001-04-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautifully moving, Movingly beautiful",
            "content": "It is very seldom that a filmmaker is able to accurately capture the mentality and imagination of children. Sometimes the children come off as impossibly all-knowing, like in \"The Opposite of Sex\" and the TV show \"Dawson's Creek\". Other times they are portrayed as complete idiots. In \"Yi Yi\" however, it is the actors who play the children who give the richest and most moving performances.I was completely enraptured with the perspective of the son, who takes pictures in such a way so as to capture aspects of people that they might not be able to see for themselves. (After you see the film you will know what I'm talking about.) This tactic is ultimately what \"Yi Yi\" accomplishes. It captures parts of ourselves that we might not be able to see for ourselves and then presents them back to us.The full impact of this presentation is enhanced by the lustrous and lush cinematography. This film deserves to be seen on the big screen.",
            "review_date": "2000-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "99 Red Balloons",
            "content": "China produced at least three masterpieces in 2000: Ang Lee's \"Crouching Tiger, Hidden Dragon\", Wong Kar-Wai's \"In The Mood for Love\", and Edward Yang's \"Yi Yi\".\"Yi Yi\" is a contemplative mosaic about a family in Taipei and other people linked to them, as they have to deal with loss, loneliness, death, guilt, jealousy, broken hearts, spiritual crises... Like a Chinese Robert Altman or Paul Thomas Anderson, Yang makes a sensitive, poignant and, at times, funny ensemble with a very peculiar pace and extraordinary tenderness. It's definitely a film to see more than once in order to fully appreciate its beauty and subtle, brilliant moments (like when Adriene Lin sings, or \"mumbles\", to herself Shostakovich's \"Jazz Suite 2\", the classical piece also wonderfully used in Kubrick's \"Eyes Wide Shut\"). The final eulogy, given by the little boy, is one of the most human, honest, low-key poetic scenes you'll ever see. Yang died last year, at the age of 59, with \"Yi Yi\" being his last work. I haven't had the chance to see his other films yet, but this emotional epic would be enough to seal his name as one of China's most remarkable filmmakers. R.I.P., Edward Yang. 10/10.",
            "review_date": "2008-07-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A few nice moments, but Yang tries too hard to be \"poignant\" and \"symbolic\"",
            "content": "Although I was touched by a few scenes in this film, I felt mostly like Edward Yang was trying too hard to be \"poignant\" and \"symbolic.\"  Almost every scene is riddled with overly symbolic material that just made me roll my eyes or yell at my television.  Examples of this include the scene where Yang Yang is watching the movie on lightening with its obvious sexual allusions and then sees the underpants of the girl who he secretly has a crush on.  Another example was the whole cutting back and forth scene from Sherry and NJ in Tokyo back to NJ's children who are living out parts of NJ's childhood.  I was like, \"Oooo, deep, Mr. Yang.  Deep.\"  In addition, there is much annoying screaming in this movie.  This is not something I usually notice in films, but I think there must have been a good ten to fifteen minutes of women (a few men) making annoying screaming noises. Another thing that bugged me about this film on video (no fault of Yang's) was that the subtitles were almost impossible to read for much of the film. Didn't the film company check this out when they were editing the film with subtitles?  And finally, though this wasn't always the case, I guess I felt annoyed by the way the characters were all unconscious victims of the Confucion patriarchy/matriarchy and this fact was never brought to light by Yang.  Though there are moments of sympathy in this film, I often feel this when I watch films with a Chinese focus.  Hey, the archy hurts everyone, baby.  Empathy is healing.  Make sure you bust out a magnifying glass for the subtitles and some eye drops for eye rolling if you rent this film.",
            "review_date": "2001-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Less enthused than others",
            "content": "This plot focuses on a father, his teenage daughter, and his 8-year-old boy. The stories of the father and daughter are for the most part, respectively, soap opera and melodrama, and not compelling. (The daughter is, for me, inert.)It's the little boy who is a wonder, pure gold, and makes the movie worth seeing.",
            "review_date": "2022-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Our life",
            "content": "N.J.'s family and cause was in big trouble. His mother-in-law had a sudden stroke. His wife was tired of dull life and left the home. His daughter was in sensitive puberty. His son Yang Yang was so naughty that he was often scolded by their director. The company where N.J. worked was in critical situation. To his headache, he encountered his first lover who he had not seen her for a long time.The nearly-three-hour-long movie expressed vividly the daily life of an ordinary family. They are so real that I can identify some of them. In fact they do happen in the reality. A large number of details made me thinking of something that I had forgotten.The speech made by Yang Yang in the end was really touching and thought provoking. Our lives are full of happiness and sorrow. That is life. So no matter what happens, life will go on.An excellent Taiwan movie. 8/10",
            "review_date": "2005-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The human condition",
            "content": "Yi Yi is a lovely film about the vicissitudes and disappointments we all go through in life.  Focusing on a family of five -- middle aged parents, a teenage daughter, an eight year old son and an elderly grandmother -- the film explores the loss of innocence and the inherent limitations of possibilities as one grows older.  I found the story of the father most moving, as he struggles with behaving decently in a cutthroat business environment and his feeling toward an old flame who suddenly reappears. The loneliness of the human condition and the alienation of modern life can be seen in many shots of family members who, despite seeing the other's suffering, can't reach out to offer any solace, or in a scene of a woman crying alone in a hotel, shot through the glass windows of modern office towers. The film is not melodramatic.  It moves at a leisurely pace so that the viewer becomes completely involved in this family's daily struggles.  I highly recommend seeing this movie.",
            "review_date": "2000-10-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Like a bad soap",
            "content": "With the addition of some cheap pretentious scenes like:\na kid randomly says to his father, i can't see what you see and you can't see what I see, so how do I know what You see? Then he stops and says you can only know half the truth right? Because you only see the front of things and not their behinds. Then he buys a camera and starts shooting people's back - like in the poster- and show it to them. At the final scene, the kid says, when i grow up my job would be showing people what they can't see. The end.Laaaaaaammmeeee",
            "review_date": "2019-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "kicking little men and screechy women",
            "content": "I'm not going to try to get all the characters names right in Yi Yi. And there are a lot of characters, an extended family and various lovers and children. Taiwan is a modern, impressive city, a place rarely seen on American television or film. I might be looking at Manhattan rather than Taipei. The computer engineer's family, the wife with spiritual emptiness, the teen daughter involved in her first serious sexual activity, the grandmother on life support, and the eight-year old son teased to exhaustion by little girls, they live in a high-rise condominium over a raised superhighway. Then there's the née-do-well brother-in-law, so superstitious that he marries his pregnant wife only on a Chinese lucky day. His old girlfriend shows up at the wedding to raise hell. She returns at the babies Chinese confirmation for more of the same. A fight breaks out, kicking little men and screechy women.Our engineer had walked away from a young love, and while wife is with the monks, he renews the relationship on a business trip to Tokyo. He is in love. So is she, but, I can't tell you what happens without giving away this poignant part of the plot. Engineer's daughter is having a rather unusual fling as well. I've left out a ton of information as this film was close to three hours long, but watch the beautiful cinematography of Edward Yang, and his brilliant pacing. One thinks it is real life.",
            "review_date": "2006-05-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "reply to bleepnbooster",
            "content": "I disagree with bleepnbooster. Yi-Yi isn't a film that upsets conventions overtly, but I think that the close up along with the quick edit and lots of movement (to indicate emotion and excitement) is part of the lingua franca of television and commercial Hollywood pictures which Yang does seek to overturn. Of course the Hollywood way often works. Perhaps it could even have worked here. But I sometimes find it a bit of a shortcut for inexperienced directors. But Yi-Yi is an understated work. That doesn't mean that it's all English and emotionless, just that it doesn't deal in false pathos. It doesn't need to. To say that wide angle shots are alienating is not true (in this film at least - it can be a lot of the time, see Songs from the Second Floor). Indeed, in this film I thought the photography was incredibly beautiful, like a Balthus painting. Nor did I think that the proliferation of these sort of shots amounted to voyeurism. In fact isn't a close-up even more voyeuristic? I don't think Yi-Yi is a film that allows detachment: a Brechtian alienating effect would do nothing to add to it. It really is a masterpiece. Did the framing affect your involvement? I hope not.Things as they are in themselves is what this film sets out to show. Yang shows this in the plainest way he can and lets his script speak rather than through crafty directorial tropes. Does this make Yang less of a pure 'cinema' director like Kieslowski or Bresson? Perhaps. But isn't he also preaching a 'new cinema' - part Rohmer (his tableaux remind me of Yang's) and part Wenders (the lead character reminds me most of the protagonist in Alice in the Cities)? But, in the end, all of this shoegazing cinema namedropping ceases to mean anything and perhaps we should just say, 'isn't this a truly great film?'.",
            "review_date": "2001-07-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Calligraphy",
            "content": "Another film about middle-class people trying to cope with the same anxieties as the rest of us, this one set in Taiwan. A marriage and a grandmother falling sick initiate the two strands of life, one hoped to build up to something, the other a sadness that everything in the end dissolves.What kind of life is hoped for? Contact, connection. Only it's not rosy, there's duplicity and heartbreak, husbands and girlfriends who frivolously share their intimacy. What dissolution? Truthful connection eludes them, relationships don't blossom. None of this is turned into tearjerking, the heartbreak is quieter, the duplicity no real surprise.This mellow distance is more directly after Ozu, the film is about family and scenes of life much like he was. Ozu left two questions open in his own work. One was dispassionate observation from a distance but the moral had to be forced on us, usually a speech by an elder relative.Here it's all marvelously sublimated in the weave. One strand of story will be about love and this strand will be woven through many different situations, a schoolboy, a teenage girl, adults, and it's this weaving much more so than any story arch that gives it shape, creates flow, prompts contrasts and reflections. Nothing needs to be said, all we need to do is trace the calligraphy. Malick's and Tarkovsky's calligraphy is in the eye and choreography of things that glide from it; Zulawski's and Jancso's is also both in the eye and things. Here the eye is still, the illusion of natural life is maintained, the calligraphy entirely in the perception that arises from one scene to the next, in the repositioning of bodies, gestures, steps taken. Some excellent work.Ozu's other conundrum and more difficult of the two was narrative time. He was slow and aimless; I'm not too sure if hoping to capture some real rhythm of life or a meditative view. Anyhow this was quietly preparing the tea room where two people will sit, only the room for it. There was usually one crucial event in Ozu, often marriage. Having invested, we went around the bend with clarity, experiencing it as life instead of story. He tried this more times than he actually managed.I found this as unfocused as Ozu in this aspect. It slowly prepares room over time but there are scores of characters, situations, dilemmas of importance to each. It's simply that the plenitude and length imposed on the experience work against a concentrated view. Someone can say that life sprawls like this but then again not; you live through your life and not a dozen ones at the same time all around the city. So there are 3-4 films woven together here that I would love to see in their own right. First between them the one that culminates with a man and woman in Japan, each one the other's love of a lifetime that never happened, but the man has to stay on this side of her door, she has to close it.",
            "review_date": "2015-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magnificent!",
            "content": "A complex but breathtakingly simple film. During almost three hours we're shown how three generations of a Taiwanese family go about dealing with birth, life, love, heartbreak, death. Eight-year old Yang Yang is having existential doubts. His adolescent sister is going through the throes of puberty and unrequited love. Their father is in a mid-life crisis, regretting lost opportunities. Their mother, in one of the best of many brilliant scenes in the film, admits to her husband that it doesn't take her a minute to relate to the grandmother what she did with her day, the grandmother is in a coma and becomes the sounding board for all their worries. But if you think three hours seems daunting, think again. You don't want these people to go away, ever. No moment is wasted, no scene rushed. The whole thing is an exquisite patchwork that leaves us drained but strangely uplifted. And if you have a dry eye after the final scene, it probably means that you're already dead. Hollywood! - watch and learn!",
            "review_date": "2001-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yep, this is pretty much perfect",
            "content": "Yi Yi begins with what seems to be a surprise wedding, and ends with an inevitable funeral, with everything in between those two events adding up to a perfect film.One character within this film describes how movies let people live 2-3 times longer than they ordinarily would, because of how movies let you experience things by seeing them play out on screen. Yi Yi basically explores this idea over almost three incredibly compelling hours by telling a number of interweaving stories within a family. And honestly, there are about half a dozen or so characters in here who could have entire films built around just their subplots. On top of that, all these stories interact in fantastic ways- sometimes obviously, sometimes more subtly.On top of that, the visuals are stunning (even though so many of the settings are so everyday), the acting is perfect, it's never boring despite its leisurely pace and lack of traditional action, and it was emotional enough to make me tear up quite a few times. Also, the music was so beautiful I kind of wished it was in the movie more- that's the closest I could get to anything near a complaint.And what a final scene, too. Almost guaranteed to make even the most hardened audience member tear up.Don't let the runtime scare you off- this is an absolute must watch, and somehow manages to live up to the hype.",
            "review_date": "2020-09-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "excellent film",
            "content": "Just as NJ in the film, I am a sales man that was not so successful. This film led me to thinking my experience of my life, my marriage, my job... I never thought of I was wasting time in the past, but now I couldn't say so. I am working day and day, doing the similar job, walking on the same road, but I don't know what I want ...I am thinking to change some thing. But what will happen if some thing changed? Will it be better? Will it be easier? What if it's the same as now? ...I don't know who can tell me about it.Maybe the god know.",
            "review_date": "2008-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yi Yi not eligible for Foreign Language Oscar",
            "content": "Fortunately I saw Yi Yi at this past year's Toronto International Film Festival (I would've either had to wait awhile or catch the next train to New York). It was the 37th and final film I saw at the fest, and it was my favorite one. I've been recommending it to everyone, and I've been following it's progress through this year's award season. Just this past week the National Society of Film Critics named it the best picture of 2000. The critic circles in both New York and Los Angeles have honored it, too.However, in a search that I conducted on the Academy Awards site for this year's eligible slate of nominees for foreign language film, Yi Yi isn't there. There are a record 46 countries with eligible films, and from Taiwan it isn't Yi Yi, it's Crouching Tiger, Hidden Dragon. That could mean there are three reasons for this: 1) Crouching Tiger beat Yi Yi when Taiwan voted for it's representative, 2) maybe Yi Yi was eligible last year, or 3) perhaps Yi Yi was first aired on t.v.(which I highly doubt) and is disqualified. So, I look up last year's slate of eligible films and Yi Yi is nowhere to be found. It looks like it's only chance is in the best picture category, but with Crouching Tiger the front-runner I doubt very highly that the Academy will find a spot for Yi Yi.That's too bad, because Yi Yi is a great film that moved and inspired me with it's grace and humility. I would have thought that maybe Taiwan would have played it's cards a little smarter by nominating Yi Yi as it's representative, trusting that Crouching Tiger would win a nomination in the best picture category. That way it would be able to boast about it's two nominated films, but instead decided to throw all of their eggs in the Crouching Tiger basket.What this amounts to is that I urge every fan of Yi Yi to champion this movie, recommend it to everyone, to strangers. Write about Yi Yi and e-mail your review of it to other filmlovers. I have an idea, take Yi Yi and pay it forward to three other people. When they come back to thank you for recommending such a powerful, life affirming film, tell them they can thank you by paying it forward to three other people to see, and so on.Why am I on such a Yi Yi kick? I think it's because it saddens and frustrates me to no ends when a quality movie gets overlooked and forgotten. Yi Yi is a prime overlooked and forgotten kind of movie (I venture to say even for filmlovers) because of it's running time and because it's from another country. This movie will eventually find it's way onto video, but by then, because it hasn't been nominated for anything, people might not chance it.Yi Yi (A One and A Two) is an epic drama, with a scope and vision about family life that is so clear that it's observations can translate to anyone. I loved the way the movie branches out and follows the different members of the family, and it gives us enough credit that we will make sense and draw our own conclusions and parallels accordingly. The movie doesn't tell us what to think, it just shows and reveals the thoughts and decisions and behavior of it's characters. Gene Siskel had a particular fondness for movies that gave us multidimensional fathers. He would have been proud of this film as it shows us a father who is dedicated to his family, loves his family, and even when he considers what might have been with an old love from years passed, I can only reveal that my gratitude for this film deepened considerably at his decision near the end of the film. I also enjoyed how the film showed us this father at work, where we see a series of scenes with another businessman from a possible company that the father might merge with. To watch these scenes unfold, the negotiating, the small talk, is to behold a movie that contains insight into aging and wisdom about life. Yi Yi is my favorite film of 2000.",
            "review_date": "2001-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Solid drama",
            "content": "RATED 7/10\nLanguage: Chinese\nFamily drama painfully slow. The drama is solid and the situations are so simple and so authentic. Each and every character and their relationships are presented very well. If you can bear the dead slow pace, you can enjoy this drama...\nOne time watchable...",
            "review_date": "2022-04-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece",
            "content": "An incredible epic of an extended family in Taiwan, caught in a tug of war between traditional Chinese loyalties and modern Western ambitions.  About love and death and identity and everything in between.  From the youngest child to the grandmother, each character is fully realized.  Full of surprises like a great novel, ranks with the best of DeSica and Tornatore.",
            "review_date": "2001-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "everything... something.",
            "content": "What do I mean by everything... something? It's an assessment of the feeling I have after seeing this film. I'm overwhelmed, I'm touched, I'm a little bit amazed... but I'm not sure what caused all this. More or less, Yi Yi is the story of a nuclear family and each member's individual experiences. The film follows each character over a short period of life (perhaps a few months, one year?) as the most significant moments of human life occur. In other words, a first love, wedding, funeral, birth, murder, reminiscence, recapitulation, and all the rest of it... There's something for everyone to relate to, whether you like it or not. Perhaps that's what touched me so much about the film. I don't think I've ever seen something that so delicately and meticulously examined the extreme experiences that members of different age groups and gender have in human society. And it's cute, and sometimes ironic, and well, everything. Comparisons to more popular films might include Magnolia, for example, or The Ice Storm. But the style, while not altogether original, also caught my eye. Yang never gets too close to his characters - we are kept at a distance. The viewer is purposefully detached from any sort of voyeuristic tinge. In other words, while the big Hollywood directors zoom in for their big moment-Oscar winning-Meryl Streep-running tears-extreme-close-up, Yang prefers to film such moments through glass, in reflection, in long shot, making visible only the character's back or profile, in the dark, etc. I really liked this movie. It is long, so prepare to be patient. But if you let yourself get involved, you will only want to see more when the film reaches its conclusion.",
            "review_date": "2001-07-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A visually impressive meh story",
            "content": "I have watched this movie some other time. And I have been impressed. I have no idea why. I have completely forgotten this one. I have went back without knowing because of Sean Baker. And watching it I got bored. And than more bored. And than I started to recall scenes. Scenes with faceless actors doing the same. And the movie was so long, by half time I recalled part of the story.The visual style is stunning. And it is spectacular in the way the director cheats and changes the scene. Take the old lady brought home to die. Each character interacts with her from a different angle. But the angle is not just another angle, many pieces are rearranged to show the same.Still, that is not enough to compensate for a bland story with too many characters. And I feel so sorry for the production team. Every scene is carefully crafted. The musician neighbor fights with a boy in front of the whole building. The character would have avoided both making a scene and doing anything explicit before an audience of neighbors, yet the scene is important to show the disconnect between the characters: they know too much, and yet so little of the humans around them. And this is underlined by the lack of sound. So sublime! Yet sublime scene after another leads to a long show saying nothing, leaving just the bitter taste of a blind emotion.A great movie and a waste of time at the same time.Contact me with Questions, Comments or Suggestions ryitfork @ bitmail.ch",
            "review_date": "2017-12-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disgrace to cinema.",
            "content": "Absolute garbage. The film is full of boring cliche \"love\" stories, most of it is soap opera quality. It's full of filler to stretch out the film as much as possible, I swear that I was watching it for eternity. The photography stuff would be interesting but it leads completely nowhere... The only event which actually had a proper ending was the balloon thing. Most of the storylines in this film lead nowhere or have very bland generic conclusions to them. The whole thing is very unmemorable and extremely overlong. Also, it's important to mention that there is quick child genitals flashing, considering that many people have seen this film, the kid might have been embarrassed by it later on in his life, so I count that as sexual child abuse.",
            "review_date": "2021-05-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A marvellous motion picture",
            "content": "Thanks to the Best Director prize at last year's Cannes Film Festival, and a more than passing similarity to Robert Altman's now-classic Short Cuts, Edward Yang finally sees one of his films receive the light of day in American theatres. Along with Hou Hsiao Hsien, he is the greatest living director whose films you have never seen. Take Yi Yi as your initial chance to introduce yourself to a true master. Then, if on a roll, get your hands on a copy of Brighter Summer Day, Mahjong and A Confucian Confusion.Yi Yi is the film that Altman's A Wedding should have been. The Altman film, a multi-character farce made three years after the more accomplished Nashville, tries to wax significant meaning out of the wedding ceremony but ends up as nothing more than a trivial hodge-podge of `Three's Company'-style bafoonery. The Yang film, comfortably akin to sitting before a fireplace during a cold winter night, bookends the bulk of its contents with two different kinds of ceremonies: the wedding and the funeral.Surprisingly accessible, at least in comparison to his prior work, Edward Yang's film is about as truthful a family film as your going to get. Much of the film's success lies in Yang's astute explanation of life's dichotomous nature. Yang-Yang, the youngest member of Yang's fictional family, is a boy desperately trying to grasp the duality of the world around him with the aide of his camera. He takes pictures of people's backsides because he wants to show them what they can not see. The boy's actions espouse the film's very philosophy: There is always a second side to every story and once the second side is perceived a character can achieve some sort of completion.This is nowhere clearer than in the case of Yang-Yang's father, NJ. The man is forced to confront the reasons why he abandoned his first significant lover at the alter once he and the lover work their way back into each other's lives through mutual business interests. Once he presents his case to the embittered woman he cleanses himself of a pain he has never spoken of and, in turn, faces a truth he was not ready to accept: that he is still in love with his old flame.Some might interpret the woman's departure after NJ's declaration of love to be somewhat vengeful, but there is something much more philanthropic to be read in her actions. Through his revelation she has learned to accept the fate that NJ set forth so long ago and she has, quite simply, returned the favor. What was done in the past can not be undone and the only thing NJ can hope for is a re-evaluation and improvement on the life he chose instead.NJ's life, ultimately, has come full-circle and with that comes the death of his wife's mother. The woman is the matriarch of the family, from whom everyone draws their breath. The most loving of these recipients is NJ's daughter Ting-Ting. Yang uses a flower as the symbol of Ting-Ting's enlightenment. Her classroom laughs at her because she over-fed the flower but the flower comes back to life after a very cleansing and beautiful encounter with her grandmother. It's a beautiful moment and Yang has an uncanny way of conjuring up an immense sense of urgency from otherwise simple objects.There is a great scene in Yi Yi where Ting-Ting breaks down for seemingly unforeseen reasons. When questioned by her father, she reveals that it pains her that her relationship with her mother consists of nothing more than two sentences spread out throughout the day. And this is at the essence of Yang's masterpiece, a film as culturally resonating and emotionally observed as the bleaker Short Cuts. It is a film of painful revelations and euphoric moments of happiness. It is a film of soft rhythms beautifully gliding over the lives of characters living their way toward personal enlightenment.",
            "review_date": "2000-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The meaning of life and what we see and don;'t see",
            "content": "Delicate and gorgeously filmed meditation on how we make meaning at different stages of life. Interlocking stories are full of interest--an unplanned pregnancy and marriage, a sudden illness, dramas at work and school-but the engine of the movie is not the many-petaled narrative but an underlying quest to, as the little son of the narrative focus puts it, \"see what you see and have you see what I see.\" Among the overlapping parts of the story are the contrast between a family driven by impulse and belief in luck and one where each choice is done with humility and thought; an elderly parent's coma pushes family members into an existential crisis; teen rebellion and teen love as a fragile tremulous flower, not a gaudy explosion; an old love--rediscovered--and the reason it ended rediscovered. While one family member literally retreats to a mountaintop to be with a guru (who in the end is as disappointing as the comatose materfamilias) others find insight from a video game designer and revelation in images of the napes of necks. We saw this three days ago and I am still replaying scenes mentally. If you have never seen this, put it at the top of your Netflix list NOW.",
            "review_date": "2007-02-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb Film",
            "content": "Overall, Yi Yi is without a doubt one of the best films I've ever had the pleasure to see. Its extremely subtle writing is exceptional - this is no conventional film with a conventional Hollywood narrative.Instead, it follows the lives of an ordinary family in Taipei - a family that lives through everything, beginning with a wedding and finishing with a funeral. Throughout this film are little rare \"moments' that you kind of notice in real life, but never think to yourself \"wouldn't that be great in a film?\" Well, Edward Yang has put it into a film, and he's done a very good job of it. The cinematography is actually one of the highlights for me - very simple, and in this age of ultra-fast MTV cutting, to have long one-take scenes where actors' performances aren't manipulated is a pleasure to see. Superb film.",
            "review_date": "2004-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A refreshing ride....",
            "content": "The last directorial work from Edward Yang, it manifests a refreshing account of a Taiwanese family amid a wedding ceremony to a funeral involving each member's grievances to troubled relationships and people around them. Shot in Taipei and Tokyo, the film goes for an inordinate length, but every frame feels refreshing and you never mind to take a nap and begin it again, similar to your favorite soap opera. The film takes place in a high end apartment of Taipei, a school, and the urbanscape of Tokyo. Whether a disturbed teenage girl or his eight year old boy troubled in school, their middle aged father with his failing firm along his old crush, the film captivates in its cool dissection of characters along the pleasures pouring throughout. One needs to watch it and admire it for themselves.Rating: 3 stars out of 4",
            "review_date": "2020-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "perfect melancholy...",
            "content": "People often complain films today don't care enough about their characters; or that the screen is filled with too many clichés. At nearly three hours, Yi Yi gives itself the time to develop and maintain elaborate realism and a delicate pace. The film is brilliant because it is composed of many small interconnected moments, not one contrived string of plot elements.The film includes grand moments such as birth, marriage and death, but most importantly it depicts everyday life. The wonderful cinematography quietly reveals modern and urban Taipei, a city whose architecture and landscape is as complex as its inhabitants. Yi Yi is a contemporary film which effectively shows the human condition all at once as precious and painful, ephemeral and imperfect.",
            "review_date": "2000-12-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A delicate and genuine portrait of life",
            "content": "There are two scenes in `Yi Yi' that could express this movie's essence. The first is a dialogue between two teenagers: when Fatty says that cinema is about happiness and sadness, Ting-Ting asks why then we go to the movies, if life itself is like that. In another scene, the 8 year-old Yang-Yang says he wants to show other people what they can't see, so he take pictures of their backs. The truth of `Yi Yi' is in both messages: on the one hand, it is a movie about life as life itself, about ordinary existence in a urbanized, middle-class, modern family in Taiwan (as much universal as any other family can be today); on the other hand, it is about different perspectives of day-to-day experience, and how people manage to interact despite their often irreconcilable personal interests, half-truths and dilemmas. Against the backdrop of today's mainstream cinema, intoxicated by spectacular plots, effects and characters, director Edward Yang's movie is a quiet blessing, with its deliberately slow though never boring pace, its Ozu-like use of the camera (as a neutral, fixed and often detached eye capturing daily life), and its delicate use of silence and glass reflections to better immerse us in the characters' doubts and choices. Few movies portrayed ordinary family life in such an authentic and convincing way (8/10).",
            "review_date": "2002-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Struggles of a Modern Family in Taiwan",
            "content": "Taiwanese director Edward Yang had already gained attention at the Berlin Film Festival in 1991 with 'A Brighter Summer Day', a very long but always fascinating tale about troubled youngsters in Taipei. In 'Yi Yi', however, Yang captured much more attention worldwide with this portrait of a middle-class Taiwanese family and its struggles to cope with crises and bereavement. 'Ordinary People', Robert Redford's masterpiece, had earlier succeeded in this quest. The nature, tone and pace of the two films differ a lot, but the stories could be easily be transposed in their settings (suburban Chicago and Taipei).Yang deserved to win the Best Director award at the Cannes Film Festival by transporting us through his camera into the lives of the middle class Taiwanese family and seeing through their eyes. Wu Nien-jen conveys the shifting moods of the father, N.J. Jian. N.J. has a successful career but a dead marriage with his hysterical, increasingly remote wife. We feel his excitement in meeting his old sweetheart, his confusion over what to do, his guilt after he betrays her once again, and the awkwardness of his efforts after that to reconcile with his family. Some of the story is introduced through the still camera of his precocious, inquisitive ten year old son, who likes to freeze-frame people at a distance in their social situations. Then Yang's lens takes us into their lives. His teen-aged daughter in her first romance is introduced to betrayal but overcomes this tough initiation. At the end, when they gather together in the memorial ceremony for his mother-in-law's funeral, they have all learned a lot, even his wife who had fled to seclusion at a Buddhist order. One scene sticks in the memory. When N.J. has his rendezvous at the international airport in Tokyo with his first love, Sherry ( so well-played by Ke Suyun), she comes off the plane without her contact lenses on the long flight from the USA. Through her spectacles, we can see her eyes glowing with rekindled love. What kind of rat could betray her again? Yet, he's not a philanderer\u0085..only confused and prone to mistakes.At the end of the film, much is not resolved\u0085.just as in 'real life'. Yet, we have hopes for this troubled family. They not only have learned a lot but will try to hang together. They care for and need each other.",
            "review_date": "2004-09-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yang's film is essential viewing for anyone who wishes to see a slice of themselves on screen, portrayed to a very realistic effect.",
            "content": "The passing of a great filmmaker is always greeted with sadness. Edward Yang was no exception. One of the most influential of Taiwanese filmmakers, Yang belonged to a class of film directors whose films resonated strongly with the society he lived in. He made a number of pictures during the 1990s, but his most lasting legacy was Yi Yi, a film released at the turn of the century (or millennium if you will), which, through the perspective of a single, but extended, middle-class Taiwanese family, provided viewers with an honest and insightful reflection of living in a modern, technological age.Structured around three very important cultural ceremonies, namely the wedding, the baby shower, and the funeral, the film brings as many characters as possible to the fore, and then breaks them up into smaller \"units\" for an in-depth study of their lives. This congregation and dissection of characters is the reason Yang's film is essential viewing for anyone who wishes to see a slice of themselves on screen, portrayed to a very realistic effect.Expertly developed, the elaborative narrative may seem deceptively complex but it is really just a series of simple observations of daily occurrences spliced together on film. Shot with honest objectivity, Yang's film sometimes also spotlights on the subjective emotions of certain characters, most notably that of Yang Yang (a somewhat reserved boy with a camera), his school-going sister (who discovers the fleeting emotion of love for the first time), and their morally-guided father (a mid-level boss of a corporation who meets an old flame).Of course, in a film like Yi Yi, which spans nearly three hours, these characters are multi-dimensionally developed. So much occur in their lives that their ups and downs captured in Yang's film are merely a \"cross-sectional\" view of their current circumstance. Apart from the above-mentioned cultural ceremonies, another common point that ties all the three main characters together is the grandmother, who suffers a nasty fall and enters into a coma. Interestingly, the unresponsive grandmother becomes sort of a \"human mechanism\" for catharsis, especially for the father and the daughter.Yang Yang, on the other hand, refuses to talk to his grandmother. He reasons that she is old and would probably know everything he would say, so why bother telling her things that she already understands. His relationship, or the seemingly lack of one, with her would become immensely meaningful towards the end of the film, cumulating in Yi Yi's most touching and thought-provoking moment – the recitation of a piece of self-written text by Yang Yang to his dead grandmother during her funeral.In quite a number of scenes, director Yang employs long shots to keep viewers a certain distance away from the characters. Although we could hear the (slightly fainter) dialogue, we are unable to observe the subtle facial reactions that would help us to register the feelings of these characters. In other instances, Yang uses mediated images, like that of a security camera, to capture the movements of the characters, highlighting the increase in surveillance in today's society.Yang also makes use of glass panels (of windows, doors, and walls) to create a \"double-screen\" effect. These glass panels give an added screen to the lens of the camera, further separating the viewer from the actors, forcing upon us the role of a \"contemplative observer\" as opposed to being a \"willing participant\" in the lives of these characters. The dual reflection of objects within and outside these glass panels sometimes produce naturally superimposed images; this is most beautiful during scenes shot in the night.I feel that Yi Yi's most important message comes from Yang Yang's camera, which is given to him by his father. He takes pictures of the back of people's heads, reasoning that these are images that people could never see, and explaining that a person's view of the world is always halved (i.e. never complete) because of this. This change in social perspective from an innocent boy after receiving the camera parallels that of the director's use of the film medium to reveal that life is often treated with so much subjectivity that an objective worldview is sometimes difficult for us to fathom. In three hours, Yang conveys that message very convincingly. But three hours is never enough for something that often takes us a lifetime to recognize. There is a word for it – it's called wisdom.SCORE: 9/10 (www.filmnomenon.blogspot.com) All rights reserved!",
            "review_date": "2010-09-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An interesting film - if you can stand the Pinter-esque pauses",
            "content": "While the premise of Yi Yi (Chinese for `A One and a Two') is very intriguing and endearing (it follows as Chinese family through their happiness and their travails) I found myself alternately interested and bored.  There are certainly enough characters and various scenarios to make the film fulfilling to a certain extent, but it suffers from incredibly long silences, pauses and characters looking off in the distance for fairly extended periods of time.  I actually watched this film in two parts \u0096 The first time I managed to get through a little over two hours until I was ready to fall asleep, (not an easy feat for me, I've sat through `Birth of a Nation' and `Andy Warhol's Empire' without nodding off) so it wasn't because I have a short attention span.  Rather, I believe that the pacing was simply a little slow.The character studies in Yi Yi were indeed fascinating, and were the best part of the film.  When we see beyond a particular character's surface, much like life, we find that there is a complexity and surprising depth to each. The character of the little eight year old boy in particular, while in the film fairly infrequently, is by far the stand out star.  His incredible curiosity and ability to essentially function on his own as he makes his way through daily life is a revelation to witness.  *Spoiler Alert*For example, his father finds a roll of film his son shot that's subject matter solely consists of the back of people's heads.  Due to the nature of the father and the circumstances at the time, he did not ask about them at that point; rather his son gives his Uncle's picture to him saying in an offhand and innocent manner as he walks away, `This will help because no one knows what the back of their head looks like.'  Meanwhile, the father simply smiles and mumbles to himself, `That's why'.It is moments like this that made me want to `endure' the sheer length and slow packing of this film, and they certainly are the reason why I ultimately look at this film favorably.  Yi Yi is not a film one can breeze through, but its subtlety and charm make it recommendable in the same vein as ensemble films like Paul Thomas Anderson's `Magnolia.'--Shelly",
            "review_date": "2003-12-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Je m'ennui",
            "content": "Once again misled by the laurels on the DVD cover.I should know by now to avoid films that arty critics rave about. The same with The Tree of Life, totally overrated typical of arty Venice film festival Palme d'or winners. e.g. ,Blue is the warmest colour, The white Ribbon Leave etc; Leave domesticity and art to the French its their forte. But this film all so depressing overlong and meanders. No wonder it was not released in Taiwan. And it means one one not One and two or either some ones name. I am a great fan of Asian films but this one does not even begin to touch The Professors favourite Equation (, The House maid, Ip Man, Assembly, My sassy Girl, Hello stranger, Money not Enough. These films not only entertain but give us a great insight to Asian thinking and society without the depressing slowness of Yi Yi",
            "review_date": "2013-09-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A One and a Two",
            "content": "Featuring in the book 1001 Movies You Must See Before You Die I was naturally going to watch this Taiwanese film regardless, and I was prepared to sit through a nearly three hour length if it turned out to be good. Basically this film is all about the Taipei family, focusing on three members of the family and their perspectives as they go through various difficult, meaningful and poignant moments in life. These are the middle-aged father N.J. (Nien-Jen Wu), young son Yang-Yang (Jonathan Chang) and teenage daughter Ting-Ting (Kelly Lee), as they start the film with a wedding, and the conclusion is a funeral. So N.J. has a job he is unhappy with, and desires to make a big deal in the Japanese video game industry, and unable to get his partners all on side he finds support from software mogul Ota (Issei Ogata), and he has former lover Sherry (Su-Yun Ko) trying to enter the fray. Son Yang-Yang is having trouble with teachers and stuff at school, and his daughter is in a love triangle with a neighbour and her troubled boyfriend. All this goes on while N.J.'s old mother in law is in a coma, his wife left for Buddhist retreat after having a midlife crisis, and overweight brother in law Ah-Di (Hsi-Sheng Chen) marries a film star and has to deal with extended family. I will be completely honest and say that I did not fully understand everything going on, because it has so many layers and situations to take in and make sense of. Also starring Elaine Jin as Min-Min, Adriene Lin as Li-Li and Pang Chang Yu as Fatty. I think the length was a slight issue for me, and it did add to the fact that I didn't know everything that was going on, but for some really good visual stuff, some interesting dialogue to see and listen to (a little English) and some social realism it is a watchable drama. Very good!",
            "review_date": "2011-08-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Loving and dying in Taïpei",
            "content": "Taking place in Taïpei, this movie tackles the issue of the birth, life and death of the love feeling. From childhood to the grave, the director Edward Yang follows all the emotional steps. Innocence, doubt and finally wisdom are the key words of this movie. Filmed through reflections, mirrors and windows, it shows with subtlty the private life of its characters. It also deserves the \"Prix de la mise en scène\" it received> this year in Cannes. Watching all these destinies in front of> our eyes is a pure three hours long pleasure. Asia is definitly the place to follow at the present time for good and original films (Suzhou River, In the mood for love...)",
            "review_date": "2000-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Think \"Magnolia\" but better",
            "content": "Similar in theme and length to P. T. Anderson's \"Magnolia\", \"yi yi\" really shows up the defects in Anderson's film. The construction is tighter, the characters more real and the sentiment less overblown. The result is a truly enthralling portrate of a middle class family trying to get on with their lives.",
            "review_date": "2001-11-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sweet, heartfelt, and poignant",
            "content": "\"He says you're doing well, I'm so glad. Before, I'd heard your life was tough. I felt it might be my fault. You asked why I vanished without a word 30 years ago. There were many reasons. Now they all sound stupid. I'm glad that you have a good life. I'm really happy for you.\"The film's slow pace and style takes some getting used to, and at 173 minutes it's too long, but director Edward Yang builds a layered story about life that is sweet, heartfelt, and poignant. I absolutely adored the yoda-like character of Ota (Issei Ogata), the wise Japanese businessman, and the little boy (Jonathan Chang) who takes pictures of the back of people's heads because they never see that side of themselves. The old flame of the father showing up (the pair played by Wu Nien-jen and Su-Yun Ko) leads to deeply heartfelt conversations about how they didn't end up together in life, and how neither one of them ever forgot the other. I like the little parallel Yang slips in with the two remembering their first date and the man's daughter (Kelly Lee) seeing someone herself. However, the number of times one of the characters in this subplot (or others I haven't mentioned) go off in overwrought ways seemed a little high, and I'm not sure all of the melodrama worked.The aged grandma, laying immobile after a stroke, anchored the film for me; even though she's not on the screen all that often, I always felt her presence. Her extended family carry on with all the facets of their life, struggling with those around them, with their own regrets for the decisions they've made, or just trying to be upstanding, \"good\" people, but through her we have a reminder of what all of that ultimately comes to. When they talk to her at various times about their life and never get a response, it's almost as if they're talking to god, or to the universe which simply doesn't care. Yet this isn't a solemn or depressing movie, it's just a portrait of a family, one with a broad range of situations and emotions that seems bound to connect with viewers in one way or another.",
            "review_date": "2020-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A 21st Century Masterpiece.",
            "content": "It begins with a wedding and ends with a funeral and you might say that inbetween all human life is there. Edward Yang's masterpiece \"Yi Yi\" is a film about family or families, each with their own set of problems, each with their own reasons for getting up in the mornings and getting on with life. Yang's genius is for taking what we think of as the mundane and showing us just how much real drama there is in what appears to be routine. Domesticity, business, religion, sex and education are all interlinked whether you're old and close to death, middle-aged and wondering if you've made the right decisions in life or very young and questioning all you see or perhaps don't see.This is a funny, serious and often very moving picture where almost everything that happens is instantly recognizable. These are people we all know and have met at some stage in our lives. It has a large cast and it's beautifully acted, (and as the little Yang-Yang it has in Jonathan Chang one of the great child performances). Yes, there are story-lines here that we would call melodramatic when Yang borrows liberally from the kind of American films Sirk or Delmer Daves was giving us in the late fifties and early sixties yet this feels perfectly in keeping with his vision of cinema as a whole and at three hours it certainly has the feel of an epic but I wouldn't want it a moment shorter; if anything I could have spent another hour in the company of these amazing, everyday people. Great cinema and worthy of all the praise it's received.",
            "review_date": "2022-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Life and how to live it",
            "content": "A heartbroken grandma suffers a stroke on the day of herson's wedding. A teased child drops a water balloon on atyrannical teacher's head. A cold, introverted businessmanbumps into the lost love of his life outside an elevator. A girlcatches her mom in bed with her English teacher. And agreat many overweight men neurote about whether or not abusiness deal will go through.Edward Yang's YI YI is a unicorn among movies--a masterpiece that grapples with birth, death, sex, love, andthe whole damn enchilada, yet nothing in it is hammy, self-punctuating, imprecise. Unlike such recent American\"epic\" narratives as HAPPINESS and MAGNOLIA, YI YI seeks to get out of its characters' and incidents' way.Though Yang is an extraordinary stylist (dig the shot of alonely woman in an office building, framed by the jolt ofsome just-turned-on fluorescent lights), he doesn't spendany time or energy telling you that he or his movie is thegreatest thing since cheese. He goes right to the heart ofhis scenes--and the result is a near-unbearable power.\nThere's an incredible relief in seeing a movie that doesn'tfeel the need to lean on any genre crutches. Its structure isastoundingly subtle and complex, yet while you're watchingit just feels as if life is making itself up as it goes along.And Yang gets every damn thing right: a scene in which twolovers, separated for thirty years, reunite again, tender andrespectful, suddenly turns messy and abrupt and violent,and you realize how easily you'd fall for the soft, affectionateversion of the scene--until Yang gives you the true version.YI YI makes most of the moviemaking of the last few yearslook cheap and hatefully self-important. It has gatheredcorrect comparisons to Renoir and DeSica, but it has anexcitement and a fullness that recalls movies like NASHVILLE and GODFATHER TWO.  (Unlike those two movies' venerable makers, Yang betrays no traces of theflashy or the hip.) YI YI is as good as it gets. If this moviefinds an audience, a miracle will have taken place.",
            "review_date": "2000-12-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful movie....",
            "content": "A beautifully shot movie.  Multiple relationships were carefully interwined.  And the consequences of every choice made by each character were laid on for the audience to see and judge.  The most fascinating relationship was the one between N.J. and his ex-lover from highschool.   Don't we all wonder at times if our more simple past is better than the complex present.?  but was it truly simple?  could clock really be turned back?  don't we all have to live with the consequences?",
            "review_date": "2003-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Slow and rewarding",
            "content": "This is a very long film but everything has its place. We follow the lives of many characters across different periods of their life. Although they are not individually remarkable, the film overall has a meaningful impact. It feels insightful to be part of so many strands of humanity at once.",
            "review_date": "2020-06-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Quaint is becoming my favorite word",
            "content": "For this movie is indeed quaint. Everyday life in a world of everyday people, yet not an everyday movie. It is slow paced... well, dwelling actually. It has all sorts of absurdities but all left at the edge of the screen out of harms way. It has characters annoying beyond belief. It has characters almost unbelievably sympathetic. It manages to make us care for the main characters regardless which of these categories they fall into and more importantly it shows us that the clichés we are so willing to tag onto them simply do not fit once we know them. Okay, some are right-in-your-face type of displays such as a Japanese playing Chopin in a Karaoke bar, but still.The only problem with this movie was a tendency to parallelize too obviously albeit not very convincingly; completely linking together the lives of all the main characters.Thomas Nielsen",
            "review_date": "2004-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "American Beauty meets Kieslowsky, set in Taiwan",
            "content": "The last thirty minutes of this film left me speechless. What I most enjoyed were the philosophies on film and life which flowed through it. The film concentrates on three main characters. The father is in that American Beauty mid life stage where he has become dissatisfied with many of his life decisions and in this case has the rare opportunity to go back and reexamine the next best thing. At the same time his daughter is starting to reach out into the world and discover its complexities in much the same way her father did thirty years before. The other key character is the eight year old son, who displays childlike wonder at the world he is just discovering. This movie is American Beauty meets Keislowsky, set in Taiwan.",
            "review_date": "2000-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I am perplexed with all the acclaims.",
            "content": "It is a very dull movie to me. The movie does not reflect any resemblance of Taiwan's social reality at all.",
            "review_date": "2018-11-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "nice detailed texture, wistful",
            "content": "This movie ends up with a somewhat puzzled, slightly affirmative view of life -- rather like American Beauty, except that it's a lot better movie. Excellent acting and nice shots throughout. Some of the plot strands were reminiscent of Eat drink man woman.",
            "review_date": "2003-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful, stirring and revealing.",
            "content": "Yi Yi exceeded all my expectations.  Life is just a game, but what are the rules.  These characters cross all boundaries to show each of us something of the other.  Shoot me as I drown in cliches.  Three hours of absolute involvement.",
            "review_date": "2001-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Transcendent Existenialism, now and forever, the only frontier of commercial cinema",
            "content": "Mass audiences or even art-house audiences being even less conditioned now than they were in the late '60s to take the next step forward and accept completely non-dramatic personal films in the \"synaesthetic\" sense that Gene Youngblood described 30 years ago in the famous book \"Expanded Cinema,\" most current 'mainstream-art-house' (whatever the hell that means, although I see absolutely no reaon why this film shouldn't be a success with mass audiences if only they had a little patience) cinema is basically doomed to forever repeat the best of its past achievements in new settings and configurations: always illuminating to be sure, especially when an accomplished artist like Yang or Tavernier or Rohmer is at the helm, but nothing new.And, of course, there's nothing new in Yang's excellent film \"Yi yi\" that hadn't already been done by the time of Bresson's \"Diary of a Country Priest\"; that is, an existentialist film that has many transcendent elements and becomes much more than itself. The reason later Bresson films like \"Mouchette\" and \"Pickpocket\" don't reach the level of \"Diary of a Country Priest\" is because they are much more purely existentialist and lack enough transcendent 'poetic' elements. The same is true of Paul Schrader's films; there ain't no way in hell \"Affliction\" is on the same level of \"Blue Collar\" and \"Hardcore\" or even \"American Gigolo,\" simply because those films temper their necessary existenialism with transcendenct aspects throughout that make the films dreamlike, mythic, beyond themselves.\nYang is on a similar wavelength here philosophically speaking to many of the great directors who came before him, because all their best films are precisely existenialist cinema that transcends itself. \"The 400 Blows,\" \"Boudou Saved From Drowning,\" \"The Rules of the Game,\" \"The River,\" \"L'Avventura,\" \"Taxi Driver,\" even most of Chaplin's and Tati's comedies, the list is very long and illustrious. In Yang's \"Yi yi\" the little boy is one of the transcendent symbols among the existential anguish of his elders' lives, and his perspective is that of the spirit that transcends; the constant Antonioni like intrusion of 'the trees and nature' on urban life, the way Yang structured the shots, their juxtaposition, as well as what goes on inside them is also reflective of a balancing act between the transcendent and existential, the yin and the yang. Like in most Chinese and oriental films, things do seem to get a little too sentimental at times and sometimes you want to reach into the screen and slap some of the syrup out of the characters.  The film was shot entirely on Digital Video and unfortunately looks a little grainy (unlike Agnes Varda's fantastic looking \"The Gleaners and I\" also shot mostly on DV), but Yang's sharp and aesthetically cultured eye more than makes up for it, as he offers up great shot after great shot, however grainy and annoying.  The influence of Antonioni is unmistakable throughout and also that of Jacques Tati, not surprisingly, whose \"Playtime\" is one of the most profound films about modern life ever made. Above all, what I liked about Yi yi, was the fact that unlike Wong-Kar-WAi's endless, silly remakes of Godard's \"Breathless,\" there wasn't a single disorienting 'poseur-modern' jump-cut or a single gun fired or even displayed in the entire film.",
            "review_date": "2001-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A remarkable and moving film",
            "content": "If you enjoy films in which the characters talk to each other (or sometimes just listen), you will enjoy Yi Yi.  It is a film concerned with the domestic space but it is certainly not a soap opera.  There are no judgments made and I think you can see the film as either full of overt symbolism or simply an observation of the accidental beauty that life is full of.  You can either say \"nothing happens\" (when is the last time something happened to you anyway) or you can say \"something is always happening.\"",
            "review_date": "2003-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow.",
            "content": "This was an AMAZING film.  It is true that you must have a certain amount of patience to view this film -- but if you appreciate beautiful, lyrical storytelling, you won't be disappointed.  I don't have a single complaint.",
            "review_date": "2001-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Too long and too dry to enjoy.",
            "content": "I consider myself, not a guy that just likes watching films, but a guy that loves films and spends most of my time and energy watching and learning more about different films.I had heard about Yi-Yi from the amount of praise it has, especially since many different YouTube film channels I follow praise this film like no tomorrow. I noticed the film was 3 and 1/2 hours long so I had to wait a few days to really clear my schedule to watch it in one sitting and all I can say is that it was a VERY LONG 3 and 1/2 hours.For starters, the film lacks any real character development, I couldn't really connect with any of the characters because there was too many characters in the story to follow, many of whom are very monotone and can not really sympathize or connect with. It's very difficult to point out the main character, there's so much juggling around with characters that you would think it would be the dad because we follow his story the most, but then you would also think it's the little boy because he's in the cover and we follow his story for awhile. This film's character development is all over the place.Next is the plot, oh my god, it felt like I was watching a soap-opera without a narrative story. Don't get me wrong, there are plenty of films that use this non-narrative plot where the plot of the film is juggled between multiple characters and juggle the narrative of the film like Pulp Fiction, The Squid and the Whale, Magnolia, and many others. However, this film lacks any really story, it's like you're just watching the daily lives and struggles of this middle class family. Because of that, there's not really much to walk away from and in turn leaves the movie to be a very boring story. I think the movie tries too hard to be a deep movie using very simple dialogue and scenes for example, the kid and the dad talk about seeing what the other sees, but the kid points out that the dad can't see what he sees and he can't see what the dad sees, saying that they both wouldn't understand each other's perspective, and this leads to the son getting a camera and taking pictures of the back of peoples heads so that they can see what they can't see. I literally have no idea what the point of that was.The camera work is okay, there is way too many long takes and long shots in the film that it makes up atleast 30 minutes of the monstrous run time of the film.My advice, unless you really want to see for yourself and maybe get a better insight of the film, be prepared to either become wowed, or bored out of your mind.",
            "review_date": "2020-11-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny, sometimes shocking, and always poignant, Yi Yi is a masterpiece by one of the towering figures of world cinema.",
            "content": "Three light-on-its-feet hours long, the film starts with a wedding, ends with a funeral and in between captures what seems like a lifetime of experience. The story is about the emotional struggles of a businessman and the lives of his middle-class Taiwanese family in Taipei seen through three generations.Yi Yi: A One And A Two is a marvellous multi-generational drama from one of the leading lights of Taiwanese cinema Edward Yang, hovering at a delicate remove from its characters but conveying volumes about their hopes and disappointments. The film won for Yang the Best Director Award at the 2000 Cannes Film Festival, where it also debuted.",
            "review_date": "2009-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the greatest films of all time!",
            "content": "It's not only the best film of the year, but also the greatest film of all time. This is a great work of art so you should see it again and again like Beethoven's moonlight sonata. This film could be made by a man who has a profound insight of man's soul. Thank you Mr. Yang.",
            "review_date": "2001-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A film filled with reflection",
            "content": "A three hour film that addresses the love affairs we don't have and the words we don't say will be difficult for some. Additionally quite distant shots, silhouettes in the dark and static cameras will make for a subdued experience.And one that I largely enjoyed. As the comments here are quite divisive, I'm not sure what a proper litmus test will be for others considering this.I can say I felt like it was an adaptation from a book, which I offer as further praise to director/writer Edward Yang. We have several characters facing their own challenges and choices, and all growing. This is done without messages hammered into viewers' heads nor squeezed from their hearts.Many champion the precocious young boy; his portrayal is a nice mix of blank but bright; however, I suspect its the cleverness of his actions that we appreciate so much. That we want to identify with. I found myself more captivated by the interactions with the Japanese businessman Ota. Far from a sarariman prototype, he is a philosopher king in a generous not condescending manner. The subthemes he helps to introduce including the importance of risk-taking, dignity in corporate dealing, and attention in card dealing all sparked me. Actor Issey Ogata's rendition of Ota was charismatic and energized an otherwise rather reserved film. Does the fact that his lines were in my native English favor him? I don't think so. Body language and expression were outstanding too...but his halting English did add to the notion that he was trying hard to be more present in his time with N.J.This is a film that is both full and empty...one shot of an empty inner doorway is used repeatedly. One scene I feel compelled to recall has the husband, N.J. standing in that very doorway while his wife tearfully gasps and grasps at some of her emptiness in regards to her mother. N.J. lets her complete her thoughts, she then hides her eyes/face behind her hands...only then does he quietly close the door behind him, and offer her a very pragmatic potential solution to the symptom but not the effect of her problem.That pragmatic suggestion is utilized later (via a salient mention of Dr. Wen Ho Lee), but the actual solution comes via his wife's own actions. A retreat inward to the country, and outward from the dizzy city reflected in the window of their apartment as we are shut out of that scene.Reflections mentioned in other comments are indeed used generously. When other films might toss in a voice-over or zoom in for a toothy close up to shout what is in the characters mind, these reflections reinforce the distance between us and that character.I think that distance helps to explain the disparity in comments here (also in some drawing of themes for positive reviews that I did not share.) Thus maybe that is the test for seeing this...if you can respect, or better yet, enjoy being reminded of your remoteness in fairly intimate film. Even in listening to commentary, Yang himself was very reserved in what he presented. One other comment that I've used regarding some books before. I appreciate the Jenga nature of a good multi-story. You can remove some scenes, and the plot still stands...those scenes are not integral, but nonetheless illuminating. This film had many of those for me.7/10",
            "review_date": "2003-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful masterpiece.",
            "content": "Absolutely perfect in every sense of the word. I went into this film with huge expectations and it still blew them out of the water.\nI don't know what my all-time favorite final scene is, but this is definitely a contender.",
            "review_date": "2019-09-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you rent it you will probably regret it",
            "content": "I have strong feelings for this film. Strong enough to register at IMDB to post my comments. I rented Yi yi because the box said \"Best film of the year!*\", where * denoted dozens of critics. So I prepared myself for the night of wonderful cinema, but was hugely disappointed. The film starts e-x-c-r-u-c-i-a-t-i-n-g-l-y slow, and continues at this pace till the end. Perfomances seems terrible to me (with notable exception of Mr. Oka); for example the main character just stares with emotionless sour expression on his face the whole film, not uttering 100 sentences for the entire movie. There is no single focal idea in the film, with the exception of comatose grandma with whom every other member of the family MUST have to have their uninspiring monologue. Cinematography is uninspiring as well. After watching the movie it felt like I watched six 1/2-hour episodes of  soap opera. It's not that I did not like this format, just the movie is terrible. I can recommend some movies from  Takeshi Kitano (Fireworks, Kikujiro, Sonatine) as an alternative to the pompous cinematografic mish-mash Yi yi represents. My score 1 out of 10",
            "review_date": "2001-07-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Oriental \"Magnolia\"",
            "content": "A beautifully crafted, wonderfully acted, soap operatic \"slice-of -life\" film that should please any fan of international cinema looking for something poetic, deeply moving, and dramatically satisfying.  The intertwining tales of Tawainese families in an upscale apartment building work on every level and leave a viewer contemplative and happy that they took a chance with this Asian import.",
            "review_date": "2002-10-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Frank and leisurely family narrative with endearing characterizations",
            "content": "In late December 2000, I saw \"Yi Yi\", a film that had earned Edward Yang the Best Director prize at Cannes Film Festival.  I enjoyed this frank and leisurely narrative of various members of a family in Taipei, and how life events, including birth, marriage, and death, are experienced.This is a lovely film, which kept my interest through its 3 hours. It features endearing characterizations, particularly of a reserved businessman, N.J. (Nien-Jen Wu) and his two lovely children, the kind and responsible Ting-Ting (Kelly Lee), and the young curious but quiet Yang-Yang (Jonathan Chang).  I also enjoyed the role of Japanese businessman Ota (Issey Ogata), who understands both tactics and strategy and can see business in an appropriate context, such as when he encourages N.J. to take most of his business trip to Tokyo to pursue a personal matter of the heart.What is the message of this film?  Perhaps it's a reminder that regardless of culture or country, all humans share common emotions about our journey through life.  But this is a film where, for me at least, any explicit message was less important than the atmosphere and candor of the story. There were a (very) few elements of the film that I didn't understand, such as how a new father ends up in a palatial home and what his involvement is in collecting debts owed him, but that may be due to reading the subtitles. I hope to see this again, once it's on video.",
            "review_date": "2000-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One plus two equals..",
            "content": "Just as South-Korea so has Taiwan risen to the world of cinema in the beginning of the 21st century and Yi yi (A One and a Two) by Edward Yang is one of the top films of Taiwan. Many critics, magazines and sites have listed Yi yi in the lists of the best films of the decade and due to that the film has gained quite a reputation. But the reputation doesn't mean that this would be an easy treat or a pretentious art-house flick. Win of the best director at Cannes and plenty of other trophies for Edward Yang have just proved how talented he is. Just as in Paul Thomas Anderson's Magnolia (1999) in Yi yi the situations build around family rituals; weddings, funerals, births and divorces. But at once I must say that one cannot even compare Yi yi with Magnolia, many have but I think they're competing on very different calibers. Yi yi is much more insightful, impressionistic and intimate compared to its western companion.An honest man, who is the shareholder of an IT company hears that his mother in law has sunk into a coma the same day his brother in law is getting married. This shakes his family, which includes his wife, his 8-year-old son and a teenage daughter. The doctor recommends them to keep company for her and different kind of confessions and explanations bond the stories of the characters together.Yi yi is a family saga, a chronicle and a study of the agony caused by performance pressures. Most of the story is set near a high block of flats and the halls of it, which is full of rich residents. Edward Yang's film is a fascination of impressionistic imagery; the reflections on the windows, the precisely considered pictures to the silhouette of high buildings and the traffic jams. His 'mise-en-scene' is amazingly well handled and he comes close to Bressonian geographic perfection where each image has a meaning. As Eric Rohmer has said film is art of state and the state of Yang's film tells us about rootlessness and agony. The visuality of Yi yi is very subtle - Yang uses a lot of inappropriate long shots when he shows us the chores of his characters, outside the room, behind the window filled with distressing reflections of the city and the traffic. So the postmodern architecture works as a way for Yang to tell us something about the lives of the characters.Edward Yang's film is a quality film for its style, but also for its purpose and contents. It's quite a philosophical film filled with ontological riddles: How can we see the whole truth, why am I me and not you. Yi yi is a film about generations and it forces the middle-aged characters to stop for a while and think about their lives; the choices made and the consequences to come. It challenges its viewer to think about the eternal question, the meaning of life and in an unique way.The urban aesthetics of Yi yi is gorgeous and the fascination Edward Yang feels for the high buildings, traffic and reflections is astonishing. At times the way he uses the state of film, resembles me of Jacques Tati's Play Time (1967). Filled with beautiful, gorgeous images Yi yi is a film about life and reality. If imitation is the highest form of flattery, then Yi yi truly is an 'Imitation of Life' and sometimes an imitation can be greater than life itself.One and a two.. what does the easy dilemma of one plus two equal. It certainly sounds easy but perhaps it's not. The meaning of life - the eternal dilemma. Edward Yang doesn't offer any answers for his audience but he does give a lot of thinking to do, while he is studying the dilemma himself. Yi yi is without a doubt a great film for its content, style, philosophy and purpose.",
            "review_date": "2010-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "why is it shot so wide?",
            "content": "I'm amazed that there is only one comment from all the critics and commentators about how this movie is shot: there are no close ups and the camera is always static.Emotional involvement in movies is often engaged by close ups of peoples faces or even important (iconic) objects. All the encounters, and even the characters' private moments in Yi Yi are shot very wide (often absurdly so). All movies nowadays use moving cameras to create pace and exitement and interest...whether the camera dolly is simply on rails, or on complex jibs or cranes...or steadycam..or just handheld. In Yi Yi most shots are static and the few remaining have restrained pans. The conventional movie language of establishing  a scene quite wide then cutting to tighter shots as the emotion developes was completely and consistently ignored (subverted?).The above stuck out a mile for me and there must, obviously, be a reason why it was made like this. I can't figure out why. I can appreciate that the movie was structured to give us time to absorb and reflect on the characters and their situations, but it left me frustratingly uninvolved at times.Maybe, as an audience, we were supposed to be voyeurs of the characters rather than involved with them (this would fit in with the numerous  shots via reflections, through windows, and from corridors with no view of the action).But, if so, why?..especially when the content appeared to invite us into very intimate moments in the characters' lives.I'd be interested in your comments.",
            "review_date": "2001-04-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A moving portrait of a family struggling with all that life holds.",
            "content": "Edward Yang's mix of long shots and static camera positions give this film the voyeuristic feel of a Frederick Wiseman documentary. Combined with Wei-han Yang's stunning photography and excellent performances by the cast, the effect is a compelling, intimate look at members of an extended family struggling with all that life offers. The stately pace with which the complex relationships unfold over the 2 hour and 53 minute running time along with poor subtitles may put off many American viewers, but the result is memorable film-making. (Have I mentioned that I love this movie?)",
            "review_date": "2001-07-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perhaps, you don't have be Taiwanese to appreciate this film!",
            "content": "I first read the review about this film on New York Times a while ago but didn't have the chance to see it until recently. Being Taiwanses, I have the full advantage of understanding every word in the film. Even so, I was reading the subtitle along and thought they did a good job with the translation. The only complaint that I have about the subtitle is: it is hard to read sometimes. Nevertheless, it didn't diminish the superb quality of the film.I love it from the beginning until the end. There are moments filled with excellent shots: the reflections on the mirror/windows are my favorite. And I especially like \"Yang Yang\"--the 8-year-old is so naive and cute but his observations about people and life are simply astonishing. The acting by this boy reminds me of Victoire Thivisol in \"Ponette\".I was surprised to find out that \"Yi Yi\" didn't get nominated for \"Best Foreign Film\" for the Oscar. Instead, \"Crouching Tiger, Hidden Dragon\" was on the list. Honestly, I hated that movie when I saw it. Too me, \"Crouching Tiger, Hidden Dragon\" was made for the Western viewers who know little about the spirits of the Chinese martial art and philosophy.After watching \"Yi Yi\", I was so moved and proud to be Taiwanese. It gives the audience a good \"insight\" of modern days' life in Taiwan.Life might be complicated but it is never without hope. A true masterpiece!",
            "review_date": "2001-07-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "About things in front and in the back",
            "content": "Loosely translated \"Yi Yi\" means \"one and one\", and as we all know this makes two. By using the same pictograph that represents one to represent two (by simply repeating it) a link is established and we've learned something which isn't only of mathematical value: Individuals are never alone. They are born into a family, live with each other in communities and exert an influence. All have to deal with the same situations in life, only from different view points and at different ages, whether it is about growing up, first and later love, marriage, providing for the family, sickness, age or death. We make our choices and choices make us what we are, but it are the others which help us to see what we never would be able to. Eight year old photographer-\"philosopher\" Yang-Yang has a point in this regard when he shoots pictures showing only the back of persons' heads...Sure, Edward Yang's \"Yi Yi\" is also a portrait of the clash of modernization with traditional Chinese values in a Taiwanese family, but foremost it presents us multiple layers of three generations of one family and how everyone copes with it, and that is something universal to take away from it. In many ways one finds one's self reminded of the great Japanese filmmaker Ozu - life takes center stage, no need to make a movie that is literally more than life. Long and slow paced, \"Yi Yi\" takes its time to let the viewer get to know the characters and follow the diverse paths each one of them takes in the midst of their daily routines. After a while one becomes almost part of the family and enjoys how the mosaic of pieces fits together, even though everything is far from perfect. The film depicts family life in a subtle and understated way, it's an empathetic, humane piece of screen poetry, call it a contemporary Ozu if you like. Indeed, Yang's camera helps us see what we might never be be able to capture otherwise. Like little Yang-Yang. With that camera. Yang-Yang, which is Yang repeated, right?",
            "review_date": "2012-07-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "2002 MELBOURNE INTERNATIONAL FILM FESTIVAL ENTRY.",
            "content": "YI YI a beautiful,haunting and poignant award winning film from Taiwan was the first of 32 feature films I'll be seeing during the 2002 Melbourne International Film Festival,and it will take something EXTRAORDINARY to surpass this masterpiece.Gentle,delicate,often hypnotic over nearly three hours,YI YI is that special cinematic experience,where time passes all too quickly....a complex,intricate,expose of family life with all its trials and tribulations..yet devoid of sentimentality and manipulation.Here is a work of genuine feeling...modulated emotional tension,humour,heart felt joy and pain...not to mention the most MESMERISING performance from a child actor(ie.Jonathan Chang)I can recall since the late River Phoenix.Young Yang Yang (his character) ignited the Festival audience every time he graced us with his screen presence...I hate precocious child actors,but this young boy just blew me away....When a film is so fresh and exciting days after its screening,then I know I've been lucky to have experienced a VERY SPECIAL cinematic event.DON'T WHATEVER YOU DO...MISS THIS ONCE IN A LIFE TIME JOY....*****......",
            "review_date": "2002-07-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Years passed by frame by frame",
            "content": "There is a very famous painting: the sun is above sea level, the sun is shining on the whole sea, and several people on the beach are looking up towards the sun. Do you think it is sunrise or sunset? It is said that those who see the sunrise are full of vitality and are optimists; those who see the sunset are somber and pessimistic. One day someone asked me, did you see a sunrise or a sunset? Although I know this meaning, I don't want to hide anything. I said that I saw the sunset, and he said that you are really old. I also watched \"One One\" that day, but I was still indifferent when the ending song sounded, sitting there, covering my face and weeping, as if I had lived for a lifetime, as if it was only three hours, I think of a line in the movie: The invention of the movie extended our life threefold. This movie made me live from ten years old to sixty years old, and finally passed from the death of my mother-in-law to the birth of my uncle's child.\"One One\" tells too many stories, everyone, every track, intersect and then alienate:\nI think I have taken control of life, but in fact there is nothing that I can be sure of.\nI think I am busy, but my daily life is only a few words that can be summarized and repeated.\nI think I am optimistic and kind, but I have witnessed the violence and despair of the people around me again and again.\nThe self-righteous things are everything, but in the end I want to take a switch and start over again.\n....When grandma became seriously ill and lost consciousness, her bedroom became the place where everyone was most afraid to go. Everyone doesn't know how to speak, what to say to grandma, everyone doesn't know what to say to themselves.\nWe have been waiting for others to tell us what to do, but we did not wait for the answer, but more people asked us, what should they do? In so many endless confusions, whose problem can be solved?Mom always said that she was busy, she asked why her life, as long as these few words can be summarized, just so little? The space for survival is compressed by the busy rhythm to suffocate.\nThe elder sister's potted flowers never opened. The teacher said it was because of over-care. She fell in love with her good friend's ex-boyfriend, but could not understand his despair and sadness. The short stay of love made her instantly bloom and return to plain.\"Why are things different from what we think?\"\nThere are so many reasons in my mind, asking people again and again to ask themselves, \"How can this be like this? Why, will this be like this?\" Is it someone else? Is it yourself?Followed the movie through the children's ignorance, the doubts of adolescence, the daze of youth, the helplessness of middle-aged, until the old age of Enron. I found that no matter how powerful I was, I couldn't jump out of this reincarnation and evaded to encounter the same fate. This feeling of powerlessness makes people panic and bewildered and finds that there is indeed no better solution. Maybe you can only read it, and then go through it again, admit the strength of something, the limitations of people, remember your original intention, and maintain a tolerant attitude towards things. Do n't be ecstatic and resentful, humbly realize that there is always another side that you ca n't see.\nIndeed. \"No matter what, it's the same.\"",
            "review_date": "2020-05-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Silent Achiever",
            "content": "The cycle of life as seen through the eyes of a Taiwanese family. It is an exquisite and pensive film and does not suffer from it's leisurely pace and running time, rather, it renders it no less that utterly captivating. Bookended without a musical note in between, it does not signpost for one's emotions but gently let's them establish independently through the film's quiet and knowing craft. Such a shame it's director is no longer with us.",
            "review_date": "2020-03-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "We can only see half the truth",
            "content": "After seeing this movie you feel incomplete and content at the same time, we see movies to live the lives we never lived be someone who we can never be, but this film seems to close to reality. It shows us things which happen in everyday life, being happy, sad, loss, profits.\nYou keep thinking about it even after the film ends reflecting upon your own life. 'the best of youth' and this film portrayed human emotions beautifully without you being bored.",
            "review_date": "2020-07-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A journey through emotions",
            "content": "Edward Yang's \"Yi yi\" has the sensibilities of Ingmar Bergman's (a family in crisis) and Tsai Ming-Liang's films (modern-day alienation and estrangement). It doesn't frequently happen that the viewers get to see a film where ALL the characters are deeply steeped in melancholy and depression, from beginning to end, for reasons that are personal and intimate--existential at best.The writer-director (who won the Best Director award at the 2001 Cannes Film Festival;and I think he deserved it, for his direction was dramatically eerie) doesn't leave a stone unturned in bringing the viewers right into the heart of his characters' personal crises. Observe the following:the immobile and observant camera (it does move at times, but only to observe), the painful and eerie silences (only the cinema can do that), the remarkable \"reflective\" shots, where we see each of the characters--either conversing with someone or deep in his/her own thoughts--through a glass, thus baring his/her \"soul\" and the utterances which are moving and shattering in their simplicity and sincerity--a mother despairs over the monotonousness of her life, a son wonders at the sadness that envelopes people and truth being partially known, a father doubts about happiness being attained even if one doesn't love what he/she does, a daughter unbearably suffers from guilt feelings about her grandmother's death. And this is not to mention the other characters, too!The emotional odyssey is definitely unsettling and draining, so that by the time the film ends, the viewers are stupefied by the enigma that is \"Yi yi\" as are their own selves. But I wouldn't mind going for the ride again.",
            "review_date": "2002-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magnolia? Huh?",
            "content": "I'm not sure why this is being compared so much to \"Magnolia.\"  Anderson's film is heavy-handed and sensational.  Thematically, this may resemble \"Magnolia\" in that it documents many lives which are interconnected.  But so does Grand Canyon.  As far as filmmaking goes, this is more like a cross between \"Argent De Poche\" in its themes and \"In the Bedroom\" for its drama and tempo.Comparisons aside, if you're a fan of the genre (ie, you can sit through three hours of constantly low dramatic intensity), this is an excellent movie.  The characters are well-developed and the filmmaking is stark and concentrates the focus on the actors.  Some good performances, some not so good.  Engaging nonetheless.",
            "review_date": "2003-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best Asian movie in modern time!",
            "content": "The last time that I gave 5 out of 5 stars is one month ago, that movie is Steamboat Bill, Jr. (1928). Since I saw that movie, I couldn't find any full-stars movie. Finally I found!What amazing movie! 2000 is the best year of the cinema, the best of Asian too! We had 2 great Hong Kong movies, Crouching Tiger, Hidden Dragon, In the Mood for Love and \"Masterpiece\" Taiwan, Yi Yi in the same year!Almost people, include Critics, thought that ITMFL and CTHD are the best Chinese- language movies that they've ever seen but I don't think like that. CTHD has the beautiful story, great scene, ITMFL has the great cinematography, great love but both of them have the sad ending that 2 people can't be happy... And Yi Yi, it's not only the movie, it's life, my life and your life. Many relationship that you can see in this movie that you saw or will see in your real life: family, friends, wife-husband, boyfriend-girlfriend, ex boyfriend-ex girlfriend...",
            "review_date": "2015-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "Yi Yi is one of the best family dramas ever made, it's a unique swan song of great framing and cinematography and subtle performances. I implore everyone to watch this as it shows a family, their lives and their cultures.",
            "review_date": "2023-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very tender movie about 3 generations of a family living in suburbs of Taipei and their day to day like which is minutely portrayed to details by Yang. Edward Yang's best film along with 'A Brighter Summer Day'. People living in metropolitan will definitely feel they have seen these people in the neighborhood or feel related to their own life.",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yi Yi is a bottle of old wine that refracts our ordinary lives with the ordinary life of a family, perhaps we will slowly be able to feel the difference in flavor as we age.",
            "review_date": "2022-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was made for viewers from a bygone era. The time of crafting a 3 hour movie where there is no second-act crescendo, where the entire first 2.5 hours are just pure exposition and the last half hour can only loosely be described as the climax… that time is over, if it ever even really began. I'm not saying the craftsmanship (at least as far as human drama goes) was anything less than top notch, it's just that what they chose to create was borderline unwatchable. My interest in the characters waned instead of waxed as the second hour passed by with very little happening and I kept hoping the grandma would go ahead and die so there would at least be some burst of emotion. The worst part was how well they had started out, with some really excellent music from what sounded like a viola playing over an exciting wedding scene, as what that scene ultimately accomplished was displaying to the audience what movie they were capable of making (i.e. one worth watching), making the final product even more frustrating. My patience was long gone by the time they nailed the coffin shut by spending several minutes showing a guy explain why people enjoy movies. The notion that this is \"one of the great works of 21st century cinema\" is as foreign to me as the language they were speaking.",
            "review_date": "2022-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Edward Yang's final film, Yi Yi, is a gem in all respects, a family drama that deals with loss, unrequited love, obligation, loyalty, truth and a myriad of other timely themes.  The fact that it clocks in at just under three hours may be a deterrent to some, but the film is so meticulously crafted, well written and superbly acted that you become totally immersed in the issues that impact the family.  Yang blocks each scene perfectly, allowing the primarily stationary camera to document the emotions of the characters and their interpersonal relationships in lengthy, uninterrupted takes, often to devasting effect.  It is a profound but subtle exploration of human nature that will linger in the memory long after the film has ended.",
            "review_date": "2021-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yi Yi is a solid movie that is definitely well written in its complicated central romance, powerful acting performances, dazzling cityscape and a wonderful score. However, it's still a rather overrated film due to its excessive runtime and a lack of any bigger and/or truly memorable sequences. It's an epic family saga that was too sprawling for my taste.",
            "review_date": "2021-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant, subtle movie with absolute perfection in all its detail.",
            "review_date": "2021-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stunningly beautiful film that gave me goosebumps no less than five times.\n\nThis exquisitely crafted story definitely falls in the \"tough to find the words that capture this films essence\" camp and will leave me pondering many of these overlapping themes in the weeks to come.\n\nJonathan Chang had me melting as Yang Yang and made this film so much stronger. 9.5/10",
            "review_date": "2021-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sprawling, uncommonly rich and detailed portrait of a family, with a city-sized heart for all its characters. One of the key films of the millenium.",
            "review_date": "2021-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Virtually nobody does \"day in the life\" drama with as much sincerity or power as Edward Yang did, which makes his lack of popular recognition in the Western world all the more tragic. Takes are long and deliberate, of varying distances from the subject, often wordless and introspective, and dialogue is filled with authenticity, including wonderfully awkward pauses and hesitation. Yang is the master of 'empty' space, allowing atmosphere to hang heavy in the air like honey and for conversations to appear appropriately sporadic and impactful. I think that allowing his \"less is more\" style to extend to a greater proportion of the plot allows for a Yang to craft a greater impact than his other highly acclaimed masterpiece, A Brighter Summer Day, which shares a setting and many stylistic elements but tackles different elements of Taiwanese society; the films have enough power to stand on their own without resorting to using a violent act as a pivot. Still, an endearingly sincere classic of world cinema that maanges to effectively combine domestic commentary with global empathy. (5/5)",
            "review_date": "2020-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1001 movies to see before you die.  A powerful family portrait from Taiwan.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I often find Taiwanese movies inaccessible and trying to one's patience. They tend to be long, slow-paced, focus on an extended family, introduce many characters at once, employ few close ups (making it hard to distinguish those characters), depict the mundane, no \"plot,\" minimalist soundtrack. Yi Yi follows those conventions, but does so in a way that slowly draws you in and doesn't let go of your attention. I won't give away what actually happens in the movie, as much of the pleasure in watching it is in discovering the meaning as events unfold. The experience of watching this movie is like being an unobserved anthropologist viewing an extended family (and their neighbors) from a distance. You go in with no context, and rely on your own observation skills to get to know the characters, figure out the relationships and the meaning of events. As you slowly fill in the context and meaning, previous events that were perplexing come into relief, and you begin to appreciate their significance. In a sense, the experience of watching the movie isn't over when the closing credits begin. The following day I had \"a ha!\" moments as I suddenly put two and two together thinking back on the film.\n\n(One thing that amused me in the movie was when a couple teens meet at a movie theater, they stand in front of a poster for The Phantom Menace, which is another long movie about an extended family with no plot, both made by a single visionary writer/director, but is also loud and obnoxious, and turns you away, despite its desperate attempts to be engaging, and you can't help but notice the difference.)",
            "review_date": "2020-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With beautiful and expressive shots, sensitive and eloquent direction, incredible acting by all involved, and a plethora of brilliantly quotable lines, add to that the fact it's considered a \"slice-of-life\" film, Yi Yi really could have been easily one of my favourite films of all time. Alas, I can't even say that I liked it!\n\nTwo main reasons this film didn't resonate with me nearly as much as I expected are that: I didn't find the vast majority of the characters to be interesting, and I couldn't see why this is considered to be a slice-of-life film in the first place.\n\nThe only character I was almost constantly interested in is Yang-Yang. I found the relationship between N.J. and Sherry quite absorbing and engrossing as well as the scenes with N.J. and his Japanese friend; I can't say I really cared about the character of N.J. as I was supposed to be.\n\nI couldn't care less about everything related to N.J.'s wife, teenage daughter, brother and business partners. Apart from one scene N.J.'s wife shares with N.J.'s mother that was a bit emotional, I found the film emotionally flat and almost fell asleep every time I see these above-mentioned characters. I found the story-line of Ting-Ting to be one of the most boring and uneventful I've seen in any film. Let alone the fact this film is 3 hours long!\n\nA slice-of-life is a term used to describe a piece of art or literature that shows or depicts the ordinary details of real life. And I'm enamored of any film or novel that can be classified under this, so to speak, sub-genre. The thing is I couldn't see that Yi Yi fits this description. What I saw, in the first 30 minuted in particular, are many of uninteresting characters acting in an absurd way. I really couldn't see that this film has mundane real-life events as most people do.\n\n(6.5/10)",
            "review_date": "2019-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too true to be so attractive as a business movie, but i can still enjoy the film duiting the 3 hours. I like the way that the director use different lines in the same movie to express different people of  different ages.",
            "review_date": "2017-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best depictions of family life I've ever seen. This film is masterfully directed and acted.",
            "review_date": "2017-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story of each member in a family of Taiwan, which can be the story of each and every living being there. ",
            "review_date": "2017-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I prefer A Brighter Summer day, Yi Yi explores life themes on a larger scale, using many of the same methods.",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though a bit long, this is a wonderful family movie",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "** Why are we afraid of the first time? Every day in life is a first time. Every morning is new. We never live the same day twice. We're never afraid of getting up every morning. Why? \"",
            "review_date": "2016-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movies has some great scene. \nHowever it's too long.",
            "review_date": "2016-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It takes a great filmmaker to make the mundane of everyday beautiful and fascinating. Fortunately director Edward Yang is well up to the task with Yi Yi, a film about life and relationships. It's all very subtle and decidedly understated, but also complex in its observations about life and existence.",
            "review_date": "2016-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really nice film about a Taiwanese family and a bunch of stories happening to each member. Quite original and interesting.",
            "review_date": "2016-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very long. Ensemble piece a la Grand Canyon, with lots of characters dealing with quotidian, first world, middle class depression. Although I enjoyed it, not quite sure why it got such a high metascore. However I did enjoy the pulling-back-of-the-curtain on what life in Asia is like.",
            "review_date": "2016-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For films like this, it is actually unnecessary to \"review\" or \"analyse\", as nothing is more common in the world than the humanist care that people give each other. By that, of course I do not mean that \"Yi Yi\" is a perfect film, as it is surely less accessible than the great works by Edward Yang's compatriot - Ang Lee, whose view and thoughts are equally humanist but more \"global\" (some may say \"Westernised\"). Luckily enough for me, being born in the \"Sinosphere\", Edward Yang's \"Yi Yi\" to me is utterly oriental with a deeply Buddhist sense of Prat?tyasamutpada, in simpler words the close and dependent relationship between people, between past and present, between life and death. The way Edward Yang unveiled his interconnected layers of human stories in \"Yi Yi\" is utterly charming, soothing, yet it still makes the audience delightfully surprised by the subtle reflection of one generation's destiny on its successor's, by numerous abrupt turns or terminations of such stories, often through obscurity and blurriness of details. I was deeply fascinated by the fact that Edward Yang in some cases concealed important details or outcomes of his stories from the audience, or only let them know in a very \"hear-say\", indirect ways that really reflect the fact that as our back (the physical back that is), there are plenty of things in life that we cannot see, ever, just like the future, just like how people really think about us, just like our ultimate destiny in life, no matter how wise we are, no matter how \"far-sight\" we try to be. Thus, the best thing we can do is to \"cover\" the back of our beloved ones by our love, true love, just like the small but ever wise Yang-Yang, who in his simple but dearest way takes pictures of whom he loves, from their back, so that they would never have to die without knowing how their back really looks like. It was a huge lost to the Taiwanese cinema, and the global cinema actually, when Yang died too early from cancer, but he will always be remembered for his humanist films, especially this \"Last Bow\", the best \"bow\" possible to the audience that is.",
            "review_date": "2015-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy cow! I think I just discovered the movie that Richard Linklater watched when he came up with the idea for Boyhood. This is a 3-hour-long plod through a year in the life of a Taiwanese family. The reason I bring up the Boyhood comparison is because Yi Yi is also kind of like watching a family's home-movies, but not the exciting moments that you would actually videotape. Instead this is loaded with the down moments, and also a bunch of bland scenes where nothing of interest happens. It has some scenes that are promising and make you think something really dramatic is about to happen, at these moments I got my hopes up that the movie was about to take a turn to be really intriguing. Sadly, before long the drama peters out and they go back to depicting the mundane aspects of everyday existences. Towards the end of the film, when it teased me again in this way, I literally said out loud \"There's no way anything this interesting will happen in this movie.\" Sure enough, it was just another fake-out and all the excitement was gone in a flash.\n\nThere are other issues as well. One more aspect that reminded me of Boyhood was the way they had young people sharing conversations that no one their age would ever have. In fact the youngest member of the family has more profound lines than anyone else in the movie. It just feels too scripted, particularly in a movie that is attempting to capture real life. My other difficulty with Yi Yi was the shot selection. Edward Yang seemingly enjoys setting the camera down on a tripod, then having his actors stand about 30 feet away and act out a scene without moving the camera when someone steps out of the shot. I guess it gives a fly-on-the-wall feel to our view of the film, but it also kept me emotionally detached from the actors. However, the real dilemma is that 3-hour length. There wasn't enough plot to fill that quantity of time, even though they were trying to tell at least three different stories at once. It's 30 minutes of good content thinly spread over 3 hours of film. I will admit there were snippets that worked for me. I particularly liked when they overlaid the father talking about the memory of his first love with images of his daughter going through the same thing. Also anything the young boy did, while a little deep and philosophical for his age, was fun to watch. I just don't think I could ever ask another human being to sit through this film. Yi Yi, while critically acclaimed, won't draw in the average movie-goer like me.",
            "review_date": "2015-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies of the decade",
            "review_date": "2015-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When a man runs into his first love at his brother-in-law's wedding thirty years later, he starts to question the direction his life has taken. Meanwhile his teenage daughter falls for her best friend's boyfriend & his precocious son uses photography to explain existential truths in this deftly constructed film. Beginning with a wedding & ending with a funeral, this film examines the life & struggles of a modern Taiwanese family.",
            "review_date": "2014-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somewhat tedious slice-of-life stuff with a few brilliant moments thrown in to redeem the whole movie.",
            "review_date": "2014-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant \"epic\" about everyday people. Don't let the long running time scare you away. See this film.",
            "review_date": "2014-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Encapsulating; it sets off on a pace that had me looking at my watch at first, but the story then unfolded and the depth of these characters whom I genuinely cared about only got deeper and richer.",
            "review_date": "2014-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it is meaningless to talk about a good movie , much easier to talk about a bad one.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yi Yi: A One and a Two (2000) - 9,5\n\nFirst time I see this work from Edward Yang, one of the leading names of contemporary Cinema of Taiwan, whom I completely ignored until now. It brought \"A Separation\" from Asghar Farhadi back to my memory, another movie which also depicts the everyday hurdles of a family and with reminiscent aesthetics although not as fleshed out and subtle... I felt that movie was trying to achieve something similar but in much lesser scale, and yet it failed to exert in me a positive impression like the charming \"Yi Yi\". The thing that lacked in the iranian movie was present in the taiwanese in just the right doses to add that touch of nuance so necessary for the authenticity of human relations: affection/tenderness between people of different genders. You'd think this is a ridiculously basic thing to bi**h about, anyway to me any serious familiar drama must be able to depict the fundamental reason why families are formed: love between different gender people (assuming we're talking about hetero relationships, of course). This can be shown in all sorts of subtle ways, but it was almost non-existent in \"A Separation\", and at times women seemed to have a sort of manly manner to their way of being... very very weird and of putting to me. This, among other things, very much limited the power of persuasion and the ability to touch me of the iranian work, I didn't connect, it felt flat and boring. I guess the fact that it was a familiar drama filmed almost as a sort of thriller didn't help, there's nothing thrilling in familiar quotidian life, it's mostly emotional, an aspect where it felt short for me. All this just to say that contrary to \"A Separation\", \"Yi Yi\" is pretty much a perfect family drama, but pointing out this mere evidence (in my eyes) is an insult to the taiwanese work, it's much! more than that. I see \"Yi Yi\" as a bigger, better, easier to live through, a truly satisfying cinematic experience.\n\n\"Yi Yi\" is an epic drama story, the focus of attention are the life probations of a family where kids, adults and an old lady are all main characters of life and they go through many eye opening experiences that touch us, amuse us, humiliate us, intrigue us, makes us think... life lessons. It lasts for 3 hours and although this amount of time actually seems small for the thematic ambition of this work, Edward Yang manages to develop each theme, human relation, challenge with sensibility and intelligence, in a calm and confident pace and leave nothing left to say. There's indeed no need to say anything more, the premiss is fully fulfilled, by the time the movie ends we are left with the feeling of having watched something as epic, deep and bittersweet as life itself with an extra alluring spell carved by the wonderful cinematic mastery of Yang. The only thing I'd wish to be changed is the soundtrack, it's a bit too trivial, it almost cheapens the experience for me, but maybe I'm being excessively critical here, probably just a matter of taste. Fortunately it lasts little time and it's easy to forget... That's the only complain, all other technical aspects are more than good enough, the acting is excellent all around. What a wonderful movie, I highly recommend it!",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nearly three hours long and it never overstays its welcome.",
            "review_date": "2014-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful film...it's hard to articulate why I find this film so good....love it's depiction of Taipei",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically a modern day masterpiece if I ever saw one. It's slightly hard to recommend to everyone due to being 3 hours, subtitled and relatively slow paced. Still it's one of the most rewarding film's I have seen in a long time. A little past the 2 hour mark, there is a scene in which two men sit and one of them shows off a magic trick. Moments later he is able to name each card from the deck starting at the top. Even though I knew this scene was rehearsed, and that he wash't actually naming these cards, it still left me mystified, and reminded me of the absolute beauty in well crafted art. Go watch this movie, It's fantastic,",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slow-burning family drama that showcases a slice of life of a Taiwanese family and the everyday crises each member goes through in private while waiting for the old matriarch to come out of a coma. Leisurely told and delicately shot, it is a pleasing study on humanity.",
            "review_date": "2013-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It Was My First Film I Watch For Edward Yang, He's a Real Master .... One Of The Most Difficult and Simplest Scripts Ever Watched .... a Must Watch Film,\n\nR.I.P. Edward Yang",
            "review_date": "2013-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie by Edward Yang on the struggles of a Taiwanese family",
            "review_date": "2013-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tries very hard to be profound. Overrated, overlong, uninteresting. The cinematography makes it impossible to relate to any characters.",
            "review_date": "2013-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fluent, charming and precise family portrait that celebrates ordinary life with all its joys and chaos. Every beat and every image and every cut and every note feels like a part of a whole. It is a total movie.",
            "review_date": "2013-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first experience with Edward Yang's films is one that I will always remember. An extremely engaging and intimate portrait of a Taiwanese family which explores the difficult choices that have to make in life as well as the issues that are to be faced. Despite being three hours long I wanted to put it back to the start and watch it all over again. \n\nHopefully we'll eventually get some more of his films in decent editions in the future.",
            "review_date": "2013-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute and inspiring without being cloying. It doesn't feel artificial and therefore can serve as an example to Hollywood on how to make a truly moving picture.",
            "review_date": "2013-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deliberation on cultural identity and family interaction. It feels three hours long.",
            "review_date": "2012-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's films like these that remind me why I watch film. Simply wonderful.",
            "review_date": "2012-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Because of the movies, we now live twice as long.",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After the music stopped being so over powering over the story, I really was enjoyed the shoots, acting and overall story",
            "review_date": "2012-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a \"let it soak in\" film. At nearly three hours, there is a lot to take in, to process, to analyze. It is richly layered with everyday characters dealing with everyday events - school, ailing parents, money-borrowing relatives. It is how their stories intersect and interact that brings larger drama and larger questions. At the film's heart is the question: are you searching for something real in life or something magical? In the end, it seems that the magic is unattainable and even harmful, unless you give yourself over to something real first. I'm still thinking about it though, so these ideas may not hold true tomorrow.",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow and deliberately paced, this film is widely categorized as one of those \"slice of life\" dramas.  It may develop slowly at first, but I found myself so immersed with the characters (especially NJ) that I didn't feel like I had just watched a 3 hour long film.   Many of everyday life's themes are depicted in here, and by the film's end there is an emotional payoff IMHO.  The overall tone was a somber one, but it was a rewarding experience nonetheless.  Highly recommended for those willing to invest their time and attention.",
            "review_date": "2012-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, funny and honestly real, but slow, drawn out and often a little miserable.",
            "review_date": "2012-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've always had mixed feelings about this one, but I think I've seen it five times now and it gets stronger every time. It really is one of the great films about the contemporary Asian lifestyle. Great ending that really hits hard. I still think it's unnecessarily long though, and found that the mom's side of the story was a little bit weak. Yang Yang's lines are delivered kind of stiff and flat, like a kid being force-fed some profound nuggets of wisdom to recite, and thus it kind of breaks this film's spell of immersion.",
            "review_date": "2012-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that is so unassumingly brilliant that you don't even notice its greatness until that last scene and into the credits. A slice of life family drama that perfectly captures the beats of family life and how the people in them live. Its both funny and tragic and it has a real beauty to it. The performances are all brilliant. These characters live with you, you start seeing yourself in this family and your own family members.",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Master's work. It is overwhelming to think about what it takes in terms of balance of technical skills and man's experience to get to such a result in any form of art. Edward Yang was a giant.",
            "review_date": "2011-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tremendous collage of wonderful personifications of urban modernity. Yang keeps escalating social stratums and reaches the peak of a cinematic god, reading every thought, predicting every sequence, understanding every line and what it implicates in the mind of the person, joining the events into meaningful fragments of a whole cycle of life.\n\n*Applause.*\n\n97/100",
            "review_date": "2011-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow as daily life goes -- long-shots of characters in the bigger surroundings that somehow gives strange feeling of comfortableness in silence. This is a poetry of life beautifully photographed. Modern day Ozu cinema, that is.",
            "review_date": "2011-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "72%\r\n\r\nThree hours is a tad bit too long for me, when a film moves like molasses. A hearty slice of a middle class, Taiwanese family.",
            "review_date": "2011-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my favourite character's Yang-Yang :)",
            "review_date": "2011-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So engrossing. You could run a film school teaching out of this film alone.",
            "review_date": "2011-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few films that I can think of other than Robert Bresson's \"Au Hasard Balthazar\" or Vittorio De Sica's neo-realist masterpiece \"The Bicycle Thief\" that truly encapsulates the human experience. Isn't that the over all goal of cinema, anyways?",
            "review_date": "2011-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The pacing could be better, but otherwise is a movie one should see if you're a patient viewer.",
            "review_date": "2011-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well done character study.  It intimately follows the lives of a middle-class family for a year through all of their ups and downs.  Every character has a unique voice and their individual stories are as carefully told as each shot and situation are carefully executed.  A very beautiful movie in many ways.",
            "review_date": "2011-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel like I was hit slowly by a train with this movie. Still debating if it was a worthwhile hit. The shot composition gave me time and time again a lovely treat to the eyes, and the overall visual element is presented in a very entertaining way for a three hour long movie.\n\nI love the cover to this film after watching this movie.",
            "review_date": "2011-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I highly recommend this one...",
            "review_date": "2011-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slow moving drama that follows members of an urban Taiwanese family. Well shot, humane, & infused with a gentle sense of humour.",
            "review_date": "2011-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yi Yi is an epic story about the Taipei Jian family seen through three different perspectives: the middle-aged father NJ (Nien-Jen Wu), the young son Yang-Yang (Jonathan Chang), and the teenage daughter, Ting-Ting (Kelly Lee). The three-hour piece starts with a wedding, concludes with a funeral, and contemplates areas of human life in between. The father, NJ, is unsatisfied with his work and the desire of his business partners to enter into a deal with a well-known Japanese videogame company. While his partners are only concerned about making money, NJ finds that his honest nature is unappreciated in the commercial realm. To his surprise, he finds a connection with the Japanese software mogul, Ota. A former old flame, Sherry, tries to walk into his life after a chance reunion. His youngest son has troubles at school with his teachers, while his daughter has to handle a love triangle involving her next door friend and her troubled boyfriend. All three try to deal with their problems while also caring for NJ's aged mother-in-law, who is in a coma, and in the absence of NJ's wife, who has left for a Buddhist retreat after facing a midlife crisis. In addition, Ah-Di, NJ's overweight brother-in-law who marries a starlet at the start of the film, has to wrestle with his demanding wife and a former love, complicating matters within this extended family.\nThe other Taiwanese cast members include Elaine Jin as NJ's wife, Min-Min, Su-Yun Ko as NJ's former love Sherry, Hsi-Sheng Chen as Ah-Di, and Pang Chang Yu as Fatty. The film also stars Japanese comedian Issei Ogata as a Japanese software mogul, Ota.",
            "review_date": "2011-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An engaging look at a Taiwanese family that has quite a few bright spots. It doesn't need to be three hours long though.",
            "review_date": "2011-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful to look at with interesting characters. The only problem I had with it is that it's a bit too long.",
            "review_date": "2011-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Edward Yang can combine a poet's eye for metaphor and imagery with a novelist's sense of detail and character. Yi Yi is a domestic drama that has the sweep of an epic and the fine acuity of a haiku. Yang's story unfolds effortlessly, populated with disquieting coincidences and sudden reversals, capturing the ebb and flow of real life. What Yang shows us in his latest film is what his many characters don't seem able to see for themselves: that despite their connections to each other, by blood or acquaintance, their isolation remains profound. (The Chinese title, literally translated, is \"One-one,\" meaning \"individually.\") Part of the thrill of watching Yi Yi's brisk three hours--which include a wedding, a birth, an attempted suicide, a murder, and a funeral--comes in discovering how the members of this extended family fit together. Discovering how they don't is what gives the film its tragic dimension. Unspooling intertwined strands of a single yarn, Yang allows us to observe, for example, that the father and daughter are both in the throes of first love, but because they never inquire into the details of each other's lives, that revelation is left to each of us alone. In the final scene, one character's deeply felt confession would seem a measure of progress for the film's dysfunctional family; unfortunately, it comes too late for the intended listener to hear.\nOne of the defining visual elements of Yi yi is its reduced palette; not in some overarching way where only five colors are used in the entire movie or anything like that, but in a scene-by-scene and even shot-by-shot way. Basically, each scene in the film is reduced to three or four colors, with reds and yellows much predominating. The important thing, however, is not which colors overwhelm the film but which colors are used in tiny ways that draw the maximum attention to themselves. The color scheme is used, in other words, to emphasize the locations in the film and the humans in the film, particularly in how those two elements do not combine smoothly.\nIn its most reduced form, the story of Yi Yi is about how idealism - particularly idealised memories and idealised concepts of how the world should fit together - don't necessarily fit in a world full of well-meaning but messy human actions. The use of color is a major component of how that theme is explored. Most of the film is bathed in soft yellowness, I mentioned, and that calls to mind vintage photographs, an old album where only nice things are recorded and families always seem to be untroubled and happy. The reality is never that simple, of course, and the film is a study of how one family learns that being human is a bit messier than lovely snapshots and nostalgic glow.",
            "review_date": "2011-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much much duller than I had anticipated but strangely, thoroughly watchable. Everything hits you later, in your bed, hours after you finish the film. Its premise is extremely simple but it's a very portrait of a family, their neighbors, and their loves.",
            "review_date": "2011-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has become one of my all time favorite movie, you just don't want it to end, so very well made, very realistic characters, love the photos the kid takes, a must see!",
            "review_date": "2011-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Read and comment on my review at http://bit.ly/e2CA8c",
            "review_date": "2011-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why are we afraid of the first time? Every day in life is a first time. Every morning is new. We never live the same day twice. We're never afraid of getting up every morning. Why?",
            "review_date": "2011-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most significance of this movie is it is after all about our every day life.  It does not exaggerate or flatter.  You see and seemingly live the lives of the characters.",
            "review_date": "2011-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film, being on the top of many critics top decade lists, is phenomenal. Without a completely solid plot it's surprising that it is such an excellent movie. It tells the story of this group of people simply living their lives. Through their lives the audience is able to grasp introspective themes and emotions in a very personal way. It relates the story of these people to us by putting them in situations we all can relate to.\n\n   The film blends these different themes and plot lines seamlessly and the editing stands out as a masterful aspect of the film. It makes this 3 hour drama interesting, when it could've been the complete opposite. There are a multitude of themes running throughout the film and they are all excellently developed and easily understood. It seems the main theme is trying to convey is how we live each day of our lives, and if each day is a new day we shouldn't be afraid to make a change, to break out of our routines, and experience life. The coma which the grandmother falls into catapults this perspective into action and we are able to witness how it changes these people's lives for the better and for the worse. It then assures us that it's necessary to take the good with the bad, and that is what will cause growth in us.\n\n   The film had excellent acting to present these themes and an excellent screenplay to guide the actors. The cinematography is outstanding and gives us scenes which really are a joy to watch. I really enjoyed it even though it was slow moving at times. It also had aspects of the plot I wish it would've developed more thoroughly because they interested me more than the ones which were excessively developed. It had an absolutely beautiful ending.",
            "review_date": "2011-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film Yi Yi takes a unique stance on the meaning of life by focusing on the life events of the Jian family. The father NJ, is a businessman who is trying desperately to think of a plan to keep the company he belongs to a float. During the wedding of his brother in law, NJ encounters his first love Sherry. Conflict arises when the grandmother slips into a coma. This causes NJ's wife Min-Min to question her role in the family. NJ and Min- Min's five year old son Yang-Yang is the most distant member of the family. He has to deal with a chaotic teacher and a bunch of really irritating girls, which at times provide elements of much needed comedy relief. The subplot of NJ and Min-Min's teenage daughter Ting-Ting, who has to deal with the new romantic feelings for a local boy is rather boring and should have been cut out of the film, as it is an unnecessary and takes away focus from other characters. \nI do recognise that Edward Yang was trying to break the conventional traditional of the narrative and for that I have no objection. However the messy structure he adopted hampered each individual character's story by changing character focus too many times and in some case not coming back to a character for over 45 minutes e.g. the grandmother in a coma.\nThe scenes that stands out the most for me is where NJ talks with Otta about life and business, especially the scene near the end of the film where Otta uses a deck of cards to explain about life. I would have appreciated the film more if they had focused more on the father (NJ) and son (Yang-Yang). The biggest gripe I have with this film is its length. As mentioned before the film has too many subplots and is why the film goes for 3 hours, too long; The trimming of certain scenes where there is no action or story progression happening e.g. Ting-Ting and another girl in a hallway just staring at each other. These editing alterations would not take away from the story's message of life, but enrich it. \n\nI enjoyed most of the cinematography of the film. Edward Yang successfully captured the characters movement and their disconnection to their surrounding environment by the use of wide shots. He was able to us the mis en scene of the metropolis such as the city skyline in combination with reflective glass; and traffic to represent the isolation and distant thinking of the characters. I did find that some of the wide shots used, such as the cafe scene were uncomfortable, as they made me feel distant from the characters discussion. Although it did make me want to be drawn in to the discussion which I guess was one of the goals of Edward Yang.",
            "review_date": "2011-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you met an alien and they wanted to learn about us as human beings, this would be the movie to show them. It captures our world and our humanity brilliantly. All the beauty, tragedy, mistakes, depression, learning, love, tension, everything we have gone through and will experience - it's all here. Still...I didn't like it as much as I thought I would. My favorite character was the young Yang-Yang, an 8 year old boy who likes to learn and is already quite wise for his age, yet he has a sweet innocence about him. The movie seemed to focus on everyone else, leaving him with only a few short scenes...thankfully he steals the final scene and gives the last words, which are heartwarming. Overall it is a slow, boring, fast, exciting, sad, happy movie. Like life itself.",
            "review_date": "2011-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very quiet, very long film about living. You should really, really, really see it as soon as you can.",
            "review_date": "2011-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's like Ozu meets Altman in this delicious hyperlink movie with lots of interesting characters and themes. One of the top ten movies of 00's.",
            "review_date": "2011-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, subtle if just slightly slow, âYi Yiâ\u009d explores everyday life through one insignificant family. The film feels real, but has a clear aesthetic purpose as well. And even as it does feel slow, I still felt like the movie hadnâ(TM)t actually lasted all of its three hours as it ended. Compelling, if not the most original.",
            "review_date": "2011-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate to rate this film so high because Taiwan cinema has this way of making really static films that are long and boring, no wonder they killed their own cinema.  \n   Though boring and wrought with a style that lets symbolic meaning of the narrative control the style of the cinema (which is wrong when not contrasted by the narrative flair of your story), the film somehow becomes appealing after 2 hours.  Maybe by this point you are used to the characters and story enough to accept and enjoy how things will play out.  There is nothing complicated about this story, it is simple and easy to relate.  Points made by the director are accurate, simple, and edifying.  A low key charm exists within the wall of this film, and it takes 2 hours to delve into it.  Once their, your mind and spirit are harmonized with Yi Yi's world and Yang's message.  This is why it is a good film.  Patience is rewarding.",
            "review_date": "2010-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slow start but stick with it. Has some of the most poignant heartfelt moments in cinema i have seen in years. A story about a fractured family struggling to hold it together as their matriarch slips into a coma.",
            "review_date": "2010-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grandious Family Epic The Godfather of Family Epics so near to life, melanchonical, tragic and full of Dark Humor",
            "review_date": "2010-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring and slow - almost 3 hours.",
            "review_date": "2010-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The stunning use of reflections and cinematography is awesome, but I couldn't quite get involved in this glimpse of life - through no fault of it's own",
            "review_date": "2010-11-30",
            "source": "rt",
            "lang": "en"
        }
    ],
    "rt_rating": 9.1,
    "rt_summary": "Set in Taiwan, the film follows the lives of the Jian family from the alternating perspectives of the three main family members: father N.J. (Nien-Jen Wu), teenage daughter Ting-Ting (Elaine Jin) and young son Yang-Yang (Issei Ogata). N.J., disgruntled with his current job, attempts to court the favor of a prominent video game company while Ting-Ting and Yang-Yang contend with the various trials of youth, all while caring for N.J.'s mother-in-law, who lies in a coma.",
    "meta_rating": 8.4,
    "meta_summary": "This film portrays life through portraits of the individual members of a Taiwanese family, each representing a stage from birth to death.  [WinStar Cinema]"
}