{
    "rating": 9.2,
    "release_date": "1969-10-24",
    "num_reviews": 470,
    "genres": [
        "Western",
        "Action"
    ],
    "summary": "The true story of fast-draws and wild rides, battles with posses, train and bank robberies, a torrid love affair and a new lease on outlaw life in far away Bolivia. It is also a character study of a remarkable friendship between Butch - possibly the most likeable outlaw in frontier history - and his closest associate, the fabled, ever-dangerous Sundance Kid.",
    "reviews": [
        {
            "content": "20% rating ... Personally didn't really care for this film. Got bored about halfway through.",
            "review_date": "2023-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The iconic Western Butch Cassidy and the Sundance Kid (Paul Newman and Robert Redford, respectively) is the story of the titular bank robbers on the run from the law in the Old West of the early 20th century.  The chemistry between Newman and Redford is undeniable, Conrad Hall's cinematography nicely captures the arid beauty of America's southwest, and the great William Goldman's screenplay is filled with witty dialogue.  Despite all of its attributes, the middle portion of the movie feels like it drags as director George Roy Hill seems content to show scene after scene of the two protagonists trying to elude the posse that's tracking them, endlessly alternating between shots of the pursuit and the escape.",
            "review_date": "2023-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were some parts of the movie that made me lose interest in it, but most of the time I had to acknowledge and appreciate how cool and special it was with its entertainment, especially when Newman and Redford were on the run from the law/cavalry. There were some really well done and suspenseful scenes, plus good choices of songs/music and good shots of the landscapes where their adventures, retreats, and heists took place. It had a powerful ending as well and while some might not like it because the picture montages, they were done in a creative way imo. The kind of movies that make you sympathize the most with the bad guys only got bigger and better after this movie!",
            "review_date": "2023-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is definitly my favourite western ever, its so fun and you will not get bored",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ultimate buddy movie (with ample adventure and humor) with two of the best performances ever by Newman and Redford. Classic Western that I just never get tired of watching.",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pure classic late 60's libellous film. Odd for being Western, harmless and entertaining. Revisited in 2022 and somewhat I feel this is aged well than The Sting. because much rebel.",
            "review_date": "2022-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this film - its a classic biopic, with great performances from Paul Newman and Robert Redford as the titular characters. This isn't a western film, like I maybe accidentally assumed it to be, although it does have a western feel to it. Its not full of action, though there is plenty of that at times. Its a good character driven drama, with some very witty dialogue and some quite amusing scenes, plus some reasonably tense moments too. \n\nI could have done without the montage mid way through shot in old fashioned brown  - with music playing over still shots but I guess it helps tell the story of what isn't being shown on screen, namely the two criminals travelling to Bolivia. I found the incidental music played in the background a short while later quite amusing too. I was surprised how entertaining and amusing this was really. Also I can't not compliment it on the great wide landscape shots. The cinematography certainly isn't bad. Given this film dates from 1969, it stands up quite well and I'd certainly recommend this.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is one of the greatest of all time.",
            "review_date": "2022-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on the real Butch Cassidy and the Sundance kid.  Paul Newman, Robert Redford and Katharine Ross.  Music by Burt Bacharach.  It's a great story, great actors and great ending.",
            "review_date": "2022-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you're a fan of Paul Newman and Robert Redford, watch \"The Sting\" where they paired up again with Director George Roy Hill about 4 years after BCATSK.  I'm sure, at the time, mixing late 60s jazz/pop music courtesy of Burt Bacharach was a novel thing to do, but it just doesn't play well for a Western.  Many of the visuals are similarly \"experimental\" and fall flat...especially some of the transitions between scenes where they go from one location to another.  There's a chase scene in the middle of the movie that you could leave the theater, go to the bathroom, get some popcorn, and maybe go for an oil change without missing the end of it...the scene that is...not the end of the movie.  The inbetween is fairly uninteresting during the chase.  Sure, there are some funny lines, but overall, there are much, much better Westerns, and, as I previously stated, you can watch a much better movie with Newman and Redford called, \"The Sting.\"",
            "review_date": "2022-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know there are people who love or don't like this film, but I am one of those who loves it. It is a different kind of western, but in my mind, that is not a bad thing, quite the contrary. I loved the first ten minutes, that was very clever and refreshing. The cinematography is fabulous, doing perfect justice to the beautiful scenery. The score is suitably jaunty, and the Raindrops Falling on My Head interlude is a wonderful touch and quite moving come to think of it. The script is witty and infectious, not to mention memorable, and the direction and pace I had no problem with either. Robert Redford and especially Paul Newman are perfect as the charismatic outlaws and their chemistry is simply unforgettable. All in all, just a great movie and one of my favourites of the genre. 10/10 Bethany Cox",
            "review_date": "2022-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great film. It tells a good story, and it features some great scenery. I also enjoyed the music, including Paul Newman riding a bicycle to Raindrops Keep Falling on My Head and some really great vocal harmonies toward the middle of the film while they make their journey from the American West to NYC and on to South America.",
            "review_date": "2022-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Does not have things which would make it an epic!!\n\nJust a simple straight story of two outlaws.",
            "review_date": "2022-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is another period piece from the late 1960's where the outlaws are the heroes, and is loosely based on real people and events. The chemistry between Redford and Newman keeps the movie afloat (though they also star together in the much better movie \"The Sting\"), and there are some funny scenes at the beginning. Examples: \"I'm stealing your woman!\" \"You can have her!\" and \"Rules? What rules-uggh!\"\n\nBut the movie's initial light, fun tone vanishes once Butch and Sundance are set upon by the hired trackers, and they discover just how much they man they stole money from disliked being robbed. Unfortunately, this initially tense chase sequence becomes slow and boring as it drags on, and the movie never recovers, even in the end when the outlaws have finally realized that they have entrapped themselves with no chance of escape.\n\nThe actual story of the outlaws would be a great basis for a future movie.",
            "review_date": "2021-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest scripts and films of all time, with a genius soundtrack",
            "review_date": "2021-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cannot believe I've never seen this movie before. And holy cow, it does not disappoint. What a beautiful tribute to the old west and the outlaws that lived in it.",
            "review_date": "2021-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A quintessential old western movie and the idea that you can only run for so long.",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Newman & Robert Redford's charisma and camaraderie creates interest throughout. This talented co-star tandem along with a modest score and enjoyable pace, unique to this era, make this one of the best movies of 1969. While some more character development could've created a more attached audience, George Roy Hill and John Foreman provide a satisfying scope into life inside the Hole in the Wall Gang. An ultimate buddy outlaw film that reminds us why being bad (with a caring and vulnerable heart) makes for a fun bicycle ride.",
            "review_date": "2021-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An essential western with great performances by Paul Newman and Robert Redford",
            "review_date": "2021-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On a technical level, this film was really good.  As Westerns are, the cinematography is good and the accompanying music is good as well and mixed in a modern song or two which was the norm in the late sixties.  The problem is the story didn't pull me in like it should have, maybe it was the humor keeping it too light-hearted, not sure. \n\nModerate Spoiler Ahead:\n\n The ending, while predictable, is well done and the freeze frame with the sounds still going is a nice touch.  Overall, I'd recommend this one as there is enough to like and maybe fans of Newman and Redford will love it!!!",
            "review_date": "2021-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film with the pairing of Redford and Newman being the centre piece with just a perfect script.",
            "review_date": "2021-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About a 76%. Cool that's it's based on a true story because it seems totally concocted. Always enjoy a good western movie. Kind of goofy as you'd expect with how dated it is.",
            "review_date": "2021-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my favourite movie of all time, it is incredible",
            "review_date": "2021-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the incredible cinematography and Academy Award winning original song, this Western became disappointing due to its lack of substance and anything interesting.",
            "review_date": "2021-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent, iconic, swashbuckling great western that defined itself in cinema for its era. Two great performances that immortalized Paul Newman and Robert Redford as classic great charismatic bank robbers.",
            "review_date": "2021-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God Robert Redford and Paul Newman are beautiful to watch, and nowhere more so than this movie. Butch and Sundance live forever - in this film, and in my heart.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AFI 100 Greatest Films - #50: I was really entertained throughout most of this film and found it much lighter in tone than I had anticipated given the plot. Although this tone led to a more balanced approach, blending the action and suspense with humor also keeps the film from ever reaching a serious enough level for the stakes to begin to affect me emotionally. I'm not sure the film would have been as enjoyable with the tone more focused and serious but I do know certain scenes would have left a much different impression on me if it had. Newman, Redford and Ross provide solid acting, William Goldman offers up a decent script and Burt Bacharach's score contained some memorable numbers.",
            "review_date": "2020-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still a classic all these years later. I generally don't like these old Western style movies, but this works on all levels. I almost consider this a direct comedy. So many funny scenes. One of my favorite is the having to jump off the cliff to escape scene. Newman tells Redford, you crazy! the fall will probably kill you. I laugh like crazy every time that comes up...",
            "review_date": "2020-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Redford's best movies. great cat",
            "review_date": "2020-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performances are strong but unfortunately you know where it is heading.",
            "review_date": "2020-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it more when I was a kid. Now I see it is a wasted opportunity movie. It starts well, and it would be great if it kept that energy throughout. Middle of the movie is its weakest part. The last third is unconvincing and forced. Raindrops song is fabulous, but totally incongruous with the movie atmosphere, as well as dated 60s style score.",
            "review_date": "2020-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had to rewatch right after the first time I saw it. Couldn't get enough of it. Masterpiece.",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before Butch Cassidy, Westerns had an avowed aversion to having any fun unless the film in question was explicitly a comedy; one-off jokes were reserved for building up the likability of relatively generic protagonists for the most part. The dynamic between Newman and Redford would change that completely, as they demosntrated that Westerns could stand to have actual charisma rather than machismo exclusively. The film delivers a distinct blend of comedy and charm mixed with sincere commentaries on the declining West and finding yourself outdated (but not yet dead). However, there are some weaknesses as well, most prominently with respect to the American posse pursuit, which fails to really keep the audience engaged, or build up the relentlessness of the pursuers beyond exposition and a few distant shots. Stands in stark creative distinction from the conventional Westerns of the prior three decades, to its credit. (4/5)",
            "review_date": "2020-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most others would probably give this a much higher rating, I thought this was good.. not great. Sure you have a legendary duo in Paul Newman & Robert Redford and it's a decent enough Western, but it just wasn't anything all that special really. Raindrops Keep Falling on My Head felt so out of place in this too, especially since the scene it was playing there was no rain. Anyways, this gets a pass from me but barely.",
            "review_date": "2020-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My all time favorite movie. Saw this over 10 times over the years. 1st time when.it came out in 1969.\nHumor, sadness, gunfights, horses , romance, bars, travel... this has it all. The music is the best too.\nThe movie carries well through out.",
            "review_date": "2020-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a dissapointment tbh. I loved the dynamic of Paul Newman and Robert Redford. It was so fun and i love Newman in general. But the story was a nothing. They just run away from some people and that's it. No backstory or a story with start-middle-end. And what is the deal with the girl? Are they having trios??",
            "review_date": "2020-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Redford and Newman prove to be a great duo in any kind of setting. I enjoyed the old western feel and the ending pulled it up to 3.5 stars but the entire movie left me wanting more. There was something missing to make this movie great but I can’t put my finger on it. ",
            "review_date": "2020-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the movies that if I see it when I'm channel hopping, I'll watch the whole thing.",
            "review_date": "2020-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some great lines of dialogue. Greatest knife fight in cinematic history. It's easy to forget our protagonists are villains.",
            "review_date": "2019-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad film, but more average buddy movie than I was expecting ",
            "review_date": "2019-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fresh western still in 21st century",
            "review_date": "2019-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I understand the complaints thrown at the film, but it has always held a place in my heart as one of the best westerns. It looks beautiful (like all the best ones) thanks to Conrad Hall, but it has other qualities that I appreciate. It has a humor and endearing quality that isn't present in other westerns and does a great job at using wide open spaces to create tension and beauty.",
            "review_date": "2019-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most influential westerns made, a must see for fans of the genre.",
            "review_date": "2019-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The AFI Top 100 list has always been rather dubious, what with the inclusion of Guess Who's Coming to Dinner (1967), but the fact that this film ranked above The Apartment (1960), 12 Angry Men (1957) and Blade Runner (1982) proves that the list is redundant. I wanted to like the film as I have recently been trying to explore the Western genre and this is considered one of the finest examples of the genre but I found that I was annoyed by the self satisfied tone and the wooden performances. I was also disappointed by The Sting (1973), the other Robert Redford/Paul Newman/George Roy Hill collaboration, but because of the great reputation of this film I assumed that there would be more to enjoy but alas I was less than satisfied.\n\nCowboys and robbers Butch Cassidy, Paul Newman, and his friend the \"Sundance Kid\", Robert Redford, spend their time robbing banks and romancing schoolteacher Etta Place, Katharine Ross, with whom they both have a romantic relationship. They return to the \"Hole in the wall\" where they first established their gang but decide to escape to Bolivia. In order to do this they have to carry out several successful robberies and when they make a mistake they are tailed by the local law enforcement. They are able to evade them but their escape to Bolivia proves to be difficult as Sundance does not enjoy living there and tensions in their relationship grow. Robbing banks in Bolivia, they become successful and well known but when they discover that they are still being searched for they start to worry and Place leaves them to return to the United States. The two finally meet their assumed deaths in a shootout but go out victorious after affirming their loyalty to one another.\n\nOne of the major things that differentiated this film from so many other westerns was it's willingness to be anachronistic and include humorous lines that would not have been present in your average John Wayne vehicle. Legendary screenwriter William Goldman penned the screenplay and it is full of all of the knowing jokes that would have made clever 1969 people snigger but to me the film seemed a little too pleased with itself. We are introduced to the idea of the ‘new world' through Cassidy and Place riding a bicycle around to the sounds of \"Raindrops Keep Fallin' on my Head.\" The sight of a cowboy on a bicycle is jarring and the very late 1960s music that accompanies the scene is not what you typically associate with the genre but the smugness with which Hill pores over his innovation ruins the moment. It would be nice if we were allowed to digest this clever provocation by ourselves instead of having the idea rammed down our throats. \n\nThe chemistry between Redford and Newman has been praised to no end as they can be considered the original ‘bromance' but to me there was nothing particularly special there. The two have given brilliant performances as individuals in All Is Lost (2013) and The Verdict (1982) respectively but they are hardly Peter O'Toole and Richard Burton when brought together. Rounding out the cast was Ross who is the lady love of both men and has to walk the line between wild woman and cautious lover. She isn't completely convincing and this is partly because of how poorly her character was written as she has to be sexy and carefree but become a nagging shrew in the second act. The inclusion of a female character felt unnecessary because the focus of the film was the homoerotic relationship between the two men and having her between them, with her lack of character development, seemed like it took time away from what could have been a more interesting relationship.\n\nMy view of this film was negatively colored by the fact that I watched the far superior The Good, the Bad and the Ugly (1966) on the same night which included and deconstructed all of the western tropes with far more style and elegance. Redford and Newman are both legends in their own right but this is hardly their best work and I appreciate the fact that this film was not able to beat Midnight Cowboy (1969) for Best Picture in 1969.",
            "review_date": "2019-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Captures the atmosphere of robbing banks in the old west. Two of the best (and prettiest) actors do a great job.",
            "review_date": "2019-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic buddy flick—sharp dialogue, funny, and beautifully shot.",
            "review_date": "2019-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply put, my favorite movie ever.  The acting was amazing, scenery was extroidinary and storyline was top notch.  ",
            "review_date": "2019-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and the Sundance Kid is a 1969 western based on true life events. The film was directed by George Roy Hill, who would later go on to direct such movies as The Sting. The film stars Robert Redford as The Sundance Kid and Paul Newman as Butch Cassid.\n\nThe story in my opinion was both enjoyable to watch unfold, and portrayed very well. \n\nThe acting was very strong especially Robert Redford as The Sundance Kid and Paul Newman as Butch Cassidy, personally I felt that they were the perfect fit for the characters, and I couldn't see anyone else playing them as well as they did.\n\nThe characters were also very strong especially Butch and The Sundance kid, I felt that they had good chemistry and worked off of each other really well.\n\nThe cinematography was also strong with some very interesting and well done shots of the characters and scenery.\n\nPersonally I really like the western setting with most films, and I'm glad to say that it works here. From the era to the people, the settings work really well especially for keeping the two main characters on there feet.\n\nThe set designs and props were done very well especially with the trains toward the beginning of the film.\n\nThe costumes and makeup like the sets were also done very well especially with the two main characters Butch and The Sundance Kid.\n\nThe film at points also had a very unique and good style, from the colour scheme to the cinematography.\n\nThe film also had some very strong practical effects especially with the gun fights and explosions.\n\nThe action like most westerns is very strong, from the cinematography to the really good tension.\n\nThe film also had some pretty good music here and there which for the most part fit with the film very well.\n\nThe comedy in the film was also very strong, and had me laughing out loud multiple times.\n\nThe film at points was also very atmospheric, especially the final scene with Butch Cassidy and The Sundance Kid.\n\nThe film I also really enjoy and hope to watch again and again.\n\nOver all I give it a \n8/10\n85%\n4.25/5",
            "review_date": "2019-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Raindrops Keep Fallin' on My Head\"\nWyoming, early 1900s. Butch Cassidy and The Sundance Kid are the leaders of a band of outlaws. After a train robbery goes wrong they find themselves on the run with a posse hard on their heels. Their solution - escape to Bolivia.\nWith its iconic pairing of Paul Newman and Robert Redford, jaunty screenplay and Burt Bacharach score, Butch Cassidy and the Sundance Kid has gone down as among the defining moments in late-'60s American cinema.",
            "review_date": "2019-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thrilling bank robbing criminal duo.\n\nButch Cassidy and the Sundance Kid (1969) is George Roy Hill's imaginative and fun spin on the Western genre. Hill directed Butch Cassidy and the Sundance Kid with an eye for unique shots. Every one of the film's wild shootouts is gripping to the last moment. His use of camera tricks, directorial angles, and sudden jump cuts is incredibly creative.\n\nGeorge Roy Hill is particularly brilliant for starting the film with a sepia toned suspense sequence with a card game with Sundance. Hill's choice immediately sucks you into the world of Western shootouts, card games, visiting brothels, and the high stakes game of bank robbing. The first fade in of color is as breathtaking as the horizon Butch Cassidy and Sundance ride towards. Hill also uses editors John C. Howard and Richard C. Meyer's quick cuts in his editing to make the audience jump like with Sundance's first quick draw of rapid firing bullets or the train explosions. I really like Hill's perspective behind the fence while Butch rides a bicycle so that the motion of his riding looks like a film reel. The sepia toned montage of pictures while the two bandits escape to Bolivia is very fun too. Hill just understands how to direct beautiful scenes and thrilling chase sequences.\n\nConrad Hall's cinematography is a stunning use of far wide shots for epic scale natural scenery. The dry desert and green valleys look phenomenal in Butch Cassidy and the Sundance Kid. The extended chase sequence in the center of the film is gripping as you are constantly looking in the distance like the duo of robbers on the run for any sign of the law. Hall's viewpoint keeps you on edge at all times while Butch Cassidy and the Sundance Kid keep riding.\n\nThe soundtrack to Butch Cassidy and the Sundance Kid is classic tunes from 1969. They songs fit the film with an easy personality like a breeze of air grasping the characters as well as the atmosphere. The score from composer Burt Bacharach is charming or encompasses a chill vibe that keeps you either in still suspense or relaxed like the two at ease heroes.\n\nNotably, the supporting cast in Butch Cassidy and the Sundance Kid is impeccable. Katharine Ross is dreamy as Sundance's steadfast girlfriend Etta Place. Jeff Corey gets a shining moment when he scolds Butch and Sundance as Sheriff Bledsoe. Even a young Cloris Leachman makes an appearance as the sultry Agnes that makes out with Butch Cassidy. All in all, this is a prime example of a skilled supporting cast.\n\nLastly, Paul Newman and Robert Redford are indescribable as the leading men Butch Cassidy and Sundance, respectively. Newman is surprisingly hilarious as the charming intellectual Butch. Newman transforms William Goldman's witty script into verbal genius. Redford is really cool as the calm and calculating sharp shooter Sundance. Redford makes you believe he is a deadly sure shot with his intense eyes and lackadaisical attitude that exudes confidence. Together, their charisma and chemistry is palpable. Newman and Redford make this film a classic with realistic performances and endless charm. Butch Cassidy and Sundance are as cool as criminals have ever looked in cinema.\n\nCheck out this excellent Western crime thriller! The chase sequences and shootouts are worth the price of admission alone!",
            "review_date": "2019-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching Redford & Newman together is a joy - but Westerns just aren't my thing and there isn't anything here that is going to overcome that fact.",
            "review_date": "2019-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The on screen chemistry between Newman and Redford set this film apart, a witty script and enjoyable soundtrack help to keep things moving.",
            "review_date": "2019-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A western drama comedy at it's best, without being slapstick. A must see.",
            "review_date": "2019-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly entertaining Western takes a lighthearted, but not insincere view of outlaw life and gives its two leads lots of room to expand (and enjoy) on their buddyhood, while never losing pace of the tale, and offers some spectacular landscape cinematography; the soundtrack may have been popular, but is a bit incongruous to the goings-on.",
            "review_date": "2018-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without a question one of my favourite Wild-West-Movies",
            "review_date": "2018-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun ride throughout, especially the part with the followers in the distance. The practical effects are amazing, the shooting on location is super cool and really puts you in the wild, Wild West. A kind of movie that is simply not being made anymore and deserves your attention .",
            "review_date": "2018-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic western of the 60’s era of film. Butch Cassidy and the Sundance Kid relies on it’s smart and witty screenplay that defies genre conventions and the perfectly matched chemistry between Paul Newman and Robert Redford. ",
            "review_date": "2018-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic film, wonderful script and great performances. A film about the love of friendship. A must see for anyone who has not seen it!",
            "review_date": "2018-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns ever, newman and redford are perfect together.",
            "review_date": "2018-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything I wanted in a movie is here. This is a very personal review, simply, because it's impossible not to make it  personal with Butch Cassidy and the Sundance Kid.",
            "review_date": "2018-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Old fashioned train robbery fun.",
            "review_date": "2018-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns in the golden era of cinema, even though it centers around two notorious outlaws. \"Butch Cassidy and the Sundance Kid\" may have over exaggerated some of the facts, but- Damn it! Its screenplay nails every beat and keeps us invested in the story. Not only that, but the ending is a worth a viewing since it's well made and action packed. Robert Redford and Paul Newman were perfectly cast in bringing these characters to life. Their presence just shoots off chemistry that will actors be inspired. Definitely a good addition for the Western genre.",
            "review_date": "2018-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated western, bizarre out of place soundtrack ",
            "review_date": "2018-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Newman and Redford are a fun dynamic pairing. Their chemistry is great and the pacing keeps things lively. There is a love triangle that never is really addressed after looking to be an important part of Butch and Sundance’s relationship.",
            "review_date": "2018-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Newman and Redford have such a relatable banter that the rest of the film is secondary to it. The script is good, and the film is memorable and fun.",
            "review_date": "2018-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "people kept robbing it..\n\nButch Cassidy And The Sundance Kid\n\nThe chemistry between the lead characters is the key to this feature that breeds soft moments in this hardcore western world where everything is fair. George Roy Hill's brilliant execution skills helps this feature sail off to the shore smoothly where a bit more editing would have done no harm. Robert Redford and Paul Newman are convincingly good in their sibling sort of relation and carries it all on their shoulder. Butch Cassidy And The Sundance Kid being a character driven feature has brilliant performance, execution and character development in it but unfortunately lacks a gripping screenplay that may allow the audience to drift off once in a while.",
            "review_date": "2018-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic anti-western starring two great actors. One of my all time favorites.",
            "review_date": "2018-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This suffers from massive unevenness. It starts as bubbly fun, paradoxically slows down while they're on the run, & then gets tense when in Bolivia. The bookends work, but that overlong middle section is such an uncharacteristic slog. Still, everything else is about as fun as a western can be. Newman & Redford are basically a super cute couple: banter, longing smiles, light-hearted bickering, unending love. Best of all, there's never a lame save-the-cat moment to make us root for them. We just do it instinctually.",
            "review_date": "2017-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly fun, lightweight cowboy outlaw flick with great, naturalistic dialogue, and an unbeatable pair of lead actors. It didn't resonate much with me, emotionally, partially due to the way female characters with whom our leads are attached get handled; there's very little for them to do but worry.",
            "review_date": "2017-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9.5 out of 10:\n\nThe plot might not offer much but Butch Cassidy and the Sundance Kid is still impressively shot, exciting, and offers a great lead duo.",
            "review_date": "2017-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was four years old when I first saw this movie in the theater back in 1969. Still to this day one of my all time favorites",
            "review_date": "2017-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A romantic interpretation of the life of an outlaw. The witty duo, Redford and Newman, has become mythical since The Sting. A must see.",
            "review_date": "2017-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Burt Bacharach's iconic song and the sharp dynamics between Paul Newman and Robert Redford make Butch Cassidy and the Sundance Kid a classic Western.",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nobody can argue with how great Redford and Newman are together in this film. Their interaction makes them so funny and charming that it would be difficult to not root for them, regardless of the fact that they are bank robbers. However, the movie has a strange pace, and even stranger music. The \"Raindrops Keep Falling On My Head\" sequence seems really out of place and will definitely remind you that you are watching a movie. It's certainly not a bad movie, but it is difficult to see why it is regarded as such a classic considering other movies that are usually mentioned alongside it.",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy & The Sundance Kid is, unquestionably, one of the most iconic movies of all times, featuring one of its most iconic partnerships, and one of its most iconic endings. In the first half I was wholly invested, loving the 2 lead actors and their repartee, adoring the beautiful cinematography and enjoying the snappy dialogue. Newman & Redford make a winning pair, and some of its opening scenes, especially where the latter is accused of cheating in a card game and has to escape unharmed, are fantastic. But at the halfway point, when our heroes flee the States for Bolivia, everything goes badly wrong. Roger Ebert claimed in his review that this was the point the film starts going downhill, and it does, very, very rapidly. The funny banter dries up, the pace slows to a near-halt and very little of real interest happens. I couldn't believe how much of a let-down it was, considering how much I had been enjoying it up until this point. The climactic scene is great, tense and exciting, but at that point all I wanted was for the film to end. If the quality of the first half had been maintained I would happily join the masses in calling it a masterpiece, but for failing to be the sum of all its part, I can only call the movie an unbalanced disappointment.",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the all-time classics in any genre.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charming meta-comedy with mixture of hipness, heart and genuine characterization. Some reviewers may take offence at how chunks of this crime and chase-sequence actioner float by like effortless comedy, but bare in mind that the genre had created thousands of titles at this point. The hazy, AM radio feel, unconventional editing, social satire, and self-consious \"movie\" elements are the core reference point for numerous Tarantino films decades later",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and the Hole in the Wall gang are out for money. They have robbed a ton of trains, but like poor people tend to do they squandered it away over and over again. It starts out with this sepia introduction, which almost threw me off the movie early. I don't really WANT to watch a movie made before 1990. I don't like the way they look. Spoiled by digital filmmaking. But, wanting to be well versed in film, my journey takes me to them occasionally. Let me say I shouldn't always be so set in my ways. \n\nAbout 35 minutes in you are growing to like the characters played by Paul Newman and Robert Redford and you are hit with a highly formidable for that they can't escape from. They are being chased by the baddest lawmen money can buy. Those first thirty five minutes are admittedly the best of the movie, before it becomes an extended chase scene. The performances by the main cast are marvelous thought, throughout.\n\nAlot of money was spent to have the movie shot in real locations, and it shows. The landscapes are beautiful during the endless chase. The dialogue is witty. Maybe too witty for those in 1970, hoping to be whisked away to 1910. But both the modernization of dialogue and when screenwriters take it back (like Deadwood) are both valid ways to sell a movie set 100 years ago to a modern crowd. \nBurton Bacharach did the score too, so it doesn't strike you like a Leone western does, but feels more contemporary.",
            "review_date": "2017-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At the tail end of the 60s, with the Western having had a nice decade long run, Butch Cassidy and the Sundance Kid comes along and offers up a flawed but ultimately enjoyable film that shakes up many of the tropes of the genre. Rather than going for a gritty tone in line with many other Westerns, William Goldman's script focuses on character interactions and a surprising amount of comedy between Cassidy and Sundance. The script and the direction George Roy Hill takes this story in manages to keep a mostly lighthearted tone while still reminding everyone that the two leads were criminals who made a living robbing trains and banks. What really sells this tone is the pairing of Paul Newman and Robert Redford as Cassidy and Sundance, who share impeccable chemistry and are the true life force of the film. Of course, the more familiar aspects of a Western are here as well: the sweeping cinematography of Conrad Hall beautifully captures the expanses of the Western U.S. and Bolivia (actually Mexico during filming), and the production design of each town and each interior feels authentic in a way they should. It begins to slog in the middle, as the film starts to lose some focus and jumps from scene to scene without proper transitions that make it feel natural, and the strange addition of montages with no dialogue (including one with just still frames) are oddly jarring and kill any pace the film may have set up. The Newman-Redford pairing truly makes up for all of these flaws though: their camaraderie alone is enough to make this one worth a watch.",
            "review_date": "2016-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Known as a classic and based on a story of two bank robbers - Butch and the Sundance Kid. This is a mixture of everything. Known as a biographic western drama, but still filled with action, crime and also plenty of humor. The strongest part for me was the connection and chemistry Paul Newman and Robert Redford had on screen - very impressive and the snappy dialogues is beliveable. Oh, and that \"Burt Bacharach - South American Getaway\" song is hella cool.\n\nI dig the script, I enjoy the acting and I like the story and the way it develops. It got some all right scenes - entertainment wise, but not all of them are strong. The problem is that there is too much in the mix here, so I don't get a total feel of either action, drama or humor. It's also too soft on many levels as well. OK classic, but it's not deserving it's place on the IMDB's top 250 list.\n\n7 out of 10 shootouts.",
            "review_date": "2016-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Newman and Redford create a duo that simply remains unmatched in the history of film. Their stunning performances and chemistry make this movie a must-see for any western fanatic.",
            "review_date": "2016-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the plot for this film is fairy thin, the chemistry between the two lead characters keeps the viewer entertained. The cinematography is  very good and the final scene memorable, but the film seems too long and is poorly edited in places. Considered to be one of the best movies of all time, one of the greatest westerns of all time, and features a classic movie song. AAN 1001",
            "review_date": "2016-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty, funny script. Actors who can act. Gotta love it.",
            "review_date": "2016-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quality film and a great chemistry between Newman and Redford",
            "review_date": "2016-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films in which nothing happens. Beautiful.",
            "review_date": "2016-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How is this a 93%??? I mean, it was okay. It had its moments... but, 93?!? FOH",
            "review_date": "2016-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best buddy movie of all time.\nI could do that. Could you do that?\nHow can they do that?",
            "review_date": "2016-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Newman and Redford's chemistry will seep out of the TV and onto the of your living room in \"Butch Cassidy And The Sundance Kid,\" William Goldman and George Roy Hill's love letter to the beautifully rustic charms of the American Old West. With an iconic score and an equally iconic slew of images, the film is sure to please both Western geeks and casual moviegoers alike. It's got sass, wit, blisteringly funny moments of levity, and a rightful place on the brighter side of film history.",
            "review_date": "2016-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you've seen the Top Gear special where they travel through Patagonia then you'll remember all the references to Butch Cassidy. I had just finished watching that special so I decided that I couldn't put off watching this film any longer. Butch Cassidy and the Sundance Kid is often called one of the best films by several critics around the world, and while I get what they see in it, I don't think it was nearly as good as I expected it to be. \n\nThe cinematography in this film was nothing short of brilliant. I loved each shot of the cavalry chasing after the gang all the way to Bolivia. You never really got to see who was apart of that charge which made the eventual moment when we discovered their identity rather underwhelming. The posse was presented as this mysterious force that the pair could not evade no matter where they attempted to hide, and little did I know that would make up the vast majority of the plot. There of course were moments at the beginning and end that I enjoyed, such as the \"knife or gun\" fight and the big shootout at the finale. There were several other moments though that didn't really help the plot along or even keep my interest which I really thought hurt the overall pacing and entertainment value of the film. The sepia tone moments were irritating as well. I definitely get what the idea was, I just didn't care for it. I will say though that Butch Cassidy and the Sundance Kid had a much more comedic vibe than I expected and the chemistry between Newman and Redford certainly made each scene that much better.\n\nButch Cassidy and the Sundance Kid is another classic film that I can now cross off the list. It was an above average film but certainly not worthy of the legendary status that is often bestowed upon it. Don't get me wrong, you'll have an enjoyable time watching it, I'd just advise you to slightly lower your expectations before you do.",
            "review_date": "2016-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Butch Cassidy and the Sundance Kid\" is a classic within its genre, but other westerns have certainly aged better.",
            "review_date": "2016-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Redford and Newman at it again. If you don't love Butch and Sundance then you don't love cinema.",
            "review_date": "2016-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I literally cannot find a thing I didn't love about this film. Amazing characters, great story. By the end of the film I couldn't say who was my favorite out of the two main characters, as they seem to almost make up two parts of one, insanely cool protagonist, while at the same time standing on their own as really engaging individuals. The dialogue and acting work hand in hand to bring you closer to this outlaw duo as they evade capture and laugh in the face of authority. \nThis is a classic of cinematic filmmaking that should not be missed. The action and innuendo is so on point and engaging that it doesn't feel at all like it is as old as it really is, which makes it truly special.\n\nIn short: This movie fucking rules!",
            "review_date": "2016-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More light hearted than I thought it would be.  A few times it goes into a musical montage which felt odd from a modern viewing.  The best part and the reason this holds up is Redford and Newman.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I see myself as an old soul. I like old music and old movies. I've always heard of this movie as one of the classics. However, I thought it was kind of a snooze fest. It was filled with montages and was just lacking in general excitement, laughs and wholeheartedness. I wasn't attached to the characters and it literally took me 3-5 days to finish watching this film on Netflix. There were times when I felt like giving up on it, but the last 10 minutes managed to merit the 2 stars given here.",
            "review_date": "2016-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Newman gives a charismatic performance, which gives a lot of fun to watch this work that captive, makes you laugh, makes things tense and brings one of the best entertainment movies of all time.",
            "review_date": "2016-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loose and liberal train robbers on the run. Charismatic aye, but genious no. They may make each other good, with one brain and one quick hand. Overall it's stands out as a totally meaningless piece of lucid entertainment, with no superior sublime-ness.",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an awesome movie!  I love the plot, the classic music, and the development of the characters.  Everything about this movie feels like a classic.  The only point of the movie that I wish had been different was the ending.  I wish they had made a more open ended ending.  I would have looked forward to a sequel.  The characters were so well developed that I felt I had a stake in what developed and almost wish there was another movie to continue the plot of the story of these character's lives.  Highly recommended.  Plus by seeing this movie I now understand one of the biggest radio music hits of all time! =)",
            "review_date": "2016-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic! Newman and Redford are a brilliant duo, and the story's great. Some lovely directorial touches too.",
            "review_date": "2016-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just watched this movie in the theater. Even more than a western this film is a great buddy movie. It's funny and you're always rooting for these guys even though they are technically \"bad guys\". For its time, the cinematography was probably pretty great. It won the academy award that year for it. The two lead actors were incredible in these roles. The ending was superb. This is definitely one of my favorite western movies.",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The classic entertainment over substance thriller that transcends being a western by being of the highest concept possible. Paved the way for the adventure films of the last thirty years. Lucas and Spielberg seem to be the chief beneficiaries of what this movie started.\n\nThe first half was more gripping than the second and it had some tonal inconsistency. The pacing is slow by today's standards and the storytelling is awfully thin. It is still enjoyable and influential enough to warrant at least one viewing.",
            "review_date": "2016-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't think of a better way to wind down at the end of the day than to sit down with Netflix and watch this movie. It's a typical action western genre film, with plenty of gunfights and explosions to satisfy the male mind and enough story to keep it interesting. Newman and Redford are a great pair of thieves and the way the movie makes you sympathize with them while they're looting trains and getting people killed is a great character device. The ending is a breath of fresh air compared to today's action movies (no spoliers), I know I wasn't expecting that. I haven't seen a movie without sequel-baiting in a very long time. Overall, this was a very enjoyable experience for someone that hasn't seen too many older, classic movies.",
            "review_date": "2015-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "94%\nViewed this on 29/11/15\nOne of the best and the most beautiful westerns that I have ever seen and I wonder how two such crooks could be this thick as friends. The film benefits from the extraordinary chemistry of stars Robert Redford and Paul Newman, the awesome dialogues, the extremely good cinematography and a background score that fits it's atmosphere. Unlike most of the other Westerns, this one has an original plot, hell it's even based on true story. It has style and also mixes that with substance and whenever you feel that it's stepping down, the chemistry of it's stars bring it back to ground. The film is so visually striking and stylish that you can call this as one of the first neo-noir films of all time. Moreover, unlike many other Westerns, this is more realistic because it's violent and it ends in style.",
            "review_date": "2015-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Obviously a classic cowboy film, but for me it was a bit slow and didn't flow that well",
            "review_date": "2015-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "interesting.  classic.",
            "review_date": "2015-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was bored. not a lot here. homoerotic? 60s \"hippie western\" without any gravity. Is it full of irony I missed? it's not clever, an action-packed romp, nor a cinematographic achievement.",
            "review_date": "2015-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very similar to The Sting, except it's a western. And, it proves again that Redford and Newman could have had careers as male models.",
            "review_date": "2015-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great technical work from the start with the silent movie introduction and then the later telling of part of the story just with stills and song.  It has a way of just drawing in as the movie-goer has to infer the story being told.  Newman and Redford have great chemistry as the nortorious thieving duo being chased by a well-trained group repeatedly referred to as, \"who are those guys?\".",
            "review_date": "2015-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and the Sundance Kid is an extremely appealing, unique, and captivating western comedy that originally had me questioning bits and piece and impressed me by the middle. The characters and the chemistry between Newman and Redford make the film incredible and one of the greatest ever.\nFeared outlaws Butch Cassidy and The Sundance Kid make a plan to start a series of mass heists in Bolivia, along the way robbing trains and gun slinging all the while to save themselves from evident danger in every corner.\nButch Cassidy and the Sundance Kid, a \"mostly true\" biopic western, is captivating and incredible. Originally I noticed the lack of plot in the beginning but when the characters enter Bolivia things kicked off. Butch Cassidy successfully packs everything in one: action, comedy, and an exciting story. The chemistry between Newman and a show stealing incredible performance by Redford make it what it is. The Sundance Kid may be one of my favorite film characters - he's a tough gun slinging renegade of sorts that is hard not to appreciate. Not many cons here except it hasn't aged so well and the beginning of the film tends not to know what to do with the story. Amazing film.",
            "review_date": "2015-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic, one of the great films of all time. Newman and Redford were the greatest team of all time. Funny, likeable, believable and just wonderful to watch. The story was excellent, the casting was excellent, the musical score was arguably the best ever. It was one of those perfect films that you can watch over and over. And there isn't one area of this film that I wished they'd done it differently. \"If he'd just pay me what he's spending to make me stop robbing him, I'd stop robbing him\".",
            "review_date": "2015-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decades now from when it was released, \"Butch Cassidy and the Sundance Kid\" has held a reputation of being the exceptional American film in the late 1960's. But, today that reputation ultimately feels misleading; and even back in its own time, it is hard to understand how it garnered such a reputation. The frustrating pace the film takes is a constant irritant that distracts from Newman and Redford's chemistry, but the film has a solid first 40 to 50 minutes that promises good things to come. The promise is broken, of course, which makes the frustrating stoop all the more irritating, knowing that there was so much potential behind the film, only to be wasted on pointless locations.",
            "review_date": "2015-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The funniest western I have ever seen.",
            "review_date": "2015-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "with the the great chemistry between Newman and Redford butch Cassidy and th sundance kid is a very entertaining and quintessential western film",
            "review_date": "2015-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A buddy-criminal western flick that succeeds almost entirely on the strength of the actor's performances, the wonderful cinematography, and a few really well-executed jokes.",
            "review_date": "2015-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It falls short for me as true western and a watchable comedy, but without a doubt, Butch an Sundance is a classic. It's a well filmed, well conceived, greatly acted film that replaces grittiness with cuteness, with an underlaying, sad longing of the simplicity of the past. It was a breath of fresh air to see this film appear after the dawn of a new violent revolution of movies. The film famously cuts before we see the final bloody shootout. The beautiful soundtrack by Burt Bacharach is also great to listen to.",
            "review_date": "2015-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Paul Newman and Robert Redford develop a terrific chemistry, Butch Cassidy and the Sundance Kid is an overrated western with no real story at its core",
            "review_date": "2015-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a fresh western with classic visual poetry, finely acted by Newman and Redford, and it's nice to see some outlaw fun before justice is served, but the execution isn't portrayed as all that attractive.",
            "review_date": "2015-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Coming from a drama,comedy, and Romance from the original bromance of Paul Newman and Robert Redford!",
            "review_date": "2015-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I miss the late 1960s.  Not that I lived during them, not that I look back at the Vietnam War as if it were a good time in American history, not that I'm one of those young buffoons who blames their friendlessness on their possession of an old soul - I miss the late 1960s because of their filmmaking.  There was a feeling that anything was possible, that stars we got to know in the earlier years of the decade were suddenly drifting toward the game-changers rather than the drivel wholesome pieces, that Hollywood was suddenly a hip place instead of a soap scrubbed habitation.  How movies finally had something to say, whether it be artistically or socially.  It's exciting how we could have waltzed into the theater in 1960 to see a \"Pillow Talk\" 2.0, only to come back a few years later and find ourselves with \"Blowup\", \"Easy Rider\", or \"They Shoot Horses, Don't They?\". No decade has come close to the reinvention seen in the shape-shifting decade.\n\t\"Butch Cassidy and the Sundance Kid\" is one of the defining films of the time, among the series that entertained us with an easygoing, lo-fi atmosphere rather than a chintzy, big-budgeted one.  It's a reverse Western: everything looks as though it could be a part of a later-in-life John Wayne adventure, but the tone is less rugged, more self-deprecating.  It's a hybrid of different styles, some reminiscent of Robert Altman, others Robert Benton and Peter Bogdanovich.  Only slightly serious, with more than enough comic relief to call itself a - gulp - comedy, it's difficult to put a finger on what \"Butch Cassidy and the Sundance Kid\" really is.  Perhaps that was intentional, going out to be an undefinable western romp and coming back a champion.  But I suppose its breeziness is part of its charm.  Without a care in the world, the actions of the titular characters are unpredictable and wandering, as though it all were improvised.  So thank God Paul Newman and Robert Redford have enough charisma to keep us from snoozing as if we were being faced with a laborious spaghetti western.\n\tNewman is Butch Cassidy, Redford is the Sundance Kid; as the Old West's most formidable train robbers, they are said to be legends - just don't expect them to wear the term like a five-year-old dons a Superman cape.  They view their actions as time wasters, as a way to have some fun on a boring Sunday afternoon.  They don't like to kill.  They like the thrill that comes with running away from the law.  The danger is appealing. \n\tBut they've been doing the same thing for too long, and they're well aware they aren't going to live to be one-hundred, with so much flak behind their names.  They're going to be the victims of a shootout, maybe in a week, a month, a year.  So Butch Cassidy, or the Sundance Kid, I don't remember which, proposes they go down to Bolivia - there, they can refresh their thieving ways, and, eventually, live a normal life.  In tow is the Sundance Kid's girl, Etta (Katharine Ross), and for the first few months, things are blissful, successful.  But when an old enemy makes his way into the area, they realize that escaping from past wrongdoings may only be a temporary solution.\n\tWhen \"Butch Cassidy and the Sundance Kid\" isn't making us laugh, it moves by slowly; because it doesn't have the same mesmerizing quiet of other crime based dramas, like \"Thieves Like Us\" and \"The Thomas Crown Affair\", a moody setback does nothing besides pander by.  But when the film is good, it's great.  Newman and Redford have better chemistry than some of the most notable screen couples of the time, conversing with such witty ease that we can't help but want to be a part of their crime spree ourselves.   One of the best scenes in the film, which finds the duo at the edge of a cliff as the law chases them, is ecstatically funny, an inexperienced Redford complaining that he doesn't know how to swim, worried that he and his crime partner might have to jump.  Newman guffaws like an older brother, and, when they do go through with the deed, their rapport, especially as they go downstream, is delivered with effortless comedic energy.  Newman and Redford are fantastic together: as the quintessential everymen who happen to be movie stars, they seem destined to headline together.  How they only made one other film together (\"The Sting\") is mind-boggling - they put the B in bromance.  You can forget about Starsky and Hutch, Crockett and Tubbs; Newman and Redford are the real deal.\n\tBut \"Butch Cassidy and the Sundance Kid\" relies too much on the charisma of its stars.  That isn't necessarily a bad thing, considering how excellent it is most of the time, but when it drags, it drags.  It's better off as a comedy, and when it decides to go for a serious moment, we're hardly convinced.  We want to have fun with our actors, not see them in crisis - the ending, all \"Bonnie and Clyde\" \"tragic\", doesn't fit.  We want more adventures.  If Clint Eastwood were starring, maybe we'd be okay seeing him go.  It would be heroic.  But Newman and Redford are much too likable to be too-serious-for-their-own-good anti-heroes, and we don't want to see their brotherly love come to an end.",
            "review_date": "2015-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic.  But not that impressive.",
            "review_date": "2015-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film starts off very well and has a good and cute little introduction to our characters with font that would look like the basis of what would be standard for Sony Vegas. This is a very iconic, influential film and is a fondly remembered classic Western, if they gave Best Picture based on what remained fondly remembered, this would win, but I thought 'Midnight Cowboy' was excellent, and, hey, at least they both won for Writing. It was surprising to find out that such a romantic and classic song, 'Raindrops keep Fallin' on my Head' came from a film like this and he should have been more careful on that bike! The story is the basis for what would inspire the modern action story as it is tight and thoroughly watchable. The film has a great style and looks absolutely wonderful, early on in the film everything has a gold tint to it and is very unique; I also expected Kid to be shot when he was accused of cheating. The film has an absolutely grand feel that has some absolutely beautiful shots; it also stages the action well and has a fantastically original, memorable and catchy soundtrack. The film also has a great sense of humour, a scene in particular about Kid saying he isn't picky and then goes on to demonstrate how picky he was, was just a nice little way of putting humour in there, although it ended strangely. There was also a point where Kid says, 'I'm better when I move', I expected Butch to say, 'I can see that'. There was a part with a huge explosion after using too much dynamite that should have killed them because of the spirit the film has and how much fun you're having, it doesn't matter. \n\nThe acting is naturally great and the pairing of Newman and Redford is legendary. These two would go on to work with George Roy Hill a few years later as well, to huge success, even bigger than this! Funny how the one that is most remembered out of the two didn't win Best Picture, but, hey, neither got Best Sound! It made me laugh that Butch said it was his gang, poor Kid. Speaking of which, Harvey looked like Josh Brolin and Woodcock reminded me of Kevin Spacey whilst being the kind of character that he would play as well, but even if there was a remake, which hopefully won't happen, no way would either of those do such small parts. It is also the big screen debut of Sam Elliott! It made me laugh that there as a 'Cassidy' involved with production of this film and that person was Harvey, funnily enough. When they rob another train and the authorities finally decide to do something about it, with our characters just standing and watching, I don't think the intrigue of that went anywhere. There is certainly something very ominous about watching torches just continually following you throughout the night as well as the fact that they're always on the horizon just consistently on your tail. Even if you do have to wonder if they would continue to follow for so long but I'm surprised that the authorities never saw them, even once, as it did seem at some points that they were very close. There was a part with a very loud gunshot that Kid fires where, just from looking at their face, it looks like it spells doom; I even wondered at some point if the people following them was their own gang, or, whatever was left of it. I know we see the authorities coming from the train at the start to chase after them but you never know what might have happened, maybe that would be a plot point in a remake and it would give Harvey something big to do and they seemed to have found that person they tied up pretty quickly. I'm also surprised that the conductors of the trains just let them rob it with little to no resistance; you could argue that the gang had weapons, but still, it seemed odd. There's also a shot from someone's perspective on top of a cliff with a shotgun near the start of the film and I thought they were going to start to open fire on Cassidy and Kid. \n\nDespite the fact that William Goldman is an excellent writer, who would go on to work with Redford again in another Oscar winning screenplay, especially with this as it is an original screenplay, as you would probably expect this to be based on a book of these characters or something, the things I didn't like all that much are parts of the script, some of the dialogue felt a little stiff and out of place, mostly by what Butch says, coupled with the fact that Kid didn't talk all that much. The way that he said 'they're getting on my nerves' or 'who are those guys' or how they both say 'no fooling' right after one another or that a character stops, when he is being chased, just to make a witty quip just seemed odd when they were spoken by the actors. I know the film is based on real exploits but I find it very stupid of the characters that have just relocated to a new area to escape the law; I might add, go and rob a bank the very next day. It wasn't even like they were hiding it either; they go to a restaurant in the evening and recite the language of the phrases they need to know and nobody caught onto that fact? Especially after the fact that there are wanted posters posted around anyway. \n\nI also didn't really feel that the characters liked each other all that much or were all that developed. We do learn things about our characters right up until the very end, even with a very critical thing you would have expected Butch to already tell Kid before this situation in the last reel. Kid tells Butch to shut up, because telling the brains to shut up makes sense. Butch remarks at one point about being a hero, which is odd seeing as how the scene before involved him robbing a bank. Throughout the film they are very clearly being hunted to be killed, not to be put in jail but one of them still remarks that if they give themselves up they might just get jail time, really? Earlier on Butch says he is going to jump in a river, he later says that the fall would kill them and then they both go to jump anyway, because that makes sense? It also seemed odd how Kid understood the foreign language well but wasn't the one to speak it himself. There is also a very odd bed scene where it looks like Kid is forcing someone he doesn't know into doing something she doesn't want to do but then it's revealed that they're together, but that relationship was weird because she was spending time with Butch as well. There was one point where it looked like he was pretending to reach for his gun when Kid says, 'take her', but even with that it is terrible because he clearly isn't too bothered about her. I know Kid was needed for lookout but I do find it odd how Kid was on watch in the very same room that Butch was trying to be with a girl, in. \n\nWhile the editing of the film is good, there is a picture montage of their trip to where they are going in the film and it goes on too long to the point where it overstays its welcome and we get the point. It goes on so long you'd expect them to just film it and splice clips together, but, hey, it's cheaper to a montage as well and it wasn't all bad. There was a point where they go to find proper jobs, which is about time, and I thought it was funny that they were standing so far away from the table; I thought they would just be right in front of it. I bring that up because later on here is a gun fight and they don't get hit, of course but before that, there is a shoot out that goes very loud all of a sudden and then quiet and all the while has someone screaming 'no' in the background and it seemed odd. \n\nThey should have run out the back at the end and that immediate look of horror that Butch shows is excellent and ends it well. I read that they ran off into the sunset whilst being shot and killed but the way this ends is great, fits the excellent style and somewhat leaves it open, to spare us from what is happening as well. I really did enjoy the film, but like usual, if I have issues I will focus on those more just to get my point across instead of just repeating what has already been said but I really did enjoy this film a lot. It has a solid story, good acting and is a fun film to watch that was excellently crafted and remains a classic for good reason.",
            "review_date": "2015-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beloved for all the right reasons.",
            "review_date": "2015-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A colorful western that could be sold to kids if you cut out some of the violent parts. It almost has a Disney feel to it. You get the sense that the characters will never be in real danger because even when cornered they always seem in control of the situation. Like the waterfall scene. You know what's going to happen even before they do. There's no real suspense or tension in the movie. You might like it more if you watched another Redford and Newman film first, like The Heist, because if you don't go into the movie already a fan you won't appreciate it as much.",
            "review_date": "2015-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic film that was fun to revisit on Blu-ray.  The movie is made by the chemistry of Newman & Redford, they absolutely make the movie.  If you've never seen it, then seek it out!",
            "review_date": "2015-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing pair of actors, in a film that is a must watch.  Hilarious and tough, Butch Cassidy is thoroughly entertaining.",
            "review_date": "2015-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok mediocre classicmovie starring some old actors. This movie hasn't aged well over the years because this movie made me fall asleep.",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Newman, Robert Redford and Kathrine Ross (of Mrs Robinson-fame!) being witty, robbing banks and shooting a lot in the wild west and in Bolivia! The best scene still is the one with bicycle and \"raindrops are falling.....\"",
            "review_date": "2015-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the finest screenplays written, performed by one of the best onscreen pairs in history. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Redford and Newman have perfect chemistry, and there are great moments of pure adventure, but Butch Cassidy and the Sundance Kid does suffer from an episodic nature.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it is an essential to the western genre by today's standards it's not that great of a movie. It didn't hold my attention and it just felt really boring.",
            "review_date": "2015-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one hell of a movie and with a ending like that, how can I not give this a 5.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trip hippie western that wants to be another Bonnie and Clyde. A fairly non-existent plot as well.\n\nHowever it's all about the double act, the set-piece scenes and the gags. Reminded me of childhood Christmases.",
            "review_date": "2014-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic! Loved the ending!",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well acted,good screenplay with the action well paced. love the ending.",
            "review_date": "2014-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has moment of brilliance intertwined with strange production decisions, such as Burt Bacharach's soundtrack and stopping in the middle of the movie for the \"Raindrops Keep Fallin' On My Head\" music video.",
            "review_date": "2014-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i expected their chemistry to be way better. for instance, Rob downey jr.s sherlock and Jude Law's Watson were supposed to be based off these guy's chemistry, yet Rob Downey and Jude Law had way better chemistry. Despite this being a better movie overall in every other aspect.",
            "review_date": "2014-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Personally I didn't particularly love this movie. Sure it is a uniquely told/style for a Western and I appreciate that. I also liked the humor, comradeship, and thought the movie was paced well. What I didn't care for was the message and whole nonchalance of robbing ppl as tho it's ethical and these guy were kinda heroes or some Hollywood crap. These guys were bad guys not rebels or Robin Hoods-they kept the money for themselves. Real rebels don't have to hurt or steal from others to buck against the system. Give me a break that they had no other option to go \"straight\" and that they only murdered ppl when they played by the law. For some reason we tend to idolize robbers/murderers in Hollywood like Bonnie and Clyde and I think its terrible. I bet these guys weren't so likable in real life. I thought movie to be pretty shallow entertainment.",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Newman/Redford ... Who knew ... Lol",
            "review_date": "2014-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are two westerns that I want to see: True Grit and Butch Cassidy and the Sundance Kid. Butch Cassidy and the Sundance Kid is one of the movies that I had to watch fast before it expires for Netflix. I can see why it's a classic movie because it's the chemistry between Butch Cassidy and Sundance Kid. Robert Redford and Paul Newman are perfect in this and the writing between those conversations are excellent. It also give some memorable scenes in it that people would remember like the train explosion scene, the \"I can't swim\" scene, and many others. The gunfights are really good, the comedic timing is excellent and is just hilarious. I get to know a lot about the two main characters, and they are the reason why the movie is a classic.",
            "review_date": "2014-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic, Redford and Newman are terrific.",
            "review_date": "2014-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is sort of a biopic about the late days of Butch and Sundance. I find it really interesting that they made the choice to focus the film on the later days of their lives, because when you think of Butch and Sundance you naturally suspect a classic old Western, but they deliver something a bit different from that. Although not from the beginning because the opening scenes are more of that classic Western style, with a bit of a comedic twist, and I love them. Most notable are the entertaining moments when Butch and Sundance are actually robbing a couple of trains as the nicest thieves ever. Then there's the entire center section of this film. I deeply disliked this section. From the moment Butch shows up with a bicycle and \"Raindrops Keep Fallin' on My Head\" starts to play, the movie goes completely off the rails. This scene leads into a half-hour long (or more) chase scene where the boys ride horses for a while and look over their shoulder, then they ride horses some more and look over their shoulder, then they ride horses some more... You get the idea. I recognize the value of starting this chase, it is vital to the story, but it is dragged out so long the plot of the movie comes to a crashing halt.\n\nWhen the boys get to Bolivia I find that the movie starts to pick up again. From their early attempts at robbery in a foreign country, all the way to their attempt to go straight I was completely engaged again. The final scene of the film is perfectly crafted and fits exactly the style of the movie up to that point (some humor despite all the serious events.) Robert Redford and Paul Newman are superb in the lead roles. Their banter back and forth with one another is what makes the movie special. I never expected so many laughs watching a story like this, especially since I knew the end, but it delivers them anyways. I'm not sure how valuable Katharine Ross' character was to the plot. They seemed to imply there would be this love triangle forming between the 3, but not much comes of that. I could easily see myself completely forgetting her character altogether when I look back at this film, and that's OK because she's just extra baggage. Taken as a whole I think this movie is successful, I just wish there was a way I could shorten that center section. In fact if I ever watch it again I'll probably fast-forward through it, I was genuinely that bored/frustrated by it.",
            "review_date": "2014-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest showdown movie dver",
            "review_date": "2014-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some movies are only remembered for its cast and the hypnotizing spell its performers cast on you so you're willing to forget the film's shortcomings.",
            "review_date": "2014-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charming and well put together, but nothing particularly groundbreaking.",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Iconic buddy-comedy Western. Highlight is the performances and chemistry between Newman and Redford.",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good acting and powerful script!",
            "review_date": "2014-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest Western movie ever.",
            "review_date": "2014-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a classic. Nothing more to say.",
            "review_date": "2014-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The western genre unfortunately is a vanishing art form whose abundance in the 1950's and 1960's, has now been replaced by the new oversaturation of superhero hero films. Truly is there is one genre that will be synonymous with the early 2000's, it will indeed be the comic book genre. Many genres were able to survive the turn of the century including drama, comedy, action adventure, hell even the traditional musical has been reborn, yet the once prevailing western is nearly extinct now; why is that? Some may argue their inherent cheesiness is the culprit, others point to low box office returns for the genre; whatever the reason, there are simply not many nowadays. That sad truth is all the more grueling when recollecting on 1969's, Butch Cassidy and the Sundance Kid which is a classic example of a traditional adventure that is lacking in many so called adventure films of the current era. The two main protagonists are both badass and lovably endearing, both qualities audiences tend to gravitate towards and generally love. I myself found both characters unapologetically nonchalant and admirable in how they refuse to conform into societies set roles for them which a bold decision in both men's parts. Undeniably both outlaws are prime examples of what it means to be an outlaw as well as a westerner. That in mind adapting these two to the silver screen appeared to be a daunting task to any filmmaker, yet in the more than capable hands of director George Ray Hill this is a complete non-issue. Hill took a humongous risk in editing a significant amount of his film with comedic montages such as the famous bike ride with Etta and Butch, while B.J.Thomas's, Raindrops Keep Fallin' On My Head plays in the background; among several other chase sequences with \"hokey music playing in the background'. Yet the risk paid off, in my opinion, due to inherent flamboyancy of the two characters themselves, Butch more so. Because Butch and Sundance rob trains there is bound to be dynamite involved and oh boy does Hill know how to direct, not only explosions with style, but nearly every scene in the film. The Dull dreariness of the western front is instead, replaced with stylish jump cuts, unconventional editing and most importantly originality. Without the obligatory colt revolvers, cowboy hats and cacti, one would never presume this would be the visual style of a western. Overall the incredible risk of Hill's directing made the film better as a result superb directing. A hasty screenplay results in a constant pace and interesting turns in the story, a great screenplay as well. Finally the duo of Paul Newman and Robert Redford are quite simply spectacular, definitely one of the best buddy pairings of all time. Both play off of both the characters and the actor's strengths and weaknesses for both bring something incredibly different to the pairing, Redford nonchalant badassery and Newman irresistible Sauvé. Wither it be there performances or generally charisma both actors are excellent. Every time I see films like The Good the Bad and the Ugly or Butch Cassidy and the Sundance Kid I am consistently reminded of the brilliance of the western genre. Upon great scrutiny I have come to the realization that the reason genre is dead is that very few directors contain the skill to pull off a great western, a quality that certainly holds true for Hill's, Butch Cassidy and the Sundance Kid.",
            "review_date": "2014-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this movie. But I don't love it. There are some irks I have.  The movie has three pretty distinct sections to it. I love the first the best. The second is interesting but not quite a good. And I don't much care for the third and final part. I think my least favorite part of the movie is the music that just doesn't fit the movie at all. It's music that was modern and popular at the time in a period movie. What? I love Redford and Newman. They have awesome chemistry and I love their characters and how they interact and feed off of each other.   I like the subtle but effective way this movie is shot.  The beginning is sepia-tone with no wide establishing shots but lots of close-ups.  And then we have the obligatory lovely landscapes of a western. All the close-ups and quick cuts and stylization are a bit unusual for a movie from this time, so good for them. I dig it. I like the theme of the inevitability of the future symbolized by the bicycle fad and unstoppable almost supernatural super posse. Not an amazing movie, but still really awesome.  I love the humor of a lot! The 2nd train robbery had a moment that had me rolling. and I love how Butch deals with the mutiny of his gang.  Also their famous jump and bickering the way down river. Lots of respect for this movie.",
            "review_date": "2014-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome pic bends history some but I fuckin love this movie",
            "review_date": "2014-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blending action, comedy, and romance, this '60s defining Western (that won't admit it's a Western) paired two legends together to play train robbers, but even their great performances can't cover for the slow pacing and the extremely disappointing final showdown.",
            "review_date": "2014-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting and well acted; BCSK separates itself from the usual Western cliches thanks to its interesting story, funny banter, and well thought out characters.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A different-feel Western featuring two amusing characters who are supposed to be the bad guys.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can I give this a 6/5?",
            "review_date": "2014-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and the Sundance Kid has pacing issues, but the chemistry between Newman and Redford mostly smooths those out.",
            "review_date": "2014-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charismatic pairing.",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ahead of its time if only for its direction and beautiful color palette. The fusion of fantastic storytelling, action, tension, romance, and humor makes it one in a million.",
            "review_date": "2014-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The banter between the two lead actors is definitely the highlight, but every aspect of this movie helps it feel as awesome as it does. You won't be able to resist cheering for Butch Cassidy and the Sundance Kid as every scene springs to life with excellent writing paired with excellent acting, backed by fantastic camera work and gorgeous sets. A",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "PART OF MY CLASSIC VIEWINGS OF 2014 LIST\r\n\r\n\"Lets you and me jump in that river.\"\r\n\r\nIt's the year 1969 and Hollywood, like the rest of America, is in a period of social change, particularly the hippie culture, and in the case of film, the formation of the MPAA rating system, where filmmakers can be more expressive in making their ideal film without being censored by the Hay's Code. And that leads us to Butch Cassidy and the Sundance Kid, a film directed by George Roy Hill, who's intention was to create a western to change all westerns. And while it was a massive success in 1969 and still has a huge fanbase today, but I found this film to be massively disappointing for all its hype.\r\n\r\nPaul Newman and Robert Redford star as two notorious outlaws, Butch Cassidy and the Sundance Kid, who lead The Hole-in-the-Wall gang, and are constantly robbing trains during a time of social change. When the posse is closing in on them, the two outlaws, along with the lovely schoolteacher Etta (Katherine Ross), love interest of Sundance, head off to Bolivia to hit the banks... but as they rob more and there's more soldiers after them, they know that their luck is starting to run out.\r\n\r\nGetting my positives out of the way, the cinematography is excellent. I was impressed with the film's location shots and its unique camera angles. There were some smart decisions on the directors part in filming it. The film opens up with a \"silent\" movie about Butch and the gang ripping off trains, and then shows him and Sundance in a memorable duel scene in b&w, then transitions to color afterwards. Makes me wish that the rest of the movie is as impressive as its cinematography.\r\n\r\nAs for the actual film, as it was starting up, I was expecting this to be a western masterpiece, with the said opening scenes in all. I was entertained by some of the earliest action sequences, especially some of the train heist scenes and I was impressed by the tensions of Butch and Sundance's weakening power. There was also some fun little comedic sequences in these scenes, especially in the most famous moment in the film where the two jump off a cliff to avoid getting caught. But once the characters head to Bolivia, the film goes downhill really quickly. It doesn't help that the transition to Bolivia is this overlong postcard montage of the characters traveling to get there that lasts far too long. They could have put an intermission in there to make the film better. That scene really weakens the film. But what follows afterwards is far worse than the scene I just mentioned. After that overlong montage, the action sequences start to get tiresome and repetitive, there's hardly any suspense as in the great first half, and the most disappointing moment in the film is definitely the final act, during Butch and Sundance's last stand. As I said, the action got repetitive that I didn't care anymore about the film and just as the scene was getting really exciting... it ends, just like that. What annoys me about this is that the Hay's Code had been gone for a couple of years, so it was no excuse for them to create a grand sendoff for Butch and Sundance, but no, they ended like the Hay's Code was still in existence. Apparently Bonnie and Clyde got away with a extremely violent ending for its time (which that's a film I intend to see this year), so it was no excuse for George Roy Hill to do something like it in Butch Cassidy and the Sundance Kid.\r\n\r\nWhile the film mostly disappointed me in terms of tense plotting and action, the stars, thankfully did not. Paul Newman and Robert Redford do excellent jobs at playing these notorious outlaws. You can tell they had fun in their roles and that's what makes them great in the film. Plus they had so many great comedic moments throughout, even in some of the boring moments in Bolivia. The only reason why I decided to stay and finish the film was because of Newman and Redford. They still entertained even when the actual film was not. I also give Katherine Ross credit for being the only main female actress in the film. While this was Newman and Redford's film for sure, she did a fine job at playing the love interest for Sundance.\r\n\r\nThe film is also known for its \"iconic\" score by Burt Bacharach. Even though its score won an Oscar, I hated it. It's one of the worst music scores I've heard in my life. Why? Well, if you want to make a western, I'd like to hear music that sounds like it came from a western, not a hippie movie. And that's what the score sounds like... hippie music... in a western!!!! A montage of Butch and Sundance robbing banks in Bolivia got ruined by this atrocious score, featuring some very annoying 60's style singing, that really made the film dull like the sequences itself. I give it credit for the song \"Raindrops Keep Falling on My Head\", which is a great song, especially with it being something you don't expect in a western, but as for the actual score, it's a massive misfire for something considered \"iconic.\"\r\n\r\nI was wanting more out of Butch Cassidy and the Sundance Kid, more like the acclaim it has, and while it had some entertaining moments, wondrous cinematography, and great performances from Paul Newman and Robert Redford, the film is boring (once they get to Bolivia), tiresome, and anticlimactic for something considered groundbreaking. I might have enjoyed it more had I lived in the 60's but, this film is truly dated. If you're still shocked by my rating for this \"classic\", here's a link to Roger Ebert's review for this film, as his criticisms are similar to mine:\r\n\r\nhttp://www.rogerebert.com/reviews/butch-cassidy-and-the-sundance-kid-1969",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With two really good leads, some decent action, a few laughs, a good score/soundtrack and being mostly entertaining this is an above average Western.",
            "review_date": "2014-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and The Sundance Kid is one of the great movies from the 60s and 70s  The script is written by William Golding, who gave us such charmers as The Princess Bride and The Great Waldo Pepper (also starring Redford), who does a fantastic job of adding comedy and story to the last months of the real Butch and Sundance.  Newman and Redford do a fine job of making us root for these characters and hope that somehow the story line departs from history, and they make it out alive.  .  This is a great one and if you are a film efficiando, you will want to make sure you see it.",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On paper, Butch Cassidy and the Sundance Kid seems like it has all the ingrediants for a good movie-- a talented cast, impressive cinematography, and good editing choices.  And though the film does open great, the final result proves, quite frankly, boring.  The entire time I was watching it, I simply wanted these characters to be doing something more interesting.  Instead, they just run around a lot, only making minor accomplishments once in a great while.  Many scenes drag on far too long, and some just feel unnecessary (the \"Raindrops Keep Fallin' on My Head\" scene felt like it was from a completely different movie).  Overall, though it is not without its worthwhile moments, Butch Cassidy and the Sundance Kid isn't satisfactory.",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic buddy flick pulled off because of it's acting by Paul Newman and Robert Redford. Very iconic scenes including the bike ride, the fight between butch and a rival member in his gang, and their last stand in bolivia. Could've been a great movie with better stylistic choices and a better director",
            "review_date": "2014-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way overrated.The story was simplistic, the set pieces really faky looking...and the music...horrible. I realize it reflects the 60s vibe...but how many songs need to have doo be doo as their main lyric...pretty bad!",
            "review_date": "2014-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Underrated on account of its camp. Its apparent inconsistency only adds to its vigour and variety, though. And it's very American.",
            "review_date": "2014-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very lovable characters and the chase scenes at the first half of the movie were so good.",
            "review_date": "2014-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies i've ever seen.",
            "review_date": "2014-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Butch Cassidy and the Sundance Kid weren't real people, or if Hollywood had zero respect for the two, I could see this launching a franchise similar to Indiana Jones. No, not The Man With No Name. These Wild West outlaws don't take themselves seriously enough to fit in the same category as the Spaghetti Western types. These two are swashbucklers. Regardless of whom the people were in real life, Paul Newman as Butch and Robert Redford as Sundance must be one of my favourite on-camera duos. Butch makes the rules and breaks them all the same, and shoots with his words far more than his bullets. Sundance fortifies his macho exterior so that only those that he loves would dare see his mooshy side. Neither of them give a hoot about anything, besides unnecessarily killing innocent lives. Saying that might hint that screenwriter William Goldman wanted to portray the two as anti-heroes. I would agree, but this isn't a case of the director, George Roy Hill, glamourizing the Wild West culture. One scene that clarifies the truth about Butch and Sundance is when the two are trying to compromise with a bribed sheriff, pleading to start clean. The sheriff refuses because, for criminals with such a legendary history, there is no way to start clean. And just like Butch and Sundance, we quickly look past that because there's just too much fun to be had in all of the commotion of bank robberies, high-speed chases, and few, but fantastic, shootouts. The lack of action may actually be a great strength of the movie, never bogged down by repetition. The \"villains\" (with respect to Butch and Sundance) never appear face-front or speak on screen, while the romantic interest Etta (Katharine Ross), a schoolteacher bored of her village life, stands out as a self-motivated accomplice. There are a couple of scenes where the movie wants to feel old-timey, by means of a silent film, still photos for a montage, and an entire scene in sepia tone. And, most importantly, the story progresses through humour. When it feels like our heroes are about to be wooped, PUNCHLINE. The movie ends on a punchline! And this is still based almost entirely on the true story of Butch Cassidy and the Sundance Kid. However much needed to be tweaked, the tale of the two outlaws is both exhilarating and hilarious, and the small touches I mentioned add a unique charm.\n\n[If you do read my reviews, understand that I'm not trying to articulate perfectly. I write these as personal reference, in case I need to remember what I liked or disliked about a movie. I didn't dislike anything about this one.]",
            "review_date": "2014-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my favorite movie of all time",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ages well. 40 years laters it's still just as cool as the oceans eleven gang...maybe cooler?",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun western, but the script is too cute to the point where I did not feel like I was watching a western.",
            "review_date": "2013-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many has said many but, Newman's portrait still resonates and very few has done that.",
            "review_date": "2013-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy is a great Western film. The story telling is top notch, and the acting is very good. The dialogue was well written and the movie was a thrilling watch. Sometimes it came off as predictable and some of the editing was kind of annoyingly odd. The pacing was off at times, but the film's final act was an unforgettable and thrilling climax. Newman and Redford are great, and really elevate the status of this amusing western film. Butch Cassidy and the Sundance Kid gets 4/5 stars (B+).",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not worthy to review this film. Just watch it.",
            "review_date": "2013-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Iconic for a reason.",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Always interesting, occasionally funny, and well-scripted, Butch Cassidy and the Sundance Kid deserves its place among the echelon of classic western/heist films.",
            "review_date": "2013-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really fun one. Loved Redford and Newman together, they were both awesome. You knew how it was going to end, but it didn't matter.Great one!",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At the turn of the century (as in early 1900's), Butch Cassidy (Paul Newman) meets the Sundance Kid (Robert Redford) and they team up to go on a crime spree. This involves hijacking trains; robbing them of their transported money; and then heading back to this woman (Katherine Ross), to whom both seem interested in and she seems interested in both Butch and the Kid as well. After this, they decide to rob the same train again, using even more lethal explosives. However, the authorities are now on to them and they launch a prolonged chase to capture the two outlaws, either dead or alive, which leads them from the US to Bolivia. It is a compelling enough film in terms of entertainment and story and it was engaging throughout. Unfortunately, when you have seen as many films as I have from the period and genre, you start drawing comparisons and one other film comes to mind...\"The Wild Bunch.\" It's nowhere near great as this movie and its pales in comparison. Released also 1969, \"The Wild Bunch\" is far superior in terms of story, acting, breaking out, and movie influence. Too bad because \"Butch Cassidy and the Sundance Kid\" is a good movie as well, just not as good as \"The Wild Bunch.\"",
            "review_date": "2013-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think they could have a better pair than Newman and Redford. Absolutely perfect!",
            "review_date": "2013-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though not a true biopic, this film set a standard for movie-making into the seventies.",
            "review_date": "2013-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Western with classic charismatic leads in their prime.",
            "review_date": "2013-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A total buddy movie hiding in the western genre. Redford & Newman are loveable scamps just trying to make a living robbing banks. After a slim getaway from a unwavering posse, the two, along with the woman who loves them both, resettle in Bolivia. But honest work just doesn't pay.",
            "review_date": "2013-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert and Paul put in an admiral performance that is genuine and humorous. With a naturalized look and feel to the film the emotions and feeling are stirred in that, we all like the underdog and hope they succeed. Sets and vista are suitable for Hollywood's ideal of the West and do make for an excellent back drop to the movie. Nibbles: Corned beef and beans.",
            "review_date": "2013-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch and Sundance... the names speak for themselves.",
            "review_date": "2013-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a handful of laughs; some high-octane shoot-outs; long, sweeping landscapes with silent and terse close-ups, this classic western is as enjoyable a movie experience as any. The legend behind the characters only sweetens the deal.",
            "review_date": "2013-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie and one of the true and last westerns.",
            "review_date": "2013-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can you get a better pairing than Newman and Redford? They are probably the most charming bad guys you will meet. The music and cinematography is what makes this movie and the performances aren't that bad either. There are moments of unexpected violence the final shootout is memorable for its last shot. I enjoyed this western thanks to the title characters living up to their names.\n\nGrade: A-",
            "review_date": "2013-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Newman and Robert Redford's chemistry in this film is absolutely unbelievable. They did such a terrific job that there is no way that they could ever go wrong with this movie. It's fun, action packed, and brilliantly shot/written. Really does show you how amazing western movies are. It is amazing and an absolute thrill.",
            "review_date": "2013-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellently written, acted, and shot.",
            "review_date": "2013-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really should have watched this much sooner then I did.",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most entertaining westerns of all time.",
            "review_date": "2013-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The chemistry between Paul Newman and Robert Redford is incredibly well-matched featured in an 'on the run' narrative that is both consistent and exciting.",
            "review_date": "2013-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thing that elevates Butch Cassidy and the Sundance Kid above lthe average western is the way the atmosphere is light. \nDespite featuring a rough plotline with the dramatics of western robbers, Butch Cassidy and the Sundance makes use of a light comedic tone to keep it consistently entertaining and even some romantic comedy in there to ensure it appeals to a wide audience.\nBut what makes Butch Cassidy and the Sundance Kid iconic is its relation to the 1960's counterculture movement. As a film romanticising crime in a similar manner to the recently released Bonnie and Clyde which also chronicled a pair of bank robbers, Butch Cassidy and the Sundance Kid plays its villainous protagonists out in such a manner that they are nothing if not likeable. They're a charming pair of buddies who share fine chemistry thanks to the work it its two lead actors, and they really give perspective into the counterculture side of things which makes it a powerful film.\nButch Cassidy and the Sundance Kid is truly one of the greatest westerns I've ever seen, and although it keeps up with many of the traditional western film qualities, it increases the pacing slightly, lightens the tone so its less gritty and more romanticised for the style, and tones up the quality of the shootouts which result in Butch Cassidy and the Sundance Kid being a fairly energetic and stylistic western.\nThe screenplay to Butch Cassidy and the Sundance Kid is very clever and delves beneath the surface of its characters well, making the charming and heroic despite being bank robbers. It's also full of sophisticated charm and wit which enhances the characters by making them all the more likeable without burdening them with silly dynamics which would damage the seriousness of the story.\nPlus, the structure and style of the story is great in how it sets the story up, and later how it brings it to a close in an iconic manner with a befitting honour for the strong characters of the story.\n And Butch Cassidy and the Sundance Kid is unforgettable because of the actors cast in the titular roles. The duo of Academy Award winners Paul Newman and Robert Redford who also starred in the Best Picture Winning classic The Sting are reunited to kick some ass in this western, and they deliver on that promise. They portray Butch Cassidy and the Sundance Kid respectively in a sophisticated and respectable manner, without missing a beat of wit and charm with their chemistry and delivery of script lines which makes Butch Cassidy and the Sundance kid a riot from start to finish with strong lead characters.\nKatharine Ross also gives her finest performance since her Academy Award nominated role in 1967's The Graduate with her portrayal of Etta Place being a strong one, and her chemistry with Paul Newman is impeccable. She really brings the sweetness of the story out and makes the romantic theme a good addition to the film.\n\nFrankly, Butch Cassidy and the Sundance Kid is easier to watch than many other westerns because of its light atmosphere, and its pacing is constantly more stimulating due to its clever script and entertaining action. It's a western masterpiece.",
            "review_date": "2013-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "enjoyed the banter between butch & kid and how crafty they were. pacing was slightly to slow but its a quality film",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid performances, though the whole 3rd act once they get to Bolivia seems added moreso for historic value rather then helping the movie progress. alas",
            "review_date": "2013-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easy to see why this is a classic. Great casting, great script, great dialogue, great characters you care about... Can't find anything wrong with it... but it lacked some grit, that's about it.",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie suffers from the same problem as \"Pat Garret...\" And \"The Young Guns\". These movies are a product of their time and just seem silly and kitschy now. Was that Simon & Garfunkel I heard?",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somewhat enjoyable.  But, too corny and too 60's.  What's with the love triangle?  Really... Keep the 60's out of westerns.",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a cute, fun ride. kinda sweet, silly, witty and ultimately just a very likable movie with two beautiful and likable leading men. this isn't a film that will haunt you or make you think much - it's light, thoroughly charming entertainment.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Suspenseful at the first half with great performance from the characters makes this piece definitely worth a shot.",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charming characters (Paul Newman and Robert Redford are fantastic), a fun musical score, and a sharp screenplay make \"Butch Cassidy and the Sundance Kid\" a great piece of cinema. It tells the story of Butch and Sundance, two outlaws in charge of a gang of robbers. When a train heist goes wrong, and they barely escape with their lives, the pair tries to outrun the law by going to Bolivia. The movie contains western violence (some that leaves PG blood) and comes a little too close for comfort sexually (nothing graphic is shown, but two women start to undress in two different scenes, one undoing her shirt until it hangs open and the second is interrupted). Otherwise, \"Butch Cassidy and the Sundance Kid\" is an entertaining movie for teens and older that could create interesting conversation afterward about the nature of its protagonists.",
            "review_date": "2013-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finished it this evening.  Enjoyable but far from the classic I was expecting.",
            "review_date": "2013-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie blew my mind. Definitely in my top ten favorite movies. Such a creative plot and the screenplay is too good to believe.",
            "review_date": "2013-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "for the first time in 2013 with a completely neutral view I can state that Butch Cassidy and the Sundance Kid is a great film, a few strange and unnecessary scenes don't hurt the film too much.",
            "review_date": "2013-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic dialogue, but, wow, this movie is a direct rip-off of Arthur Penn's BONNIE AND CLYDE.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent performances from Newman and Redford in this simplistic western that is bursting at the seems with laughter.",
            "review_date": "2013-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a bit slow at times (my entire family watching the movie except me fell asleep, but I'm glad I stayed awake), but it is a masterpiece. The movie kept my attention for all but a few minutes where I got tired. More importantly, it was great. It was iconic, funny, and of course the cast of characters was excellent. It was moving and the movie is five stars. It wasn't as good as The Sting though - not by a mile.",
            "review_date": "2013-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film stumbles over the non-presence of Katharine Ross, campy dialogue, and flat humor. These outlaws are out of place in time, and not just thematically: the purposeful anachronisms and embarrassingly goofy situations that they are placed in make it hard to take this film seriously.",
            "review_date": "2013-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They survive, right?",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun western that has an uneven story line but survives with the relationships between the main characters.",
            "review_date": "2013-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alternately hilarious and poignant, Butch and Sundance's downfall mirrors the downfall of the Western itself as they struggle to find a place in a world that has simply had enough of them. Redford, Newman and Ross are each fantastic, and paired with Bacharach's iconic score they created perhaps one of the slightest late era Westerns, yet also one of the most enjoyable.",
            "review_date": "2013-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a great outlaw cowboy buddy movie! Great acting from both Redford and Newman in this one.  I really enjoy how Hill weaves in the silent movie at the beginning and the old still photos near the middle.  A must-see movie, particularly for the ending.  The only annoying thing about this movie is there's tons of horseback riding through the desert ... and it gets old.",
            "review_date": "2013-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie; especially the \"buddy\" element. It was simply a classic of the spaghetti western genre",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty cool movie with a cool filming technique. The acting was really good, I never was a big fan of westerns but this was pretty good. Paul Newman was awesome as usual. I liked how the whole film had this light brown color at parts to it rather than being black and white. It and plenty of gun shoot outs which kept you entertained through out. It never really dragged or anything. Like I said I'm not the biggest western fan but this was good. The acting was great and violence was a great touch. The final scene is great and even the image it ends one was a great way to end it. This movie had a lot of great things to progress film at the time, that's why it's great to see.",
            "review_date": "2013-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original man-flesh movie. Hot guys, funny, entertaining and quoteable lines.",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic Bromance... fantastic story",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite westerns, and one of the best!",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and the Sundance Kid has become one of the significant bits in 1960s film with its music, its cheery script, and the legendary chemistry between Paul Newman and Robert Redford.",
            "review_date": "2013-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute revelation for any viewer. Shaking up comedy, romance, action in the  endless barrel of the wild west. A feel good film, headlined by two unforgettable performances.",
            "review_date": "2013-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Katherine Ross.",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Redford and Newman here create the greatest buddy duo in all of film, in a delightfully anachronistic, subversive, revisionist western. It is both technically and thematically brilliant, as well as wildly entertaining. It contains perhaps my favorite final line of dialogue in all of cinema. It also has one of the weirdest and coolest soundtracks ever. I love this movie so much.",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true classic!  There are several reasons Butch Cassidy and the Sundance Kid is a classic.  The story of two aging outlaws who out lived their era and try to survive is both riveting and entertaining story.  The acting of Paul Newman and Robert Redford is outstanding. Paul Newman and Robert Redford create an acting synergy together which is humorous.  When watching the film I notice that Newman and Redford feed off each other performances.  There are several memorable scenes  the card game, the fight for who should be leader, and the ending are great mixtures of movie tension and humor.    A true classic film has great direction, acting performance, and a strong script!  Butch and Sundance is flawless in direction, acting and script.   The one true test of time is the movie is not dated for a 1969 movie.  The movie get across as a film which is still entertaining today.  I give four and half stars for this Western.",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah this is good stuff. It's that rare western that's funny and emotional, bloody and fun.",
            "review_date": "2013-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Gorge Cassidy\" (Paul Newman), a.k.a. \"Butch Cassidy\", and \"Lonny Longbaugh\" (Robert Redoford), a.k.a. \"The Sundance Kid, are two of the greatest robbers in the history of the Old West. They pulled jobs on banks and trains with an expertise that made them famous from coast to coast.\r\n\r\nNow, years after being out of the business for about two decades, they decide to pull one last bank heist in Bolivia, with the help of a school teacher (Katharine Ross) with romantic ties to both men.\r\n\r\nI have to say that I am pretty disappointed in this film. I found it to be slow, with not enough action considering the topic of the movie. It dragged so much that I noticed spending more attention to my computer than watching the movie itself on cable television.\r\n\r\nOne thing that stood out was the on-screen relationship between Newman and Redford. This is what carries the movie I believe, and most likely why this movie is called a classic now. You feel as if the two are not just partners in crime, but friends with the ribbing that they give one another.\r\n\r\nAnother problem with this movie is the soundtrack. The only piece of music that is memorable is Raindrops Keep Fallin' on My Head by BJ Thomas, and that was a weird tune for a Western set in the Old West. If you ask me, the song was just an odd choice.\r\n\r\nI also barely enjoyed Ross as \"Etta Place\". Her character was barely developed if you asked me. It appeared that she was there as a romantic interest, and to help teach \"Butch\" and \"Sundance\" Spanish for their attempt at robbing the Bolivian bank.\r\n\r\nIf you expect a lot of gunfights, you are mistaken on this one. Of what there is in the movie, they are short and well placed.\r\n\r\nThe cinematography is hard for me to judge since Encore Westerns used a pan-and-scan format. I had to deal with only half of a scene when two people were talking to one another. But, from wide shots, I could see some spectacular scenery, including the famous scene when the title characters jump from a cliff into the water.\r\n\r\nBecause it was declared a classic, I've been wanting to see this movie. I am highly disappointed in it.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The chemistry between the two lead characters is what makes this film. Of course, having an interesting story to tell and the brilliant musical montages only serves to heighten the experience.",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One crucial thing missing in an otherwise great Western.  So this is about two notorious outlaws who are renown for their train-heisting and bank-robbing prowess.  All good things must come to an end, and they're on the run, trying to make it to Bolivia.  I was in the mood for a Western, and this was the most famous one that I still had yet to see.  All of its acclaim is well deserved, and it hits all of the notes that you want it to hit.  These are likable rascal outlaws with a code, and their back and forth together is absolutely memorable.  What Butch Cassidy and the Sundance Kid never fails to lose sight of is a sense of fun; even when the situation is at its bleakest, there still is a joke cracked to break the tension.  The only thing I felt was a negative here is an absence of a great score, or really much of a score all together; there are maybe three to four songs here, and perhaps I have been spoiled by Sergio Leone and Ennio Morricone, but I feel that a great soundtrack in a Western is imperatively essential to tie everything together in one, complete package.  That one negative aside, this is still a great movie, and I can't give it anything but a very high recommendation.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw it. Pretty funny! Though the real story is INSANE.",
            "review_date": "2013-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is it my general aversion against anything that only remotely looks like a Western that hampers my viewing experiences of films like that, or is it just not that good?\n\nI liked how it started out though. This opening credit silent movie was a great idea - one of several - to change the pace of the movie by director George Roy Hill, although it doesn't do much in setting up the characters or the plot.\nI also liked the shoot-out at the end, and the famous freezed frame.\n\nWhat was in-between is another story. First of all, couldn't anyone just decide if they want to do a buddy movie or a serious western drama? The overall tone and atmosphere changes throughout the film and certainly hurts the dramatic effect of the story. Actually, it was pretty much the same with their later film The Sting which I very much enjoyed, the subject matter in Butch Cassidy would have deserved a more earnest approach in my opinion.\n\nAn even bigger enigma than the constant change of tone was the turn of Etta Place, the girlfriend of Sundance Kid, from school teacher to bank robber without any training, motives or explanation. Beside the fact, that she doesn't have much screentime I couldn't really comprehend what made her a criminal.\nI also didn't really get why they didn't stick with the \"straight\" work after successfully finishing their first job - it can't be too dangerous, they returned to bank robbing after all.\n\nHow this script could have won Best Original Screenplay at the Academy Awards is beyond my understanding. It's a mess - funny at times, kinda thrilling and featuring an eclectic duo of male leads - but still a mess.",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a classic for many reasons - well acted, expertly directed, and coupled with a perfectly matched soundtrack.",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome movie and two HOTTIES!",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny, entertaining film, and a powerful ending.",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just on the charisma & chemistry of Newman & Redford alone, it's a great watch.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good western flows well from scene to scene, this helps make it really easy to watch. I liked the way this film focuses on the perspective of the outlaws this really works well especially with Paul Newman and Robert Redford working well together on screen.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bank robbers in the wild west, showing they are real human beings with the same characteristics as all of us and looks just like a job occupation.\nWhat the film does is take you on a journey, i mean the chase scene is cinemographic history, it feels asif i am with the two of them exploring historic America not many films can capture history on film but this feels so real with beatufil locations.\nButch and his gang are very famous and the general public do not even seem bothered and they really shoudn't because they are fighting against the goverment.\nNow Obviously this was all going on at the same time as the civil war and logically it's perfect time to be robbing trains and banks because most men are at war.\nWhen Butch and Sundance are chased what seems a gumball across the west we are as shocked as Butch and Sundance because they seemed determined to catch them.\nTthe film is most famous for its bicycle scene because it's very diffrent from other westerns. Instead of the duels and show downs we have a score of 'raindrops are 'falling on my head', at the time i think the audience found this bizare because of the usual grity western but when we look back now this song optimizes Butch and Sundance.\nThe script is beautiful written a line is not wasted, where some films you want them to shut up, this one you want to hear more.\nButch and Sundance where the biggest outlaws of their time and i can't really say whether the film is historically correct but the ending is rather a dissapointment.\nsurrounded by Bolivian army they suicide into their ammunition.\nOverall the film is a western showing a historic side of America and i particularly loved Robert Redfords performance as Sundance kid and is one of the greatest and admirable character's i have ever seen and Brad Pitt resembles him a lot.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the great combo of Paul Newman and Robert Redford as the legendary outlaws, this movie is great fun. The Hole-in-the-Wall Gang became infamous for their exploits with Butch (Newman) being the brains and Sundance (Redford) the fastest gun around. Together these two robbed banks, held up trains, and all the while had a good time. At one point or another the law was after them so they fled to South America with one of Butch's nefarious schemes in mind. However, it was not what they expected and they had to face their biggest challenge ever. With the odds against them, they went out fighting and the legend of Butch Cassidy and Sundance was forever solidified. This film is as much a lighthearted comedy as it is a western. Newman and Redford have hilarious dialogue that brings the film alive and you end up rooting for these two anti-heroes. Although it is a seemingly random addition the song \"Raindrops Keep Falling on My Head\" is an added bonus.",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved every second of it. The sarcasm truly made the movie and I wish there was more like it!",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely the late 60s were the transitional from the classic western into the modern one with films such as Wild Bunch and this one. Newman and Redford are great as the inseparable pair of thieves and play their parts very well in a true story about the infamous gang in the old west. What gives the film flare are the performances and the style brought about by Goldman's witty writing and Conrad Hall's sensational cinematography. Definitely a \"cult\" favorite I think that has influenced directors and filmmakers like the Coen Brothers and Tarantino for sure. Not my favorite western by a long shot but the film has fun in reliving the triumphs of these two outlaws and their drive to the end.",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Very quotable. Paul Newman and rob Redford compliment each other like no other.",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very decent western film with Paul Newman and Robert Redford teaming up well. A good watch and typical western, which takes nothing away from it.",
            "review_date": "2013-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not only one of the best westerns ever made, but it is also one of the best buddy films every produced. Newman and Redford are awesome together.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly recommended by Western fans everywhere, I was disappointed by this one. I'm unsure what the director was after here. If it's a character study of a couple of outlaws in the dwindling days of the old west, he didn't give us enough insight into the characters. If it's a comic retelling of the outlaws last days, it is too long and drawn out by cinematic landscapes and stills of parties on ships. If it is an action movie, it fails miserably. Rolled all into one movie, it's a mess that I just couldn't get motivated to care much about.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns ever made. A truly entertaining movie from beginning to end.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two Western bank/train robbers flee to Bolivia when the law gets too close.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, that was interesting.\n\nI don't watch a lot of movies, so I'm pretty out of the loop on things that happened within the last 10 years, never mind the last 50. So I had no idea what to expect when popping Butch in the DVD player. Whatever tentative expectation-suggestions I had, they certainly wouldn't really have prepared me for the tonally, thematically, and anachronistically bizarre music choices as they played over montages of bike-riding, New York-ing it up, bank robberies, and horse chases. Redford and Newman were really fun as the two leads, although Redford's character veered from wonderfully deadpan to needlessly cruel (pretty much always to his girlfriend, played by Katharine Ross), and the humour was well-done, for the most part. The train robbery and escape were the most entertaining in terms of comedy and pacing, while the end kind of lost its way as it dragged on, but I'm glad I saw it. Sure puts a lot of Blazing Saddles into perspective.\n\nIn short, I agree with a lot of what the Times review had to say. The movie did not seem to know what it wanted to be, and I would have been much happier with a full length farce than the drama-coma-wtf that we got, but it's always fascinating to watch this kind of cultural history for the first time.",
            "review_date": "2012-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half of this Western of New Hollywood is terrific, the second half is decent, but doesn't live up to the great start.  It is a bit flawed yes, but it is still a classic western with two great leading men, Paul Newman and Robert Redford.  I liked the film, but I do think it lost focus and didn't quite keep up the momentum it built up at the start. I did enjoy most of it though, and I would still recommend it.",
            "review_date": "2012-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great great movie from an era where westerns were starting to die off.  Newman and Redford are awesome together.  Whenever I see Clooney and Pitt together it reminds me of Newman and Redford.",
            "review_date": "2012-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit overrated but never shifts from it's childish undertone. Butch Cassidy is a funny and oddly innocent western tragedy, of a couple of outlaw sociopaths, who just want to make money, taking every opportunity that it can find to be somewhat charming.",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Western, it slows down during the second act but makes up for it in the third",
            "review_date": "2012-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A disappointing hippie Western that is too light for its own good and errs in tone by diluting the urgency of the story with a tongue-in-cheek humor and endless landscape shots that make it painfully slow - not to mention how hard it is to care about its one-dimensional characters.",
            "review_date": "2012-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The iconic teaming of Redford and Newman was so magical that this offbeat action comedy in Western trappings has become a touchstone for bickering buddy comedies ever since, and the final freeze framed image is one of the most famous endings in Hollywood movies.",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What could possibly be better than swagger of both Paul Newman and Robert Redford in this iconic film, Butch Cassidy and the Sundance Kid.  The camaraderie between the two is as unforgettable as the scenes that goes with it.  Paul Newman and Robert Redford are the big reason why this film is such a success.  Not to mention the directing by George Roy Hill is the cherry on top that puts this film at the top of Western genre.  I firmly believe that Butch Cassidy and the Sundance Kid could be the best Western film in history.  Nothing can compare to the performances given by Paul Newman and Robert Redford, and the story telling by George Roy Hill.",
            "review_date": "2012-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw Butch Cassidy and the Sundance Kid and it was worth seeing even though I'm not the worlds biggest western fan. I loved the Burt Bacharach soundtrack so not Western which was a perfect for not being too big of a fan of country and western music!",
            "review_date": "2012-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My Favorite Western Film Of All Time Is 1956's The Searchers.",
            "review_date": "2012-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great chemistry between Newman and Redford. It's missing something that would make it a great Western but I'm not quiet sure what is it. Probably the epic element. It feels flat in some parts, drawn out and not exciting in others with the climax reaches at the end of the film. However, it is not to say this film is not entertaining. I like it. Watching Newman and Redford together is already good enough for this film. And the lovely song, too.",
            "review_date": "2012-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy And The Sundance Kid is an absolutely brilliant Hollywood classic - the writing, the performances, the direction, the cinematography - 5 stars all round.",
            "review_date": "2012-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good buddy film. Yoy can see some beautiful natural places here.",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece.  As always.",
            "review_date": "2012-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully shot film that combines excellent acting with overt irony to paint a sardonic picture of the western genre.",
            "review_date": "2012-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so good, I feel as though calling it a western somehow sells it short. This is not to say there haven't been other westerns that are some of the finer films made. This film however transcends genres. Quite simply, it's timeless.",
            "review_date": "2012-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest Western films I have ever watched. The Newman/Redford pairing has to be one of the finest pairings in the history of cinema. Has the perfect blend of action, comedy and adventure. A definite symbolic film and far more superior for it's era than what \"Bonnie & Clyde\" was in my opinion.",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Treat to watch......!!!!!",
            "review_date": "2012-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "please add it to the movies I own",
            "review_date": "2012-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an inventive piece of grounded, human mythopoeia that helped usher in the glorious age of the anti-hero in pop culture. Smart direction, painterly yet real cinematography, brilliant dialogue and fantastic chemistry between Newman and Redford give the film an integrity that has helped it age well.",
            "review_date": "2012-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite western",
            "review_date": "2012-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie!!! One of two moves that Paul Newman and Robert Redford stared together in. It's a must see, if you like westerns. And even if you don't, it's a terrific film.",
            "review_date": "2012-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10/17/08 - Butch Cassidy and the Sundance Kid was a good buddy outlaw film.  I liked the chemistry and banter back and forth between Newman and Redford.  The movie had kind of slow pacing at times and strange use of music.",
            "review_date": "2012-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best western I've ever seen. Newman and Redford have perfect chemistry together.",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really fine film about the outlaws. Nice comedic touches and outstanding last 30 minutes more than make up for,in truth, some quiet slow moving not a lot happening moments in the film.",
            "review_date": "2012-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must see.  Not the best western I've ever seen, but one of them",
            "review_date": "2012-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is kind of dated now, with the music and the endless horse riding but it does have a certain charm of its own I guess.",
            "review_date": "2012-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a classic coming of age movie except that all the charcters are adults.  Great western action,  funny dialogue, weird love triangle and one of the best endings in movie history. Paul Newman and Robert Redford at their best. \"who are those guys?\"",
            "review_date": "2012-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good show. really relies on newman and redford to be newman and redford.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny comedy western. Just the Bolivia episode filmed and Mexico, I suppose, and talk with Mexican accent left something unfinished with this film. The last scene could be the inspiration for \"Thelma and Louise\" end.",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie Paul Newman and Robert Redford are amazing together..",
            "review_date": "2012-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Top-notch BluRay transfer.",
            "review_date": "2012-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all time",
            "review_date": "2012-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good one if you like the actors.",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really fun and entertaining delight.",
            "review_date": "2012-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this one, really entertaining.",
            "review_date": "2012-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have been a western genre die hard fan...and this movie is mesmerizes you...there is a different aura about this movie...probably the first of the westerns with slapstick humor...the chemistry between Newman and Redford is exemplary...one of the 100 must watch movies before you die...",
            "review_date": "2012-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are a couple pivitol parts cinematically that are important but \"Butch Cassidy and the Sundance Kid\" is more likely to bore than excite.",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Filmed in the beautiful canyons and vistas of the great American southwest. The film follows the legend of Butch Cassidy and Sundance and gave screen legends Robert Redford and Paul Newman a venue engage in witty repartee and affable taunting. The spectacular soundtrack of Bacharach only adds to the overall delightful and playful nature of this film. Not a portrait of two desperate outlaws but reather of two modern day merry men on who are inexorably tethered to each other and fate.",
            "review_date": "2012-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "~A western film for everyone~\nPaul Newman and Robert Redford are outstanding! Both the perfect western duo, roughly based on the real \"Butch Cassidy and Sundance Kid\" who robbed banks yet had the hearts of gold and hands of perfect theifs..\nI was on my seat hoping they'd escape death, lucky for them the run of a cat and mouse chase became an incredible adventure of scandal. A pinch of comedy it reached out to my heart!",
            "review_date": "2012-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect chemistry with Newman and Redford. The climactic gun fight became an instant favorite for me.",
            "review_date": "2012-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch and the Sundance Kid run around robbing places while trying not to get shot in the process. But that's all this is, really; stealing or running. There's not much of an overarching story here. It feels like Butch and Sundance's greatest hits reel. The chemistry between Redford and Newman is legendary, while the writing keeps things spry and light.\r\n\r\n--6.5/10--",
            "review_date": "2012-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i don't swim well thats good because the fall will probable kill you! Genuis",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that shows every aspect of a great western. Perfect storyline, strong characters, beautiful scenery, thrilling gun fights, romance, and a violent finale that won't let you loose your focus.",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The chemistry between Paul Newman and Robert Redford is unbelievable and are a combination on screen as ageing outlaws.",
            "review_date": "2012-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was really good. i had never seen anything like it. the only thing was that nothing really happened, i dont know, whatever.",
            "review_date": "2012-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So much potential with Redford and Newman, but the direction and production spoiled it.",
            "review_date": "2012-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both my wife and I were really shocked at how dated and slack this supposed classic was.  I suppose that the comic concept here is that the guys personalities don't live up to the legend, but every moment in Newman's and Redford's performance, I felt that they were either actors playing accountants or actors playing actors playing bank robbers.  They were so removed from their roles I wondered if they just saw the screenplay the night before and did the whole thing in one take.  Had I not seen Newman in far better roles, I'd have dismissed him as an actor on par with Madonna and William Shatner.\n\nThe legendary William Goldman script is so slack.  The movie ambles for 40 minutes with no point for its characters until finally Butch and Sundance are on the run from the UP posse.\n\nI never saw this at the time, although I did see their follow-up \"The Sting\" and totally enjoyed it then.  Would I have felt differently at the time?",
            "review_date": "2012-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the best criminal on the run movie of all time",
            "review_date": "2012-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The template of the buddy film and the revisionist western.",
            "review_date": "2012-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of the best Westerns ever made. Gritty, funny and believable, what more can you ask?",
            "review_date": "2012-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie. Great script. Great leads. Never bettered.",
            "review_date": "2012-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great Redford & Newman team-up, and more than a decent western.",
            "review_date": "2012-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film has been in my top 5 for 20 years and has yet to be budged.  The Sting only surpasses it at number 4 ;)  It has a B Movie feel with spot on acting by all and a story, though fudging on the truth a bit, that holds you like a horse rope!",
            "review_date": "2012-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Butch Cassidy and the Sundance Kid\" is a film of great writing, direction, and cinematography, but the performances of Paul Newman and Robert Redford are what really elevate the production. Their chemistry and comic interplay are what really got me involved, and it's surprising how much depth they actually bring to their characters. But while the film as a whole is wonderfully entertaining, it does have its problems. As much as I like the score, it doesn't work. In fact, it practically ruins several great scenes, with the \"Raindrops Keep Fallin' on My Head\" sequence and the photo montage near the middle being two prime examples. But as hindering to the production as both are, I'm still a big fan.",
            "review_date": "2012-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun, well-made anachronism that succeeds almost entirely on the chemistry of it's stars. A few grating montages and a trip to Bolivia hold it back considerably but the final shootout makes up for lost ground.",
            "review_date": "2012-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazingly shot and acted.  Tells the great story of Butch and the Kid.",
            "review_date": "2012-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Newman and Redford no more need be said.",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe it's taken me this long to see this movie. A fantastic film all around, with a nice, ambiguous-but-not-really kind of ending.",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What Butch Cassidy and the Sundance kid did was essentially make the villains the good guys and the good guys like the police the villains. And that's a tough thing to do. To make you root for the guys robbing trains and banks and go against the villains tale very good pacing and character development. It was an all round wonderful western and a beauty to look at. It wasn't the most unique story, but it was one that made the story work.",
            "review_date": "2012-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another classic Western, and along with The Good, The Bad, and the Ugly, it is one that you simply MUST see. Paul Newman and Robert Redford are astounding, and the action is great. We see a great bond between our two leads, and their trek through America and Bolivia. The story is great, and as I said earlier, the action is pretty much solid the whole way through. The major thing that stands out in this film though is the writing, which is really funny, and equally dramatic and overall awesome. It touches on every note really, really well. The climax is really well done as far as Westerns go. If I have a complaint though, it has to be this one scene in which Butch is riding a bicycle with Kid's girlfriend, where they play a more modern song, which breaks the mood of where and when the film takes place. It by no means ruins the film, but it is an annoying scene as it goes on. The script, lead acting, pacing, direction, and climax are fantastic, and makes for a film I'd be willing to watch many more times.",
            "review_date": "2012-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm generally not big on older movies, but Butch Cassidy and the Sundance Kid is a flat out good movie.  The story keeps you involved almost the entire way through, though it wastes a little bit of time with a couple of needless scenes, most specifically involving a bicycle.  But I really liked the main characters and the chemistry they had together, and the action, though rare, was pretty awesome.  Lots of fun to be had in this movie and I really enjoyed the ride.  I definitely recommend you check out this movie, through whatever method you can.\nFull review at: http://robertreviewsstuff.wordpress.com/2012/06/14/butch-cassidy-and-the-sundance-kid-1969/",
            "review_date": "2012-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Redford and Newman are incredible. The movie is beautifully done, too, and fun to watch.",
            "review_date": "2012-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great film! Icons Robert Redford and Paul Newman are fantastic, and their chemistry remarkable. Great cinematography. Awesome shoot-outs. Classic Western!",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing astounding, but a great Western.",
            "review_date": "2012-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not normally a big western fan, but there is more to this than Smith&Wessons; I enjoyed it throughout and only a few mishaps aren't enough for me to not recommend this to anyone.",
            "review_date": "2012-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's like the movie tries to take on 7 guys with a 6 shooter. It's too big. It's too long. There's a lot of running with no pay off. They just keep running. And we are denied the satisfaction of seeing the \"heroes\" come to terms with their folly. Nice production, memorable anachronistic song, two guys with great on screen chemistry, and wasted potential.",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Rain Drops keep falling on my head...\" Fricken loved this movie after my first viewing. I am watching it again because it has been a almost two years since I first saw it. This movie was a really fun ride with some superb acting by Paul Newman and Robert Redford. My favorite western for sure, with True Grit (2010) as a close second.",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a really solid Western. I've never seen an old Western, but I've seen modern ones such as 3:10 to Yuma, True Grit, and The Assassination of Jessie James. You can't really compare Butch Cassidy and the Sundance Kid to those films because of the time difference, but I was still entertained by this. I liked the ending a lot. Taking place in Wyoming at least a hundred years ago, the film is shot beautifully as the camera pans from landscape to landscape. I usually think classic movies are overrated, but I don't think this one is. I liked it.",
            "review_date": "2012-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excitement, laughs, and just plain fun are available in spades in this, one of the most entertaining movies of all time. Robert Redford and Paul Newman are a joy to watch.",
            "review_date": "2012-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm just going to say that I didn't like this too much. The character development is weak, and the editing style definitely belongs in the 60's. Unfitting music, awkward exchanges of dialogue. I found Butch and the kid to be too enigmatic, leading to not to care for them.",
            "review_date": "2012-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It doesn't add up to a truly great western, but it's worth watching, and it has some memorable performances.",
            "review_date": "2012-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy (Paul Newman) and The Sundance Kid (Robert Redford) are two Western outlaws who have been elevated to \"folk hero\" status. This film chronicles the last few months in the lives of these two non-lethal train robbers. The fast-moving screenplay is serviced with astonishing levels of humor and heart from the iconic duo in the title roles. George Roy Hill brings expert direction and Burt Bacharach provides one of his most famous scores. The final product is greatly enjoyable even if you're not usually into Westerns.",
            "review_date": "2012-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film...just good, not great. Hampered by Burt Bacharach's anachronistic songs and score. Both Newman and Redford are charming, but they can't escape the film's 1960s sensibilities. Never mind that this film was supposed to take place in the late 1800s.",
            "review_date": "2012-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch (Paul Newman) is an eternal optimist and self professed visionary. Sundance (Robert Redford) is a level headed sharpshooter. Along with the Hole In The Wall gang, they show how th West was won..and lost.\n\nSpurred on by a relentless posse that chases them half way across the country, Butch and Sundance escape to Bolivia where they attempt to begin life anew. But these legendary outlaws find that the times are changing even faster than the law men who are determined to bring them down.\n\nalso stars Katherine Ross, Storther Martin, Henry Jones, Jeff Corey, George Furth, Cloris Leachman and Ted Cassidy.\n\ndirected by George Roy Hill.",
            "review_date": "2012-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was disappointed in the movie for not taking itself more seriously.",
            "review_date": "2012-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a must see. Rather long, drawn out and boring.",
            "review_date": "2012-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie represents everything good about American cinema. Beyond just being one of my absolute favorite movies of all time, it is plainly one of the best movies ever made. Why it is so good is simple. Sure the script is great, and the directing is as good as any, but what this movie comes down to is simply Paul Newman and Robert Redford. Now Paul Newman is hands down one of the coolest people ever to walk the earth, and Robert Redford is right up there with him. Redford's Sundance Kid ranks among my Top 5 favorite performances of all time, and its towards the top of that small list. These two have a connection that is hard to find on screen, these two are true friends, and that relationship shows on screen. This is a movie that makes me want to go out and make movies, it is one of those movies that drove my interest in film. I think it is impossible to have more fun watching a film then you do watching Butch Cassidy. This movie introduced the world to Robert Redford, and the iconic pairing of himself and Paul Newman. It's no wonder then that almost 45 years later, it's still one of the most influential movies of all time.",
            "review_date": "2012-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't really get it.  Lowest possible positive rating because of the soundtrack.",
            "review_date": "2012-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Raindrops keep fallin' on my head--give me a fucking break!",
            "review_date": "2012-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "anti-heroes you can't help but love\r\nharmony performances",
            "review_date": "2012-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy: Kid, there's something I ought to tell you. I never shot anybody before. \r\nSundance Kid: One hell of a time to tell me!\r\nThe comedic timing was perfect for these two.  It was well written, as the story was close to accurate",
            "review_date": "2012-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great look at two talented, likeable and shrewd outlaws; full of witty dialogues and exciting action/chase sequences. Pacing issues and minor flaws are taken care of by some good acting and powerful script. A quintessential buddy film, the way Butch & Sundance work together and that's what drives the movie.\n\nWatch it if you are a fan of westerns or just good movies. A funny, exciting and superbly made with a lot of silent scenes and a montage of photographs too! A few memorable scenes & remarkable music, specially the song: ~Raindrops keep falling on my head~! The movie's ending- the famous freeze frame- is so perfect too!",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is understandable for people to say that it isn't a western, but to say that this is a bad movie?  This film is unforgettable, influential and absolutely brilliant.  You could say that it's \"too cute\", but I'd like to point out that they didn't throw a joke at you every 8 seconds like a modern mindless comedy, it was perfectly timed.  The jokes that they put in didn't make any sacrifices to the very compelling storyline.  I think that makes this that much better.",
            "review_date": "2012-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and the Sundance Kid is the greatest western/comedy that I have ever seen. Newman and Redford have perfect chemistry, and are one of the greatest duos I have ever seen! Even today it looks better than most movies, and the writing and camera work are among the best!  A must see!!!",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best western ever. For the first 60% or so. Then it COMPLETELY FALLS APART. Anyone who can defend the absurd turn of events after the three leave for Bolivia-- please enlighten me. This sets in motion a horrible turn of events, story-wise, which completely negate the near-perfection of the first section of the film. The only thing that saves it is the powerful ending; appropriate for the characters and journey. Still, ironically, near and dear to my heart, and absolutely one of Paul Newman and Robert Redford's best ever. A near-classic.",
            "review_date": "2012-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can anyone top the witty banter and the buddy-bandit relationship of Butch and Sundance? These guys are just too...damn...cool!",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "REALLY LIKED THIS MOVIE...BUT I LIKE PAUL NEWMAN IN MOST EVERTHING ! ROBERT REDFORD WAS REALLY GREAT AS THE SUNDANCE KID AND FIT WELL WITH NEWMAN. SOME REALLY FUNNY SCENES TOO.",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic character film.  Although not really very, I dunno, westerney.  At least to me.  It's more about the characters than the surroundings anyways.  The music is a little dodgy and out of date in places, but other than that I love it.",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I forgot how GREAT this movie is!!!",
            "review_date": "2012-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an intensely brilliant pair of actors combine with other great elements (like a really good script) to make not only an iconic film, but a legendary Western.",
            "review_date": "2012-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic cast, and great dialogue that keeps you engaged. Parts of this movie are still a bit of a mystery to me, but maybe that's what I like about it the most.",
            "review_date": "2012-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever made.  Clearly.",
            "review_date": "2012-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The classic western film",
            "review_date": "2012-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie so cool it doesn't need a review.  But I'll give one anyway.  Newman and Redford have the best banter, the film is entertaining from start to finish.  The ending is perfect.",
            "review_date": "2012-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am compelled to rant for a moment. Anyone familiar with the \"Reviews\" system in the Rotten Tomatoes Community knows about the little sidebar that shows up when you write. It shows the three most recent user reviews for that particular picture. At this moment, I'd like to share the kind of unfortunate crap that people think about movies:\r\n\r\n\"Watch it, that is all.\"\r\n\"Probably the first of the westerns with slapstick humor\"\r\n\"One of the best Westerns ever made, Paul Newman and Robert Redford make one of the best pairings in cinema history.\"\r\n\r\n...what?\r\n\r\nI honestly want to see a list of the pictures these people have seen that they would consider \"Western.\" BUTCH is about as much of a Western as NO COUNTRY. It's an hommage from a much different time. BUTCH is what happens if you take a bunch of cocky youths out of their VW Rabbit, give them a joint, make them watch THE TIN STAR, and then hand them a camera.\r\n\r\nIndeed, this is precisely what makes BUTCH such an enduring picture. It preserves both a tested cinematic format and the edginess of 1969. But is it deserving of the label \"[o]ne of the best Westerns ever made\"? No way. It is a shameless carbon-copy of BONNIE & CLYDE. The second half of the film is remarkably slow. And, those who have seen it will understand, it is too damn pretty.\r\n\r\nI will agree that Newman and Redford make an endearing couple. Redford's passion for cinema is tangible and Newman follows his impossibly charming lead. But there's something else. I never pick up on cinematic homoeroticism. But here? Even Little Ms. Robinson can't calm them down.\r\n\r\nThose who point to DAYS OF HEAVEN as some kind of cinematographic landmark need to take another look at BUTCH. The picture-taking is so underappreciated. Perhaps it is so because it is remarkably out of place. The camera is outrageously active. It plays around with weird and aimless focus lengths, puzzling apertures, and every zoom opportunity in sight. It doesn't fit. But that doesn't change the fact that some of the darkest, most dazzling photography of the second half of the century lies dormant in this picture.\r\n\r\nNone of my evaluation changes the fact that I watched this movie with my father. I remember him recommending it to me years ago and we finally looked at it last night. He saw it in on the big screen when it came out in '69 and there is no substitute for the joy a movie lover can feel when he or she enjoys their favorite hobby with someone so close and who shares the real connection we seek.",
            "review_date": "2012-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Westerns ever made, Paul Newman and Robert Redford make one of the best pairings in cinema history as Butch Cassidy and The Sundance Kid. There is not a low point in this film and every scene has something to offer to the film as a whole. Rounded off with the beautiful Katharine Ross, it hard not to love this film.",
            "review_date": "2012-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic!! Very entertaining!!!",
            "review_date": "2012-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Upon a rewatch, I imagine that one of this film's lasting charms is that it simply can't make up its mind which genre it belongs to. A crossover before there were crossovers.",
            "review_date": "2012-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny thing is that Butch Cassidy was a great leader, but he was retarded. lol\n\nLove this movie.",
            "review_date": "2012-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ever since I first saw it as a child, Butch Cassidy and the Sundance Kid has always been one of my favorite movies. It was such a different take on the old west and life of an outlaw than I'd seen before, or that anyone had seen for that matter. More playful than even John Ford's most light hearted works, but without the sappiness of the old singing cowboy comedies, it made the west seem like not only a grand adventure, but also great fun. With its oddball sense of humor and the interplay between its two stars, Butch Cassidy and the Sundance Kid is both a great western and perhaps the best buddy comedy Hollywood ever made.\n\t\nAs the title suggests, the film follows the exploits of two of the Wild West's most infamous outlaws, who with their Hole in the Wall Gang robbed banks and trains far and wide, earning themselves a reputation as some of the move dangerous men alive. But you'd never know it if you met them. Far from hardened outlaws, Butch and Sundance are friendly, laid back cutups who find enjoyment where they can and never take life too seriously. Charming to a fault, they're even nice to the people they're robbing. They're not really bad men you see; they just have expensive tastes and a strong aversion to hard work.\n\t\nWhether it's a narrow getaway, a stick up, or a friendly visit to the nearest brothel, everything they touch becomes good natured fun, and it all works because of the men playing them. Hiring Paul Newman and then newcomer Robert Redford as Butch and Sundance was one the great happy coincidences in Hollywood history, like casting Ingrid Bergman opposite Humphrey Bogart, and began an on screen partnership even more enduring. The chemistry between these men is incredible; even knowing this was their first film together it's hard to believe they hadn't known each other all their lives.\n\t\nOn their own each man has exceptional wit and charisma. Together they're the perfect comedic duo; Butch the talkative joker, Sundance the tight lipped strait man. Never overplaying their shtick, they always lay on just the right amount of humor. When times are good they're like a pair of schoolboys playing hooky. When times are bad they're worse than an old married couple. \n\t\nOf course not all the credit goes to the actors. The director and the screenplay are crucial to the film's ability to keep its cheery tone. Even when Butch and Sundance are running for their lives, hounded by the best lawmen and trackers in the west, it's no reason for things to get serious. Now they're just a couple of saps who can't catch a break, leading them to a harebrained stunt that remains one of the screen's great moments of physical comedy. \n\t\nMuch of the film's humor and charm come from its dialogue, yet at times it accomplishes a great amount with no words at all. The New York montage condenses the story of their fun in the big city and their departure for South America into a few brief moments, the series of black and white stills and old timey waltzes and carnival music wonderfully evocative of the period. An entire string of Bolivian robberies likewise becomes a cheerful musical interlude.\n\t\nAnd speaking of musical interludes, the whole movie is so carefree and delightfully screwball that it even manages to make the dreaded Semi-Obligatory Lyrical Interlude- in which lover's engage in pleasant activities that have nothing to do with the plot- work. Rationally there's no reason why a scene of Paul Newman riding a bicycle with a woman we've just met should follow a train robbery, but here it's so charming that we either forget that or just don't car. There's simply something magical about watching Newman and Katherine Ross peddling around that meadow, and his wordless 'daredevil' scene is the best thing since Buster Keaton.\n\t\nYet the good times can't last forever, certainly not for men in their line of work. The fact is that the world they know is passing away. The Wild West isn't as wild as it used to be, and their profession is rapidly becoming a thing of the past. They realize this and go halfway around the world to a place that's still wild and lawless in an attempt to forestall it. It works for a while, but it's only so long before their past starts to catch up with them. In the blink of an eye things turn deadly serious, and we realize that the world's closing in on them and they can't escape it, no matter how far they go. In the end Butch and Sundance died as they lived; on their own terms, as outlaws, and following no-one's rules but their own.",
            "review_date": "2012-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly entertaining Redford-Newman film that adds a twist of humor to the typically self-important and stoically gritty Western genre.  Redford and Newman are at the peak of their likability in this film.  Not only is the film quite entertaining, but it's also quite stylish with smoothly integral use of stills and musical overlays.  Though not quite on the level of Once Upon A Time In The West, it's another example of how innovative Westerns are the ones that will weather the quality-erosive effects of time.",
            "review_date": "2012-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie, I mean, this movie...if I could rate it higher than just 5 stars, I would. The actors' fine jobs alone make this movie remarkable.",
            "review_date": "2012-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's no denying the chemistry between lead men Paul Newman and Robert Redford, but it is George Roy Hill's direction and William Goldman's Academy Award winning screenplay that really pushes Butch Cassidy and the Sundance Kid to classic status.  The use of the silent movie intro and final imprinting of the duo on the screen as they meet their demise help to give the movie a surreal feeling.  This film was good, but it could have been great if Hill would have chosen a mood and stuck with it throughout the film.  Nevertheless, Newman and Redford (and Katherine Ross as well, though in a much more supporting role) shine in a fun experience that has aged quite well for a movie from 1969.",
            "review_date": "2012-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film with some of the best lines ever! (such as at the final gunfight, Butch/Newman gets shot while running from the Bolivian Army, and screams to Sundance/Redford ,who is suppose to cover him, is that what you call shooting? and Redford retorts, Is that what you call running?) The script by William Goldman was one of the ten best for adventure films. There was always lively action but the banter between Butch and Sundance was the strongest part of the film. Amazing direction by the underrated George Roy Hill. This version of Butch Cassidy and the Sundance Kid has stood the test of time and no remakes should ever be done.",
            "review_date": "2012-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and the Sundance Kid is undoubtedly one of the greatest westerns in cinema history. Great performances, great cinematography and a great plot.",
            "review_date": "2012-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've been getting more into westerns as I get older And man I think this one is my favorite. I loved it its just 2 damn funny. Its A Beautiful comedy and its just so well done. I was laughing out loud and in awe of some of the beautiful imagery. I cant wait 2 buy it on blu ray. I recommend this 2 anyone looking 4 a good laugh. Even if u dont like westerns Just watch this movie, cuz its more of a comedy than anything else.",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Watched it last night for the first time.",
            "review_date": "2012-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Newman and Redford make the ultimate duo in this very funny and endlessly entertaining action/comedy classic.",
            "review_date": "2012-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(***1/2)  Being raised as a hardcore western fan, I was surprised upon watching the movie that I didn't remember seeing in my life.  In retrospect I'm almost glad I didn't, because the themes and subtletry of the story would have probably been lost on me as a child.  Watching it now, however, I can see that it is one of the finest westerns ever shot, despite being a bit fragmented and jumpy in its plot.\r\n\r\nThe movie is almost a scene-by-scene change of mood and story, but this is often the case in a historic movie which tries to document almost mythical figures.  Where the movie succeeds, however, is focusing on the later part of the outlaw's careers, where they can just start to see fate and karma catching up with them.  This is beautifully represented at the real turning point in the story, where the \"heroes\" find themselves on the run.  I particularly loved this part of the film because I was subtly and unknowingly put in a position where the movie completely changes tone, from light and airy to suddenly serious, the same way the characters are feeling in the movie, and I didn't need a sudden bus of dramatic scoring to tell me it happened.  In fact, the pure simplicity of the posse chase phase of the movie is what makes it great, along with the almost unearthly feel of their pursuers.\r\n\r\nI don't want to go too far into plot, so I'll talk for a moment about the photography, which is one of the best examples in a western movie, and if you think for a minute about what I just said, it was a pretty damn bold statement.  I've certainly seen films with some more grandiose landscapes, but the two things which cause me to make this assertion are the shots of the distant posse slowly gaining ground and the ability of camera focus to reveal things in the film we barely realized were in the background.  The visuals of the film are almost hypnotic at times.  Not to overlook the black and white footage as well as the still photographs which constantly play a huge role in movie.  I'm still not sure how they got that last shot from a closeup out to the panoramic view it was.\r\n\r\nThe acting was great as many people have already heard, and the actors are fueled by a good, sparse script which brings a whole lot of bittersweet laughs.  It's not exactly a classic western, but it accomplishes the western purpose, which is to explore moral dilemmas and challenges, especially those which are caused by a sudden, subtle change which throws a monkey wrench in the reality we've become accustomed to.  It could be something as amazing as an automobile, or even something as simple as a bicycle.",
            "review_date": "2012-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this film. Butch Cassidy (Paul Newman) and The Sundance Kid (Robert Redford) are two outlaws, the leaders of the Hole In The Wall Gang, who rob banks and trains in the classic Wild West fashion. It's a comedy as well as a western, with both extremely riveting thrill-scenes, and a splendidly written script which achieves good humour threw both clever dialogue and farce. The two men spend a good chunk of the film trying to escape from a seemingly superhuman tracker. When they stop to rest they look back and see a crowd of men in the distance with a mysterious figure who can track them over even solid rock. I like to think this aspect of it is symbolically emphasising what a character bellows at them earlier in the film, that the time of the outlaws is over and for Butch and the Kid it's just a matter of choosing where they're gunned down. It's not perfect, as to the very latter section of the film it seems to get a little too querky and cute, but the tremendous ending completely makes up for it and the film left me with a great respect for it.",
            "review_date": "2012-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a kid, Butch Cassidy is what I wanted to be: A cowboy robbin' banks saving hookers from the clutches of evil.",
            "review_date": "2012-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No more than a routine western flick. But with Newman and Redford at the helm of affairs, a superb score and lush cinematography (Conrad Hall), This flick has attained it's classic status and has stood the test of time. Lavishly entertaining.",
            "review_date": "2012-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure why it's considered such a classic. It's not bad, but it's a pleasant diversion at best.",
            "review_date": "2012-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it! Now one of my favorites.",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is probably the best buddy-buddy movie ive ever seen. the chemistry between newman and redford was hilariously spot on. in my opinion one of the best westerns/heist/buddy-buddy movies ever",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those films that I could watch over and over again and never get tired of it. Paul Newman and Robert Redford are incredible together.",
            "review_date": "2012-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Redford is a beast!!!",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering it's a movie from the 60s, it's a very good one!",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny and likable western with great performances from Paul Newman and Robert Redford.",
            "review_date": "2012-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic! Redford & Newman have such great on-screen chemistry.",
            "review_date": "2011-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Think of it as sort of a Western version of Bonnie and Clyde, Butch Cassidy and the Sundance Kid follows two outlaws (Paul Newman, Robert Redford) and their bank and train robberies during the final months of their lives. They are accompanied by their girlfriend (Katherine Ross) who is also a school teacher. Some of the filming techniques (particularly in the opening scene) are decent and there are some good shots of the western landscape. Otherwise, I do not really understand why this film was so popular except for the two leads' star power. There is no emotional pull, no real originality, and no way the direction kept me from being bored.",
            "review_date": "2011-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can pretty much recite this movie by heart! One of my all-time favorites!!!",
            "review_date": "2011-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok movie . 0.5 star for \"raindrops are falling on my head :)\"",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and the Sundance Kid is one of the greatest westerns and one of the greatest stories ever.  The plot is not just about two partners escaping crime and tring to make a new life, its a deep film that shows that its hard to change a lifestyle you have come to know and it soon becomes the only thing you can do, I loved about every minute of this beautifully written story and if these two men were real well then maybe not all thieves are as bad as we think they are.  The cast is incredible but the main thing is out two protagonist.  Paul Newman is an incredibly likeable thief and plays his character with a lot of heart and great strength.  Robert Redford was my favorite, he was funny and took his role very intensely I think, they are two very great actors.  I will say it again, Butch Cassidy and the Sundance Kid is a film that is honestly one of the best written and best westerns of all tine, how anyone can hate this film is beyond me, I highly recommend this film.",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly iconic western, with a great song. 'Rain drops are Fallen on my Head'.",
            "review_date": "2011-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its up theres with the greats! Probably the best Buddy movie western ever made! Just did like the casting of Katharine Ross",
            "review_date": "2011-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 unbelievably out of place scenes ruin this movie(Bicycle, Photo montage and Bolivia montage with the Woody Allen soundtrack)",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not a definition of a great western film but the performances of the two outlaws by Newman and Redford may just made this film an all-time classic.",
            "review_date": "2011-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best westerns",
            "review_date": "2011-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Redford and Newman are at the top of their game in this buddy flick. This is a western for people who hate westerns. It's got so many funny and poignant moments between the two leads that when their final, climactic fight against the Bolivian army occurs, you wish there was more movie left to watch.",
            "review_date": "2011-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this.  It's such a awesome western about the hole in the wall gang that Butch and Sundance lead.Another thing is that Paul Newman and Robert Redford had great performances, and Redford was so adorable and gorgeous and Newman was very attractive as well. I love this movie. :)",
            "review_date": "2011-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a riot! i didn't know what to think going into this film, but i was so pleasantly surprised by how fun and well-written this film was. goldman deserves all his accolades and more. i loved everything about this film, from the witty, hilarious dialogue to the precise characterizations to the way it turned the western genre on its head without compromising the integrity of the film. redford and newman are born and this film proves that without a doubt.",
            "review_date": "2011-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stationed midway between pitch-black comedy and realistic drama, this film effortlessly oozes the atmosphere of the waning West without a shred of pretension - essential",
            "review_date": "2011-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That's surely one of the best known and most loved westerns of all times.\nAfter being followed by the best trackers in the west, outlaws Butch Cassidy and the sundance kid have to flee, but it proves to be no easy task. Wanted dead or alive, the duo tries a camouflage escape to Bolivia with their girl Etta, hoping to regain a normal and peaceful life. Eventually, born outlaws => forever outlaws, so the plan doesn't quite stick and the pair are wanted again. This is one of those stories when you have the same antagonist and protagonist, and you can't help but feel for those persons, despite them stealing banks, robbing trains, and shooting people. There's so much chemistry between Paul Newman and Robert Redford you couldn't believe these people are actually acting. They got so much absorbed by their roles and played them to perfection.  The silent introduction, the bicycle ride with raindrops falling on their heads, and the switch from USA to Bolivia scene are just stunning. \nThe film has a perfect running time, leading to a perfect finale you won't see coming.",
            "review_date": "2011-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A different kind of Western, but it is a treat to watch.",
            "review_date": "2011-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blending the light and the dark of the Western genre with ease, Butch Cassidy and the Sundance Kid becomes a classic western that stands the test of time.",
            "review_date": "2011-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could watch this over and over again. Just a great film.",
            "review_date": "2011-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good entertainment at its best. Simple as that.",
            "review_date": "2011-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite western.  Get's a bit long at times, but is amazing.  Robert Redford and Paul Newman are absolutly brilliant in this movie.  This is what a true western is.",
            "review_date": "2011-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit cluncky in execution (not sure the silent film exerts work) but very watchable due to the on-screen banter between Newman and Redford.",
            "review_date": "2011-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a self-proclaimed classic, but I didn't think it was anything special. Great ending though.",
            "review_date": "2011-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty, fun, and tragic - a kind of strange and very specifically 1960's take on the western, Bonnie-and-Clyde style, with a couple of Graduate-esque musical interludes. It's the kind of movie that could only have been made at exactly the time it came about. Paul Newman, one of the most likable people in cinema, plays another anti-hero two years after his career-defining turn in Cool Hand Luke. His casting along with Redford and the light tone of the film suggest very little in the way of moral ambiguity. We are supposed to like and sympathize with these people - and like them we do, at least Butch. Sundance, the pessimist, is a harder case but is necessary to the pairing. The panoramic locations are great to look at even when the action slumps a bit in the middle.",
            "review_date": "2011-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a really good movie but there were a few problems with it. The first problem is that the very first scene establishes a mode that makes you feel like this is going to be a very gritty, violent movie and then it ends up being more of a comedy.  The bike scene with Raindrops Keep Falling on my Head was too cheesy and didn't feel like it belonged. The third problem was the picture montage when the three of them are headed to Bolivia, it just felt lazy. The fourth problem I had with this movie is that the music they chose wasn't very good at all with the exception for the first scene. The final problem with the movie is that maybe it was too long because I started losing interest towards the end. The end was good though and the movie did look amazing when you consider it was made 52 years ago and Robert Redman looks exactly like Brad Pitt in this movie.",
            "review_date": "2011-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think I can think anything better of what to say about this greatly performed western flick, with a good first team-up of Newman and Redford and the good music trying to stir up the poignancy tone, than the summary of what the critics are saying (the critical consensus). (A-)\n\n(Full review coming soon - with better wording probably)",
            "review_date": "2011-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the great combo of Paul Newman and Robert Redford as the legendary outlaws, this movie is great fun. The Hole-in-the-Wall Gang became infamous for their exploits with Butch (Newman) being the brains and Sundance (Redford) the fastest gun around. Together these two robbed banks, held up trains, and all the while had a good time. At one point or another the law was after them so they fled to South America with one of Butch's nefarious schemes in mind. However, it was not what they expected and they had to face their biggest challenge ever. With the odds against them, they went out fighting and the legend of Butch Cassidy and Sundance was forever solidified. This film is as much a lighthearted comedy as it is a western. Newman and Redford have hilarious dialogue that brings the film alive and you end up rooting for these two anti-heroes. Although it is a seemingly random addition the song \"Raindrops Keep Falling on My Head\" is an added bonus.",
            "review_date": "2011-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and the Sundance Kid is fun. It's entertaining, it's very well shot, and Newman and Redford are great in it. I wouldn't consider it a western. It takes place in the old west and there are guns that go off, but that's it. The movie is kinda weirdly inconsistent. They rob a train and pretty badly hurt some guy by unlocking a safe with a bomb. Then there's a montage of riding a bike set to \"Raindrops are falling on my head\" which almost has nothing to do with anything. It's a weird movie that doesn't go deep enough with the characters to make up for the fact that it's not as fun as it should be.",
            "review_date": "2011-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For my 300th review I recently viewed the \"classic' film Butch Cassidy and The Sundance Kid.  My recollection of this film was that it was very fresh, exciting, and cutting edge filmmaking.  Sadly, as is so often the case when something is a very much a product of it's time, it now seems trite, overblown and an experiment gone wrong.\r\n\r\nNot to say that Newman and Redford don't command your attention, but there is so much that went astray in this 70's retooling of the western genre (in truth, more of a buddy film if you ask me).  Starting with the music - I'm sure signing the then very hot Burt Bacharrach to write the soundtrack seemed like gold at the time, and yeah, it did produce a hit song (a hit song in a western???? Oh well, remember Rio Bravo had Ricky Nelson crooning and strumming guitar... at least that marginally fit the theme, while here, the canned popcorn sounds didn't resonate at all.  Frankly it got in the way of the film, as if saying, hey, listen up, I'm Burt Bacharrach and this is my groovy sound!).\r\n\r\nThe film starts off well enough, with the sepia toned intro moving into real life while still being sepia.  The color doesn't come in until the two stars are riding towards Hole In The Wall, giving the 60's viewer a wow moment of the red rock canyonlands.  Of course the print I was viewing must have been an old one, for the color was pretty washed out, sad to say. \r\n\r\nThe filming itself isn't bad, with some really nice use of shading, but there were many a script decision made that went sideways.  In trying to stay grounded in The Western, there were too many scenes of horses riding like hell - it made me wonder, seeing both heroes on the back of a single galloping horse - surely the poor horse couldn't keep going nearly as long as the film suggested.  Further there are the requisite \"shoot the bad guy and watch him fall off the roof\" kind of stuff - and then the film attempted to say something more meaningful by cranking up a guy's death scream, then doing a close up of his shot up body writhing in pain.  OK, nice attempt, but you can't have it both ways - fantasy and realism cannot truly coincide if you're attempting to make a worthwhile narrative.\r\n\r\nThe real topper though was in the middle of the film, which was running fairly well except for the overuse of the horse chases.  For whatever reason, the director decided to get all artsy again, showing a full 5 minutes of \"postcard\" pictures that conveniently had the stars front and center.  WTF?  A minute of this \"art\" would have been too much, so this went on waaaaay too long.\r\n\r\nIn the end what you get with this film is a look into the time in which it was filmed. It was the beginning of an era where boundaries in storytelling were being challenged.  Hooray for that, but now the film seems very rooted in those times and very dated.  I'm sure it was racy at the time to suggest that there may have been some hanky panky between the Katherine Ross, the female lead and both Newman and Redford - but it was couched in such a way as to be vague and non threatening to the conservative sensibilities. \r\n\r\nNewman and Redford hold this thing together, exhibiting an easy charm and chemistry and do the most difficult thing of all, seeming natural in a film that wasn't.  I've heard that a new film focusing on the Kid's later years (assuming that he somehow survived that final shootout)is in the works - it will be interesting to see how this film will be treated.",
            "review_date": "2011-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was expecting something completely different and enjoyed the movie for not doing what i expected which made it new and exciting.",
            "review_date": "2011-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic. Newman and Redford were meant to be.",
            "review_date": "2011-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most beautifully shot movies ever. Slow at times, but well worth it.",
            "review_date": "2011-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "88%\r\n\r\nA darned good western. Not to heavy.",
            "review_date": "2011-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well balanced and lighthearted entertainment packed with witty sarcastic verbal jousting that made me laugh out loud.\n\nFirst class mainstream entertainment.",
            "review_date": "2011-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cinematic bulls-eye that stands the test of time.",
            "review_date": "2011-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an epic movie...amazing cast and amazing dialogue..",
            "review_date": "2011-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The genius teaming of Redford & Newman in a new kind of Western.",
            "review_date": "2011-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would advise anyone and everyone to watch this. They are just so many laughs, many fun action scenes and of course Paul Newman and Robert Redford.",
            "review_date": "2011-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great for the relationship between Butch & Sundance and the amazing chemistry and acting skills between Newman and Redford, also features some great writing and fun action. \nI will say the pursuit that happens in the middle of the film goes on far too long and the story starts to lag there for a while. It also hasn't aged particularly well, and the older it gets, the more obvious it is how very miscast Katherine Ross was. \nThe beginning is great. In fact, the honey coloured into has such a cool look, it had me wishing the rest of the film looked that way as well. And the famous final shot is as powerful and fantastic as it ever was. Truly one of the greatest endings in film history.",
            "review_date": "2011-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Hilarious as well as thrilling, with one of the best bromances ever.",
            "review_date": "2011-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was freaking fantastic. I loved the chemistry between the actors, the hilarious one liners and the gorgeous cinematography.  It's also pretty heart-wrenching, but that's obvious as soon as the movie begins.",
            "review_date": "2011-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is more of a Sunday afternoon movie than a late night movie. I had a hard time not falling asleep, which was no fun because I really did enjoy the movie. Great comedic timing. My favorite scene was when they killed all the Bolivian bandits and said, \"Well, we've gone straight. What's next?\" Ironic excellence. Weird/gross tritone color scheme at the beginning.",
            "review_date": "2011-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little uneven in some parts, but an iconic western with good performances by Redford and Newman.",
            "review_date": "2011-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic buddy western.",
            "review_date": "2011-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering this is based on a true story this is too funny and too clean ( and whose idea was it to put Burt Bacherach in a western?!), but the film is a colourful and entertaining film built upon the sturdy foundation of the terrific chemistry between Redford and Newman, their exchanges are at times laugh out loud funny and the stunt work is incredible at the beginning and the cinematography at the end is nothing short of legendary. a film that is both before its time and past its time with music that is of its time.\r\n\r\nAnd another thing who the hell would buy a bike in the old west? that is so not the replacement for a horse!",
            "review_date": "2011-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have been wanting to watch this for a long time! Fun watch.",
            "review_date": "2011-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is a really good movie buried in here somewhere, but it doesn't want to show itself. While it's often considered a western, and 'technically' it is, it seems so ashamed of its own genre that it constantly tries to break away from any traditional western tropes which makes for a mess of a film. The story of Butch and Sundance isn't all that interesting, and it will remain a mystery to me why it has become legend; but Newman and Redford have great chemistry, and that leads to some good scenes. They save the film from mediocrity, and make for a pleasant watch. For the most part.",
            "review_date": "2011-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a little boring and overrated, but Butch Cassidy And the Sundance Kid has an excellent cast in it and the ending is magnificent.",
            "review_date": "2011-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Straight 60's popcorn entertainment, Butch Cassidy shines in all the right places; fun soundtrack, fantastic performances by Newman and Redford, great action, and just enough dramatic weight in their stubbornness to change with the times. It has it's flaws (notably in some weird choices both in the style and in the screenplay), but they're far outshone by the pros, particularly by the iconic ending and just in how fun it is.",
            "review_date": "2011-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was my first time watching. Not bad at all and really funny.",
            "review_date": "2011-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another AFI Top 100 off the list",
            "review_date": "2011-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch (Paul Newman) is an eternal optimist and self professed visionary. Sundance (Robert Redford) is a level headed sharpshooter. Along with the Hole In The Wall gang, they show how th West was won..and lost.\r\n\r\nSpurred on by a relentless posse that chases them half way across the country, Butch and Sundance escape to Bolivia where they attempt to begin life anew. But these legendary outlaws find that the times are changing even faster than the law men who are determined to bring them down.\r\n\r\nalso stars Katherine Ross, Strother Martin, Cloris Leachman, Henry Jones, Jeff Corey, Ted Cassidy and George Furth.\r\n\r\ndirected by George Roy Hill.",
            "review_date": "2011-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is no questioning as to why this film has become an American pop-culture icon. The story may be simplistic, but there is a beauty and heart in its simplicity. What really ties the film together, however, is the chemistry between Redford and Newman. This is one of the few films I've seen until now in which you can't tell that the actors are acting. There is something so real about their on-screen relationship that makes the film seem real. Everything just works with this movie, and it is punctuated by some absolutely stunning wide-angle shots of the American plains.",
            "review_date": "2011-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nice acted western ..",
            "review_date": "2011-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this film. However, it was a tad too light-hearted for my taste, especially when it comes to westerns. That isn't to say that it doesn't work for the film. Rather it's the opposite, it works perfectly. It's just not my cup of tea. Paul Newman and Robert Redford give superb performances in one of their collaborations. The story follows the legendary Butch Cassidy and The Sundance Kid on their adventures. They rob banks and trains, get chased by lawmen, and have the time of their lives. The characters themselves are what made the movie for me. The way Newman and Redford play off one another is fantastic. The soundtrack is, in my opinion, way out of place. The song \"Raindrops Keep Falling on My Head\" was made famous by this film, but I could see it used better in countless other films rather than this one. Overall it's a great dual character piece set in the west.",
            "review_date": "2011-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This dragged a bit for me, but the last half hour (plaza shoot-out, etc.) was awesome. Love the buddy relationship and the adventures. Katharine Ross's character is so superfluous, though...come on now.",
            "review_date": "2011-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the chemistry between Paul Newman and Robert Redford. In the end it's a pretty good western with some funny dialogues.",
            "review_date": "2011-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic flicc all the way Redford, Newman...it doesnt get any better cast wise..the plot got a lil stagnant but not 2 bad!!!",
            "review_date": "2011-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow in places, but some great acting and well-placed humour!",
            "review_date": "2011-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "George Roy Hill's \"Butch Cassidy and the Sundance Kid\" features in the early minutes of the film a beautifully coloured scene of a card game featuring the titular heroes. Unfortunately, it begins to spiral down from there and no further scene in the film captures the spirit of that short burst of sepia-toned brilliance. For \"Butch Cassidy...\"is a more toned-down western, not dirty enough and too cutesy to really be classified in that genre. Although there is some great chemistry between the main leads, played by Paul Newman and Robert Redford, for the year in it was made it could have been far grittier and is spoiled in particular by the sparse, awkward placement of music, especially the incongruent tune of Burt Bacharach's \"Raindrops keep falling on my head\".",
            "review_date": "2011-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let me start by saying that despite what the info on Rotten Tomatoes says, I do not belive that \"Butch Cassidy And The Sundance Kid\" is ONLY a western. First off, half the film doesn't take place in the American West, even though Bolivia does have a resemblance. Also, the screenplay has too many jokes, one-liners, and witty dialogue NOT to be called a comedy.\r\nEither way, here's a little description: Butch Cassidy (Paul Newman) is the leader of a gang of Old West gang of bandits, which includes the Sundance Kid (Robert Redford), who is really his best friend. However, they are threatened by a group out to catch them because they have been involved in one too many train robberies with the wrong fellow. So, with Sundance's girl (Katharine Ross), they escape to the South American country of Bolivia.\r\nPersonally, I love this movie. It had me laughing and attentive throughout the whole film, quite an accomplishment. Also, Newman's and Redford's chemistry and interactions is so believable and funny, it makes me just want to watch their character talk to each other for two hours while I watch.\r\nA great cast and marvelous, Academy Award-winning screenplay makes a wonderful, must-see film.",
            "review_date": "2011-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chemistry between Newman and Redford is mesmorizing. A spectacular biopic.",
            "review_date": "2011-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What separates this from the rest of the westerns is it's blockbuster feel than the gritty, sweaty long pauses. It feels as if Michael Bay directed a well written script with a modest budget. Once you stop expecting this to be a classic western, there is plenty of entertainment to be had and enjoyed. With a terrific chemistry between Paul Newman and Robert Redford with plenty of humor edging on being farce, it is a smart, light hearted western which doesn't have much not to be liked about.",
            "review_date": "2011-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The great chemistry between the two leads Newman and Redford ease the tension in this movie, where it doesn't take long to figure out that the \"noose\" is figuratively tightening around their necks no matter what they choose to do. This one is an excellent mix of genres: western, comedy and suspense. It holds up very nicley through the years, like most of Newman's movies during this part of his career.",
            "review_date": "2011-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid Western.\n\nI'm not quite sure how to sum it up, but I prefer Westerns like Pale Rider and Magnificent Seven.",
            "review_date": "2011-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film that I watched with my father where he was supposed to like it and I was supposed to be a stooge. Currently, he will not watch it twice and it is one of my favorite westerns; admittedly, his \"Raindrops Keep Fallin' on My Head\" reason is fair.",
            "review_date": "2011-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite movie! Hilarious, beautiful cinematography, great music and great actors, what more could you want?",
            "review_date": "2011-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great western... thought the combo (paul newman and robert redford) was awesome in 'The Sting', but this was even better... its slow (in a good way) and takes its time to establish its characters... must watch...",
            "review_date": "2011-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually better than my expectation",
            "review_date": "2011-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Newman/Redford.  Guaranteed to be good.",
            "review_date": "2011-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What goes around comes around, especially for Butch Cassidy and the Sundance Kid.",
            "review_date": "2011-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Westerns I've seen.",
            "review_date": "2011-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know, Butch and Sundance sounds like the stereotypical male/female role compensation in a gay couple, and it doesn't really help that this couple is Paul Newman and Robert Redford, because they're too pretty to be outlaws in the brutal west. Actually, Butch and Sundance weren't the worst-looking outlaws of the old west, but here, Butch had to go against the stereotype of his gay name and lose the moustache, because these guys look gay enough when it's just Sundance with the stache. Actually, I don't know if the moustache thing was all that big of a stereotype back in 1969, or at least it must not have been, because, as they tell you in the trailers, Butch and Sundance were trying to escape an ensuing modern world. I can't blame them, because, if you'll forgive my morbidity, in this modern world, Newman is dead, and the years have hit Redford like one of the trains he and his boyfriend knocked over back in the day. Speaking of which, if nothing else is exciting about this film, it's the fact that it was the first to feature the legendary duo of Paul Newman and Robert Redford... out of only two. They probably wouldn't have even made \"The Sting\" if George Roy Hill didn't drag them back together for that one, too, but I can't blame people for still finding their teamwork iconic, because they're mighty charming, even though they can't keep the film from being about as slow as a dyslexic stoner with cerebral palsy and polio, only, obviously, with a desire to avoid the noose. My horribly morbid jokes aside, the film is decent, but kept a ways away from being fun, and not just by the slow spells.\r\n\r\nAn adventurous account of two legendary men of crime, passion and charm, this film's story concept has a lot of potential for fun, but not much in the way of dramatic potential, at least not in this case, in which the story concept, with natural shortcomings, takes a lighthearted approach to potentially tense momentum that, for all the scope, limits a sense of urgency almost as much as tonal unevenness. Whether it be because the jars aren't too extreme, due to the narrative's rarely getting all that heavy, or because the cold atmosphere limits a sense of tone to begin with, tonal inconsistencies aren't too big of an issue, but the humor and seriousness of this crime thriller is juggled messily. Of course, even more all over the place is focus, because as much as I complain about natural shortcomings and a lack of a sense of urgency, there are still a lot of layers to this adventure, buddy romp, romantic triangle, and moderately dramatic thriller, and each shift between these layers is a serious jar, ostensibly because each layer is focused upon for way too long. Clocking in just shy of two hours, this film is dragged out by anything from excesses in the material that further exacerbate the sting of unevenness, to filler and long meditations on nothing which quickly become monotonous, but must not be present too much, given that a sense of pacing is tight in a lot of ways. I suppose scripting gets the film where it wants to go rather smoothly, and that's by some miracle, because, at the end of the day, the biggest problem with this film is George Ray Hill, whose extremely quiet directorial approach doesn't so much feel thoughtful, as much as it feels lazy, with a chilled, if at all existent atmosphere that, upon combining with the dragging, establishes an almost ethereal feel which limits resonance and bores, frequently, and sometimes tediously. I reckon endearing style, scripting and acting keep the final product adequately entertaining, but Hill very rarely abates on that dry storytelling that, plain and simple, is dull, seriously so, taking a conceptually thin, yet still worthy project that has the potential and, well, the material to thoroughly engage, maybe even reward, and violating it by draining a sense of fun, until the final product collapses as underwhelming. Nevertheless, beyond Hill's direction, as well as the natural shortcomings and inconsistencies, the film keeps the patient going just fine by doing a respectable deal of things right, including capturing an era in a handsome manner.\r\n\r\nSet largely on vacant soil beyond civilization, this film isn't especially playful or even unique with its production values, but Philip M. Jeffries' and Jack Martin Smith's art direction still does a perfectly fine job of restoring the look of an America preparing for the turn into the 20th century with a handsomeness deriving from the sheer distinctiveness of the environments, and complimented highly by cinematography by the great Conrad Hall that delivers on near-dreamily light coloring and a remarkable emphasis on subtle lighting in brighter settings, and on the lack of lighting in the darker settings in a fashion that was refreshing for the time and still stunning to this day. From the particularly unique 1890s photo-style sequences, or the many breathtaking shots of a classic western environment, the film's visual style is rich with highlights and ultimately just about truly amazing, with an edge that is more-or-less matched by the edge of certain areas in the film's story concept. This somewhat light take on the misadventures legendary outlaws might not have much in the way of dramatic edge, but it's still kind of refreshing in its being a little more adult than many 1960s Hollywood westerns, as surely as it, in its dynamicity as a comedy-drama interpretation of the legendary tale of Butch Cassidy and the Sundance Kid, is more intriguing than its interpretation, that is, its directorial interpretation. Well, William Goldman's script is still seriously draggy, the point of inconsistency, but it's still much more inspired than George Roy Hill's direction, with consistently clever dialogue that often anchors sharp humor, in addition to characterization that places just a flavorful punch of Hollywood fluff on the drawing of humanly genuine and subtly layered figures. The script is just about excellent, and the style isn't too shabby either, so, by a pretty embarrassing margin, limp direction on Hill's part is the final product's biggest issue, threatening engagement value which is adequately sustained by the sharp style, writing and, of course, acting. Driving the film as much as it can with all of the slow spells, this cast is rich with charm, partly from the beautiful Katharine Ross as an innocent woman who joins the run of two men she much choose between as lovers, and largely from dashing leads Paul Newman and Robert Redford, whose dynamite individual charisma is matched only by dynamite chemistry. Newman and Redford, like Williams, do more than a film this cold probably deserves, and were it not for Hill's falling so flat, the final product would have gone a long way, and yet, with that said, the film intrigues just fine with its fair deal of strengths, despite its many shortcomings.\r\n\r\nWhen the heat has blown over, natural shortcomings to this story concept are so intensely stressed by tonal and focal inconsistencies, structural dragging, and some seriously dull directorial cold spells hold the final product way back, but solid art direction, gorgeous cinematography, sharp writing and charismatic performances - particularly by Paul Newman and Robert Redford - ultimately proves to be enough to make George Roy Hill's \"Butch Cassidy and the Sundance Kid\" a fair, if cold tribute to one of the great team of outlaws of the old west.\r\n\r\n2.5/5 - Fair",
            "review_date": "2011-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 1st Paul Newman-Robert Redford movie follows the last days of the pair of train robbers. Nice song-Raindrops Keep Falling On My Head",
            "review_date": "2011-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could watch this over and over again. Just a great film.",
            "review_date": "2011-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far, the most entertaining and fun Western of all time.",
            "review_date": "2011-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Western movies with terrific work from Newman and Redford..",
            "review_date": "2011-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is one of those movies that's still got a great story, is still funny, and really holds up even after 40 years. that's sayin somethin",
            "review_date": "2011-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I do not care for Robert Redford nor the Newman and Redford duo. Any film with the song Raindrops keep falling on my head should be seriously evaluated. This film has scenes that are longer than they need to be, it is very poorly lit when they are indoors, I don't know if they filmed on location but if they did not then the sets are terrible. The acting is generic, Redford looks tough enough I guess. Not that impressive, but it's a pretty good story.",
            "review_date": "2011-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the two of them are perfect together and make the whole movie entertaining",
            "review_date": "2011-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch it, that is all.",
            "review_date": "2011-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well made film with a screenplay that either suffers or gains from it; its subtle comedy in the dialogue.  I'm really on the fence with it because it was different from anything else done at the time but at the same time, it was taking your mind off the film and not realizing it's a western.  But overall it was a good film with strong acting from the two leads, but nothing more from the acting department.  The cinematography was amazing and so influential and was even more added to by its great subtle score.  A very ambitious film about two of the most infamous bandits in America while trying to show the relationships of the leads rather than their actions they were known for (robberies).",
            "review_date": "2011-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great westerns tells the tale of how these famous outlaws met their end. A lot of poetic licence used but such a joyful film and brilliantly distiguished their very individual personalities. Couldn't have asked for better casting than Redford and Newman. A classic without a doubt.",
            "review_date": "2011-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Butch Cassidy et le Kid\"",
            "review_date": "2011-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butch Cassidy and the Sundance Kid is an iconic film all around, but it's not always a perfect picture. It's minor flaws are overshadowed by it's two stars, a great script, and brilliant cinematography. It has sweep and scope, and plenty of memorable scenes and lines. The modern era may find it a little tedious at times with its pacing issues, but witnessing its legacy is reason alone to watch the classic film.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although much of its freshness has faded, this still-amusing film reinvented the Western for a new generation.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is a reason why this film is a class! Smart and funny with a great cast.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That ending. I will never forget that ending.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before teaming up together in the enormously successful Sting in the early '70s, cinematic superstars Paul Newman and Robert Redford paired up in 1969's near equally enormous Butch Cassidy and the Sundance Kid, a movie whose reputation over forty years has walked the line between Western classic and over-hyped big-budget buddy flick.\r\n\r\nCassidy and the Kid follows its two eponymous brigands, outlaws who have overstayed their welcome on a falling frontier, as the savage West is quickly becoming tame at the turn of the twentieth century.  After a routine train robbery goes south, so do Butch and Sundance, played by Newman and Redford respectively, once a posse threatens to end their criminal career... permanently.  Along with the courting companionship of an enigmatic schoolteacher - her only apparent purpose is to close a love triangle with the two main heroes, but the filmmakers dare not explain why - the Banditos Yanquis as they're swiftly coined set out to rob banks in Bolivia.  It's a tale worth telling, a solid plot for a film.\r\n\r\nWhat's divided critics from '69 'til now is the ultimate effectiveness of William Goldman's ambiguous screenplay.  From the outset, director George Roy Hill always intended for his film to be a blending of genres and moods, juggling sympathy with comical farce.  The first scene opens in classic spaghetti style, a drawn out showdown encapsulating the intensity of any Lee Van Cleef counterpart,  the sepia color tone emphasizing the olden photographic nature of the late 1800's.  It's an opening that you immediately relate to and understand... It's a Western. Then, a shift in mood. Butch and Sundance become established as long-time friends, nay, more appropriately, bumbling buddies that precede the cop duos of the 80's and onward.  Butch is the brains, and Sundance is the sick shooter, the man with a mouth and the guy with a gun.  So what starts as a serious film rapidly transitions into a buddy comedy, and there's nothing wrong with that.  It's perfectly representative of its characters, two Western veterans who can't keep up with the world that's changing around them and ultimately have to adapt to it.  The real problem with the film is that its ambiguity lies in the fact that it continually shifts back and forth between sobriety and daring delight.  It never really knows what it's trying to be.  But like I said before, that's what it was intended to be right? And like I said before, it all depends on whether you view this as strengthening the film via distinctiveness, or hindering it by never allowing it to become either the truly brilliant Western or comedy that it could have been.\r\n\r\nThat said, the sharp dialogue and delivery of Newman and Redford more than make up for any faults in the storytelling department, their bickering quips easily proving the highlight and foundation of Cassidy and the Kid.  No shocks required.  Though at the time Redford wasn't a superstar, in retrospect the match-up was fateful and the performances could hardly have been disastrous.  One notable sequence involves the two notorious bandits' difficulty in robbing Bolivian banks because they don't know the language.  Leave it to Paul Newman's Butch to pull out a sheet of crib notes in earnest answer. It's classic hilarity rarely found today.\r\n\r\nTechnically, Butch Cassidy is absolutely beautiful, with top-notch production values and gorgeous on-location venues that, coupled with scenes like the Super-posse chase which, though many have argued drags on far too long, really captures the vast openness and the beauty of the once great Western frontier.\r\n\r\nDespite a screenplay that may come off as sloppy and, to quote one critic, 'schizophrenic', in the opinion of this reviewer, Butch Cassidy and the Sundance Kid is rather well in line with its titular characters, who don't know what the hell they're going to do in this newer, smaller America in which they've become anachronisms.  They try to adapt, to change, but they end up realizing that they can't change who they are.  In all their running from the law, they've failed to grasp that society has run faster, in fact raced straight past them, and they're just too battle-weary to keep up.  So they do the only thing they know how to do... they draw a pair of pistols and charge their fate in a blaze of undying glory.  It's an entertaining Western, an entertaining comedy, hell, an entertaining film, one that's great to watch simply because it's got Paul Newman and Robert Redford in it.  Sure, it may not seem coherent all the time, but maybe that's what makes it the brilliant Western and comedy that it is.  In a word, ambiguous? No. Dynamite.  But only enough to blow the safe.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[90/A-] Sometimes a little cornball and overly cute, and it brings a flippant disregard for the more prosaic customs of its historical period, but that's all part of its unapologetic  swank, which makes this one of the most watchable and entertaining of revisionist westerns.\r\n\r\nAll the twinkles in the eyes, the anachronisms, the foolish decisions, and counterpoints of charisma suffusing the dialogue lend a wonderful personalism to the story, unabashedly hitching us right alongside a couple of blatant, none-too-wise criminals, with no explanations necessary.\r\n\r\nNewman and Redford seem supernaturally apt for the parts, and they pull it off with macho sure-footedness. Their dumb, dusty, beautiful mugs wane into desperate bemusement (but never fail to crack wise) as they are chased from the land by a kind of mythically unstoppable lawman, carrying thunder, whose appearance signals the beginning of the end of Butch and Sundance's heady, anti-establishment ways.\r\n\r\nTheir last stand is unforgettable and poignant, going out guns blazing; to the bitter, bullet-ridden end creatures of beatifically naive defiance.",
            "review_date": "2011-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good: Great acting and chemistry between roles, good plot, humorous, viewers will be attached to characters.\nBad: Nothing to notice.\n\n\nMy favorite Western of all time. The plot is of two friends who rob banks and trains for a living. But they somehow manage to do it without hurting anyone, which further strengthens the relationship between the viewer and the main characters. The relationship between Butch and Sundance is can be both serious and funny. It is quite obvious that Paul Newman and Robert Redford work very well together as partners. There are elements of humor, action, and romance that further absorb you further into the movie. The most interesting aspect of the movie is the fact that you can't decide if you want Butch and Sundance to keep getting away with the crimes. You love the characters and want them to prevail, but at the same time, theyre bank robbers and should be brought to justice.",
            "review_date": "2011-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Gorge Cassidy\" (Paul Newman), a.k.a. \"Butch Cassidy\", and \"Lonny Longbaugh\" (Robert Redoford), a.k.a. \"The Sundance Kid, are two of the greatest robbers in the history of the Old West. They pulled jobs on banks and trains with an expertise that made them famous from coast to coast.\r\n\r\nNow, years after being out of the business for about two decades, they decide to pull one last bank heist in Bolivia, with the help of a school teacher (Katharine Ross) with romantic ties to both men.\r\n\r\nI have to say that I am pretty disappointed in this film. I found it to be slow, with not enough action considering the topic of the movie. It dragged so much that I noticed spending more attention to my computer than watching the movie itself on cable television.\r\n\r\nOne thing that stood out was the on-screen relationship between Newman and Redford. This is what carries the movie I believe, and most likely why this movie is called a classic now. You feel as if the two are not just partners in crime, but friends with the ribbing that they give one another.\r\n\r\nAnother problem with this movie is the soundtrack. The only piece of music that is memorable is Raindrops Keep Fallin' on My Head by BJ Thomas, and that was a weird tune for a Western set in the Old West. If you ask me, the song was just an odd choice.\r\n\r\nI also barely enjoyed Ross as \"Etta Place\". Her character was barely developed if you asked me. It appeared that she was there as a romantic interest, and to help teach \"Butch\" and \"Sundance\" Spanish for their attempt at robbing the Bolivian bank.\r\n\r\nIf you expect a lot of gunfights, you are mistaken on this one. Of what there is in the movie, they are short and well placed.\r\n\r\nThe cinematography is hard for me to judge since Encore Westerns used a pan-and-scan format. I had to deal with only half of a scene when two people were talking to one another. But, from wide shots, I could see some spectacular scenery, including the famous scene when the title characters jump from a cliff into the water.\r\n\r\nBecause it was declared a classic, I've been wanting to see this movie. I am highly disappointed in it.",
            "review_date": "2011-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Gorge Cassidy\" (Paul Newman), a.k.a. \"Butch Cassidy\", and \"Lonny Longbaugh\" (Robert Redoford), a.k.a. \"The Sundance Kid, are two of the greatest robbers in the history of the Old West. They pulled jobs on banks and trains with an expertise that made them famous from coast to coast.\r\n\r\nNow, years after being out of the business for about two decades, they decide to pull one last bank heist in Bolivia, with the help of a school teacher (Katharine Ross) with romantic ties to both men.\r\n\r\nI have to say that I am pretty disappointed in this film. I found it to be slow, with not enough action considering the topic of the movie. It dragged so much that I noticed spending more attention to my computer than watching the movie itself on cable television.\r\n\r\nOne thing that stood out was the on-screen relationship between Newman and Redford. This is what carries the movie I believe, and most likely why this movie is called a classic now. You feel as if the two are not just partners in crime, but friends with the ribbing that they give one another.\r\n\r\nAnother problem with this movie is the soundtrack. The only piece of music that is memorable is Raindrops Keep Fallin' on My Head by BJ Thomas, and that was a weird tune for a Western set in the Old West. If you ask me, the song was just an odd choice.\r\n\r\nI also barely enjoyed Ross as \"Etta Place\". Her character was barely developed if you asked me. It appeared that she was there as a romantic interest, and to help teach \"Butch\" and \"Sundance\" Spanish for their attempt at robbing the Bolivian bank.\r\n\r\nIf you expect a lot of gunfights, you are mistaken on this one. Of what there is in the movie, they are short and well placed.\r\n\r\nThe cinematography is hard for me to judge since Encore Westerns used a pan-and-scan format. I had to deal with only half of a scene when two people were talking to one another. But, from wide shots, I could see some spectacular scenery, including the famous scene when the title characters jump from a cliff into the water.\r\n\r\nBecause it was declared a classic, I've been wanting to see this movie. I am highly disappointed in it.",
            "review_date": "2011-05-18",
            "source": "rt",
            "lang": "en"
        }
    ]
}