{
    "rating": 9.0,
    "release_date": "1969-06-18",
    "num_reviews": 110,
    "genres": [
        "Western"
    ],
    "summary": "In this gritty Western classic, aging outlaw Pike Bishop (William Holden) prepares to retire after one final robbery. Joined by his gang, which includes Dutch Engstrom (Ernest Borgnine) and brothers Lyle (Warren Oates) and Tector Gorch (Ben Johnson), Bishop discovers the heist is a setup orchestrated in part by his old partner, Deke Thornton (Robert Ryan). As the remaining gang takes refuge in Mexican territory, Thornton trails them, resulting in fierce gunfights with plenty of casualties.",
    "reviews": [
        {
            "content": "An All Time Classic. The acting is phenomenal with no one ever feeling like they just blend in and are forgettable. Everyone has charm, charisma and chemistry with each other. The pacing is phenomenal and moves very quickly with jaw dropping action scenes that never feel over the top despite the extreme violence which is a tremendous accomplishment. The soundtrack is really varied and very memorable. This a film everyone should give a watch at least once.",
            "review_date": "2023-03-18",
            "source": "rt"
        },
        {
            "content": "I Think This Is the Best Western of Film History. It´s My Favourite.",
            "review_date": "2022-12-07",
            "source": "rt"
        },
        {
            "content": "The final shootout alone is worth watching the whole thing.",
            "review_date": "2022-11-04",
            "source": "rt"
        },
        {
            "content": "It has long been said as one on the great violent western. Revisited in 2020, now I find how beautiful/elegant this is, at the same time, lengthy. I rather appreciate this as the comeback of William Holden.",
            "review_date": "2022-10-19",
            "source": "rt"
        },
        {
            "content": "Sam Peckinpah's The Wild Bunch feels like a farewell to the Westerns of old, where bullet wounds failed to produce blood and the bad guys always wore black.  While the story remains pretty much the same – a posse pursues a gang who have been terrorizing the Southwest – Peckinpah turns the violence up a notch or two.  The battles between the lawmen and the fugitives rage on for extended periods, blood spewing everywhere when a bullet finds its mark.  Sure, the violence is wildly gratuitous and the final confrontation is insanely improbable, but the movie has a strange quality to it that makes it appealing, probably due to the likeability of the villains.  The score is rousing, the cinematography is beautiful, the locations are stunning, and the performances of the leads are strong.  If you can overlook the weak performances from the secondary cast and accept the intense violence, The Wild Bunch is an oddly compelling film.",
            "review_date": "2022-10-12",
            "source": "rt"
        },
        {
            "content": "Rating: High body count. Low IQ.",
            "review_date": "2022-09-15",
            "source": "rt"
        },
        {
            "content": "Sam Peckinpah never needed anyone's applause, and certainly not mine. I was four when this film came out, but ten when I saw it the first time. I watch it annually ever since, more often since my father's death thirty years ago, less so as I have little ones at home to make it hard to watch the spatter and gore of the Bunch's murderous adventures.  \n\nIt remains a masterpiece of grotesque, ultra-violent western non-lore. The American West mythologized itself, and never more so than in this genre. And Sam redefined it with THE WILD BUNCH.\n\nThe slo-mo gets made fun of now. But Peckinpah perfected its use. The bridge collapse alone is worth the technique.\n\nPike Bishop and his gang are ruthless killers and thieves. They are irredeemable. yet they manage to earn a chance at escaping hell by their final gesture of brotherhood to their doomed friend, Angel.\n\nNobody should get out alive, but Deke and Freddie do, all while knowing they do not deserve that as a reward either. As William Munny would say over twenty years later in another western, \"deserve's got nothing to do with it.\"\n\nIn this film, Pike says, when death and damnation beckon, \"Let's go!\" Go, indeed. All shall die eventually, but few will live to die gloriously, in a final gesture of sacrifice for a dying friend.",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "This isn't a western film is \"The Western Film\". What a sequences. 9/10",
            "review_date": "2022-03-09",
            "source": "rt"
        },
        {
            "content": "Absolute worst Western Ive ever had to sit through. Its not even worth a review.",
            "review_date": "2022-03-03",
            "source": "rt"
        },
        {
            "content": "Back in 1969 \"The Wild Bunch\" changed every popular conception of the Western film genre.  It took the standard format of hero against aggressor without clear result of actions and rewrote the format. What is very noticeable from the onset of the film is that it makes no attempt to romanticise the old west or make its characters likeable or endearing to the audience. Director Sam Peckinpah has tragic characters in unforgiving situations  giving an honest representation of the violence and death that surrounded them.\n\n\"The Wild Bunch\" are a group of weary ageing outlaws not quite coming to terms with the changing world they live in. Led by Pike Bishop ( William Holden ) and supported by his loyal sidekick Dutch ( Ernest Borgnine ) they are ambushed by a relentless posse fronted by a former gang member Deke Thornton ( Robert Ryan ) After a violent escape \"The Wild Bunch\" hide out in Mexico. What ensues are numerous gun battles and gun running for money.  The graphic indiscriminate carnage and the results of the gangs actions are clear for all to see which eventually culminates in a bloody violent finale. \n\nPeckinpah's representation of humanity and idealistic notions about freedom are transformed into wild, native greed and violence. With great performances from seasoned Hollywood stars  \"The Wild bunch\" not only depicts the beginning of the end of the Wild West but set in motion the end of the film genre itself.",
            "review_date": "2022-01-23",
            "source": "rt"
        },
        {
            "content": "One of the greatest western movies in existence.",
            "review_date": "2021-11-03",
            "source": "rt"
        },
        {
            "content": "Gritty and bloody, sure, but this is ultimately an uplifting tale of very bad men finding a sort of heroic redemption by adhering to a bygone era's code of honor.",
            "review_date": "2021-10-22",
            "source": "rt"
        },
        {
            "content": "Sam Peckinpah enjoys a bit of on screen violence, he went on to direct the ultra controversial Straw Dogs two years after this western phenomenon. I was advised to watch The Wild Bunch as part of my research for a piece of college coursework back in 2006, and sadly its taken me 15 years to get round to it. However, it was worth the wait. The film begins, and ends, with epic shootouts, but despite accusations of violence for the sake of violence The Wild Bunch justifies its brutality with well thought out backstory for each of the main characters. By the time the finale blows up explosively in your face, you can't wait for it to get going. At almost two and a half hours, this might be of similar length of The Good, The Bad, and The Ugly (1966), but it is the opposite in terms of pacing. It's a fantastic example of two absolute masterpieces of the genre, that go about their business in two completely different ways, but the end result of genius is exactly the same.",
            "review_date": "2021-08-19",
            "source": "rt"
        },
        {
            "content": "For Me This Is the Best Western Movie of All Times. The Actors Holden, Borgnine And\nRyan Were No Better In Any Western As Here. The Camera of Lucien Ballard Too. Sam\nPeckinpah Has Only Three Top Movies. These Are Ride the High Country, The Wild\nBunch And The Getaway.",
            "review_date": "2021-07-25",
            "source": "rt"
        },
        {
            "content": "I can't keep my eyes open. So slow while watching these evil creatures fail.",
            "review_date": "2021-04-09",
            "source": "rt"
        },
        {
            "content": "Entertaining robbers on the run with enough shootouts and sleaze for a lifetime.\n\nSam Peckinpah's Western drama The Wild Bunch (1969) is something else. Peckinpah blows up bridges, definitely kills horses, wrecks massive sets, crashing trains, and stages gigantic shootouts. Peckinpah's direction is peak Western drama, focusing on bloody gunfire, endless squibs, real explosions, and compelling character motivation with a nihilistic worldview. The Wild Bunch is entertaining during every action sequence, especially the opening robbery and closing shootout. \n\nI think it falters during the midpoint where there's all this unnecessary sexism in having women only to rape or degrade for laughs. It's quite gross and something like a half hour of The Wild Bunch focuses on using ladies just to sleep with as a reward or prize. It's so old fashioned, it's hard to believe this came out in 1969 with such bare bones female characters. I still find the rest of The Wild Bunch exciting and fun, but Peckinpah's treatment of women in his film is just gross.\n\nWilliam Holden is fantastic as Pike Bishop, the leader and mastermind of a gang of bank and train robbers. His nuanced approach demonstrates why Holden was a star. He can command killers and fools alike with a piercing presence and assumed respect, while also charging forward with guns ablaze. He's very cool and one of The Wild Bunch's most interesting characters. His desire to retire with wealth, regret over his life without a woman, guilt over the girl he sleeps with, and fury over his departed comrades is fascinating. You see all his cunning scheming or inner pain in Holden's hurt eyes.\n\nSimilarly, Robert Ryan is excellent as Deke Thornton, the head hunter in charge of the bounty hunters sent to kill Holden's band of merry men. Ryan displays his inner anguish over getting blackmailed into hunting down his old boss, who he bears animosity towards over ditching him to get caught by the law. Ryan comes across as smart, with a heavy gravitas, and cool during his shootouts and planning.\n\nErnest Borgnine is great as the angry, trigger happy, robber Dutch Engstrom. Edmond O'Brien is unrecognizable as the old, surly robber Freddie Sykes. Jaime Sanchez is intriguing and sympathetic as the robber Angel. Honestly, everyone else in The Wild Bunch is either fine and serviceable or downright deplorable with dated performances.\n\nWalon Green, Roy N. Sickner, and Sam Peckinpah's script is both excellent for all the sincere Western drama about chasing robbers down in the desert with their questionable moral choices throughout The Wild Bunch. Basically, every man in the movie is a terrible person, but they have several chances to do the right thing. They handle the men's roles well other than making each of them a despicable sexist pig. It's always a flaw in Westerns when the women are written incredibly poorly. Lou Lombardo's editing is sharp within each scene, but Peckinpah and Lombardo needed to cut The Wild Bunch down by an hour. There's no reason for The Wild Bunch to be 145 minutes, when there's so little plot. \n\nLucien Ballard's cinematography is quite pretty during all the far wide shots of the desert and valleys. You feel how sparse and desolate this area is to live and die in, while all the close-up shots feel gritty and dirty like the characters. Jerry Fielding's score is fairly exciting and engaging, but could have been used more to hold your attention during this ludicrously long movie.\n\nIn all, The Wild Bunch has all the violence and gun-slinging action you want from a Western with interesting character arcs to be sure. Just don't expect the most sensitive portrayal of women herein.",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "Magnificent explosion of blood and guts, which personally I love. exellant actors of the old school.",
            "review_date": "2021-01-09",
            "source": "rt"
        },
        {
            "content": "Excellent movie, by far Sam Peckinpah best movie.  The action, acting, story, cinematography are excellent and have been a inspiration for many movies like \"Extreme Prejudice\" and directors like Tarantino.",
            "review_date": "2020-12-23",
            "source": "rt"
        },
        {
            "content": "A traditional western ",
            "review_date": "2020-10-07",
            "source": "rt"
        },
        {
            "content": "Spectacular, violent, gripping western that digs its hooks into you and won’t let go. So masterfully made it makes you more awake and excited while watching it. Just the right amount of humor. Great cast too. My favorite scene is probably the train robbery set only to the stalled train’s noises.",
            "review_date": "2020-09-29",
            "source": "rt"
        },
        {
            "content": "AFI 100 Greatest Films - #80: I am usually not a fan of old westerns because I generally find the stories, characters, and their motivations overly simplified and boring. Thankfully Peckinpah did not indulge many of the classic tropes as The Wild Bunch offered a well layered story that was easy to become immersed in with some truly exciting action sequences, that I would guess used more fake blood packets than any western up to that point. The actors all did well and, aside from Holden, I think Borgnine stood out the most for me.",
            "review_date": "2020-08-02",
            "source": "rt"
        },
        {
            "content": "It's hard for me to enjoy a film where I can not wait for every character to get their comeuppance",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "You are faced with a choice in life in which there is no middle ground: the classic Western, or the post-Western; Rio Bravo or High Noon. You can enjoy parts of each, but everybody prefers one or the other, and I'm firmly in the camp of the latter. The Wild Bunch's explorations of moral codes, loyalty, dying lifestyles (as appropriately explored through a 'dying' genre), and practicality in the face of all of the above are philosophy put to film, and ranks among the greatest ever. Expositional deviations that seem clunky initially gradually are revealed to possess a degree of significance that is entirely unexpected. The landscape and action cinematography are well-designed and often novel. Somewhere above the Magnificent Seven and its exploration of similar themes (done better in Kurosawa's original), I consider this to inhabit a position of honor alongside High Noon and Once Upon a Time in the West (and maybe the Good, the Bad, and the Ugly) as the top in the genre. (5/5)",
            "review_date": "2020-06-25",
            "source": "rt"
        },
        {
            "content": "An aging outlaw & his gang prepare to retire after one final robbery, but all goes wrong when they descover the heist is a set up, orchestrated by a former partner & the remaining gang take refuge in Mexico & strike a deal with a Mexican dictator in Peckinpah's bloody & once controversial brutal western.",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "The Wild Bunch really shows that Westerns doesn't need to be romantic nor clean. Directed by acclaimed director Sam Peckinpah, the movie talks about a aged gang who decided to do a a final score before retiring. I love everything from this movie from the score, the story, the performances and the direction. Yes, even the violence and themes are perfect even to this day. Overall, The Wild Bunch is an important piece of Western for all to see.",
            "review_date": "2020-05-21",
            "source": "rt"
        },
        {
            "content": "A great movie, a great western.",
            "review_date": "2020-05-21",
            "source": "rt"
        },
        {
            "content": "\"We're not gonna get rid of anybody! We're gonna stick together, just like it used to be! When you side with a man, you stay with him! And if you can't do that, you're like some animal, you're finished! *We're* finished! All of us!\" 🦂\n\nAbhorrent, crude, reprehensible men occupy the screen by any means necessary for a brutal 143 minutes that horrified filmgoers in 1969, and may be more effective today. Etching Sam Peckinpah's name into Hollywood history, this nihilistic, blood-spattered masterpiece revolutionised the entire Western genre with quick cuts & unapologetic slow motion techniques, not to mention an aging cast who are delightfully despicable from start to finish. Every character commits heinous, unforgivable actions, yet we're still swept up in the vehement masculinity of outlaws who live by an anachronistic code of honour, and want nothing more than to go out guns blazing, at least before the modern world finally catch up to them.\n\n9/10 slow-motion squib explosions.",
            "review_date": "2020-03-19",
            "source": "rt"
        },
        {
            "content": "Masterpiece, top 10 western of all time and an iconic cast. Violence is brutal and film extremely controversial when it came out.",
            "review_date": "2020-01-09",
            "source": "rt"
        },
        {
            "content": "fuck yes, cinema. C I N E M A",
            "review_date": "2020-01-07",
            "source": "rt"
        },
        {
            "content": "THE GREATEST WESTERN EVER MADE!\nIn my not-so-humble opinion, The Wild Bunch is by far the greatest western of all time. Others may argue till they are blue in the face, but my opinion shall never waver. The movie itself, is just an overall masterpiece of American Cinema. From the outstanding acting and dialogue rich screenplay, to the violent action sequences and stellar Cinematography, Director Sam Peckinpah brings to life this unique look of the American Western. Not only is the film a gritty portrayal of a particular time in history, but it's also a representation of how the American West, as the Cowboys and Outlaws knew it, was coming to an end. \n\nThe movie is set in a time when the roaming landscapes of Cowboys, Indians and Outlaws, were coming to an end as modern civilization was growing and advancing in most parts of the country. The vast and numerous lawless towns and municipalities were becoming law abiding, organized and governed. The free-for-all gun toting mentality of lawless societies were fading from the American West. \n\nThe movie plays like one final hoorah for a dying breed of men and morals, or lack thereof. Peckinpah and Cinematographer Lucien Ballard held nothing back, and brought in-your-face visuals to this great Western. The entire cast was a once in a lifetime gathering of talent, from movie stars to newcomers, and even several character actors who gave their finest performances in this movie. With Ernest Borgnine, Emilio Fernandez and L.O. Jones, giving the performances of their life. And veteran lead actor William Holden, showed the world his amazing acting abilities one more time, by captivating audiences with every line, look and subtlety emoting on the big screen. \n\nI could ramble on and on about the specifics and brilliance of this film, but I think I have said enough. If you are a film buff, a lover of westerns or just a shoot-em-up violent fan, then the should check out The Wild Bunch. This is a movie that is shown and taught in virtually every film school, as it should be. If you want to be entertained, enthralled and discover the beauty of American Cinema, then The Wild Bunch is a must see.",
            "review_date": "2019-12-09",
            "source": "rt"
        },
        {
            "content": "\"Ain't like it used to be but.... it'll do.\"\n\nThe movie that put made Sam Peckinpah synonymous with movie violence til the end of time.\n\n1913, a gang of outlaws led by Pike Bishop goes on the run after a botched bank robbery, chased by a former partner of Pike's who's leading a team of bounty hunters. Pike's men hide out in Mexico and start working for the Mexican army. And things.... get.... bloody.\n\nI was trying to think of what kept coming to mind as I was watching this movie and after it was over. A tagline to sum this movie up and it hit me.\n\nThe Last Western\n\nIt's like certain comics I like, like Kingdom Come or The Dark Knight Returns where it's about an older Batman at the end of his superhero career and what it means to be at the end of an era. Or of course there's other Westerns like Unforgiven or Shane that tell similar grim realistic Western tales.\n\nIt's like Peckinpah wanted to tell a story that summed up a certain moment in time where the age of the gunslinger and the Wild West came to an end.... or at least the end was near. But with our outlaws in this movie sort of unable to return to America and realizing their days of Wild West crime are over, they go out in a blaze of glory because it won't ever get better than that again. I can see why this movie was nominated for Best Original Screenplay for having a really unique Western story.\n\nFantastic cast in this movie.\n\nThe never.... and it really seems like never..... the never not great William Holden who more and more is becoming like a Top 10 actor for me. I saw another film of his for the first time this year Sunset Blvd and now The Wild Bunch and goddamn this guy is good. I'm used to seeing him as a good guy so it was awesome to see him play just an utter bastard. There's a moment where he gets shot in the back by a woman, he turns around goes \"Bitch!\" and blows her away with a shotgun and that blew my fuckin' mind that Peckinpah gave us a protagonist like that. I mean Clint Eastwood in the Dollars movies was kind of a cold guy but he DID seem to have even a KIND OF morality... not the case for Pike or any of the guys in this movie.\n\nBut I love that Holden is one of these amazing actors that got the chance to go from the Golden Age of Hollywood and keep working into the newer age and be part of cinema history, I mean he's in Sunset Blvd AND The Bridge on the River Kwai AND he's in Network AND he's part of one of the bloodiest Westerns ever made! Nice!\n\nThe cast is filled out by loads of stellar actors like Ernest Borgnine, Warren Oates, LQ Jones, Strother Martin. Ben Johnson is kind of just one of the guys in this movie but for some reason he stood out to me.\n\nEdmond O'Brien I'd never seen in a movie before, he plays Sykes this... decrepit old bastard in Pike's gang. Think of Walter Huston in Treasure of the Sierra Madre but without ANY of his charm. The guy's a monster! He's such a freaky, scary looking guy looking like he's never bathed in his life, his black teeth and his constant cackling. He'd be right at home in Deadwood.\n\nBut I think my favorite guy in this movie was Robert Ryan who plays Deke, Pike's former partner who went to prison and is now released as part of a deal where if he kills Pike he's a free man and if he doesn't he's back at Yuma Prison. Just that alone is enough for an entire movie.\n\nNow I got an issue here....\n\nI did know this movie was about the end of an era for the Wild West, similar to Butch Cassidy and the Sundance Kid where it's about how NOW you rob a bank and they send a squad of killers after you, the kinda sorta beginnings of the FBI in a way rather than say just the sheriff or a posse of locals. So I was THINKING this would be about a team of lawmen going after a team of outlaws, both as skilled as the other. And... Deke's guys are kind of a joke aside from him, very inept and almost comic relief. I really would have preferred it like in Outlaw Josey Wales where it's a proper team of mercenaries coming after our \"hero\" rather than Deke's guys who are an inch from slipping on banana peels for laughs.\n\nBut Robert Ryan was excellent in this movie playing this guy who doesn't WANT to kill a guy who was probably his best friend but he doesn't wanna go back to jail either. He also gets this GORGEOUS moment right at the end where you can see it all playing on his face the realization that seeing the corpses of his former gang he's standing at the edge of the Wild West and he's sort of heartbroken about it. The final shootout is nice but THAT'S a perfect ending for this movie.\n\nAbout that shootout....\n\nThere's actually a lot of action in this movie. We open with this insanely violent bank robbery shootout.... the law VS the outlaws right at the start of the movie....\n\nGood place to mention one movie that came to mind over and over again watching this was Heat. No QUESTION Michael Mann was inspired by The Wild Bunch when he thought of the idea of a movie following bank robbers and the men who chase them.\n\nBut anyway the opening shootout my jaw hit the floor with how many civilians got caught in the crossfire. REALLY letting you know up front this is not gonna be a classic golden age style Western. A guy says it \"They're really blowing the hell out of this town!\"\n\nAnd then the finale.... Pike's guys have a friend who's been made a prisoner of the Mexican army and... they don't wanna leave without him. So there's this great moment where Pike just looks at his guys and says \"Let's go.\" and Warren Oates says \"Why not?\" and they all know what the score is. Like Mike said in Breaking Bad \"Either all of us are going home or none of us are.\"\n\nSo they load up their guns and march towards certain death, it's a PERFECT Western moment. It's also nice to see it be a group of friends going out like that, it tends to be the one man facing the odds, this is more the Rio Bravo style.\n\nAnd then after the Mexican general kills their guy... they blow his ass away and there's this silence where nobody makes a move. Borgnine just laughs cuz he knows what's coming, Pike smiles and away we go.\n\nJust non-stop blasting, it's like Black Hawk Down only it's a Western. And it's 1913 so the Mexican army has this fully automatic machine gun and when Pike's guys get their turn with that it's like nothing I've seen before. Just dozens of guys getting blown to bits, that classic machine gun ricochet sound effect which makes it even more epic. Bloody chaos for a good 4 minutes until everybody's dead. It's SO dark!!! Borgnine uses a woman as a human shield, Pike blows a woman away like I said and then gets shot by like a 10 year old kid, it's insane!\n\nJust about every epic shootout made after 1969 owes a debt to that scene and especially any shootout Tarantino's done. I was expecting it to be all slow-mo but no, it's 100 miles and hour, I couldn't believe it.\n\nThe Wild Bunch is one hell of a movie, managing to be this poetic story of the end of the outlaws but also this badass epic Western action movie. With an array of great performances especially from William Holden and Robert Ryan. And violence that's tough to forget.\n\nOne of the best movies I've seen all year.",
            "review_date": "2019-09-23",
            "source": "rt"
        },
        {
            "content": "This was really good.  I'm not the hugest fan of westerns but I do watch them occasionally.  First off it's important to note that this film was very controversial and still gets ranked in Top 10 lists of movies that are hard to sit through (which I don't think it deserves anymore, even though I respect them for really pushing the boundaries back in '69).  I'm assuming what makes it hard to watch for others is the kill count and the actions of the gang members.  But these things are no longer shocking anymore, hence the movie has lost a bit of its edge.  But it's still a really good western with really good acting and a fine story/plot.  It's exciting and it's part thriller too.  Their portrayals of Mexicans wasn't very nice (corrupt army men and women were prostitutes) but may be that's how it really was back then (film takes place in 1913).  Overall if you're a fan of either western or classics, then this is must watch cinema.  If you're not a fan of either, then the last appealing thing is the kill count so if you're a fan of that, this should do the trick.",
            "review_date": "2019-03-09",
            "source": "rt"
        },
        {
            "content": "Great represenitive of bloody movies ",
            "review_date": "2019-02-21",
            "source": "rt"
        },
        {
            "content": "John Wayne may have thought that this flick ruined the western genre, but this still remains a genre classic, and a bit of a different one too. Director Sam Peckinpah, who would deliver the thrilling Straw Dogs two years later (1971), brings us a beautifuly shot and superbly acted piece of reflection on the dying Wild West and the change in civilization. As well as some of the worst and most corrupt sides of mankind. Sometimes the film can get long, but it's made up for with impressively stylish slow-motion sequences, and for the time, the flick is quite bloody. Overall, this is a great western and one to see. Recommended!!",
            "review_date": "2019-02-21",
            "source": "rt"
        },
        {
            "content": "Yes, great. Holden’s best role. The beautiful cinematic moments are far more plentiful than the violent ones. The violence is nothing you don’t see in any prime time TV though. Peckinpah later admitted he was wrong. Showing this kind of violence did indeed de-sensitize us as viewers, not appall us. Overall a negative thing. And as always in Peckinpah, some scenes play like stupid cartoons (the whole opening for instance, and jail scene). Why is everyone outside the gang (aside from Robert Ryan) a Bubba or religious fool? Couldn’t there be any humanity and dimension to those who are not killers? Still, Holden does say ‘we have to start thinking beyond our guns’....though the rest of the film goes to great lengths to make that thought pointless, and that is NOT what the audience comes away with. Without the adolescent obsession with bloodshed, and a point of view that doesn’t idealize the Gang, this would rise to 5 stars for me.",
            "review_date": "2019-01-31",
            "source": "rt"
        },
        {
            "content": "The mother of modern day violent films, well made and full of character",
            "review_date": "2018-12-22",
            "source": "rt"
        },
        {
            "content": "This a film that took advantage of the \"New Hollyhood\" and produced one of the most influential, complex, and masterful action flicks ever made.",
            "review_date": "2018-12-02",
            "source": "rt"
        },
        {
            "content": "You only need to watch the ridiculously contrived and formulaic opening shootout scene to get a sense of how dated this film is. I couldn't put up with more than half an hour of it, far too tedious.",
            "review_date": "2018-12-01",
            "source": "rt"
        },
        {
            "content": "Action galore with a decent story to back up the action.",
            "review_date": "2018-09-05",
            "source": "rt"
        },
        {
            "content": "Sam Peckinpah's brilliant revisionist western is as genuine cinematic masterpiece. William Holden leads a gang of aging outlaws in the waining days of the old west before it became civilized. After a failed bank robbery that ended up an ambush by railroad-hired bounty hunters, the bunch are chased down into Mexico where they strike a deal with a corrupt general to steal guns for him to fight Villa. The story may not sound all that great, but Peckinpah and co-writer Walon Green fill the film with rich characterizations, stunning visuals, and a surprising amount of melancholy for a film that's otherwise dominated by a tidal wave of male machismo (which borders on misogyny). It's intimidating to write about a film that's already been dissected by an endless number of film scholars, so responding more on a personal level to the film, the themes around the bunch being men-out-of-time is the one that most grabbed me. Holden as Pike Bishop (a great character name!) is smarter, tougher, and in general more worthy than the soft citified civilians around him. Ernest Borgnine as Dutch Engstrom, I believe represents the conscience of the bunch. He's the one who at different times refocuses the group when they begin squabbling, and gets the group to do the right thing. Most of the arguments seem to happen between Pike and the Gorch brothers, played legendary actors Warren Oates and Ben Johnson. Jaime Sánchez rounds out the group as Angel, a Mexican who's heavily conflicted about stealing guns for a general oppressing his own people. There's also Edmond O'Brien as Old Man Sykes, who now just watches the horses and still gets a share because he used to run with the gang. He's the character who the rest of the aging bunch will likely become, except that there's no new gangs for these old timers to to watch their horses. North of the border, the world is now filled with motor cars, railroad barons, and Temperance Unions wanting to \"civilize\" the west. When the debauched General Mapache (SPOILER ALERT!) finds out that Angel took a case of the stolen guns to give to Villa's freedom fighters, the bunch reluctantly hands Angel over to the general. It's this crisis of conscience for the group when they wordlessly reflect, staring at one another, hungover in a brothel, and Pike says, \"Let's go\" the gang knows exactly what they need to do. The moment recalls an early scene in the film when Pike lectures the group, \"We're gonna stick together, just like it used to be! When you side with a man, you stay with him! And if you can't do that, you're like some animal, you're finished! We're finished! All of us!\" Borgnine, as the conscience of the group is not in the brothel but sitting outside whittling, immediately joins the others as they walk to their horses to retrieve their guns and proceed on their long walk to confront the general to get Angel back. That walk of the four, Holden, Oats, Johnson, and Borgnine, is an iconic piece of film history that has been endlessly imitated, from obvious allusions such as the Gunfight at the OK Coral scene in \"Tombstone\" to the less obvious scenes like Jan-Michael Vincent and his crew going out to catch one last wave together in John Milius' surfing classic \"The Big Wednesday\" or even in the Kathryn Bigelow's cult vampire film \"Near Dark.\" This scene culminates in an earlier foreshadowed scene during the opening credits when a group of children are shown giggling and gleefully watching scorpions fighting off a swarm of much smaller but innumerable number of ants. The obvious connection is the these stronger, better men are being crushed and run off by the overwhelming number of weaker, dishonest, \"civilized\" folk changing the face of the frontier. These themes of men who've lived past their time is one that has always fascinated me, no matter the time period. Peckinpah explored slimier themes in his excellent film \"Ride the High Country,\" but he take these notions to a next level of filmmaking with his masterful direction, which was hugely influential on modern day action cinema. Without Sam Peckinpah, there never would have been a John Woo or a Quentin Tarantino. With the exception of Akira Kurosawa, violence in cinema was never as artful or presented as a of beauty. The action sequences in the film were often described as bullet ballets, which is a perfect description of the opening and closing gunfights in the film. The interesting balance of the film's depiction of violence is that while it's at once brutally violent (the film was giving an NC-17 rating for it's 1993 re-release), Peckinpah's shoots the scene in such as way, particularly his use of slow motion and cross cutting between action, which was something virtually unseen in cinema outside of Kurosawa, and Peckinpah arguably brings it to the next level with \"The Wild Bunch.\" I haven't even mentioned Robert Ryan's character, who used to run with the bunch, but who's been forced to lead the group of railroad bounty hunters to kill his old friends. He's a scorpion laid low, now forced to side with the unworthy ants. Ryan's character lashes out his worthless rabble (primarily embodies in wonderfully scuzzy performances by L.Q. Jones and Strother Martin) saying, \"They know what this is all about - and what do I have? Nothin' but you egg-suckin', chicken stealing gutter trash with not even sixty rounds between you. We're after men - and I wish to God I was with them. The next time you make a mistake, I'm going to ride off and let you die.\" His character is rather heartbreaking, especially at the end of the film when he finds his former compatriots all dead and decides to ride off with O'Brien, the only surviving member of the bunch, who tells Ryan he's going to fight with the Mexican rebels, saying \"Well, me and the boys got some work to do. You want to come with us? It ain't like it used to be, but it'll do.\"  Peckinpah sees these men as Titans amongst mere mortals. They represent the stronger, loyal, better part of mankind that's being eaten away at by a greedy, petty, and unworthy onslaught of \"civilized\" folk. Whether you agree with those sentiments is one thing, but when it comes to storytelling, it's one that I've always found highly compelling. I also haven't even mentioned the gorgeous photography by Lucien Ballard and the hauntingly melancholy score by Jerry Fielding, in what is likely best composition of his career. There's also memorable supporting performances by Bo Hopkins, Dub Taylor, and Alfonso Arau. Overall, \"The Wild Bunch\" is a film that both on a straight entertainment level (it's one of my desert island films) and on an intellectual level, which is why the \"The Wild Bunch\" stands as one of the great masterpieces of cinema.",
            "review_date": "2018-08-19",
            "source": "rt"
        },
        {
            "content": "The impact of the \"The Wild Bunch\" on Quentin Tarantino is undeniable. Following the bad guys around attempting to operate as a team, the violence, the inevitable demise of the main characters are all traits that seem modernized in \"Reservoir Dogs.\" Labeled an unnecessary violent film in its day, \"The Wild Bunch\" isn't a terribly strong story that you think about days and months later, but what is inspiring about the film is its cinematic beauty. The orchestration of the major battle scenes are perfectly edited, appropriately slowed in places, choreographed to maximize the realism and, yes, very bloody for its time. It was a daring film and an undeniable classic.",
            "review_date": "2018-06-18",
            "source": "rt"
        },
        {
            "content": "An aging band of outlaws plan one last heist to rob a train to weaponry for a Mexican general, but are hunted by mercenaries led by a former member at the behest of railroad company. It's a simple plot, but with the cast at hand and the legendary king of violence, Sam Peckinpah, at the helm, it becomes an extraordinary work not just for pioneering film techniques or setting a new precedent for onscreen violence, but also in its portrayal of its characters, its dying era, older generations being left behind in the march of progress, and also its commentary on the true nature of violence. It's not pretty, it's characters are evil people, and it sought to portray the Old West in a most non-glamorous way. It's a film that is gritty, violent, and always compelling. Whether it be brilliant set pieces or even just small moments of character interaction, it feels very alive and takes you on an incredible experience that has not aged a day since its release in 1969. It has definitely cemented itself as not only one of the greatest westerns ever made, but one of the landmark films of the 20th century. Yes, it is just as legendary and amazing as you've heard. If you love films, this is one that is a definite must-see.",
            "review_date": "2018-06-02",
            "source": "rt"
        },
        {
            "content": "The Wild Bunch may have been groundbreaking in its time, but this movie didn't work for me. These anti-heroes are completely lacking in likeability and personality, so it's hard to really care about their plight. The pacing of the movie is too slow, the action sequences are sloppy and the violence is gratuitous. I can see why others may appreciate this film, but I'm not a fan.",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "Easily one of the greatest American westerns. It's hard-hitting, gritty and full of characters you love to hate. Peckinpah really had a way with hard-nosed fellas. The violent, bloody conclusion packs quite a punch.",
            "review_date": "2018-04-02",
            "source": "rt"
        },
        {
            "content": "Sorry to say that despite I know that this movie is a major one in the history of cinema, I find it rather dull. Sorry...",
            "review_date": "2018-02-28",
            "source": "rt"
        },
        {
            "content": "A Western that's a wee bit long in the running time, but it's still decent. Probably would have rated this higher if a half hour was shaved off. The climatic shootout was something that probably inspired Quentin Tarantino, so that was pretty awesome. Not sure if there was laughing gas on the set, because there was a lot of awkward lengthy laughs for no real reason at all. Strange.",
            "review_date": "2018-01-22",
            "source": "rt"
        },
        {
            "content": "Véritable légende du western, La Horde Sauvage a pris des rides en 49 ans, mais cela ne le rend pas désagréable pour autant. Mélange entre modernité et tradition, ce western de Sam Peckinpah est un film visuellement splendide, avec des personnages très bien écrits, loin du manichéisme auquel on aurait pu craindre et interprétés par d'excellents acteurs, Ernest Borgnine en tête. Avec trois setpieces plus ou moins efficaces (l'attaque du train est un peu lente) placées au début, au milieu et à la fin du film, la structure du film est simple, mais elle marche. Replacé dans son époque, le déluge de violence est intéressant, mais fait partie de ce qui a assez mal vieilli. Il n'en demeure pas moins que La Horde Sauvage est un film remarquable, qui tient encore la route en 2018.",
            "review_date": "2018-01-20",
            "source": "rt"
        },
        {
            "content": "Great production, but a weak story and characters fail to involve. One would imagine \"the wild bunch\" would be a clear cut group of characters, each outstanding in their own way. Instead, we only get Holden and Borgnine as the stars of the bunch, and not very interesting ones at that, due to the thin script. The other characters only play supporting roles grounded in laughing, shouting, and being nasty. \"Angel\" plays a more prominent role, actually showing the most depth of all the characters in the film, yet he never feels like a part of the group, more like a reluctant tag-along. They should have kept Bo Hopkins' character alive, he was more interesting in the brief screen time he had than most of the characters in the whole movie. El Generalisimo was another shallow character, but damn did he look and act the part. \n\nThey could have delved deeper into the relationship between Pike and Deke, but we just get a quick flashback and that's it. Same goes for Angel's love interest who leaves everything for El General, only to be killed (you almost can't tell she dies in the scene) immediately afterward. Wasted opportunities.\n\nI really wanted to like this movie, but I can't bring myself to give it a higher rating, dozens of slow-motion graphic deaths notwithstanding. I loved the intro credits though. \"If they move...kill em\".",
            "review_date": "2017-12-28",
            "source": "rt"
        },
        {
            "content": "Classic and brilliant. The violence is now less than what you would see on any prime time TV show. My only criticism is that it suffers from Peckinpahs usual teenage humor and cheesy TV size moments and production in most interior scenes. But all the rest makes up for it. William Holden and Robert Ryan are particularly great. I wonder how, with such classic Hollywood actors involved, the marketing machine was not able to sell this more. And some of the same critics who lavished praise on the far more violent Bonnie and Clyde (truly glamorizing the nut jobs and making violence fun) were so against this film. Peckinpah must have really been a difficult ass. But a great film maker.",
            "review_date": "2017-11-14",
            "source": "rt"
        },
        {
            "content": "Though there isn't a single character you can root for and the film is a little excessive in length this is one of most action packed and visually stunning Westerns from the genre. A solid cast, good score, great landscapes and a relatively simple but nonetheless riveting plot are surrounded by some of the most indulgent violence I have ever seen in a classic Western. Blood, gore and violent deaths litter the screen in a way never seen before in an action film at the time and though it is indulgent it is mesmerising to watch and truly thrilling.",
            "review_date": "2017-03-09",
            "source": "rt"
        },
        {
            "content": "It's poetic that The Wild Bunch is about the greatest band of outlaws living in the final days of the old west as it's also one of the best and last in a disappearing genre.",
            "review_date": "2017-02-23",
            "source": "rt"
        },
        {
            "content": "4.5/5-What can I say, its everything you want a western to be.  Lots of action and violence, gruff and tough characters, a tremendous and deeply layered plot filled with heists, gun fights, drinking, sex, revenge, chases, explosions, anything you could want.  There's also plenty of humor and outrageous lines...things you never see anymore.  Its all shot so beautifully and uniquely...everything just ties together perfectly and ends satisfyingly. Its probably not for everyone because it is gratuitously violent, but if you want a real western, this is it.",
            "review_date": "2016-10-15",
            "source": "rt"
        },
        {
            "content": "Sam Peckinpah's swansong to loss of youth and the destruction of a way of life is second to none.  From the botched bank raid to the final shootout his wistful essay on \"progress\" and how it snuffs out the twinkle in life's eye may never be matched.  \nWhisky, women and adrenaline - the good times rolled until they rolled out of town and out of time.  \nThese are themes which reappear in his work frequently, starting with The Ballad Of Cable Hogue and climaxing with The Wild Bunch, a final howl against the dying of the light. Watch this when young for the action and the beauty of slow motion death; watch it again three decades later for the full impact.",
            "review_date": "2016-08-29",
            "source": "rt"
        },
        {
            "content": "Maybe 3.25. Great action scenes",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "Another 'classic' I just don't get...",
            "review_date": "2016-06-10",
            "source": "rt"
        },
        {
            "content": "At almost 2.5 hours, this western movie is far too long, and, as a result, the pace is very slow. It is particularly graphic for its time, especially in the early scenes. Overall the movie failed to keep my attention. Considered one of the best movies of all time and one of the top Western movies of all time. 1001",
            "review_date": "2016-06-08",
            "source": "rt"
        },
        {
            "content": "A peckinpah punch that I consider its own genre. Certainly not uplifting, but plenty of slow motion shoots for dramatic effect. 1001 movies to see before you die.",
            "review_date": "2016-05-22",
            "source": "rt"
        },
        {
            "content": "The Wild Bunch is a lofty triumph in pushing the envelope for violence in westerns while spurring the \"heroic\" stereotypes of the genre.",
            "review_date": "2016-04-18",
            "source": "rt"
        },
        {
            "content": "One of the last great Westerns.",
            "review_date": "2016-03-31",
            "source": "rt"
        },
        {
            "content": "The Wild Bunch admittedly looks good with great cinematography, solid acting and directing and it has some very interesting scenes, but it is still such a disappointing movie due to a boring plot, overblown running time and forgettable and rather dull characters. It is such an overrated film.",
            "review_date": "2016-02-17",
            "source": "rt"
        },
        {
            "content": "A really well filmed & scored Western, even if it takes a while for you to learn the six main characters' (i.e. the \"Wild Bunch\") motivations. Quite violent, with a little humour in parts, and some great stunts. However, a sad ending and it's 30min extra length keep it from being exceptional.",
            "review_date": "2016-02-14",
            "source": "rt"
        },
        {
            "content": "Irritating and reprehensible in equal measure. This has to be one of the most over rated westerns of all time. What little story there is takes nearly two and a half hours to be told. Peckinpah has a penchant for nastiness and there appears to be much cruelty to animals. The opening shootout promises much, but unfortunately that is the highlight. The editing helps in the big shoot out scenes and Jerry Fielding's Oscar nominated score has its moments. Overall though one has to agree with John Wayne's apparent view on it. He hated it!",
            "review_date": "2016-02-04",
            "source": "rt"
        },
        {
            "content": "77%\nSaw this on 17/12/15\nAn above average Western which is extremely similar to Butch Cassidy and the Sundance Kid but inferior to the same in all ways. The film is ultimately saved by it's liberal dose of violence as well as extensively innovative cinematographic techniques effectively used by Director Sam Peckinpah. The films band of bad ass characters all around are funny to watch, but the film fails due to poor character development, at times illogical situations, for example the finale, although beautifully shot is illogical as from what is shown it's impossible for the Wild Bunch to do such a sacrifice for one of them when all they have in mind is money and themselves. Additionally the film lacks powerful actors like Paul Newman or Robert Redford which makes it slight letdown.",
            "review_date": "2015-12-17",
            "source": "rt"
        },
        {
            "content": "An aging band of outlaws are trying to rob a train full of American rifles for a Mexican general, meanwhile being tracked by a reminiscent former member, reluctantly hired by a vindictive train baron. Although the characters are rich in moral ambiguity (grey hats aplenty), I found the story dragged too long. I guess I prefer my sixties westerns to have some spaghetti in em. Sorry, Sam.",
            "review_date": "2015-11-24",
            "source": "rt"
        },
        {
            "content": "A seminal western film that has been copied so many times it seems cliché until one considers it was released in 1969.  This is Sam Peckinpah's magnum opus in my opinion.  We get a sense early on that the characters are running out of time and purpose.  They are beautiful anachronisms that choose to live and die by a code that the modern world has left behind.  In the end, Pike (William Holden) steps out of a brothel disgusted with the world around him and his place in it.  His men are waiting for him in the street and with a single look they are compacted to rescue Angel from the General and his peasants' army.  What follows is one of the most epic shootouts in cinema.  It is a Pyrrhic victory that  should not be missed.",
            "review_date": "2015-10-25",
            "source": "rt"
        },
        {
            "content": "I'm a Peckinpah fan, I'm almost a fan of this film as well...it's just so bloated though.  There's some decent characters, there's some good humour, there's that amazing set piece conclusion that still stands up today...just lose 30-40mins.  It's just a fun western as well at the end of the day, I still scratch my head a little at all the 'best of' lists it finds it's way into.",
            "review_date": "2015-10-23",
            "source": "rt"
        },
        {
            "content": "My favourite movie of all time. Absolute perfection.",
            "review_date": "2015-10-20",
            "source": "rt"
        },
        {
            "content": "Amazing classic western.",
            "review_date": "2015-10-13",
            "source": "rt"
        },
        {
            "content": "A gritty edgy Western that has been labelled the last of the old great westerns that had all the elements of a great classic.\n\nGreat actors, simple story & fantastic action that doesn't hold back the splatter of blood. Genuinely interesting story that grows on you as the backstory of the wild bunch gives much more clarity.\n\nIt's an essential western that I would sum up as a knockout film. It's got a lot to offer & if you appreciate the Western Genre then this is a must see. Terrific Film!!!",
            "review_date": "2015-10-01",
            "source": "rt"
        },
        {
            "content": "The tone begins with children pitting scorpions against ants before burning the lot- this is a violent and nihilistic film in which the bounty hunters following the outlaws are almost as bad, the only loyalty is thieves loyalty.  Like Bring Me The Head of Alfred Garcia much of the film is set in Mexico.  There is a grimy uneasy feeling throughout and I at least didn't expect the ending.  The role of women in this film is troubling-whores, shields and abused lovers, there certainly seemed to be a vicious misogynist streak in Peckinpah's work by this time.  Misanthropic but strangely compelling classic Western.",
            "review_date": "2015-09-24",
            "source": "rt"
        },
        {
            "content": "Peckinpah made one of the greatest westerns ever, with a cast that has yet to be improved on. He doesn't just pour new wine into that bottle. He explodes the damn thing!",
            "review_date": "2015-08-25",
            "source": "rt"
        },
        {
            "content": "Saw it again after decades.  It did not stand the test of time.",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "Another transitional film as the old west outlaws fight against the changing America by robbing a train to give supplies to Mexicans.",
            "review_date": "2015-07-14",
            "source": "rt"
        },
        {
            "content": "Kickass western classic! Such intense and powerful film making!",
            "review_date": "2015-05-02",
            "source": "rt"
        },
        {
            "content": "One of the all-time classic Westerns.  I had seen it before, but didn't remember it at all so it was nice to revisit it, especially on blu-ray.  The movie looks great, has a killer cast and is extremely violent.  I can definitely see its influences on Tarantino and John Woo.  This one's a must for all film fans!",
            "review_date": "2015-04-12",
            "source": "rt"
        },
        {
            "content": "This  is among the 20 best westerns, all-time.",
            "review_date": "2015-03-19",
            "source": "rt"
        },
        {
            "content": "Ever wonder what a film would be like if it was about the bad guys? Brotherhood.",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "The action makes up for any slow moments. The acting and dialog is very well-done as well.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "Great from beginning to end (and what an ending!).",
            "review_date": "2015-01-27",
            "source": "rt"
        },
        {
            "content": "El ultimo gran western de la epoca dorada de Hollywood , pero que western , una mirada moderna y diferente , rompiendo con los estereotipos como acostumbra Sam Peckinpah.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "I am not sure what all the hype is about regarding this movie, perhaps it was a ground breaker for 1969 but watching it today for the first time there did not seem to be much special about it.  It does not compare to any Clint Eastwood westerns in my opinion.",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "-IGNORE THIS RATING\n4/4\nLandmark Western detailing the \"end\" of the west. Aging outlaws plan to pull off one final hail. One of the greatest American films brought extremely controversial bloodletting-a benchmark for others to follow. Acting, superb, photography, (Lucien Ballard) unforgettable, score, (Jerry Fielding) stimulating, editing, unmatched, and the shootouts (particularly the climax) pack a wallop!",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "***Due to the recent RT changes that have basically ruined my past reviews, I am mostly only giving a rating rather than a full review.***",
            "review_date": "2014-12-04",
            "source": "rt"
        },
        {
            "content": "Couldnt connect to this film and overall crude attitude. It was long, misogynistic, corny, excessively violent, boring, and confusing. The difference btw the so called \"outlaw good guys\" aka the wild bunch and the rest of the vile characters portrayed was slim. The movie had many characters all of who you barely got to know and had many names and nicknames to memorize ugh. The most overrated and dumb Western, just because the cinematography and details are beautiful its still a piece of trash wrapped with a bowtie.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "An American Western that can compete with Leone. The finale was the most gratuitously bloody scene ever until Kill Bill, Vol. 1, came along.",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "Great Western. Great cast... Well done....",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "The impact of the \"The Wild Bunch\" on Quentin Tarantino is undeniable.  Following the bad guys around attempting to operate as a team, the violence, the inevitable demise of the main characters are all traits that seem modernized in \"Reservoir Dogs.\"  Labeled an unnecessary violent film in its day, \"The Wild Bunch\" isn't a terribly strong story that you think about days and months later, but what is inspiring about the film is its cinematic beauty.  The orchestration of the major battle scenes are perfectly edited, appropriately slowed in places, choreographed to maximize the realism and, yes, very bloody for its time.  It was a daring film and an undeniable classic.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "A film without good men, that begins and ends with probably the bloody scenes in the western genre. Anonymous people is killed one after another, you can´t support any of the bands in conflict. A masterpiece about (or against?) of violence itself.",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "Gritty, but dull. I definitely lost interest after awhile. I think it's extremely overrated. I can't say I'm really a fan of the genre, but I've seen much better Westerns. (First and only viewing - 10/22/2014)",
            "review_date": "2014-09-15",
            "source": "rt"
        },
        {
            "content": "one of the top five films ever made.",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "It was violent for its time, but although tame by today's standards, it is still one of the greatest westerns of all time.",
            "review_date": "2014-06-28",
            "source": "rt"
        },
        {
            "content": "At the release this was a very violent western. Not so violent now a days but great film making.",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "A Western, a masterpiece, and a nostalgic, reverent look at the passing of a way of life. William Holden at his best.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "Raw, intense, visceral and gritty are just some of the few words that describe Sam Peckinpah's The Wild Bunch, which ranks among the finest Westerns ever made. The film features an all star cast of talented actors who light up the screen in the classic film. Every actor brings something terrific to the screen that elevates the plot significantly. Under Peckinpah's kinetic direction, The Wild Bunch is an action packed Western that is one of the finest in the genre. Peckinpah, like Sergio Leone before him, helped shape the Western film in a way that was both brutal, yet beautiful. Peckinpah had a flair for crafting pictures that really raised the bar in the way violence was presented, and in doing so, he broke new ground in what you could do in the cinematic medium. Set near the end of the Old West, when the country is being modernized in first years of the 20th Century, the film follows a group of aging outlaws out for one last score.  The story is simple, but it works to the film's advantage because it doesn't overcomplicate things, the film uses the performances to elevate the films story. The result is impressive and in turn The Wild Bunch is a superb and accomplished picture that ranks among the finest Westerns ever made. With a great cast at his disposal, Sam Peckinpah does what he does best, and that's to make a riveting, violent and highly thrilling picture that has all of the director's trademarks that has made his work standout. In terms of sheer entertainment, The Wild Bunch succeeds on every level, with memorable performances, tense, well executed action; this is a blistering Western that is ranks among the finest of the genre. Sam Peckinpah knew how to get the most out of a simple concept, and that's exactly the case with this movie. Highly engaging from start to finish, this is a thrilling picture that delivers on all fronts, and it's a movie made with that raised the bar of what you could do in the genre.",
            "review_date": "2014-06-07",
            "source": "rt"
        },
        {
            "content": "top ten best westerns",
            "review_date": "2014-05-26",
            "source": "rt"
        },
        {
            "content": "The Wild Bunch is entertaining for most of the film but could've been a lot better",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "Beginning & Ending With Two Of The Bloodiest Battles In Cinema History, Director Sam Peckinpah Has Created An Excellent Western, Which Breaks All The Cliche's & Ruthlessly Destroys The Myths Of The West. The Film Follows A Group Of Ex-Military, Now Turned Outlaws, As They Head For Mexico After A Failed Payroll Robbery. The Film Stars William Holden, Ernest Borgnine, Warren Oates & Robert Ryan. The Cast Give Excellent Performances From It's Great Script, The Cinematography Is Beautiful & The Directorial Skills Of Peckinpah Are On Top Form. This Is A Great Film Which Showcases The Dying Days Of The West, In The Italian Style, & Has Situated Itself Quite Comfortably As One Of The Greatest Westerns Ever Made.",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "When The Wild Bunch was first released, it was a very controversial film due to the amount of violence it contained. However, it is now hailed as one of the greatest westerns of all time. Sam Peckinpah was the Quentin Tarantino of the 60's, and this was his Pulp Fiction. The story of a bunch of old outlaws may seem like it wouldn't be interesting, or even violent, but Peckinpah managed to create a truly great film. I could go on all day about all the great things with this film, but I will just say this. The opening and closing shootouts are the best I have ever seen, so even if you don't care about the acting, directing, or how great the script is, you should watch it just for those shootouts.",
            "review_date": "2014-04-15",
            "source": "rt"
        },
        {
            "content": "Not just one of the best westerns, but one of the best films period.",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "A straight-up bloodbath that pushed the boundaries of on-screen violence upon release and had to be cut down from getting an X rating! The violence isn't as extreme today as it was back then, but the amount of bullets fired and the on-screen body count is beyond insane. The cast is diverse and perfect for a western with William Holden's cold-as-ice, Pike leading the pack of outlaws. It's a very simple story, but Peckinpah's execution of a fantastic train robbery and the two gun battles that book-end the film transcend it's simplicity.",
            "review_date": "2014-03-19",
            "source": "rt"
        },
        {
            "content": "One of the best westerns out there that proves from scene to scene how a great script should be crafted.",
            "review_date": "2014-02-24",
            "source": "rt"
        },
        {
            "content": "A raw classic.  The Sam Peckinpah masterpiece that effectively changed the way westerns, and action movies, were made.  Set the trend for graphic (but necessary for the plot) violence and gritty, edgy storylines.  \n\nAlso one of the first movies to blur the lines between good guys and bad guys - which was which?  Were there any good guys?\n\nYou can see the influence of this movie in much of the work of many modern-day directors, especially Martin Scorsese and Quentin Tarantino.\n\nGreat direction by Sam Peckinpah.  The opening and closing action scenes are among the greatest action sequences in cinematic history.\n\nGood performance by William Holden plus decent support from a host of actors.\n\nNot perfect though.  Plot is not entirely watertight.  Some scenes seem unnecessary and the movie loses focus from time to time.  \n\nProduction values are a bit lacking at times, making the movie feel rough  around the edges.  Some of this helps, giving the movie a gritty, unpolished feel.  However, some degree of polish is required, I feel.\n\nStill, every bit the classic.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "Solid western/action film that's become somewhat of a classic.  Definitely worth checking out.",
            "review_date": "2014-01-18",
            "source": "rt"
        },
        {
            "content": "A western about friendship as innovative as exciting with a direction out of the ordinary.",
            "review_date": "2013-12-02",
            "source": "rt"
        },
        {
            "content": "Probably the best Western not directed by John Ford.",
            "review_date": "2013-11-21",
            "source": "rt"
        },
        {
            "content": "I thought this one was good, but not great. Just didn't do a whole lot for me. Holden was great. The five minutes of laughing was weird.",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "Arguably Sam Peckinpah's most critically acclaimed Western, I had to see The Wild Bunch to be sure of if it was superior to his masterpiece Pat Garrett and Billy the Kid.\n\nAlthough I enjoyed The Wild Bunch, I felt that it did not equate to Pat Garrett and Billy the Kid. But it was still a very interesting film. It explored some of the themes that Sam Peckinoah had previously touched upon in Ride the High Country but to a much more complex extent this time around. More specifically, I mean the way that the film explores the concept of aging. One of the most predominantly popular Western themes is one at explores characters coming to terms with a changing society, and The Wild Bunch views that from the perspective of a gang of outlaws who must come to terms with their age and to the fact that 1913 is not a time that they are accustomed to yet. The story has a sense of camaraderie to it in the way that all of the characters band together, and it makes an interesting contrast to the way society is changing which renders everybody more inwardly driven and focused on looking out for numero uno. Certain scenes in The Wild Bunch depict the way that the older characters are more wise and sensible, taking the safer and less violent path most of the time as well as planning everything out with detail. In contrast to the aggressive impulsive nature of the younger figures, The Wild Bunch easily separates the two figures well and establishes who are the heroes and who are the criminals. Some of the themes in The Wild Bunch are really interesting, and despite the slow pace of the film which is traditional with western films and the fact that it is a lot more focused on the characters and the narrative than on the scale of the story, it still comes out as an entertaining effort on behalf of Sam Peckinpah. \nThe story in The Wild Bunch is great because it has an original premise which may be slightly familiar, but more importantly because it balances that with a complex array of characters for the film. The Wild Bunch features many great and well sketched characters who benefit from some strong dialogue. The Wild Bunch manages to easily walk the line between an exciting story of action and crime as well as an involving western tale of camaraderie and growing old thanks to the Academy Award nominated screenplay from Sam Peckinpah, Walon Green and Roy N. Sickner, and it matches the virtue of its depth with incredible technical characteristics.\nThe cinematography in The Wild Bunch is Academy Award calibre because it co,nines traditional western cinematography techniques with ones usually reserved for both spaghetti westerns and action films. This means that The Wild Bunch is able to capture a large scale, emphasize the emotional states of the characters through quick zooms and keep the movement of the film exciting. The cinematography in The Wild Bunch hits a high point when the action scenes roll around.\nThe action scenes in The Wild Bunch are arguably the eatery that Sam Peckinpah has ever created. Using revolutionary techniques such as intricate multi-angle quick-cut editing mixing slow motion with appropriately paced scenes, The Wild Bunch becomes an exciting western film which is a real rush. The style manages to come up and strike the viewers, and it breaks the standard cinematic conventions of western cinema. Thanks to a mix f a groundbreaking visual style and Sam Peckinpah's iconic fearlessness at integrating in blood and gore, the action scenes in The Wild Bunch stand out as being very exciting. The quick-cut multi-angle technique in The Wild Bunch is impressive because unlike the way that it is used in many action films today without being close to good, in The Wild Bunch the technique is at a breakthrough point where it is just becoming notable, and the way that Sam Peckinpah executes it is spot on. Instead of using excessively quick editing to focus on single action scenes, Sam Peckinpah makes use of the element to ensure that it captures the large scale of battle that is going on and every character that is involved, showing every flailing bullet and every death with sufficient screen time which works to keep things at a level of rush and excitement instead of waiting around to dramatize it.  The Wild Bunch features some incredible action scenes, some of the best that I've ever seen in a western film. It is really groundbreaking for the genre and one of Sam Peckinpah's best achievements as a filmmaker. The cinematography also skillfully captures the beautiful scenery of the film as well as its exceptional production design, props and costumes which all do their part to ensure that it ends up feeling like a really genuine and realistic film. It is further enhanced by an expertly at sophistic musical score which is subtle at times but consistently intense and has the same energetic spirit that the iconic score from The Magnificent Seven did. The music in The Wild Bunch is just spot on.\nAnd thanks to the skills of an easily talented cast, The Wild Bunch ends up a very involving film with one of the greatest endings of any film in western cinema history or even action cinema history.\nWilliam Holden provides the perfect level of nostalgia to the leading role of Pike Bishop. As well as maintaining a stature of strength and confidence, William Holden supplies a natural sense of wisdom to the part which makes him an easy lead. He stands his ground well with stoic charisma and the true strength of a cowboy, projecting the idea that he is really internalizing his lines well before delivering the, which reveals him putting a lot of thought and effort into the role. William Holden faces the role of William Pike easily and makes himself a compelling lead through a mix of dedications and projection or emotional subtlety, and so it is a memorable performance.\nErnest Borgnine was my favourite though. The instant he came on screen and showed off his trademark style, I instantly found him a compelling character. Ernest Borgnine had an easily natural ability at creating sympathetic characters, and he uses that talent in The Wild Bunch because his general presence is genial while his line delivery is charismatic and spirited. Ernest Borgnine grasps his weapon in The Wild Bunch with ease and confidence, and combining that with his likable persona, he easily renders himself a charming action hero. Ernest Borgnine aspires with full confidence in The Wild Bunch and makes himself an easily powerful figure for the story.\nWarren Oats, Ben Johnson and Jaime Sanchez all make strong members of the titular Wild Bunch as well, and the supporting performances of Robert Ryan and Edmond O'Brien are a nice touch as well.\n\nSo although the story doesn't fully grasp the scale of its ambition, The Wild Bunch is an exciting western classic with excellently stylish direction from Sam Peckinpah which creates some unforgettable action scenes as well as some string performances from the cast.",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "Seriously overrated.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "Great action and acting. The story confused me though. I didn't know what was going on for the entire movie.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "A very entertaining and superbly directed western.",
            "review_date": "2013-09-09",
            "source": "rt"
        }
    ]
}