{
    "title": "Down by Law",
    "rating": 0.0,
    "release_date": "1986-09-25",
    "num_reviews": 230,
    "genres": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "\"Yeah, it's a sad and beautiful world, pal.\"",
            "content": "Action/adventure fans won't have the patience for this film. There are long, extended scenes in which the principal characters wait each other out before speaking, and even then, they don't have much to say. The introduction of Roberto Benigni's character into the jail cell at the Orleans Parish Prison changes the dynamic of the story, but at first you don't know which way it will go. Zack (Tom Waits) and Jack (John Lurie) could just as easily have beat the hell out of Roberto in any other film, but here, they take to the idiosyncratic jailbird when they learn he's in for murder by eight-ball. Consistently referring to his pocket note pad for illuminating American phrases, Roberto is at his charming nuttiest leading his cellmate hoods in a rousing rendition of 'We all scream for ice cream'.I'm not big on stories that go nowhere but this one went nowhere in a decidedly unique and captivating way. The jail break by the unlikely trio is as improbable as the camaraderie that develops among them, which quite honestly is probably the reason the mechanics of it wasn't actually shown. You have to take it on faith that Roberto actually did find some weakness in the security of the prison yard in order for them to escape. Even more improbable is the romance that develops between Roberto and his new found love Nicoletta (Nicoletta Braschi), but then again, who can say? I was waiting any minute for Zack or Jack to take advantage of the young lady, but apparently their regard for Roberto was one of earned respect.I can't say this would be on my recommended list for most viewers, but if you can slow down and savor the plight of three disparate jailbirds looking for a break, this may appeal to your better instincts. And if I can relate the picture to another Benigni film for which he won a Best Actor Oscar, the story in it's own distinctive manner has a way of showing it's characters that \"Life is Beautiful\".",
            "review_date": "2018-07-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Pure Joy",
            "content": "The story of three different men (Tom Waits, John Lurie, and Roberto Benigni) in a Louisiana prison and their eventual journey.This film is a natural progression from \"Stranger Than Paradise\". Lurie returns as a lead, and the music of Screamin' Jay Hawkins is replaced with Tom Waits. If Hawkins and Waits know each other, I have no idea, but their music styles are not far removed.Although Waits is among my favorite actors (he excels at playing villains), the standout performance here is Benigni. How much English he knew at the time I am not sure, but he brings a comic mischief to the film, and is the most light-hearted despite being potentially the most dangerous.",
            "review_date": "2014-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No action, all mood – but it goes down like a cool beer on a hot summer evening",
            "content": "A cult classic - and yet still relatively little known. Jim Jarmusch is a master when it comes to creating atmosphere (and nobody uses stretches of silence to better comedic effect than he does). Shot in beautiful black and white, this tale of three prisoners who make for very unlikely companions is all mood, deadpan humour and practically no action.Don't expect a story - just enjoy the ride, the dialogues (consisting mainly of the word 'F***' - unless it's Benigni talking: his chaotic, broken English lines are another highlight of the film) and the fantastic soundtrack by John Lurie and Tom Waits. Perhaps the epitome of a cult movie, this one goes down like a cool beer on a hot summer evening (and as with all cult movies, it is best seen with an audience that already knows and loves the film). A minimalistic comedy masterpiece. 9 stars out of 10.Favorite Films: http://www.imdb.com/list/ls054200841/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/",
            "review_date": "2014-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent - quirkily funny and engaging",
            "content": "Three men escape from jail and head out into the Louisiana bayous. What follows is their journey and their attempts to evade the law. Written and directed by Jim Jarmusch, so you already know this is not going to be a conventional movie. Quirkily funny, with some great off-the-wall characters and good interplay between them. Plot is a bit random, though that's part of the movie's charm. The anarchy of the plot fits in well with the characters and general non-seriousness of the movie. Good work by Tom Waits, John Lurie and Roberto Benigni in the lead roles.",
            "review_date": "2018-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "All the elements that make a Jarmusch film come together to create a beautiful story",
            "content": "I've been binging Jarmusch's filmography this week for the first-time knowing little about his films and style of storytelling. In my opinion, this is his greatest achievement. The cinematography is beautiful; all of the river-boating scenes looked incredible. The performances are all great, especially Benigni's who had me in tears from laughter. The pacing is also solid; how these three very different men form a bond is a marvel to experience. On the whole, the story is a unique take on the 'prison film' and operates in that perfect balance of quirky and realistic. If you're like me and you're ripping through Jarmusch films for the first time, I'd say this is a pretty great introduction to the man and his mind.",
            "review_date": "2019-05-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "atmospheric without much tension",
            "content": "In New Orleans, Radio DJ Zack (Tom Waits) is berated by his girlfriend Laurette (Ellen Barkin) for losing his job. He gets $1000 to drive a car across town but the cops stop him and find a dead body in the trunk. Jack (John Lurie) is a pimp who is offered a new young white girl. Before he notices that she's underage, cops bust in and arrest him. They end up in the same cell and Roberto (Roberto Benigni) who speaks little English is brought in. He writes down phrases that strike him. He tells them that he's a card cheat who killed a man with the pool 8-ball. Then he leads them on a breakout.The camera lingers in slow moving long continuous scenes. The sparse settings give a surreal feel to it all. Everything has a dreamlike quality. It has an interesting atmosphere but it doesn't have much tension which is Jim Jarmusch's style.",
            "review_date": "2015-07-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really contemplative",
            "content": "This may very well be a mans' journey film, actually literally, but philosophically, it's still one that serves to be a reminder of all of the things in life and about how our choices eventually need to come to a head. The three lead actors are very naturalistic, except Benigni who seems to overdo it at times. The writing and the directing are typical Jarmusch, and we are able to experience just what he is feeling in every frame. So typical that audiences themselves will be wondering what is going on, and seeing as how it's plot less besides the obvious already in the summary, only Jarmusch fans who know what they're getting into will not be surprised by its narrative. If anything, it's one of his plottier films.",
            "review_date": "2015-05-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cult-Indie for the Fans, Boring Film for the Others",
            "content": "In Louisianan, the girlfriend Laurette (Ellen Barkin) of the WYLD DJ Zack (Tom Waits) a.k.a. Lee Baby Simms has an argument and breaks with him. The upset Zack drinks booze on the street and his acquaintance Preston (Vernel Bagneris) offers US$ 1,500.00 to him to drive a Jaguar to the other side of the city. However, there is a man locked up in the trunk of the car and Zack is arrested and sent to the Orleans Parish Prison. Meanwhile the pimp Jack (John Lurie) is framed by his acquaintance Gig (Rockets Redglare) and is arrested in the same cell of Zack. When the Italian Roberto (Roberto Benigni) a.k.a. Bob that does note speak English very well is locked up in the same cell, the trio develops a strange friendship. Sooner Bob proposes a means of escape from prison and the trio shares a journey through the swamps of Mississippi. \"Down by Law\" is a cult-indie for the fans and a boring film for the others. The cinematography in black and white is stylish, but why? The plot is quite original but uninteresting. Further I do not like the actor Roberto Benigni that used the idea of the screenplay of \"Train de Vie\" of Radu Mihaileanu that was offered to him to the lead role to write his awarded \"La Vita è Bella\". Therefore, I do not laugh of his gags and jokes. Maybe if I had seen this movie in 1986, I might have enjoyed more. My vote is six.Title (Brazil): \"Down by Law\"",
            "review_date": "2010-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jarmusch's character experiment around lawlessness, fortune and companionship",
            "content": "A prison film without an overt sense of morality? That comes as no surprise from Jim Jarmusch. One of the pioneers of independent filmmaking in the 1980s, Jarmusch cares little for plot or crafting a message for his audience and much more about drawing up scenarios for his characters that reveal nuances of the human condition.\"Down by Law\" features three men in New Orleans who are guilty of their crimes though wrongfully imprisoned. Zack (Tom Waits) is a radio DJ who — after being thrown out by his girlfriend — agrees to a shady odd job driving a car that sets him up to take a fall. Jack (John Lurie) is a local pimp who ends up the victim of a sting operation. Both men feel unfairly hit just for letting their guard down. In prison they meet Bob (Roberto Benigni), an optimistic and overly friendly Italian immigrant with a similar story. The three men connect within confinement, but that bond is tested in new ways after they escape.Aside from Zack and Jack's arrests, Jarmusch takes his laid back approach to most of the events in the film, choosing to show only the aftereffects of the major plot points that most filmmakers would want to depict on screen. He did the same thing in \"Stranger Than Paradise\" a couple years earlier, wanting to focus his film on how the characters respond to swings of fortune. The prison break, for example, is not explained. We only see the before followed by a cut to the three prisoners on the run.Zack, Jack and Bob make for an interesting trio, particularly Bob. Benigni brings impeccable spirit and joviality to break up the somewhat slogging animosity between carefree cool guy Zack (Waits is spot-on casting) and the self-righteous, sarcastic Jack (deployed similarly to the way he was in \"Stranger Than Paradise\"). Benigni is specifically responsible for a couple of the film's best moments, one an ice cream protest and the other involving a rabbit. His comedy brings a dimension and energy to this film that \"Paradise\" was missing, and it fits within Jarmusch's style and framework.\"Down by Law\" also feels more cinematic. Jarmusch includes more of the New Orleans setting and the Louisiana wilderness with dollying/trucking shots that help immerse his very intimate stories in something larger, in this case the lawlessness of NOLA and the swampland. Maybe Jarmusch doesn't have a neatly wrapped up moral to send us home with, his film clearly establishes a belief in an unpredictability to our world. And given the way his characters handle it, you can tell that he views humans as people who are eternally torn between self-interest and companionship.Jarmusch's early work shows great vision of how he wants to tell stories, with less emphasis on what those stories are trying to say. It's as though he's running experiments with his characters, and what plays out in his films are the results. Fans of art films and theatre will surely appreciate these early offerings, while those who prefer a director take them on a ride rather than present them an experiment to observe will have trouble connecting.~Steven CThanks for reading! Visit Movie Muse Reviews for more",
            "review_date": "2017-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent early Jarmusch",
            "content": "While his later and more acclaimed works such 'Night on Earth' and 'Dead Man' may well be better films, this is the one that catapulted Jim Jarmusch to the forefront of obscure American cinema in the 1980's, and aside from that fact; it's a hell of a lot of fun, and fans of Jarmusch, and just fans of obscure cool cinema in general will find lots to like about it. Treading a line between a classic prison movie and an odd comedy, Down by Law works on several levels. The premise of the film is simple, as we follow three rather different convicts that end up in the same cell in a penitentiary. Despite this being a simple base for a movie, Jim Jarmusch really makes the best of his premise and the three characters he has created to inhabit the jail cell are all unique enough to each other in order to make sure that the film is always interesting, and that the characters have a good chemistry with one another, so that the dialogue flows freely and that it's quirky nature is able to be revved up to the top.Tom Waits, John Lurie and Roberto Benigni take the lead three roles and although the former two actors are no doubt good in their roles, as usual it is Benigni that steals the show. His over the top style fits his over the top character like a glove and although Benigni isn't the sort of actor that can adapt to many different roles; when he's got one that fits him, he's pretty much unbeatable. The film's plot starts out slow, and the first half hour in which two of the three leads are introduced isn't all that exciting. It's when the three men get put inside that Down by Law really starts, and every minute from then on is a pleasure. Like he would with Dead Man nine years later, Jarmusch has opted to film Down by Law in a very stark black and white, which, also like Dead Man, increases the surrealism and also helps the film in it's bid to beat the thin plot line with a very potent visual complexity, which will delight fans of this sort of movie. On the whole, Down by Law is an excellent example of offbeat US film-making and I don't hesitate to recommend it to anyone.",
            "review_date": "2005-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant and awesome!",
            "content": "This is one of the best movies ever made. I cannot begin to emphasize how much heart is in it. It is really a story that transcends even realism and belongs to the realm of literature, music and art. One cannot claim to know anything about movies without having seen this one. It´s like Chaplin reading the classics of American literature. Nietzsche breathing the fresh desert air. Milton creeping into the left foot of Blake. Watch it! Watch it! Watch it!",
            "review_date": "2003-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ceaseless Boredom",
            "content": "I didn't quite die of boredom but I did drop off into a coma. I could not stay interested in this movie. The story, the dialog, time itself was slow. I can attest to the fact time slowed down as I was watching this movie. As the world moved on I was stuck in a semi-trance state waiting for \"Down By Law\" to trickle to an end. There were no laughs to be had, there was no action, and there was no stimulating dialog. There was, however, ceaseless boredom accompanied by yawning and eventual sleep.",
            "review_date": "2020-01-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A bit slow at times, but generally good",
            "content": "One thing that I have always liked about Jim Jarmusch is that a lot of times he seems to use people whom you've either never heard of, or wouldn't expect to see acting in a film. His 1986 film \"Down by Law\" is no exception. The film tells the story of three men, Zack (Waits), Jack (Lurie) and Roberto (Benigni) who meet when they are put in the same jail cell at a New Orleans prison. All three men are different in terms of background; Zack is a serially employed radio DJ who is kicked out of the house by his girlfriend, only to run into a shady acquaintance that offers him $1,000 to drive a hot Jaguar to an undisclosed location in the city. Along the way he is stopped by the police and unfortunately, a body is found in the trunk of the Jag, which spells bad news for Zack and a quick trip to prison. Jack is a pimp who is set up by an associate of his; when he goes to meet a prospective \"worker\" in a hotel room, the police bust in, the lights go on and it turns out the woman is actually a young girl. Roberto's background is a little shadier, though murder factors into it. Roberto's command of the English language is comical and his naiveté and good mood are infectious, but the other two come to near blows either with each other or Roberto on more than one occasion, particularly after they manage to escape from prison, when they are forced to rely on one another to survive the swamps of Louisiana so they can escape prison, and one another, for good.\"Down by Law\" is shot in wonderful black and white, which gives the film both a starkness and bare-bones feel. The music is also fantastic, with the instrumentals being performed by John Lurie and the songs by Tom Waits. Thirteen years before winning Best Actor for \"Life is Beautiful\", Beningi gives a great performance in this film; his charm and humor were incredibly apparent in this, his first American film. Tom Waits, a personal favorite of mine, most musically but also for his various movie roles, is a natural actor and did a great job in this film. John Lurie, whom I don't remember from other Jarmusch films I've seen, but apparently was in them gave a decent performance, though at times it was fairly wooden. I suspect that there was a good amount of improvisation throughout \"Down by Law\", but that didn't help some of its pacing problems. Though the photography of the film was wonderful, it couldn't help divert from the fact that there were times when the film really dragged for me, like Jarmusch had left the camera on and the principals were just kind of doing their thing, though not in a compelling manner.Overall, however, I did enjoy \"Down by Law\" and it is a must-see for any Jarmusch fan. I would also recommend it for those who enjoyed Beningi's more recent performances, because he really seemed to have a lot of fun with this film, as did I, for the most part. 6/10 --Shelly",
            "review_date": "2005-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Down by Law",
            "content": "From director Jim Jarmusch (Stranger Than Paradise, Ghost Dog: The Way of the Samurai, Broken Flowers), this film featured in the book of 1001 Movies You Must See Before You Die sounded like a different kind of film from the director commonly known for his darker dramas and comedies, and it was film I looked forward to. Basically out of work DJ Zack (Tom Waits) is set up when he is hired by a mob to drive a \"clean\" car from a bar to a city but he is arrested when a dead body is found by police in the trunk, and pimp Jack (John Lurie) is set up when one of his enemies sends him to meet a girl who wants to \"work for him\" but it turns out it is a child and the police arrest him on molestation charges. Zack and Jack ignore each other for some time, but they do eventually talk about neither one of them being guilty for the crimes they were arrested, there is a point when they come to blows because of the enclosed space and they stop talking. It is only months later when they are joined by a third cell mate, Italian tourist Roberto (Life Is Beautiful's Roberto Benigni) who speaks only a little English but has an enthusiastic and optimistic attitude, despite the fact that he is guilty of his crime on manslaughter. The three prisoners form a close friendship, and Roberto turns out not just to be good company for Zack and Jack, but he has devised a way for the three of them to escape the prison, and soon enough one night they manage to do it. They get away and are forced to run through the swampy wilderness surrounding the prison, and they do whatever they can to avoid detection from the authorities and sniffer dogs searching for them, there is a point when Zack and Jack fall out again and threaten splitting, but Roberto helps again providing food. Eventually the three prisoners find themselves on a road, so they choose a direction to take on it, and they are happy to find a forest house, Roberto is the one that enters and hopes not to be caught out, while the other wait for the all clear, but their friend takes a while. When they enter the house themselves Zack and Jack find that their Italian chum has fallen in love with the lady living there, Nicoletta (Nicoletta Braschi) who is also from Italy, and she allows them to stay with her until the searching by the authorities lessens. In the end, with new clothes, Zack and Jack set about leaving and going their own ways, Roberto says he is going to stay with Nicoletta as they are very much in love, and eventually the two remaining prisoners reach a crossroads, they part on seemingly good terms with hardly any words before they separate opposite directions. Also starring Ellen Barkin as Laurette, Billie Neal as Bobbie, Rockets Redglare as Gig, Vernel Bagneris as Preston, Timothea as Julie, L.C. Drane as L.C., Joy N. Houck Jr. as Detective Mandino and Ralph Joseph as Detective. Waits and Lurie gives great performances as the often argumentative but close friends, with her time on screen Braschi is likable as the girlfriend the foreigner finds, but for me Benigni stole the show as the vibrant Italian who is eager to learn more English, has some clever ideas, displays a great spirit for many things, and is just a lovable character. The story at the beginning is mildly important to see why they are put in their situation, but it is all the action in and escaping from prison that is the most watchable, the conversations inside the cell, and the action as the three friends make their getaway, all this is accompanied by a good script and many funny moments and makes up for a satisfying black comedy. Very good!",
            "review_date": "2012-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "self-consciously cool",
            "content": "Jim Jarmusch's 'neo-beat-noir' follow-up to his quirky debut feature 'Strangers In Paradise' was the in-film for the in-crowd when first released: a hip-to-distraction ersatz comedy in which the only joke is that there is no joke. With his deadpan disdain for the Hollywood mainstream Jarmusch might be accused of being a cinematic rebel simply for the sake of rebellion, offering as his only alternative a numb new form of motion picture in which most of the motion as been deliberately discarded. The result is either an exhilarating departure from convention or a supreme test of patience, filmed in handsome high-contrast black and white and bolstered by a trio of likable if not exactly memorable characters: Jack, Zack and Bob the Italian, three misfits who meet in jail and subsequently escape into the Louisiana bayous. That's about it. Recommended for aficionados of tongue-in-cheek obscurantism.",
            "review_date": "2010-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Subtle grace masquerades as jail-break film",
            "content": "One of the most frequently heard criticisms of Jarmusch's work is that the pace is slow. I would like to make a case for patience. After all, if true beauty and grace were delivered in one massive hit, our poor brains and hearts would not withstand the blow. In Down By Law, Jarmusch invites us to take some time, some real time and devote it to getting deeply involved with his characters. Men in crisis. Misfits, jailbirds, heartbreakingly human. We accompany them on their journey, their escape from their confines. It is a truly epic journey on a small geographical scale. We watch as they begin to mirror one another, as their individual egos become inextricably enmeshed in one another. We watch a friendship form. And how can we begrudge the time Jarmusch takes for this glorious exposition? How can we do anything but marvel at the fine detail in which the scenes are drawn, at the subtle movements of our heroes? Every gesture signifies worlds of meaning and consequence. And Jarmusch does it better, with more skill and with more compassion than anyone. If you are prepared to get involved, if you are brave enough to commit to the journey, you will be rewarded with a kind of epiphany that few films can offer.",
            "review_date": "1998-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant in every way",
            "content": "I first saw Down By Law when it first came out, and loved it. I watched it again recently, and it really hasn't aged at all. In fact, it has gotten even better. I'm not sure there's another movie like it (unless the other Jarmusch ones are -- I haven't seen them). There are very few movies that spend so much time on character development that still have great plots. Like the \"Big Easy\" where it is filmed, this one takes its time but has an easy charm once the plot gets where it was going. The dialogue is wonderfully written, and better acted. Each scene is like a work of art in how it is staged. The soundtrack uses one of the best albums ever recorded, \"Rain Dogs\" by Tom Waits, who stars. One of my all time favorites.",
            "review_date": "2005-07-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jim Jarmusch may be an acquired taste, but he's an interesting acquired taste.",
            "content": "Admittedly, \"Down by Law\" is definitely not for everyone. The movie is deliberately slow, there's no heart-pounding action or slapstick comedy, and certainly no \"top stars\" (although you could say that Roberto Benigni has since become one). Set in New Orleans, it portrays three men - Zack (Tom Waits), Jack (John Lurie), and Roberto (Benigni) - who get put in jail together. All these men were always sort of down on their luck: Zack was framed for murder, Jack was found with an under-aged girl, and Roberto was involved in a murder. Anyway, the three of them escape from jail and have to cooperate to survive while on the lam. But even when they manage to break free from each other, there remains the question of each man's future.Like I said, this is not for everyone; Jim Jarmusch is certainly an acquired taste. Many people will probably find the movie boring. But for me, it's a good representation of American independent cinema. Also starring Nicoletta Braschi, playing an Italian woman named Nicoletta.",
            "review_date": "2006-03-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another great movie by Jim Jarmusch",
            "content": "I've seen a couple of Jarmusch movies and except for Dead Man (which I thought was an incredible bore), they were all great.Down By Law is probably one his best known flicks and is a very good low budget movie. It features Tom Waits, who's not only a fine musician but proves to be a decent actor as well; John Lurie, who also wrote the excellent soundtrack (Waits delivered the opening and end-credits track btw); Roberto Benigni, who nowadays is most famous for directing the Oscar-winning Italian film \"La Vita E Bella\".The movie deals about three guys who meet in prison and escape. It reminded me of \"O Brother Where Are Thou?\" and, perhaps because of it being filmed in black and white, of old 40's movies about escaping prisoners (can't think of a good example, but you get the picture).Three things I liked very much about this movie:1. It's incredibly funny, especially Benigni made me laugh every time he opened his mouth - He irritated me highly in \"La Vita E Bella\" so that must mean something....2. The frame of the camera is very well used. Look at the scene where Lurie counts the money and a hooker is laying behind him on the bed and the scene after that. Another example is when Benigni is dancing with a lady and the other two guys are continuing their breakfast in the back.3. It's very hard to pinpoint when the story takes place; it's timeless in more than one way, obviously helped by the lack of color.All in all, this one comes highly recommended.",
            "review_date": "2002-05-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simple But Memorable",
            "content": "Tom Waits, John Lurie, and Roberto Begnini share a Louisianna prison cell together, and a prison escape film, with all of the actual escape parts cut out. Funny, wonderful performances, stunning black and white cinematography, great music, a human story, an oddly heart warming ending about people coming together and moving apart. There's subtle poetics at work here, with all of Robert Frost, Walt Whitman, references, but somehow it all falls together naturally. Still though I appreciated it more than I actually enjoyed it, but with time I can see myself coming back in the future. Great dry comedy, and beautiful everyday images.",
            "review_date": "2008-06-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fascinating filmmaking far away from Hollywood",
            "content": "Wow, what a movie. Far away from Hollywood, Jim Jarmusch creates a world where you don't need drama, pathos and action to fascinate the watcher. Because fascinating is exactly what this movie is. A plot in the classical sense is almost completely missing; the scenes, in their simplicity sometimes reminding of theater, follow each other without ever creating real suspense; neither griping action nor complex dialogues are there to excite the spectator. And still, with ease Jarmusch fills more than a hundred minutes with a story you won't take your eyes off. It is hard to tell what the atmosphere of the movie is really based on, the characters, the setting, entirely in black and white, the music - probably all of it. Again, like in Jarmusch's later movie \"Dead man\", speed is an important factor: everything moves slowly, without haste, as there is no dramatic climax you could hurry towards; yet, boring is a word that certainly doesn't fit this piece of cineastic art. On the other hand, though some of the scenes seem quite surrealistic, it is not a really artistic movie breaking with all the traditional concepts of filmmaking; it is more a movie in classic shape with an unconventional story, not trying to shock, to confuse or even to make you think so much; this movie doesn't need all this to get your complete attention. You could probably speculate a lot about the meaning of the movie; to me, this seems highly unnecessary. Just let it unfold its atmosphere. Judge yourselves, but I was excited in a very special way by every scene of this motion picture, giving me one of my best cineastic experiences of the recent time.",
            "review_date": "2004-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Down by law: An ideal film for you if you want to discover Jim Jarmusch.",
            "content": "It is true that \"Down by law\" is a film which has been made for his actor as well as musician friends, director Jim Jarmusch has been able to capture a certain type of melancholic mood. It is a mood which affects many capricious men.This film has been built around such American men who do not seem to realize the importance of American culture.It is for this reason that they do not have much to say when an Italian man with little knowledge of English speaks to them enthusiastically about his appreciation of icons of American literature Robert Frost and Walt Whitman.The excessive use of vulgar language especially the incessant use of \"F\" word might be difficult for some viewers to digest.However,Jarmusch has ensured that for his film a conventional story does not matter as despite the lack of a clearly defined narrative structure,strengths and weaknesses of all characters have been nicely revealed.This film boasts of a good soundtrack with some mellifluous tunes which can be hummed anywhere,anytime.Lastly,'Down by law' is a good film to watch even when the viewers get to know that the real action of the film starts after 1 hour.",
            "review_date": "2014-08-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "spoliers........ trust",
            "content": "Jim Jarmusch trusts his camera, his directing, his writing, and most of all his performers.  This is a gem of a film, without pretense.  The story and film just move, sluggishly chugging forward to an ending that is really more of a dissolve.  The story is ultimately of little importance, just enough movement to show us a bit of the big jokester in the skies irony.  I was struck by the similarity's to Dead Man, similarities quite aside the black and white photography.  The enigmatic character at the center, the drifting in and out of the main characters, the use of the boat, the disposal of the usual plot devices, the cutting away of obvious scenes (like the \"how' of the escape)  I wish more films displayed this sort of ease with themselves. Great stuff,  8/10.",
            "review_date": "2004-03-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Noire Fairy Tale: Surprised by Delight",
            "content": "This movie was a total surprise to me. I'm sure it's very famous, but somehow had never seen it before. From the beginning scenes, I was expecting a gritty low life, wind up in the gutter, down and out kind of crime movie and that was fine with me, especially if set in New Orleans. At the same time there was a surprising freshness about it, that caught my attention, like a wake up call. Literally, there was writing on the wall that signaled \"this is not that kind of movie!\" The opening scenes reminded me of the opening of Sopranos -- the rolling shot of a neighborhood with an ominous sounding song in the background. (Were the Sopranos producers inspired by this film?) But once Roberto Benigni appeared on the scene, announcing that \"Life is Sad and Beautiful\" the whole story began to feel more like a strange fairy tale. Throughout the film, I appreciated the way the director took his time, letting the story evolve slowly, giving the characters time to develop their tenuous bonds. I could watch this again and again, knowing I would keep discovering hidden meanings, references, and ironies. Loved it!!!!",
            "review_date": "2005-03-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "In pair with Dead Man",
            "content": "Jarmusch movies miss everything that makes a successful Hollywood blockbuster. There's no complicated plot, there are no unexpected twists, no fast pace, no adrenaline action scenes, special effects or complex dialogues. On the basis of the above, one would expect a boring and stupid film, but Dawn by Law isn't one in any way. Like in Dead Man, by combining eccentric but natural and convincing characters with good direction and disturbing, somewhat \"detuned\" music, Jarmusch builds a specific atmosphere that will keep you pinned to the screen. When you on top of that add Roberto Benigni, who was born to be comic relief, and Tom Waits, who besides playing main main role also did some music for the film, perfection is guaranteed. For me, this movie, same as Dead Man, is a kind of cinematography meditation.10/10",
            "review_date": "2018-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a sophisticated, masterfully laid-back take to the prison picture",
            "content": "I watched Down by Law twice in one day when I got it on DVD (an exceptional DVD for Jim Jarmusch fans, by the way). I wasn't expecting too, and I fast-forwarded past a couple of smaller scenes the second time around, but overall I found this to be a sort of sensational film in the most subdued way, if that's possible. It's realistic in some ways, but also sticking to many of the ideals that go with the 'prison' picture (a kind of sub-genre Jarmusch obviously loves and is tipping the hat to). It's also a comedy that juggles between Jarmusch's knack at subtleties (\"hey, hey, not the shoes\" is a hilariously low-key line by Waits) and also a key supporting role from Roberto Benigni, in his first film outside of Italy. His is a balancing act between Lurie and Waits, who for a lot of the film try to act too cool for school, so to speak, despite the fact that they're in jail. He's the obvious, but needful force that gives Down by Law its kick just when you think it might be getting a little dull. And somehow Benigni gives this character a dimension from Jarmusch's script; he's funny, and also has a slightly serious side too, an earnest one, which is shown in one of the best scenes of the film at the fire where Benigni tells the story of the rabbit.The acting (not necessarily 'professional', but truthful, and surprising considering Waits being almost always an eccentric musician) would've made Down by Law a good movie on its own, however Jarmusch's direction - and more particularly the contribution of Robby Mueller as DP - is a delicate act of black and white finesse. Mueller understands this story, and these actors, and also gets down this whole down-on-the-bayou area of America without a flaw. In particular the cool shots that get the camera moving, like when the three of them are on a boat in the bayou, and the camera just seems to float along at times, this despite the impeding danger of the characters being caught. Like Stanger than Paradise, Jarmusch's previous films, Down by Law is also partly a movie on the road (this time on the run), with eccentric characters and gritty settings, and so the camera-work compliments this. That it looks so much more beautiful on DVD is an added bonus.Down by Law is, if nothing else, a sort of 'genre' picture that goes beyond its limitations by way of a distinct style, some fascinating performances, and music that comes in a of spooky way that also adds another level to the film's effect on a viewer. Not for all tastes, as per usual with Jarmusch's work, however not without its pleasures; those who want a Benigni fix after checking out his Italian films need no further than to look here.",
            "review_date": "2005-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A true embodient of cinematic poetry",
            "content": "Jim Jarmusch's Down by Law is one of the closest things I've seen to poetry on film, but not poetry in the sense of dialog nor musicality; poetry in the sense that this is a film that fully understands the beauty of cinema and cinematic presentation. The film opens by slowly panning the camera to the left through the town of New Orleans, which looks to be such an interesting and quietly beautiful place that it seems almost criminal of Jarmusch to inevitably confined to the four walls of a prison. Jarmusch presents us New Orleans as a city that basks in its imperfections and naturalism, cast through beautiful black and white cinematography and set to the glorious, almost jazzy sounds of John Lurie and Tom Waits, who also star in the film. The opening four minutes, and the remainder of the film, with its shot-structure, the intense focus on characters instead of plot and the action, and the dense visuals on display, showcases some of the deepest beauty and poetry of which cinema is capable.The film opens by focusing on three separate men, unknown to each other at the time, as they are each arrested and booked before being places in the same cell. Both Zack (Tom Waits), a B-grade disc jockey and Jack (John Lurie), a full-time pimp, have been set up by outsiders, whilst their cellmate Bob (Roberto Benigni) is an Italian tourist, who speaks broken English, is in jail for manslaughter. Upon showing each of their arrests, the three spend time in their cramped cell playing cards and engaging in occasionally hostile conversation, particularly Zack and Jack, whereas Bob finds himself rather positive about the entire situation.After not spending too much time in the clink, the three men decide they want out and craft what may indeed be the most anticlimactic prison break in the history of cinema. The three proceed to run for the hills, eventually crossing the humid bayou of New Orleans into unknown territory. The three men, in turn, try to seek refuge in the middle of nowhere until law enforcement dies down and the three can form a plan of how they want to spend their lives on the run.One criticism I can foresee about Down by Law is how unremarkable the prison break actually is; it's literally a fade-to-black sequence where, one moment, the three are behind bars, then the next, the three are escaping through an underground tunnel. However, this is further proof that Jarmusch doesn't have any desire to make this film about process and narrative plot-pointing. At the end of the day, that sets up developed situations and locations and not always developed, instrumental characters that are instrumental to the story. Jarmusch makes this film entirely focused on dialog and eccentricities of the characters; consider the famous \"ice cream\" scene in prison, where Zack defines the act of \"screaming\" to Bob, who then recalls the common phrase of \"I scream, you scream, we all scream for ice cream,\" adding his Italian drawl to the phrase. The three men begin to harmlessly chant and dance around their cell, eventually inciting the majority of the unseen prisoners to chant. The scene is humorous because of its inanity and general harmlessness; out of all the things that could happen in a prison between three men, the fact that Jarmusch included this is hilarious in itself.The film persists on with many low-key, delightful scenes like this, and never does Jarmusch run out of ideas for these characters. The only fault here is that he does, admittedly, take a bit too long to get going, lingering on the opening scenes of how these men are put into prison instead of watching them spend time behind bars. Uniformly, however, this is a film of cinematic poetry, defined largely by its flawless cinematography - done by Robby Müller in a manner that accentuates the natural beauty of the locales - in addition to Jarmusch's slow-moving camera pans that make for a nice touch of stylistic flair to a film that could've ostensibly been made without any. Then there's the dynamic abilities of the actors and the hilarity of Jarmusch's screen writing that further complement the film and its wits; Down by Law is one of the quirkiest pieces of American independent cinema to be found in the 1980's and that, in addition to its dialog and lovable, if scummy, characters add that extra layer of craft.Starring: Tom Waits, John Lurie, and Roberto Bengini. Directed by: Jim Jarmusch.",
            "review_date": "2015-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Dissenting Opinion",
            "content": "Without Roberto Benigni, this movie would be an utter wasteland. The characters played by Tom Waits and John Lurie are not very interesting, and neither actor makes a very strong impression in this viewer's opinion. I'm not sure where this falls in Benigni's film career, pretty early in his English language films, I would think, but his comic talents are all that saves this movie from being utterly forgettable instead of merely absurd. I couldn't care less what happened to the Waits or Lurie characters, and Benigni's finding Nicoletta Braschi operating a restaurant on a Louisiana road that no one seems to travel is beyond improbable. But the chemistry between them is unmistakable (as it is in other movies and in real life), and it's all that saves the movie from being utterly dump-worthy. Jim Jarmusch is usually off-beat, and some of his movies succeed better than others. (Or to look at it another way, some of his films fail more completely than others.) Without Benigni, this would easily qualify as the worst Jarmusch film I've ever seen -- and I've seen a lot of them",
            "review_date": "2005-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Early Jarmusch: awkward but heartwarming camaraderie in the America of vacant, overgrown lots and other such blight",
            "content": "Jim Jarmusch's DOWN BY LAW is one of the art-house productions that the American independent director made his name with in the 1980s.At this point in his career, Jarmusch wanted to depict not the glitzy, glamorous America of Hollywood films, but rather the side no one ever talks about: vacant lots overgrown with weeds, the ramshackle homes of the working poor, and empty suburban streets. As the film opens, Jarmusch sets the stage by depicting New Orleans from this angle in a series of shots made from a moving car. Only then we see how a small-town pimp (John Lurie) and an itinerant DJ (Tom Waits) get themselves arrested after they've each accepted a job from a seedy friend. They subsequently end up sharing a jail cell, into which one day an Italian immigrant (Roberto Benigni) is also placed. The plot of the film is the developing camaraderie between these three men. The Italian's bumbling antics act initially aggravate his cellmates -- Benigni's role serve as comic relief against the morose behavior of the other two characters. DOWN BY LAW begins as a drama portraying the underbelly of a Louisiana town, but by the end it has transformed into absurdist comedy.Lurie's acting is fine, representing his character convincingly as a pathetic d-bag. Benigni might seem like he's playing himself, but his English is reputedly much better than the broken phrases he offers in the film. Nicoletta Braschi appears as the Italian's love interest, a role that must have been easy to play since Benigni and her are married in real life. I've never thought Tom Waits was a great actor, however.In terms of cinematography, this is a major step forward for Jarmusch. Bringing on cameraman Robby Müller, most famous for his work with Wim Wenders in the 1970s, Jarmusch shot many scenes with blatant diagonals and claustrophobic framing that suggests the prison in which these characters do time. It's certainly the most geometrically striking film of Jarmusch's career.This is an entertaining film, with many fine touches. If I give it less than a rave, it's just because I can't completely get into these black and white portrayals of contemporary lowlifes (I have a problem with early Kaurismäki for the same reason--his aesthetic was very similar to Jarmusch's.) But I think this film has held up pretty well three decades after its release, and I'd recommend it for anyone looking to explore Jarmusch's work.",
            "review_date": "2015-09-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jailbreak Joy",
            "content": "A DJ, a pimp and an Italian tourist get sent to a Louisiana prison. Sounds like the beginning to a bad joke? It's the plot to one of the best films of the 1980's. Down by Law is pure, classic Jarmusch. He creates the perfect unlikely trio, who by chance need to stick together to get as far away from prison as possible. Roberto Benigni is the standout here. He plays the hapless, optimistic foreigner, and as always, he's a riot. When he finds a beautiful Italian woman, and her trattoria, in the middle of the Louisiana swamp, I couldn't stop smiling.",
            "review_date": "2017-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Quiet brilliance!",
            "content": "Jim Jarmush once again flaunts his intelligence, eye for detail, and love of poetry in his quietly brilliant film, Down by Law. It's a film about three men with very different stories who all find themselves in the same cell in a New Orleans prison. Tom Waits plays Zack, a lowly radio DJ with no future. John Lurie is Jack, a wannabe pimp who doesn't really have a clue what he is doing but pretends like he does. And then there is Roberto Benigni as Roberto, an Italian tourist who is desperate to learn about American culture and language, but has come to the wrong part of town to find it. Together, these three oddball characters escape from prison and go on a weird and offbeat, existential journey through the New Orleans swamp land.On the surface Down by Law seems like little to nothing. But it is the quiet subtleties that make this a rather ingenious film. On the surface it is a story of three strange men who escape from prison together. But Jarmush mixes in his witty dialect, astute characterization, and clever allusions to poetry that carry throughout the film to make it more than just a prison escape film. He disguises a sophisticated ingenuity about the film underneath simple quirkiness. He plays up a lively and rather simplistic nuance, only to sprinkle the film with a more intelligent air. The film really does feel like a smart film, whether you can place where the intelligence comes from or not.However, that's not to say that this film isn't fun, as well as funny. Zack, Jack, and Roberto are three great characters and they work so well together. They all have their odd quirks and strange mannerisms that make them all very unique people. There is some great banter between the three and plenty of moments that aren't necessarily laugh out loud hysterical, but pleasantly funny, eliciting a chuckle of approval. And then of course the unique way Jarmush shoots the film also makes it a very interesting watch for those with a keen eye for unique directorial ability. Down by Law is an effective exercise in intelligent shot framing as Jarmush shoots the entire film with very long still shots, or very long shots that make only subtle movements, making the direction of this film silently brilliant. Add to that the skillful black and white cinematography and it is safe to call this film a subtly excellent visual experience.Jim Jarmush almost always impresses us with his great usage of minimalist filmmaking techniques. He creates such unique stories that all have such quiet excellence that they become remarkably unforgettable films, even if you don't pick up on their brilliance the first one or two viewings. Down by Law may be one of his quietest exaltations of skillful minimalist filmmaking, but it is still an excellent film. Jarmush tells his story exactly how he wants to tell it, and he gives us, the audience, a unique experience to remember.",
            "review_date": "2011-09-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The road not taken, by \"Bob\" Frost",
            "content": "Ever since \"Stranger than Paradise,\" I have loved and sought out quirky filmmaker Jim Jarmusch. He has an unusual sense of humor and an unusual way of presenting his films. Sometimes they're episodic, like Coffee & Cigarettes, Mystery Train, and Night on Earth, and sometimes they tell the story of bizarre people brought together by bizarre circumstances.\"Down by Law\" is about three men who meet in a New Orleans prison, Zack, Jack, and Roberto (Tom Waits, John Lurie, and Roberto Benigni). Zack is a DJ who took $1000 to drive a car, but there was a body in the trunk. Jack is a pimp sent out to check out a new prospect who turns out to be underage, and the police are waiting. We only hear Roberto's story from his lips - he apparently threw a billiard ball at someone and the person died. The three men manage to escape into a swamp and woods.Roberto quotes (in Italian) the man he refers to as \"Bob Frost\" and there is the symbol in the film of \"The Road Not Taken\" when a fork in the road is reached. One thing that cracked me up was the same thing that cracked me up in \"Stranger than Paradise\" - in that film, everywhere the characters went looked exactly the same as the crummy neighborhood and weather they left in Chicago. It didn't matter if it was in Florida or at the aunt's house - it was always overcast and awful. Here, the three men escape and wind up in a building to spend the night that looks just like their prison cell.Benigni, as the cheerful, chatty one is hilarious, and what happens to him is even funnier - and could only have happened to that character. Waits and Lurie give solid performances in less showy roles - another element of Jarmusch is his unusual casting.\"Down by Law\" is done in stark black and white; rarely does Jarmusch work in color. It gives this film a downbeat atmosphere, along with the garbage in the neighborhood streets, the swamp, and the woods.There are slow sections but if you want to see this unique director's work, I recommend it. No one tells a story, or chooses what story to tell, quite like he does.",
            "review_date": "2013-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Original prison movie.",
            "content": "This movie takes an original approach on the prison-movie genre. Instead of going over-the-top in its drama and emotions, the movie prefers to keep the movie deliberately small and personal with its characters and emotions. It makes \"Down by Law\" an original and always intriguing movie to watch, though not necessarily better than other genre movies.It's a typically slowly told and build up movie, with long beautiful shots and lots of shots without any spoken lines. It does make the movie feel way longer than it really is but this really is not complaint, since I liked what I got to see all.In essence the movie is three in one. The movie begins with the (long) character introduction of the two main characters played by Tom Waits and John Lurie. Two low-life small criminals who get framed for two serious crimes they didn't commit. When they're in prison and are joined by the other criminal played Roberto Benigni, the entire movie gets situated in that one prison cell. It doesn't even provide us a look on their hallway-view. It shows that all they have inside the prison cell is each other. They don't really want to be friends, also because they differ from each other but circumstances forces them to create a solid bond of friendship, that only grows stronger when the three of them escape prison (also the escape itself is conveniently not fully shown). When they have escaped the movie gets different again, when the three main characters depend on each other for their survival.The movie is atmospherically filmed in black & white. It does make the movie feel older but timeless at the same time. The atmosphere and storytelling reminded me of some good classics from the '40's. I definitely think that Jim Jarmusch is an underrated director, with already a long list of great movies behind his name. He knows how to tell a story compelling and original, without many resources or money.The acting is great, though by no means any of the actors are the greatest. The choose to make their characters work out realistic and humane, rather than they try to impress and show of their acting skills. It makes us feel involved with them and makes the story work out so much more powerful and interesting to follow. Tom Waits and John Lurie are great two tough guys and Roberto Benigni is put in for the more comical note.It's definitely true that the movie is way more entertaining and humor filled than you at first sight would expect. The movie certainly doesn't begins as a comedy but it subtly turns into one as the story progresses. I expected an heavy, serious drama but instead I got a light and entertaining one. It was a delightful surprise and made \"Down by Law\" definitely a great and pleasant viewing experience.A great little, underrated movie!8/10http://bobafett1138.blogspot.com/",
            "review_date": "2007-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Down by Law",
            "content": "Jim Jarmusch has this odd way with films, where they vaguely resemble some genre but not really, and then become something else... some call it genre-undermining, but it's not really that, nor do I want to say that he delightfully rends them to pieces or pastes them together... it's just as if he starts out by saying, \"I'm going to make a prison break movie\" and ends by saying, \"but it'll be a fairytale set in Louisiana.\" The closest comparison I can get to is O Brother, Where art Thou?, that musical prison-break movie set in the Depression.This film, I'd say, isn't as slow as most of Jarmusch's films I've seen... the beginning may be, as he sets the stage showing us a very Louisiana landscape (anybody who's been there will recognize it immediately... even though Jarmusch wrote the script having never been there!) and then slowly introduces our characters.Zack and Jack, well, they are just what you'd expect coming from the actors they came from, but they are still their own, aspectually engaging in demeanor and tone. Which is why they rhyme, and why Bob, who doesn't rhyme, fits in so well with them and is really the only reason anything seems to happen in the movie! Bob is a great character, hilarious, kind, and one of those you feel sorry for whenever Jack and Zack get so caught up in being them that they leave Bob alone and lonely... in fact, everything about Bob bleeds a sort of loneliness, from his word-play humor and his Italian expatriotism. Of course it's from a character like that that the ultimate fairytale form comes from, who transcends to \"Happily ever after\" while the two rhymers go off to find their way on opposing roads.This is definitely a great film, funny and moving, and I hope even people who dislike Jarmusch's other films will give it its chance to shine.--PolarisDiB",
            "review_date": "2006-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Truly eccentric",
            "content": "You have to be in a very particular type of mood to properly tune into a Jim Jarmusch film. He populates his often black and white and always slightly mournful films with awkward, dazed individuals who are more comfortable in the uncertain pauses between dialogue than the actual words themselves. When I feel like a Jarmusch film (other than Dead Man which is an all timer for me) it's always during times when I feel the daydreamy grey matter coming on, an otherworldly, downbeat relaxation that his work is rife with. Down By Law is a signature example of this, and most likely the film I connect with most of his, after Dead Man. This one concerns three wayward and very different souls who by fate and unfortunate circumstance end up in jail together. Zach (Tom Waits) is a radio DJ who is hounded by his girlfriend (Ellen Barkin) to be more proactive and less relaxed. Jack (John Lurie) is a laid back pimp, and they both find themselves incarcerated in a Louisiana prison where they meet the eccentric Italian tourist Roberto (Roberto Benigni, hilarious). The trio are a puzzling gaggle of misfits, moments of startling pathos and stinging humour sprouting as their time together goes on. Soon they discover that Roberto may know of a way to escape, and see it as their chance. The characters in any given Jarmusch film never seem the same as usual film archetypes; they're always quirky and completely their own person, which is no doubt a product of a very intuitive directorial process, and an excellent relationship with the actors. It can be disarming to spend time with such distinct people in film, but when you stop to realize just how weird everyone around you in real life is vs. what is common for movie scripts, it feels genuine. This one is lived in, authentic and funny in that intangible way where you can't even say why it's so hilarious. We all a- scream for ice a-scream!",
            "review_date": "2016-06-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "stylish prison escape comedy",
            "content": "After being somewhat disappointed by Jim Jarmusch's film debut \"Permanent Vacation\", \"Down By Law\" worked as a refreshing reminder of the man's genius. This is a cool, stylish indie film shot beautifully and cast perfectly. All of the actors are great and well chosen, especially Roberto Benigni who is likable, hilarious, and memorable. Tom Waits and John Laurie also provide excellent performances and really capture their characters really laid back attitude.The script is wonderful. Since this film has such a simplistic and traditional plot, all possible originality needed to come solely from the characters, dialogue, and style. All of these elements are reflected beautifully in the script, because a film with this exact plot could have been nothing but cliché garbage. However, due to its style and character, t is one of the most unique indie movies of the 80s and a funny and entertaining ride for anyone who can tolerate it's cool, artsy style.",
            "review_date": "2017-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "THIS is supposed to be a comedy ?!",
            "content": "I don't understand . I don't understand why some really great and really funny movies are rated by IMDb voters below 7.0 , while such unfunny piece of s*** gets a high rating. I really don't know. Before you throw tomatoes at me , please hear me out. I consider myself a guy with sense of humor. I like different kinds of comedy . I like Charlie Chaplin , Buster Keaton , Harold Lloyd , Benny Hill , Eddie Murphy , Rodney Dangerfield , Chevy Chase , Monty Python , Police academy , Wes Anderson movies ,Billy Wilder movies, some black comedy , cartoons and many others . I've seen only one Jarmusch movie before this one (\"Broken flowers\") and I liked it . I was expecting something good from this one too. Especially considering the praise I've heard from many people.This ? This is BORING . BOOOOOOOOOOOOOOOOOOOOOOOOOOORING . I don't remember when was the last time I saw something so lifeless . Not to mention I fail to see where the jokes are . Really. I've seen this twice and I honestly haven't found a single funny thing . I regret that Jarmusch didn't put the fake laughs (just like in those American sitcoms)into the movie , so I would at least know what he thought was a good joke . And why this is black and white ? What's the point ? \"Raging bull\" and \"Sin city\" are black and white for reason. Here ? I don't know . Maybe so Jarmusch could pretend this is some \"artistic\" movie. Maybe he did this movie to show what a rebel he is.I liked Tom Waits songs . I also have to admit that acting is solid. The characters are likable. It doesn't change the fact that it's a completely pointless movie . Watch it only if you're insomniac. I give it 1/10.",
            "review_date": "2013-09-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jim Jarmush' ultimate classic. Slowburning, meditative, witty and incredibly gorgeous!",
            "content": "The story: 3 innocent men get imprisoned, one of which is \"clown\" Roberto Beningy, who will set in motion a chain of surprising events...Seen it many many times already and what is most striking about it is the meditative, gorgeous photography in black and white by Robby Muller. Almost every scene looks like a photo, straight out of an art gallery.Gorgeous! Besides these mesmirising looks, the slowburning story and the laid back and funny acting performances are both to die for as well. Scored with an eery sounding free jazz soundtrack, which transcends this movie even further into the stratosphere.This movie is unique in it's kind. Only suited though for those who have lots of patience, because ALL movies made by director Jim Jarmush are about hanging around and drifting, with some reciting of Jarmush' favorite book authors in between. Lots and lots of moments of tranquil silence, with no camera motion or spoken word whatsoever. I dont know of any other American director, who dares to film in such a meditative documentary style. Sometimes bordering on boring, but these many moments of passiveness always deepen the impact of the next scene. Fascinating, gorgeous, witty and dream like... Highly recommended for the arthouse movie lovers. A must see for any Jim Jarmush fans...",
            "review_date": "2019-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Save your time.",
            "content": "I guess something is wrong with me. I pretty much like Jarmush's movies, bit this one...I simply don't get. Having seen all the stellar ratings and having read all the reviews, I expected a good, ENVOLVING movie. Oh boy, was I wrong.It is slow, so slow you can go and have some breakfast only to find out that it is still the same scene when you return. It's supposed to be deeply into character psychology -- but it's not. It's supposed to make you think deep thoughts, but it doesn't.Indeed, you can sit in your bedroom, stare at the old white cracked ceiling and reminiscence, but that doesn't mean that the ceiling has any artistic value. The same goes for this movie. You can \"read into\" it as much as you want, but it's you, not Jarmush. This movie is, in fact, totally void of any content. And yes, the emperor is, in fact, naked.",
            "review_date": "2006-03-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful waste of time",
            "content": "This film had evaded me for two decades. I know people my age (nearing fifty) who swear by it. As it was to be shown on cable tonight, I opened a nice Aussie wine and started to watch. After a while I started to wonder whether it does kick off or not, and halfway thru it I just sat, glassy eyed, realizing it would not. Astonishingly amateurish, pointless and sluggish, with no storyline to mention, it left me wondering why it had been done. Guys paddling around in the swampland, watching the boat sinking sums it up. Looked like it had been made in Finland. Jarmusch must have been both depressed and feeling special when he concocted this soup. What strikes me after the ordeal of watching thru it, is that the film does not reflect its epoch at all. If Down by Law is a masterpiece, it's the autistic sort, not meaning to slander persons suffering from the same malady as the the movie. 2/10.",
            "review_date": "2006-09-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's a sad and beautiful world so said in a sublime b&w film!",
            "content": "Down by Law is my all-time favorite indie-flick written and helmed by Indie-film craftsman Jim Jarmusch. It's something of a realistic and gritty fairy tale about an unlikely threesome. Roberto, an Italian with an Oompa-loompa hair-do, Zack, an edgy hipster and former radio disk-jockey and Jack, a street pimp. All three men end up sharing the same prison cell and bond with war-stories, playing cards and the occasional joke, discreet or loud. Eventually, the three of them escape from the prison and venture into the Louisiana swampland not knowing where they are or where to go.It becomes a Wizard of Oz-like odyssey where each man finds freedom, romance and solace despite their seedy and gloomy past lives. This unconventional moving picture has the happy ending that tells us there is light at the end of the tunnel.",
            "review_date": "2020-02-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the son of the pink panther",
            "content": "This isn't your normal prison movie, nor by any stretch your normal American comedy. Make no mistake if your favourite movies are Hollywood by numbers, you will be confused and bored by this great piece of cinema. Tom waits stars as Zack, a DJ who ends up in jail for murder after being set up. John Lurie is Jack, a pimp who also gets set up. They bond uncomfortably in a Louisiana jail, before Italian comedic genius Roberto Benigni comes in and changes there world. Waits and Lurie are brilliant, they both completely become low level hoods, but its Benigni as usual who is the colour of this Black and White film. He is the heart and soul that these two losers never knew they had. They eventually escape and are then lost in the bayou for too long. The movie is less about what they do, and more about the journey that these two hoods have following this effervescent Italian. This is so different to the normal Hollywood comedy, that I can understand most people will not like it, but the gruff demeanour of Waits and Lurie are in beautiful contrast to the stunning black and white cinematography and the great Robert Benigni. Jim Jarmusch takes his time, and as usual delivers something worth waiting for.",
            "review_date": "2005-08-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Superb Piece 9/10",
            "content": "If i had to describe any aspect of this flick i'd say it was \"crafted\". Utterly sublime direction from Jarmusch, with a sense of desolation in the landscape that is captured so well, it's almost surreal. Waits is, simply put, a genius, and puts in a performance which would silence any who feel that \"you can't be both an actor and a musician\". Benigni and Lurie are both a delirius joy and deliciously despicable respectively. The use of Waits' music within the film only heightens the sense of dusty Americana, and hip oddball style. It reminds me that indie-film snobs have actually got something right for a change, and its cult classic status is rightly deserved. Exquisitely shot, with an excellent soundtrack and sterling performances. Highly recommended, especially for fans of Waits and Benigny. Also, it's the only film that makes me want ice cream....",
            "review_date": "2004-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you can only take ONE movie to an island...",
            "content": "...then \"Down By Law\" should be among those to consider.Great cinematography, a superb soundtrack by John Lurie & Tom Waits, and brilliant performances by the three lead actors as well as Ellen Barkin and Nicoletta Braschi (Benigni's wife).In my hometown Berlin, this movie is one of the evergreens during the popular open air cinema season and it very well deserves it.I screama, You screama, We all screama for .. DOWN BY LAW!There are two scenes I find particularly noteworthy. One is the opening sequence which is a long take passing through a small town, the other is the three escapees journey in a boat through a seemingly endless swamp. See for yourself. No explanations required.",
            "review_date": "2006-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Prison funvicts on the run",
            "content": "\"Down by Law\" is an American 105-minute movie from 1986, so this one will have its 35th anniversary next year and this is an early career effort by writer and director Jim Jarmusch, who was in his early 30s when he made this one. The cast, in terms of the three protagonists, are all actors that Jarmuusch has worked with on several other occasions. Waits and Benigni I remember from \"Coffee & Cigarettes\" and with Lurie I must admit I am not familiar at all, but I see this is not the only prokect beteen him and Jarmusch either. As for the females, Ellen Barkin has a little role here, but the one who was more memorable to me was of course Nicoletta Braschi, who is in the last segment from ths movie and of course she was already in a romantic relationship with Benigni at that point and as I totally adore \"La vita è bella\", I found it truly nice to see these two together. I love how they are still an item now in 2020 and they are probably my number 1 favorite couple that I hope is never gonna split up. Okay, as for Jarmusch again, even if his most recent zombie movie was in color, black-and-white was a common formula for him back in the day, so not too surprising that this one here allso lacks colors. It definitely does not give the film a weaker outcome or so. It is pretty entertaining for the most part. Sure it is also a bit serious with the references to murder, pedophilia and the risk of a trio of prisoners getting caught and maybe even killed when they try to get away, but all in all, it is definitely on the lighter side. I liked how the friendship between the gang got bigger and bigger the more time they spend together. Benigni's character was really the trigger for that and you see that every time the other two are without him, their aggression rises again. Of course they did not like Bob either at the very start when he shows up, but that changes quickly. Kinda ironic though that these two were framed while they indeed are on the badass side, but Benigni's character who seems to be so fun and harmless actually killed somebody. You can really see from scene to scene more and more how they get along better with each other. The best example is of course when they sing towards the end of their prison stay and you can even hear people from the other cells singing with them. It's a lot of fun for sure. This was the one scene in whcih Waits' and Lurie's characters are somewhat not basically the same because it takes Waits' character a lot longer till he joins with the passionate singing.Here and there, there is a moment that feels rather weak or does not amke too much sense, but it is all easy to forgive. One example would be how Benigni's character speaks apparently so little English, but nonetheless knows words like \"garlic\". Is it perhaps just make-believe? Or how he actually ran into Waits' character before they meet in the cell. Yeah, some of it did not make a whole lot of sense, but there is no denying from my side that the good moments here are far more frequent than the weak moments and also better than the weak moments are bad. By the way, as for the crew here it is interesting how Waits and Lurie contributed a lot to the music and songs in this movie. And very fitting that one of the most memorable scenes here (I mentioned it above) includes carefree singing and their desperate situation is somewhat forgotten for a moment. Theirs and the other prisoners'. of course, Benigni adds a whole lot with his charm here for sure and with his careless (in a positive manner) Italian approach to every single scene basically. His name is so fitting in terms of how benign he is from beginning to end. Also pay attention to his very first scene how he inspires Waits with his words and also the other way around. A lot of fun there too. As the film goes on, Benigni has many more good moments like for example how he admits he cannot swim and grst they leave him behind, but then before the guards and dogs show up, Waits' character returns because they are friends now. And after all, Benigni's character was the one who made the prison break happen. By the way, one of the easiest prison breaks in existence this was. Wentworth and the gang can learn a lot from these guys here. Okay what else? The two more serious characters get an introduction, actually a fairly lengthy one and we find out what happened to them that they end up in jail. Benigni's character does not, although the billard scene would have been really interesting to watch, but for good reason because his character is quirky enough anyway for us to warm up to him immediately, so no real introduction needed. I mean despite being a vegetarian I even enjoyed his scene with the rabbit when he keeps talking about his family before the other guys join him briefly afterwards. Haha they moved like zombies there when they return and even after the argument, the group unites again, once more thanks to Begnini's character being a bit of a pacifier almost. I could almost say \"Benigni\" because I feel he is like that in real life from what I have seen and his name is Rooberto (or Bob) anyway in this movie. Another fun moment from him would be when he begs to also be alloed to leave the cell and the guard lets him finally and of course the latter had no clue that they are about to break free and escape from this prison. Okay, finally a few more ords on the Braschi scene. Now normally if you have 3 convicts approach a female who is alone in a little shack, it may be a dangerous situation for the female, but here she finds love and so does Benigni's character. So sweet to see these two together like that with their background story. And in the end, Braschi gives a really warm hug and kisses to the other two guys as they are about to leave again and let the two lovebirds behind and it seems they are safe where they are now, even if they still may be crocodiles in the swamps, where a big part of this film is set. By the way, another difference between the two brutes that one sleeps like a baby and the other won't because he is more careful. The way they exchange their jackets at the very end is also a bit of a sign that even these two, now for once in the absence of Benigni's character, have gotten a bit closer and can be called friends now. They may not take the same route, so they are not buddies for life, but at least they did not get in a massive fight again. Okay, this would be all then I suppose. You should watch this film for yourself anyway. Apart from myself, there were only two other people (a couple) in my showing. Not a lot. This movie deserves better for sure. It's not best-of-the-year material, but deserves to be seen for sure. Just like the two brutes deserve to wait a little longer outside the house and miss some of the meal before they move inside like idiots themselves. You get tis harmless reference if you watch this one. Totally go for it! It's a pretty charming film and especially worth seeing for my fellow Benigni lover. I am always baffled by how much I like him because otherwise loud and really agile actors are not always my preferred choice and they can quickly feel obnoxious. But with Roberto it all feels real, authentic and heartfelt. Okay, now I shall really finish. What are you waiting for?",
            "review_date": "2020-03-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Black n White Beauty",
            "content": "The second movie of a director who always brings fresh films. The movie is shot in black and white with stunning visuals.The opening of the movie creates a curiosity and feels some freshness. Two different persons are introduced to us, and soon they are imprisoned. They are innocent and the arrest was set up. An interesting third person, with broken English, joins them in their cell. On his idea, they decide to escape from the prison. Their journey is the rest of the movie.The intimacy and affection that we feel towards the characters generate the curiosity about their fate. This makes the movie special. The careful characterisation and dialogues contribute to the success.If you ever want to watch a movie out of the plate, this is highly recommended.",
            "review_date": "2016-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a slow slog through the bayou",
            "content": "\"Down By Law\"  *1/2.  (1986, USA, R, 96 min Directed and written by Jim Jarmusch with Tom Waits, John Lurie, Roberto Benigni, Nicoletta Braschi, Ellen Barkin, Billie Neal). I read all the reviews (at least all the reviews on the Internet Movie Database) before going to see this movie.  Without doing the math, I easily expected a 3 star-plus movie.  Friends and relatives told me `'Down By Law' is great and you really have to see Jarmusch's other movies.'  I don't think so! Zach (Waits), Jack (Lurie), and Roberto (Benigni) are three losers, who through a series of events end up in the same Louisiana jail cell.  Zach and Jack hate one another.  And, together they hate Roberto.  I have to go along with them regarding Roberto.  I'm sure I'd hate Roberto if I had to spend jail time with him.  Hell, I hate him and I only had to put up with him during a 96-minute movie.  But back to the movie, the three men's hunger for a good breakfast (You thought I was going say freedom.) move them to work together and escape.  They escape into a Louisiana bayou.  Their escape is followed by a slow slog through the bayou.  God is it slow!  (This the second slow bayou movie I didn't like this year.  See my review of `Eve's Bayou.')  The three end up at the home of an Italian woman who `adopts' Roberto in a weird, Oedipal sort of way.  Roberto stays with her.  Zach and Jack hit the road. The rest of the movie aside, there is one directional devise used by Jarmusch that I liked.  There are scene changes that occur without completing the thought.  It's like a conversation with someone you know real well.  This one clever directorial tool excepted, I can not recommend `Down By Law.'",
            "review_date": "2000-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "As good as it gets.",
            "content": "This finest Jarmusch film made in my opinion. Intentional, lyrical, funny. Perfectly cast, excellent soundtrack. A seeming precursor for Benigni's performance in, 'Life is Beautiful'.It came out around the same time as 'Rain Dogs' and it was a real pleasure seeing Waits in this film, and hearing 'Jockey full of Bourbon', as a selection for the soundtrack.",
            "review_date": "2020-08-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Timeless Masterpiece of Cinema Genius..",
            "content": "Seeing this film in the 80's changed so much for my future viewing tastes & not only influenced me musically falling in love w Tom Waits genius but introduced me to the brilliance of Jarmusch, Italian 80's Cinema w the funniest man in Italy & forced me to go check out New Orleans when I was old enough to buy a plane ticket, and that town Rocked in the '80's & 90's & I wouldn't have been there without the Down By Law film to point me in that direction. Thank you Mr Jim Jarmusch.",
            "review_date": "2018-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very boring and incredibly slow-moving",
            "content": "Most viewers seem to be enthralled by this film, but I just don't get it. The picture is incredibly slow-moving and the whole story is pretty boring. I thought those scenes in the jail would never end. This film needs a lot more action and a lot more character development. Nothing much ever seems to happen in the movie, and much of the dialog is muddy and very hard to make out. The actors just seem plain bored and going through the motions. The viewer never seems to figure out exactly how these men manage to escape, it just mysteriously happens. They just happen to stumble upon a lady with a house and plenty of food for all, who speaks fluent Italian. Give me a break! This film is a pathetic fantasy and has nothing at all to do with reality or any meaningful commentary on the human condition. It is vastly over-rated. I hope this film is not in any way representative of the typical independent films that are being shown and honored every year at Sundance. If so, I am happy to stay away.",
            "review_date": "2007-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Soulful study in E-Minor",
            "content": "What is cool? Is it defined by the clothes on your back, the shades on your face, the records you own, or the way you walk? On his brilliant 1985 album 'Rain Dogs', actor-musician Tom Waits rasps about \"walking Spanish down the hall\" and it's probably as good as any definition of this chimerical, near-unclassifiable status.Cool is a state of mind, but cool is also a commodity: when Jim Jarmusch's Down By Law was first released in 1986 the UK was undergoing another one of its periodic flirtations with the jazz and beat ethos. During a decade in which surface was all, but indolence considered a mortal sin, aspiring to cool - the received version at least, filtered through 1950s American iconography - seemed at once the most conservative and subversive reaction imaginable.Soon, the charts shimmied with diluted syncopation; the sounds of Chet Baker and Miles Davis snaked from street cafés; and every other beer commercial seemed to feature a young white guy being taught to play the sax by some sage old black dude in a smoky basement dive. In such an era, Jarmusch tipping his hat to film noir, pulp fiction and bebop was guaranteed to make an impact.As with the director's 1984 debut Stranger Than Paradise, this is a monochrome comedy about a bunch of losers. And, this being Jarmusch, style and attitude - and no small degree of heart - are to the fore. Down By Law's determined losers - jobless DJ Zack (Waits), framed pimp Jack (the jazz musician and actor Lurie) and befuddled tourist Roberto (comedian Benigni, then a virtual unknown outside his native Italy but the best thing here by miles) wind up sharing the same cell in the Louisiana bayou.Zack and Jack hate each other, but reserve most of their spleen for Roberto because he's so infuriatingly cheerful; he's not cool. Then they escape - we never find out how - they learn to depend on one other, and eventually go their separate ways.Like Tarantino, Jarmusch comes from a generation of US independent filmmakers whose aesthetic is informed by the video age; in this instance, old prison-break movies. Down By Law is a highly original homage to that genre, enlivened with the director's characteristic quirks: long takes, world-weary humour, and a superb score from Lurie and Waits, whose 'Rain Dogs' tracks 'Jockey Full Of Bourbon' and 'Tango Till They're Sore' bookend the film.One more thing; Jarmusch is generally considered one of the coolest directors there is. But as evinced by Down by Law and his later output, it's always the self-consciously coolest characters who wind up looking stupid while the 'straights' save the day. Being not cool is cool. That's what it is.",
            "review_date": "2009-11-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Coooooooolllllll",
            "content": "This is very very very cool. Just cant get enough cool's here. Story is bit thin but its the three central characters who make this a gem of a movie. Their chemistry, their nature their behavior all is so beautifully written that u enjoy each and every scene. Bengini wins here as top performer but the rest two guys were also top notch. This movie is a cool breeze, a cool beer, a great hans zimmer soundtrack, an awesome AR Rehman music, its equal to every feel good thing you u ever saw heard or experienced. Watch it with a beer , that will set the mood quite right here. Go for it people. Wohooo",
            "review_date": "2019-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Film",
            "content": "Altogether I think that the film, \"Down By Law\" (1986) by Jim Jarmusch featuring Tom Waits, is one of cinema's finest noir pieces, an obvious montage through the arts of it's time period, but held together at it's essence, which is the perceived voyeur's agreements with the sometimes awkwardly staggered and dragging exaggerations made by the true minds of the film. This context within context is somewhat familiar to the actors and writers whose hand at the work is seen like a stark author's stencil's dark shading on the texture of the characters at work in the movie. The exemplary effort given by the both the entire teams of the production and writing seem to fit seamlessly as though the stages were set and the actions seemed to flow out of the actors through the piece in the easiest, while at the same time, most mind-blowing orchestration through which the music plays on the rhythm of the story, and viewer. Great early attempt by Jim Jarmusch in film-making, and a true classic. Special recognition, definitely, for Roberto Benigni who was truly fun.",
            "review_date": "2015-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jarmusch, Waits & Benigni: aces of spades!",
            "content": "Good news #1: \"Down by law\" begins with a song from the most notorious loser of the popular music, Mr. Tom Waits. And not only because the owner of the drunk piano plays one of the main roles of the film, but also because the first sequences of the movie take place in New Orleans, a city full of hookers, pimps, and small time drug dealers, and Tom knows a thing or two about them.Good news #2: In \"Down by law\" we find the craziest Italian ever in the history of cinema, Mr. Robert Benigni. He speaks the most makeshift English I've ever heard... Just hilarious. It he does not make you laugh,m well, you gotta be dead!! Some say this is independent cinema, underground cinema... Well, I think it's just good cinema. And Jarmusch can be a pain in the neck sometimes, but movies such as \"DBL\" probe that he's so talented.*My rate: 8/10",
            "review_date": "2006-08-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An introspective, quiet, early classic from Jarmusch!",
            "content": "Jim Jarmusch's work can be either intimidating or off-putting, and in equal measure, to cinephiles because it feels so relaxed--almost as if it was a spur-of-the-moment, off-the-cuff precursor of reality-TV, an inside-joke with everyone involved slipping a nod and a wink, as if on a drunken dare, a mickey of JD passed back and forth along with a pack of Marlboros. This brought to mind many good memories of one of the oddest residents of The Criterion Collection: 'Fishing with John' (an exemplary and hilarious six-part mini-series in which John Lurie goes on fishing expeditions with five American cinematic greats, his partners-in-crime here, Jarmusch and Tom Waits amongst them; one that I'd love to see both get a blu upgrade as well as more episodes, now 25 years later). Also, clearly Jarmusch had a fine rapport with his actors, for this is by far the best and most restrained work I have ever seen from Roberto Benigni.One of Jarmusch's more atypical films, 'Ghost Dog: The Way of the Samurai', is still my personal favourite, but this is right up there alongside. It would also make an intriguing double-bill with Jeff Nichols' stellar, though more serious in tone, recent film, 'Mud'.",
            "review_date": "2016-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Comedy Masterpiece",
            "content": "I recently saw a 35mm print of \"Down By Law\" for the first time and really had no idea what to expect but as an admirer of independent film I was curious. Needless to say \"Down By Law\" almost single-handedly defines independent cinema with its seedy characters and willingness to push the boundaries of conventional filmmaking. Zack (Tom Waits) is a disc jockey who can't seem to keep a job and spends most of his time in an alcohol induced stupor. Ellen Barkin is memorable in a small role as Zack's long-suffering girlfriend. It's sad Barkin didn't get more opportunities in her film career. Jack (John Lurie) is a pimp who's fond of saying that he knows how to treat his girls and in one scene Jarmusch gives us a prolonged shot of Jack as seen from the perspective of a naked, outstretched prostitute. Obviously neither of these two ne'er do wells is destined to amount to much of anything so as fate would have it they end up sharing a prison cell where they argue incessantly. When an Italian tourist (Roberto Benigni) joins the two they learn that he too is a victim of bizarre circumstances. Benigni does a great job and practically owns the film from that point on. It's a great comedy performance. After this it's easy to see Benigni scaling the seats at the 1998 Oscars after winning for \"Life Is Beautiful\". Eventually there's an escape and the 3 convicts must dodge police trackers through the Louisiana bayou. Robby Muller's black and white camera-work adroitly creates a dark, surreal atmosphere. The Tom Waits songs are great and he and John Lurie play off each other beautifully. This is a great little work of cinema art by Jim Jarmusch. A must-see.",
            "review_date": "2013-03-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rated No As High- 7.8",
            "content": "To me, this film is not one of Jim's best, e.g. Stranger than Paradise, Mystery Train, Dead Man, etc.\nThe film started well with excellent cinematography by Robby Muller and great accompanying music by John Lurie.\nThe introductions of the down and out DJ and the pimp were good as well.\nThe problems started with the meeting up with the Italian in the prison cell which changed the whole dynamic and structure of the film.\nIt became kind of 3 Stooges like while the main focus was on the Italian while both the DJ and the pimp seemed to have lost their personalities.\nIt is alright not showing how they escaped, but 3 escapees ended up in a shack in the wilderness with an attractive Italian woman and all cleaned up for some wine and dine and dancing? Ending with the 2 escapees went separate ways in the morning?\nThe film started as a gritty black comedy and midway through turned into a sentimental slapstick comedy.\nNot what I would have expected from this well regarded filmmaker.",
            "review_date": "2021-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yeah, it's a sad and beautiful world buddy.",
            "content": "Down by Law initially oozes atmosphere. Robby Müller captures the grime and shabbiness of New Orleans with a crispness and exoticism. The sky is at its blackest, but he has assembled lights that cast long, lean shadows that go beyond the reach of the tiny lamps that line the roads. The characters wear pure white or the darkest black. The score is heavily percussive, with a mischievous bass line, and a snazzy, rhythmic brass. It is almost like a jungle beat; Jarmusch has made the suburban setting tropical, with the slight sheen of sweat on the foreheads, and a slight humid breeze that sweeps through the lonely streets. Half of its inhabitants are surly, shady figures that flit from corner to corner (with half of those police). Zack sits drunkenly at the back door of some half empty bar, and croons: \"It's a sad and beautiful world...\". And that it is. Later, he makes his call to no one in particular, and swigs vigorously from his bottle.The main characters have no further aspirations beyond the fuzzy boundaries of this town, but they do not care. Jarmusch creates a prison where it is easy to fall into a comfortable lull, blowing money, having fun, f*cking up today and caring little about tomorrow. The metaphorical cell door could be left wide open, but Zack and Jack would not try to walk through it. Yet they also do not fully succumb to the pressures of the evils that beckon them. Abuse is not only suggested but sent as an open invitation. A teary girlfriend screams at Zack to hit him, but he relents. Jack's only loyal girl philosophises that if he were a true pimp, he would discipline her by beating her. Women are meant to be commodities in this world; see the seller of the goods, heavyset and with a slight lisp, stumble into the room with an offering of peace and goodwill. Is the little girl in on it? Either way, it's a scummy move in a scummy town. But inevitably it switches from a neo-noir into a buddy film. Historically these are usually duos, but it applies here too, only because Waits and Lurie are all but the same person (even their names don't hide much). They are played against Roberto Benigni, who channels his inner clown and hammy Italian accent to stick out like a sore thumb. The film's revelations rest on Bob's philosophising, which in itself only just leans on the fetishisation of the simple truths told through his broken English. At times it reaches almost infantile heights of glee and careless abandon, as the trio lead the whole cell block into a chant for ice cream. Benigni nevertheless grows on you. He makes a manslaughter charge into a stand-up routine, and his accent does the rest, pleading for his innocence: \"Very good ball. Dead. Very big man.\" And when he provides sustenance for the quarrelling little boys, he makes the simple act of cooking a rabbit into a touching journey into the past, and re-affirms his father figure status and the nature of his care.A pity, then, that the twins are still at each other's throats by the end of the film. They float on the Louisiana bayou, the camera gliding along with them, and the journey is meant to turn inward, to promote spiritual growth and drive. But the outer is not matched by the inner; whether they are floating along or stuck in the mud, and they are still static in their personalities. Jack and Zack are withdrawn at the beginning, and barely much more by the end. The redemption is merely implied in the closing shot, nothing more than simple symbolism. And does Bob deserve that fairytale ending, stumbling across the quaint cottage in the middle of the woods with a Italian counterpart of his own? There must be something more than just skin deep here.",
            "review_date": "2016-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Soulful study in E Minor",
            "content": "What is cool? Is it defined by the clothes on your back, the shades on your face, the records you own, or the way you walk? On his brilliant 1985 album 'Rain Dogs', actor-musician Tom Waits rasps about \"walking Spanish down the hall\" and it's probably as good as any definition of this chimerical, near-unclassifiable status.Cool is a state of mind, but cool is also a commodity: when Jim Jarmusch's Down By Law was first released in 1986 the UK was undergoing another one of its periodic flirtations with the jazz and beat ethos. During a decade in which surface was all, but indolence considered a mortal sin, aspiring to cool - the received version at least, filtered through 1950s American iconography - seemed at once the most conservative and subversive reaction imaginable.Soon, the charts shimmied with diluted syncopation; the sounds of Chet Baker and Miles Davis snaked from street cafés; and every other beer commercial seemed to feature a young white guy being taught to play the sax by some sage old black dude in a smoky basement dive. In such an era, Jarmusch tipping his hat to film noir, pulp fiction and bebop was guaranteed to make an impact.As with the director's 1984 debut Stranger Than Paradise, this is a monochrome comedy about a bunch of losers. And, this being Jarmusch, style and attitude - and no small degree of heart - are to the fore. Down By Law's determined losers - jobless DJ Zack (Waits), framed pimp Jack (the jazz musician and actor Lurie) and befuddled tourist Roberto (comedian Benigni, then a virtual unknown outside his native Italy but the best thing here by miles) wind up sharing the same cell in the Louisiana bayou.Zack and Jack hate each other, but reserve most of their spleen for Roberto because he's so infuriatingly cheerful; he's not cool. Then they escape - we never find out how - they learn to depend on one other, and eventually go their separate ways.Like Tarantino, Jarmusch comes from a generation of US independent filmmakers whose aesthetic is informed by the video age; in this instance, old prison-break movies. Down By Law is a highly original homage to that genre, enlivened with the director's characteristic quirks: long takes, world-weary humour, and a superb score from Lurie and Waits, whose 'Rain Dogs' tracks 'Jockey Full Of Bourbon' and 'Tango Till They're Sore' bookend the film.One more thing; Jarmusch is generally considered one of the coolest directors there is. But as evinced by Down by Law and his later output, it's always the self-consciously coolest characters who wind up looking stupid while the 'straights' save the day. Being not cool is cool. That's what it is.",
            "review_date": "2010-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Somewhat interesting, saved by Roberto",
            "content": "Down by Law, Jim Jarmusch's 1986 film has a premise that has been used by countless filmmakers: Guys who should never be friends end up in prison together, try to make a break for it, and end up as better people. The atmosphere is this film works; one can feel the foggy Louisiana bayou creeping up around them as these characters slog their way around.  The problem is the acting; better, that Tom Waits and John Lurie, while doing an admirable job, are not natural actors, but musicians.  It is Roberto Benigni, who many now recognize as a tremendous talent, who saves this film. In this, his first English-language performance, his character (aptly named Roberto) is charming, witty, and valiantly puts comradeship and friendship above all else.  Benigni and the great Louisiana locations are the best reason to see this film.",
            "review_date": "1999-08-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waits meets Jarmusch",
            "content": "I am thirty years late on this film as I am reading a biography of Tom Waits by a British music journalist, Barney Hoskyns, \"Low Side of the Road.\" Writer-director Jim Jarmusch is well known for low budget, oddball movies, and this one surely fits the bill. Zack (Tom Waits} is a wandering DJ who by a bad decision winds up in jail. Jack (John Lurie) is a small time pimp who also ends up in the clink with Zack. Inmate number three is Roberto (Roberto Benigni) who is there under mysterious circumstances. The black and white imagery provides the feel of a Tom Waits song, and Jarmusch uses two of Wait's tunes, one at the opening credits and the second at the closing credits. In between, the three prisoners plot an escape and from jail then the adventures begin. The chemistry between the boys is magical and I believe that the Coen brothers were heavily influenced by this film when making \"O Brother, Where Art Thou? with George Clooney. Benigni later won an Oscar for \"Life is Beautiful\" and I recommend \"The Imaginarium of Dr. Parnassus\" where Waits plays the devil and he is cast perfectly. It is amazing what a good filmmaker can do with a low budget, and Jarmusch certainly succeeded with Down by Law.",
            "review_date": "2017-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "3 men end up in a prison cell. And then they escape.",
            "content": "This movie is a story about how 3 men meet in a prison cell. Their escape, and their evolving relationship. Cast in the swamps of Louisiana, in black and white. It has a slow and underplayed mood to it, which is a delight to watch. When the movie came out in 1986, it stood out as different and daring. It attempts to tell a simple story, while giving room for the viewer to enjoy the mood of events unfolding. It doesn't use cheap Hollywood tricks to lure us into a desire to want more. No. It simply tells the story about how 3 men meet, and part. In a calm and honest way. I was crazy about the movie when it first came out, because it was so different from everything else I had seen. It's tempo was slow, and that was unusual for an American movie. But today this sense of calm narrating has become common in movies. See the movie as a meditation. It's simple plot allows the director (Jim Jarmush) to focus wholeheartedly on the human aspect of the story. It is one of the best movies of it's own time. I highly recommend it to everyone who likes the subtle aspects of human life. (PS: I haven't even told you about the music made by Lurie and Waits. It's topclass)",
            "review_date": "2016-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very existential.",
            "content": "Border Radio is an atypical road movie that has its light moments but, for me, just isn't compelling enough to sustain interest, even over its relatively short running time of 87 minutes. In it, some missing royalties monies has gone missing, as has the lead singer of a rock band. Soon the record company, the other band members, and the singer's wife are all looking for him, with varying degrees of intensity. Which all makes this more of a slice of life than anything else, although at least the story is told linearly. It has the feel of a movie that was shot on a meager budget, depending mostly on atmosphere and tone and the formidable acting of some relatively new faces to the thespian scene. Among these is Luanna Anders, the wife in question, bringing a heck of a lot more depth and sincerity to her role than one might expect. Lending fine support are John Doe and Chris Shearer as the missing man's bandmates. Alison Anders' directorial debut is intriguing, just not too remarkable. For more understated, no-frills drama, check out Jim Jarmusch's Down by Law.",
            "review_date": "2019-07-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful, atmospheric and with great humour",
            "content": "I watched this film by complete chance, not knowing anything about it (just needed to choose a film to see with a friend). It's not a roller coaster sort of film, but it has many charms. Really beautifully filmed, and has some absolute gems of dead-pan humor.In fact, I liked it so much, that I broke my oath not to buy any more DVDs, and got me into other early Jarmusch films.Granted, the beginning is very slow and the plot is quite unusual - and that may put off some. That said, the very slow open scenes have some amazing shots, and some really good music. Begnini does a great job with the language jokes, and Tom Waits and John Lurie also bring their characters to life.All in all, a really good film. Definitely worth watching.",
            "review_date": "2010-09-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Somewhere in time.",
            "content": "In stead of telling everyone how brilliant, unique, timeless and funny this Jarmusch film- and storytelling stroke of genius is, I feel like giving those who hate it and think it's a boring waste of time a lesson.\nYou, who rate Down By Law 1 or 2, and even bother to review it, why do you actually try to watch a Jim Jarmusch film? Not funny, or enough violent action for you? There's even a car chase and a scene with police and guns.\nI don't think you are intelligent enough to have any idea of what this is about, and you don't have enough psychological dept or sense of understatement humor, if any. Oh, how boring it must be. I neither can or like to imagine how it feels or that you ever liked Tom Waits' music. Someone should have told this isn't for your kind or any other person who fancy shallow action movies and false bodyparts.\nYou see, this is art - not artificial. Please, stay away and go back to Baywatchland and enjoy yourself there.",
            "review_date": "2019-09-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Moody 80's Dramedy",
            "content": "I've wanted to see this movie for centuries after catching a snippet on cable years ago. Beautifully filmed in black and white. Seems like a moody dramatic film, and then Roberto Benigni lands in the same cell as two other guys and it almost becomes a comedic showcase for his character.Benigni's character knows little English, and him trying to not confuse his cellmates, Jack and Zack, all while attempting to ask for a cigarette when he has the hiccups, had me in giggles.The movie meanders along without much momentum, and it's probably made for film freaks such as myself more so than the general public.",
            "review_date": "2019-04-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful, Splendid",
            "content": "Jarmusch makes films about people.This is, to my taste, his best film. If you like people and you like watching people, you will enjoy this film. Jarmusch shows us some strange but interesting people, and these characters are delightfully strange and interesting -- but, importantly, these people are believable and accessible. These people are of the kind ground down by the world and their own poor choices. For a moment, a wonderful moment we witness, they are given a new lease on life and new hope for a better time, a better life. How do they deal with this grind of the world? With anger, ennui, humor and hope. Together, the cast is perfect. Perfectly cast, perfectly expressive, perfectly reactive to the world they inhabit.No fantastic chase scenes, no over-the-top explosions or CGI, no overdone melodrama. Perfectly tuned actors playing subtle notes. Like \"The Remains of the Day\" this film can quietly move you. Unlike that film, this one can finally lift you up as well. Wonderfully cast, wonderfully scored with just the right music, wonderfully filmed in black and white, this is an excellent movie of any kind. Of its own particular type, it is superb.",
            "review_date": "2011-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Down By Law - 83",
            "content": "An incredibly unique and peculiar film, the atmosphere that Jarmusch manages to create is awfully dense and original, unlike anything I've seen. Melancholic, comic, philosophical, simple, and extremely beautiful and striking in its simplicity, a stripped-down but interesting story with brilliant characters that are perfectly portrayed by a fantastic ensemble of actors. With both Tom Waits and Roberto Benigni being wonderfully pleasing, but one must not forget John Laurie who's character - not very likeable, and thus performed very well.\nIt focuses only on what it wants to convey and other medias is not important, the film is surprising in its ability to surprise the viewer with an unusual satisfaction they did not expect. A minimalistic fairytale with its roots in the life affirmative mindset.",
            "review_date": "2020-07-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another \"dolce vita\"",
            "content": "Once in a while, not too often, this is the type of movie I really enjoy. Just go with the flow without great expectation and yet get rewarded.\nI'm not a movie buff but enjoy most of them most of the time. Don't know much about producer etc. , just happy with good actors and often well known actors. Yes not the Dolce Vita or Beautiful Life (I thought our Italian friend was that guy. Don't raise your eyebrow but yes I thought it was...) The whole thing is quite 'zanny' Shot in black and white is unusual I imagin in colour would have work too. If you simply take it as it is, you too may enjoy the experience",
            "review_date": "2020-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "pretentious claptrap",
            "content": "This had a good start, atmospheric shots of Louisiana with decent music, then for me it went downhill fast. The actors delivery was in a staccato mannered way which made me wonder if they were reading it from hand held cards. A lot of long lingering shots of rubbish strewn streets with no one about. Okay I saw it on TV so it is possible it was edited but let's be honest, there was little plot, nothing explained, things just happened. It ended up going nowhere at all. Unsatisfactory pretentious tripe masquerading as art, how it got such high scores is beyond me.",
            "review_date": "2019-09-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "silly, intelligent, laughable and endearing",
            "content": "What I really enjoy about \"Down by Law\" is not the fact that it is a road movie, nor that the characters suffer a rite of passage through their imprisonment and subsequent flight, nor any of the other characteristics mentioned by other users; it is in how the film presents human life and human relationships as a series of misunderstandings, coincidences, accidents and miracles.The three protagonists are tramps. Two of them think they are cool and smart, and yet they are so stupid and naive that at the same time they become delightful and memorable characters. Roberto lights up the screen in a Chaplin-like manner.As a whole, the picture leaves the viewer with a feeling of intelligent delight in a completely non-hollywood-esque style --with no closed ending, a rhythm of its own, tender but never kitsch, sordid and intimate, yet inspiring and deliriously funny. \"Down by Law\" is the filmed proof that silly characters plus comedy (in the classic sense of the word) do not necessarily result in vulgar humor. I believe it's one of a kind.",
            "review_date": "2002-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the very best indie movies you've never seen",
            "content": "Between filmmaker Jim Jarmusch's shot composition, and especially Robby Müller's cinematography, the aspect to most immediately get one's attention here are the fundamental visuals. Anyone can film in black and white, but not everyone can manifest a sense of such astonishing artistry; one is readily reminded of classic movies of many years prior, not just because of the basic Look but emphatically the very Feel of the imagery before us, and even the pacing of the plot development. It takes a while to sufficiently get over that initial dazzle such that we can just take it in stride, which might well be on purpose (or if not, certainly very serendipitous), because this takes awhile to really begin to achieve its best value. Where the first act is fine exposition, the subsequent meeting of Zack and Jack primes the feature for the insertion of Roberto into the mix, which is when 'Down by law' really takes off. This is a title that takes its own good time, and that's fine by me, because our patience is worth the reward.Setting aside the wonderfully gorgeous visuals, the dynamics between the three central characters are delightful. Two alone wouldn't be enough; it takes the nuanced personalities of Zack, Jack, and Roberto together to really make the difference. The conflicting surliness of the Americans, juxtaposed with the bubbly good humor of the Italian, makes for delicious wry humor that's an utter joy, somehow made all the better by the sharp imagery. And I can't emphasize strongly enough that I can't imagine anyone else in these parts; Tom Waits, John Lurie, and Roberto Benigni infuse such fabulous personality into their characters that it feels hard to separate part and player. All their performances come off as gratifyingly natural and believable - though I'd be lying if I said Benigni didn't steal the show with the mildly aloof aura he lends to his role. Factor in scene writing and dialogue that's at once cheeky, clever, and smart, and a definite but loose narrative, and we have all the ingredients necessary for a scrumptious feature.I also deeply appreciate that Jarmusch wholly avoids those elements of any similar fare that by this point seem conventional. 'Down by law' focuses squarely on the characters, and the interactions between them, to the point that we don't even know exactly what the escape entailed. And we don't need to: the picture can claim an unexpected cutting brilliance exactly as it appears, warming the cockles of even the most cold, dead heart with the exquisite blend of genuinely perfect visuals and glib, intelligent writing. This tale of three men and their prison break feels quite unlike any comparable fare; Jarmusch, Müller, and the cast and crew have totally knocked this one out of the park. Though the feature takes a tiny bit to really get moving, the wait is more than worth it, for the result is entertaining and rewarding on a level I never would have anticipated sights unseen. I don't even know what else to say without betraying details - all I can say is that this is fantastically fun, all but a must-see for one and all. 'Down by law' is surely one of the best indie movies you've never seen, and it demands far more recognition; my highest recommendation!",
            "review_date": "2022-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful cinematography",
            "content": "The biggest highlight in Down by Law for me was its gorgeous black and white cinematography, especially in the forests towards the end. That was just stunning, and worth the price of admission. I liked the concept as well, which had a couple of guys each falsely imprisoned in New Orleans (Tom Waits and Jack Lurie) becoming cellmates, growing to dislike one another, but who are brought together by a third man (Roberto Begigni). Isn't it true that in social situations there is often a person who can serve as \"glue\" between others to make it work? And conversely, if they're not there, how things will drift apart? Anyway, I liked how Begigni's character was cheerful but not saccharine, and Waits and Lurie are also strong in their downbeat performances. This is quite a mood piece and left an impression, even if I wished it had done a little more with its 107 minutes.Was this a grand metaphor for life, how random events throw people together, through adversity they bond and have some laughs, and then inevitably they're back on their own paths? For example, could you replace the prison with a college dorm room and escape with graduation, or any of countless other examples in the phases of one's life? Hell if I know. I love how the Jarmusch dared to be different here, not giving us anything of the standard tropes over the three parts of the film (wrong man / prison / breakout). What stopped me from truly loving this overall, however, was just how much he dialed it back. Scenes with banal action are too elongated, the dialogue is too simple, and there is an overall feeling of aimlessness here. Maybe this is indeed like life, but as entertainment or an art form, it felt a little lacking. Watch it for the cinematography, character performances, and mood though.",
            "review_date": "2022-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Comedy in the awkward silences",
            "content": "Like all of JJ's films, I've always found the comedy to be lurking in the the awkward silences. That's what makes it totally unique.When you add Tom Waits and Roberto to a style which Lurie clearly has mastered you have Jarmsuch's finest films and one of the best films of the 80's.",
            "review_date": "2021-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Slow, moody, but funny too.",
            "content": "You have to be in a particular mood to watch this kind of movie: it is slow and moody, though not in an oppressive way, because it is a comedy. Which may explain why it took me 35 years to re-visit it. The first time was when I was a teenager. And based on THAT I had ranked it in my top 100 movies list 25 years later, which was a bold decision to make, considering how much lower my criteria was back then, when I was very young and relatively clueless.The film starts slow, too slow, but improves with each new section. Character development is both clever and fun, and the dialog also improves after the mediocre start.I'm not a fan of that introductory segment. The black actress neither looks nor talks like a prostitute, and her conversation with Lurie is dull and meaningless, its only use being to tell us that he's a pimp (which can anyway be achieved in a different way). The weird \"actor\" (or whatever he is) that arrives to set up Lurie can't act, and is dull too. His babbles too much, gets too much screen time, in a scene that should have been brief.Worse though is the homely Ellen Barkin smashing up all of Tom's records, yet Waits never protesting even a bit; this was very far-fetched. A man that \"chill\" would have not brawled with Lurie on two separate occasions, over nothing - regardless of how stressful prison and the subsequent escape were for him: if Waits was cool enough to watch Ellen smash up his LP collection, then he should have been calm enough in practically every other situation that followed. Is there one man in this entire world who'd just sit there, looking bored, while someone smashes their LP collection? Perhaps in a parallel world, just maybe.The scene in which the corrupt (?) cop comforts (or grooms?) the 9 year-old girl also seems out of place, unnecessary, and badly acted/scripted. It's as if the entire film was filmed in sequence, and Jarmusch gradually improved as he went along. Comparing the early parts of the movie with the last third, one might even suspect that the early scenes were filmed a year or two earlier.Things pick up in the prison, despite the pace slowing down even more, ironically. Slower, yes, but now we have two framed guys trying to fight boredom and depression i.e. We finally have a story, something concrete. The fact that Lee Marvin Jarmusch could get away with such leisurely pacing - in a one-setting prison cell type of situation - is worthy of respect, because in the hands of most other (name) directors these scenes would have been dull as hell. When Benigni joins the two the movie gets a further life-injection - only to be topped by the escape-and-fugitives section which is visually interesting, very-well conceived and shot.Nevertheless, if I was to nitpick, which I enjoy doing, I don't quite understand how the trio survives so long without water. Running for hours on end in a swampy environment would require lots of it. Or did Jarmusch, who probably knew next to nothing about swamps and survival, actually believe that they could drink that filthy muck without getting immediately ill? Even if there was a small fresh-water supply there they wouldn't have had the time to search for it: they were on the run.Also illogical is the decision of Jack and Zack to split from Benigni, just as he got them some food. The motive for it was weak indeed: a petty fight. Minutes later Jack says he is starving. Clearly, Jarmusch had never gone properly hungry in his entire life, otherwise he'd know that never in a million years would Jack have volunteered to abandon that rabbit which Benigni had caught. Ditto Zack. I know this is a stylized comedy, and such movies are allowed to have their own logic, but only up to a certain degree. After all, Jarmusch isn't the Quay Brothers: his movies are essentially based in reality, despite everything.How did Benigni cook the rabbit? Earlier on we were told lighters and matches were not allowed in jail-cells. Even if they had a few when they had escaped, they would have been drenched and ruined by the water. There is no way in hell Benigni could have created that fire out of nowhere, like magic, in a swamp of all places. But again, Jarmusch is probably a 100% \"city boy\" hence hasn't a clue about these basic things. In fact, I am a city boy too, yet I somehow know that to make a fire in a humid swamp is next to impossible without a lighter.Nevermind that Benigni managed to catch a rabbit in the first place; that in itself is fairly far-fetched. Or maybe Jarmusch actually believes (or used to believe) that in a hostile wild environment food is there for the taking? Like in a supermarket. Ah, you gotta love these city types who'd never being in a non-urban setting for longer than 5 minutes... No wonder American city folk are so liberal i.e. Out of touch with reality and the rural types are more conservative i.e. More in tune with what's really going on.But these are only minor points. This isn't a Discovery Channel survival program.I like the subtle humour in some of these early Jarmusch films. For example, upon reaching an Italian diner, the three escapees listen to the story of Benigni's new girlfriend (which in itself is absurdly amusing), which creates a strange and amusing situation whereby Zack and Jack, completely exhausted and hungry - yet exhilarated in a subdued way by this positive outcome - have to pretend (a bit, at least) that they give a hoot about her stories. Then that ridiculous scene in which the Italian couple kiss over the table: definitely an indie comedy. In fact DBL is a sort of blueprint how you make (or made) 90s indie comedies. This may be an 80s indie film but it's the 90s when these kinds of films became much more common.Jarmusch would later make his best film, \"Dead Man\", and a few other decent ones, but after that Depp western his output took a nosedive; he became pretentious and lazy, and the worst of it is that his movies were no longer funny, but boring instead. Slow-paced yet boring, and far less stylish.",
            "review_date": "2023-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tom Waits rules ok.",
            "content": "If you believe that the devil incarnate is a cross between Richard Nixon and Billy Rae Cirus, then logic states Tom Waits is christ reborn.  For this weird looking, weird soundin tunesmith is in fact a terrific actor.\nIn by far and a way his most impressive role (he looks bored in Mystery Men, for example) Waits plays a free style jiving DJ, locked in a cell with an Italian lunatic and a middle American egomaniac (played brilliantly and adequately by Roberto Benigni and John Lurie respectively).\nLike all of Jim Jarmusch's movies, it is part dream, part nonsensical comedy.  It doesn't entirely make sense.  There is not a linear narrative per se.  Big gaps are left for you to use your imagination. Suffice to say, the dream is part nightmare, part epiphany, part prophecy.Most people won't watch this movie, just as most people will never hear a Tom Waits record.  No great shame, as the rest of us know that in Tom Waits we are in the presence of genius, and in Down By Law the genius is harnassed by a director of no little talent.  Down By Law is, to use the beautiful parlance of boxing, pound for pound the greatest movie ever made.",
            "review_date": "2003-05-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "overindied",
            "content": "Jim Jarmusch seems to have his own devoted little following, and I can appreciate that.  And really, I liked Dead Man a lot.  The sparse action/dialogue created a really interesting atmosphere that fit well with the subject matter. Really, an innovative movie.  But Down By Law, using the same techniques (which are less appropriate here), feels boring, flat, student-filmy. There's no reason this movie should be so long.  Really broad acting does not go well with long pauses between lines.Benigni is fun, as always.  He's the only thing worthwhile, to me, and he isn't in it for very long.  What was Jim's aim here?  I don't know.  It's painfully slow, not bad bad, but I wouldn't recommend it.",
            "review_date": "2004-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jarmusch's lightning in a bottle moment",
            "content": "I've always had mixed feelings about Jarmusch, but somehow never seen this, one of his greatest successes. Now it's one of my favourite movies. I saw it last night and I'm already looking forward to a second viewing.Why did it never come together to quite this extent again? A lot of it must be down to the actors, who are perfect, especially Waits and Benigni. But also the story gives them just enough to do, plus the settings and camera work are gorgeous.",
            "review_date": "2021-08-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A must-see Roberto Benigni film!",
            "content": "If you like the way Roberto Benigni speaks english with his terrible italian accent, you should see this one.Excellent performances from Tom Waits and John Lurie too. Not much action - not at all, in fact - but a lot to see.Simple plot, brilliant performance!",
            "review_date": "2003-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "that simple",
            "content": "It's really that simple. Bring good actors together with decent directorship you get a good movie. No need for CGI or even a very interesting story.Zack, Jack and Robertino are three very different people. Zack is a pimp, Jack is an unsuccessful DJ, Robertino is an Italian tourist. Somehow they all end up in jail. The first part of the movie shortly presents the kind of life Jack and Zack are living. Only a very brief scene introduces Robertino. The second part of the film shows them all in the same cell getting to know each other. The last part of the film explains their escape. This is not a comedy movie, but at times it is funny. It's not drama either. Yet, there are times you feel sorry for the characters. Each actor presents a very good portray of his character. Watch it, but don't expect an exciting story. Just watch it. It's beauty is in its simplicity.",
            "review_date": "2004-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of my top five films ever",
            "content": "I watched this film again last night having originally seen it when it came out and again a few times over the years. I still love it and find it endlessly fascinating. One of the other reviews suggests that the first half hour is not very exciting. It may not set my pulse racing but I love the way it slowly engages me. The photography and the sound track and pace all really set up a sense of place and a mood that enables me to understand the characters and their background.Once the three main characters are bought together it seems to me that this provides an good example of three classic archetypes of modern maleness. There is something in all of the characters that struggles for expression. The Roberto Benigni character (Bob) although the least cool is the only one at peace with himself. I often hear women comment that they don't understand men, well watching this film may help.Overall it is one of my favourite films and I could watch it over and over again and still get something new from it. If you like quiet thoughtful character based pieces, this is for you. MT.",
            "review_date": "2011-07-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A great flick with a cool groove",
            "content": "Along with the Cohen Brothers and Richard Linklater, Jarmusch is a master of quirky style.  Also, if you like Tom Waits' music, you'll definitely dig this movie.  It's got steamy concrete and neon noir, witty humor, and above all a hip mood that swings like a Fender tube amp.  Check it out, and then go see Stranger Than Paradise and Mystery Train (where Screamin Jay Hawkins is awesome!).",
            "review_date": "2000-06-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Benigni Shines in Offbeat Prison Break Film",
            "content": "Three rather benign losers from different backgrounds ( a DJ, a pimp, and a tourist) come together in a Louisiana jail and form an awkward alliance to find their way to freedom in this offbeat comedy drama by Jim Jarmusch. Done in typical flat affect Jarmusch style the film opens with the pimp (Jack) and the Dj (Zack) being clearly set up by colluding cops and criminals. The oppressive atmosphere in the cell they share is punctuated by insult and fights. When Roberto joins them he defuses the tension somewhat with his poor ability to communicate in English. Eventually the three manage to escape into the swamp. Stealing a canoe they row in circles before it sinks on them. Lost and isolated they stumble upon a diner in the middle of nowhere. Roberto becomes involved with the owner who also speaks Italian and the other two split up taking separate paths at a desolate fork in the road, free from prison and free from each other, their futures uncertain.In Law, Jarmusch creates a noirish world inhabited by surly, unctuous losers, cops and criminals. Everyone with the exception Roberto seems beyond redemption. He also effectively captures the madness that the tedium of being behind bars engenders.Robby Muller's B&W cinematography is an endless array of strong verticals that creates a claustrophobic atmosphere whether in prison or the wide open spaces of the wilderness. It's muted low contrast contributes mightily to the bleak situation and setting. It is a film that moves slow and in circles however and Jarmusch has to ultimately employ a deus ex machina to avoid the inevitable.Tom Waits and John Lurie are typical Jarmusch protagonists, marginal deadbeats with indifferent outlooks and their street pride wears thin early before the charismatic Roberto played by Roberto Benigni breathes much needed life into the film's pace. He steals the rest of the film but along with the contrived fairy tale ending, Down by Law seems to go nowhere.",
            "review_date": "2007-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What A Great Movie!",
            "content": "The only persons I was familiar with in this movie when I started watching it were Ellen Barkin and Tom Waits (Waits as a singer with a very distinct singing style). I knew from previews that the storyline was about three prison escapees but I never realized that by the end of the film, I would be so totally satisfied in a yarn that had taken me on a fascinating journey through New Orleans. The viewer gets to see the down side of New Orleans and some of the 'countryside' during the movie, but the ending is a work of art. I loved the fact that there was no violence or the usual 'blood-letting', but most importantly, having been filmed in black and white, the film obviously relied on the characters and the story to keep the audiences in their seats. As in any sort of photography, black and white will triumph over color if the subject is exceptional. This is certainly the case here.",
            "review_date": "2006-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Black and white classic of exceptional technique",
            "content": "A black and white glimpse of Louisiana down the Mississippi river introduces a jazzy thriller that turns into a prison movie before becoming a road movie with boat, shack, comic relief, and fork roads. With a penchant for narrative dissolution and thwarted genre-created expectations, this movie anticipates a strand of New Argentine cinema as exemplified by Martín Reijtman's Los guantes mágicos (2003) and Dos disparos (2014).Actors Roberto Benigni, Tom Waits, and John Lurie deliver a superb performance of unlikely friendship between total strangers. The cinematography is as spectacular as the film's minimalism and dialogue. Claire Denis served as assistant director. A must see to appreciate Jarmusch's lasting worldwide impact.",
            "review_date": "2021-03-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Down by rating",
            "content": "Two Americans and an Italian walk into a jail cell. One for killing a man in self defence, one set up for the murder of another, and the third set up for sexual crimes. After forming a begrudging friendship, the trio decide to break prison together, and spend the next half of the film wandering marshes and woodlands, wondering where they are. One is a pimp and another a deadbeat who is careless towards everyone he meets, so they are hard men to enjoy the company of. By chance they stumble upon the house of someone who just happens to be female, beautiful, Italian, single, alone, and very trusting and sympathetic towards criminals on the run. What luck! It is a gritty, slow paced film, and all I can say is thank God for the Italian, whose humorous language difficulties is the only bright bud amongst the moody marshes.",
            "review_date": "2018-07-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The three stooges",
            "content": "Down By Law might just be the definitive independent, low budget art-house flick that defined the movement throughout the 80s and 90s. Folks like Soderbergh, Tarantino, Kevin Smith, and Richard Linklater owe a lot to Jarmusch's farce. The black and white photography is stoic, the acting is self assured, and the story is very bare bones, but never does the film wink or nudge at you to make the viewer notice how cool it is.The film just emanates cool, precisely because it doesn't think so highly of itself. It just wants to tell its story, and leave.Tom Waits helps a lot, but John Lurie is also solid as a pimp/hustler, both serving time in a Louisiana prison after being framed by their contemporaries. Robert Begnini comes in later, to act as a foil between the group, and eventually serves as the inspiration for their escape.While together, the three are resourceful and manage to escape the prison, it is when they separate that they are at their most vulnerable, so the film makes use of a certain sort of vague truth. But I don't think Jarmusch was as concerned with inserting any particularly deep philosophy into this film. He was just telling a simple tale, but what it lacks in intellectual furor, it makes up for in atmosphere and style. And this is one stylish piece of work. It has the structure more of a five act play, so the dialogue and characters are entertaining enough to maintain your interest even when no real action is going on. There are no heart pounding chases through the swamp, no complex escape plan, and no real tragedy. But the low budget stylistics make the film resemble more of a post-modern Marx Brothers escapade than 'The Shawshank Redemption'.The soundtrack says it all, really. Slow beat, jazzy, and cool baby, real cool. If all else, see this movie for one of, if not the, first U.S. performance by Robert Begnini. Before he replaced Peter Sellers in \"The Son of Pink Panther\", he was a great character actor. For this, Jarmusch should also be commended.",
            "review_date": "2013-09-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Intricate filmmaking, a masterpiece",
            "content": "Down by Law is a film that has  mesmerized me for years. The first time I saw it, it sunk into me like the smile from a homeless person. It told me something I should've already known.I've heard people use the word \"quirky\", when drawing comparisons to a Jarmusch character, but, I like the phrase: \"Spot On\". He has captured man's fear within himself, and, the ability to hide that fear. It takes a director of great courage and knowledge of self to pull that one off without boring you.If you're a fan of Joel Schumaucher or James Cameron, this is not the film for you. But if your a fan of people, and, the human condition, the mirror reflects back, 2 hours at a time, and Jarmusch is right behind it.",
            "review_date": "2002-08-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I don't understand...",
            "content": "I don't understand directors that make movies for their own enjoyment. Sure, there are people that hide their mediocrity behind a veneer of intellectuality and praise the obviously bad just to distinguish themselves. Some of these people are called \"critics\" and their follower's syndrome is well illustrated by H.C. Andersen's tale: The Emperor's New Clothes. This movie is really not bad. If we forget the absence of color (why?!!!!) and the hopeless boredom that is a constant through out, it has some interesting moments. There is a reason why famous directors are famous. They actually make movies for people (as in human beings), they are entertaining and often improve your general knowledge. Movies like this... just bad.",
            "review_date": "2007-11-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eat your heart out, Coen Brothers",
            "content": "This jailbreak film makes 'O Brother' seem bloated and cliche-ridden. Down By Law follows the adventures of a pimp, a DJ and an Italian 'good egg' (see the film and understand) as they are incarcerated, bear the tedium of their cell, and finally escape across Louisiana's swamps. A wonderful film, sometimes tough, sometimes hilarious, and with a great ending.",
            "review_date": "2003-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Hilarious, Original, and Unforgettable Film.",
            "content": "***1/2 out of ****I love director Jim Jarmusch because he knows what kinds of films that he wants to make and isn't ever afraid to make a film that only he will like. DOWN BY LAW is a great movie made by a guy who knows what he wants to see when he sees a movie. DOWN BY LAW is a film that may not be realistic or meaningful, but it is a good film. It is a funny and beautiful film.It's about three completely different people, Tom Waits, John Lurie, and Roberto Benigni who wind up sharing the same jail cell. They eventually get used to each other's presence and escape from prison, before getting completely lost in the wilderness.The film is great because it incorporates several different film styles into a completely original story, making it feel like a film like no other. It starts out very much in the vein of a film-noir thriller before slowing down and incorporating dry humor with the charisma of all three leads. Tom Waits is such a strange and unique presence that the film automatically feels different, John Lurie kind of represents the voice of the audience and gives the film a more sane kind of feel, and Roberto Benigni incorporates his wonderful humorous antics into the plot and helps the film move. Combine all this with the kind of beautiful and claustrophobic imagery that one can only dream of, and you have one hell of a great movie.I think what really brings the film to life is it's willingness to be offbeat, but dry at the same time by injecting personality into the minor characters. Even though they all play off of different stereotypes found in classic films, you can still feel how each one fits into what the main characters do. It isn't until the end of the film that the offbeat characters blossom into enjoying each other's company. It doesn't matter if it's believable or not. What matters is that it makes sense. Even though these characters have had a life changing experience together, it won't matter to them until they meet again. Check it out.Rated R for some language and sexual content.",
            "review_date": "2007-09-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "truly one of the pioneering indies",
            "content": "This is my first review because it is my favorite film. My husband and I moved here from japan and saw this movie together on our first week in the states . I have over 500 DVDf films in my collection and am avid watcher of world and US cinema. I keep the Criterion collection of everything if I can. I am a real movie nut. Anyway- this needs to be my first review because it is my favorite film- simple, funny, beautifully shot and brilliantly crafted. The film captures the essence of the other side of New Orleans and the other side of America. it is a funny and kind without being overly sentimental. It is linear, but also other-worldly. It is fantastical, but truly honest. The performances are, like the film, simple but beautiful. Tom Waits is so engaging and lovably cranky. Lurie is level and cool while Begninni delivers a kindness that moves. The black and white world is wholly unique. This is my favorite film!",
            "review_date": "2007-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worth the time",
            "content": "Being the first Jarmusch film I was about to watch, I really didn't know what to expect from 'Down by Law'.As a Roberto Benigni fan, I expected it to be quite amusing. And it was. It had a subtle humour, which worked for me, even though it was in low amount. However, I found out that Tom Waits and John Lurie performed great too. I actually believe that the good chemistry among the actors is what makes this movie enjoyable. Also the cinematography and Jarmusch's direction were very interesting.Perhaps the only drawback of 'Down by Law' is its lack of a true plot. Their escape should be just a little bit more detailed (Jarmusch didn't intend to give us many technical details about it, but I think he should). Of course if he focused only on that, he would ruin it.All in all, this movie contains good acting and some strange climate, which makes it a nice one to watch. However, some may find it boring. I wasn't enthused, but I definitely recommend it to a real cinephile.",
            "review_date": "2013-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nice example of acting from Benigni",
            "content": "This is a strange black and white movie that reminds of some French flicks with long indoor shots and diegetic sounds. The theme is mainly based on character study rather than an escape story. In my opinion, the sub-plot at the beginning of the movie could have continued a little more.Tom Waits and John Lurie perform all right until the moment the legend (Roberto Benigni) jumps in. From that point on, they could not keep pace with Benigni. They could have added some more to portraying wannabe badasses. This is the main drawback of the movie. On the other hand, photography is nice. Don't raise your expectations so much but it is still a good watch due to Roberto Benigni.",
            "review_date": "2022-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best movie ever",
            "content": "This is absolutely my favorite movie. In its own silent, slow and peculiar way its the most hilarious story with weird characters and a somewhat extraordinary plot. The combination makes one giggle silently during the whole movie. \"I scream, you scream, we all scream for ice-cream...\"",
            "review_date": "2002-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Misfits making bad decisions",
            "content": "Really enjoyed the beginning of the film. Not great but did hold my interest. I like tales about the underbelly of society and the unwise misfits that inhabit this underworld. if you like stories about losers who make bad decisions you will like this film.",
            "review_date": "2020-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "After Katrina, the memory of a once-existing city",
            "content": "No doubt all the wood frame structures that exist in the flooded residential streets of New Orleans will be bulldozed over. The scenes in the first 20 minutes of this motion picture depicts some of the gritty residential streets of the city. Now just a memory. With the scenes shown on television of the aftermath of hurricane Katrina to a world-view audience, what came to mind were the characters depicted in the introductory sequences of \"Down By Law\". With all the radio stations and TV stations broadcasting salutatory programs with references to the city's rich musical and historical legacy, I wondered if there was going to be a TV station that was going to have the courage to broadcast this motion picture. But alas, no, it didn't happen. Too bad. It should have.",
            "review_date": "2005-09-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Such an original film",
            "content": "You will never see another film like this one.  Everything is just presented in a way like no other.  If you have patience, and a liking for the different, see this film.  Tom Waits, John Lurie, and Roberto Benigni all give excellent performances.",
            "review_date": "1998-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Cult classic",
            "content": "Down by Law is a story of three losers, played by Tom Waits, John Lurie and Roberto Benigni in his first and funniest role in an American film. We follow their lives as each of the characters are caught and put into the same cell in  jail where they become acquainted with each other. Gradually they develop a plan to escape. This movie bears some of the trade marks of Jim Jarmush: story of losers, look at America through the eyes of the foreigners. One of the first and the best films from an independent filmmaker Jim Jarmush. 7/10",
            "review_date": "2003-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mississippi blues",
            "content": "A black comedy about three men deceived by luck and given to their destiny, after a stint in prison and a daring escape.Beautiful cinematography in black and white by Robby Müller, taking advantage of the photogeny of the decadent south and the Mississippi delta, excellent music, divided between the songs by Tom Waits and the soundtrack by John Lurie (from The Lounge Lizzards), both protagonists of the film, joined by the inimitable Roberto Benigni (and his wife and muse Nicoletta Braschi) adding a touch of chaos and humor to the story.A cult film that looks even better as the years go by.",
            "review_date": "2022-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "A classic of the crime genre that provides an intimate view of city life and raw human emotion.",
            "review_date": "2023-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film\n\nAltogether I think that the film, \"Down By Law\" (1986) by Jim Jarmusch featuring Tom Waits, is one of cinema's finest noir pieces, an obvious montage through the arts of it's time period, but held together at it's essence, which is the perceived voyeur's agreements with the sometimes awkwardly staggered and dragging exaggerations made by the true minds of the film. This context within context is somewhat familiar to the actors and writers whose hand at the work is seen like a stark author's stencil's dark shading on the texture of the characters at work in the movie. The exemplary effort given by the both the entire teams of the production and writing seem to fit seamlessly as though the stages were set and the actions seemed to flow out of the actors through the piece in the easiest, while at the same time, most mind-blowing orchestration through which the music plays on the rhythm of the story, and viewer. Great early attempt by Jim Jarmusch in film-making, and a true classic. Special recognition, definitely, for Roberto Benigni who was truly fun.",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Off-beat, laid-back mood as of Jim Jarmusch. I'm sure that this was innovative for prison brake genre, but I find this need some thrills at least. It's a cozy friendship story.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jarmusch's style of storytelling is probably more mood-dependent than any other director. Elevating the banal in a meandering slice of life about people with seemingly no ambitions and no desire to have them is not something you'd probably recommend for anyone to write. But he effortlessly pulls it off again and again. And so, this fairy tale can seem very boring if you are not willing to immerse yourself and just accept that Jarmusch loves the open-endedness of his stories. The main problem, I see, starting from prison, is that both Tom Waits and John Lurie get completely sidelined by Benigni, and I love that little bugger. How can you not? He immediately becomes the driving force while they are just observers who react to him and his obtuse and contrasting worldview. Of course, it doesn't ruin the finale, where their new life begins. Maybe that's what Roberto was, the guide that led them from their old ruined lives. The movies look great visually; it's one of those cases where black and white is clearly chasing the picture and color would not improve any of the visuals but would drastically detract from many scenes. And of course, the soundtrack is top-notch too.",
            "review_date": "2022-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Down By Law is Jim Jarmusch at his best, shot in black and white, with a perfect cast, brilliant cinematography, a fantastic music score, an absurd and subtle but basically kind of dark humor, amplified by the unexpected and with a special sense of timing in performance and editing. You never what comes next.",
            "review_date": "2022-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch handles a very simple premise \nThree men, previously unknown to each other, are arrested in New Orleans and placed in the same cell; Zack, Jack, and Bob \nThe trio eventually try to escape prison together\nUnlike other prison movies this centers on the arrest, incarceration, and escape from jail of three men\nIt discards jailbreak film conventions by focusing on the interaction between the convicts rather than on the mechanics of the escape\nThe entire journey though is a slog; it takes way too long to get to the actual imprisonment and the actual escape is less than exciting \nThis will be a huge bore for a lot of viewers mind you",
            "review_date": "2021-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1001 movies to see before you die.  This was tedious.  It was like they had no plot and thought that hiring the famous Italian would make up for the mediocrity of the film.  It was on amazon.",
            "review_date": "2021-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tell me that young Tom Waits doesn't have the exact same face as Ron Perlman. And damn can that man croon. Lurie is a strange creative genius in multiple mediums that has flirted with really mainstream success; his great sense of humor doesn't really come through with this film, but it's just nice to see the guy. Benigni as Bob, a first-generation immigrant who is kept at arm's length by the language barrier but who also has a greater knowledge of American classics than the two native sons, is a treat. What a perfect cast for a Jarmusch film: each very talented, sort of well-known, but none a household name, just like him. The film is absolutely wonderfully shot, incredibly sharp, and features plenty of the director's traditional long takes, great on-location shooting, and inspired shot choice, particularly the intimacy with which the trio is portrayed. Some funny comedy and unique takes on the American experience (parodies on Twain and Bob's disillusionment with the actual America vs. the literary version, for instance) combine together to make a languid, beautiful film that can be called one of the director's best. (4.5/5)",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is about American exceptionalism, with the 2 losers pursuing their selfish American dreams, totally ignorant of the world around them. Enter Bob, the angel trying to show them the light, time and again, but they never really get it. Genius.",
            "review_date": "2020-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rumination on friendship and destiny.\n\nJim Jarmusch's indie comedy-drama Down By Law (1986) is a delightful time as three unlikely allies must band together to escape from prison. Down By Law takes a comedic tone with heavy character drama. Jarmusch's direction is a beautiful slow burn of human emotional experience. He makes you care about three men wrongly convicted so that you root for them to hold a jailbreak. Jarmusch's writing is pithy with heartfelt relationship dialogue and fun witty humor. Jarmusch directs Down By Law with a sharp eye striking realism.\n\nDown By Law paints a stark picture of Louisiana's poverty, desperation, and dejection. Robby Muller's stunning black and white cinematography is a visceral dreamscape. The South looks like a dirty, gritty swamp. The long held still shots are so revealing as actors just get to act in full without odd angles distracting from their performances. The landscape is established beautifully with long panning wide shots. I love the look of Down By Law.\n\nJohn Lurie composed haunting score to Down By Law. Ambient sounds and loud noises are bashed against gritty folk music for a chilling effect during Down By Law's serious scenes. Tom Waits himself sang the mournful folk songs throughout Down By Law. Jim Jarmusch has great taste in music that's for sure.\n\nTom Waits is phenomenal as the short tempered DJ Zack who is down on his luck. Waits delivers a subtle performance full of pained nuance. His character is already sad after a lost job and a recent breakup. Once in prison, Waits is fully dejected with an astonishing realism. Likewise, John Lurie plays a hardened pimp named Jack. His stern acting leaves you shook by his moving portrayal of a man rattled and broken in prison. Down By Law really makes you experience the boredom of prison. Lastly, Roberto Benigni is perfectly likable and endearing as the hilariously named Roberto. He is an earnest Italian tourist, who ends up accidentally killing a man in a laughable way.\n\nI must mention Ellen Barkin delivers a fantastic monologue Laurette as she dumps Tom Waits. On the other hand, Nicoletta Braschi plays a sweet Italian lady named Nicoletta opposite her real life husband Roberto Benigni. She is so entertaining seeing her flirt with Benigni, especially after having already watched Life Is Beautiful that they played in so brilliantly together.\n\nLastly, Rockets Redglare is sublime as the sleazy Gig character.\n\nIn all, Jim Jarmusch gave us another amazing art film with Down By Law among the likes of Night on Earth and Dead Man.",
            "review_date": "2019-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most brilliant idea here was to put this three actors together: amazing vibe between them (I bet they are still friends in real life). I also want to point out that without the great Roberto the whole would have been a bit of a drag , The story is basic, but the cinematic style is more than enough to make up for it! ",
            "review_date": "2019-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I won't pull any spoilers, but what a story, cinematography,  and music. I only wish there was more Waits music.",
            "review_date": "2019-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would believe it if someone told me that this 30-year-old movie came out last year. And Roberto Benigni is the best foreigner character of all times!",
            "review_date": "2017-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, old-fashioned film. Underrated? Possibly. Must-see? Perhaps.",
            "review_date": "2017-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Really funny at times but also very real.",
            "review_date": "2017-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Swings between an awkward theater piece and surprisingly engaging comedy. Something about the film was hard to engage with, so those really on-point moments were hard to trust. I felt like I'd been on a journey by the end, but I had to fight to stay with it.",
            "review_date": "2017-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch's second feature is still one of his best, and it's also possibly the most idiosyncratic prison-break movie ever made. That said, to call Down by Law a \"prison-break\" movie is a bit of a misnomer, as customary for Jarmusch he has little drive to give us exciting set pieces (we don't even see how they escape), but like a Jack Kerouac novel the point isn't the destination but the trek getting there. As with all of Jarmusch's films, Down by Law is carried by character and dialogue, but they're the two cards that no other American director can really get by with (asides from Tarantino). The film's trio of lovable low-lives all have great chemistry, and Tom Waits fans can rest assured that this is his single best on-screen performance. Always jovial, and featuring a cracking soundtrack supplied by Waits himself, Down by Law feels timeless and essential more than ever.",
            "review_date": "2016-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch's work can be either intimidating or off-putting, and in equal measure, to cinephiles because it feels so relaxed--almost as if it was a spur-of-the-moment, off-the-cuff precursor of reality-TV, an inside-joke with everyone involved slipping a nod and a wink, as if on a drunken dare, a mickey of JD passed back and forth along with a pack of Marlboros. This brought to mind many good memories of one of the oddest residents of The Criterion Collection: 'Fishing with John' (an exemplary and hilarious six-part mini-series in which John Lurie goes on fishing expeditions with five American cinematic greats, his partners-in-crime here, Jarmusch and Tom Waits amongst them; one that I'd love to see both get a blu upgrade as well as more episodes, now 25 years later). Also, clearly Jarmusch had a fine rapport with his actors, for this is by far the best and most restrained work I have ever seen from Roberto Benigni.\n\nOne of Jarmusch's more atypical films, 'Ghost Dog: The Way of the Samurai', is still my personal favourite, but this is right up there alongside. It would also make an intriguing double-bill with Jeff Nichols' stellar, though more serious in tone, recent film, 'Mud'.",
            "review_date": "2016-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining character study. May need to watch 3-4 more times to give it a higher rating.",
            "review_date": "2016-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A flat out good film, perfect for any film lover.",
            "review_date": "2016-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "America's introduction to the maniacally brilliant Roberto Benigni! A wonderful cast , great soundtrack and beautifully captured in B & W. Another great film set in the Big Easy.",
            "review_date": "2015-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jarmusch's film about the incarceration and unlikely friendship of three men is a disarmingly funny tale about loneliness and the lies we tell ourselves. The title itself is false, something these three convince themselves of so they don't have to take responsibility for their actions. Lynch-ian surrealism and striking humanity all rolled into one.",
            "review_date": "2015-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch's characters are always small and trivial, but what they do and encounter could touch your soul deeply. Great opening song performed by Tom Waits.",
            "review_date": "2015-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Coming across, as many Jarmusch films do, as a lengthy series of character sketches rather than a traditionally narrative film, Down By Law doesn't work quite as well as some of his other works, but there is plenty here for the Jarmusch fan and the more general film buff to enjoy, even if that enjoyment is somewhat lightweight.",
            "review_date": "2015-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "quietly observed and beautifully photographed\nthere's no silence like a jarmusch silence",
            "review_date": "2015-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Down By Law is another great Jim Jarmusch film. Like the others, you are either going to feel the vibe or you won't. I find myself agreeing with many of the negative reviews -- sometimes the acting feels ad-libbed, sometimes it does feel like it has a student film quality to it, sometimes it does not end up so cool as it wants to be. But then again, so what? The film has an authenticity to it and many great little moments that would probably not be in it if the cast and crew were not going for it. Down By Law is an all-time great comedy adventure.",
            "review_date": "2015-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This dry, deadpan comedy plays like a noir fairytale, filmed with tremendous finesse. Jarmusch's unique model of the stylish slow-burner delivers an honesty I haven't seen before. His films have mystique, charisma and a breezy pathos that's more powerful than it seems.",
            "review_date": "2015-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch's great movie has taken on a new level of importance in the past decade. Not that it wasn't important upon it's initial release. It was. I skipped a day of school and drove my beat-up old Buick to Houston to see an afternoon screening. It felt so vital and new. This was my first Jamusch movie. And what a movie it was. \n\nThere is a great difference in seeing this movie through the eyes of an 18 year old and the eyes of a thirty-something --- and an even greater difference viewing it thru the eyes of a fourth-something. Each viewing is rewarding, but age and the passing of time bring this simple, low-budget movie a far deeper level of meaning. Add in the aftermath of Katrina, this is an important portrait of a New Orleans long gone. \n\nJohn Lurie, Tom Waits and Roberto Benigni (before I found him annoying) are perfectly cast as fictional versions of themselves. Ellen Barkin shows up as well. This is a young Barkin who is already far more talented than her age would suggest. \n\nI remember thinking it funny as she tossed our poor Zack's possessions out the window of their grubby and yet impossibly cool apartment. In my thirties I was in pain for Tom Wait's character. He only has a few things and what she tosses out that window are priceless. \n\nThe New Orleans we see was all too familiar to me in 1986. I was bored of South-east Texas and of Louisiana. I wanted out. Back then, New Orleans seemed dangerous and dirty. \n\nI knew Tom Waits as a cool singer/songwriter who had long been creating experimental twists on the blues and jazz. He had dumped Rickie Lee Jones and inspired her to create an entire iconic album. I didn't know who John Lurie was, but he seemed tough and cool. Benigni was a harmless clown. \n\nAs these three \"true\" characters find themselves stuck in a jail cell the naturalistic charm and humor comes to full bloom. We follow them on a simple escape. Now fugitives, we see them argue, bond and joined together as outsiders. \n\nThe film rambles it's way to an ending that is as satisfying as it is kind of sad and unsure. Jim Jarmusch is an essential filmmaker. Over the years his eccentricities sometimes veer far deeply into his \"hipster cool\" -- this, for me, remains his best cinematic moment. \n\nSomewhere in my mind, these three men are still sulking, joking and sliding through their lives. Lives that are far more meaningful that surface view allows.",
            "review_date": "2015-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The chemistry between the three main characters carries the movie, with plenty of slapstick moments throughout. Great cinematography as well.",
            "review_date": "2015-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good director's vision.",
            "review_date": "2015-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a Jim Jarmusch classic!.If you havent seen a Jarmusch film this is a perfect one to start with.It delivers us a unique and impressive story about three men who simply were never cut out for prison.This is possibly Jarmusch's most straightforward piece of work as theres no odd philosophy behind it.We can experience joy,laughter and entertainment while watching this film.Every Jarmusch fan should see it!",
            "review_date": "2014-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Down by Law [1986] a film shot in black and white, yet is more vibrant than many other films in colour. 7/10",
            "review_date": "2014-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pimp, a dj, & a card cheat walk into a prison, all apparently innocent of their crimes. Then this prison break film transforms into a strange buddy film thru the louisiana swampland, only to have our trio splinter in the end.",
            "review_date": "2014-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch's work can be either intimidating or off-putting, and in equal measure, to cinephiles because it feels so relaxed--almost as if it was a spur-of-the-moment, off-the-cuff precursor of reality-TV, an inside-joke with everyone involved slipping a nod and a wink, as if on a drunken dare, a mickey of JD passed back and forth along with a pack of Marlboros. This brought to mind many good memories of one of the oddest residents of The Criterion Collection: 'Fishing with John' (an exemplary and hilarious six-part mini-series in which John Lurie goes on fishing expeditions with five American cinematic greats, his partners-in-crime here, Jarmusch and Tom Waits amongst them; one that I'd love to see both get a blu upgrade as well as more episodes, now 25 years later). Also, clearly Jarmusch had a fine rapport with his actors, for this is by far the best and most restrained work I have ever seen from Roberto Benigni.\n\nOne of Jarmusch's more atypical films, 'Ghost Dog: The Way of the Samurai', is still my personal favourite, but this is right up there alongside. It would also make an intriguing double-bill with Jeff Nichols' stellar, though more serious in tone, recent film, 'Mud'.",
            "review_date": "2014-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Three convicts together in a very unlikely scape. A special sense of humor.",
            "review_date": "2014-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch is a master at independent cinema.",
            "review_date": "2014-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film mainly relies on the actors' performances which are really good. Nice photography too.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Any Jim Jarmusch film that boasts the talents of excellent actor Roberto Benigni is a film that I can't miss.\n\nLike with many Jim Jarmusch films, Down by Law is an example of a film that takes place in a very small setting and has the importance of the story rest on the complicated characters involved with each other. Yet surprisingly after taking the time to make the characters interesting and establish the complicated relationship between them, he moves them from prison on a journey for escape. The film is a large step up from Jim Jarmusch's previous effort Stranger than Paradise because the journey the characters take is a significantly more interesting one.\nWhile the slow pacing in Down by Law and lack of big dramatic events may disappoint some viewers, the gentle movement of the story in Down by Law is iconic of Jim Jarmusch's film style. It is a film about characters, and not about events. And while admittedly I felt that the effect of this was occasionally dull as well, I had an appreciation for Jim Jarmusch's film style and could sit back and relax while the events unfolded around the characters in Down by Law.\nAlthough the characters are the most important aspect in Down by Law, the scenery of the film is great because it produces an interesting setting for the story to wade through, shifting from prison into an escape and the locations the characters progress through. And all against the black and white colour palette of the film which in its own way symbolizes the way that the characters in the film view the world in a very simple black and white manner. Down by Law's simplicity and gentle atmosphere combined with its visual style of black and white and still cinematography reminds audiences of the older films that chronicled similar themes using the now dated form of technical storytelling that can be looked back on. Down by Law's simplistic style reveals Jim Jarmusch's passion for the older film style which he brings out through his means of independent filmmaking, and it is a bold and ambitious move which is a very admirable one.\nDown by Law also boasts a strong script. By capturing the real humanistic language of its characters as they are stripped down to the bare nature of them as men, we are given a look into their souls and establish their differences which gradually become the source of how they take different approaches to complicated situations and develop conflict. Essentially, there is a lot of complex humanism that comes from the relationships between the three protagonists in Down by Law, and Jim Jarmusch's intelligent and thought provoking writing style establishes strong figures for the cast to work with.\nTom Waits' lead performance is great. Most of the time in Down by Law, Tom Waits is a very stoic figure who doesn't say too much and allows the majority of the emotion to simply come from his facial gestures. He doesn't talk his way out of things, he silently sits them out which causes audiences to really wonder just what is going on in his head. It is a question that nobody can answer because the characters is very complicated, and Tom Waits' strong performance suggests that he spends the film trying to figure it out. His mere presence in the film alone is very appealing, but his performance manages to do a strong job and give Down by Law the appropriate lead character to explore the themes and dynamics as he comes to terms with them. Tom Waits gives a great performance in Down by Law.\nJohn Lurie's supporting performance is an effective one as well. Engaging with the surrounding cast in Down by Law very well, John Lurie manages to give a strong effort that reminds us how well he works with Jim Jarmusch again after their previous pairing. And while his performance doesn't stand out as much as the other cast members, his chemistry with Tom Waits is effective because it is easy to really see the dramatic tension going on between them which makes the rough edge of the film even more intense and effective. John Lurie handles his material well as one of the leads in Down by Law, and the result is a meaningful and effective performance.\nRoberto Benigni's presence in Down by Law is the source of most of the comedy. As his natural comedic charisma is excellently energetic in most films he stars in, it is no surprise that in Down by Law he is the main thing leaving audiences laughing. Roberto Bengini quickly and sharply says his lines with a natural charisma and his charm makes him embody the role perfectly. His interactions with both Tom Waits and John Lurie prove to lighten the mood and prevent it from descending into dull melodramatic territory which makes the atmosphere of Down by Law more enjoyable and enlightening. Roberto Benigini is an excellent cast member in Down by Law, and the scenes involving his chemistry with Nicoletta Braschi are always a nice touch.\nEllen Barkin's opening tirade in Down by Law is one of the best things she has ever done as an actress. She has a big name but hasn't done too much high profile stuff in the recent years, so it is good to see her working in small scale material such as Down by Law and putting her actual acting passion into the part even for only a brief amount of time is just terrific. She gives the drama of the story a good start with her brief performance, and she make a memorable presence in Down by Law.\n\nSo while Down by Law may have difficulties appealing to audiences who are not already familiar with Jim Jarmusch's iconic film style, its intelligently written screenplay, strong cast and simple story mostly make up for that and render it a fair step up for Jim Jarmusch's career as a writer and director of independent cinema.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Down By Law (1986) - 7\n\nA \"neo-Beat noir comedy\" by Jarmusch own words, I think it's an accurate description of this movie blessed with fabulous cinematography. In \"Down By Law\", Jarmusch shifts away from the minimalistic method employed in \"Stranger Than Paradise\" seeking to explore new ground of cinematic expression. Despite some common aspects between both works, \"Down By Law\" has a different imprint to its nature, the plot is given more emphasis, it's a bigger melting pot of ideas with high potential for a conceptually sophisticated and gratifying experience and it has more technical workmanship, especially in the editing department. The cinematography dressed by German Expressionism is very polished and beautiful, numerous deliciously comical and admirable moments abound, the camera work is, at times, brilliant and even evocative of other films, but in general \"Down By Law\" didn't seem a technically coherent work, it seemed just an outline of what it could actually come to be in my opinion. The cinematic heritage of \"Stranger Than Paradise\" is obvious: the deliberate choice of Black and White picture, the lame acting, the highlight of the comical side in human relations, the way music is employed. But while some technical aspects made a coherent qualitative shift (I say qualitative not in the sense of \"better\" but rather \"more appropriate\"), other aspects didn't follow suit and this distracted me quite a bit.\n\nFor example, the lame acting of the main characters which made so much sense in \"Stranger Than Paradise\" contrasts sharply with the relatively high-level of workmanship of other technical aspects in \"Down By Law\", I feel like it takes away from the potential of this movie. It basically comes down to the cinematography, editing and camera work, this aspects are so worked out that they sort of enhance the lame nature of the acting in a bad and distracting way, it makes it all look very artificial and inorganic, precisely the opposite of what the low-fi cinematography and minimalistic approach of the previous film did. It's as if \"Down By Law\"'s mise en scéne is too good for its own good, but I'd rather say it's the acting that doesn't fit well with the rest, it gives this movie an almost amateurish quality in my eyes. Roberto Benigni did pretty well in this movie, I'd say perfect, but Tom Waits and John Lurie seemed so dead and out of context in comparison... pretty bad because they're the other two main characters in a character-driven narrative. Seems like Jarmusch didn't care for this or even wanted it, well it didn't work for me, Lurie and specially Waits distracted too much and impoverished the experience. \"Stranger Than Paradise\" works much better because it's simpler and more consistent, it's closer to what I'd call a finished work, it provides a more authentic and immersive experience to me, even though nothing happens... because it makes sense as a whole. Bottom line being \"Down By Law\" is limited by its own (not that big) complexity which Jim Jarmusch didn't manage as well as the marvelous simplicity of \"Stranger Than Paradise\". So even though both movies have different premisses, I think it's case to say less is more.\n\nNotwithstanding I want to say that I like \"Down By Law\" very much, it's a beautiful and very funny movie capable of engaging and entertaining me despite all its technical inconsistencies/awkwardness... then again this might contribute to the charm of the work for other viewers, I guess it depends on perspective. I have somewhat ambiguous feelings towards this work which can either slide for the better or the worst. Despite all my qualms, I like this film and recommend it!",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely worth watching again!",
            "review_date": "2014-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This fantastic black and white independent comedy film by Jim Jarmusch is the story of three men who meet in a New Orleans prison and escape together.  Easily one of Jarmusch's best films, particularly of his earlier period, it benefits from having a stronger cast than either of his previous two efforts...John Lurie is a little better than he was in \"Stranger than Paradise\", and having Tom Waits and Roberto Benigni elevates things.  It is hilarious, particularly Benigni, and it has some good character interactions as well.  I can honestly say I enjoyed everything about this feature.",
            "review_date": "2014-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny, quirky and heavily stylized journey. Benigni is hilarious and the characters are so inviting that you would be dumb not to relate to them. One of Jarmusch's best films and one that had me fall in love with his work",
            "review_date": "2014-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has style but not much entertaining.",
            "review_date": "2014-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a movie about nothing and I loved every moment of it.",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true original that kind of grows on you.",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The pacing of this film flows but makes jumps and in between everything we have amazing characterization. By the end of the film you want to see more of the characters. You dont want to see them go.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Down by Law is an impeccably crafted character study one three unique individuals, and the result will leave you rewarded and satisfied.",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much perfect.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Begnigni saves this completely.",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Down by Law is simplistic, but very engaging and emotionally rewarding.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch's filmography consists largely of peculiar characters, a slice of comedy and a little unconventional style, sometimes it works well but this was a shade too off beat.",
            "review_date": "2013-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the first Jarmusch directed movie I have watched, and what a way to be introduces to a very talented director. A simple story involving three men sent to a New Orleans prison, and eventually escaping into the swamps of the bayou.\r\n Almost everything works in this film. The small moments detailing the human relationship that can form between three men stuck in a tiny prison cell give rise to moments of laughter and heartache. Tom Waits and John Lurie are fantastic as Zack and Jack,and the film hits it peak with the introduction of Roberto (Roberto Benigni). The three actors form a chemisty that puts you right in the jail cell, and swamp, with them. \r\n The film also benefits from a great soundtrack performed by none other than Tom Waits.",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a sad and beautiful world.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This and Mystery Train are my favorite Jarmusch movies. Structured very well and Waits, Lurie, and Benigni are awesome in this.",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very minimalist film, and it works so well because of it. The choice to film in black and white and slow camerawork makes for interesting shots of New Orleans and the Bayou, and the movie's often use of small, somewhat secluded venues for the characters increases feelings of comradery -- not that it needed any help; the three leads work off of each other wonderfully. The movie is also aided by the slow pace and fitting soundtrack as well.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Down by Law (1986) is a different approach to the Genre of \"escape-esque\" films. The beautifully developed characters that are created by Jarmusch can be seen as the main pilars on which this story coherently stands. Of course some parts of the movie seem a hard to believe, but it seems like this film is not about that as much as it emphasizes on the life enjoying attitude of Roberto who guides the other inmates to their freedom, physically and mentally. At the end everyone seems back on the right track in contrast to where everyone was at the beginning. \nThis picture is worth watching, just for the amazing performance by Roberto Benigni. Cinematography is partly very beautiful but gets quite tiring because it is so static throughout the scenes and rarely involves movement. \nAll in all this film can be recommended due to its message and performance by the lead but other than that it might not be the friday night movie to watch if you seek excitement or a deep motivational boost like usually escape movies give.",
            "review_date": "2012-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Down By Law\" is a lot slower and more distant than \"Stranger than Paradise\". Something is lacking in the characters that makes them pop with the usual angst that Jarmusch portrays in them. However there is a lot of good to take away from this one, it is artistically stunning and there are quite a few genuine moments where you get to know the characters well.",
            "review_date": "2012-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tom Waits. Nothing more to be said",
            "review_date": "2012-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "all the characters are very well written and all three actors truly justified their character",
            "review_date": "2012-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's very slow pacing is definitely a choice by the Director and Editor, but it sometimes bogs down it's terrific ensemble cast.",
            "review_date": "2012-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Peculiar and engaging.  Tom Waits is a joy to watch",
            "review_date": "2012-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Droll, deliberate, slow paced, dreary and amazing. I love this film so much. Great writing, acting, cinematography, and music abounds. It features a very early performance from Roberto Benigi that is both heartbreaking and hilarious. Don't miss it but be patient. It's not exactly an action adventure film but a great a snail paced character study.",
            "review_date": "2012-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fun never stops.\n\n-In 1986, Tom Waits was one of the sexiest men alive.",
            "review_date": "2012-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily in my top five favorites. Jarmusch proves is brilliance with this film. Must see for any fan of well written scripts and perfected cinematography.",
            "review_date": "2012-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie , Roberto Benigni was amazing .",
            "review_date": "2012-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Odd tale with gorgeous cinematography. Benigni steals the show.",
            "review_date": "2012-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good! Though, it should go with out saying the \"I scream for ice scream\" scene is the pinnacle of the whole movie.",
            "review_date": "2012-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waits, Lurie & Benigni...How could you possibly go wrong?",
            "review_date": "2012-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "and i called it as NOIR!",
            "review_date": "2012-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a fun film about three inmates that have an unusal bond.",
            "review_date": "2012-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having seen only one other Jarmusch film (\"Dead Man\"), this was definitely in-family for what he creates in terms of style. Of course, Roberto Benigni really made the film for me, adding lots of entertainment to what would otherwise have been an extremely simplistic plot.",
            "review_date": "2012-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very cool Indie film with twisted humor.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i scream,u scream,we all scream,for ice cream..!!dream cast..!!lov all 3..!!tom waits especially..!!",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful cinematography narrarates this visual poem.\n\nIn contrast to the creative selection of focal points and movie magic employed to, say, transform Pittsburgh into Gotham City for \"The Dark Knight Rises\", \"Down by Law\" makes extensive use of long, panning sequences that makes no effort to conceal flaws inherent to the setting.  Pleasing visual symmetry is irregularly punctuated by signs of depravity, dilapidation and chaos; order and disorder, civilization and wilderness coexist without apparent contradiction.  \n\nThe unhurried pace of these shots might border on supercilious bluster, were they not so hypnotically captivating.   That the virgin beauty of the Louisiana bayou lends itself to such treatment is perhaps unsurprising.  Striking, however, is how seamlessly the same meandering cadence translates to backdrops of urban squalor.  \n\nLike a silent accomplice to Roberto Benigni's live-in-the moment character, these sequences eschew any quixotic concept of perfection, embracing instead the moment, the here and now; perceived flaws are inherently integral to beauty, not a diminishing element.  Valuing reality over introverted conceit is, not coincidently, the very lesson bequeathed to foward-looking Jack and backward-looking Zack by lighthearted, vivacious Roberto.  \"Bob Frost\", to say nothing of Walt Whitman, would approve wholeheartedly.",
            "review_date": "2012-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bittersweet, nostalgic, discreetly funny.",
            "review_date": "2012-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Americana punk-pulp classic.",
            "review_date": "2012-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9.5/10. One of my favorite prison films. Probably the most artistic. There is so much to complement with the cinematography. Anyway, I love how each scene is taken with long shots and the camera is just put in a place to observe everything that will happen during that scene, like a lot of great Jarmusch films. The film is more bold than Jarmusch's bleak style, but it's story is so enjoyable, that most audiences wouldn't notice. He tells the story with gliding past things that other writers would take time to think of something original. But, he just says \"These things don't matter in this film, so why try\". A prime example would be the prison escape. The reason that these things don't matter is because the film runs entire on the characters. Really, it completely does. That is the thing that people somewhat don't realize, is that the characters are what they are enjoying so much about this film. It's concept and way of it wanting to be told does limit the film to achieve the title of a masterpiece. But, it is a great as it could ever be. It is perfect for what it is.The best thing about this film is the way it builds up just for that one beautiful and meaningful shot.",
            "review_date": "2012-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I ever saw. The writing is REAL and great as in all of the Jim Jarmusch films I saw so far. The acting is great (especially Tom Waits). The black-and-white is perfect for the movie. Tom Waits' songs which was in the soundtrack was great (The opening scene with \"Jockey Full of Bourbon\" was great). I think that the dark humor in the movie concludes in the scene when Tom Waits' character is in a huge fight with his girlfriend and the only think that he cares about is his shoes.",
            "review_date": "2012-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Down by Law,\" a film by Jim Jarmusch probably would have been great if it weren't for the lackluster ending; in a way I am somewhat content with the last image of the movie, yet it still was unsatisfying. The opening of the film is extraordinary, with some of the most sweeping tracking shots you'll ever see juxtaposed with wonderful music by Tom Waits (\"Coffee and Cigarettes\"), who also stars in it, along with John Lurie (\"Stranger than Paradise\"), and Roberto Benigni. The mesmerizing black and white cinematography of the Louisiana Bayou, may be the best aspect about \"Down by Law.\"  The story centers on the three entirely different men, who meet in prison and decide to escape together.  Jarmusch isn't interested in the act of escaping itself, but more on what happens before and after. I actually have a difficult time knowing the motives behind his characters, if there are any. To sum it up, it obviously isn't his best work; it had little mishaps before the escape, but all in all a good picture with fine performances, plenty of laughs, great music, and it leaves you in wonder afterwards.\n\nMy ranking of the films I've seen of Jarmusch:\n1.\tDead Man (Great)\n2.\tGhost Dog: The Way of the Samurai (Great)\n3.\tBroken Flowers\n4.\tMystery Train\n5.    Stranger than Paradise\n5.\tDown by Law\n7.\tCoffee and Cigarettes (Only film I don't love)",
            "review_date": "2012-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch's second road movie featuring singer Tom Waits and Italian Roberto Benigni in his international debut was arguably even stronger than Paradise.",
            "review_date": "2012-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best looking and also best films of all time. (Streaming on Hulu.)",
            "review_date": "2012-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you went the whole movie without seeing the name of the director in the credits, you would still know this was a Jarmusch film. Great use of black & white, but Roberto Benigni - even with third billing - is the star. He makes this movie.",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an amazingly good film by one mr. jarmusch. tom waits (one of my most favorite performers of all time) does a great job as well",
            "review_date": "2012-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "probably jim jarmusch's finest film (dead man will always be a personal favourite). The cast is perfect, tom waits does his gravely dead-beat persona with true believability and Robert  Benigni is funny as hell. But the real star is jarmusch. His ability to make feel like the fourth member of the party makes this an intimate and emotional affair.",
            "review_date": "2012-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tom Waits is my BIG favorite, as an actor and musician. Roberto Beningni is good as always in this one.",
            "review_date": "2012-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly my favorite of Jarmusch's early works, though I know Mystery Train and Night On Earth will always give it a run for its money.\n\nThree very different men find themselves in jail in Louisiana together, build an amusing friendship despite their various quirks and foibles, then make an escape together, leading to more oddball adventures.\n\nWonderful film, crisp black and white photography, great characters, what more can you ask for?\n\nRecommended.",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        }
    ],
    "rt_rating": 9.4,
    "rt_summary": "A disc jockey (Tom Waits), a pimp (John Lurie) and an Italian tourist (Roberto Benigni) escape from jail in New Orleans.",
    "meta_rating": 7.5,
    "meta_summary": "Two innocent people are arrested. An interesting third person, with broken English, joins them in their cell. On his idea, they decide to escape from the prison. Their journey is the rest of the movie.",
    "vibes": [
        "interested",
        "extraordinary",
        "sentimental",
        "linear",
        "discreet",
        "edgy",
        "gloomy",
        "occasional",
        "handsome",
        "numb",
        "real",
        "distinctive",
        "nutty",
        "exciting",
        "infectious",
        "prospective",
        "quick",
        "undisclosed",
        "wooden",
        "able",
        "strange",
        "chatty",
        "crummy",
        "episodic",
        "overcast",
        "obscure",
        "potent",
        "unbeatable",
        "naive",
        "double",
        "drunken",
        "minor",
        "sexual",
        "concerned",
        "definitive",
        "resourceful",
        "vague",
        "vulnerable",
        "grand",
        "superb",
        "compelling",
        "classical",
        "surrealistic",
        "friendly",
        "impeccable",
        "local",
        "responsible",
        "righteous",
        "sarcastic",
        "traditional",
        "native",
        "humane",
        "pleasant",
        "former",
        "careless",
        "comic",
        "surprising",
        "relaxed",
        "stellar",
        "equal",
        "atypical",
        "directorial",
        "eager",
        "enthusiastic",
        "opposite",
        "watchable",
        "humorous",
        "believable",
        "delicate",
        "sensational",
        "spooky",
        "truthful",
        "intriguing",
        "exemplary",
        "vulgar"
    ]
}