{
  "title": "Monty Python and the Holy Grail",
  "rating": 8.6,
  "release_date": "1975-04-14",
  "genre": [
    "Adventure",
    "Fantasy",
    "Comedy"
  ],
  "summary": "The Monty Python team are at it again in their second movie. This time we follow King Arthur and his knights in their search for the Holy Grail. This isn't your average medieval knights and horses story - for a start, due to a shortage in the kingdom, all the horses have been replaced by servants clopping coconuts together!",
  "critic_reviews": [
    "A veritable facroy of memorable quotes and scenes.",
    "A medieval-on-your-ass laff-riot.",
    "The material is superb, Neil Innes’ music is tremendous and Gilliam’s animations are timelessly brilliant.",
    "The quality of the humor - irreverent, smart, and challenging - is one of the things that differentiates Monty Python and the Holy Grail from so many other motion picture comedies.",
    "It may lack the authority-baiting, satire-with-a-purpose edge of Life of Brian, but Holy Grail is the looser, sillier, ultimately funnier film, packed with actual goofy laughs rather than hey-I-get-that cleverness.",
    "Along with the high comedy, this determined insistence on the gory stupidity of ancient but still potent fancy is what holds the film together. Grail is as funny as a movie can get, but it is also a tough-minded picture — as outraged about the human propensity for violence as it is outrageous in its attack on that propensity.",
    "What we have here is an historical document of inestimable value, describing in no uncertain terms the terrible and beautiful times before AIDS.",
    "It's still the Holy Grail of crazy comedy.",
    "It's one heck of a basis for a funny movie.",
    "Monty Python and the Holy Grail...is a marvelously particular kind of lunatic endeavor.",
    "Working \"lobbed\" and \"scimitar\" into that same sentence hovers near the empyrean of genius.",
    "In Holy Grail, they put their talents to work on a larger scale, mixing wonderful satires on the Medieval legend and lifestyle with tremendous comic timing and blatant dirty jokes.",
    "An incredibly silly film of great humor, brilliant design and epic insanity.",
    "The sufferings were well worth it, and the Pythons delivered a classic comedy.",
    "A zany, hysterically funny, and sometimes brilliant if sometimes sophomoric send-up of every medieval movie ever made.",
    "Has a sense of humor that is intellectual, even academic, at heart.",
    "Silly, sophomoric, and slapped together, but would you want it any other way?",
    "Still stands as a gloriously silly and twisted send-up.",
    "Neither as sparkling as it is said to be nor as bad as it seems to be at the start. But it's pretty good—thus, as British phenomena go these days, exceptional.",
    "Basically an excuse for set pieces, some amusing, others overdone."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Monty Python and the Holy Grail is considered to be one of the greatest comedies of all time, and for a good reason.This low-budget film didn't just age well, but it sounds like it has been released 10 or maybe even 8 years ago, except itMonty Python and the Holy Grail is considered to be one of the greatest comedies of all time, and for a good reason.This low-budget film didn't just age well, but it sounds like it has been released 10 or maybe even 8 years ago, except it really makes you laugh out loud. This is how irony should be used, this is how breaking-the-fourth-wall should be done, and this is a Self-reflexive film that keeps being inventive and challenging throughout its running time.While its sharpness has been considerably blunted at some times, I was intrigued and hooked at every second of the movie.I didn't find the ending was rushed, rather I found it reasonably funny, if not completely satisfying. I'm really surprised at how Terry Gilliam take advantage of almost every silly situation or gag to reuse it later in the movie. He's a real genius!Simply, Monty Python and the Holy Grail is the godfather of parody films!(8.5/10)",
      "review_date": "2018-05-30"
    },
    {
      "review_title": null,
      "content": "A classic film. Oh and Ian: IT'S MENT TO BE SILLY! WATCH THE SHOW! THEY EVEN HAVE A SILLY MONITOR ON THE SHOW TO MAKE SURE THE SKITS DON'T GET TOO SILLY! Anyway, if you like this, you'll love the show. \"Nobody expects the A classic film. Oh and Ian: IT'S MENT TO BE SILLY! WATCH THE SHOW! THEY EVEN HAVE A SILLY MONITOR ON THE SHOW TO MAKE SURE THE SKITS DON'T GET TOO SILLY! Anyway, if you like this, you'll love the show. \"Nobody expects the Spanish Inguisition!\"",
      "review_date": "2005-11-14"
    },
    {
      "review_title": null,
      "content": "Without a doubt one of my all time favourite movies along with life of brian. It is sad in the almost 40 years since its release their is very little that can hold a candle to it. It has some of the most quoted one liners of any movie andWithout a doubt one of my all time favourite movies along with life of brian. It is sad in the almost 40 years since its release their is very little that can hold a candle to it. It has some of the most quoted one liners of any movie and justifiably so.",
      "review_date": "2014-02-23"
    },
    {
      "review_title": null,
      "content": "We all know it, we all love it, and we all quote it. The Holy Grail is still arguably one of the greatest comedies of all time and there is a good reason for that. Each scene plays out hilariously well timed, such as the Black Knight duel,We all know it, we all love it, and we all quote it. The Holy Grail is still arguably one of the greatest comedies of all time and there is a good reason for that. Each scene plays out hilariously well timed, such as the Black Knight duel, the trojan bunny, the Keeper of the Bridge of Death, every scene is just funny punchline upon funny punchline, and each one hits a bulls-eye.",
      "review_date": "2014-03-26"
    },
    {
      "review_title": null,
      "content": "By far the best british film, let alone best british comedy, ever to have graced our screens. It's laugh out loud funny from the get go and I have no problems recommending this film to anyone who is a fan of comedies. If you haven't seen itBy far the best british film, let alone best british comedy, ever to have graced our screens. It's laugh out loud funny from the get go and I have no problems recommending this film to anyone who is a fan of comedies. If you haven't seen it yet then you really are missing out on a gem.",
      "review_date": "2013-07-10"
    },
    {
      "review_title": null,
      "content": "This is less a film than a feature length masterclass in comedy. Hilarious even now most of its lines have permeated popular culture. Monty Python at the top of their game.",
      "review_date": "2018-02-09"
    },
    {
      "review_title": null,
      "content": "one of the best comidies ever. i was rolling on the floor and in tears from laughing so hard. the brilliance of this film is just uncanny . when you can make some thing funny like a guy following the knights and banging two cocconuts togetherone of the best comidies ever. i was rolling on the floor and in tears from laughing so hard. the brilliance of this film is just uncanny . when you can make some thing funny like a guy following the knights and banging two cocconuts together to make the sound of horse galloping not really because they thought it was gona be funny as to they had no money to afford real horses just shows how much of brilliant theese guys  are. so many funny moments in this film i couldnt even list them all. one of the few commodies ive seen more a few times and still laugh when i see it. . people will still be laughing on the floor in 50 years when seeing this.",
      "review_date": "2010-09-15"
    },
    {
      "review_title": null,
      "content": "@eddy c \"Nowadays just cant compete\"?? Compete to what? Weed movies and toilet humor? This was completely new to the 1970's and still blows my mind 30 years after its inception. This was the beginning of many references and allusions @eddy c \"Nowadays just cant compete\"?? Compete to what? Weed movies and toilet humor? This was completely new to the 1970's and still blows my mind 30 years after its inception. This was the beginning of many references and allusions comedic gold such as Family Guy and The Simpsons have based their work on, and still stands as an excellent classic by itself. I say must-see.",
      "review_date": "2009-10-01"
    },
    {
      "review_title": null,
      "content": "The pinnacle of film comedy. A Timeless Classic.",
      "review_date": "2008-10-07"
    },
    {
      "review_title": null,
      "content": "Quite possibly the greatest comedy ever made.",
      "review_date": "2009-06-23"
    },
    {
      "review_title": null,
      "content": "I knew it'd be great when I first saw it at the age of 12. I laughed so hard that I nearly threw up--and that was just during the opening credits.",
      "review_date": "2008-02-11"
    },
    {
      "review_title": null,
      "content": "People call this clever the movie was funny fo its time but nowadays just cant compete.",
      "review_date": "2009-05-30"
    },
    {
      "review_title": null,
      "content": "This comedic masterpiece is funny in just about every way from the misplaced credits to the silly ending.",
      "review_date": "2007-12-26"
    },
    {
      "review_title": null,
      "content": "This is sooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo freaking funny.",
      "review_date": "2011-08-31"
    },
    {
      "review_title": null,
      "content": "Not as sophisticated or detailed as \"A Fish Called Wanda\", mostly because it relies on the accents which without them British comedy would be nothing but bull***t. But it's ridiculousness is so convoluted it becomes more hilarious as theNot as sophisticated or detailed as \"A Fish Called Wanda\", mostly because it relies on the accents which without them British comedy would be nothing but bull***t. But it's ridiculousness is so convoluted it becomes more hilarious as the movie goes on. The black knight scene is one of the greatest, as it's the most well-thought of part of the film. I laughed my ass off.",
      "review_date": "2013-08-28"
    },
    {
      "review_title": null,
      "content": "First shalt thou put the Holy Grail into thy DVD player or Netflix. Then, shalt thou count to three. No more. No less. Three shalt be the number thou shalt count, and the number of the counting shall be three. Four shalt thou not count,First shalt thou put the Holy Grail into thy DVD player or Netflix. Then, shalt thou count to three. No more. No less. Three shalt be the number thou shalt count, and the number of the counting shall be three. Four shalt thou not count, neither count thou two, excepting that thou then proceed to three. Five is right out. Once at the number three, being the third number to be reached, then, thou shalt be captivated by the humor and wit in the movie thou is about to see.",
      "review_date": "2013-09-19"
    },
    {
      "review_title": null,
      "content": "Monty Python and the Holy Grail is a hilarious movie that will have you laughing the entire time.",
      "review_date": "2018-01-21"
    },
    {
      "review_title": null,
      "content": "I saw only 90% of the film. The other 10% I was on the ground laughing till I almost stopped breathing. It was so funny tears were rolling down my face.",
      "review_date": "2006-11-07"
    },
    {
      "review_title": null,
      "content": "Great movie, but, I must admit, there are a few skits that you can tell were supposed to be great jokes that just aren't really that funny at all. The prince who Sir Lancelot thinks is a woman is one of these, though I adored the Great movie, but, I must admit, there are a few skits that you can tell were supposed to be great jokes that just aren't really that funny at all. The prince who Sir Lancelot thinks is a woman is one of these, though I adored the hiccuping soldiers, but the good bits by far make up for this. Gets a 10/10, just because I just remembered Castle Anthrax.",
      "review_date": "2006-02-07"
    },
    {
      "review_title": null,
      "content": "Almost as good as Life of Brian. Love the Black Knight Scene.",
      "review_date": "2007-05-09"
    },
    {
      "review_title": null,
      "content": "Funniest movie ever made.",
      "review_date": "2006-07-19"
    },
    {
      "review_title": null,
      "content": "Insanely wacky comedy, one of the best of the Monty Python films. Wonderfully written, hysterically funny performances. They did an amazing job with the budget they have. Many memorable scenes, not all scenes hit the mark however.",
      "review_date": "2009-10-18"
    },
    {
      "review_title": null,
      "content": "Yes, but no \"clever puns.\" Some are overdone too.",
      "review_date": "2005-12-17"
    },
    {
      "review_title": null,
      "content": "I unclog my nose towards you and fart in your general direction, Ian!",
      "review_date": "2005-12-31"
    },
    {
      "review_title": null,
      "content": "Funny as hello!",
      "review_date": "2005-09-13"
    },
    {
      "review_title": null,
      "content": "Pretty funny, but mostly silly.",
      "review_date": "2005-09-13"
    },
    {
      "review_title": null,
      "content": "One of, if not the, best movies I've ever seen. It's very creative and funny, putting a little twist on medieval movies.",
      "review_date": "2006-10-29"
    },
    {
      "review_title": null,
      "content": "Quite possibly the funniest movie I've ever seen. Not the best (that honor is given to the Godfather, and Star Wars: The Empire Strikes Back). I love British humour.",
      "review_date": "2007-04-27"
    },
    {
      "review_title": null,
      "content": "\"People call this clever the movie was funny for its time but nowadays just cant compete.\" Actually for its time it was good and now its even better. I suggest anyone who doesn't think this movie is funny take a step back from life and see if\"People call this clever the movie was funny for its time but nowadays just cant compete.\" Actually for its time it was good and now its even better. I suggest anyone who doesn't think this movie is funny take a step back from life and see if you want to live it so focused.",
      "review_date": "2010-11-08"
    },
    {
      "review_title": null,
      "content": "Monty Python and the Holy Grail is simply brimming with great sketches, with it's only problem being the laughs come so fast unfortunately you may miss a few. And, of course, not every sketch is perfect. But, all in all. MP and the HG is notMonty Python and the Holy Grail is simply brimming with great sketches, with it's only problem being the laughs come so fast unfortunately you may miss a few. And, of course, not every sketch is perfect. But, all in all. MP and the HG is not only a cracking and damn near perfect comedy for it's time, but is also much better than almost anything out today. Simply unmissable, along with the other fantastic MP films. If you don't love this, your a lost cause.",
      "review_date": "2011-06-20"
    },
    {
      "review_title": null,
      "content": "One of the funniest and smartest comedies ever made. Judging this movie by its own merits, i'd give it an 8 or 9, but it deserves no less than 10, simply because of its impact on future movies and TV shows.\r Seeing that this was released inOne of the funniest and smartest comedies ever made. Judging this movie by its own merits, i'd give it an 8 or 9, but it deserves no less than 10, simply because of its impact on future movies and TV shows.\r Seeing that this was released in 1975, it must have influenced the creators of comedy classics like Airplane!, TV phenomenons like Family Guy, and even my current TV show Community has the same style of comedy.\r These creations probably wouldn't be possible if not for the genius of the people behind this film.",
      "review_date": "2014-02-28"
    },
    {
      "review_title": null,
      "content": "King Arthur and his squire travel Britain searching for men to join the Knights of the Round Table and help him on his quest to find the Holy Grail.    Upon release many critics dismissed The Holy Grail as a series of set pieces andKing Arthur and his squire travel Britain searching for men to join the Knights of the Round Table and help him on his quest to find the Holy Grail.    Upon release many critics dismissed The Holy Grail as a series of set pieces and comedy sketches, but whilst that’s probably true, it doesn’t make this movie any less funny or entertaining.",
      "review_date": "2023-01-08"
    },
    {
      "review_title": null,
      "content": "One of the funniest movies of all time. I guess if you don't like British humor, then you won't like it.  Sooooo many memorable quotes. The only thing keeping it from a perfect 10 is the cheap ending.",
      "review_date": "2011-09-07"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nMonty Python and the Holy Grail is an amazing movie! The film is just laugh out loud hilarious. The plot tends to remain fairly strong and full of humor while the acting is just plain superb. These guys nailed the acting and it creates a laugh-out-loud good time. The only glaring oddity with The Holy Grail is the story. The plot is great and all but they are searching for the Holy Grail but then I don't quite what happened to that quest but that is insignificant when compared to the rest of the package. Overall, Monty Python and the Holy Grail is a great movie that is a must-see for it will entertain you for years to come as well as change the way you look at comedy, it is the master of slapstick. My actual score: Presentation: 10, Plot: 9.5, Acting: 10, Script: 10, Lasting Appeal: 10. Overall Score for Monty Python and The Holy Grail: 9.8 out of 10 \"Amazing\"",
      "review_date": "2011-11-13"
    },
    {
      "review_title": null,
      "content": "Monty Python's holy comedy. Not just the best comedy movie out there, but one of the best movie out there. Smart jokes and critics make this movie a true masterpiece in cinema history.",
      "review_date": "2012-01-09"
    },
    {
      "review_title": null,
      "content": "Monty Python and the Holy Grail is absolutely hysterical. Off-the-wall, nonsensical, and just downright weird, Monty Python and the Holy Grail is a true classic of comedy. The film is tough to make heads or tails of, due to its sheerMonty Python and the Holy Grail is absolutely hysterical. Off-the-wall, nonsensical, and just downright weird, Monty Python and the Holy Grail is a true classic of comedy. The film is tough to make heads or tails of, due to its sheer randomness and irreverence is really, really, funny. The acting, as always with the group, is solid but certainly not the focus. Instead, the acid-influenced and weird happenings to be found in the writing, as well as the constant visual gags and subtle jokes, off-set by the more straightforward ones, are phenomenal. The film is very well-written and knows what it does well and keeps the jokes coming throughout the film. Overall, King Arthur's quest for the Holy Grail is a riot.",
      "review_date": "2016-07-07"
    },
    {
      "review_title": null,
      "content": "This is perhaps the best parody film ever made. This is definitely the best Monty Python movie. Even if you are not a Monty Python fan you might still like this movie. Maybe it is because it has the best story of them all being based on theThis is perhaps the best parody film ever made. This is definitely the best Monty Python movie. Even if you are not a Monty Python fan you might still like this movie. Maybe it is because it has the best story of them all being based on the well-known legend of King Arthur and the nights of the round table. If you are a Monty Python fan then you should definitely love this movie. There are so many scenes in this movie that have become pop culture references appearing in video games and other places. The first time I saw this movie I laughed till it hurt at many of the ridiculous things that happen in this movie. I own it and still really enjoy watching it today. The Monty Python gang were a bunch of comedic geniuses and this is definitely the movie that shows them at their best. 10/10",
      "review_date": "2013-01-03"
    },
    {
      "review_title": null,
      "content": "Hilarious film! Pieces of comedy genius that borderline on ridiculous. Would highly recommend to any slapstick comedy fan with any sort of sense of humour",
      "review_date": "2013-06-29"
    },
    {
      "review_title": null,
      "content": "this is one of the funniest movies I've ever seen. I still quote it on a regular basis. No matter how many times I see it I still laugh like crazy at parts like \"Please! This is supposed to be a happy occasion. Let's not bicker and argue overthis is one of the funniest movies I've ever seen. I still quote it on a regular basis. No matter how many times I see it I still laugh like crazy at parts like \"Please! This is supposed to be a happy occasion. Let's not bicker and argue over who killed who.\" By the way if you hate this movie it's probably because you're taking it way too seriously. A timeless classic worth seeing time and time again",
      "review_date": "2013-08-07"
    },
    {
      "review_title": null,
      "content": "This low-budget, cleverly written, well paced, and extremely charming film is a true classic amongst comedy films. A timeless masterpiece that undoubtedly achieves \"most quotable movie of all time\".",
      "review_date": "2013-07-21"
    },
    {
      "review_title": null,
      "content": "While a comedy, the film has so much more style and grace than most films that try to be like this film.  The actors have so much fun, the story is so witty and hilarious, the scenery is gorgeous, the animation is hilarious,etc.  This film isWhile a comedy, the film has so much more style and grace than most films that try to be like this film.  The actors have so much fun, the story is so witty and hilarious, the scenery is gorgeous, the animation is hilarious,etc.  This film is the funniest film ever made and will always be the funniest movie ever made.  The Knights who say 'Ni' agree 'IT' (oh that is a bad word) will be a hit for decades.  Classic hilarious movie.  Oh did I mention, \"IT\" is hilarious?",
      "review_date": "2013-07-18"
    },
    {
      "review_title": null,
      "content": "This movie is one of my all-time favorites. The rereleased version with interviews was an easy purchase to make, and watching the movie itself never gets old. My all-time favorite comedy, with some of my favorite actors.",
      "review_date": "2013-08-04"
    },
    {
      "review_title": null,
      "content": "The British comic masters at their finest. Never outstays its welcome, and every part bound lovingly into a coherent whole. Also has the best amount and usage of Terry Gilliam's animation, in comparison with their three other films.",
      "review_date": "2014-09-20"
    },
    {
      "review_title": null,
      "content": "A cult classic and remarkable comedy. Monty Python were amazing and I liked the black humor, ideas and cast. A lot of it entered pop culture history as “the holy hand grenade”, “the battle with the black knight” or “the coconuts”. Like theA cult classic and remarkable comedy. Monty Python were amazing and I liked the black humor, ideas and cast. A lot of it entered pop culture history as “the holy hand grenade”, “the battle with the black knight” or “the coconuts”. Like the title suggest it is the search for the holy grail by King Arthur and his knights. Of cause it is the Monty Python version with parody, satire, black humor and it is hilariously funny. I should warn you that the style of humor is not for everyone (but it is not the modern interpretation that it is **** However for me and my circle of friends it is an all time classic. We rewatch it from time to time and still enjoy it which became our definition for a “timeless classic”. The Monty Python team consisting of Graham Chapman, Terry Gilliam, Terry Jones, Eric Idle, John Cleese and Michael Palin directed, wrote and played most roles. This made it certain that they got their unique style right. As side note: Some say the movie is a bit episodic especially in the first half which is not wrong. Because they got not everything funded they had to film in stages. Also a lot of famous people sponsored them like Led Zeppelin and Pink Floyd. The rest was history as the movie became a success and earned a great reputation. I think it has some weaknesses or lets say it is not as much polished as their later movies but give a 10/10 no matter what.",
      "review_date": "2022-10-07"
    },
    {
      "review_title": null,
      "content": "'Nii!' Sir Lancelot dazzles in this timeless classic. A must see but not only for its esteemed reputation. Cleese delivers another hilarious oblivious performance, while the singing score and gorgeous English countryside add to this ironic'Nii!' Sir Lancelot dazzles in this timeless classic. A must see but not only for its esteemed reputation. Cleese delivers another hilarious oblivious performance, while the singing score and gorgeous English countryside add to this ironic treasure. A triumph of sharp and clever dialogue over special effects. Even now in a contemporary age of excessive and vulgar dark humour, this movie stands tall.",
      "review_date": "2015-06-06"
    },
    {
      "review_title": null,
      "content": "What other movie is there, where every single line is memorable and makes a good quote.  EVERY.  SINGLE.  LINE.  It's brilliant and doesn't waste a second.  Well, unless the animated pieces really aren't your thing, in which case you couldWhat other movie is there, where every single line is memorable and makes a good quote.  EVERY.  SINGLE.  LINE.  It's brilliant and doesn't waste a second.  Well, unless the animated pieces really aren't your thing, in which case you could say it wastes a few seconds on those.  You'd be wrong, but you could say it.  You could also say, \"WATCH THE SHRIMP DANCE THE BLUE NOSE FANGLETROUSERS THREE TIMES AT SUNSET,\" quite loudly as well.  Equally wrong.",
      "review_date": "2016-05-17"
    },
    {
      "review_title": null,
      "content": "After the brilliant Life of Brian, I was looking forward to watching Monty Python and the Holy Grail. And I loved it, I don't think it is quite as good as Life of Brian, but it is definitely one of the better Monty Python comedies for sheerAfter the brilliant Life of Brian, I was looking forward to watching Monty Python and the Holy Grail. And I loved it, I don't think it is quite as good as Life of Brian, but it is definitely one of the better Monty Python comedies for sheer hilarity and fun. The story like Life of Brian isn't the strongest component but this is in no way a criticism and yes the special effects are cheesy but perhaps that was the intention. My only problem with the film was that the ending is a little flat, but that is a minor criticism compared to how much I loved this film. The script is irreverent and highly quotable, and the soundtrack is even funnier. As a comedy it is wonderfully inventive, that debunks the Dark Ages and legends of chivalry through King Arthur, The Black Knight, God and the \"knights who say ni\". Comedy highlights include the trial with Connie Booth's witch and the Holy Hand Grenade of Antioch sequence. Even the sets are quite well designed and authentic. And the acting is simply wonderful, John Cleese, Terry Jones(the encounter with Dennis's mother was hilarious), Graham Chapman, Terry Gilliam, Michael Palin and Eric Idle perfectly live up to their exceptional talents. Overall, a great comedy and a great film. 9.5/10 Bethany Cox",
      "review_date": "2022-03-18"
    },
    {
      "review_title": null,
      "content": "In 1975, Monty Python released their first feature film, and comedy was never the same again. Monty Python and the Holy Grail is one of the silliest and funniest comedies I have ever seen. It takes wackiness to new heights with hilariousIn 1975, Monty Python released their first feature film, and comedy was never the same again. Monty Python and the Holy Grail is one of the silliest and funniest comedies I have ever seen. It takes wackiness to new heights with hilarious results. Almost every scene is comedy gold, with inspired silliness and tons of wit. If you like murderous rabbits, Knights who say \"ni\" and antagonistic French Knights, then this is the film for you. If you don't like madcap comedies, then this definitely isn't you're type of movie. Overall, a hilarious film from one of the most gifted comedy groups of all time.",
      "review_date": "2016-04-12"
    },
    {
      "review_title": null,
      "content": "Monty Python and the Holy Grail may feel illogical or stupid for modern viewers at the beginning, but the undeniably entertaining storytelling and surprisingly unforgettable laugh-to-gag jokes become this ridiculous picture on an everyday classic.",
      "review_date": "2017-06-08"
    },
    {
      "review_title": null,
      "content": "Fight for your honor and join for the quest of the Holy Grail..., of the most absurd chronic of King Arthur and the Knights of Round Table. An assorted thread of jokes that involves swedish subtitles, speeches about sparrows and offendingFight for your honor and join for the quest of the Holy Grail..., of the most absurd chronic of King Arthur and the Knights of Round Table. An assorted thread of jokes that involves swedish subtitles, speeches about sparrows and offending french invaders. For laugh until the tonsils hurt.",
      "review_date": "2018-05-27"
    },
    {
      "review_title": null,
      "content": "A ground-breaking classic. It's a sly criticism of then-current-day England through the lens of a famous historical quest... and it's just silly. The phrase \"It's just a flesh wound\" was one of the most stolen/over-used jokes of my childhood.A ground-breaking classic. It's a sly criticism of then-current-day England through the lens of a famous historical quest... and it's just silly. The phrase \"It's just a flesh wound\" was one of the most stolen/over-used jokes of my childhood. The film is an exercise in absurdity, and if you don't like absurd, this film won't work for you, but for me there are multiple laugh-out-loud moments.",
      "review_date": "2019-02-24"
    },
    {
      "review_title": null,
      "content": "Ah, what a memorable movie. It was a favorite of mine, but looking back at it, its not as amazing as I remember it. I mean, it still is one of the most influential and smart comedy movies out there. But a few scenes, just fall flat, andAh, what a memorable movie. It was a favorite of mine, but looking back at it, its not as amazing as I remember it. I mean, it still is one of the most influential and smart comedy movies out there. But a few scenes, just fall flat, and occasionally make you feel awkward. But the worst part is the sound. I mean, I know its the 70s, but I can barely hear a word there saying at times. The script and writing might be good, but the sound killed it for me. Anyways, everything else is magnificently put together, earning a solid 8.",
      "review_date": "2017-06-05"
    },
    {
      "review_title": null,
      "content": "how did you know that..Monty Python And The Holy Grail\n\nIt has an eerie comic tone that may not be palpable to everyone along with its way of conveying the tale, and once the audience goes past that, it would just be jibber-jabber thathow did you know that..Monty Python And The Holy GrailIt has an eerie comic tone that may not be palpable to everyone along with its way of conveying the tale, and once the audience goes past that, it would just be jibber-jabber that tickles here and there. The makers being aware of the vision throughout the course of it is what helps install these little moments that may surprise more than amuse someone. Terry Gilliam and Terry Jones have done a decent work on some of the sequences while on some of it, they seemed a bit distracted. On performance level, the actors are hilarious among the supporting cast and even cameos, that marks their impression in a finite screen time. Monty Python And The Holy Grail is a feature that takes its joke very seriously and clears out the priorities within its first few minutes but considering as a whole project, it is unfortunately forgettable.",
      "review_date": "2018-05-07"
    },
    {
      "review_title": null,
      "content": "First time watching this movie had me laughing. I'm surprise a movie this old still has such a great sense of humor. This is truly the best comedy movie of all time.",
      "review_date": "2019-02-22"
    },
    {
      "review_title": null,
      "content": "This has been a really weird experience which kinda made me think this was a really well done  troll movie or a pretty average comedy movie. Some of the parts were pretty meh and it felt like the director was taking a huge amount of drugsThis has been a really weird experience which kinda made me think this was a really well done  troll movie or a pretty average comedy movie. Some of the parts were pretty meh and it felt like the director was taking a huge amount of drugs before filming them which makes the humor get lost  while others were genuine and funny as heck.I  would suggest checking this out just because it is something fresh and unique in its own stupid way.",
      "review_date": "2022-02-05"
    },
    {
      "review_title": null,
      "content": "The Monty Python group has reached legendary status today so its hard to believe that during the making of this film (and when it came out) the group wasn't revered or worshipped as they are today. This was just another movie. Monty PythonThe Monty Python group has reached legendary status today so its hard to believe that during the making of this film (and when it came out) the group wasn't revered or worshipped as they are today. This was just another movie. Monty Python and the Holy Grail features the same kind of brilliant comic writing that characterized the best episodes of the television series. Everything, from Marxist rhetoric to scientific observations to religious doctrine, takes a beating. Most comedies saturate the audience with gags and jokes in the hope that one-third to one-half of the material might be funny. But, in The Holy Grail, there's hardly an attempt at humor that fails. That's a rare claim for any movie to make, but, even when a viewer isn't laughing aloud at this film, he or she will almost certainly appreciate the incisive intelligence evident in the Pythons' approach. This is a great place to start with Monty Python.(Big screen appearance of a legendary group).",
      "review_date": "2019-12-18"
    },
    {
      "review_title": null,
      "content": "This movie remains one of the best combinations of awkward and honestly not always funny scenes and some of the funniest sequences ever filmed.The fact that the quality of the comedy is so inconsistent only makes the final product evenThis movie remains one of the best combinations of awkward and honestly not always funny scenes and some of the funniest sequences ever filmed.The fact that the quality of the comedy is so inconsistent only makes the final product even funnier.Watching this movie is witnessing a group of madmen run around in medieval clothing, clacking coconuts together and talking about swallows without a care in the world, and that's just bloody wonderful, innit?",
      "review_date": "2020-09-25"
    },
    {
      "review_title": null,
      "content": "easyily my favorite comedy ever, its in my top 10 favorite movies of all time for being one of the most hilarious and greatest comedies ever, i would give it a ten but it had a very unsatisfying and garbage ending that really pissed me off",
      "review_date": "2021-03-10"
    },
    {
      "review_title": null,
      "content": "Pomimo tylu lat na karku, ta rewelacyjna komedia w ogóle się nie zestarzała i nadal bawi niemiłosiernie",
      "review_date": "2021-07-06"
    },
    {
      "review_title": null,
      "content": "If someone says there is no such a thing as stupid but genius, well Monty Python And The Holy Grail is the great example of it, the movie is incredibly hilarious, ridiculously stupid, they all breaking the rules, and it's fun, it'sIf someone says there is no such a thing as stupid but genius, well Monty Python And The Holy Grail is the great example of it, the movie is incredibly hilarious, ridiculously stupid, they all breaking the rules, and it's fun, it's entertaining, and it's just such a happy movie, it's a movie that not only will make you laugh if you love comedy or want to be laugh, it can be more than that, and if anybody make this such a movie again, it's either be the Monty Python or no others, Monty Python And The Holy Grail is a comedy genius, a stupid but genius film and a classic, and it's simply one of the best comedy ever, and so do one of mine.",
      "review_date": "2022-04-07"
    },
    {
      "review_title": null,
      "content": "Disarming in its large quantity of visual styles and parody, Monty Python's first feature length film delves head first into the Middle Ages and the Fantasy genre with jokes, wit, charm, and farts. All of the members contribute with anDisarming in its large quantity of visual styles and parody, Monty Python's first feature length film delves head first into the Middle Ages and the Fantasy genre with jokes, wit, charm, and farts. All of the members contribute with an unbridled passion, they are not afraid to take risks, and they are ready to surprise us with jokes that come straight out of left-field. Behind all of the silliness, lies a smart comedy film that has become an influential blueprint for other comedy films that went the extra mile.",
      "review_date": "2021-08-21"
    },
    {
      "review_title": null,
      "content": "One of the most cherished and renowned comedic films of all time is Monty Python and the Holy Grail. It has a really peculiar sense of humour and is very entertaining. One of the film's initial jokes was the moose captioned in the openingOne of the most cherished and renowned comedic films of all time is Monty Python and the Holy Grail. It has a really peculiar sense of humour and is very entertaining. One of the film's initial jokes was the moose captioned in the opening credits. That was a lot of fun. I also laughed when they said that llamas made the movie. As a guy and King Authur are discussing sparrows and coconuts at the beginning of the film, the man asks, \"Are you proposing coconuts migrate?,\" which I found hilarious.",
      "review_date": "2023-02-16"
    }
  ],
  "num_reviews": 82
}