{
    "rating": 9.2,
    "release_date": "1977-01-01",
    "num_reviews": 270,
    "genres": [
        "Romance",
        "Comedy"
    ],
    "summary": "Comedian Alvy Singer (Woody Allen) examines the rise and fall of his relationship with struggling nightclub singer Annie Hall (Diane Keaton). Speaking directly to the audience in front of a bare background, Singer reflects briefly on his childhood and his early adult years before settling in to tell the story of how he and Annie met, fell in love, and struggled with the obstacles of modern romance, mixing surreal fantasy sequences with small moments of emotional drama.",
    "reviews": [
        {
            "content": "Allen's turning point. Annie Hall (1977) it's the beginning, the first act of a new way to make movie, in particular romantic and comedy movie, which will be the trademark of Allen's filmography, in his dual role of director and protagonist. The movie indeed tells the story of a breakup from the point of view of Alvy Singer (Allen), and Annie Hall (Diane Keaton); he traces at the same time the story of their relationship and of his life. Through his ironic, sharp and selfish eyes, the protagonist takes us into the everyday life by reviewing the little and big things, like queuing for a movie or killing a spider on one hand and realising that the girl you left by mutual agreement, which you criticized over and over, was the right one on the other. Due to a genial screenplay, accompanied by a montage that keeps up the ryhthm, the movie doesn't never lose his thread and offers some of the most beautiful romantic scenes ever made (it's impossible to write them all down). Remarkable the cameos of Paul Simon, Christopher Walken and Shelley Duvall. Oscar for the original screenplay, actress in a leading role (Diane Keaton), best picture, best directing.",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "Wow, Woody Allen is insufferable. One star for Diane Keaton and one for the comedic timing/overall concept. I am still confused as to how this managed to be awarded Best Picture…",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "Nadia Comaneci once scored a perfect ten for her Olympic gymnastics routine. Woody deserves  the cinematic equivalent. This film is full of unique touches: animation, split screen psychoanalyses, duelling thought quotes, etc. Equally funny and warm and, thank God! Finally a film that dares to be intelligent! The downbeat ending is famous, deservedly so.",
            "review_date": "2022-12-12",
            "source": "rt"
        },
        {
            "content": "For me, it is simply the best comedy!",
            "review_date": "2022-10-14",
            "source": "rt"
        },
        {
            "content": "Woody Allen's magnum opus and is one of the most well written films I've ever seen.",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "After this film I love Different Filmmaking Styles",
            "review_date": "2022-08-18",
            "source": "rt"
        },
        {
            "content": "I haven't watched a lot of comedy, but for what I have seen, this movie seemed unique in it's style.  I felt like I was watching an episode of Seinfeld in a way, though this is before Seinfeld's time.  Nice love story.  Funny Cast.  Short guest appearance by Jeff Goldblum, you can't go wrong!",
            "review_date": "2022-08-10",
            "source": "rt"
        },
        {
            "content": "Very unique and well done",
            "review_date": "2022-08-06",
            "source": "rt"
        },
        {
            "content": "this might be the funniest movie of all time",
            "review_date": "2022-07-21",
            "source": "rt"
        },
        {
            "content": "As with almost every Woody Allen picture, he is playing himself, showing us a glimpse into his life. For better or worse, it's an hour of flagellation and patting his own persona. This is very specific humor that, in my experience, will either annoy you or cause you to miss the highbrow references Allen is throwing at you, as in Love and Death, for example. Aside from that, his films, or rather his experiences, should either resonate with you or once again irritate you, as you gradually start to hate the character. Annie Hall is probably the most universally liked of all of his repertoire. Due to the acting and inventive and well-edited scenes. Growing comfortable with your own happiness and eventually stopping, appreciating it, and only realizing what you have done once it's gone is immensely relatable. Especially in the way that Allen frames it. It is not some kind of pompous tragedy. It's just another microcosm of life. And as the final frame suggests, for him it's the most painful separation of his life, but for anyone else it's just a view from a window.",
            "review_date": "2022-05-02",
            "source": "rt"
        },
        {
            "content": "Poignant, humorous, innovative---\"Annie Hall\" is that rare kind of movie that gets better the more you see it.  Diane Keaton is superb as the heroine who grows up as we watch, and Woody Allen is his typical nervous, anxious, neurotic persona.  But what I really love about the film is the ways that it breaks down the barriers between itself and audience, the ways it shifts tempos and points of view and time so that we get a stream-of-consciousness recreation of Alvy Singer's greatest love that in spite of everything goes off the rails.",
            "review_date": "2022-04-12",
            "source": "rt"
        },
        {
            "content": "Not everybody will love Woody Allen's humour, some will find him interesting and sharply insightful while others will find him self-indulgent. With me, it veers very largely towards the former with some occasions where the latter does creep in. Annie Hall is one of his best films, a masterpiece and one of the better Best Picture winners of the 70s with only the two Godfather films even better. The best assets are the script and the chemistry between the two leads. The script is enormously witty, with cracking dialogue that induces one and at times more laughs a minute, and full of insightful observations. People have deemed it one of the best screenplays of all time, and from personal perspective there is no reason to argue. The chemistry between the two leads, running somewhat on a parallel between the relationship of Woody Allen and Diane Keaton itself, and the actors in general actually is throughout very believable. It is often adorable and often dynamic. It helps that Diane Keaton gives one of her best and most endearing performances, and while Alvy is not a particularly likable or sympathetic character Woody Allen is similarly great, his looking into the camera and breaking the fourth wall moments were funny. The supporting cast all give spirited performances, especially Tony Roberts, Paul Simon, Carol Kane and Christopher Walken, Jeff Goldblum is memorable as well for one of the film's best and most quotable lines. The romance is sweet and relateable, the ending for me was really moving, but the story doesn't depend on that alone, Allen also muses over topics that were relevant then and that we can see as relevant today as well, he does so in a very thoughtful way. Allen directs with assurance, and while there have been more visually audacious Woody Allen films since Annie Hall it is still cleverly made with the way it's shot, the cartoon images and how we're shown visually what the characters are thinking. There is no music score and in this case that was a good idea, there was more leeway for the relationship between the two lead characters and observations to speak, and that's the same for the deliberate but never tedious pacing. Overall, an outstanding film, one of Allen's best and one of the greatest films of the 70s. People may dislike it for it winning Best Picture over Star Wars(this viewers and many others however think it fully deserved the win), as much as I'll have a fondness for the Star Wars original trilogy and consider it a milestone of its genre it is easy to see out of Star Wars and Annie Hall which is the superior film. 10/10 Bethany Cox",
            "review_date": "2022-03-22",
            "source": "rt"
        },
        {
            "content": "Most fun you can have while laughing",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "A rare instance where the humor still carries over many years later. You don’t have to understand the references to still laugh at how they are delivered. I see this movie as a serious rom com, one that explores the complexities of romance and relationships with a focus on analyzing the ins and outs rather than delivering a feel-good ending.",
            "review_date": "2022-03-01",
            "source": "rt"
        },
        {
            "content": "I indulged myself in the enjoyment the very funny comedic writing and portrayal of Woody Allen. He is a very problematic human being but made great movies in his career that capture the New York ethos.",
            "review_date": "2022-01-19",
            "source": "rt"
        },
        {
            "content": "On paper, Woody Allen's Annie Hall looks like just another romantic comedy.  In reality, it is so much more than that.  Allen plays Alvy Singer, an intellectual and a comedian, who over the course of the film analyzes his relationship with the flighty but intriguing Annie (Diane Keaton).  While there's not a whole lot of plot to talk about, the brilliant dialogue more than makes up for it.  It is funny.  It is insightful.  It is touching.  And it is smart.  While Allen's speaking directly to the camera and breaking the fourth wall is a constant distraction, the movie features excellent performances from the two leads (most notably by Keaton) with plenty of lengthy takes that allow the characters to do their thing.",
            "review_date": "2021-12-23",
            "source": "rt"
        },
        {
            "content": "The only thing that is necessary to say here, is that it is absurd this film doesn't boast a 100% Fresh grading. Not that Rotten Tomatoes means jack shit to an artist, or anyone. However, in this sad, internet, disconnected world of false reality, lack of creativity, and an overall malaise, it is easy to understand how some morons might come to this page in modern times, and give it anything less than what it deserves. Which is 100%. This is a groundbreaking film that changed the way interpersonal stories were told in America, giving birth to a whole new genre and style. Woody Allen is the greatest American writer/director, and his films are the most re-watchable films ever made.",
            "review_date": "2021-11-07",
            "source": "rt"
        },
        {
            "content": "This Woody Allen film sees him playing a comedian as we go through the span of his relationship with Annie Hall, played by Diane Keaton.  Typical Allen flick with a lot of pontificating and trying to figure out why his relationships ultimately end abruptly. \nAlways witty, though slightly dated, it's always a joy to put on a Woody Allen film and just get lost in his problems.",
            "review_date": "2021-10-23",
            "source": "rt"
        },
        {
            "content": "Annie Hall has an essential impact on cinema of all time. Woody Allen's masterpiece is as innovative as it is funny, and has one of the best screenplays of all time. Allen's innovation goes beyond the cinema of humor, and sets standards in the filmic structure of many subsequent films, a benchmark in the romantic comedy genre that can only be compared to the effect of Citizen Kane and Vertigo on the structure of cinema of all time. The comedy uses language tools such as breaking the fourth wall, a non-linear narrative, and satirizes the exaggerations of urban life and relationships in general. A masterpiece of cinema and my favorite film of all time!",
            "review_date": "2021-10-07",
            "source": "rt"
        },
        {
            "content": "It's not that great movie.....what it had achieved....in this movie...Woody Allen... talking like a robot....lots of dialogue...in a romantic movie... that's unfair...there was no art in cinematography....the strength of this movie is screenplay...not more than that...no director's art stamp in this movie...after all it didn't deserve Oscar...but back then...there were lots of dark comedies in Academy... it's not 100% pure..back then....",
            "review_date": "2021-06-21",
            "source": "rt"
        },
        {
            "content": "This is a fantastic work of art. I absolutely loved it and it is a 100% must see for film buffs.",
            "review_date": "2021-06-07",
            "source": "rt"
        },
        {
            "content": "Extremely witty and relatable social commentary on relationships. Made in the 70s but still applicable to contemporary relationships.",
            "review_date": "2021-06-01",
            "source": "rt"
        },
        {
            "content": "Of the handful of Woody's movies that I've seen this is certainly the funniest, with some of the best one-liner jokes I've heard in a movie -- my wife in particular got a belly laugh from the joke about bad vibes. This was very well-rounded in that it had a great cast, screenplay, characters and cinematography but some of the parts seen as all-time great like Keaton's performance and the level of comedy have been eclipsed by later movies that most certainly did it better, similar to how 2000's X-Men was a great superhero movie that's been improved upon as the genre grew. Surely this movie was the inspiration for later greatness like When Harry Met Sally, where Sally is a far more interesting & quirky lady than Annie is in this movie. While this is the best of Woody's movies that I've seen I still prefer his later work where they're plot-driven instead of character-focused as the ones where he plays the romantic lead come off as narcissistic sometimes, and he provides himself better opportunities for jokes when there's a fresh & intricate plot to draw from. I can only hope that one of his plot-driven movies is as good in that category as this one is for rom-coms. Anyway, a great-but-not-excellent viewing experience!",
            "review_date": "2021-05-03",
            "source": "rt"
        },
        {
            "content": "This movie sucked. Movie is only rated high because Woody Allen made it.  Not a very memorable movie.",
            "review_date": "2021-04-26",
            "source": "rt"
        },
        {
            "content": "A hilarious script uplifted by Woody Allen's signature direction and a charming performance from Diane Keaton made Annie Hall a classic.",
            "review_date": "2021-03-31",
            "source": "rt"
        },
        {
            "content": "Commedia tra le migliori del regista; che con la sua solita autoironia e la sua musa Diane Keaton, sfodera un gioiello per la piacevolezza e la leggerezza con cui si guarda il tutto.\nIl tratto distintivo rispetto a tante altre commedie di Woody Allen, è che oltre all'ironia, viene rappresentata una storia vera, credibile ed in cui tante persone si possono rivedere; un tratto che troppo poco, negli anni successivi, è stato esplorato dal regista.",
            "review_date": "2021-03-20",
            "source": "rt"
        },
        {
            "content": "Really boring, not really funny at all and Woody Allen doesn't bring any weirdness into this one, to make the film at least a little interesting. I don't know why, but I tortured myself through this, just to realize, that it's a no from me.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "A: 4/5\nE: 4.5/5\nR: 8.5/10",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "Funny and quirky, but felt repetitive.",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "Such an epic script. Real, believable conversations. Awesome fourth wall breaks",
            "review_date": "2020-11-18",
            "source": "rt"
        },
        {
            "content": "Diane Keaton and Woody Allen chemistry is absorbing and deeply charming, probably Allen's finest work, you can't stop smiling through all the film.",
            "review_date": "2020-10-26",
            "source": "rt"
        },
        {
            "content": "AFI 100 Greatest Films - #31: The dialogue is where Annie Hall most earns its merit and the evidence of this films influence on the romantic comedy can be seen in countless films since. Allen, Keaton and the excellent supporting cast create engaging snapshots, illustrating different moments throughout a relationship, to which the actors bring a commendable level of authenticity and feeling.",
            "review_date": "2020-09-22",
            "source": "rt"
        },
        {
            "content": "I'll really never understand why audiences find woody allen whining and complaining for 90 minutes entertaining.  This is one of those movies you find on many lists and I just never understood how it got to deserve so much praise.  Had to turn it off once I realized it was just going to be scene after seen of woody complaining and a girl loving it.  I think to make a good woody movie the first requirement is woody not being in it.",
            "review_date": "2020-09-10",
            "source": "rt"
        },
        {
            "content": "Insufferably smarmy and self absorbed.  If lines like \"You are in a bad mood.  You must be getting your period\" and  \"I don't like to show my body to a man of my gender.  You never know what's going to happen\" is your idea of comedy then this one is for you.",
            "review_date": "2020-09-03",
            "source": "rt"
        },
        {
            "content": "Annie Hall: \"It's so clean out here.\"\n\nAlvy Singer: \"That's because they don't throw their garbage away, they turn it into television shows.\"\n\nIf someone ever asked me what some of the best screenplays are out there, the first would be ‘Pulp Fiction' and the second being ‘Annie Hall'. A remarkable movie, unlike anything before or since. The visual storytelling adds to the sharp comedic charm. A prime example of life imitates art.\n\n‘Annie Hall' is a romantic comedy that defies movie conventions. It's no Hollywood fluff, nor is it a depressing soap drama. It's a movie that looks at the ups and downs of relationships, because relationships aren't that black and white. It finds the right balance that you rarely get. It politely destroys your fantasies by introducing a little reality.\n\nI know Woody Allen is a controversial figure, especially in our times, but I will be dishonest to myself if I did not think this guy is a freaking genius, in terms of his film making and writing.\n\nThe chemistry between Annie (Diane Keaton) and Alvy (Woody Allen) can be best described as complicated. Alvy is an New York Jew who thinks out loud about his likes and dislikes with a timorous attitude, which 16 years of therapy seems to keep him grounded. While Annie is a Midwestern girl who is aspired to be a singer. An unlikely relationship that you would not expect to see, but a memorable one either way. The brilliant thing about it is that you totally believe in the relationship.\n\nDiane Keaton was absolutely mesmerising in this movie and deserved that Oscar win for her performance. There's a scene in this movie where we see Annie sing the song ‘Seems Like Old Times' at a bar in a two-minute uncut shot. No cut away to the audience reactions or anything, the camera is locked onto her and the film lets the song play out. Besides her beautiful singing voice, she is doing some of the best eye acting I have ever seen. Watching it felt like a hypnosis, it puts you in a trance.\n\nThe writing and directing from Woody Allen were just superb. It is a \"lighting in a bottle\" type of situation that not even Allen himself could top it, nor does he need to. There is not a line unquotable or a word wasted. The visual gags are simply hilarious and extremely clever. The jokes themselves are not played for cheap laughs, but because there are funny and sometimes go beyond that.\n\nThe movie doesn't just focus on relationships, but narcissism, drugs, politics, and religion in 70's society. Whatever was on Allen's mind at the time that he could not contain in his head.\n\nOverall rating: We need those eggs",
            "review_date": "2020-08-27",
            "source": "rt"
        },
        {
            "content": "Very boring film, wood alen incredibly boring, even if they say that this is the proposal, I hated it, the only good things about the film are Diane Keaton's performance and the unusual breaking of the fourth wall, which was cool in some points, I recommend that they pass away from that film all those who are curious as to why he had so many awards and nominations",
            "review_date": "2020-08-23",
            "source": "rt"
        },
        {
            "content": "An insightful, thoughtful, realistic, honest, brilliant, witty, tragic and comedic look at romantic relationships, with poignant performances, a smart script, a compelling direction, thought-provoking themes worth analyzing, and a quirky style, which makes it one of the most influential and iconic romantic comedies of all time, and undeniably Woody Allen's masterpiece.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "Brilliant screenplay. The best rom-com ever made with lots of clever tricks and techniques that you just don't see in other movies. Very deserving of the Best Picture Oscar that it won.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "This is the 4th Woody Allen film I watch, it is possibly the most acclaimed among them and, coincidence or not, it was the first in which I had to stop in the end to think about whether I had trully liked it or not. The other ones (Midnight in Paris, Broadway Danny Rose and Whatever Works) were much lighter movies in which it seems you just have to get on board and enjoy it. In this case, it seems that more attention is necessary to grasp the details that are left unsaid or smoothly inserted, putting the pieces together. After some thinking (probably biased by the acclaimed criticism) I realized I did like it for a few reasons but it was a new Woody Allen experience for me. One first reason why I liked it was that, much like the other films, this one also had that acid and sutil humor which is very much my kind of humor. The way jokes are told sometimes unintentionally is great, sometimes hidden in clothing choices or the way people speak in L.A. Unlike the other films I have watched, this one seems to have an additional layer of complexity in the main character, Alvy, who seems to have so much going on in his head that he appears to enjoy the past more than he does the present. There is the strong sexual desire present since his young years, the inherent depressive mood regarding the future, the constant need for attention that makes him a bad listener in several occasions when the topic of conversations is not him. There is also the need to constantly criticize his girlfriends and almost make an effort to oppose to them, even if the girl of the moment looks more like him than he acknowledges. He is a complicated guy that has complicated relationships but clearly Annie Hall stands out in those failed affairs. Still, he tries to shape her even more like him, instead of recognizing how their constrast might be the reason why they work out. Both of them seem to like each other but also seem to know each other too well to know that any attempt to get back is likely to turn into another failure, leading both of them to more therapy sessions. It was not the best film from Woody for me, what makes me curious to know what is the critic view on this one. However, it is still an interesting love story about two complicated people with some bits of humor here and there.",
            "review_date": "2020-08-13",
            "source": "rt"
        },
        {
            "content": "I always knew of woody Allen . Mostly thru creepy stories I heard . I never realized how smart of a guy he was . There was something about trying to understand the intellectual jokes in this movie that I really liked . On numerous occasions I paused to look up words . I’d be lying if I said I understood every joke but I tried . I’m also assuming this was a ground breaking movie for it’s time . Woody, id imagine was one of the first directors to break the 4th wall I believe it’s called where the character breaks from the scene to talk directly to the audience with the assumption the people in the movie aren’t hearing what he says . This was an interesting movie and way ahead of its time 3.7. I am a sucker for subtle jokes .... “that’s ok we can walk to the curb from here” after the terrible park job . I also liked when the Grandmom saw him as a Hasidic Jew . They don’t throw their trash away out here they turn it into television shows",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "I think Annie Hall is the best Romance / Comedy movie that I have ever seen in my whole life, an amazing and a classic movie that I really enjoyed. \n\nFirst of all, before anything lets just talk about Annie Hall as the movie that was released in 1977, that's an important note that everyone should know because if we are going to compare it to other \"Romance / Comedy\" movies that were released after it then that's a whole different issue.\n\nAnnie Hall is a movie that I was surprised that I liked it and gave it a 9/10, the movie is just full of talking and conversations, nothing really exciting happens (if you are not into these movies then this movie is definitely not for you and you'll really get bored), but when there is a movie that's like that and it grabs your attention by the little stuff and details that it has, that's when you know that you are watching a great movie.\n\nThe first 20 or 30 minutes of the movie was boring a little bit and felt like there the story isn't being told well, but as I started to watch more and more of it, that's when I started to really enjoy the movie and wanted to know more about their relationship life and their daily life in general.\nReally really loved how in one of the scenes it's literarily written what they were thinking about inside their heads, and the movie shows us that in many different ways and that's what I loved about the movie. So many movies nowadays show us what a character is thinking inside their head and it's not a new thing, but in 1977 I think it was a new thing. \n\nThe directing was absolutely incredible, Woody Allen did a fantastic job and really deserved an Oscar for that. The screenplay was really well written and I mention how I loved how the story was told to the audience. The customs were so very fantastic, cool and simple and did really fit the characters so well and with the environment around them, and yes I'm talking about Annie Hall's (Played by Diane Keaton) customs in the whole movie but the one that really grabbed my attention and everyone's I think, was the one with the weird tie.\n\nDiane Keaton was amazing in that movie and really deserved that Oscar for best actress in a leading role, her awkwardness, her acting and everything in her was just amazing in that movie, amazing performance hats off to her, Woody Allen was also amazing and did a great job of making us laugh the whole movie, I mean the whole movie, in general, is funny and it has some jokes that were funny, it did a great job in that part in particular. \n\nAnnie Hall is a great and a classic that is not for everyone unfortunately and I'm sure many people will say that it's overrated or it's boring and I get it why they say that but for me the movie was amazing and I enjoyed every scene in it, definitely deserved an Oscar for best picture. \n\nMy rating is: 9/10",
            "review_date": "2020-07-24",
            "source": "rt"
        },
        {
            "content": "Before I start, I want to bring up that I can't stand Woody Allen not because he's a bad filmmaker or comedian, but because he keeps making the same movie over, and over, and over again. The awkward artist (Alvy Singer (Woody Allen)) is in love with the beautiful woman (Annie Hall (Diane Keaton)), they hit up a date in New York City, the man lets his nerves get over him, and the two break up in the end. Also, Woody Allen will incorporate a piece of autobiography into the dialogue or characters and references to Freud as only an excuse to make him more relatable. Then again, Annie Hall is the predecessor to his typical romantic comedies and it's fine for what it is. I was amused by the fourth wall breaks, then again I love these types of jokes. Also, I got chuckles from The Godfather reference from Alvy at the beginning as well as instances where he and Annie interact with shadows from the past. However, I most likely enjoyed the cameos from actors who would become famous in their own right, including Carol Kane, Shelley Duvall, Sigourney Weaver, Christopher Walken and Jeff Goldblum. Unfortunately, some jokes in this movie don't fly with the coordinates with the story, such as the weird sequence with Alvy and the Evil Queen from Snow White. It's a cute quirky reference but there's no other jokes like it, so it's out of place. Even though the jokes range from clever to cerebral to downright strange, Annie Hall is still a decent movie worth seeing with your date.\n\n(3 ½ Lobsters out of 5)",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "Simply a perfect film in each and every respect. Just keep the specter of the \"real\" Woody Allen out of your head.  It's flawless.",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "Perhaps my least favorite film of all time. So frantic and the characters are so unlikable I  couldn't believe people didn't leave the theater let alone that they consider it a classic.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "Refreshing... It was on my bucket list for a long time... Though its a 70s movie felt really novel",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "It's a classic for a reason BTW most people know about this is that this beat Star Wars for best picture at the Oscars.",
            "review_date": "2020-06-19",
            "source": "rt"
        },
        {
            "content": "Woody Allen's character in this one(and a lot like his others from what I can recall) is just so damn annoying. Probably the biggest whiner in cinematic history I'd say. Some of the fourth wall stuff was not bad, a young Diane Keaton looking pretty cute, also a really small part by Christopher Walken and a blink or you'll miss it cameo by Jeff Goldblum. That's about the only pluses in this movie for me.",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "Self-indulgant, unfunny, and unbelievably neurotic. Easily the most overrated comedy of the ‘70s.",
            "review_date": "2020-05-26",
            "source": "rt"
        },
        {
            "content": "There is lots to like but the film succeeds and fails based on how you like Woody Allen. the film does appear at times like a documentary chronicling relationships and his upbringing.  He does say an awful lot and quickly. Diane Keaton is the best thing in the film. Her quirkiness, her innocence initially and her awkwardness. She is very natural and i found her very funny. Woody is the eccentric with his own personal opinions, and it works as he has many failed relationships. He jokes about this throughout. He likes death and is very opinionated which is his undoing.  The structure shifting from different time periods and also has the characters watching the past happening and commenting.  There are many memorable quotes and its at times clever. Don't knock masturbation. It's sex with someone I love. Some of the references go over my head and some bits are achingly painful and funny. The scene with the subtitles with what they are thinking is clever and for a first date feels accurate. We see the two marriages of Woody's character and we see how they differences are severe and why the marriages end. It has a nice start to the film, with the fairground and the scenes in the school with the children mentioning where they are now. Its not conventional and that's what draws me in. Its a short film and better for it. Its nice to see this romantic drama get recognition against the big box office hits and the more violent movies that engulfed the 1970s.   A film that over analyses everything and everyone which is Woody's character and Keatons. I enjoyed the animation part and it was clever in the story. You can Woody's charm initially and how women are drawn to him but ultimately what will eventually annoy them.",
            "review_date": "2020-05-21",
            "source": "rt"
        },
        {
            "content": "A classic and amazing movie for me. Everybody needs  To watch this movie before to sleep.",
            "review_date": "2020-05-15",
            "source": "rt"
        },
        {
            "content": "Not my type of movie, but I can see why people think this is an offbeat comedy classic.  Woody Allen experiments and challenges the basic conventions of the romantic comedy genre.  The movie has numerous elements of visual invention that make the story more interesting.  If you like Woody Allen type movies, I would recommend this movie.",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "I am not, nor ever have been, a fan of Woody Allen. So to spend 90 minutes watching the world through the eyes of his character was excruciating,  I had hoped that with all the hype around this movie I might be able to view it and change my mind. I didn't.\n\nI know many reasons why this movie is considered culturally significant and important. And I know it is universally loved. But I won't be joining the lovers! Diane Keaton's befuddled exasperation is as old and tired to me as Hugh Grant's off the cuff sarcasm. I've seen it before, and it seems to be all she has to offer. \n\nI did chuckle at the sub-titled rooftop scene, the split-screen family dinner, and Paul Simon was a nice break from all of Woody's whining. Plus an unexpected cameo by future Charlie's Angel, Shelly Hack! And the last 15 minutes as Woody returns to Los Angeles to give it a final try was a nice ending. But I'm glad this one is in the rear view mirror.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "Exaggerated, neurotic, unfunny. Ultimately, boring.",
            "review_date": "2020-04-27",
            "source": "rt"
        },
        {
            "content": "A masterpiece, what a love story, so funny but so true",
            "review_date": "2020-04-26",
            "source": "rt"
        },
        {
            "content": "It seems that Allen's accusations have caused his star to fade in the popular consciousness over recent years, which is unfortunate given the quality of this film. The comedy is uniquely diverse and is integrated so well into the narrative, and only reinforced by Keaton and Allen themselves. The differences in tone between New York and Los Angeles, and how the characters respond to each, is great. (4.5/5)",
            "review_date": "2020-04-18",
            "source": "rt"
        },
        {
            "content": "Awkward, light-hearted, witty and mildly dark, Annie Hall is just an amazing rom-com with a near-perfect screenplay.",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "It could be argued that Annie Hall is the only Woody Allen film you'll ever need to see. That isn't to say you shouldn't see any of his others, or that they are all alike (his earlier films are notably different in style), but it's so quintessentially associated with him and so well known that for many cinema fans it has become his defining moment.\nAnnie Hall is a remarkable motion picture. Essentially a romantic comedy, it has an almost vanishingly slight story as Allen's character Alvy Singer reflects on his relationship with Diane Keaton's titular Annie and why it came to an end. But it isn't the story that makes the film so impressive, and it isn't why it won the Academy Award for Best Picture: everything else is. \nThe film begins with Alvy talking directly to the camera, immediately introducing the audience to his fast-talking, neurotic persona, before flashing back to his childhood to illustrate his early concerns about life, death and sex. This sets the tone for what follows, as Allen plays games with conventional narrative structures both as scriptwriter and director; he breaks the fourth wall throughout, often addressing the viewers directly and asking them to take his side in arguments. He deliberately subverts his own narrative with a variety of different mechanisms, such as when he appears as the young Alvy in a schoolroom scene incongruously surrounded by child actors, and when Alvy and Annie wander into their own flashback to comment on past events.\nCinematographer Gordon Willis has a realistic style that makes the film look almost like a documentary at times, and Allen then deliberately punctures this style by having Alvy insist on split screens, or talking to passers-by in an unreal fashion, or drawing attention to a cameo by Truman Capote, or being rendered into animation to appear alongside the Queen from Disney's Snow White and the Seven Dwarves. The result is a film in which half of the filmmaking is so subtle that you might not even notice it whilst the other half demands attention. \nAnnie Hall asks us to believe in its fiction whilst constantly refusing to let us. The film creates a version of New York City that is entirely fictitious, and yet has become iconic: everybody has analysts, nobody is poor, the characters all work in the entertainment industry. Allen does the same with his characters: he's the most unlikely of romantic leads, short, slightly shabbily dressed, balding and with thick-rimmed spectacles, and yet he plays a character with all of those traits who is nevertheless endlessly attractive to beautiful young women. He gives us the impression that he is a naturalistic performer simply because he's so totally believable as Alvy that people often think – incorrectly – that he's playing himself. Whether anyone like Alvy actually exists becomes irrelevant – we can believe that he is real and that is the point. \nThis characterisation sleight of hand allows Allen to draw the audience into the world of a man who instantly stereotypes Allison Portchnik in an awkwardly delivered monologue when they first meet and then talks himself out of having sex with her by worrying about who shot JFK just as they are about to make love. He is a man who is insecure in his sexuality to the extent that he won't get undressed if other men are present. He over-analyses everything, and is constantly obsessing with the most bizarre things. He is – in short – a character who should never be anything other than profoundly irritating, and yet Allen brings an openness and honesty to him that makes him endearing against all the odds. It becomes Alvy's very awkwardness and insecurity that makes him likeable. The same is true of Diane Keaton's Annie: she's no more believable as a real human being than Alvy, but the script – and Keaton's equally naturalistic performance – convinces us not only that she is real but that we should like her.\nAllen the writer perhaps bears greater responsibility for the success of Annie Hall than Allen the actor or Allen the director. Eminently quotable (\"Don't knock masturbation. It's sex with someone I love\"), the film has many jokes that aren't especially funny, but they come so thick and fast that they batter the audience members until we capitulate and start laughing. More often however, it's genuinely laugh-out-loud funny, for example when Alvy and Annie are having a conversation whilst subtitles show us what they really think. The writing isn't just funny, it's also clever, as Allen plays with stereotypes throughout, in often hilarious fashion, through lines such as \"Don't you see the rest of the country looks upon New York like we're left-wing, communist, Jewish, homosexual pornographers? I think of us that way sometimes and I live here.\" Allen particularly pokes fun at Jewish stereotypes, not only making Alvy a stereotype but making Alvy worry that the Hall family will see him as even more of a stereotype than he actually is. \nAside from Alvy and Annie, characterisation is sacrificed for plot functionality, but the supporting characters – one-dimensional though they are – are wittily brought to life by a large supporting cast that is a delight for cameo spotters, with small roles for Christopher Walken, Jeff Goldblum, Shelley Duval, Sigourney Weaver (in her film debut) and Paul Simon. It's another ingredient that makes Annie Hall such a delight. Its only flaw is that during the last third of the movie, the slight plot runs out of steam, the jokes start to dry up and only cinematic and directorial tricks remain to entertain. But Allen makes up for this with the poignant finale and its montage of clips from earlier in the film, and with a running time of only eighty-nine minutes it doesn't have time to outstay its welcome. Annie Hall is a technically impressive film, but more than that it's a real joy to watch.",
            "review_date": "2020-04-11",
            "source": "rt"
        },
        {
            "content": "A gentle rain of phrases and thoughts about love, perhaps one of the most psychoanalytic films of his career, Woody Allen finds a touching harmony between comedy and romance without falling into clichés while breaking the fourth wall with class.",
            "review_date": "2020-02-28",
            "source": "rt"
        },
        {
            "content": "At the time it came out, it was a huge hit. At that time in his career, Allen's neurotic persona was the main character of his films. His ethnic neurotic shtick was different than what everyone else was doing, and came off as fresh and funny. He brought in Diana Keaton to play her WASP neurotic persona as his love interest. Allen and Keaton had a winning formula for the 1970s Jewish neurotic plus WASP neurotic, equals successful comedy. \"Annie Hall\" was Allen's first deeper satire and it was successful to the extent of Oscar possibilities. Keaton won the Best Actress Academy Award as the title character and while he didn't win for his performance, Allen won for directing & co-writing the screenplay. Fine film.",
            "review_date": "2020-02-08",
            "source": "rt"
        },
        {
            "content": "Charming, SO Charming I luff it. Woody Allen builds a unique and great atmosphere in his films.",
            "review_date": "2020-01-08",
            "source": "rt"
        },
        {
            "content": "Allen and Keaton are at their best here, and their chemistry is off the charts. Add this to some of the best Allen screenplays and you have an all-time NY classic.",
            "review_date": "2019-12-28",
            "source": "rt"
        },
        {
            "content": "Can't say I've seen all of Woody's films like some, but I'm just gonna assume this is Allen at his most Allen; neurotic, 4th wall breaks, self-deprecating Jewish jokes, split-screens, non-linear timelines. Fantastic.",
            "review_date": "2019-12-19",
            "source": "rt"
        },
        {
            "content": "An iconic and extraordinary movie. Diane Keaton and Woody Allen both are fabulous.",
            "review_date": "2019-09-20",
            "source": "rt"
        },
        {
            "content": "Clàsica comedia setentera.",
            "review_date": "2019-09-16",
            "source": "rt"
        },
        {
            "content": "Allen and Keaton are easy on the eyes, I can say that from looking at their body language for verbally they are just bickering.\n\nAnnie Hall\n\nAllen has written a \"how to\" book. And coming from a guy who never liked or fell for such \"how to\" genre, it is incredibly beautiful to see someone break down a genre and place it in front of you with expressive wonder that they feel and are also able to communicate so effortlessly and effervescently. There are so many things and themes to learn and inspire from that the writer and director, Woody Allen has to inhale deep long breathes separately along with us, for in order for him to exert an enormous amount of energy in one monologue, in one scene and us, simply to consume it all.\n\nAnd I love this film for it speaks through a language that I find myself familiar with. And over the years, I always thought that the crux in Allen's art is how to place jokes in a narrative sensibly and smoothly. But now that I saw it today, I feel like it is the other way around. And yes, you can clearly see that in both, his epilogue and prologue speeches, where he derives the meaning of life from pretty standard jokes. But it is not just that.\n\nThe film often jumps back and forth in timeline for the sake of the joke. And usually in a film so big, with bigger ambitions, bigger themes, the film couldn't just point out to that funky looking graffiti in a royale-ish art museum as such. But this is Allen's genius. He has left out the trails for you to search for the jokes and the context it scoops up from those punchlines, it is a charmingly flirty stand up act. Annie Hall is a \"how to\" film, how to break the fourth wall, how to picturize flashbacks, how to mock your own absurd values, how to tell a joke and how to romanticize a love story.",
            "review_date": "2019-08-25",
            "source": "rt"
        },
        {
            "content": "This is a classic. Hilarious & fun.",
            "review_date": "2019-06-06",
            "source": "rt"
        },
        {
            "content": "Diane Keaton is so lovely. The film is quite brilliant too bad Woody has to be in it and over annoy everyone and that’s for all his movies just so that he can make out with all the actresses. (Ugly American Jews obsessed about the sex they didn’t get when the y were young.)",
            "review_date": "2019-05-07",
            "source": "rt"
        },
        {
            "content": "Considering Woody Allen's popularity with the Academy I was surprised to find he had directed only one Best Picture winner but fortunately it's one of his best, equaling Interiors (1978), Manhattan (1979) and Hannah And Her Sisters (1986). The screenplay is funny, romantic and melancholy and it traces a believable relationship that doesn't end in happily ever after but if you'd been watching from the beginning you would see that's not how things are going to finish up. Allen sets out to defy convention and write and perform a really smart romantic comedy, one that explores questions about love deeply instead of brushing over them and then concluding by saying that if you aren't in love it's a problem with you and not humanity itself.\n\nI was really glad that this was as good as I had remembered and it still lit a flame in the romantic in me that very much had a stake in this relationship. My one reservation is my general hatred of Diane Keaton as she has taken the role she plays here and replicated it in every other performance she has ever given but her â~talents' are used best here and although she absolutely should not be a Best Actress winner she is tolerable here.\n\nWoody, Woody Allen, is a neurotic man who struggles in his love life but his interest is piqued when he meets the quirky Annie Hall, Diane Keaton. They quickly fall in love but they face many problems in their relationship and they often deal with these problems in impractical but funny ways. Annie moves out to L.A. where she befriends Paul Simon to pursue her dream of being a singer and Woody is unable to smother his idiosyncratic behavior. Their relationship collapses but not before he meets her crazy brother Duane, Christopher Walken, and has a one night stand with a young Shelley Duvall.\n\nThere are several memorable sequences in the film, when they have a conversation while text indicates what they are really thinking, when Annie refuses to stop smoking pot before they have sex and the famous Coney Island sequence. They are all quirky and delightful in that odd Woody Allen way where they are a few steps away from being irksome but hit that sweet spot of being both clever and funny. There are odd surreal jokes present in the film too as we see the director of The Sorrow and the Pity () brought into an argument between Annie and Woody at the movie theatre. The mix of different genres of comedy doesn't make the film feel all over the place or an like an odd mix of various interesting elements that doesn't quite work but it instead allows you to keep engaged as you marvel at Allen's storytelling ability. There is none of the smarm of Allen's later work present here as his jokes are self-aware without feeling smug or pretentious and you laugh throughout.\n\nAllen and Keaton give very good performances in the lead roles as semi-autobiographical characters. Allen is as neurotic as ever as he struggles to understand the aspects of life that we all do buried beneath the surface but he takes his musings to such ridiculous extremes that they become absurd. His iconic image, a little man in thick-rimmed black glasses usually wearing a formal white short and black dress pants is on display here as he cements his iconography. Keaton is usual ditzy self but the film is aware of that and uses her persona to play off Allen's opposing neuroses displaying a really beautiful chemistry. No, she didn't equal either Anne Bancroft or Shirley MacLaine in the exquisite The Turning Point (1977) and I'm still mad that both of those actresses have only one Academy award therefore I will always feel ill will towards this performance but on it's own it's very good.\n\nThis is one of those films that you must see regardless of whether you love or hate Allen and Keaton or the romantic comedy genre as a whole, it's a film that transcends all that and becomes a seminal film altogether. I thoroughly enjoyed myself but also came away feeling quite emotional and I am glad that this was rewarded instead of one of Allen's lesser 1990s films.",
            "review_date": "2019-04-24",
            "source": "rt"
        },
        {
            "content": "Exaggerated, neurotic, unfunny. Ultimately, boring.",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "This movie was actually really entertainig, despite other reviews. The story itself didn`t have a meaning, but why would a movie need to have a meaning? It tells something, and, for me, that`s arleady enough. I loved how the main characters discussed life and how eccentric their point of views about  everything were displayed!",
            "review_date": "2019-03-07",
            "source": "rt"
        },
        {
            "content": "This film had some fantastic, off-the-cuff style acting and it was very entertaining to watch. The scene transitions are great, and Alvy's thoughts coming to life are awesome additions to the film. The sad thing about the plot of the film is seeing two people, even fictional ones, gravitating to all of the things that don't matter in a relationship, declaring the relationship dead and then moving on with their lives when happiness is clearly only to be found with each other. I would have rated the film a four, but I caught myself constantly looking at the run time to see when it would end because it had a number of parts that dragged a lot. The comedy is mostly pretty funny, Allen's performance as a neurotic comedian is a real treat to watch and despite it's problems this is overall a good movie (Oh, and there is a cameo by really young Jeff Goldblum!).",
            "review_date": "2019-03-01",
            "source": "rt"
        },
        {
            "content": "This is peak Woody Allen. You will like this as much as you like Woody Allen. I am not a big fan, but he is entertaining, and that's how I felt about this movie.",
            "review_date": "2019-02-24",
            "source": "rt"
        },
        {
            "content": "Such an unconventional love story. This movie was super funny, pretty deep and really entertaining! I honestly can hope I fall in and out of love like this.",
            "review_date": "2019-02-10",
            "source": "rt"
        },
        {
            "content": "I remember, I laugh, I cry every time I watch this movie. Such a clever script, such a wonderful performance from everyone in it. This was Woody Allen at his best.",
            "review_date": "2019-01-03",
            "source": "rt"
        },
        {
            "content": "Annie Hall was one of the big hits of Woody Allen's career and in my opinion his most mainstream work. This film is classic Allen right from the hilarious debates between LA and NYC to his neurotic self. Of course the star is Diane Keaton as the titular character and she is excellent in the role. The scene where Allen visits her family and meets amongst others Christopher Walken is subtle humor redefined. If you aren't aware of why Woody Allen is such a cultural icon I suggest you rent Annie Hall. I think this is one of the finest comedy-dramas out there.",
            "review_date": "2018-12-06",
            "source": "rt"
        },
        {
            "content": "Allen opens the film with a fourth wall breaking monologue about some old jokes. This is to introduce us to the film as being self aware. This was my first Woody Allen film and I found myself laughing throughout. Allen uses the disembodied world of the film to showcase his storytelling techniques such as fourth wall breaks and split screens. Not to give all attention to Allen, Keaton gives a lovely performance as the quirky and awkward titular character showing her many ticks and quirks. The story is devastating with humor and sadness. Wit and charm fill the screenplay but also pure emotion. This is my favorite romantic comedy and I donï¿ 1/2 1/2 1/2 1/2(TM)t usually like those this is a definite recommend for Woody Allen fans and fans of rom-coms in general.",
            "review_date": "2018-11-19",
            "source": "rt"
        },
        {
            "content": "The birth of the romantic comedy. Woody Allen introduces a sarcastically funny approach towards relationships and how in the end it may or may not work out and thats ok. A charming and authentic masterpiece.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "One star is generous for Woody Allen's endless neurotic prattling. Woody Allen fans may love this movie but for me it was a struggle to keep watching it to the end.",
            "review_date": "2018-08-14",
            "source": "rt"
        },
        {
            "content": "I dont think young audiences realize how innovative this film was when it came out.Great casting writing,acting.",
            "review_date": "2018-07-29",
            "source": "rt"
        },
        {
            "content": "Annie Hall was one of the big hits of Woody Allen's career and in my opinion his most mainstream work. This film is classic Allen right from the hilarious debates between LA and NYC to his neurotic self. Of course the star is Diane Keaton as the titular character and she is excellent in the role. The scene where Allen visits her family and meets amongst others Christopher Walken is subtle humor redefined. If you aren't aware of why Woody Allen is such a cultural icon I suggest you rent Annie Hall. I think this is one of the finest comedy-dramas out there. (NYC never looked as appealing as it did in Annie Hall).",
            "review_date": "2018-07-22",
            "source": "rt"
        },
        {
            "content": "With its revolutionary story telling techniques, simplistic yet charming dialogue, and witty humor that still holds up, Annie Hall is a gem for moviegoers above the age of thirteen whom has any form of appreciation of the crafts. Woody Allen's confident, smart-ass, intelligent character drives each scene in such an entertaining style that it's no wonder this poignant performed piece is a part of Cinematic history.",
            "review_date": "2018-06-19",
            "source": "rt"
        },
        {
            "content": "A game changer of a movie. Never before did a film like this exist, and never since... One of the greatest films of all time!",
            "review_date": "2018-05-10",
            "source": "rt"
        },
        {
            "content": "Sometimes, the most daring and influential works are the ones that age the worst. Techniques that were once fresh are copied so often they become blasé; the hype surrounding a landmark movie raises new audience's expectations too high; social progress renders certain characters or plotlines painfully insensitive. Annie Hall, I'm happy to report, avoids these pitfalls. Its influence is clearly seen in later rom-com classics like When Harry Met Sally - the subgenre of psychological New York romances owes a lot to Diane Keaton's vest.  \nReleased in 1977 to immediate critical acclaim and popular success, Annie Hall is among the most iconic Woody Allen films, filled with scenes and one-liners that have by now become a part of the American cultural consciousness. It's a work that, for all of its extraordinarily 1970s fashion, has stood up remarkably well to the tests of time - certainly better than many of Allen's other works (I'm looking at you, Manhattan). To speak personally, it's one of my all-time favorite films, largely due to its casual articulation of our anxieties about death, love, and much more.\nAt its core, the plot of Annie Hall can be summed up in very few words. Neurotic comedian Alvie Singer (a blatant stand-in for Woody Allen, as most characters he plays are) meets Annie Hall (Diane Keaton) over a tennis match. They quickly become romantically involved, and she moves in with him - but Alvie's insecurity leads to them breaking up. After the break-up, Alvie is depressed, and tries to get back together with Annie, to no avail. The End. \nBut, of course, Annie Hall is much more than that. It's a work that succeeds in the tricky balancing act between highly experimental filmmaking and charming, relatable characters. From beginning to end, Annie Hall is unconventional; not many movies have the main character break the 4th wall and directly tell the audience that life is \"full of loneliness and misery and suffering and unhappiness, and it's all over much too quickly\" - let alone in the first 25 seconds of the film. \nAllen's background as a standup comedian is evident in the steady stream of witticisms throughout (upon Annie commenting how clean LA is in comparison to his beloved New York City: \"That's because they don't throw their garbage away, they turn it into television shows.\") The movie blends classic stand up jokes with Alvie's persistently nihilistic outlook; the final scene, in particular, uses this technique to extraordinary effect. Annie Hall is a work whose experimental storytelling is still innovative today - nonlinear structure, telepathic subtitles, briefly turning into a cartoon - but it's always in service of the greater message, rather than self-indulgent distractions.\nMany people of my generation know of Woody Allen only as a creepy guy who married his adopted daughter, which is understandable - after all, he's a creepy guy who married his adopted daughter. But if you're able to separate the art from the artist, I'd highly recommend you give this one a watch.",
            "review_date": "2018-04-12",
            "source": "rt"
        },
        {
            "content": "One of the funniest and most revolutionary films ever made. Clever, different, and subversive. ",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "Endearing characters and a sharp, snappy script gloss over Annie Hall's dark theme.",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "This is one of those movies that I could watch over and over again.Every single scene is legendary. Allen displays such wit and irony, dealing with universal themes like love, death, fame and human relationships. It is a masterpiece which you absolutely have to watch.",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "Smart, witty, 4th-wall-breaking, expository, charmingly acted, well edited, funny, and most of all, unforgettable.",
            "review_date": "2018-03-25",
            "source": "rt"
        },
        {
            "content": "Annie Hall is an excellent film. It is abut neurotic New York comedian Alvy Singer falls in love with the ditzy Annie Hall. Woody Hall and Diane Keaton give incredible performances. The script is well written. Woody Hall also did a great job directing this movie. I enjoyed watching this motion picture because of the humor and romance. Annie Hall is a must see.",
            "review_date": "2018-02-19",
            "source": "rt"
        },
        {
            "content": "It has some funny moments, and most of it is entertaining. Not a huge fan of Woody's movies myself. But I don't hate it.",
            "review_date": "2017-12-16",
            "source": "rt"
        },
        {
            "content": "Absolutely terrible. Not funny at all, visually boring, I have no idea what the point of this story was at all. There are no redeeming factors.",
            "review_date": "2017-12-15",
            "source": "rt"
        },
        {
            "content": "Every scene of this film is amazing. It has some great guffaw moments, and then it will switch & have some rather poignant moments, and the mix works. You will likely be quoting this class for a while after seeing it.",
            "review_date": "2017-10-04",
            "source": "rt"
        },
        {
            "content": "Maybe I just don't get this \"Woody Allen at his quirkiest\" romcom, but a lot of this movie feels disjointed.  This is best displayed in the ending that just... ends.  I prefer his more concise and grounded offerings.",
            "review_date": "2017-08-30",
            "source": "rt"
        },
        {
            "content": "Annie Hall is a 1977 American romantic comedy film directed by Woody Allen. \nThis romantic comedy is classic Woody Allen playing himself and displaying his neurotic personality. It contains solid performances and includes some very unusual techniques including cartoon, subtitled thoughts, etc. The film relies heavy on its witty and constant dialogue, mainly between the two lead characters, and for the most it works very well, resulting in an enjoyable and entertaining film. Considered to be one of the best movies of all time and the second best romantic comedy off all time. \nAAW 1001",
            "review_date": "2017-08-16",
            "source": "rt"
        },
        {
            "content": "This remains in the top two of my favorite Woody Allen films.  In true fashion, Woody sticks to what he knows about relationships and what he knows as a writer. Not every love story is sealed with a kiss, some are just bittersweet. The takeaway is an honest love story that audiences have related to for years.",
            "review_date": "2017-07-28",
            "source": "rt"
        },
        {
            "content": "Annie Hall (1977) exhibits the finest, most apt biting social commentary & intellectual wit now synonymous with Woody Allen and his films. Unlike most comedies, Annie Hall refuses to pander to its audience. Alvy's (Allen) stream of witticisms need a keen ear to keep up with. But, if audiences invest in Annie Hall's neurotic protagonist, they are richly rewarded with one of the best comedic scripts ever written. Annie Hall provides a rather cynical examination of 1970s US society through the many conversations that drive the romcom's plot along. The central plot - the relationship between Allen and Keaton - isn't really the most interesting, nor entertaining aspect of Annie Hall. Allen plays an imitation of himself & Keaton is in her element in a role written for her. Both contribute to Annie Hall's terrific comedy. Ebert said Annie Hall's filmmaking mirrors the central protagonist (and Allen himself) in its switching between tones - he's exactly right. Annie Hall is a must-see for all fans of comedy. Provides accurate, biting examination of relationships and society.",
            "review_date": "2017-07-20",
            "source": "rt"
        },
        {
            "content": "I'm still not sure if Annie Hall represents Woody Allen's mainstream optimism prevailing over his depressive genius, or if it's his usual pessimism going undercover just long enough to cause a long-term cardiac arrest of lovesickness. This was another example of an unreplicable 70s piece that embodied the disappointment of the post-hippie generation, realizing that love can never be completely distilled from sex. Annie Hall, in many respects, was the screen's most infuriating antagonist, at least from a lonely nerd's point of view.\n\n\nIt would be remiss of me not to include my 1970s inspiration, that depressive and quirky old man who was once my age, who defined uncertain love for two generations of moviegoers. I thought it fitting to include Annie Hall as one of cinema's great villains, that is, the woman whom the protagonist always felt he was meant to win-and yet the one that got away. Annie Hall is the perfect representation of the \"ex\" that you love and hate at the same time, the one antagonist of this list that provokes conflict by eluding the hero, not threatening him. It's impossible to narrow down the great villains or the best sad love lost stories of Woody Allen, but it's fairly easy to identify the one movie that spoke to me as an idolizing, lonely teen. There have been better movies that broke the fourth wall, and dissected their villains and heroes with penetrating insight (such as the works by Charlie Kaufman and Spike Jonze) but Woody Allen was one of the first movie icons to truly explore himself in the objective, cynical way, in this film, not to mention Manhattan and The Purple Rose of Cairo.",
            "review_date": "2017-07-12",
            "source": "rt"
        },
        {
            "content": "Woody Allen at his best: baring his insecurities and shortcomings, muttering and mumbling his way through a string of sharp, witty statements, experimenting with film techniques, admiring the lost landscape of 1970s New York and, still, finding time for a rich, colorful portrayal of a years-long romance. Allen and Diane Keaton really make the film work, their rapport is so smooth, easy and genuine. We want to see them tough it out together, because their good times are so pure and true, but we know that fresh infatuation has a relatively short shelf life and the characters' essential differences make a longer, more serious relationship impossible. We see it all in a string of short snapshots, an expert mix of vital moments that anyone who's been through such a whirlwind will no doubt recognize. Those early, sunny memories you won't forget and the later, stormier ones you can't. Funny and poignant, with a dash of playful fourth-wall recognizance to keep us on our toes, it expertly churns all sorts of universal emotions.",
            "review_date": "2017-07-10",
            "source": "rt"
        },
        {
            "content": "Mr. smartie pants Woody Allen's biggest early success, in which the neurotic New York comedian Alvy falls in love with the innocent Annie Hall, they start a romantic relationship and then break up. A very simple plot full of clever lines, a screenplay that defies all standards and breaks all conventions. Cultural references everywhere, split screen funny scenes, animated scenes, fourth wall breaks, strange dialogues with existentialist views that reflect his own opinion on things. Regardless of the sexual assault allegation, it cannot be denied that his work on this film was extraordinary. Not for nothing, it is the 50th Academy Awards' Best Picture for which Diane Keaton won her Oscar and for which he won Best Director and Best Screenplay.",
            "review_date": "2017-07-07",
            "source": "rt"
        },
        {
            "content": "Really excellent. Extremely funny, thoughtful and fun to watch. I don't know why I haven't watched more Woody Allen films before, but will definitely keep rolling through his filmography after this one.",
            "review_date": "2017-07-03",
            "source": "rt"
        },
        {
            "content": "\"After breaking up with his girlfriend Annie Hall, neurotic comedian Alvy Singer goes on a stream of consciousness journey through his memories of their relationship, trying to find out what caused them to part ways. He often breaks the fourth wall, speaking to the camera, entering peoples' stories, and even using animation.\"\n\nA film for the film student undoubtedly. I enjoyed the dry humour of Woody Allen, the quirkiness and beauty of Diane Keaton and the general relationship analysis that occurs throughout the film. The modern equivalent would be 500 Days of Summer, so for those who enjoyed that film, they would enjoy this equally, if not more.\n\nhttps://rwh92.wordpress.com/",
            "review_date": "2017-06-06",
            "source": "rt"
        },
        {
            "content": "This is brilliant in all the areas of filmmaking. It's so freaking funny.",
            "review_date": "2017-05-28",
            "source": "rt"
        },
        {
            "content": "10/10 briliant comedy. \nI remember each dialogs even after 25 years. Every 3-4th year I watch again and again.",
            "review_date": "2017-04-22",
            "source": "rt"
        },
        {
            "content": "#WOODYALLENRETRO PODCAST PROJECT\n\n40 Years and the movie is still one of the best rom-coms ever made from creativity, character  chemistry, story and execution.. \n\nMature, fun and witty with a nice feel good ending.. it's just great.. still!",
            "review_date": "2017-04-03",
            "source": "rt"
        },
        {
            "content": "This movie sucks. How did it win any awards. The lowest ranking allowable is a half star. I wish i could give it negative for taking an hour and a half of my life away from me.",
            "review_date": "2017-03-26",
            "source": "rt"
        },
        {
            "content": "Funny movie and Diane Keaton is very charming",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "Ordinarily I'm not a big fan of movies about relationships that are focused on a break-up. But Annie Hall defies those expectations. Part of the reason I dealt with it is the fact that Allen's character tells us from the very beginning that is how the film will end. It also doesn't hurt that the movie is overloaded with humor, so nothing is taken seriously. The movie is silly and therefore I don't find myself depressed like I can be sometimes with these anti-romance stories.\n\nWhat's so great about this movie are all the different methods that Allen utilizes for humor. He's breaking the 4th wall, he's showing silly flashbacks, he's even giving us subtitles that tell us the characters' thoughts in contrast to what their mouths are saying. All that, and there's loads of witty dialogue as well. These are all techniques that work perfectly for me. I almost would have liked to see more breaking of the 4th wall, because those were the moments I was laughing the most.\n\nIn my limited experience, Woody Allen has a very particular way of writing dialogue, and I'm glad he acts in the lead role here to deliver a lot of it. I've found that it can sometimes be off-putting when Allen's words come out of other actors' mouths, but I don't have to deal with that in Annie Hall. Diane Keaton is great as the titular romantic counterpart, and she has great timing with Allen. I didn't realize how great the timing was until there is a scene that literally shows him interacting with other women and not connecting on any of his jokes.\n\nTo be fair, there are some jokes that fall flat, and I think some scenes are weaker than others. There's even one section of the film that I was worried it was getting too sidetracked and I didn't know where it was going. But the film recovered quickly, and as a total package it is a movie that I loved. It had me chuckling throughout, and actually made me think about what holds relationships together and how they can fall apart. Annie Hall is definitely fighting with Midnight in Paris for the title of my favorite Woody Allen film. When he sticks with comedy, it works perfectly for me.",
            "review_date": "2017-03-20",
            "source": "rt"
        },
        {
            "content": "Despite the technically clever writing, I found only Annie Hall to be interesting only at small times after the first 20 minutes. The plot jumped all over the place and Woody Allen is a much better writer than actor.",
            "review_date": "2017-03-03",
            "source": "rt"
        },
        {
            "content": "This is my first Woody Allen movie, so I will refrain from making comments about his general skill as a director/writer since it's entirely possible that he's made some great stuff. This one however, I didn't enjoy almost at all. The dialogue and writing in this is insufferable. It's so long-winded and whiny that I seriously contemplated giving up about 20 minutes in. On top of that, Woody Allen's character is one of the most irritating, rage-inducing people I've ever seen put to screen. You get the impression that you're supposed to laugh to yourself at how paranoid he is, but ultimately think that he has good insight into the world and people. Actually though, literally everything he says in the whole movie is annoying and pretentious. On top of that, he never shuts his stupid face. 90% of his... ahem... \"jokes\" are just, \"Wow. Look at how this guy is still talking and talking. Isn't that hysterical.\" The only thing that kept me going was the constant breaking of the fourth wall which, yeah, I'll admit is incredibly creative and well done. I recommend looking up those scenes and not watching the whole movie. So yeah not a fan.",
            "review_date": "2017-02-14",
            "source": "rt"
        },
        {
            "content": "Annie Hall is a touching classic that, below its cynical outlook on life, manages to be charming and insightful. Woody Allen acts and directs well and Diane Keaton is brilliant. It's also cool to see some early work from Christopher Walken. The screenplay was very good and funny when it needed to be. I admire Allen for not taking this down the typical route for romantic comedies.",
            "review_date": "2017-02-06",
            "source": "rt"
        },
        {
            "content": "Hilariously offbeat and quirky, Annie Hall is an unconventional comedy with plenty of laugh-out-loud moments.",
            "review_date": "2017-01-26",
            "source": "rt"
        },
        {
            "content": "A sweet movie, the romance could have been more believable, but the writing was just so good that i was easy to forget that.",
            "review_date": "2017-01-24",
            "source": "rt"
        },
        {
            "content": "I do love Woody Allen, and this was my first venture into one of his earlier works. The film largely holds up over time. I even laughed out loud a few times, not what I was expecting from watching his more recent films.",
            "review_date": "2016-12-30",
            "source": "rt"
        },
        {
            "content": "lilian from kimmy schmidt was a fox",
            "review_date": "2016-12-10",
            "source": "rt"
        },
        {
            "content": "A great movie by woody allen with the strategy he made from rolling over the memories and the talking to the camera \"unique\" work and one of the most beautiful realistic romance movies  ever made",
            "review_date": "2016-11-28",
            "source": "rt"
        },
        {
            "content": "Simple, sweet, elegant, and beautiful. This is one of the most hilarious and beautiful romances in movie history.",
            "review_date": "2016-11-27",
            "source": "rt"
        },
        {
            "content": "Despliegue creativo de Allen. Diane Keaton espectacular (personalmente, la mejor actriz en las películas de Woody). Annie Hall atrae al espectador pero más por su forma de ser que por una especie de amor platónico, es decir, nunca hay un ambiente de película romántica (aunque tampoco es ese el ambiente que procura el director neoyorquino).\n\n\"But we need the eggs\". Gran final.",
            "review_date": "2016-11-06",
            "source": "rt"
        },
        {
            "content": "I have very mixed feelings for this film. On the plus side, it's an innovative, intellectually funny relationship film. On the negative side, it beat Star Wars for Best Picture at the Oscars for 1977. It's a good film, probably one of Woody Allen's best, but in retrospect, it's not as good as Star Wars.\n\nRoughly, this is the story of a relationship and what Allen's character Alvy learns from it. It's almost entirely dialogue-driven, with little or no actual plot action. That dialogue, however, is fast and witty, even by today's standards. Told out of sequence and with various asides directly to the audience, this film finds new ways to inform the viewers what Alvy is feeling. There is a split-screen scene where two families in different locations talk to each other about their respective offspring. There's an animated scene that serves as a transition between settings.\n\nI found, 40 years later, that the energy dwindles in the second half. It seems as if Allen couldn't find a way to wrap it up, so it just peters out. I recall that Annie's fashion sense was very influential in the late '70s, but it's hard to say that the film's visual style overall was as enduring.",
            "review_date": "2016-11-01",
            "source": "rt"
        },
        {
            "content": "Annie Hall(1977)\nStarring: Woody Allen, Diane Keaton, Tony Roberts, Carol Kane, Paul Simon, Shelley Duvall, Janet Margolin, Christopher Walken, and Colleen Dewhurst\nDirected By: Woody Allen\nReview\nA NERVOUS ROMANCE\nHello Kiddies your pal the Cupid Critic here with one of the most influential romantic comedies that had it's own and beat Star Wars at the Oscars for Best Picture.\nAlvy Singer(Woody Allen) is one of Manhattan's most brilliant comedians, but when it comes to romance, his delivery needs a little work. Introduced by his best friend Rob(Tony Roberts) Alvy falls in love with the ditzy but delightful nightclub singer Annie Hall(Diane Keaton). When Alvy's own insecurities sabotage the affair, Annie is forced to leave Alvy for a new life-and lover(Paul Simon)-in LOs Angles. Knowing he may have lost Annie forever, Alvy's willing to go to great lengths- even driving L.A's freeways-to recapture the only thing that mattered-true love.\nI've been wanting to see this for a while, the first Woody Allen picture I ever saw was Blue Jasmine and I loved that film, granted its nothing like Annie Hall but it was a great character study. Annie Hall was also a best picture winner so that also made me more excited when I put the Bluray in.\nAnnie Hall contains more intellectual wit and cultural references than any other movie to win an Oscar for best picture, and in winning the award in 1978 it edged out Star Wars, an outcome unthinkable today. The victory marked the beginning of Woody Allen's career as an important filmmaker(his work was funny but slight) and it signaled the end of the 1970s golden age of movies.\nAnnie Hall is built on such dialogue and centers on conversation and monologue. Because it is just about everyone's favorite Woody Allen movie, because it won the Oscar, because it is a romantic comedy few viewers probably notice how much of it consist of people talking, simply talking.\nThis is a movie that establishes its tone by constantly switching between tones: The switches reflect the restless mind of the filmmaker, turning away from the apparent subject of a scene to find the angle that reveals the joke. Annie Hall is a movie about a man who is always looking for the loopholes in perfection. Who can turn everything into a joke, and wishes he couldn't. I give Annie Hall a five out of five.",
            "review_date": "2016-09-16",
            "source": "rt"
        },
        {
            "content": "Who can't like this?",
            "review_date": "2016-09-10",
            "source": "rt"
        },
        {
            "content": "Indeed no doubt , Allen crazy and honest execution is very fresh at that era. But now, too much happening. Despite, this honest romance movie is charming in some way.",
            "review_date": "2016-08-07",
            "source": "rt"
        },
        {
            "content": "Move night with Iris.\n\nYES!!!! My daughter loved this to bits. Allen's greatest and still one of my Top 5 ever. La Di Da.",
            "review_date": "2016-07-31",
            "source": "rt"
        },
        {
            "content": "'Doc, my brother's crazy, he thinks he's a chicken.' And the doctor says, 'Well why don't you turn him in?' and the guy says, 'I would, but I need the eggs.'",
            "review_date": "2016-07-23",
            "source": "rt"
        },
        {
            "content": "Woody Allen has always been a quirky fella, but Annie Hall shows him at his funniest and most human. A cultural staple in particular due to Allen's frequent breaking of the fourth wall, from which Ferris Bueller and many other films since could only borrow. What Allen does best is his ability to integrate his funniest jokes seamlessly into the plot, but he also deserves credit for crafting a real, human relationship with Diane Keaton. Most rom coms involve a pairing that builds in excitement, meets an obstacle, and finally ends tragically or perfectly, whereas Annie Hall opts instead for the usual ups and downs of relationships and has no dramatic conclusion. Diane Keaton deserves her Oscar for her fantastic performance and Woody Allen his for a terrific script.",
            "review_date": "2016-07-21",
            "source": "rt"
        },
        {
            "content": "I'll admit that film school ruined this one for me. Being told you have to like something OR ELSE makes a person not like something.",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "\"- I, I thought of that old joke, y'know, the, this... this guy goes to a psychiatrist and says, \"Doc, uh, my brother's crazy; he thinks he's a chicken.\" And, uh, the doctor says, \"Well, why don't you turn him in?\" The guy says, \"I would, but I need the eggs.\" Well, I guess that's pretty much now how I feel about relationships; y'know, they're totally irrational, and crazy, and absurd, and... but, uh, I guess we keep goin' through it because, uh, most of us... need the eggs\"",
            "review_date": "2016-06-23",
            "source": "rt"
        },
        {
            "content": "From start to finish, a cleverly writen and splendid directed romantic comedy that takes the best of the genre and mokes from the same, not to mention Woody Allen and Diane Keaton's astonishing performances.",
            "review_date": "2016-06-22",
            "source": "rt"
        },
        {
            "content": "What a beautiful film",
            "review_date": "2016-06-12",
            "source": "rt"
        },
        {
            "content": "An intellectual-comical treat!",
            "review_date": "2016-06-05",
            "source": "rt"
        },
        {
            "content": "Loved it! Annie starts so adorable and awkward and ends as such a different person. Amazing character development with a wonderful supporting role from New York City.",
            "review_date": "2016-06-04",
            "source": "rt"
        },
        {
            "content": "This is justly regarded as a classic. It' funny, human, relatable, and insightful with a smidgen of cinematic experimentation.",
            "review_date": "2016-05-31",
            "source": "rt"
        },
        {
            "content": "\"That was the most fun I've ever had without laughing.\"",
            "review_date": "2016-05-26",
            "source": "rt"
        },
        {
            "content": "Probably the best romantic comedy you'll ever see.  Woody Allen plays Alvy Singer, an insecure, cerebral comedian living in Manhattan (hmm), who is trying to understand how his relationship with Annie Hall (Diane Keaton) ended.   The script is fantastic, and Allen gives us a steady stream of jokes ranging from subtle, intellectual references to physical comedy, and while I only laughed out loud a few times, I was often smiling.   He also uses a variety of creative techniques in this film - speaking directly to the camera, stepping directly into childhood memories, giving voice to inner thoughts, and including a brief animation, among other things.  He explores love, sex, and relationships, but also the cultural differences between Jews and Gentiles, and New Yorkers and Californians in clever ways.  His understated facial reaction as Keaton orders Pastrami on white bread with lettuce and tomatoes is priceless.  \n\nThe film is sweet, endearing, and sentimental about relationships, and yet it's also balanced, showing the bittersweet pitfalls with just the right touches, including a brilliant ending.  On top of all that, it's great to see Paul Simon in a couple of scenes, Allen's references to the 1969 documentary \"The Sorrow and the Pity\", and Diane Keaton's wonderful performance of \"Seems Like Old Times\".   Great film, and very worthy of the Academy Awards it won.",
            "review_date": "2016-05-20",
            "source": "rt"
        },
        {
            "content": "Possibly the greatest romantic comedy put to screen. A touching, funny, often heart-breaking slice of life, Annie Hall is Woody's most popular film, and arguably his best. This film is incredible. Wonderful performances, sensitive direction, and a fantastically personal screenplay, Annie Hall still holds up as a touchstone in American cinema.",
            "review_date": "2016-05-06",
            "source": "rt"
        },
        {
            "content": "One of my top 3 favourite films of all time, Annie Hall is a work of art from a style that is generally very predictable. But then again it's sinful to call this a romcom. It's a creative, involving, beautiful and connectable study of a doomed relationship. With stellar performances from the entire cast, Annie Hall absolutely deserved to beat Star Wars for Best Picture.",
            "review_date": "2016-04-22",
            "source": "rt"
        },
        {
            "content": "What a quirky, clever, witty, sometimes dry but experimental film. I had fun watching this.",
            "review_date": "2016-04-11",
            "source": "rt"
        },
        {
            "content": "Rewatched after 30+ years and enjoyed the humor.  This is probably Woody Allen's most remembered film.  RT rated it 97%.",
            "review_date": "2016-03-26",
            "source": "rt"
        },
        {
            "content": "\"I would never want to belong to any club that would have someone like me for a member.\" One of the best love stories",
            "review_date": "2016-03-11",
            "source": "rt"
        },
        {
            "content": "Magnificent film with am amazing dialogue. What amazes me is how different this movie was. The fourth wall breaking or the messed up timeline or even the weirdness of it. This film was very ahead of its time and gave us tricks and storytelling ways we use in cinema today.",
            "review_date": "2016-03-05",
            "source": "rt"
        },
        {
            "content": "The unfortunate start of the quirky girl genre, but I guess it isn't Allen's fault that this push resulted in Zooey Deschanel. Very clever, definitely succeeds at being the cynical romantic comedy it's trying to be by showing how people can have functional, overly intellectual (rather than emotional), empty relationships. Kind of disturbing in that way. Was that the point though, or is Woody Allen's philosophy on relationships just revealing its shittiness while trying to show substance? I don't know. They have no chemistry whatsoever, but if the point was to show the emptiness then kudos I guess.",
            "review_date": "2016-02-22",
            "source": "rt"
        },
        {
            "content": "A very dialogue heavy film, but Woody Allen has some ideas that make Annie Hall great. You can relate to these great characters.",
            "review_date": "2016-02-12",
            "source": "rt"
        },
        {
            "content": "I am not the most ardent of Woody Allen fans. I have to say I did enjoy this quirky movie though.... Diane Keaton was amazing - and as a portrayal of neurosis, I felt the characters deeply.",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "Smart, unconventional, sharply funny, Annie Hall raises the bar for romantic comedies with Allen´s typically acid humour and Keaton´s remarkable performance in this classic meditation about relationships.",
            "review_date": "2016-02-03",
            "source": "rt"
        },
        {
            "content": "Una muestra de ingenio y creatividad.",
            "review_date": "2016-02-03",
            "source": "rt"
        },
        {
            "content": "Annie Hall:\n\nPros:\n- Amazing Acting\n\n- Fantastic Directing\n\n- Terrific Script\n\n- Very Funny Moments\n\n- Great Chemistry Between Woody Allen and Diane Keaton\n\n- Magnificent Ending\n\n- Very Great Take On How Relationships Really Are\n\n- Good Characters\n\n- Very Well Paced\n\n- Very Well Shot\n\nCons:\n- None\n\nOverall Grade: A+ (10/10)",
            "review_date": "2016-02-02",
            "source": "rt"
        },
        {
            "content": "A very good interpretation of the old love/romance story.\nRewatched a little while after. I knew I had missed a few things.",
            "review_date": "2016-01-08",
            "source": "rt"
        },
        {
            "content": "Woody Allen's breakout is exceptionally crafted for a romantic comedy, with mature subtext, plenty of funny breaks in reality and great performances to go with them, but its relationship drives and sendoff opinion on what love is aren't universal.\n[Original rating: 4]",
            "review_date": "2016-01-03",
            "source": "rt"
        },
        {
            "content": "Una de las mas neuroticas y personalizadas del actor/director neoyorkino. Hay tantas memorables -la que narra la niñez del protagonista, la defensa a la masturbacion-  que es dificil señar la mejor. Sin falta.",
            "review_date": "2015-12-11",
            "source": "rt"
        },
        {
            "content": "Thoroughly revealed Woody Allen's talent in this movie.  Clever and wit dialogues.  However there were a lot of similarities the way he acts in his later production.",
            "review_date": "2015-11-30",
            "source": "rt"
        },
        {
            "content": "Really enjoyable- feels dated but woody allen's character is all too relatable - in the moment your goals and desires seem reasonable but as an observer we know better. If only we could step outside ourself during these times!",
            "review_date": "2015-10-28",
            "source": "rt"
        },
        {
            "content": "Already feeling nostalgic about NYC. 2015-10-17 FRI",
            "review_date": "2015-10-16",
            "source": "rt"
        },
        {
            "content": "Woody Allen brings some of his wittiest writing to Annie Hall, admittedly a movie where Allen's prime directive is to indulge himself (masturbation is having sex with someone you love) but instead of merely covering his favorite culture and philosophy - which he does - he also makes sure to make the crux of the movie on the subject of basic human experiences, such as love, sex, death, culture and purpose. It is lacking some areas - for instance, many of the transitions are simply hard cuts like it's a 1930s movie, and the soundtrack is nearly absent, but a phenomenal cast and postively interesting directorial choices, combined with the script, more than makes up for the moderate errors.",
            "review_date": "2015-09-30",
            "source": "rt"
        },
        {
            "content": "Annie Hall follows an often convoluted narrative structure, but thanks to Woody Allen's sensitive direction and likewise starring performance -- not to mention profoundly affecting work from Diane Keaton in the titular role -- it manages to transcend its scattershot storyline to deliver a heartfelt and devastating, albeit uneven, romantic comedy.",
            "review_date": "2015-09-29",
            "source": "rt"
        },
        {
            "content": "Annie Hall is the film notorious for beating out Star Wars for Best Picture. So, is this a case where the Academy picked the right film and those plebs just lack in good taste? Or is this one of those films where the bourgeois all pretend to think it is great, but it is not really? Well, that is too much build up for this film. Annie Hall is a fine film about two people that are just fine together, except that makes it too good to be true, so we will have to figure out something to go wrong. This is a humanist romantic comedy: intelligent, witty, insightful, etc. Well, it works just fine there. It is good cerebral entertainment, and is at times playfully surreal in an everyday way. While I do not think it is the best Woody Allen film (Stardust Memories stands out to me) or the best film ever, it is a good film. (Is that OK? Can we just be happy with that?)",
            "review_date": "2015-09-27",
            "source": "rt"
        },
        {
            "content": "Re-watched Woody Allen's ANNIE HALL.  I saw it years ago and did not like it, but I had a really nasty stomach flu the first time I saw it.  It's very funny.  It's a lighthearted look at a romance, how it begins, progresses, and ends.  There are some serious moments too but overall it's funny.  There are some funny sight gags too.  Allen up to then had only made off the wall comedies which featured lots of sight gags.  This film marked the period where he started making more serious films.  The film won the Oscar for best picture.  It should have gone to STAR WARS.  Allen didn't attend the Oscar ceremonies because he hates awards.",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "The structure is really cool. However, it's still incredibly self-indulgent with insufferable lead characters.",
            "review_date": "2015-09-20",
            "source": "rt"
        },
        {
            "content": "85%\nSaw this on 13/9/15\nMy second Woody Allen film so far, but I did not like it as much as Midnight in Paris. Annie Hall is well acted ( I never knew that Woody Allen could act) and it's got a better romantic story than most of the films these days. I share a lot of the opinions of Allen's character personally and the film has got plenty of good dialogues. I also like the way in which Allen tells the story, his narrative and interactions with audience is fine.",
            "review_date": "2015-09-13",
            "source": "rt"
        },
        {
            "content": "\"The only word for this is transplendent!\"",
            "review_date": "2015-09-11",
            "source": "rt"
        },
        {
            "content": "Catching up on the classics while sick. Can't believe I've never seen this. Timeless.",
            "review_date": "2015-09-02",
            "source": "rt"
        },
        {
            "content": "\"Annie Hall\" is a classic comedic romance directed by and starring Woody Allen. The cast also includes Diane Keaton, Christopher Walken, Tony Roberts, and Paul Simon.\n\nAlvy Singer (Allen) is a comedian and play write living in New York. Throughout his life, he's failed to understand why he can't seem to get along with women.  He goes from relationship to relationship, and each time fails to keep one of them. As a child, Alvy was deeply depressed at the thought of life having no meaning, and was extremely worried about the rapid expansion of the universe. One fateful day, during a game of tennis, Alvy meets an eccentric women named Annie (Keaton). Their relationship is very different than any Alvy has ever had. Despite their ups and downs, break-ups and fights, they both can't seem to stop loving each other.\n\nThis is quite possibly one of the most sublime comedies of all time. Whether or not you enjoy this film depends upon if you do or don't like Woody Allen's style. He's very fluid, fast paced, and extremely cynical. He's fantastically funny, and he is really good in this film. Not only does Allen act in the film, he directed it and wrote the script. He's a wonderful director, and the script is very well written. It's full of amazing dialogue and great characters. Diane Keaton makes a great companion for Allen in the film. She's energetic-maybe too energetic-fun, and thoughtful. The two have a wonderful back and forth throughout the film.\n\nI have to be honest, while most of the film was superb, it does have its up and downs. It starts out hysterical, making you laugh you're pants off for a good while. The middle of the film does sag a bit unfortunately. The comedy doesn't really pick up much until towards the ending. However, in this middle time we do get some solid character building. The film isn't all laughs and gags. It really is a meaningful look at love and relationships. It's about those small little moments in life that make it all count. Like when Alvy and Annie are in the kitchen bioling lobsters. It's a special moment. Later in the film, Alvy attempts to re-create this moment with another women, but to no avail. He could only be himself and do these things with Annie. \n\n\"Annie Hall\" is a wonderful classic comedy. It's got great gags, a brilliant script, and charming performances. While the comedy does die down in the middle, and at times it seems like the characters are so energetic  you feel drained, in the end it's worth it. It's actually a really meaningful and emotional film. Allen does a marvelous job directing this great classic.",
            "review_date": "2015-09-01",
            "source": "rt"
        },
        {
            "content": "A movie that's busy trying to prove to you how damn intellectual Woody Allen is. I enjoyed Diane Keaton's neurotic character, but that's about it. I would not classify this as either comedy or romance. It's an ode to the narcissist New Yorker. \n\nThe fact that the character Ted from HIMYM was a huge fan of this film was pretty telling before I even got around to watching it.",
            "review_date": "2015-08-29",
            "source": "rt"
        },
        {
            "content": "Fun fact; Annie Hall almost wasn't Annie Hall. Woody Allen originally intended to create a thriller called Anhedonia, with Allen and Diane Keaton's love story as one of the many subplots. It wasn't until he watched the first cut, witnessing the chemistry he and Keaton shared, that he realized he had something special. He shook the thriller notions and transformed a subplot into one of the most iconic rom-coms of all time, a quirky, non-linear flick portraying the ebb and flows of being in a relationship. This is a film where Woody Allen's neurosis is a character in and of itself, and one so strong he has to break the fourth wall (mostly to beg the audience to understand his point of view or to plead passerbys on the Manhattan streets for advice) multiple times to keep the film from imploding. Annie Hall is a love letter to being in love, bittersweet and more daring than Allen is given credit for, awarding him his only Best Picture and Director Oscars to date.",
            "review_date": "2015-08-23",
            "source": "rt"
        },
        {
            "content": "A hilarious, unconventional Woody Allen classic, with excellent writing, an unconventional, nonlinear narrative, and great characters.",
            "review_date": "2015-08-17",
            "source": "rt"
        },
        {
            "content": "Woody Allen's Oscar winning classic didn't dig deep into me like it has for others, but that can't affect my review of the film at all. Annie Hall is about a neurotic comedian named Alvy who is obsessed with his past love Annie. The film shows the ups and downs of their relationship and how things don't always work out for the best and that we don't always see the good in things we view as bad. Alvy continuously uses his pessimistic view on the world around him to avoid doing things like interacting with girls and social groups and this causes people to get kinda upset with him, especially Annie. The stars of the film, Allen and Keaton, were fantastic characters that made the story fun and interesting. Annie is very eccentric and goofy but given that these two are very similar, in the end couldn't feel more different. It perfectly shows how not everything is meant to be and that we all can't have a happy ending like we want, which Alvy represents in his play in the last minutes. The story is a believable take on relationships and how they don't end up well on all occasion and I thought that aspect of it was great. The editing in the movie made it kind of hard to keep up as to where this took place given the unusual style of storytelling. I really liked the quirky narration and storytelling but sometimes it would just hop to one scene in the middle of dialogue. I thought the complete ending to the movie was really sweet the way that we all need to appreciate the people we are with and the relationship we have. The best words to describe Annie Hall are quirky, funny, believable, and sweet. I can see how this movie became such a classic because of the style of filming was so new to that time and that's what made it what it is. B",
            "review_date": "2015-08-12",
            "source": "rt"
        },
        {
            "content": "Widely dubbed as Woody Allen's masterpiece, Annie Hall has aged as well as any romantic comedy ever made. What makes Annie Hall so great is how it demonstrates basic human interaction and emotion through the use of wit. Annie Hall is a hilarious movie, but not like you'd think. There's very few laugh out loud moment. Instead the humor comes in embarrassing and real life laughs. \n\nAlvy is a neurotic comedian living in New York. He meets Annie and they start to fall in love. The story is not linear, jumping from the end of the relationship to the start to the middle back to the start and then back to the end. There's also moments where Alvy talks directly to the audience.\n\nFor good reason Annie Hall has been a mainstay when it comes to great American filmmaking for the last 40 years. There's a whole lot to love and not too much to be picky about. I remember watching this when I was 16 and thinking it was terribly overrated. Now watching it after actually realizing how relationships and the world works, it's a damn shame that I had to waste a first viewing on that dumbass high school student.",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "Woody Allen is funny though most of the film, but there's not enough going on to sustain an hour and a half running time. A little overrated.",
            "review_date": "2015-08-08",
            "source": "rt"
        },
        {
            "content": "I understand why it's a classic and very well liked, and at the time I could see how it is an artistic marvel, but it just doesn't hold up as well although I can still appreciate it.",
            "review_date": "2015-08-07",
            "source": "rt"
        },
        {
            "content": "Woody Allen's masterpiece Annie Hall is a fabulous, hilarious and romantic film with amazing performances and a clever script.",
            "review_date": "2015-08-06",
            "source": "rt"
        },
        {
            "content": "Perhaps Woddy Allen's best work, Annie Hall is a funny, deeply self-aware romantic movie with beautiful performances by everyone involved, from Keaton to Allen",
            "review_date": "2015-07-27",
            "source": "rt"
        },
        {
            "content": "One of Woody Allen's best performances of all time.",
            "review_date": "2015-07-14",
            "source": "rt"
        },
        {
            "content": "Well, I guess that's pretty much now how I feel about relationships; y'know, they're totally irrational, and crazy, and absurd, and... but, uh, I guess we keep goin' through it because, uh, most of us... need the eggs.",
            "review_date": "2015-07-13",
            "source": "rt"
        },
        {
            "content": "It's full of Diane's lighthearted charm. Especially, both Woody and Diane look like enjoying the lobster scene. The well-made masterpiece is scripted by Woody Allen fully enjoyable. 'Hall' is Diane's real name and 'Annie' is Diane's nickname. It must be a movie for Diane Keaton.\nI though the movie was based on their real lives because they once were in relationship but Woody Allen denies it's based on a true story. Originally, it was planed as a mystery movie dealing with a murder and romance was a sub-plot. After script revisions, Woody Allen focused on the romance. It's title is also changed from elusive 'Anhedonia' to 'Annie Hall' which was the second choice.\nDiane Keaton first met Woody Allen for the play and recalls:\n'During rehearsal, I fell for Allan as scripted but for Woody as well. How could I not? I was in love with him before I knew him. He was Woody Allen. He was so hip, with his thick glasses and cool suits. But it was his manner that got me, his way of gesturing, his hands, his coughing and looking down in a self-deprecating way while he told jokes like \"I couldn't get a date for New Year's Eve so I went home and I jumped naked into a vat of Roosevelt dimes.\" He was even better-looking in real life. He had a great body, and he was physically very graceful.'\nWoody Allen also fell in love with Diane Keaton and their relationship lasted about 5 years. Their relationship had ended up before they started to prepare for the movie but Woody Allen recalls:\n`When I started writing professionally, I could never, ever write from the woman's point of view. It was when I met Keaton that I started. She has such a strong personality and so many original convictions. I became interested in her and interested in her sisters and her mother as people. I felt I had a lot to learn from her. So I started to try and write things that gave her an opportunity to get out and do her things. It became fun for me to write from the female point of view. `\nThe production staff once complained that Diane Keaton brought her own clothes in the movie but Woody Allen said 'Leave her. She's a genius. Let's just leave her alone, let her wear what she wants.' He relied upon Diane Keaton and thus the movie became a masterpiece also in the fashion history.\nHis attitude like this may give impressions that Diane's lines sounds like a melody dancing over musical accompaniment of Woody's lines in this movie. Collaboration of Woody Allen with Diane Keaton continued in 'Interiors'(1978), 'Manhattan', 'Radio Days'(1987), Manhattan Murder Mystery'(1993). Diane Keaton claims:\n'It's kind of hard for me to wrap my mind around the fact that 179 of the world's most captivating actresses have appeared in Woody Allen's films. And there's a reason for this. And the reason is, they wanted to. They wanted to because Woody's women can't be compartmentalized. They struggle, they love, they fall apart, they dominate, they're flawed. They are, in fact, the hallmark of Woody's work. But what's even more remarkable is absolutely nothing links these unforgettable characters from the fact that they came from the mind of Woody Allen.'\n'If you look at my life this way, I mean he gave me my opportunity to be here and talk to you. It's all because Woody Allen believe me I'd be out. Where would I be? Oh, my God, I can't even imagine. I don't know what would happen to me without him. I mean he wrote Annie Hall, are you kidding me, and is the greatest gift given to me by anyone professionally. Obviously he is a genius. That's it. He is a genius.'\nThe movie may not be based on their real story but it is clear that Alvy is a shadow of Woody Allen and Annie is a shadow of Diane Keaton. It is admirable 'Annie Hall' was not a product of their past but for the future based on their mutual trust in real life.",
            "review_date": "2015-07-08",
            "source": "rt"
        },
        {
            "content": "The first of a wonderful series of bittersweet dramedys.",
            "review_date": "2015-07-07",
            "source": "rt"
        },
        {
            "content": "This was one of the worst movies ever!",
            "review_date": "2015-07-05",
            "source": "rt"
        },
        {
            "content": "Catching up on the essential Woody's. Loved Annie Hall.",
            "review_date": "2015-07-05",
            "source": "rt"
        },
        {
            "content": "Ah Woody Allen. A director that, surprisingly as a kid, i heard so much about for his witty humor and his simple but yet very touching and warmhearted romances. And sure he had a rocky career after the mid 80's, but since the release of Midnight in Paris (a film i'm eagerly gonna try and watch at some point.) he's been reaching his glory once again. And with Cafe Society coming out soon, i thought i would try and watch his first directorial and praised film: Annie Hall. And after a surprisingly short 1 hour and 33 minutes, is the film good and better yet does it even make me a fan of his style of comedy and romance? Honestly, yes and yes. Honestly i wasn't expecting to be blown away from this film all that much, especially without hearing much about Annie Hall other than it being a good film, and i was luckily happy enough to enjoy the film A LOT. While i do think that i wish the main characters themselves were a bit more likable to understand some of the choices they make from their relationship & some of the cinematography is a tad bit stale (which Woody Allen has been known to lack,) i have to say the film is still a very comedically funny and dramatic trip i had fun with. The positives were: The performances from Diana Keaton & Woody Allen are STELLAR and make for a likable duo for romance, the camerawork is impressive enough on it's own to make up for the cinematography, nice reincorporation is made superbly through the films climax and through very important dramatic scenes, some funny cameos from up and coming stars like Jeff Goldblum, Christopher Walken & Sigourney Weaver, and the script is charming and hilarious through it's characters and it's superb comedy. So overall, yeah i enjoyed it. I like Woody Allen's 'Ferris Bueller' persona and very spot on pop culture references type of humor, and it makes me want to see more of his work. Hopefully soon with Manhattan, Midnight in Paris & Cafe Society it can make me enjoy him for his impact on Hollywood and as a director.",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "I haven't watched any Woody Allen films before this one. \n\nThe acting was good. The story entertained me.",
            "review_date": "2015-06-13",
            "source": "rt"
        },
        {
            "content": "Great Woody Allen movie. Funny and entertaining",
            "review_date": "2015-06-12",
            "source": "rt"
        },
        {
            "content": "Clever, touching, and full of the best fourth-wall breaks (fuck off, Ferris Bueller fans). it may be a cliche to say this but it's the absolute truth that Annie Hall is the best film Woody Allen has and will ever make.",
            "review_date": "2015-06-11",
            "source": "rt"
        },
        {
            "content": "Timeless Woody Allen comedy at its observational best; it ushers in the arrival of the neurotic romantic comedy with ease.",
            "review_date": "2015-06-05",
            "source": "rt"
        },
        {
            "content": "Woody Allen creates a comedic masterpiece by excessively using words to describe the space and emotion of a particular situation. Every action might easily occur in everyday life and his way of perceiving it is highly neurotic and overly critical, thus making it hilarious.\nBreaking the forth wall has never seemed so natural. Alvy, the character Woody Allen plays, possesses great intelligence and his comedic timing is exceptional. He encourages people to strive for something better but assures them that no matter what they will always be miserable. He also contradicts himself when he feels left out by the ones he helped.\nThe flashbacks are unexpected and fit incredibly well into the progressing story, without causing any chronological confusion. \nDiane Keaton delivers a marvelous performance, displaying unique comedic and vocal skills. Her character is the perfect half that temporarily completes Alvy.\n\"Annie Hall\" is intriguing, innovative, and its quality ages like fine wine.",
            "review_date": "2015-05-26",
            "source": "rt"
        },
        {
            "content": "Two elderly women are at a Catskill mountain resort, and one of 'em says, \"Boy, the food at this place is really terrible.\" The other one says, \"Yeah, I know; and such small portions.\" Well, that's essentially how I feel about life - full of loneliness, and misery, and suffering, and unhappiness, and it's all over much too quickly.\"\n\nClassic.",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "It is a masterpiece, I do not think there is more perfect film than Annie Hall. Woody Allen's is a genius. The continuous genius comic phrases in the dialogue, the relationship with Brooklyn, and women, how cities mix with human relations. Super !! PERFECT FILM",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "Woody Allen's masterpiece does not have a single dull moment. You could watch it again and again, and still find yourself laughing.",
            "review_date": "2015-05-14",
            "source": "rt"
        },
        {
            "content": "Comedic films just do not get any better than this. Aside from being an iconic cinematic moment, it is truly a brilliant film. A sort of bittersweet ode to the pursuit of love. Diane Keaton has never given a better performance.",
            "review_date": "2015-05-10",
            "source": "rt"
        },
        {
            "content": "The primary influence on countless comedy movies and sitcoms for the last 25 years.",
            "review_date": "2015-05-09",
            "source": "rt"
        },
        {
            "content": "Annie Hall is the charming love story of typical Woody Allen and his struggles through a relationship that isn't working - the characters and story is entertaining and funny, Annie Hall is the story of every relationship and viewers can easily find it relatable.\nAllen plays his normal character, practically himself, and meets singer Annie Hall, who he attempts to maintain a relationship with despite numerous breakups, her falling in love with a snooty record producer and uninteresting bed sequences.\nAnnie Hall is known as one of the best rom coms ever, and rightfully so - Allen delivers both off the screen and on, every character is so real and entertaining. The film's common use of Allen talking directly to the viewers about what he thinks about things and occasional glimpses of the characters viewing themselves in a flashback sequence is unique and adds a nice touch to it (also, that great Snow White parody). Annie Hall is a must see, it's the charming story of every relationship that can't work out.",
            "review_date": "2015-04-25",
            "source": "rt"
        },
        {
            "content": "This in depth and relatable film on the insane and complex nature of love shines as one of the first films to truly capture this. Allen's use of comedy, breaking the fourth wall, and hilariously dramatic sequences proves that love isn't like a fairy tale. Diane Keaton's excellent performance is also duly noted.",
            "review_date": "2015-04-23",
            "source": "rt"
        },
        {
            "content": "I liked it - Annie is very casual and natural, Elvis is trapped in his own neuroticism but remains relatable - very three-dimensional portrayal.",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "I'm not sure this is Woody Allen's best movie, but it is the most \"Woody Allen\" Woody Allen movie. \"Annie Hall\" mixes Allen's neurotic humor with his usual theme of a pretty younger woman falling out of love with him.",
            "review_date": "2015-04-05",
            "source": "rt"
        },
        {
            "content": "I can't believe 'Star Wars' was bested by this film (re: 1978 Academy Awards Best Picture). 'Annie Hall' is charming and funny, but ultimately I don't believe it to be the classic rom com everyone makes it out to be.",
            "review_date": "2015-03-24",
            "source": "rt"
        },
        {
            "content": "One of the best romance/comedy movies that has seen many imitations throughout the years since.",
            "review_date": "2015-03-15",
            "source": "rt"
        },
        {
            "content": "Of the 4 Woody Allen films I've seen, I have never been disappointed.  While the subject matter is definitely for a mature audience, I was laughing and smiling the entire length of the movie.  I can see why this one is such highly acclaimed.  The other great ones I've seen have been the Purple Rose of Cairo, Midnight in Paris, and Blue Jasmine (probably my least favorite, but still enjoyable).",
            "review_date": "2015-03-14",
            "source": "rt"
        },
        {
            "content": "An Honest And Humorously Sophisticated View On Relationships!",
            "review_date": "2015-03-14",
            "source": "rt"
        },
        {
            "content": "i would because we need the eggs. you are trapped and you are out; you are sad and you fell to the lips; it's a vicious cycle running back and forth; then, you smile and laugh, sometimes",
            "review_date": "2015-03-12",
            "source": "rt"
        },
        {
            "content": "Not the near perfect gem everyone makes it out to be.....funny but not hilarious.",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "Was blissfully unaware of what to expect, but absolutely loved it. Stereotypical Allen. His neuroticisms are at first charming and amusing, but grow somewhat tiresome as the film progresses. An interesting approach to storytelling, particularly a love story.",
            "review_date": "2015-03-06",
            "source": "rt"
        },
        {
            "content": "Although not a Woody Allen fan, this movie is one exception. This movie truly defines a rom com in it's greatest fashion. Woody as Alvy and Diane Keaton as Annie Hall have terrific chemistry with one another. The movie is very original and creative and is probably one of first great examples of breaking the fourth wall the way Woody does. My favorite part of this movie was the performance by Diane Keaton. Annie Hall is  such a complex character",
            "review_date": "2015-03-02",
            "source": "rt"
        },
        {
            "content": "This guy is a genius",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "Neurotic comedian Alvy Singer falls in love with Annie Hall, Hollywood's first Manic Pixie Dream Girl. Told in non-linear fashion, this is the story of their relationship from beginning to end and every thought-bubble in between. In 1975 this won the Oscars for Best Screenplay, Best Director, Best Actress & Best Picture (besting STAR WARS), none of which Woody would come to accept at the ceremony.\nWhat's so fascinating about this movie is the abstract narrative. The story moves like a stand-up act with the 4th wall being immediately broken. Time jumps to the early parts of his life with flashbacks that become completely interactive. There's no logical version of time as characters from the recent past walk through a dinner party in the 1940's. We see use of split screen, subtitles, animation, and chats with omniscient New York pedestrians. This is a breakup movie for a cartoon character who doubles as a meandering, unreliable narrator.\nWe not only have Woody at the height of his caricature, but this is also a great showcase for Allen's first, and greatest muse Diane Keaton (whose birth name is Diane Hall). An autobiographical love story with an absurdist twist, it seems clear that much of the chemistry between the two leads comes from their real life. Even to this day Keaton gets joyfully giddy when reflecting on her former flame.\nFamiliar Woody themes include self-destructive relationships, beauty in them misery of life, and mockery of pseudo-intellectualism. Marc Maron fans will note that Alvy buys Annie \"The Denial of Death\" on an early date. Also, look for great cameos from Christopher Walken, Jeff Goldblum, and Truman Capote.\nIt's not my favorite of his movies, but still clearly one of the most original romantic comedies and one can see everything influenced thereafter from When Harry Met Sally... to (500) Days of Summer.",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "Very funny and creative",
            "review_date": "2015-02-22",
            "source": "rt"
        },
        {
            "content": "A boring and ugly movie.",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "This movie just made me smile. It made me feel all warm and fuzzy. And it's so relatable! A bit slow in some parts but overall enjoyed it!",
            "review_date": "2015-02-05",
            "source": "rt"
        },
        {
            "content": "Woody Allen's best film to date, Annie Hall is charming, devastating, funny, and loving all wrapped in one, capped off by one excellent Diane Keaton performance.",
            "review_date": "2015-02-01",
            "source": "rt"
        },
        {
            "content": "Thoughtful, quirky, hilarious, neurotic, even romantic, and altho talky, it moves quickly from joke to joke and thot to thot. Keaton and Allen are at their ultimate nuttiest and captured in their own goofy quirkdom here, and you will get it or you wont. \nI got it.\n Allen is actually shown enjoying himself w Keaton, and it makes this whole film transcend the dire selfish creep that Allen characterises otherwise.\nHe smirks often and has fun!\nThis is the culmination of the intriguing bits that make up Woody Allen's comedy without wasting too much time on any one of his many character pitfalls.\nYou will love or hate this.\nIt hits all the bases of fun entertainment, and was picture of the year for 1977, beating out Star Wars.\nNot for everyone tho - who might find the characters annoying. It IS Woody Allen..\n\n 4 out of 5 smirky glances",
            "review_date": "2015-02-01",
            "source": "rt"
        },
        {
            "content": "Woody Allen movies are in many ways all alike - they all contain the same neurotic protagonist, the same singsong intellectual chatter and the sense that the script is written around a few key jokes. Yet the Allen films that I have enjoyed the most usually contain something more: 'Manhattan' was a sharp satire of the New York intelligentsia and a loving ode to the city, 'Husbands and Wives' was a sparkling look at relationships and their complications, 'Midnight in Paris' was a delicious tribute to 20th century art and even 'Vicky Cristina Barcelona' contained copious amounts of Scarlett Johansson and Penelope Cruz.\n\nEven though 'Annie Hall' is arguably the most celebrated entry in Allen's filmography, somehow it doesn't connect with me on the same level as those other films even though I find it amusing, witty and innovative. I first watched it years ago and didn't like it too much. Older and wiser, I decided to give it another go, thinking most of the humour must have gone over my head back then. I did end up liking it this time, but the overall effect was the same. Something about it just doesn't stay with me.",
            "review_date": "2015-02-01",
            "source": "rt"
        },
        {
            "content": "My favourite Woody Allen film has Diane Keaton at her best and Allen at his most restrained and vital. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "3.5/4.0\n\nWoody Allen's most lauded movie that is considered by many as his best work, \"Annie Hall\" is significant for marking Allen's full transition away from pure slapstick. While there is much to admire in some of his earlier works (particularly \"Love and Death\"), the movie examines some serious topics while still being a comedy. This semi-autobiographical tale is still original by today's standards with wonderful insights about romance, New York (vs. Los Angeles), movies, poetry, and much more. \n\n\"Annie Hall\" is a love story that centers on Alvy Singer (Allen), a New York comedian, distraught over his break-up with Annie Hall (a luminous Diane Keaton in an Oscar winning role - she perfectly portrays the sheer charisma of a flawed character), a nightclub singer who has been dating him for some time. From that point onwards, we are carried through tidbits of Alvy's life including his childhood and his relationship with Annie, and how is numerous insecurities and her incessant desire for life gradually end their relationship. \n\nThe movie is not told chronologically with characters drawn into their flashbacks as innocent bystanders/commentators. Allen spends a big part of the movie \"narrating\" and expressing his feelings through talking to the camera and passer-bys in the movie (and I mean that literally). The way the movie is shot and told is still groundbreaking, which makes it one of Allen's most accomplished work as a director. The script is undeniably one of the best ever written as it never ceases to be smart, cunning, funny and, above all, original. While definitely one of his best, I still (after second viewing) don't consider it to be Allen's best work (and I know many may disagree with me on this) as it is not his most memorable. Winner of Four Academy Awards: Picture, Director (Allen), Actress (Keaton) and Original Screenplay (Allen and Marshall Brickman). Nominated for One Other: Actor (Allen).",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "M?j první Allenovský film. P?íb?h o chlapíkovi, co hledá enu, plné intelektuálních debat. Není to asi taková ta typická komedie pro celou rodinu. Líbily se mi tam ty \"vyprav??ské odskoky\", kdy se p?eruí scéna a herec si za?ne jakoby vypráv?t s divákem.",
            "review_date": "2015-01-11",
            "source": "rt"
        },
        {
            "content": "This movie could go on forever, and I would still watch it. It's an incredible, heartbreaking, hilarious look at love. It never stops being funny, and NEVER stops being interesting. Woody Allen's direction of this movie was revolutionary. He tears down the fourth wall with a wrecking ball. But between all the comedy, there is something so unexpectedly sweet and sad about the whole experience. It represents how many people found and lost love in the 1970's. I think this might be one of my all-time favorites.",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "Annie Hall sees Woody Allen combine brilliant dialogue, with great characters. This film, though not as visually stunning as his follow up, uses the camera in an interesting way, and time in an even more interesting way. This is truly the centrepiece of a brilliant writer/director's career.",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "Keaton's eponymous role is the precise opposite of Allen (beautiful, aware, and sensitive), but admittedly obsessive compulsion doesn't make the brutal honesty or liberal sensibility of the glorified therapy that is Annie Hall any less of a poignant, fresh take on the romantic comedy, if still a bit alienating in its self indulgence.",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "Many individually great scenes, though the whole is perhaps not quite as good as the parts.",
            "review_date": "2014-12-05",
            "source": "rt"
        },
        {
            "content": "A true American classic. Annie hall is fantastic romantic comedy filled with humourus dialogues, true and very honest relationship. Diana Keaton is lovely as Annie Hall for which she eventually won an well deserved oscar for best actress. Woody allen was fantastic and so was his sensitive direction. One of the best romantic comedy with true heart.",
            "review_date": "2014-11-24",
            "source": "rt"
        },
        {
            "content": "Wow. Over-fucking-rated on so many levels.... Full review to come.",
            "review_date": "2014-11-15",
            "source": "rt"
        },
        {
            "content": "It was a different kind of movie for me. Quite funny at times. Loved the acting by Keaton and Woody Allen.",
            "review_date": "2014-11-15",
            "source": "rt"
        },
        {
            "content": "One of the best romantic comedies of all time, and an essential entry to cinema history, Annie Hall is arguably Woody Allen's peak, with great leads and a pitch-note screenplay.",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "\"Life is irrational but most of us put up with it 'cause we need the eggs\". So enjoyed this film on a cloudy day in London...",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "It's true, this is Woody's best work. The performances are great, the humor is perfect, and the cocaine scene will forever be one of my favorites in film.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "Overall decent film, the dialogue is the best part of the movie.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Why did this get such rave reviews? Allen's humor is funny at times but the movie ...",
            "review_date": "2014-09-23",
            "source": "rt"
        },
        {
            "content": "Story of my life....",
            "review_date": "2014-09-21",
            "source": "rt"
        },
        {
            "content": "Review:\nThis is yet another Woody Allen movie about a troubled relationship. I did enjoy the scenes when Allen and the cast were talking into the camera, but I must admit, I did get a bit bored with the whole film. The constant questioning about his love for Keaton's character, Â becomes a bit tedious after a while and it just seemed like a New York fashion show half of the time. The flashbacks of his childhood were quite funny, along with the lobster scene in the kitchen, but the constant questioning of there past relationships and there weird sex life, which relied on weed, takes its toll after a while. Anyway, I was expecting something better after reading all of the great reviews, but I did struggle to stay awake. On the plus side, it is better than some of the other Woody Allen movies that I have seen. Watchable!\n\nRound-Up:\nI know that I'm really late with seeing this movie, especially as I was 4 when the movie came out, but it's very relevant to nowadays as it's about a couple who has its ups and downs, which happens in everyday life. The childhood scenes were actually about real moments in Woody Allen's life which show what type of upbringing he had. Definitely nothing that I can relate to! Anyway, on the whole, the movie is a love story set in New York, like most of Woody Allen's earlier work, and if your into his warped sense of humour then you wont find it hard to enjoy this movie, but I'm still finding it hard to understand his wit.\n\nBudget: $4million\nWorldwide Gross: $38.2million\n\nI recommend this movie to people who are into there Woody Allen movies about relationships and growing up. 4/10",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "It isn't rare for me to land in the minority opinion regarding critically acclaimed films/classics, and it appears I've found myself in that category again regarding Annie Hall.  While the dialogue was witty and detailed and the performances were good, I found the movie to be pretty repetitive at times and couldn't find myself feeling attached to its characters.  The opening monologue and films first act was engaging but it lost steam quickly, dragged and Woody Allen's character was frequently obnoxious.  Perhaps I missed something(s), but as of right now, I gained nothing from Annie Hall and it was a major disappointment.",
            "review_date": "2014-09-17",
            "source": "rt"
        },
        {
            "content": "Recommended by Ginny, not the happy ending I wanted",
            "review_date": "2014-09-16",
            "source": "rt"
        },
        {
            "content": "Woody Allen's on-screen persona is a ton of fun, and Diane Keaton has a unique charm. The humor isn't the sort of style I generally go for these days, it's kind of too straightforwardly joke-y, so I didn't laugh as much as I'd expect to in a movie I found so funny. I just love the slice-of-life no-plot-just-people thing Woody Allen does so much, I could watch a ton of these.",
            "review_date": "2014-09-06",
            "source": "rt"
        },
        {
            "content": "Strange that this gets remembered more than about twenty other, better Allen films. It's good, it's got some funny stuff and a few downright classic moments, but it's also meandering, overly long, and mostly pointless. At this point, it's probably remembered more for being revolutionary in the realm of romantic comedies than it is for intrinsic quality.",
            "review_date": "2014-09-06",
            "source": "rt"
        },
        {
            "content": "Slow paced but filled with humor, Annie Hall remains a comedy staple.",
            "review_date": "2014-09-04",
            "source": "rt"
        },
        {
            "content": "One of the best films ever made in history. \"Annie Hall\" is not just the tale about relationships, but rather, a masterpiece of human conflict and interconnected relationships. The eloquence and versatility so well instrumented by Woody Allen, brings us a very beautiful, touching and incredibly funny movie. Consituidas performances by Diane Keaton and Woody transform them into legendary characters. With a \"cult\" touch, \"Annie Hall\" discusses the differences of human relations on a special plane. Woody Allen gives us his greatest gift: comic, philosophical and intentionally shocking, his film is more a poem for the eyes, what a movie!",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "While the sharp dialogue is enough to carry the movie, Annie Hall suffers from stereotypical Woody Allen characters and a stilted narrative. Although the cameos are pretty funny.",
            "review_date": "2014-08-30",
            "source": "rt"
        },
        {
            "content": "An emotionally intense relationship dissection with wit and a self-aware sense of autobiographical humor, \"Annie Hall\" felt as fresh and exciting as some of Woody Allen's most recent work. I love with what nonchalance some of the most needling lines are delivered with. A wonderfully well-spun work of art, \"Annie Hall\" proves that Allen is one of the most intriguing artists of the past and present, relevant decade after decade.",
            "review_date": "2014-08-24",
            "source": "rt"
        },
        {
            "content": "A well observed film. Keaton lights up the screen. At nearly 40 years since it's release, it still has a lasting impact.",
            "review_date": "2014-08-22",
            "source": "rt"
        },
        {
            "content": "A movie that makes you hate Los Angeles and love New York. It also makes you hate the expression \"la-di-da\" and love Woody Allen. It's funny and smart, too.",
            "review_date": "2014-08-21",
            "source": "rt"
        },
        {
            "content": "Woody Allen at his funniest. A",
            "review_date": "2014-08-16",
            "source": "rt"
        },
        {
            "content": "Great Woody Allen Movie.Had A Strong Cast.But I Can't Believe This Beat Star Wars For Best Picture In 1977.This Wasn't Better Than Star Wars.But This Was Really Great And Really Funny.A-",
            "review_date": "2014-08-16",
            "source": "rt"
        },
        {
            "content": "Still funny, and Allen's screenplay seems so effortless, which makes me wonder how much of it was improvised.  It still makes me wonder whether Allen breaking the fourth wall, and other screenplay tricks actually hurt or help the film?  It's a bit distracting for my taste.",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "Nah. This was disappointing. I expected more from the movie that took the Oscar away from Star Wars. It wasn't clever or interesting, all of it has been done before. None of the characters are likable except for Walken and that's only because he's Christopher Freaking Walken.",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "Undoubtedly influential, Allen's use of non linear narrative and seamless blend of daydream with reality bring the film medium to its full potential.",
            "review_date": "2014-08-06",
            "source": "rt"
        },
        {
            "content": "love the dialogue in this. The coke gag is timeless. Keaton is hot and Allen is hilarious in his usual cringey way.",
            "review_date": "2014-08-06",
            "source": "rt"
        },
        {
            "content": "Woody Allen is an odd little man but he does know how to make a good movie.",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "\"I thought of that old joke, y'know, the, this... this guy goes to a psychiatrist and says, \"Doc, uh, my brother's crazy; he thinks he's a chicken.\" And, uh, the doctor says, \"Well, why don't you turn him in?\" The guy says, \"I would, but I need the eggs.\" Well, I guess that's pretty much now how I feel about relationships; y'know, they're totally irrational, and crazy, and absurd, and... but, uh, I guess we keep goin' through it because, uh, most of us... need the eggs.\"\n\n\nThe jokes aren't just jokes and the love isn't just love. Annie Hall is the first Woody Allen film I've seen and I enjoyed it an extent. I DID NOT enjoy the excessive rambling that passes as a script. Yet, there were very charming parts. I laughed out loud several times and the closing quote (as shown above) pieced the plot together very well.",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "One of my all time favorite love stories. One of the best scripts, and mostly everyone's favorite Woody Allen.",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "Perfect. Beyond it's time.",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "One of the classics, with a perfect and bittersweet ending.",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "Clever and bittersweet.",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "Some of it is so transcendent that it makes the rest of it look bad.",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "The humor was too dry for me, and Woody Allen tries too hard to be funny. But he's not.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "Very entertaining...great performances!!! An old classic favourite",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "Woody Allen writes it with incredible insight and a real understanding for urban neurosis.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "One of the funniest, most romantic, heartbreaking, intricate, entertaining, and invigorating films ever made.",
            "review_date": "2014-07-09",
            "source": "rt"
        },
        {
            "content": "A film about a neurotic, New Yorker, Jewish comedian and his girlfriend. That about sums it up in a sentence. This film is very well directed by Allen and acted by Keaton. The dialogue is superbly written, however it is a very simple plot with little character arc.",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "Annie Hall is classic Woody- quirky, hilarious, sophisticated, and shockingly accurate. The way his films portray New York in the 70's and 80's is the cornerstone of a Woody Allen film in the first place.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "one of the few woody allen films i like.",
            "review_date": "2014-06-28",
            "source": "rt"
        },
        {
            "content": "Annie Hall is a Rom-com done absolutely completely 100% right. The writing is center-stage, and boy does it deliver. Unlike so many romantic comedies of now-and-days I bought Allen and Keaton's relationship through and through. The fragmented and fun inter-splicing of events added a flair to both the comedy and romantic angles of the film. It's perfectly placed 4th wall breaks help immerse the audience and deliver the best laughs. It makes the 1 1/2 hour run time fly past. 5/5",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "Everything that's great about Woody Allen films is in this movie. It's sad, hysterical, bitter, intellectual, and it also has an inventive, know-it-all spirit that makes it a milestone of cinematic comedy.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "Deep analysis of couple dynamics coming from  a PoV of two very neurotic New Yorkers;very clever and original in the way it portrays those points of views too.If you've never seen Annie Hall before (just like me) then you will notice how this movie influenced modern cinema in many ways...worth watching? yes!!",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "Love and death, part two: the present. Woody hits a grand slam into the next county.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "An overrated Woody Allen picture, the biggest surprise about Annie Hall is not that it took home the Oscar for Best Picture, but that it managed to beat Star Wars for the Oscar",
            "review_date": "2014-06-10",
            "source": "rt"
        },
        {
            "content": "I'm going now to watch this movie again because frankly: I didn't get it. Maybe my hopes were too high, maybe I read into it too much, but I didn't get it. I loved Love and Death, which I think is Allen's best work. It bothers me that I didn't like Annie Hall, because  every time I asked someone I know had good taste if they liked it they would say, with the most sprightly passion: \"I loved Annie Hall!\" \nSo. I guess I'm an uncultured swine. Wish me luck with my rewatching of this underground classic.",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "The kind of comedy which is on the brink of extinction today...",
            "review_date": "2014-06-07",
            "source": "rt"
        },
        {
            "content": "Woody Allen is unbearable.",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "Es probablemente la película que definió el cine de Woody Allen tal y como lo conocemos. Una dulcícima Diane Keaton hace menos violenta la incontinencia verbal de Allen.... ahora estamos acostumbrados, pero me imagino que la primera vez debió ser casi agresivo para el espectador. En fin, necesaria y sin duda una película que ha inlfuenciado una época.",
            "review_date": "2014-05-27",
            "source": "rt"
        },
        {
            "content": "genialidad de un genio, humor único, historia para no perderse",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "One of the best films ever made in history. \"Annie Hall\" is not just the tale about relationships, but rather, a masterpiece of human conflict and interconnected relationships. The eloquence and versatility so well instrumented by Woody Allen, brings us a very beautiful, touching and incredibly funny movie. Consituidas performances by Diane Keaton and Woody transform them into legendary characters. With a \"cult\" touch, \"Annie Hall\" discusses the differences of human relations on a special plane. Woody Allen gives us his greatest gift: comic, philosophical and intentionally shocking, his film is more a poem for the eyes, what a movie!",
            "review_date": "2014-05-23",
            "source": "rt"
        },
        {
            "content": "Love his direct connection to the audience other than that... totally unimpressed. Woody Allen is so annoying.",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "Ahead of its time, insanely inventive, with witty dialogue and an interesting look at romantic relationships and 1970's culture through the eyes of a man who's so neurotic it's borderline annoying. There's just something about the way the film is written and shot that's just so different and, even though it's from 1977, feels new.",
            "review_date": "2014-05-19",
            "source": "rt"
        },
        {
            "content": "Overrated, but still enjoyable, Annie Hall is swiftly directed and well written and offers great performances from it's too leads, but the story is nothing special or incredibly all that interesting.",
            "review_date": "2014-05-14",
            "source": "rt"
        },
        {
            "content": "I'm not a big Woody Allen fan, and I don't care that much for Diane Keaton, but I like Annie Hall. I enjoy the creative way the story is told. The jumping around in time and the breaking of the fourth wall set it apart from most other romantic comedies. It's a unique and entertaining film, but it still shouldn't have won Best Picture over Star Wars.",
            "review_date": "2014-05-06",
            "source": "rt"
        },
        {
            "content": "Is this some sort of Jewish joke? Actually, it is. Well, it's a very good Jewish joke.",
            "review_date": "2014-05-02",
            "source": "rt"
        },
        {
            "content": "it's an oscar best picture of sexual brilliance",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "I am residing in a state of romantic comfort, as of now. Annie Hall tells the story of Alvy Singer (Woody Allen, also writer and director) more than Annie (Diane Keaton), and his history of romantic relationships. In the first scene, Alvy speaks directly to the camera, behind him a blank wall, and confesses that he and Annie broke up. He speaks with such depression over the fact that he is 40-years-old and is single once again. In my circumstances, I feared of entering my phase of introspection, as I observe the rise and fall of Alvy and Annie. How Woody Allen portrays the relationship trumps most romantic comedies is by never exceeding to melodrama. Since Alvy and Annie are supposed to be responsible, though not \"fully aged,\" adults, the relationship, that is the one that the entire film is centered around, simply comes and goes. No close-up shots, no \"yes or no\" choices, no orchestral bombast. I never rooted, or felt obliged to root, for the relationship to go one way or the other. I only rooted for the personal happiness of Alvy and Annie, whether they were together or separated. There were laughs, and there were tears. It's a relationship. As different as one relationship is from another, they can be quite formulaic, and Alvy sends that message home with his constant narration over certain scenes. His ultimate theme is that relationships are irrational, but they exist because they always have existed. Alvy honours the highs and lows of his relationship with Annie, and simply tries to move on. How many romantic comedies tell that much about love? In contradiction to what Alvy says in the beginning about never wanting to join a club that would take him as a member, I infer that most folk, including Alvy, want to belong, and that's why we continue to have relationships. My state of romantic comfort lies in how relationships seem to come and go. I can view dating like showering, where it is something that I do because it's what people do.\n\nI apologize. I am choking you with the romantic theme. How about the movie? Allen and Keaton are quirky, nerdy, and frankly very cute together. The best scenes of the two together are not blow-milk-out-of-nose funny, but cutely funny. One famous example is when they are trying to cook lobsters, and the shellfish are crawling all over the kitchen floor. Neither of the two want to touch the shellfish, and the scene plays out with them eventually picking up the lobsters and throwing them in the pot. There aren't any jokes in the premise, but the dialogue in the scene brings the two romantically closer and us in stronger interest and fondness for the relationship. Fun fact: Allen and Keaton were actually married in real life at the time. Since Woody Allen is the narrator, the story is more like how he sees the relationship. That is not to say that he is unreliable, but rather he loves to reinterpret originally normal scenes. For example, when Alvy and Annie first hang out and are discussing photography at Annie's place, we see the subtext of the conversation as subtitles. It's a trope now, but in the context of that scene, it still felt fresh and funny. That isn't the only time that Allen strips away the public persona and reveals subtext. After Alvy and Annie have an argument, Alvy approaches complete strangers about love. One couple mutually agrees that they are both shallow people with no good ideas, and that's how their relationship works. I really like these moments. I related to Alvy's sense of humour, at the expense of the misery in everybody's lives. Beyond that, there are some great straightforward jokes, the best with Annie's brother Duane (a young Christopher Walken, so you know it's at least a little twisted). Don't expect too many side-splitting laughs. Annie Hall is not about that. I'm hardly a Woody Allen fan. His earlier films are stylistically more akin to the Marx Brothers than where he is here, and I've never seen any later films. This particular Woody Allen film stood as an anomaly, but I really wanted to watch it because I sensed, and now verified, that Annie Hall would be a romantic comedy that cared as much about the romance as it did about the comedy.",
            "review_date": "2014-04-18",
            "source": "rt"
        }
    ]
}