{
    "rating": 9.1,
    "release_date": "1992-11-18",
    "num_reviews": 450,
    "genres": [
        "Biography",
        "History",
        "Drama"
    ],
    "summary": "A tribute to the controversial black activist and leader of the struggle for black liberation. He hit bottom during his imprisonment in the '50s, he became a Black Muslim and then a leader in the Nation of Islam. His assassination in 1965 left a legacy of self-determination and racial pride.",
    "reviews": [
        {
            "content": "Ages 13 and older!!!!!!!!!!!!!!! The greatest 03 hours: and 21 minutes, based on the true story of Malcolm X!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Spike Lee has easily made one of the 20th Centuries  very best and most powerful film's. A+",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the Oscars biggest blunders was not awarding best Actor to Denzel for Malcolm X . That movie really deserved at least 3 Oscars that year :\nDenzel - Best Actor, \nSpike Lee - Best Director, \nBest Picture",
            "review_date": "2023-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films from Spike Lee, and the the most iconic performance from Denzel Washington.",
            "review_date": "2023-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, great directing, and Spike Lee masterpiece. Tell a story from start to end and doesn't hide facts. I feel like nowadays a lot of directors that want to do life stories need to learn from this movie. Denzel, Spike should have won",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the best acting Denzel Washington has ever done. My top spike lee joint! It’s extremely hard to capture such a charismatic personality like Malcolm X but Denzel pulled it off",
            "review_date": "2022-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is probably the only Spike Lee film I enjoyed (other works were often too campy or hyperbolic).  This film was an overall very good production, had meaning, and told the story of Malcolm X well.",
            "review_date": "2022-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel’s natural intensity is perfect fit for Malcolm X. He carries this film from start to finish (all 3 hr 20 min) and should have one the Oscar for Best Actor. The film does sometimes over-glorify Malcolm and sort of laughs off the reporters that accused him of being a black supremacist (especially in the eulogy at the end). However, overall it does a good job of tracking Malcom’s various transformations and changes in viewpoint. Perhaps Malcom would have eventually become an advocate for peace like MLK. ",
            "review_date": "2022-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was expecting a more emotionally moving film than what I got here.  Spike Lee is preachy.",
            "review_date": "2022-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot like the Hurricane, not as good though. In the Hurricane, Denzel also has a much better chance to showcase his skills as an amazing actor. This one, is probably Spike Lee's most focused film... really good biopic",
            "review_date": "2022-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what I like films based on true story and over 3 hours plus great acting by denzel, give it a good 8 out of 10 would recommend 👍",
            "review_date": "2022-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Denzel Washington's best performances to date! Spike Lee delivered a unique version of the civil rights leaders autobiography, though, there were times when it showed the guy flip flopping on his own ideology. Still, one of the best films of the 1990's!",
            "review_date": "2022-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unimpressive plotting and execution. Poor storytelling by Spike Lee but great acting and transformation by Denzel.",
            "review_date": "2021-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X is a unique and important piece of movie history that shows the life of America's civil rights leader. I love everything about this movie from Denzel Washington's performance, Spike Lee's direction and the script. I have nothing bad to say about this movie because it really shows realism and emotion to the man who changed America forever. Overall, Malcolm X makes me yell \"I Am Malcolm X!\"",
            "review_date": "2021-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did enjoy watching this and found it to be compelling viewing material the entire way through its runtime; Denzel did an excellent job adopting Malcolm's real-life mannerisms, they did a good job with the 60s-era trappings and the pacing was good for a movie this long. I do have mixed feelings on Spike's direction here, though. On one hand he chose to start the biopic at near the beginning of Malcolm's life and to show the entire thing, leaving his hands somewhat tied in terms of how much screentime to give to each segment of Malcolm's life as he really did spend a full 12 years of his truncated adulthood with the Nation of Islam, but on the other Malcolm's life was cut short before he could spend longer espousing his later opinion that he had been wrong in some of his earlier beliefs about separatism and his blanket generalizations about all white people. Spike's choice to leave Malcolm's full speeches emphasizing the talking points that he personally agrees with and then basically paying lip service to the change of heart with very little runtime allotted paints an incomplete picture of who Malcolm really was at the time of his passing. Remembering him near-solely as a radicalized preacher of division & hatred is inaccurate & it betrays the notion that people can change and evolve despite that being a key plot point in the prison scenes.",
            "review_date": "2021-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way better than I remembered it to be!",
            "review_date": "2021-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fascinating and significant film, but too darn long.",
            "review_date": "2021-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington as that icon to society Malcolm X is the best acting performance I've ever seen.",
            "review_date": "2021-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sprawling, yet ultimately uneven. Nails the powerful rhetoric, but misses some broad aspects of Malcolm X's personal life. His family life and his relationship with his wife are slighted. At times Denzel's swagger gets in the way of his performance.",
            "review_date": "2021-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's Malcolm X is an exhaustively thorough, and sometimes just exhausting, look at the life of the divisive civil rights leader from his early childhood in Michigan to his 1965 assassination in New York.  Denzel Washington, arguably in his best role, is nothing short of spectacular as Malcolm, playing each scene with steely passion.  Clocking in at about three hours, the film holds the viewer's interest over the first half as it examines the early life of one of the seminal figures of the civil rights movement, exploring the events that made him who he was.  However, the movie loses considerable steam over the second half as it seems to be filled with an unending series of inspirational speeches and press conferences.  Clearly, there is importance in explaining the ideology, but it all becomes a bit repetitive.  Regardless, this is an important film to watch.",
            "review_date": "2021-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel should have won the oscar for his multifaceted portrayl of the title character, bringing flesh and blood to the words of MALCOM X's biography; which was  clearly (and lovingly) studied by Spike Lee.",
            "review_date": "2021-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the exception of Gandhi, Malcolm X is one of the best two biopics I've ever seen. It's a fully fleshed-out story about a very complex man's complicated journey as a Black man in a country built on bigotry.",
            "review_date": "2021-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have not seen this movie since it first came out in theaters. I decided to watch it again this Black History Month, and the film has withstood the test of time. This is Spike Lee's best project. He is not producing films on this level anymore. And it's a real shame, because we can clearly see what he is capable of producing.",
            "review_date": "2021-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though I completely disagree with the teachings of Islam, I think that this is a fantastically made film! Spike Lee made a very unique interpretation of this political figure’s autobiography, and he couldn’t have casted a better actor than Denzel Washington to take on the role of the man himself! Extremely sad to watch, but one of the best movies of the 1990’s! An A",
            "review_date": "2021-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great American epics and perhaps one of a handful of biopics where covering most of the subject's life works to its advantage. Washington gives the performance of his career here.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee creates a modern day epic with Malcolm X and Denzel Washington gives one of his very best performances to date.\n\nLee flawlessly moves through decades and across the country and continents, depicting the many changes his title character undergoes on his lifelong spiritual and intellectual journey by brilliantly adapting all aspects of the cinematography to convey the prevailing thoughts of his protagonist. Opening his movie with zoot suits, fast talk and bright colors in 1940s Boston is quite different tonally from the gray and serious tones, black suits, and carefully articulated dialogue that becomes prevalent as Malcolm Little becomes Malcolm X. I also credit Lee for generally letting the onscreen action speak for itself, keeping characters from telling me what to feel or believe, and allowing audiences to come to their own conclusions.\n\nAs praiseworthy as Spike Lee is here in presenting his film, it never creates the impact that it does without one of Denzel Washington's career best performances. Captivating doesn't really define his portrayal of Malcolm X, which had a magnetic quality that somehow made a film this long seem half as as short. Washington really had to embody many roles for this part, as Malcolm X was constantly growing and changing, making the person he was depicted as in the first forty-five minutes of the film almost unrecognizable from the man he was still becoming at the conclusion.",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of the 90s.\n\nDenzel Washington with his best performance in my opinion. (That's saying something.)\n\nPowerful movie.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely phenomenal. Spike Lee had done it again 😁.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Comprehensively great",
            "review_date": "2020-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee does a good job of capturing the life and philosophy of Malcolm X in his 1992 epic. Of course, it's no 100%. But still a good film to watch if your interested in Malcolm X, doing an assignment on him, or just want to celebrate black history month with a good movie.",
            "review_date": "2020-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic lead performance and a worthy topic lead to a great biopic.",
            "review_date": "2020-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even with its epic scope, Malcom X remains focused (until the end) on one thing: the engaging, yet imposing performance of Denzel Washington as the historical figure. As the world around him changes, both his immediate surroundings and the entire country, we witness Malcolm's viewpoint and principles shift and develop as he is repeatedly forced to review himself and his beliefs, leading him to become a more understanding and thoughtful person. In the first stage of his life he's a rash kid who's interested in crazy clothes, white girls, and straightening his hair. This version of Malcolm is taken in by gambling and the world of crime. He's thoughtless and reckless but still clever. Director Spike Lee shoots the film almost like a Scorsese gangster movie with frequent scenes in smoky bars and even freeze frames with narration by Washington as Malcolm. The next stage of his life begins when he's thrown in prison but finds mental freedom as a Muslim. From then until the end, Malcolm is a devout follower of Islam and its teachings. He faithfully follows his religious leader, Elijah Muhammad (Al Freeman Jr.), beginning each speech with, \"the honorable Elijah Muhammad teaches us...\" even when his mentor is sitting silently on his thrown, basking in his glory and not seemingly teaching anything. Malcolm is apparently doing all the work but while he's receiving plenty of accusations and threats, he's giving away all the credit. Malcolm's wife, Betty Shabazz (Angela Bassett), finally opens his eyes to the hypocrisy of his idol and Malcolm breaks away from the Nation of Islam. It still isn't until he takes a pilgrimage to Mecca that he can form his own honest beliefs on the condition of racism in America and the positive relationship African Americans should have with whites and among themselves. Spike Lee presents the power of religion and race to both unite and divide. Islam is shown to split even the black community as Malcolm criticizes other civil rights leaders, but it also brings people together under a common goal and belief system. Even when black Muslims are struggling to get the same treatment as whites, they are labeling women as property and concerning themselves with the heights of their \"mates.\" Malcolm also preaches that African Americans should remain independent of whites, even labeling all whites as evil, until he meets and prays with whites on his pilgrimage and sees that many of them aren't that different from him. In the end it's actually his own Nation of Islam that turns on him, after he's split it down the middle with extremist beliefs. Throughout sequences of Malcolm's time as a public figure, making speeches and taking trips, Spike Lee intersperses scenes with grainy, black and white footage of Washington as Malcolm, mimicking what would have been seen on the news at that time. This gives the story a sense of authenticity that greatly benefits it, but when it's time for Malcolm's assassination, Lee creates almost an action movie shootout that lacks the realism it needs to present the full impact of the historical event. After this, Lee continues to damage his message further by explicitly stating what an important person Malcom was through a eulogy by Ossie Davis and a talk by Nelson Mandela. This, along with pictures and clips of the real life Malcolm X, distract from and overshadow Denzel Washington's performance to which he devoted so much effort and care. Washington was Malcolm X, it was a biographical film not a documentary so it is through him that we should get the insight into the person that Malcolm was. And we do, but Spike Lee isn't confident enough in us or even in himself or Washington that we will understand his message.",
            "review_date": "2020-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With it's epic length telling three distinct eras of X's life (his early hustler days, his active Nation of Islam involvement, and his ultimate time of renunciation of segregation), Spike Lee and Denzel Washington tell of a life filled with controversy, conviction, and determination to find and tell truth.",
            "review_date": "2020-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant film making and acting.  How did this not get an Oscar?",
            "review_date": "2020-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decently good find on Netflix.. I enjoyed it; Denzel Washington did an outstanding job, to the point that I thought Malcolm X was playing himself! Spike Lee perfected this movie all the way, the characters, the writing, and the acting. A perfect movie to watch on Black History Month, and if you want to learn about Malcolm X and the Civil Rights Movement..",
            "review_date": "2020-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's very long, but the chronicle of Malcolm x's life and jump into civil rights to the end of his life is an important piece as of now during hard times.",
            "review_date": "2020-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's epic biopic is a brutally honest look at the Civil Rights leader. He's not always shone in the best light, but what's brought forward is what he ultimately did to stand up for his people. Denzel is brilliant and his transformation throughout the film is nothing short of astounding. Lee's direction also shows off his chops as a filmmaker, implementing many different styles and influences throughout, making it as much of an artistic film as an argumentative big budget production. His ability to seamlessly link it to modern times makes us realize how little progress is made and makes him such an important modern filmmaker. The three and a half hour run time rarely feels extravagantly padded and the various characters are all interesting and incredibly well fleshed out. Also, how can you not love Angela Bassett?",
            "review_date": "2020-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington should have won an Oscar for this role.",
            "review_date": "2020-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are not many biographical films as ambitious as Spike Lee's \"Malcolm X.\" This movie is one of those movies that is at least interesting from start to finish. I didn't know much about Malcolm X before watching this movie, but this movie is such a fascinating chronicle of the key moments in his life that now I want to learn more. This movie works because of Denzel Washington's exceptional and committed performance. I've always considered myself a fan of his when I think of my favorite actors and if you do too, this movie is a must-watch. I did not feel like I was watching an actor but rather I felt like I saw a real-life character come to life. It's clear that Spike Lee has a passion for the subject because the movie covers a lot of ground and is truly an epic experience. Overall, this is one of those movies that earns its long runtimes and is fully controlled by a great performance and true care from the filmmaker behind the camera.",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that should have focus on the dangers of how well intentioned anger could lead us to forget we are the same, turns into something else in the last 10 minutes.\n\nTerrific performance by Denzel, Spike Lee is in many ways very similar to Malcolm X, preachy.",
            "review_date": "2020-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The major flow with this movie I have is editing. There were times where I couldn't tell how much time had passed since the last few scenes, at one point a scene starts and Malcom X has four kids when he just seems to be in the early stages of marriage. \n\nA brutally honest portrayal of this of this divisive figure that may offend many. To those who would cast judgement on Malcom X for being anti-white I would point to his background along with the countless films where a white character is forgiven after a change of heart for racism over the course of time. \n\nThis movie really provoked the thought in me of how far could his movement have gone if Malcom X had lived 20 more year? Could he and Dr. King have united pushed us in a direction of equality and understanding that would have made us vastly us better today? We unfortunately will never know.",
            "review_date": "2020-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film!  If you didn't live through this period of time, learn some history & truth about this dedicated man.",
            "review_date": "2020-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lee adeptly translates one of the key facets of Malcolm X that attracts such polarized opinions: his evolution with time. Some characterize him as the radical segregationist, no better than those the civil rights movement sought to fight, and others as the more balanced and moderate reformer that saw the value in compromise. By presenting the circumstances by which he might have embraced each ideology, and often presenting the flaws, Lee allows the audience to form their own perception of the man. (4/5)",
            "review_date": "2020-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee as always showing deep and sad themes of our society",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overstretched to the point of apathy, the film is salvaged by a typically fine performance from Denzel and the significance inherent in retelling the story of Malcolm X.",
            "review_date": "2020-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this for the first time ever tonight and found the first half depicting Malcolm X's early life and time in prison to be quite masterful. What follows once he becomes the activist that we all know today though feels a bit rushed and I found myself wishing this were a TV miniseries with more time to tell the story instead.\nDenzel was as wonderful as usual but you already knew that.",
            "review_date": "2020-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X is a powerful, three-hour tribute to which the man movie names itself. This epic of a film guides its viewers through the evolution of Malcolm X's philosophy in each phase of his life.\n\nSpike Lee could not have selected a better cast for this film. Denzel Washington delivers a performance full of heart and passion. Truly both Spike & Washington at the prime of their careers. There were times I was convinced I was watching the real Malcolm X many times in the film.\n\nFor a biopic, the plot will be straightforward. Yet, I found the dedication to each tiny detail in each era of Malcolm X's life was both painstaking and rewarding. The set designs, costumes, and music were all loyal to the sign of the times. The film also follows each stage of Malcolm X's philosophies without saying which is right or wrong. The film is well-rounded and makes its audience understand each decision made.\n\nThis movie is loyal to its source material and viewers can tell that Spike Lee did his research. It pushed boundaries as far as can be reasonably told in a three-hour movie. I also enjoyed the final montage as it showed Malcolm X's far-reaching impact. I was even surprised to see Nelson Mandela make a cameo in the film. You don't see that every day.\n\n4.5/5. A loyal and timeless classic from Spike Lee. Stellar performances by Denzel Washington and the crew. Doubt any other biopic about Malcolm X could top this.",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has the right stars script and story. But director Spike Lee doesn't seem sure of how to efficiently use them to the best of their ability.",
            "review_date": "2019-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic performance by Denzel Washington. Have you ever watched a great actor transform into the subject he's portraying without sometimes knowing who is who? Spike Lee put perfection into this masterpiece.",
            "review_date": "2019-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel in probably the best performance of his movie career here(well, arguably I should say). It's another Spike Lee joint, so as usual there's going to be a bit of a political message, which is fine as it is his movie. It's also a very long movie, as I had to split this over two separate days. It's good, but I wouldn't put this in my Top list of autobiographical movies though.. I think mainly due to the super long run time.",
            "review_date": "2019-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "MUST SEE!\nSTOP WHAT YOU ARE DOING AND WATCH THIS MOVIE!!",
            "review_date": "2019-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel delivers in this movie to proportions i didn't know he had, infact, if you listen to Malcolm x speak then listen to denzel, you wont know who is who, thats how well he played the character.",
            "review_date": "2019-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"By any means necessary\" inspires my writing about what slave narrative silhouettes report about being Black in America day-one to today. Lived through life and times of Malcolm X and read his autobiography finding both inspiring and transformative experiences.",
            "review_date": "2018-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The strongest movie that I've seen in my life.",
            "review_date": "2018-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a long movie but worth to sit through",
            "review_date": "2018-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "suffering for attaining an uneven and imbalanced state of peace..\n\nMalcolm X\n\n2 And A Half Out Of 5\n\nMalcolm X is a character driven feature that focuses on justifying the characters rather than rechecking the material twice or even a clock for that matter. The journey of the protagonist depicted in here is a bit overstretched and not elaborated which comes off as a bit downer but since there is enough concrete material to feed the audience throughout the course of it, one can easily neglect it. \n\nIt is short on technical aspects like cinematography, background score, art design, sound department and editing although is rich on costume and production design. The writing follows a rudimentary process of a rigid structure that is extracted directly from the textbook, it lacks maturity and smarter approach. \n\nThe screenplay by Arnold Perl and Spike Lee is effective and creates a greater impact than anticipated among the viewers but unfortunately it also lags a lot. Spike Lee; the screenwriter and director, has done a tremendous work on executing the script on screen and it is undeniably Lee's feature as he speaks volume in every frame. The performance objective is taken hold by Denzel Washington with conviction and he does carry it all on his shoulder with head held high for around 200 minutes. \n\nMalcolm X is a process of suffering for attaining an uneven and imbalance state of peace that results in so latter, that the audience barely cares about the outcomes for they are having a time of their life encountering just the process.",
            "review_date": "2018-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee has done it again! \"Malcolm X\" is a well-made biographical film that showcases the rise and timely death of a hero that changed our nation. Sure, the film felt long, but thanks to the powerful performance made by Denzel Washington, you can't help but stay put on your seat until the credits roll. The film is engaging, the cinematography was top notch, and the love that Spike Lee put into this film felt admirable and inspiring. A timeless classic.",
            "review_date": "2018-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X is the greatest biopic ever filmed!\n\nSpike Lee directs his magnum opus with his 1992 movie Malcolm X. It is as poignant a movie and message as when it was first conceived. Lee brilliantly adapted Alex Haley's novel The Autobiography of Malcolm X thoroughly. Malcolm X is a wholly comprehensive look at the life of Malcolm X. We see his childhood, young adulthood, incarceration, reformation, epiphany, all the way up to his assassination. It is historically accurate, detailed, fair, and quite profound. I also continue to find this movie highly entertaining at all times. Please watch Malcolm X.\n\nSpike Lee's direction and creative visuals persist as some of the most innovative and immaculate cinematography and framing ever committed to film. Every scene has an interesting angle or perspective. So many cool panning shots and intense sequences. There are brilliant quiet moments filmed in a more intimate style, then boisterous scenes shot in a more wild style. Spike Lee proves his mastery as a director with Malcolm X.\n\nNotably, Denzel Washington delivers his absolute peak performance as an actor. Watching Washington embody the look, tone, complexity, and wisdom of Malcolm X is a delight. He captures every type of personality that Malcolm represented, while simultaneously demonstrating Malcolm X's bold presence. Washington plays him calm, cool, and collected. Malcolm X starts out misguided, but evolves into the ultimate orator, verbose in vocabulary, passionate in faith, and engaging in speech. It is a pleasure to witness Washington's acting as Malcolm X.\n\nA number of brilliant supporting performances are contained within Malcolm X. I love Angela Bassett in this movie as Betty X. Delroy Lindo is excellent as the mobster Archie. Albert Hall is captivating as Baines. Al Freeman Jr. is truly haunting in his take as Elijah Muhammad. I actually really love Spike Lee's portrayal of Shorty. He gives as good a performance as Lee does in Do the Right Thing. Every gives their career best here. It's an impressive ensemble to say the least.\n\nIn all, Malcolm X is an important film for society's conscious, film history, Denzel Washington's career, and Spike Lee's filmography. It is also the most engaging and comprehensive biopic ever released. I think people everywhere will relate and understand Malcolm X more deeply than what they previously knew before watching the movie. I highly recommend this cultural classic of cinema. Malcolm X will astonish you!",
            "review_date": "2018-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DW powerful performance.",
            "review_date": "2018-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic piece of work from both Lee and Washington.",
            "review_date": "2018-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad to say the least. ",
            "review_date": "2018-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the ideal biopic: true, detailed, and captures all sides of the man, Malcolm X.",
            "review_date": "2017-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rarely you see a great story casting and directing all in one. Omowale was one of the most powerful leaders during the civil rights movement! It was brought to the big screen and a great way",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Biography about Malcolm X. Before this movie I didn't know a thing about him. Spike Lee does a good job but he needed to edit 30 minutes out. Movie is too long.",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw this one. Won't lie it was the three hour and twenty minute run time that always threw me off because I knew I wanted to watch it fully through and not piece by piece. Well glad I did. Although it is slightly dated I found it very well done. Denzel Washington plays the title role of Malcolm X. The film is shown during his early life where he is a small town crook that gets busted. Malcolm experiences the racism from white people early on. His father was killed by the KKK, the judge gave him and his friend a huge sentence not even for robbing someone, but for sleeping with white women. While in prison Malcolm converts to Islam under the mentorship of a fellow inmate Baines (Albert Hall). Converting to Islam gives Malcolm a path and he soon join The Nation Of Islam leading his own crusade to bring about the equality and love for his people. The movie is well paced it fits in some flashbacks to go over Malcolm's early life and it never takes away from the plot moving forward. Denzel is fantastic as the lead. He brings about the character and the power behind his speeches and actions. Overall, really great movie and I'm glad to have finally watched it. The words of Malcolm X weren't always agreed upon by everyone, but his clear message of loving yourself and not changing to please someone else is something anyone can agree upon. Highly recommended.",
            "review_date": "2016-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's biopic of the legendary civil rights leader suffers from message over substance , still brought to life by by a powerful performance from Denzel Washington . 7/10",
            "review_date": "2016-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's masterpiece is as layered and engaging as the life of its protagonist, with an accurate and honest depiction of the civil rights leader brought to life by a compelling performance from Denzel Washington.",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 hours went by fast.  amazing film!",
            "review_date": "2016-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The building of a new nation begins with the woman.\"",
            "review_date": "2016-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8/12/2016: Pretty disappointing. It was too long and too boring.",
            "review_date": "2016-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A amazing film that Denzel Washington gives a top performance in with him portraying the calm yet intimidating Malcolm X. The topic is great but this films goes for a little more than the usual bio pic with it being quite brutal harsh but thats who Malcolm was white people hate him cause he didn't white people how hew went from ignorant to quite smart referring to anyone who didn't agree with his points provided by the Nation of Islam and Elijah Muhammad. May I say the one scene I enjoyed more than most was a scene that had the usual Spike Lee shot to where it doesn't see something thats going on in reality but in the mind while the wonderful \"a change is gonna come\" by Sam Cooke plays. This movie is a masterpiece show how brutal America was back then. I think Spike did a amazing job with he blows being realer than most. The darkness of America back then is evil with the KKK, police brutality and the rise and fall of Civil Rights leaders when the black community rose up and said we have had enough mixed with beautiful camera work and a great meassage I suggest Malcolm X to anyone who can face the brutality of past America.",
            "review_date": "2016-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous movie; brings me to tears each time!",
            "review_date": "2016-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very long biopic of a man who, in other films, was portrayed as the one man who didn't believe in non-violent protests. That doesn't come across in this film, I'm sure it's factually correct but perhaps some of the story is hiddne a bit. Interesting film about an interesting bloke.",
            "review_date": "2016-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First hour was just unnecessary. Could have been concluded in 10 to 15 min. The transitional period in prison was were the film kicked in and never let go. Inspirational, educational and powerful. \nAs Muslim I was also provided by an unexpected message. Religious sects and parties are susceptible to corruption of its members and message and would normally be built upon some truth to reach the masses. At the end its not God whom they serve but their own goals and interests. Malcoom X was among the few who realized this corruption and broke free from it but everything comes at a price! May Allah reward him for what he's done.\nThis is also true and would apply to other religious communities.",
            "review_date": "2016-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good portrayal of Malcolm.",
            "review_date": "2016-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no idea why Denzel Washington didn't get an award for his performance here.  A superb movie from Spike Lee that makes you think about the revered civil rights leader.  A superb biopic.",
            "review_date": "2016-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best examples of Biopic Film-making, in that it establishes and breaks all the rules, giving us the definitive dramatization of an unfinished life, whose identity was in a state of re invention.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite Spike Lee movie. That's not saying much. I cant stand his style. Like his other movies, it just seems to juvenile to me, as of made by a student. Random \"artsy\" things thrown in like gun shot noises for no apparent reason were the worst. \n\nThis story could really use a new more serious treatment.",
            "review_date": "2016-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic biopic, centred around a phenomenal Denzel\nperformance",
            "review_date": "2015-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directed with levels of assurance and evocation only Spike Lee could provide, \"Malcolm X\" is worth every minute of its excessive runtime.",
            "review_date": "2015-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Changed my life in many positive ways.",
            "review_date": "2015-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington is great as Malcolm X as well as Angela Bassett as Malcolm's wife. Spike Lee does a great job directing this especially the powerful ending. The movie sometimes was heavy handed in preachiness but for the most part held strong to the message of Malcolm X. Great screenplay as well",
            "review_date": "2015-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "**\nThe movie may have merits and I'm not denying there aren't good scenes, but I'd be lying if I said I enjoyed it. When a movies so long that it's split onto two separate discs, there's bound to be moments where it drags. And boy does it drag.",
            "review_date": "2015-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X works best as a stage for its star and an explanation for its hero. It is not as sweeping as other biopics of its time or as piercing as other Lee efforts, but nonetheless, it is sweeping and it is piercing.",
            "review_date": "2015-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and Denzel is a great actor.",
            "review_date": "2015-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "He was a very complex man, and this movie does a great job of portraying the several layers.  It still blows my mind that Denzel gets an Oscar for training day, but not this...",
            "review_date": "2015-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the greatest biopic ever if not one of the greatest films ever just a fantastic piece of cinema beginning to end a electrifying believable sympathetic performance from denzel whasington.  great acting front to back.  so true to the story of Malcolm x. with denzel portraying Malcolm in the best way any one ever could. this movie is so true to his story.  but yet not your typical snoozefest biopic either its got a energy to it a energy I've never seen in a biopic and I've seen in very few films in my life.   spike \"the race-baiting\" Lee directs and he did do a good job but what makes the movie good is the acting and the energy of the acting the gritty portrayal of Malcolm's life the believability and the power the movie has  and the fantastic musical score and a fantastic soundtrack as well.   truly amazing film    one of the greatest movies ever I've never seen a film like this and I never will again",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Achieved been a great film and a crap film at the same time.  Strong message though",
            "review_date": "2015-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I've ever seen. The ending of the film is superbly done by Spike Lee.",
            "review_date": "2015-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful movie that is quite faithful to the book. A must-see piece of social history.",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The growth and evolution of Malcolm X is breathtaking. Denzel gives one of the greatest performances in cinema history. I encourage you to see it, just to grow as a human being.",
            "review_date": "2015-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well crafted and acted bio-pic",
            "review_date": "2015-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X is an excellent biopic about the turbulent uprising of one of the greatest and most controversial civil rights leaders.  One can feel its three hour running time, but I was never truly bored, instead I was engaged about this mans life story, always interested in what would happen next.  Boasting a great lead from Denzel Washington, conviction-filled performances, beautifully composed cinematography and a smooth pace that nicely develops the story, Malcolm X is a biopic I recommend most people see at least once.",
            "review_date": "2015-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best and probably most important Bio pics to ever be made.  It is also the longest.  3 and 1/2 hours of this mans life.  I did learn a lot about the guy and his struggles, beliefs etc.  I'm actually very glad this movie is so long.  Every scene has a purpose.  The dancing can go on for a bit too long but that's not much to complain about.  \n\nActing is solid.  Even for Spike Lee's part.  Check it out.",
            "review_date": "2015-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now this is a way to do a biopic, 'Malcolm X' is an exceptional film that features one of Denzel Washington's best performances and is perfectly directed by Spike Lee. It feels almost like a cliché to say that Denzel was good because he's always good and he always makes everything effortlessly watchable but he's scarily good in this and looks the part so much, you couldn't have gotten a better actor for this film and to that review, by Jonathan Rosenbaum,  that said he was miscast, what? You see footage of Malcolm X at the end and it just solidifies how much of an excellent job Denzel did. It is a performance for the ages that was unfortunately snubbed by a knock-on effect of previous Oscar snubs, I'm not saying that is a good excuse and talent isn't, or to some people- shouldn't, be judged by awards, but still, wow, what a shame. The film has an excellent cast that features some veterans as well and everyone does an excellent job, you really feel invested in its world and for a film that is as long as it is, it couldn't be any other way. It certainly is an ambitious film and it's a miracle Lee got it made but it paid off because it is a truly engrossing experience that earns its length and moves along perfectly. The structure of the film reminded me of, 'The Deer Hunter', which is, funnily enough, Lee's favourite film and the way everything develops is perfect and he tells the story the way it needs to be told. You go on a real epic journey during the course of this film and so much happens; Lee pulls no punches and tells it like it is, which is a great thing to see, especially in a biopic, and it is filled with so many iconic moments. I knew what happened to him before I watched it but I'm still surprised by who did it, I know the devastating conspiracy behind it all, but still, I thought it'd be white people when I first learned about him. I know he said he wasn't afraid but he should have moved! It's heartbreaking to watch.\n\nMy only real complaint is with some of the editing, sometimes it'll have a voice-over whilst having a conversation underneath but it wasn't used like how most implement it in their films with one audio track being quieter than the other or playing the tracks one at a time with breaks and it made it jarring because I was trying to listen to both at the same time, even if they spoke about the same thing. Also, it'd show a flashback to scene for a few seconds and then later on show us the full thing and I just found that odd, it also showed a flashback to something that happened in the past that was happening to the characters in the present and I recognised the similar scenario without feeling like I had to be retold. There was also a shot looking up from a piece of grass and it just made me think about props. I understand these are huge nitpicks but in a film that's as perfect as this, that's all I can say. And what else can I say that hasn't already been said? For a film that is as amazing as this one is, there really is no point to repeating myself. It's an intelligent, powerful, engrossing film that is an epic in the full sense of the word and totally earns it. THIS is Best Picture quality and should have been up for more awards, awards don't make a film but this is excellent. I'm so glad that I have finally seen it.",
            "review_date": "2015-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is without a doubt one of the best films ever made. Denzel Washington gives without a doubt one of his best performances of all time as Malcolm X, the civil rights leader who was pro-violence against the white people during the civil rights movement before coming to his senses and realizing the Muslim religion he was so eager to lay his life down for was hypocritical and in some ways I felt used Malcolm X, or just got too jealous once his stature in the Muslim religious group was getting him so much attention that people believed he was the voice of Allah; not the honorable Elijah Muhammad. They turned on Malcolm X, just after he literally devoted his life for their cause because their religion helped him get sober, and allow him to find himself again before becoming just another degenerate in Harlem. Denzel literally is Malcolm X. Just like Daniel Day-Lewis was Lincoln, and like Sean Penn was Harvey Milk in Gus Van Zant's \"Milk.\" No one, and I mean no one could have had the strength and endurance to play Malcolm X as Denzel Washingoton did in this movie just makes me believe that Denzel is without a doubt one of the best actors that has ever lived. He's a fearless actor, the man has a true potential for acting. I mean come on the guy did not win his two Oscars for \"Glory\" and \"Training Day\" for nothing. But there is something about \"Malcolm X\" that just hits you hard when you watch it, mostlt because Denzel is just so damn good throughout  the whole movie that he is truly the driving force behind this\nwhole movie. There are also great supporting performances by Delroy Lindo, the hoodlum gangster of Harlem, who takes Denzel's Malcolm X under his wing after he sees him smash a guys with a glass bottle after insulting him and making a comment about his mother which Denzel tells him ferociously to never say another word about his mother again. Albert Hall, who played the chief in Francis Ford Coppola's Vietnam achievement \"Apocalypse Now,\" is great as Bane, the man who shines the light onto Denzel's Malcolm X and converts him into the realm of Islam and helps him become a Muslim. And then there's Angela Bassette and even though they toned her looks down a little bit for the movie so she can look like a typical Muslim wife of Malcolm X, she still looks good and even today at 56 she still rocking it if you ask me. She gives a very, very strong performance as Malcolm X's wife and even though I have only seen a handful of her films, I find she delivers every time I see her in a movie. Even Spike Lee, the Director of this movie who I know is very controversial subject matter these days even bring a great presence as Malcolm X's hoodlum buddy in the film. This is a movie not be missed as I would definitely put it in my \"1001 Movies You Need To See Before You Die\" list and just want to say one more thing. This is the most historical bio I have ever watched and truly believe this was my first Denzel Washington movie and I remember even seeing \"Malcolm X\" at a young age when I believe it had just started coming on TV after being in the movies and thinking the whole time watching Denzel Washington in this movie that this is an actor I have got to keep an eye on as he is truly, TRULY a remarkable actor who I hope keeps bringing us more great performances for years to come. Also about Spike Lee, even though like I said before he is a controversial subject matter these days I will admit one thing, no one but him could have directed this movie as for a man of Spike Lee stature I would like to say this is his \"Goodfellas\" as nobody but him could have made a movie like this I truly applaud him for this was a very fierce movie to make and even though he was nominated for Best Director for this movie even though I feel he should have; Denzel Washington was able to execute Spike Lee's vision....and that's all that matters.",
            "review_date": "2015-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Near perfect characterization and a noble cause, Malcolm X is a must-see, and some might say Spike Lee's magnum opus.",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overlong but worth it, Spike Lee's Malcolm X is a bold and fascinating portrait of the Civil Rights leader from his troubled upbringing and criminal career to his redemption in prison and rise as the firey voice of the Nation of Islam.",
            "review_date": "2015-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "yowza, what a powerhouse of a movie that shows a sweeping life and the importance behind it, even if it fudges the facts a little.",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "92%\nWatched this on 26/1/15\nI am a huge Denzel Washington fan and not even in the rarest of rarest times does his acting or films disappointment me and Malcolm X is no exception. The film turned out to be nothing like anything that I have ever expected it to be, I did not even know who Malcolm X was and that did prove to be good. Spike Lee's film is of an epic scale and the performances of it's cast especially Denzel make it all the merrier.",
            "review_date": "2015-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good historical movie that people should know about starring Denzel Washington. I love comparing movies so I am going to compare malcolm X and Selma. I'm glad they denzel got nominated for his performance as malcom x. I've never heard of the story of Malcolm x and now that I have seen and witnessed his story it's interesting that he acted the way he did. I never knew he was an  Islam and he's a more violent martin Luther king Jr and a some kind of dictator like when he moved all the black people from the hospital.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though its story runs way too long and slowly, this biopic of Malcolm X is emotionally powerful thanks to the strong performance from Denzel Washington whose portrayal of the title character captures the honest human element of struggle and strength.",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Denzel's greatest roles to date.",
            "review_date": "2014-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an pic film from Spike Lee and is in my top 25 films all-time, I've viewed it many times.  At 3 1/2 hours, it really covers Malcolm's life as much as a biopic can, and Denzel Washington absolutely brings him to life in what may be Denzel's greatest performance.  i highly recommend watching this, a MUST see in my opinion!",
            "review_date": "2014-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy moly, what an incredible masterpiece and experience!!  It was a bit funny, extremely intense, informative, engaging, emotional, and sad!!  This will keep you on your toes from start to finish!!  It told the story of Malcolm X extremely well!!  The dialogue was supremely engaging!!  Denzel Washington gave his absolute best performance of his career and one of the best ever put on film!! The film clocks in at 3:22 minutes, making it one of the longest films I have ever seen!!  However, Denzel was so intense, engaging, and gripping that he will make the time fly by!!  He was that magnificent!!  The director (Spike Lee) directs this films with so much passion and this is his best film ever!!  If you like biography films, than check this out!!  If you don't, than this is not for you!!  This is arguably the greatest biography film of all-time and one of the best movies ever!!  This is without a doubt a must-see!!",
            "review_date": "2014-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film of vast importance.",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington is outstanding in the lead role in the this film. His character changes a lot over the course of the movie and Washington is excellent the entire way. His performance holds the entire film together. Spike Lee does an excellent job at bringing the Malcolm X story to life.",
            "review_date": "2014-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's greatest contribution to the art of cinema.",
            "review_date": "2014-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Say what you will about the ideology, the history and everything else, but you cant deny how breathtaking Denzel is in this movie. Few actors have truly captured a real human being more perfectly than Denzel did for Malcolm X. Its a masterpiece.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A legendary performance by Denzel Washington that should not be missed. About Malcolm X, a pivotal religious leader for the African Americans parallel to the times of Martin Luther King Jr. His ideologies are questionable though.",
            "review_date": "2014-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "to long but great could get award  for this  flick",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nominate in Oscar 1992 for best leading actor,Denzel Washington.controversial and biography movie about one historical leader in black people history.this movie get more interesting after the religy aspect come in the middle part.gived to us detail about his childhood,background and his path of life.starting with negative way but end with positive way.that's why nothing to worry about bad influence. One of the best true story movie i've ever watched.",
            "review_date": "2014-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X is a powerful look at a powerful revolutionary. It is just one of those movies that you remember for a long time after the movie because of how affecting it was. Denzel Washington's performance was just powerful and brought Malcolm X to new life. The character development might have lasted 3 hours, but it was ultimately worth it. Spike Lee does a great job at bringing a true brother to new life with a historical epic with revolutionary detail that only Malcolm X could bring.",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling look at the controversial Civil Rights leader, featuring a powerful performance from Denzel Washington.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bit slow  (13)   TO OWN",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid biopic with excellent acting on the part of Washington. It does an excellent job of highlighting Malcolm X's life and keeping it interesting enough for the viewer.",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece. Lee stays true to the autobiography and brings a colorful hue to this great man's rough journey towards Islam.",
            "review_date": "2013-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its more like a literature works rather than a biograph movie.",
            "review_date": "2013-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a stunning biopic from Director Spike Lee",
            "review_date": "2013-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant biopic that represents the career best of Denzel Washington & Spike Lee.  Washington transforms into Malcolm X, not only capturing his look & mannerisms but his brilliant speech-making ability, that even in his most racist moments, you can't help but be transfixed by what he's saying.  He receives plenty of support from the rest of the cast, but is only matched by Al Freeman Jr., who portrayal of Elijah Muhammad is uncanny.  Lee gives the story the epic delivery it deserves (the opening scene alone tells you're in for a big film) and while he veers close to being overly political (particularly the opening & closing scenes) he doesn't shy away from showing Malcolm's many faults, from his criminal past to his blind devotion to the Nation of Islam.  A true classic & one of the best bio pictures ever made.",
            "review_date": "2013-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing, ambitious and fairly balanced portrait of an epic figure. Although Lee probably shouldn't have put himself in such a large role, this is one of the classics of the biopic genre and a truly epic tale.",
            "review_date": "2013-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee has delivered a truly authentic biopic of Malcolm X, a controversial yet often misinterpreted social movement leader living in an influential decade. Despite the uncompromising philosophy he preached, how can you expect respect if you don't respect yourself? Brilliant performance from Denzel Washington.",
            "review_date": "2013-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not as avant-garde as to find horrible faults in this film. I think the narrative is very well crafted, keeping the viewer's interest and the treatment of the subject conveys more than enough seriousness. I don't know why Spike Lee gets so much heat, probably it's from the kind of folks who watch La Strada and think they're edgy :3",
            "review_date": "2013-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think \"Malcolm X\" is a perfect movie, but, like \"Schindler's List\", or even last year's \"Lincoln\", it's an important one. Spike Lee and Denzel Washington paint a flawed portrait of a flawed man, that carries all the heated exchange of a racial revolution without -- thankfully -- succumbing to the big theme of the movie -- and all Lee's movies, for that matter -- hype. Lee directs with a fitting amount of tense, handheld urgency, while Washington, not unlike Joaquin Phoenix in \"The Master\", wears Malcolm with a stern sense of worry, a lost boy struggling with big ideas personal and universal. Even when the filmmakers too sharply turn chronological corners, it's Malcolm's words you can't shake. Their courage stings eternal.",
            "review_date": "2013-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel is as always a great artist and this character brings out the best of his work. Supporting actors add spice and heavyweight to the theme giving a rendition that is worthy of the viewing time. Dramatic scenes make for a brutal lifestyle enhanced by anger and frustration, come harshly to the screen showing a lifestyle that America is proud of, true freedom for all. Nibbles: beignets, jambalaya.",
            "review_date": "2013-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's Malcolm X may take it's time getting the ball rolling, but once it does. It is an unstoppable force, powered by Denzel Washington's outstanding performance which ranks as one of the best of his career.",
            "review_date": "2013-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of Spike Lee's best\nDenzel Washington completely sells it as Malcolm X, one of the brightest leaders in history\nthis is an amazing depiction of the very successful autobiography and one of the most important pieces of writing of the 20th century\nat the time according to Alex Hayley Malcolm was the embodiment of black manhood and desperately tried his whole life to turn the fight for civil rights around\nthe film is terrificly acted, remains a true example of historical significance, and is very hard-hitting when discussing the important subject matter of racism\nMalcolm himself dealt with racism all his life and going through many phases in the process even to changing his name, his identity, and his personal views back and forth\nluckily he had great inspiration from figures like Elijah Muhammad to guide him and all black Muslims for peace and equality but the film also touches upon his overabundance of control and too much power and influence \nSpike Lee doesn't shy away from the realities of Malcolm and he focuses on the important symbols, themes, and messages about social status, religion, segregation, predjudice, rules of society, non-physical confrontation, unity, peace, enlightenment and so forth\nthis is a truly outstanding biopic about the man who lost his way but lead the way for others to follow in future generations to never stop his vision of bringing the rights to every human being on the planet",
            "review_date": "2013-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, one of my top 3 with Denzel Washington",
            "review_date": "2013-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This 1992 movie is a classic! I really got more insight of what happen to Malcolm! I realize Malcolm X started to be independent after the murder plot from the Nation Of Islam with the help of the C.I.A.! Not after he came from Macca! \n\nThe cast was great! This is one of Spike Lee's best films! Spike Lee did a good job playing Shorty! Denzel Washington was perfect for playing Malcolm X! I love to see the two most beautiful women which is Angela Bassett(as Dr. Betty Shabazz) and Theresa Randle(as Laura). Wonderful job by Al Freeman Jr. for playing Elijah Muhammad\nGlad to see Delroy Lindo (as West Indian Archie) in this movie. The two well known veteran actors Roger Guenveur Smith(as Rudy) and Giancarlo Esposito(as Thomas Hayer) did their thing too! Also, Ernest Thomas(Sidney) from the 70's tv show \"What's Happening\" did a great job too! It was crazy to see Al Sharpton in this movie when he was fat.",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic look Into the history of Malcolm X and Denzel Washington leads a fantastic Role.  \nI didn't know much about Malcolm X prior to seeing this film so thoroughly enjoyed being schooled.  It was a long film, which in parts fell a little drab, and randomly shot back to his past without explaining why, but once you'd got used to that and followed the storyline in general, it was a great film.\n\n\"A man who stands for nothing will fall for anything.\" - Malcolm X.",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "there's no film that desreve's as much of praise than Spike Lee's Masterpiece Malcolm x its an incredible film that chronicles every important highlight of this great man's life Spike lee is of course and i have said oen of my most favorite directors of all time and his film's really inspire me true to the heart and im a fan of is studio \"40 acres and a mule\" but Malcolm x is 100% on target with gripping the audience and not letting go.",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 1st half of the film was awesome, then it just went blank. Malcolm X's story is interesting but Spike Lee's version always overdoes it and makes it a drag. Superb performance however for Denzel.",
            "review_date": "2013-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Spike Lee's best films and one of Denzel Washington's best performances, Malcolm X is sweeping, moving and thought provoking.",
            "review_date": "2013-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X is a very insightful and at times very powerful biopic about a wonderful leader for civil rights Denzel Washington is just brilliant in this film and Spike Lee does a wonderful job with this film it is very well made and finally I particularly enjoyed the cameo of Nelson Mandela at the end",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie!  One of the best.",
            "review_date": "2013-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this again a few days ago. This movie holds up. I particularly liked what Spike Lee did with the camera and the lighting when Malcolm X (Denzel) was in solitary confinement. Cinematic magic!",
            "review_date": "2013-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In bringing the life of African American leader Malcolm X to the screen, Spike Lee is not afraid to be brutally sincere, daring and even uncomfortable. Filmed with Lee's usual great visual flair, and supported by a powerhouse performance from Denzel Washington, its only fault lies in its director's usual over indulgence which clearly shows in eccentric finale, Spike Lee gives the figure of Malcolm X a glorifying portrait, making him look like one of the most important and a times misunderstood icons of the 20th century.",
            "review_date": "2013-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This guy is a racist why does anyone want to a documentary on him",
            "review_date": "2013-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. Most powerful movie I've seen all year by far!!",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington brings this real-life figure to life for so many who have heard, but otherwise don't know. His portrayal, highly touted as \"extremely accurate\", offer a long-standing image if this key figure if civil right for generations to come.",
            "review_date": "2013-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. Denzel and Angela at their finest. While long, I'm glad I sat through it!",
            "review_date": "2013-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It Was A Good And Fair Portrayl Of A Man That I Never Really Knew Until I See This. It Was A Bit Slow In Places Though. You Are Gripped By And Amazing Start, Drawn In By The Build Up Of His Teachings Then Suddenly Shocked As He Is Killed By One Of His Own. Just How He Called Kennedys Death.",
            "review_date": "2013-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a waste of time.",
            "review_date": "2013-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful film, fleshed by Denzel Washington's powerful performance, nourished by the expertise hand of Spike Lee, and delivered with a stunning tale of friendship, struggle, and betrayal.",
            "review_date": "2013-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you have the patience to sit through this you'll find it's masterpiece. Denzel is brilliant!",
            "review_date": "2013-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great performance by Denzel Washington, but way too long and sluggish. An educational look at a fascinating man.\n\nGrade: B+",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is live-live and live !",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is tolerable solely due to Denzel Washington's acting and in spite of the first hour.",
            "review_date": "2013-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great biopic with a fantastic performance from Denzel Washington. It got a little to Spike Lee-y towards the end with the children, but the amazing story told in the previous three hours is just phenomenal.",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the better biopics I've seen. In terms of pace and cinematography it reminded me of nothing so much as the Godfather films; evocative of the past through very traditional still camera setups and heavily dependent on dialogue to make the story flow. Plotwise, the film manages to balance the difficult task of demonstrating Malcolm's extremism and his compassion without seeming like there's any contradiction between the two. His basic journey is that of redemption, from a petty criminal in the first act to the influential spokesman of a religious sect in the second to an human rights activist promoting toleration and brotherhood in the final act. In fact, one of the great tragedies of his life is that he died just when he seemed to have found enlightenment but before he had much time to act on it. Malcolm seems to have spent his life improving himself and that provides the film with a curiously uplifting message.",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't like the first bit of this movie, but from the point he gets imprisoned is when it starts to pick up. It was a necessary beginning to show where he came. I just thought it could have been done better.",
            "review_date": "2013-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a nice look at Malcolm X, but it's too long. Denzel was not my favorite choice for Malcolm. He was too much of himself.",
            "review_date": "2013-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a complex epic of contemporary black history. endlessly fascinating",
            "review_date": "2013-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directed by Spike Lee, this was a passion project for both him and producer Marvin Worth, the latter had been trying for over 25 years to do a film based on The Autobiography of Malcolm X. After director Norman Jewison left the project due to script problems, Lee signed up, and it was his most epic film to date, while Lee's films have an angry voice about them, this is a very respectful biopic, and the only angry voice is that of it's title character. Malcolm Little (Denzel Washington) was a small time drug pusher and pimp in Boston in the 1940's known as 'Detroit Red', however Malcolm was sentenced to 8 to 10 years in prison for robbing the home of a rich white couple. In prison, Malcolm reads the bible and becomes a follower of the readings and teachings of black American religious leader Elijah Muhammad (Al Freeman, Jr.), who takes Malcolm under his wing upon his release. Malcolm converts to Islam, and becomes Malcolm X, and he encourages blacks to stand up against the whites, but he soon becomes disillusioned with Elijah's teachings, and opts for a more peaceful activism. It's a very powerful film, and Lee captures the time period well, and Washington gives off a powerful and enigmatic performance. It might be a bit overlong, but it's a really captivating and is a good screen protrayal of one of the great activists of the 20th Century.",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very compelling and tought provoking story with a dazzling performance from Denzel Washington.",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At nearly 3.5 hours long, this is a hell of a thing to sit through but thankfully it's engaging for nearly all of its run time, with Denzel Washington perfectly cast, and may even give you a new opinion of one of the most controversial people in modern American history.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is hard to sum up the life of such an important figure in the length of one movie, even one that lasts nearly three and a half hours. I wish he had spent more time focusing post-enlightened Malcolm rather than street thug Malcolm.",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly as a white dude, I am in a different position to view this flick.  However, as someone who grew up listening to Public Enemy, and watching The Fresh Prince of Bel Air and the Cosby Show, I know of Malcolm X, without KNOWING Malcolm X.  This is a very good movie (not great) made by the one guy who really could/should make it.  Make sure you have 1000 hrs of time on your hands.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Malcolm X' is bloated , its first half is poorly paced, and one might feel its conventional approach fails its exceptional subject, but it remains a terrific film nonetheless, and one worth seeing.",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington sells the film and makes this a masterpiece but..I still don't like Spike Lee",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boosted by an extremely impacting and compelling performance from Denzel Washington, Malcolm X is hard to stomach, but leaves you thinking about the roots and points of racism as told in the teeter-totter story of Malcolm X. But it does so in a way not all can find tasteful.",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful picture of racism in America and what a story of a man. Must see.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compelling!  The transformation from hustler, avid follower of Elijah Mohammed to seeing that all white people are not the enemy was phenominal.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful.. LUV U B BLESSED",
            "review_date": "2012-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Standard film, mediocre, nothing further, worth one watch or two.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only two things that refrain me from giving 5 stars to Malcolm X are the fact that it seems structurally clunky at the beginning and the pacing is all over the place.\n\nThat Beong said, Malcolm X is a conflicting and inspirational biography with true heart given to it by Spike Lee's marvelous direction and a soul given to it by Denzel Washington's flawless performance.\nThe story of Malcolm X is a conflicting one, as you find yourself supporting Black Supremacy while following it. But the fact is Malcolm X is a truly excellent historical figure, and the tale of holm that Spike Lee has directed is practically flawless. The acting, the emotion. The costume, the soundtrack, the terrific cinematic style and the general heart creates a spectacular retelling and educational piece about one of history's greatest heroes. Spike Lee has poured his heart out here for us and the result is the piece of a man's heart that we can all witness and enjoy: Malcolm X.\n\nDenzel Washington is the spitting image of Malcolm X here, through his look and his performance. This is Denzel Washington's greatest performance, as he can smile and get angry with us genuinely believing that he is feeling those emotions in the moment, and why wouldn't we? Eventually, you forget this is a film, and you begin to believe that in some way, Denzel Washington is some kind of reincarnation of Malcolm X, but as we learned from the end of the film, he IS Malcolm X. \n\nMalcolm X is one of the greatest stories ever told, and nobody but Spike Lee can do it so flawlessly and nobody but Denzel Washington could present it so realistically. I am unable to decide whether or not Denzel Washington or Al Pacino deserved the academy award more because they were both so excellent this year. I don't want to have to answer it. I just want to be able to enjoy both their performances. And you know what? I can. Can you?",
            "review_date": "2012-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X is a crucial film that needs the attention it deserves. It is simply divided in two: the first part serving as a complete artistically cinematic treatment on the world created, the psychology and sociology of it, and whatever leads up thematically to the character's revelation. Once part two hits, the film derails and serves another strong purpose to be completely devoted to character-driven studies on thematic elements. Malcolm X must be one of Spike Lee's best.",
            "review_date": "2012-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A SPIKE LEE CLASSIC THAT SHOWS PURE GENIUS !",
            "review_date": "2012-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mostly well done film. Although a talented filmmaker, I have major issues with Spike Lee and the messages his films tend to send. Though good filmmaking, I was made to feel entirely uncomfortable during most of it because of my race, which weirdly enough seems to go against the whole damn point of the civil rights movement.",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I usually get bored with historical biographies...",
            "review_date": "2012-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie and A Great Story! The Book Is Better Though.",
            "review_date": "2012-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's biographical epic about the life of the iconic civil rights leader is a glorious film with an epic scope, a rich message, and a strong performance from Denzel Washington.",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's \"Malcolm X\" does no justice to the impressionable autobiography made by the film's namesake. While Denzel Washington's performance is commendable, this film is far too melodramatic, theatrical, and characteristically cliche to bring meaningful insight to the daunting figure that was El Hajj Malik El Shabazz. This film is more of a peculiar glorification than a dutiful dedication.",
            "review_date": "2012-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To hell with Training Day and Remember the Titans, it's THIS film that will forever be the epitome of Denzel Washington.",
            "review_date": "2012-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is the only movie I have seen with an intermission, damn it is long.  Great movie though true to form and the teachings.",
            "review_date": "2012-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie with powerful true events.",
            "review_date": "2012-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest actors ever playing one of he most charismatic powerful speakers I ever heard. I think that this is Denzel's greatest role and Spike's best movie.",
            "review_date": "2012-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No doubt one of the best films of the decade.",
            "review_date": "2012-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Empathy has been in short supply in our nation recently. Our leaders are quick to congratulate us on our own feelings, slow to ask us to wonder how others feel. But maybe times are changing. Every Lee film is an exercise in empathy. He is not interested in congratulating the black people in his audience, or condemning the white ones. He puts human beings on the screen, and asks his audience to walk a little while in their shoes.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington should have won an Academy Award for this outstanding portrayal. Riveting, moving, awe inspiring acting.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington's performance over shadows his miscasting.The film brings back to life the myths and truths of a very important man in history.Spike Lee took this project and ran with it.It does its autobiography justice.",
            "review_date": "2012-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant display of historical consciousness.",
            "review_date": "2012-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly epic biography which will leave you thinking and in tears",
            "review_date": "2012-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An outrageous biopic on the life and death of legendary Afro-American Muslim Black leader 'Malcolm X.Born Malcolm Little, his father (a minister) was killed by the Ku Klux Klan. He became a gangster, and while in jail discovered the Nation of Islam writings of Elijah Muhammad. He preaches the teachings when let out of jail, but later on goes on a pilgrimage to the city of Mecca, there he converts to the original Islamic religion and becomes a Muslim. He changes his name to El-Hajj Malik Al-Shabazz and stops his anti-white teachings, as he realizes the error of his mistakes. He is later on assassinated and dies a Muslim Martyr\n\n Spike Lee and Denzel washington collaboration is always something special . But this 3.13 hrs long epic is something else entirely . Denzel outdid himself. I can think of the only reason the rating isn't upto that mark, is . well as u know, the conspiracy theory ...",
            "review_date": "2012-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal (and well handled) portrayal of the legendary civil rights leader whose views are often marred by history. Denzel gives a very tortured and human view of Malcolm's struggle with American racism, and the gradual evolution of his political views. The first thirty minutes seem to drag, but after Malcolm's prison encounter, the movie never looks back and remains engrossing to the powerful finale.",
            "review_date": "2012-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No discussion of 'Malcolm X' would be complete without a discussion of Denzel's performance. It's absolutely central to the role, and Denzel gives it his all.",
            "review_date": "2012-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of Denzels best performances",
            "review_date": "2012-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "to bad to have no subtitle version",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredible biopic about the life of a complex civil rights advocate.",
            "review_date": "2012-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My Mom Kelli Krajci Was 36 Years Old In 1992.",
            "review_date": "2012-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington gives one of the greatest performances I have ever seen in this long, but very intriguing and affecting biopic.",
            "review_date": "2012-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington's performance as Malcolm X is without a shadow of a doubt one of the greatest of all time. A must not miss.",
            "review_date": "2012-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whereas Spike Lee explored racism on a small scale in Do The Right Thing, here he explores it on an epic scale.  It's a poignant and well made film.",
            "review_date": "2012-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Very realistic.",
            "review_date": "2012-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all time.  A must see for any film fan.",
            "review_date": "2012-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. Breathtaking performance from Denzel Washington, and the running time is very long, but is right to tell his story in its full extent.",
            "review_date": "2012-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is the end of Malcolm X which, like so many other films, feels hideously out of place when all is said and done.  With Nelson Mandela and Ossie Davis providing the epilogue and eulogy, Malcolm X goes farther than it should in creating the character.  But does that necessarily destroy the movie?  No.  The lack of depth between Malcolm and wife Betty is a disadvantage, as is probing and explaining the wae between Malcolm and the Nation of Islam.  However, it is Denzel Washington, portraying the titular figure from youth to middle age, who shines.  Charismatic and stern at the same time, he is the epicenter of the film.  A lesser actor would have made this a glorified History Channel film.  Astute viewers of other Spike Lee films will notice some of the director's trademarks, especially in a scene near the finale (which also seems rushed, but no bother).",
            "review_date": "2012-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Necessary. Black History. Black Martyr.",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Washington is stunning.",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Flawless. Perfection.",
            "review_date": "2012-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Washington is the balls, really good biopic and the three hours 21 minutes running time flies by. Excellent support performance by Angela Bassett and in particular Deloy Lindo.",
            "review_date": "2012-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unquestionably the most complete biopic I've ever seen.",
            "review_date": "2012-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most thought-provoking, detailed and terrifically considered biopics ever made. Brilliantly shot and performed, and moves briskly for being so long. Intimidatingly great movie, and how refreshing that it actually provokes discussion and thought instead of settling to regurgitate and reenact historical events.",
            "review_date": "2012-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Television waves are broadcast into space and someday they will be picked up by aliens. When those aliens actually watch MALCOLM X, they will know as much about the true Malcolm X they need to know. Denzel's performance here should have earned him the same awards his portrayal of a negative police officer in Training Day did. This is the best performance of his career.",
            "review_date": "2012-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best. Denzel did such a good job that at times i felt like it was Malcolm X playing Himself in this movie. Really long tho.",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now that is how you make a biopic. Spike Lee's monument to one of the most controversial figures in American history is bold, comprehensive, & unflinching.\nLee uses X's autobiography, penned  by Alex Haley, as the source material. While this renders the film an easy target for critics who want a more objective look at this historical figure, I believe Lee, walking in step with the subject of the film, smartly becomes the provocateur.\nMalcolm X was not an easy figure to wrap your head around. With seemingly equal capacity for both love and vitriol, a film that tried to focus on one facet of his personality,  while consequently ignoring the many other ones that made this man so enigmatic, would feel dishonest. Lets face it, this film was bound to rustle some feathers, and I think it was a smart move to let the man speak for himself.\nAnd how could you review the film without mentioning the great Denzel? How he manages to pull off such a complex character with such ease is absolutely stunning. That he lost the Oscar to Pacino is still one of the most egregious crimes the academy has ever committed.\nWhile Lee's career may be wading in troubled water as of now, Malcolm X gives me hope that he will soon rebound.",
            "review_date": "2012-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it is great movie and i learned something new.",
            "review_date": "2012-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of the most entertaining and well done films you will see that is as true to its source historical material as it is.",
            "review_date": "2012-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X: \"We had the best organization a black man's ever had. Niggers ruined it.\"",
            "review_date": "2012-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though I didn't see Malcolm 1-9, I still thought this was a good movie.",
            "review_date": "2012-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the first half has a few moments that almost feel cartoon like in style,  and the ending is a little drawn out but it is over all very good, especially the second half",
            "review_date": "2012-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most powerful opening sequences I have ever seen.",
            "review_date": "2012-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting film. The first 30 minutes are a drag. Denzel's performance is really good.",
            "review_date": "2012-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty good, interesting and fact-filled film. A little too long for my liking. Denzel does a cracking job as per usual!",
            "review_date": "2012-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful bio pic.Washington's best performance ever. Lee's most ambitious film to date.",
            "review_date": "2012-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "denzel washington makes the perfect malcom x, hands down the best choice spike lee could've made.",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my favorite Spike Lee/Denzel Washington movies and it was long, but good and interesting.",
            "review_date": "2012-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first hour could use a good edit, but it's still pretty major.",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We see the side of Malcolm that was sometimes afraid, sometimes questioning..\r\nDenzel?Where is Oscar?",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rewarding experience of a great man who did not deserve to die so quickly.",
            "review_date": "2012-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rather overly sympathetic production. Good Cast. Probably Lil' Spike Lee's best.",
            "review_date": "2012-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An early riveting performance from Denzel Washington.",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel makes you think you were there!",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It certainly has its flaws, and probably wouldn't be any good were it not for Denzel Washington's performance, which is flawless.",
            "review_date": "2012-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington gives one of the greatest performances I have ever seen in this long, but very intriguing and affecting biopic.",
            "review_date": "2012-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wished this film was more well-known to this nation. Now it makes sense after watching this yet another amazing message from Spike Lee's great biopic of Malcolm X.",
            "review_date": "2012-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel is a powerhouse as Malcolm.  An amazing story of one man is brought to life and given the breadth and scope it deserves.",
            "review_date": "2012-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's been a long time since a movie has touch me like one has. Watching this refreshed my memory of Malcolm X's life and legacy. Denzel does a wonderful job portraying him. I was crying all through the end and still weepy the next day and contemplatively asking myself questions for about two weeks now.\n\n*SPOILER ALERT*\nQuestions like-\n\"When will people stop persecuting those striving for peace and harmony.. and what is the motivation for these said persecutions?  I'm curious to know- what is the fear there? Is the ultimate sacrifice for self-less giving, death? Are YOU willing to give up YOUR life for others' who ultimately might not appreciate it? Does that even matter?\" , etc.\n\nOh yea, and the costume design/wardrobe is pretty awesome. That was a nice surprise. :)",
            "review_date": "2012-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long movie...but very good.",
            "review_date": "2012-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X was interesting, but way too long. At a certain point, I just tuned out. Fortunately, Denzel Washington was amazing and his acting along kept me somewhat involved.",
            "review_date": "2012-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "TrÃ¨s intÃ (C)ressant ce portrait de Malcolm X par Spike Lee, bon film! Denzel Washington y est trÃ¨s crÃ (C)dible.",
            "review_date": "2012-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington is stunning as the controversial iconoclast.",
            "review_date": "2012-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've been wanting to see this for years, but have always been turned away by the 3+ hour length. Now that I've finally seen it, I can't recall another 3 hour movie that fully held my attention throughout. This is a masterpiece of a biopic, pure and simple. To think that this was almost made by a white director is absolutely laughable in retrospect. What a labor of love from Spike; the dude had been dreaming of making this film ever since he was a youngster.  How incredible it is when one's dream production is executed this flawlessly.",
            "review_date": "2012-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I find it ironic that Denzel Washington is playing who is possibly the most iconic anti-integration black man in history, and next to Will Smith, he's the whitest black man in film, but hey, that only makes the film deeper and more provocative. Almost three-and-a-half hours, it better be provocative. After this, I better want to get plastic surgery to look black and then actually join the Black Panthers, which seems pretty possible, considering that by the time you finish watching this film, the universe will have already collapsed, reset and progressed to the A.D. 1960s again. I love how I'm griping about this film being so long, and it's only - no joke - the [b]\"eleventh\"[/b] longest film I've ever seen. Holy cow, I need some kind of a life, even if it can't be anything as extravagant as Malcolm X's life. Well, to be fair, Forrest Gump's life wasn't as eventful as Malcolm X's, partially because Gump was just some dumb guy that got caught up in some cool stuff, whereas Malcolm X was black \"and\" muslim, two people that were doing all kinds of crazy stuff between the '40s and '60s, so one can only imagine what you get when you cross them together. I guess you could say that if you crossed a black and a muslim, you would get \"Malcolm Little in the Middle\", and by extension, the inspiration for a pretty good film, which isn't to say that this film doesn't fall into one too many missteps here and there.\r\n\r\nI'm not gonna say that Malcolm X's life is underwhelming, but I'm not quite sure that the \"short\" version should be 200 minutes. Well, sure enough, although most of the film is tight, when it goes loose, it falls out, and you with it, because after a while, watching a bunch of black people dancing at a night club get unengaging enough, let alone when you're actually trying to tell a story so much that it eventually loses steam. Of course, what does more to damage this film isn't the looseness, but the tightness, as well as the style. The overstylized storytelling is at its worst during the flashbacks to Little's childhood, where things feel so devoid of genuineness, due to everything feeling so tacked-on and overwhelmed with histrionic energy, especially when it comes to the unbelievably overbearing score. Still, just because that's where the overstylizing is at its most intense, that doesn't mean that overstylizing doesn't plage much of the film, because there are countless moments of \"Wait what was that?\" or \"Wow, that just came and went\", and sure, it's not like a meditative film, where overstylizing taints the film's very aura and leaves it to limp along, almost entirely devoid of substance, but there are still too many moments theatrics, and it really intensifies the impact of the final blow that keeps this film from being truly impressive: Spike Lee's underwhelming execution. The film is well-produced, runs a mammoth length and is with a story so worth telling it's unreal, and the latter fact is one known too much by Spike Lee, so much so that even with all of the forced theatrics, he only wants to \"tell\" the story of Malcolm X, rather than revive it, which isn't to say that this film is totally vacant of emotion, but it is to say that the story structure is too conventional and safe to the point of being messy, leaving every transition in between arcs in Little's life - from his criminal life, his conversion to Muslim and, of course, his leadership of the Black Panthers - to feel inorganic and somewhat inconsistent, because Lee is so desperate to keep Little's story as faithful as possible that he forgets to truly captivate his audience, leaving the film to run on only so much juice. However, the film is nowhere near bad, for although Spike Lee's dream project is all but ruined by his dreaming just a little too big, it's still a fascinating story of a man's entire mindset changing as he goes from being a following nobody to a leading icon, and while it stands to be executed better, it's still an experience worth having, especially considering that, as I said, it's pretty darn well-produced.\r\n\r\nWhat makes the production designs so impressive is the fact that they are subtle, being elaborate enough for you to really see the time, yet pulled back enough for you to feel the time. There's no overemphasis on the '40s or '50s or '60s, let alone the transitions into all of them, yet they're reconstructed so fashionably, keeping you engaged in the time without it feeling as though it's interrupting the story, only supplementing it. The same can be said about the cinematography, which is subtle and graceful. True, early on, the overemphasis on lighting got to be a bit annoying, but on the whole, the cast of a shadow or a beam of light is played upon subtley, but noticably, and it really supplements the tone on many occasions. I must say that I absolutely dug such scenes as the prison solitary confinement sequence, which is illuminated only by what limited light is salvaged through the feeding doors, and it gives you such a perfect sense of isolation and claustrophbia that strongly reflects and symbolizes the anguish and pain that is falling upon the shoulders of Little, not just in that moment, but many others, which isn't to say that cinematographer Ernest Dickerson is the only one carrying scenes like that, because the real star of this show is, of course, Mr. Denzel Washington. Perhaps they could have done a better casting job for the sake of physcial authenticity, but when it comes to embodying such a layered soul as Mr. Malcolm, few people could do as good of a job as the great Denzel Washington, and sure enough, the atmosphere that Washington emits is powerful, whether he's portraying a hardcore criminal like Detroit Red, a searching soul like El-Hajj Malik El-Shabazz or an influential leader like Malcolm X. Spike Lee's heart may be too much in the story for him to really deliver on it, but Washington is layered and riveting in his portrayal of this follower-turned-leader, and it's that portrayal, all but by itself, that makes this film consistently fascinating, compelling, borderline enthralling and genuinely worth watching, because for every occasion of momentary disconnect, it's hard to not find yourself quickly and frequently pulled back in by the subtlety, grace and transformation in Denzel Washington as he brings the iconic Malcolm X back to life.\r\n\r\nAt the end of the day... or second, or third, or how ever many days it takes you to watch this film, it's hard not to feel a touch thrown-off by moments of overstylizing and looseness, but generally a bit disappointed by Spike Lee's overly conventional, overly safe, periodically inconsistent and ultimately underwhelming storytelling, but what keeps this film an ultimately rewarding one in spite of its flaws is, of course, it's compelling subject matter that is brought to life by subtlety and grace in the production, visual style, but most of all, Denzel Washington, who's layered, transformative and enthralling portrayal of this icon helps perhaps most of all in making \"Malcolm X\" a frequently and genuinely fascinating and enjoyable study on the life and times of the legendary Mr. Malcolm \"El-Hajj Malik El-Shabazz\"/\"Detroit Red\"/\"X\" Little. Jeez, how many names did he have?\r\n\r\n3/5 - Good",
            "review_date": "2012-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "alFatihah to the late Malcolm X",
            "review_date": "2012-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stagnant performance and igniting direction... either way Malcolm X promises a mind bowing experience, deriving right from the purest hearts of maker as well as the real legend who made this Bio epic happen, The last Twenty minutes leave you on the edge of the seat, excited and depressed, profoundly pounding for the protagonist who has gravely been misused yet tussling for the truth",
            "review_date": "2012-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcom X, with the assistance of Alex Haley, produced one of the most gripping memoirs of the 20th century. Adapting it to a film is a tough task, but Spike Lee does an excellent job. Much credit is due to Denzel Washington, who practically disappears into the title role. His fine, nuanced acting makes Malcom X into a human being, which is quite an accomplishment considering the mythic stature that the man has attained in the decades since his assasination.",
            "review_date": "2012-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good. No doubt about it. It would have been interesting to see the career path for Malcolm X if he had in fact survived and continued in a more conciliatory tone. The riots that followed the film were interesting to note as an example of latent issues that continue to exist at that time thirty years after X was killed.",
            "review_date": "2012-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I highly recommend this movie for people interested in American history, or those who are simply fans of biopics. This was a movie that was worth all the hype it received back in 1992.",
            "review_date": "2012-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel is mesmerising.  I haven't seen Scent of a Woman, for which Pacino beat Denzel for best actor in '92, but I feel its fair to say Denzel deserved an Oscar.  Whilst the story is slightly drawn out, it is a small thing in comparison to the epic life of a man like Malcolm X.\n\nWhilst not agreeing with everything he stood for, I can definitely appreciate him for the pride he brought to the black community, to stand tall with honour.  In Howard Zinn's 'A People's History' he makes the similar point about the dictionary definitions of black and white in the year 1500.  Spike talks about it in the 1950s.\n\nToday, the definition of white at dictionary.com reads, \"of the colour of pure snow.\"  Black reads as, \"Gloomy\" and \"Wicked\".  There is still a long way to go in overcoming deep seeded sterotypes within us all.",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie had me intrigued from the middle to the end. Denzel did a good job portraying Malcolm.",
            "review_date": "2012-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed watching this movie seeing how Malcolm X changed throughout his life and the challenges he faced.",
            "review_date": "2011-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorite movies. Must have for the home collection.",
            "review_date": "2011-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant film that humanizes a man that polarized many and to this day is viewed more for his radicalism than his message and his personal beliefs. Spike Lee has truly created a masterpiece with brilliant performances, and I don't know another actor who could have done with this role what Denzel Washington did with it.",
            "review_date": "2011-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an amazing \"joint\". Denzel was known before this movie but I think this made him a A-List actor.",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great documentary...  denzel washington was definitely the best actor for this film...  majority of the 3 1/2 hours was interesting, but it was just a little too long",
            "review_date": "2011-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A firm life story that has so much significance placed into each life event that 3 hrs race by. Denzel's best.",
            "review_date": "2011-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not light viewing by any stretch of the imagination, but it is an extremely well-made and (for the most part) impressively neutral take on a fascinating and often confusing man. I haven't seen the movie this lost to, but Pacino must have been dang good to have beaten Denzel Washington for Best Actor. Washington, who is already one of my favorite actors and screen presences, delivers a captivating performance that manages to hold my interest for almost three and a half hours. To put that in perspective, the first Lord of the Rings movie, which is twenty minutes shorter, is a film that I can't make it all the way through, and it has a large ensemble of talented actors who perform perfectly well. The supporting performances are also quite good, especially Angela Bassett, who gives a criminally underrated and downright heartbreaking performance as Malcom X's long-suffering wife.\n\nThe film is not without it's flaws, and the last 20 minutes have a moment or two that have not aged as well as the rest of the piece, but it is a very impressive work overall and highly recommended viewing, particularly for those who have an interest in this era of history",
            "review_date": "2011-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A near perfect drama of such an influential person who is not (in my opinion) given the full attention he deserves in recent American history.",
            "review_date": "2011-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long, balanced, powerful.",
            "review_date": "2011-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "whoa, made it through 3 hour plus of this dry as dust biopic. yes, a very informative history lesson no doubt but it sure hell bombed big time as a film that engaged or entertained.",
            "review_date": "2011-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible movie. Malcolm X has always been a guy I looked up to.  Although I don't agree with some of the things he preached, I understand that his family endured horrible racism and prejudice by white America which would have most likely caused me to have the same ideology that he attained.  Denzel does his thing, like usual.",
            "review_date": "2011-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An ultra, gritty and complex picture at the life of an important figure in history, only made more effective by Denzel Washingtons lived in performance.",
            "review_date": "2011-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great biopics, featuring one of the great film performances. There's a sense Malcolm's life overwhelmed Spike a bit (as it would overwhelm almost any filmmaker), and some heavy-handedness weighs it down. As it stands, it's still one of the most powerful films of the nineties, a sweeping, richly photographed, and thoughtful exploration of one of America's most fascinating and influential modern figures.",
            "review_date": "2011-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best films to date from Spike Lee and one of Denzel Washington's best performances to date. And this is also one of the most snubbed films in the history of the Oscars, Washington's portrayal of Malcolm Little is far more prolific and memorable than Al Pacino's performance in Scent of A Woman. Granted I love Pacino, but Washington was the far superior. Along with him, director Spike Lee was not even recognized for this epic biopic. Great setting, period dressing, cinematography, music compilation and original score, the overall cast and acting, this is a film that is in the forefront of all filmmaking, and should be noticed as such.",
            "review_date": "2011-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DAMN YOU WHITEY...I mean this movie was amazing.",
            "review_date": "2011-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story gets worse until it ends, it was bland, just like landing with no strikes.",
            "review_date": "2011-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Malcolm X\" is a very comprehensive account of the events and ideals that defined his life.  It is also  a very sad reminder of how much hatred there is in the world.  The film does not hold anything back, showing Malcolm's criminal life, conversion, stand against racism in the country, and assassination by his own race.  Its 3+ hour runtime makes it a bit daunting but is worth it if you do not know a lot about Malcolm X.  Coming into the film with a mere surface knowledge of his life, I was very surprised by Malcolm becoming a minister for the Nation of Islam and later being persecuted by them.  Denzel Washington is fantastic in the title role and was rewarded with an Oscar nomination, though his performance couldn't compare to Pacino in \"Scent of a Woman.\"  The most impressive thing about Washington's performance is the diveristy in characterization from criminal to convert to charismatic speaker.  The other actors are just pawns in the storytelling, since the script focuses so heavily on the main character.  The only other actor that stood out is Delroy Lindo, who radiates cool in any role.  \"Malcolm X\"s greatest asset and biggest downfall is its runtime, as every moment of the film is important and worthwhile but the length makes it impractical to watch unless you watch it in two parts; however, if you ever have 3 1/2 hours on your hands, this is worth your time.",
            "review_date": "2011-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee directing a film about Malcolm X with Denzel Washington starring - not surprising. It's really slow to start off, often including 'too much,' but it gets better. Well, it gets better aside from the lame and almost laughable ending. Kids shouting 'I am Malcolm X'? Nelson Mandela? Seriously Spike?",
            "review_date": "2011-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Because we should always remember",
            "review_date": "2011-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. Denzel deserved the academy award but was very unlucky. His portrayal was genuine. I couldn't tell if I was watching Denzel or Malcolm X himself. About the great man himself, He is one of the great Muslim Martyrs for me. A true hero not only for Americans but for every Muslim. (Of course after he left NOI and became a proper Muslim)",
            "review_date": "2011-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's masterpiece hands down...He hasn't come close to approaching this artistic peak.  Denzel Washington exudes a forceful charisma in the title role, and should've won the Best Actor Oscar.  Lee wisely relegates his preachy moments for the latter portion of the picture.  A bristling biopic of a still controversial figure.",
            "review_date": "2011-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Say what you will about Spike Lee but when he's on he's on.",
            "review_date": "2011-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before reviewing this film, I'll say this about Spike Lee, he is one of the most painful directors that I have ever seen in the cinematic medium. On the very rare occasion, he can turn out a good film. However Spike Lee has one trick up his sleeve and it's the race card, he uses for everyone of his films to the point that you can't even take the guy seriously. With the case of Malcolm X, he is suited for the job, but really, I think maybe Denzel Washington should have directed this as well as starred in it. What truly makes this film worth watching is Denzel Washington's performance as Malcolm X. He truly delivered something incredible on screen. However I also thought that the film felt too preachy and it started to sound like a Spike Lee rant after a while. As a person who's read Alex Haley's The Autobiography Of Malcolm X, I have to say that I much preferred the book to the film. I thought there was a lot more detail, and more interesting facts that Spike seem to leave out or twist to make his own point in telling Malcolm X's story. Personally I preferred the book over the film and though I thought Denzel Washington was great, I can't shake the feeling that this is just Spike Lee playing the race card to his own advantage in telling this historical story.",
            "review_date": "2011-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's long, but I thought this was an excellent film. Spike Lee does a great job directing, and Denzel Washington is amazing as Malcolm.",
            "review_date": "2011-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the film is good...really very good....but to me it gets off to a bad start.... jumping around and to me not really working...we nearly switched the thing off....but had we done that we'd not have experienced this great movie.",
            "review_date": "2011-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I haven't actually read Malcolm X's autobiography, I will say that, from what I've gathered through time that this is a fairly accurate portrayal. I loved this one. And the acting was absolutely phenomenal.",
            "review_date": "2011-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very inspiring.. Was shocked to see that Denzel Washington didn't win the Academy Award for his role in this film!",
            "review_date": "2011-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel should have gotten an Oscar for this role, I wasn't that impressed with Training Day",
            "review_date": "2011-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Real shame because the autobiography is incredible. Read the book and you will not regret it, the film just doesn't do justice. Sorry Denzel I'm a fan of yours but this was a role that had to be given to a big personality. One of Denzel's worst because he was required to step out his comfort zone as an actor.",
            "review_date": "2011-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way too long.  Classic example of why the screenwriter should not direct.",
            "review_date": "2011-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "spike lee out does himself with this film adaptation of malcolm's life. too bad it wasn't well received in mainstream hollywood, but that's their loss.",
            "review_date": "2011-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful, full-fledged look at racism.\n\nFull review at themoviefreakblog.com on 11/29",
            "review_date": "2011-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In Spike Lee's epic tale of legendary civil rights leader Malcolm X, he successfully creates one of the most provocative, disturbing, but enlightening biographical dramas I've ever gotten the chance to watch. A film that is not only a way for African-Americans everywhere to rightfully embrace their heritage, but a film that gives people of all creeds, races, and ethnicities a chance to realize that we can live in perpetual harmony with one another. The movie is anchored by arguably one of the most moving, dynamic, and emotional biographical performances thus far - Denzel Washington's Malcolm X. Washington gives such a diverse and vivid portrayal of the man. From his troubling days as a misunderstood youth, to his successful moments as a rising voice within the Nation of Islam, to his final days as an enlightened, reformed human being, Washington depicts every moment to a sharp and polished degree. Every technical aspect of the movie is executed to a near perfect degree. Whether it's the camerawork, the lighting, the sets, or the score, Spike Lee successfully manages to use every one of the aforementioned factors to add to the film's thick mood. \"Malcolm X\" is a drama that is long, yes, but it is necessary for everyone to see. For the rise and fall of this young man is not only complex and tragic, but it's unbelievably inspiring.",
            "review_date": "2011-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee said to Norman Jewison that the film needs to be made by a black man. I can see why he said it. Powerful in every possible way I can think of.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful Movie, Powerfully acted by the always Flawless Denzel who can really pick em.We all think we know the Story, but this goes a little deeper",
            "review_date": "2011-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely one of the movies",
            "review_date": "2011-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great film. Malcolm X is easily one of my favorite Americans of all time.",
            "review_date": "2011-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is pretty ambitious to chronicle a social icon's life into one single movie, but this one definitely did the job, wonderfully.",
            "review_date": "2011-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is the end of Malcolm X which, like so many other films, feels hideously out of place when all is said and done.  With Nelson Mandela and Ossie Davis providing the epilogue and eulogy, Malcolm X goes farther than it should in creating the character.  But does that necessarily destroy the movie?  No.  The lack of depth between Malcolm and wife Betty is a disadvantage, as is probing and explaining the wae between Malcolm and the Nation of Islam.  However, it is Denzel Washington, portraying the titular figure from youth to middle age, who shines.  Charismatic and stern at the same time, he is the epicenter of the film.  A lesser actor would have made this a glorified History Channel film.  Astute viewers of other Spike Lee films will notice some of the director's trademarks, especially in a scene near the finale (which also seems rushed, but no bother).",
            "review_date": "2011-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunning, remarkable performance by Denzel ,, strangely he didn't win the Oscar that year !! I should watch \"Philadelphia \" and see why ,,\nthe best parts is when he went to hajj and the ending ,,\nthe only thing I didn't like about the movie ,, it was a bit long ,, but I guess Lee wanted to put everything into it ,,",
            "review_date": "2011-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel is Malcolm X the movie is pure theater.every actor is in tune to the essence of the time and characters they portray.Gandhi and Malcolm are the best portrayed biopics ever.Spike lee had to direct this film,his angles and emotion captured on screen are epic.must see movie!!!",
            "review_date": "2011-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film should have been nominated and win almost every oscar possible the year it was made.Best actor,best director and best film at least. That's hollywood for you.",
            "review_date": "2011-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A richly layered biopic of Malcolm X and a powerful performance by Denzel Washington.",
            "review_date": "2011-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee, I can fairly say, is the director most attuned to black culture, or at the very least he's the most famous of the lot. Malcolm X is very, very black. And it is a great movie. It rarely goes awry, and is a pleasure to watch for its technique and uncomfortable to watch for its material and method of confronting said material. A noteworthy film, and a must see for black history in film.",
            "review_date": "2011-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. Pretentious filmmaking at it's finest. A slow, absurd, and pointless take on a very interesting part of history.",
            "review_date": "2011-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most powerful film I've seen in a while.  Washington's acting is inspired and gripping.  I don't agree with the every detail of the solutions that he advocates in this film, as told by this film; but you can definitely sympathize with him for holding those views, and how it is that he arrived at them.  The film seems to be an honest retelling of history.  A story well made and well told.",
            "review_date": "2011-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many misunderstand the life of this great leader! Malcolm X was a product of his time, a time of great violence and racism, but towards the end if his young life he realized the importance of global brotherhood and pursued non-violence to change the many problems facing his people and our country.",
            "review_date": "2011-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty good movie if your in the mood, have to realize how unique Denzel is in this",
            "review_date": "2011-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Spike Lee's best films.  It is long and perhaps spends a little too much time on Malcolm's early years but the ending is very powerful and Denzel's performance is terrific.",
            "review_date": "2011-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington and Spike Lee's best collaboration ever and their best work ever in this best fact-based movie ever!",
            "review_date": "2011-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington and Spike Lee's best collaboration ever and their best work ever in this best fact-based movie ever!",
            "review_date": "2011-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Film of the 1990s (1990-1999)\n\nSpike Lee's Malcolm X",
            "review_date": "2011-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didnt know Ashanti was in this???",
            "review_date": "2011-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee just laid it on too thick; Malcolm was obnoxiously long.",
            "review_date": "2011-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent representation.  I couldn't imagine it being any better, even with the nearly 3 1/2 hour running time.",
            "review_date": "2011-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't rent it, buy this movie! No words can really do this film justice.",
            "review_date": "2011-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch it! 'nough said",
            "review_date": "2011-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It doesn't have the impact it had on me when I was a kid, but it still works.  The second half is directed with a little more patience and care than the first half, it feels like.  The first half feels flimsy at times, staged almost.  \r\n\r\nBut Denzel keeps it afloat in what is far and away his best acting job.  It's a little long, sure, and some of the dance scenes are a bit ridiculous, and there's often too much music overlay.  Overall though I can't complain.  I really appreciate how the second half unfolds, and how Denzel is able to transform his character so smoothly from punk to professor.",
            "review_date": "2011-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant film, and the one that introduced me to who I now know as the the legendary Denzel.\r\nIn Malcolm X, Denzel really proves how much an adaptable actor that he really is. The story was really well told, however I don't think the film needed to be 3 and a half hours long... Could have shortened a couple of bits for sure. But still a brilliant film that will capture you right from the first scene!",
            "review_date": "2011-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One Of The Top 10 Best Films Of The 1990's! A Masterpiece! A-",
            "review_date": "2011-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow this one is real great, why is it rated x",
            "review_date": "2011-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best films to date from Spike Lee and one of Denzel Washington's best performances to date. And this is also one of the most snubbed films in  the history of the Oscars, Washington's portrayal of Malcolm Little is far more prolific and memorable than Al Pacino's performance in Scent of A Woman. Granted I love Pacino, but Washington was the far superior. Along with him, director Spike Lee was not even recognized for this epic biopic. Great setting, period dressing, cinematography, music compilation and original score, the overall cast and acting, this is a film that is in the forefront of all filmmaking, and should be noticed as such.",
            "review_date": "2011-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the movie and the acting but the inaccuracies are frustrating that Spike Lee would have to accept money to complete the movie on the condition that certain things were changed in accordance to reality.  Well good acting anyway...",
            "review_date": "2011-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know a film is good when you can sit through 3 and a half hours without looking at your watch. Malcolm X is a fascinating portrait of a man who doesn't get the credit he deserves as part of the American civil rights movement. The best thing about this film is it doesn't gloss over the nasty bits of Malcolm X's life or try to raise him to sainthood. He's a man who has a strong belief and set of principles which grow and progress as he does. It's not just a story about Malcolm X, but an entire contingent of black American's of the 60's who were trying to find their place any way they could. \n\nDenzel Washington gives one of his best performances of his career, lead with a steady hand by Spike Lee and supported by a whole host of fantastic performances. Malcolm X has a great natural, documentary feel and makes great use of inter-cutting historical footage, with fictional news footage and the narrative of the film.\n\nThis film brings to light one of the great travesties of Hollywood: the fact that Spike Lee couldn't get them to finance this film is ridiculous. When presented with a script, cast and a director of this calibre you give them the money, and when a filmmaker has this much passion for his project you give him the support as well. There needs to be more support for black filmmakers to produce films about their stories and concerns because they're relevant to everyone and it can only benefit our culture.",
            "review_date": "2011-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Spike Lee's best, with Denzel's best performance ever. A modern classic in league with JFK and Nixon.",
            "review_date": "2011-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched for MLK day...OK movie",
            "review_date": "2011-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Im on the edge on this one, but I  had one issue with this movie, why so many balck people. Its just not needed, why cant tom hanks play malcolm x, also it has it has a unclear message when make it so that when he's assassinated it a bad thing. There aregood parts but overall, a unclear message.",
            "review_date": "2011-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's epic bio-pic is not quite a masterpiece.  There is some exceptional filmmaking and brilliant acting on display, but the film also gets bogged down in a few unnecessary sequences that are amazing recreations of history, but ultimately not needed to move the film along.  Like many Spike Lee films, the musical score seems out of place at times and becomes a distraction as well.  But all that aside, it is a great film.",
            "review_date": "2011-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a solid and comprehensive, but a bit longish at times. And while it's moving to watch what had influenced the great Malcolm X, who he became and so on... after all, it's Spike Lee who directed the movie and you just cannot expect from him full objectivity - especially given the subject.",
            "review_date": "2011-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its a pretty good documentary on malcolm x",
            "review_date": "2011-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "directed by spike lee(do the right thing)",
            "review_date": "2011-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel's Oscar-nominated performance is such an excellent depiction that some viewers may not notice when the film switches to archival footage of the real Malcolm. This supremely crafted movie goes beyond mere biography to explain the emotions behind a movement. Like him or not, Malcolm X is a pivotal figure in the history of America and this movie, while not strictly 'entertaining', does a fine job of transporting you to a different time and place. 4/21/9",
            "review_date": "2011-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch it for one of Denzel Washington's best performance to date as the militant Black leader who converted to Islam, and his violent end. An excellent biopic that stands along with others in the genre like Lawrence of Arabia and Patton.",
            "review_date": "2010-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performance from Washington.",
            "review_date": "2010-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've been a big fan of Denzel since I watched this film.",
            "review_date": "2010-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington's best performance in years. This movie educated me about one of the most remarkable men in American history, Malcolm X, and God, what a man he was! Will think about it for a few weeks now... Since I saw the movie, I was so fascinated that I immediately saw all the real life speeches and interviews by the late Mr. X! Spike Lee directed so well, and depicts history so realistically, that it puts you right into the spot, period and the life of Mr. X. The scene in Mecca, for example, is the real deal, there are no fake locations, all those people praying, and Denzel Washington with them :) (there's a beautiful scene where Malcolm prays completely in Arabic language, which shows how dedicated both the director, crew and Denzel were). Malcolm's best speeches are shown as they really happened, Lee really did his research :) The assassination scene broke my heart, made me cry, and made me feel rage for the loss of such a genius..I don't know what else to say, one of the best biopics ever...Go see it!",
            "review_date": "2010-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting. A poignant film that tells an important and somewhat unfortunate true story. Not a huge fan of Spike Lee's movie making, but his acting was good. Denzel should have gotten an Oscar for this role.",
            "review_date": "2010-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite a tragic life this guy had. I disagree with his theology quite a bit, but this is a really good take on that life. Denzel Washington was perfect as the title role, while the rest of the cast was solid.",
            "review_date": "2010-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Those who die, are justified, for wearing the badge they are the chosen whites.\"",
            "review_date": "2010-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most probably one of the best bio pics ever.",
            "review_date": "2010-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel washington got the role of a lifetime when Spike Lee cast him to star in the biographical film about Malcolm X, one of the most extreme, influencial and controvercial civil rights activists. The result is an informative and insightful look into the crucial years of racial liberation in America. Lee uses cinematography and music to give the film a clear artistic direction; many scenes are extremely powerful with a sence of sharpened reality. The film has a slight âhero worshipâ\u009d -angle to it, but it's not too apparent and doesn't go too far. There are different sides presented and the story doesn't feel simplified. The Malcolm X of this movie is a deep character inhabited by contradiction, not a shallow icon.",
            "review_date": "2010-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Washington's greatest performance. But good Jesus it could do with a good edit",
            "review_date": "2010-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington pulled off a great Malcolm X under Spike Lee's acclaimed directing. All around this movie did what it set out to do, tell the story (or at least a large part of it) of Malcolm X, pointing out key events, conflicts and figures he encountered in his life leading up to his assassination. Although I'm a fan of the great activist, I felt that this movie lacked alot of dramatic intensity. It felt almost too simple, it needed some sprucing up with some good audio mixing here and there. It had it's facts set straight, which is great, but it failed to bring real entertainment to the plate. The dialogue felt really plain and it just wasn't as gripping as it could have )and should have) been.",
            "review_date": "2010-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Generally speaking, one of the better biopics I've ever seen, and I've seen more than a fair handful.  It appears most people don't have so much of an inclusive understanding of what drove and inspired Malclom X, but Lee's direction is quite in-depth and worth every minute -- does  not -- even remotely! -- feel like something lasting three-plus hours.  There is rather  an intense, striking paradox between X's beginnings and one of his later episodes.  While the ending is rather rushed and thus abrupt, the overall effect of this tale is truly not only enlightening, but also intoxicating.",
            "review_date": "2010-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nearly 3.5 hours and it didn't seem like it. However, it jumped around quite a bit, and I found it hard to follow at times. Still, it was very interesting and informative.",
            "review_date": "2010-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's rise as a film maker, Denzel Washington's rise as one of the elite dependable actors till date, this is his best work.Lee and company have performed a powerful service: they have brought Malcolm X very much to life again, both as man and myth.",
            "review_date": "2010-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8/10: Another top-notch performance from Denzel who deserve an Oscar for Best Actor on his role. The scene alone where he recite the first Sura of Qurâ(TM)an in the Egyptian Mosque is already well worth your time.",
            "review_date": "2010-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very, very strong and powerful performance by Denzel Washington. I didn't know too much about Malcolm X, but after watching this I did some research and found the movie to be pretty historically accurate. It is a great story about a very interesting man that definitely made a mark on history",
            "review_date": "2010-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee & Denzel make a deadly duo! The greatest biopic of all time.",
            "review_date": "2010-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tell me again how Denzel missed out on the Oscar to Al Pacino for Scent of a fucking Woman of all things?",
            "review_date": "2010-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an extremely well made movie. The acting, and the directing were phenominal. This movie tells the story of public rights activist Malcolm X. Denzel Washington really shines with one of his best perfomances. I do know that the whole story is not all entirely 100% accurate, but the movie does get the point across it inspires you to definitely think about yourself, and others. Just see it.",
            "review_date": "2010-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington is stunning as the controversial iconoclast.",
            "review_date": "2010-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great tale about growing up to be a legend.",
            "review_date": "2010-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good all the way up to the part when he started preaching, then it was all down hill from there.  I'm not sure if all that stuff was true or not, but I'm guessing that it was all true.  Denzel Washington does a good job of portraying Malcolm X.",
            "review_date": "2010-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have heard detractors of this film who have called it \"black racist propaganda\". Who have called it \"a concoction of lies and half-truths\". Who have called it \"shoddy filmmaking\". Who have called it \"lacking in impartiality at best, and dangerous to people's perception of race relations at worst\". \r\n\r\nI'm sure the real Malcolm X might have deemed such reviews compliments. \r\n\r\nThis is a story about a man who was raised in a more racist society than we as a modern society can even imagine: The lynchings (or attempted lynchings), the violence, the rapes, the dehumanizing words, piss-poor education, job discrimination, inability to vote, negative stereotyping in media, etc., etc., etc. This is a story about a man whose house was burned down by the Klan, and whose father was murdered by the Klan (I know it's implied, but under the circumstances, I don't doubt that's what actually happened for one second). This is a story about a man whose mother had several children to take care of with very little life insurance to help her because the agency deemed her husband's death a suicide in spite of the evidence to the contrary, and had every last child taken from her and placed in even worse conditions in a foster care system that did not care one bit for them while she herself was locked up in a mental institute for 26 years. This is a story about a man whose grades were stellar but who was forced to work onboard a train as a servant, as a criminal on the side, and was told he should find work as a carpenter rather than a lawyer because that was \"no realistic career goal for a n****r.\" This is a story about a man who walked on eggshells daily while in a relationship with a white woman for fear of her calling it rape and resulting in him being sent to jail or worse. This is a story about a man who didn't even consider himself a man, let alone be considered one by society. \r\n\r\nIn my response to the detractors' reasons for detracting this film, OF COURSE it's going to be biased! It's Malcolm X's story. \r\n\r\nIt's his point of view, and that point of view was always changing. He went from a bright-eyed pupil to a hedonistic and possibly nihilistic criminal. He went from an apathetic prisoner to a spiritually awakened convert and one firebrand of a spokesman. He went from blind follower of Elijah Muhammed to a more secularly open political activist. \r\n\r\nIt may be biased, but at least it's honest about its bias, as Malcolm X was. He called the white man a devil more times than I can count, yes, but I doubt he embellished or made up atrocities committed by white people. He didn't cast himself as a saint either, even towards the end of his life. \r\n\r\nFrom the get-go, this was a powerful in-your-face film, made so by an electrifying delivery of \"The Trial\" by Denzel Washington during the opening credits, where he charges the white race for its many crimes, intercut with clips from George Holliday's footage of Rodney King being beaten by police. It's harsh, uncompromising, and bold. \r\n\r\nEvery actor and actress brought their A-game, even Spike Lee and Peter Boyle in their small cameos and especially Angela Bassett as Betty X, a strong portrayal of a black woman in both a racist society and as a member of a fairly sexist organization. The story moved along quite smoothly in detailing this man's evolution and triumph not only over an oppressive society but his own oppressed and oppressive state of mind. Emancipating himself from mental slavery, as Bob Marley would put it.",
            "review_date": "2010-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic biopic by Spike Lee and starring Denzel Washington, the screenplay is great and for 3 hours and 22 minutes, I wasn't bored not even once.",
            "review_date": "2010-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant bio-pic.  It takes a warts and all look at one of Americas most influential black leaders at a time of blatant racism.  The opening brings everything after into a sharp focus.",
            "review_date": "2010-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By the end of this film, Denzel is the spitting image of Malcolm X.",
            "review_date": "2010-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good film, but just a little long at times !",
            "review_date": "2010-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't give a damn if the movie is three hours long. It's the best biographical film ever. It's serious, full of feelings and it let's you know that Denzel Washington is the best actor ever.",
            "review_date": "2010-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest biopics of all-time. Denzel Washington was robbed (in losing the Academy Award for Best Actor).",
            "review_date": "2010-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good biopic. Denzel is excellent and versatile as always.",
            "review_date": "2010-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, Very long, but still really good. Denzel Washington's best role of his entire career. Spike Lee does a great job directing. It is very underrated. And really good. 9.3",
            "review_date": "2010-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An enlightening look at a story that isn't taught in schools these days. Malcolm's life story lends it's self very well to the movie format and whatever didn't was pieced in expertly by Spike Lee. Denzel can REALLY act here is a fine example right in front of you.  A really amazing film that everyone should see.",
            "review_date": "2010-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it went for more than 3 hours, this bio doesn't felt lenghty, supported by brilliant performance by its cast.... One of Spike Lee's masterpiece",
            "review_date": "2010-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent film with great performances all around. The only problem is that it is way too long.",
            "review_date": "2010-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bold and remarkable. Denzel should have won for this. \nUnlike modern biopics, this film truly reveals every stretch and detail of a man's transformation. Instead of a caricature, this film embodies and enlightens us on the meaning of Malcolm X.",
            "review_date": "2010-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Denzel classic to say the least !! A good job directing from Spike Lee , this movie had to be one of the best biography type movies ever .",
            "review_date": "2010-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the film, Malcolm X, Spike Lee has taken a tough subject and, with his quirky talent, has done it superb justice. Denzel Washington not only gives the best performance of his career but probably one of the best performances of all time. A must watch, no matter your race or religious preference. A well done biopic all around. Take three and a half hours and watch it! Rating: 8/10",
            "review_date": "2010-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lead by a charismatic and strong performance from Denzel Washington and well focused direction by Spike Lee, \"Malcolm X\" captures the film adaption based on the autobiography written by Alex Hayley the best possible way  and ends up as one of the top films of the 90's.",
            "review_date": "2010-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X, Great Movies\nSpike Lee struggled mightily to get 'Malcolm X' made, financially and artistically. But when all was said and done, he produced an epic blockbuster and a definite treatment of the man's life. There's great differences between the two as well, but to me Lee has many things in common with Oliver Stone. Both of them seem to have been born to make films. Both of them are uncompromising in bringing their artistic (and moral) vision to the screen, and neither will try to seduce the public by catering to their tastes. Both present their own interpretation of facts without apology. (For example, from what I've read it's not certain that Malcolm's father was actually killed by Klansmen. But Lee isn't in the same league as Stone when it comes to playing fast and loose with the \"truth.\") Stone even ends his movie 'Nixon' in a similar way to 'Malcolm X,' with footage of real-life figures blended in, though I'm not accusing Stone of imitation. This movie has an epic sweep and scope and as a director Lee is up to the challenge. He is served well by being able to direct in several styles, one of which is almost cartoonish: witness the scene where Malcolm (Denzel Washington) and Shorty (played by Lee himself) go stepping out at the Roseland Ballroom, resplendent in their zoot suits. Some comic relief is welcome at times because otherwise the serious, heavy message of the picture might be overwhelming. For instance, the movie opens with a full-screen shot of an American flag while we hear a voice-over of one of Malcolm's most rousing, or inflammatory speeches, depending on how you look at it (\"I accuse the white man of being the greatest murderer on the planet!\") The flag begins to burn and eventually forms a flaming 'X' as the fiery rhetoric continues. But if you haven't been scared away, the next scene shows the young man Malcolm Little in a funny situation, having his hair straightened by a concoction that threatens to burn off his scalp. Denzel Washington has won beaucoups of rightly-deserved accolades for his amazing performance in the title role. If you've ever heard or seen Malcolm X's speaking, you will be astounded at the similarities in tone and cadence. The illusion is so real one may not recognize that real archival footage of Malcolm is used late in the film. But this is not a case of style over substance here. Between Washington's talent and Lee's directing and screenwriting, an unforgettable character emerges. The film boasts other fine performances by Al Freeman, Jr. (especially good as Elijah Muhammad, a controversial figure in society, and eventually to Malcolm himself), Delroy Lindo, Albert Hall, Kate Vernon, Ernest Thomas and many others in its large cast. It's clear that Lee doesn't care for the Motion Picture Academy and they don't particularly care for him. But the snubbing he and his picture got at Oscar time would be comparable to Richard Attenborough and 'Ghandi' not being nominated the year that film was made. Ordinarily, one would think this film is the kind of production Hollywood loves to honor. But Academy Award nominations or not, the film 'Malcolm X' is like the man himself: impossible to ignore.",
            "review_date": "2010-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only is one of the best biopics that Ive seen, this is one of the best movies that Ive seen. This is an important movie that talks about one of the most disgraceful times in American history. I think the only person who could have directed this movie was Spike Lee and he did a marvelous job. \r\n\r\nI got nervous in the first 40 minutes because the story started out sloppy and unclear as Lee was going back and forth between Malcolm's life as a child and a young man but finally the story steadies out and the viewer feels as if they are in Malcolm's mind. Although the movie is 3 hours and 20 minutes, it goes by really quickly and is very entertaining. Denzel Washington takes command of his powerful leading role and he becomes Malcolm X. Its a difficult role because Malcolm took on 3 different personalities during his life, each one becoming more mature and Washington nails it. Some other Oscar worthy performances were by two of Malcolm's key role models: Albert Hall as Baines and Al Freeman Jr. as Elijah Muhammad. \r\n\r\nOne minor weakness was the relationship between Malcolm and his wife since they seemingly go on one date where they barely know one another and then a few scenes later he proposes to her. Their early relationship went by quickly and I think they should have developed it more, but it was just a minor problem. The best thing Spike Lee did in the movie was show who the real Malcolm X was. People believe he supported violence and segregation but those misconceptions are proven incorrect in the movie. \r\n\r\nThis is a truly inspirational movie that can be appreciated by people of all races. Malcolm X is an important movie that I strongly recommend.",
            "review_date": "2010-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well executed interpretation of Malcolm X's autobiography.",
            "review_date": "2010-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One  of the best Spike Lee joints.",
            "review_date": "2010-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "denzel makes this. i could listen to him recite speeches all day. makes you really feel something for this man who was so close to being a great figure in the wider world.",
            "review_date": "2010-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting was great and, of course, the plot was intriguing, but Spike Lee did some cheesy directing in certain parts.  I'd estimate a good forty minutes could have been edited out without sacrificing any storyline.  Regardless, I still find it reccommendable, even 18 years after production...",
            "review_date": "2010-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee did well by me with this version. Seemed to keep with the historical purpose as well",
            "review_date": "2010-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lee earns huge points for attempting a wide framing of Malcolm X's life, but could've been less infatuated with Washington's face and swingin' suit in some scenes. Pull the camera out and trim some minutes -- there's gold here!",
            "review_date": "2010-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "outstanding brilliant on all levels",
            "review_date": "2010-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very interesting movie.  Not only because of the subject matter, but also the cinematic style of Spike Lee.  Denzel Washington is absolutely incredible.",
            "review_date": "2010-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brilliant with an otherworldly performance by denzel. a must-see & a must-own.",
            "review_date": "2010-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't aware of such a movie before. Taking about Islam in fair way and shows how perfect it is. Yet any error or miss-understanding is from people acts and their miss knowledge. Black, white, Arab, English, East or west we are humans. Denzel Washington, you are star. Thank you Spike Lee to present a brilliant and unforgettable movie.",
            "review_date": "2010-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the great stories of transformation. It vibrates with Lee's amazing attention to detail and his exuberant free-flowing love of cinema comes sprawling out from the screen.",
            "review_date": "2010-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Biographical epic on the life of black rights and nationalist leader Malcolm X, as directed by Spike Lee, is equally stirring and conventional. At more than three hours, Lee chronicles forty years in the life of Malcolm X, from his life as a young hustler in Harlem, eventually landing him in prison, to his spiritual transformation into a leading spokesperson for the Nation of Islam. The early scenes have a lively jazz tone as Lee shows us Malcolm's aimless youth then shifts into a somber, serious tone in detailing Malcolm's emergence as an activist. Denzel Washington gives a commanding, beautifully expressive performance as Malcolm X. He captures the charisma and forcefulness of Malcolm's oratory skills but is just as effective in the quieter scenes. Al Freeman Jr. is uncanny in his physical and vocal impression of Elijah Muhammad. Gorgeously lit by the gifted cinematographer Ernest Dickerson. Some flaws: Lee glosses over Malcolm's pilgrimage to Mecca and spiritual awakening which was such a transformative experience in his life. Malcolm's fractious relationship with the Nation of Islam has been minimized. The importance of wife Betty Shabbaz (well played by Angela Bassett) is diminished. The white characters are at times cartoonish villains. The prologue and epilogue expose Lee's expected indulgences. Based on the phenomenal, non-linear \"Autobiography of Malcolm X\" as told by Alex Haley. This straightforward adaptation is by Spike Lee and Arnold Pearl. With Albert Hall, Delroy Lindo, Spike Lee, Theresa Randle, Kate Vernon. Selected for preservation by the National Film Registry.",
            "review_date": "2010-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i can`t belive that Danzel is still not a Muslim",
            "review_date": "2010-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Religion, and the police could not give this man justice, but this film does. An excellent biography chronicling Malcom X's life.  Denzel Washington played the part perfectly. One of his best films.",
            "review_date": "2010-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a strong performance from Denzel Washington!! Every word that came out of his mouth was really powerful and captivating! The great story telling from Spike Lee also enhanced the plot and made the life of Malcolm X something everyone should know about.",
            "review_date": "2010-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Anchored by a powerful performance from Denzel Washington, Spike Lee's biopic of the legendary civil rights leader brings his autobiography to life with an epic sweep and a nuanced message\".\r\n\r\nI honestly believe this is the best film Spike Lee has directed since Do The Right Thing. \"Malcolm X\" is one of the great biographic pictures I have ever seen.",
            "review_date": "2010-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X is a lot of things: controversial, bold, procedural, and informative. From the audacious opening shot that reimagines and redefines the classic Patton image of the American flag, to the belabored attempt in the end to tie everything together with school childen, this film is defiant and unafraid to stand for its message. It's a spiritually enriching testament to the human capacity for change -- and surely Spike Lee's most universally appealing film. An engrossing mosaic of history, myth and sheer conjecture, this ambitious epic manages to sustain itself for 3 hours 21 minutes, and also overcomes an early frivolity of tone and Lee's intrusiveness to achieve a stature befitting its subject.\n\nLee, whose enormous affection for his hero suffuses his work, nevertheless resists the temptation to sanitize Malcolm as Richard Attenborough did Gandhi. The civil rights leader, as eloquently portrayed by Denzel Washington, emerges as an immensely likable human being -- a onetime black separatist who overcame his own prejudices. Still, this biopic will ruffle a few white feathers -- and probably a few black ones too; that's a given -- but Malcolm X addresses itself to all Americans, reminding us none too gently with its opening footage of the Rodney King beating that the work is never done.\n\nThough the film covers 40 of the most turbulent years American society, it seems oddly isolated from its time and place, almost as if the characters were trapped in a snow globe. This segregation may be purposeful, even astute, on Lee's part, but it denies Malcolm his historical underpinnings. And there's a theatricality to the crowd and street scenes that give the film the look of a Broadway play.\n\nLee brings all manner of styles and moods to the film's four chapters -- Malcolm's troubled youth, his conversion to Islam, his ministry and his pilgrimage to Mecca. It's Washington's formidable task to pull all of them all together, to reconcile the disparate Malcolms, which he does with uncanny ease. To make sense of the internal struggle, it's essential to know the tragedies of Malcolm's childhood, as recounted here in the Lee screenplay based on Alex Haley's \"The Autobiography of Malcolm X.\"\n\nThe result is utterly engrossing. Denzel, in what may be the finest performance of his career (this is the film to show people who doubt his versatility), imbues Malcolm X with fire, bravado, intellect, insecurity, pride, and love (both misplaced and direct) in equal measure. Lee once said that, in film school, making a film adaptation of Malcom X's life was a dream project. The pure, unfettered passion goes into every frame, and the result is one of the most fascinating and nuanced biopics ever made. A complex film about a complex man.",
            "review_date": "2010-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X was truly a man who deserved to be the principal character of a nice Biopic directed not by anyone but by a great director such as Spike Lee.  The first part of the movie is perfect but it gets a little slow and monotone at the second one when Malcolm starts predicating.  But it all fixes and ends up being a great flick.  Great acting by Denzel Washington and another great job by Lee.",
            "review_date": "2010-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good, but unfortunately it's overlong, and drags painfully. The performance of Denzel Washington was superb, deservingly receiving recognition for best actor  from the academy. I didn't fully approve with all that has been said because i strongly believe that when you hate people so much you will just make it worse for yourself and for them and therefore wouldn't get any positive solution but only grow the hate in yourself and in the people you are offending. That's basically why I couldn't really enjoy this movie, or respect Malcolm X, although it's a very good piece of work.",
            "review_date": "2010-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great history lesson!",
            "review_date": "2010-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is the first \"Spike Lee joint\" that I have seen. As far as the movie itself, I can't say I enjoy Lee's style of filmmaking. It felt like he was trying too hard to be artsy at times. It made the first half of the movie, where we learn about Malcolm's delinquent days, drag on forever. There were many scenes I felt could have been cut, but still get the point across about what he was like before he turned to Islam.\r\n\r\nThe second part of the movie is what I enjoyed best. I knew very little about him, and so it was interesting to learn who he was. I admire him for coming out after his trip to Mecca to take back some of the things he had said in the past. I don't recall any other person in history ever doing the same. It is really too bad that such a soul was taken from us so soon. I truly believe this country would be a different place had he had the chance to continue on his mission. I also especially enjoyed the documentary that came in the Special Features. It goes a little more in depth on what Malcolm actually went through with the Nation of Islam after he left. What a sad story. It broke my heart to see a trying man have such evil enemies. Denzel did such a great job portraying this great figure. Cheers to him.",
            "review_date": "2010-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another good Biopic performance from Denzel. Surprisingly I enjoyed a \"Spike Lee Joint\". I liked the style and all the bright suits and dance scenes in the beginning. Then when it switched over to the more serious side where he goes to jail an then gets into the all the new religious beliefs. Now with all that being said I still am not a fan of Spike Lee. However, still a huge fan of Denzel and am a fan of the whole Biopic genre. I still think Raging Bull is the best, but up next on the list is The Aviator.",
            "review_date": "2010-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was shocked at how good this was and at the fact that I haven't heard it talked about much. The acting, direction, writing, and cinematography are superb. The sense of calm dread that builds towards the end is amazing.",
            "review_date": "2010-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. Well photographed, directed and well cast. I felt like I was in Malcolm shoes from his painful childhood, to his gangster adulesson days, to being prisoned, and transforming himself to a powerful speaker, and learning to accept empathy on... (read more) Great film. Well photographed, directed and well cast. I felt like I was in Malcolm shoes from his painful childhood, to his gangster adulesson days, to being prisoned, and transforming himself to a powerful speaker, and learning to accept empathy on his own terms. Danzel Washington transforms into the man his performance is truly epic to watch. I admire the scenes where Malcolm plays Russian Roulette, when he is imprionsed and learns the meaning of becoming a muslim, his love for his wife Betty(played by Angela Bassett) his TV interview between the diference of a house negro and a field negro, the rejection of a young student who wants to help further Malcolm's cause, Malcolm leaves the Nation of Islam and goes to the holy city of Mecca, and so much more. I think a lot of ppl will appreciate this film once they been given the chance to see it. It is definetly one of Lee's best films. Epic.",
            "review_date": "2010-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie describes the life of Malcolm X from his childhood, his life of crime, prison, his release, his rise to fame and up to the threats he received and his assassination.\r\nMalcolm Little was a young man when his father was murdered by the KKK and he and his siblings were taken from their mother (who couldn't handle the stress and ended up in a mental institution); his siblings were split up by the State. As a young man he was a hustler/pimp/drug pusher/addict before getting imprisoned for his crimes. While there he learns the ways of Elijah Muhammad and coverts to Islam. \r\nHe gets out of prison and becomes a spiritual leader becoming one of the most eloquent and powerful speakers that the world has ever known, and tackling white oppression head on. The tragedy that ultimately happens to him was heartbreaking because at that point he had reached a pinnacle of understanding and leadership qualities that could have changed the Black Muslim movement in a very positive way.\r\nDenzel Washington delivers an awesome performance and makes a charismatic leading man and it is difficult to imagine that anyone else could have done a better job with this role. It is an incredible performance, worthy of the Oscar. But no, he won that for playing a corrupt police officer in \"Training Day,\" the logic simply escapes me. If it wasn't for his engaging and powerful performance then this film would be very bland for the majority. Spike Lee directed this movie as a tribute to a hero who transcended racism though enlightenment and moral superiority. It's beautifully made with top notch performances by the cast. This film will not only entertain you but educate you as well.",
            "review_date": "2010-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington Was The Perfect Person To play This Powerful Role !! I liked His Younger Years when They called him Red.. The Echo Of Past Is Allway's Screaming to Be Heard\r\nSpike Lee Did This With Great Respect...",
            "review_date": "2010-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the REAL Malcolm X   :see him in video  footage\r\n  Not a huge fan of denzel washington or  spike lee\r\n  See the REAL Malcolm X\r\n    In footage\r\n     I am very happy to see a movie  that perpetuates Malcolm  \r\n Malcolm was over shadowed by  Martin \r\n    Malcolm   was  a member of the much maligned muslim religion  but if you read his bio (wich the movie is based on) you will find out about the real muslims and how good a religion it is.\r\n     Had i not seen the REAL Malcolm  and the power of his intelect and the charisma he had and humility \r\n  and  smart kind presance i mite have liked the movie better\r\nthough, as i said at the outset, dont care for  Denzel OR spike lee\r\n   Here is yet another example of   video where you would be MUCH MUCH MUCH  better off seeing a documentary with footage of Malcolm\r\n   But thanks spike lee for remebering  the GREAT malcolm X",
            "review_date": "2010-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely worth it to see Denzel's performance, but I can't help but feel they could have presented a more abbreviated form of the film. He doesn't become a part of the Nation of Islam until a bit after the one hour mark in the film. I can't help but feel that could have been tightened up. Also, the end of the film (the best part, in my opinion) feels like a different film altogether--a thriller about a secretive and militant organization coming after a single individual and his family. Very well done, but much different in tone from the rest of the film.",
            "review_date": "2010-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee might be one of the most underappreciated auteurs in the film industry, primarily because his absurd politics obscure the talent that is bursting from most of his films.  As a result of his racially obsessive politics several of his films dealing with race have been viewed as too radical to give a fair chance, and at the top of this classification would be the 1993 biopic on controversial civil rights leader Malcolm X.  However, Lee does something incredible with X's life:  he doesn't promote racism through depictions of X's life, but instead shows that even the most ardent supporters of such corrupt thinking can change.\n\nMalcolm X is a racist man in this film.  Granted he has several admirable traits:  he elevated himself from the slums of crime and society, he is a passionate man with a moral code and true convictions, he is self-educated on a level few human beings are, and most of the time he is charming.  And yet any time those qualities start to flourish we are presented with X's outcries and racist tirades that only serve to distance white and black races further.  Many might suggest that Lee is presenting this as a positive thing, but X is continually shown to be wrong in this mentality.  When he finally sees the error of his ways shortly before his death and changes his ethos to one accepting of all races, the true message of the movie is presented:  being a decent, good person is incredibly difficult, and often when trying to find the path of decency we get lost and must find out way back.  \n\nWashington is astounding in this film.  Why he didn't win the Best Actor Oscar is beyond me, for out of a career of powerful, penetrating roles this is his most impressive work to date as an actor.  He doesn't try to make Malcolm X too deified or too villified, but presents him in full, with his merits and his MANY mistakes and flaws intact and ever-present.  This film packs such a tough punch and at first it seems X can't be made into a character we care for because of his divisive politics but in Washington's hands he makes it effortless.  Lee's direction is the other star of the film;  beautifully fluid editing, incredible tracking shots, and in general fantastic shot construction makes this film a feast from a technical level.  Lee has always had a technical virtuosity to his style (having been mentored by Martin Scorsese surely didn't hurt), and it is most obvious here.\n\nMalcolm X belongs among the best biopics to come out of Hollywood, especially because it pulls no punches in portraying its controversial source in a \"warts and all fashion\".",
            "review_date": "2010-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. Well photographed, directed and well cast. I felt like I was in Malcolm shoes from his painful childhood, to his gangster adulesson days, to being prisoned, and transforming himself to a powerful speaker, and learning to accept empathy on his own terms. Danzel Washington transforms into the man his performance is truly epic to watch. I admire the scenes where Malcolm plays Russian Roulette, when he is imprionsed and learns the meaning of becoming a muslim, his love for his wife Betty(played by Angela Bassett) his TV interview between the diference of a house negro and a field negro, the rejection of a young student who wants to help further Malcolm's cause, Malcolm leaves the Nation of Islam and goes to the holy city of Mecca, and so much more. I think a lot of ppl will appreciate this film once they been given the chance to see it. It is definetly one of Lee's best films. Epic.",
            "review_date": "2010-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good; but like all so called history bassed movies,lets not affend anyone by telling the truth.",
            "review_date": "2010-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should have received the Oscar for Best Film.",
            "review_date": "2010-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enlightening. Everyone should see it.",
            "review_date": "2009-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Leave to a racist like Spike Lee to make a movie about a racist dirtbag like Malcolm X.",
            "review_date": "2009-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic biopic by Spike Lee and starring Denzel Washington, the screenplay is great and for 3 hours and 22 minutes, I wasn't bored not even once.",
            "review_date": "2009-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fitting homage to one of the most, if not THE most resolute and inspiring leader of the Black Liberation and the Civil Rights movements. Washington at his best.",
            "review_date": "2009-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stop playin, life changing",
            "review_date": "2009-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel should have won an Oscar for this one instead.",
            "review_date": "2009-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long but still deadly.",
            "review_date": "2009-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie, and Denzel Washington's performance was way beyond that of what any other actor could have done. He delivered Malcolm's speeches with such power, and looked exactly like him. Spike Lee delivered the story Malcolm's life almost perfect, down to the burning of his house. Now, I read the autobiography, and it was a great one too, the only problems I have with the movie are that Spike skips out on Malcolm's period Doing and selling drugs, living in a whore house, and burglarizing houses.(Although yes there is one scene where he does cocaine, and another where he breaks into one home, but then gets caught)Which I can see because of the films PG-13 rating. And secondly, Spike changed the way Malcolm began practicing the Muslim faith(or maybe I misread the book). But all that aside, it's a great film adaption to Malcolm's life with terrific performances by the entire cast which make it a must see film!",
            "review_date": "2009-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's greatest work and Denzel gave a oscar worthy performance!",
            "review_date": "2009-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent movie\r\nthe only bad part was it did not win the award for best film\r\nit was way ahead of its time\r\nthe closest thing to a documentary from a films stance",
            "review_date": "2009-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm went from hoodlum to Icon.",
            "review_date": "2009-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "all my respects.  to the real man, as well as to the filmmakers.  very inspirational.",
            "review_date": "2009-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intelligent, suspense, drama, history, storytelling. This movie have it all. Excellent.",
            "review_date": "2009-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite historical movies",
            "review_date": "2009-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great movie from Denzel! This one is especially great due to the glorious life it depicts! I had very few information on Malcolm X, now I'm a huge fan and I was heart-broken that, like any truly great person, he was killed, at such a young age! America had its share of barbarism!!",
            "review_date": "2009-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies I have ever seen I would like to watch again and again\r\ntop class acting by Danziel Washington he was just like the real character told must of the stuff about Malcolm X \r\nit tells properly how the black society was separated from the white man society and about racism\r\nTOP CLASS MOVIE",
            "review_date": "2009-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A VERY controversial and intense biopic, but Denzel is amazing as always!",
            "review_date": "2009-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "He was an AMAZING MAN!!!!! True Leader :)",
            "review_date": "2009-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is without a doubt one of the best films ever made. Denzel Washington gives without a doubt one of his best performances of all time as Malcolm X, the civil rights leader who was pro-violence against the white people during the civil rights movement before coming to his senses and realizing the Muslim religion he was so eager to lay his life down for was hypocritical and in some ways I felt used Malcolm X, or just got too jealous once his stature in the Muslim religious group was getting him so much attention that people believed he was the voice of Allah; not the honorable Elijah Muhammad. They turned on Malcolm X, just after he literally devoted his life for their cause because their religion helped him get sober, and allow him to find himself again before becoming just another degenerate in Harlem. Denzel literally is Malcolm X. Just like Daniel Day-Lewis was Lincoln, and like Sean Penn was Harvey Milk in Gus Van Zant's \"Milk.\" No one, and I mean no one could have had the strength and endurance to play Malcolm X as Denzel Washingoton did in this movie just makes me believe that Denzel is without a doubt one of the best actors that has ever lived. He's a fearless actor, the man has a true potential for acting. I mean come on the guy did not win his two Oscars for \"Glory\" and \"Training Day\" for nothing. But there is something about \"Malcolm X\" that just hits you hard when you watch it, mostlt because Denzel is just so damn good throughout  the whole movie that he is truly the driving force behind this\nwhole movie. There are also great supporting performances by Delroy Lindo, the hoodlum gangster of Harlem, who takes Denzel's Malcolm X under his wing after he sees him smash a guys with a glass bottle after insulting him and making a comment about his mother which Denzel tells him ferociously to never say another word about his mother again. Albert Hall, who played the chief in Francis Ford Coppola's Vietnam achievement \"Apocalypse Now,\" is great as Bane, the man who shines the light onto Denzel's Malcolm X and converts him into the realm of Islam and helps him become a Muslim. And then there's Angela Bassette and even though they toned her looks down a little bit for the movie so she can look like a typical Muslim wife of Malcolm X, she still looks good and even today at 56 she still rocking it if you ask me. She gives a very, very strong performance as Malcolm X's wife and even though I have only seen a handful of her films, I find she delivers every time I see her in a movie. Even Spike Lee, the Director of this movie who I know is very controversial subject matter these days even bring a great presence as Malcolm X's hoodlum buddy in the film. This is a movie not be missed as I would definitely put it in my \"1001 Movies You Need To See Before You Die\" list and just want to say one more thing. This is the most historical bio I have ever watched and truly believe this was my first Denzel Washington movie and I remember even seeing \"Malcolm X\" at a young age when I believe it had just started coming on TV after being in the movies and thinking the whole time watching Denzel Washington in this movie that this is an actor I have got to keep an eye on as he is truly, TRULY a remarkable actor who I hope keeps bringing us more great performances for years to come. Also about Spike Lee, even though like I said before he is a controversial subject matter these days I will admit one thing, no one but him could have directed this movie as for a man of Spike Lee stature I would like to say this is his \"Goodfellas\" as nobody but him could have made a movie like this I truly applaud him for this was a very fierce movie to make and even though he was nominated for Best Director for this movie even though I feel he should have; Denzel Washington was able to execute Spike Lee's vision....and that's all that matters.",
            "review_date": "2009-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eh, nothing special, I feel like I didn't really learn as much about Malcolm X in three hours as I should have.",
            "review_date": "2009-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's spike, of course it's good",
            "review_date": "2009-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of all of Spike Lees movies! It should have won an Oscar!! Denzel was definitely Malcolm X, in this movie!!!",
            "review_date": "2009-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a classic biopic which means it starts with the subject from his early days all the way though every major event in his life which i like. Denzel does a great job as the charismatic mr x. This film has a great mix of history and drama. This movie show that old truth that whenever there are men with power, even if they are all on the same side, they will do anything to keep there power. There were a couple of strange directing choices, flashbacks that don't seem to fit and at one point there is a freeze frame of malcom talking first person (a la goodfellas) when we have been in third person the whole time. Still this film held my attention for all 3 pluss hours and thats not easy. \nSide note: totally unnecessary footage of the Rodney king beating at the beginning was way out of place.",
            "review_date": "2009-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Informative and compelling. Well made on the whole.",
            "review_date": "2009-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I probably just didn't get what Spike Lee was up to but it felt too long and poorly edited, kind of like Downfall in the sense I could sneak in a couple of naps and not have missed anything too important. Washington was great but the film itself was rather clunky. Malcolm X is clearly a complex character to portray and not an easy hero for a film and I don't think the film worked through these problems very well.",
            "review_date": "2009-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good in places and probably would warrant three stars if it hadn't been (and seemed) so long! I appreciate Lee might well have been trying to do something different with the backstory and making a period piece about Harlem but I found it largely dull and hard to follow. Denzel was great but this wasn't enough to carry a film in which it was only the last hour that I really enjoyed watching his character. Oh, and one final word about the music. The background songs were great and well-chosen, the atmoshperic 'score' just felt out of place and overblown. It ruined many a scene that I imagine were supposed to be key emotional moments for me.",
            "review_date": "2009-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's a complex movie about a complex man. i'm not really a spike lee fan but i do pay attention to his work because i think it's fairly original. in my opinion this is his best work. i'm not sure about the veracity of the movie but i think it conveys malcolm's vision fairly well. it gets a little too preachy for me in the last few minutes but overall it was good. denzel does a great playing malcolm.",
            "review_date": "2009-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Malcolm X is remarkably faithful to the essence of the man -- his anger, his sly wit, and his passion.Spike Lee at the top of his game.",
            "review_date": "2009-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've read the Autobiography 0f Malcolm X as told to Alex Haley, and well a quote from Spike Lee on the cover and you know it will be interesting, incidentally he directed this as well. I must say it isn't at all times completely accurate but understandably vivid and some change must occur for the silver screen of course. Denzel impressed me thoroughly though and definitely captured the essence of Malcolm. A non-fiction book is sometimes hard to portray in cinema and Spike Lee did the job.",
            "review_date": "2009-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love this movie\"Get your hand out my pocket\"",
            "review_date": "2009-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a society were Martin Luther King is given the credit of single-handedly leading the Civil Rights movement, Malcolm X shakes up every pre-conception we in White America have of Dr. King as primary mover and shaker. \r\n\r\nMalcolm X shows us another side; the story of a man who went from convict to prisoner to revolutionary, educating himself while incarcerated and being transformed by God into a leader like no other.\r\n\r\nHaving educated myself in alot of things, I cant help but to identify with Malcolm. In Malcolm, I see myself; his anger becomes my anger, his discontent is my discontent. All militant yet remaining in a highly spiritual/theological context.\r\n\r\nToday there remains a great deal of misunderstanding about, ignorance of, and even hostility toward Muslims here in America. This film brings to light that one of our great shining examples of justice in the Unites States was himself Muslim. Malcolm cannot be understood without Islam and the Civil Rights era cannot be truly understood without Malcolm.\r\n\r\nI consider him a hero, a teacher, and an example that I believe this country would be better off following.",
            "review_date": "2009-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly as a white dude, I am in a different position to view this flick.  However, as someone who grew up listening to Public Enemy, and watching The Fresh Prince of Bel Air and the Cosby Show, I know of Malcolm X, without KNOWING Malcolm X.  This is a very good movie (not great) made by the one guy who really could/should make it.  Make sure you have 1000 hrs of time on your hands.",
            "review_date": "2009-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great portrayal of Malcolm X's life.",
            "review_date": "2009-08-27",
            "source": "rt",
            "lang": "en"
        }
    ]
}