{
    "rating": 9.1,
    "release_date": "1992-05-02",
    "num_reviews": 110,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "This film presents five stories, each involving a cab ride and set in a different city around the world. In Los Angeles, no-nonsense taxi driver Corky (Winona Ryder) gets an engaging customer in the form of a Hollywood casting agent (Gena Rowlands), while a Parisian cabbie (Isaach de Bankolé) must contend with some rowdy African diplomats. Among the other tales, a standout is the Italian taxi ride that finds quirky driver Gino (Roberto Benigni) making a lively confession to an ailing priest.",
    "reviews": [
        {
            "content": "Every story is good, whether it's funny, philosophical or tragic. Sadly, Roberto Benigni's part is unsuccessful, but the quality of the other 4 make up for it.",
            "review_date": "2023-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The premise is simple – set in five different cities (Los Angeles, New York, Paris, Rome, and Helsinki), five taxi drivers transport five fares during the same evening at the same time.  Jim Jarmusch's Night on Earth is a film about principles, joy, sorrow, misgivings, and passion, among other things.  More polished than the movies that preceded it, Jarmusch never loses sight of what makes his films so relevant – his characters.  While the segments vary to a degree in quality, they are all both entertaining and insightful, never losing sight of what qualities it takes to make us human.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of course the opening song is Tom Waits lol. It's got that offbeat kind of peculiar Jarmusch charm to it. Really fascinating how they filmed Earth like that. It looks like a balloon resembling our planet. I like the creative way they filmed the globe with the pertaining cities in which the film takes place in. \n\nInteresting how Winona's character and the older blonde lady come from two completely different walks of life, yet, this night in Los Angeles they meet. Jesus, I think that's the most unattractive I've ever seen Winona in a movie. I mean she's still cute as hell. I love how tomboy she is. How she doesn't give a shit. I always forget how good of comedic chops Winona has. She definitely makes me laugh and smile. Wow, Winona's character just turned down the biggest opportunity of her life probably. To be a movie star! People would line up in the millions to be in the position she was in that night! But I can definitely admire and respect her loyalty towards the things she really wants to do with her life, like eventually become a mechanic. That's admirable, she knows exactly what she wants in life. She knows she doesn't want the movie star life. \n\nAh New York City, the melting pot of melting pots. So crazy seeing Giancarlo Esposito so young. I almost didn't recognize him, but I knew his face was familiar. He plays a very lively and animated trendy guy who's just trying to get home to Brooklyn who ends up helping out the newly transitioned foreigner get situated with his cab and his new job. He's showing him the ropes, even introducing him to New York! Even ends up driving for him! What a thoughtful and nice dude. I love how they all end up getting along all thanks to Helmut playing his little recorders. These people would have never met if it wouldn't have been for the taxi ride - serendipity. \n\nAh Paris, je t'aime. Omg the two guys from Cameroon in the back of the cab are hilarious. Damn the cab driver straight up left them in the middle of some ghetto lol. Well, that's why you shouldn't fuck with cab/uber drivers. I love how he thinks he won't get any shit from the blind girl, yet she gives him flack about the sign in the back of the seat lol. The drivers problem is that he's too uptight and prideful. Doesn't seem to like his job or just tired. I love how deep the blind girl is. She doesn't see colors but feels them and feels movies, and music. Although she's blind, she's very quick witted and smart. And actually very attractive. How ironic how it ends with the cab driver getting into an accident with another car while the blind girl walks away. She's more aware, more in tune and way more educated and less ignorant than the cabbie. \n\nI love Roberto Benigni man. He's so charismatic and funny, and kind of crazy lol. He's so kinetic and animated, lively. This one was probably the funniest one out of all of them. The way he confesses to the priest how he fucked a pumpkin when he was a kid as a means of release was hilarious to watch. And then he goes on telling the priest that there was a period in his life where he made love to a sheep named Lola who he was really sweet with. LMAO!! The way he delivers his stories is impeccable man. The way he says, \"Oh!\", is so hilarious. His stories were so shocking and filthy that he gave the priest a heart attack lol. \n\nHmm, I wonder what made Jim pick Helsinki out of all places. I mean cuz there's Stockholm or Oslo or even Amsterdam. But he is right, it is a very well-lit city. Yeah, Mika's story was pretty sad but the compassion from the passengers is sweet. Goes to show you never really know what other people are experiencing in the lives, they could be going through hell and you might not even know it. That's why you got to be nice to everyone. \n\nNot only is this a good character study on people from all different walks of life, but it's also a director's love letter to some of his favorite cities in the world. The way Jim films these cities, it's like he's a curious kid filled with wonder. He really gets a feel for the city at night and really captures the essence and soul of the place. The dynamic between the characters in this movie is very fascinating to watch. The acting felt genuine. The whole movie ends up being a pretty wholesome and entertaining experience between strangers that would probably never have met if it weren't for being in the same taxi. I really liked it.",
            "review_date": "2021-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think whenever you crave a late night out but can't get out of your bed you'd better watch a Jarmusch film instead while lying on your bed under a blanket with a big cup of tea in your hand. The common element that can be traced in all of his films is that he captures these laid-back vibes of such nights to a tee. In Night on Earth, we see nocturnal cityscapes of gloomy, empty streets before getting in a taxi with eccentric yet amicable strangers of different cultures, ceaselessly chatting over trifles of otherwise moral value, all while the tires humming over the asphalt roads and the cool, fresh night air tapping on the car windows. This is basically the whole movie!\n\nThe five-segment anthology takes place inside taxi cabs across five different cities on the same titular night. The first one is set in Los Angeles, and features a chain-smoking, gum-chewing, tomboyish taxi driver (Winona Ryder) and a classy casting agent in Hollywood (Gena Rowlands). This is probably my favourite out of all the five vignettes next to the second one, which takes place in New York where a German cabdriver (Armin Mueller-Stahl), with a background that remains ambiguous, is lost in a city and culture he doesn't understand. This one genuinely got a few chuckles out of me. The third episode, that's in Paris, is relatively a bit heavier on its message but is more than made up for it thanks to a brilliant Beatrice Dalle as a woman with hyper-acute senses compensating her lack of sight. In the fourth one, which takes place in Rome, we witness Roberto Benigni being Roberto Benigni as he confesses his sins to a priest (Paolo Bonacelli). The final one taking place in Helsinki is by miles the bleakest of them, imbued with a deadpan undertone but suffused in a sorrowful and grieving tone.\n\nJim Jarmusch values the brief, ephemeral encounters of people who had never met before, and likely would never meet again. People of nature peculiar to yours but actually quite normal once you get to know them. It's all about everyone's own attitude to life; everyone's priorities shaped by their own environment or according to their life path of their own choosing. And without Jarmusch's signature languorous aura that ties up all the segments together and casts a magical spell on the mundane to turn it to something rather celestial, this night on earth would've been a lackadaisical one with nothing memorable.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I may or may not have seen this at some point in the 90's, I honestly don't remember but it does seem vaguely familiar.  I'm 80% sure I've seen this before this time.  Now, nearly 30 years later, this is just a fun movie to look at for people who remember life before Uber, before the internet, before everyone recording everything with their phone, and before micro managing every aspect of life from a phone or tablet.  Really, it's a movie about nothing and more of a character study that is set in taxi cabs around the world in a series of unconnected stories.  It's entertaining and not an aneurysm inducing headache.  Didn't care for the subtitles, or rather the necessity for them, but I see the reasoning for it's being that way.",
            "review_date": "2021-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It only gets 4 stars because the first hour was amazing and then after the first hour for 10 minutes there is French characters speaking in French, Italian characters speaking in Italian and so on ...... and that's just sounds to me because i only speak English. Btw the movie has no subtitles for the non English parts. And the reason I say the first hour of the movie is the best part it's because it's 2 hours and 5-minutes to be exact in total. And looking at the New York and Brooklyn backdrop compared to the other cities that we see it's no reason why most movies are made in America because it's so much better for cinematography and backdrop. I only watched the movie because I really like Gena Rowlands and I have a soft spot for a Winona Ryder to and and as always they were both excellent.",
            "review_date": "2020-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 bite-sized stories of taxi journeys from 5 cities around the world. The stories are intriguing. Some are comical, some are sad, some are interesting. The five convey different emotions throughout the movie but it can also be conveyed in a short time. For me, 2 hours is too much even for five short stories. The film also lacks meaning in some stories. I admire the breathtaking cinematography shown in each city. The acting and directing is decent. \"Night on Earth\" is an interesting film that also makes you question its purpose.",
            "review_date": "2020-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this film in a little renovated one room school house in St. Johnbury's Vermont in the early 90s. I enjoyed all the vignettes, but NY is my favorite.",
            "review_date": "2020-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, I sure am glad none of my taxi rides were like in this story",
            "review_date": "2019-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty jokes with thoughtful insight through the eyes of taxi drivers.\n\nJim Jarmusch's hilarious dramatic comedy Night on Earth (1991) is a haze of clever script writing and beautiful cinematography. Jarmusch's direction is so interesting and always keeps you guessing. The plot is non-existent, so you just get to revel in these intimate character interactions.\n\nNight on Earth is particularly dazzling for it's brilliant script. Jarmusch's writing leaves you with no empty spaces. He gives you five taxi cab drivers and their variously assorted passengers. Night on Earth is a slice of life film, but from the grounded perspective of these taxi drivers. It's like the striking direction and realism of a Martin Scorsese film with the humor and strangeness of a Coen Bros. movie. Night on Earth is incredible.\n\nTom Waits' score is interesting and multi-faceted. The odd folk and blues of Waits' music is blended between genres as Waits specially matched the worldly genre style of each film location with his music. The Los Angeles section is a dreamy blues rock number. The New York section is atmospheric jazz. The Parisian sequence is French jazz. The Roman portion is goofy off-kilter polka type jazz. Finally, The Helsinki finale is a combination of polka and somber blues. Tom Waits really expanded his horizons in capturing music that sounds authentic to each locale, while resembling his own style. I loved Tom Waits' score for Night on Earth.\n\nNext, the entire cast of Night on Earth is a remarkable assembly of actors, whom are favorites of Jarmusch, pretending off of each other to mesmerizing effect.\n\nNotably, Winona Ryder is a tomboy taxi driver named Corky. Ryder sheds her famous cute image for a chain-smoking, gum chewing, tough girl dreaming of being a mechanic. Her realistic portrayal feels so grounded that it's funny seeing Winona play so opposite her type. She kills it as a girl that just wants a family and to drive her cab. Her humble dream of being a mechanic is as endearing as Ryder's performance of this young rascal. She fits no mold and breaks the stereotype of every girl in Los Angeles wanting to be a movie star.\n\nGena Rowlands is excellent as the typical Hollywood casting agent. She is so stuffy and proper that it's funny. She plays off Ryder's bombastic character with a cool cavalier attitude. Her confusion at Ryder's rejection of her casting offer is great. I love this initial L.A. introduction to Night on Earth.\n\nThe New York section is very fun as Giancarlo Esposito is just playing an everyman trying to get home to Brooklyn in the cold. He gets picked up by the only cab driver to stop for him, who happens to be Armin Mueller-Stahl, who cannot drive! It's a humorous situation made into ridiculous fun with the addition of the always loud and adorable Rosie Perez.\n\nThe Paris portion of Night on Earth is a beautiful satire on racial dynamics and visually impaired tropes. Isaach de Bankole is such a tread upon taxi driver that you feel sorry for him. Normally, the blind woman would be the sympathetic figure, but Night on Earth reverses this trope with the alluring and belligerent Beatrice Dalle. Her sarcastic French moaning is delightful and her performance as a blind woman is magnificent. I am astounded by the wit and commentary within the Parisian portion of Night on Earth.\n\nThen, there is Rome. Roberto Benigni is gut busting throughout the entire Roman bit in Night on Earth. Benigni can talk endlessly to himself and still be entertaining. His performance gives it all and then some more that you didn't even know you wanted. I have to hand it to Paolo Bonacelli for keeping a straight face as the priest in the backseat of Benigni's taxi. I think most audiences will laugh the hardest here.\n\nLastly but certainly not least, the Helsinki taxi trip in Night on Earth is the most dramatic and moving part of the movie. Matti Pellonpaa is the quiet serious Finnish taxi driver, who delivers the most exquisite monologue on life's perspective that really gives Night on Earth a memorable morale. He is genuinely amazing and sympathetic. I also liked the three guys in his cab played by Kari Vaananen, Sakari Kuosmanen, and Tomi Salmela. Their riotous zeal and drunken stupor are the perfect foil for the steely Pellonpaa to act opposite.\n\nOverall, Jim Jarmusch's Night on Earth is a delightful experience of joyous laughter and thoughtful commentary. The drama is heartfelt and touching, while never feeling overly sentimental. Jarmusch's direction and script are stellar as is Tom Waits' score. The incredible cast is outstanding as is every Jarmusch ensemble. Night on Earth is simply one of the greatest films I have ever seen and absolutely nothing happens.",
            "review_date": "2019-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good, interesting and bittersweet collection of vignettes.",
            "review_date": "2019-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Between 2 and 2.5 stars. Each of the stories (I have seen three: Rome, N.Y., L.A.) have a little thing, but no enough to get interested about.",
            "review_date": "2018-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch's best films are about encounters between strangers. All human life can be there. Here, his canvas is five cab journeys that take place concurrently in five cities across the world - clowns, priests, blind women, drunks - strangers who discover a shared humanity during their thirty-minute journeys. Proof again that there can be more drama in the lighting of a cigarette than a dozen huge explosions.",
            "review_date": "2018-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie 'composed' by Jim Jarmusch. I absolutely love everything about it, from excellent soundtrack by Tom Waits to beautiful city scenes that make my wanna sit & gaze for hours.",
            "review_date": "2017-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Night on Earth is one of Jim Jarmusch's best films with whip-smart writing, confident direction and cast of delightfully oddball characters.",
            "review_date": "2017-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie! Stumbled across it at an Air Force video library about 20 years ago, been trying to find it ever since",
            "review_date": "2017-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great concept along with touching music by Tom Waits. On the negative side, the acting is sometimes strange and it gives you the feeling that you could sympathise with the characters more than you already do, if it was different.",
            "review_date": "2017-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Years before its absolutely cult \"Dead Man\", which stars Johnny Depp, Jim Jarmush carries out the crazy project of shooting five different taxi stories in five different parts of the planet. In addition to a dreamy casting for every single story, it is finally the profoundly human and realistic part that touches the spectator. From the hollow conversation in the first fare to the touching story of the last, passing through Roberto Benigni's unsuccessful confession (at the top of his art), each and every story mesmerises us with the help of the night atmosphere. Supposed to be simple night taxi stories, their symbolism and their poetry go beyond the setting they are set on. The diversity of the roles and the stories as well as the places and cultures, mixed with a desire of originality, transform \"Night on Earth\" into a cult movie that, despite its five stars cast, is too often forgotten. Big mistake because after seeing this movie, you will never see a taxi in the same way as before!\nFull review on our blog Los Indiscretos : https://losindiscretos.org/english/night-on-earth-1991-jim-jarmusch",
            "review_date": "2016-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "May have been one of the bases to have inspired \"Taxicab Confessions\" which centers on 5 different cities from NYC , LA, Paris, Rome and Helsinki where the passengers interact with their passengers.",
            "review_date": "2016-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jarmusch, always with a vision and style. Blending in five different scenes of people with such between-worlds needs and life-situations. A study of the differ of the human man. First a young girl with her life planned, sticking to it even though gold is offered. Secondly a man without any skills, positive to the bone even when there is no shreds of hope. Third a blind girl with better eyesight than the seeing man. Forth a babbling mess without any reach for other than himself, scuffling away from any problem. And last a wounded logical fin, longing for the problems others getting drunkfaced over.",
            "review_date": "2016-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An strange mix between great stories and some mediocre pieces. Not as funny as I wanted it to be, nor as good.",
            "review_date": "2016-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Night on Earth is a beautiful movie in all it's simplicity. In the center of the movie are the encounters of people, who maybe wouldn't meet otherwise, but in a taxi cab they get a connection to each other - or to themselves.\nThe movie is a mixture of drama and black comedy (especially Roberto Benigni's character is unbelievably funny!) that carries through the movie. It consists of five quite different episodes located in different cities of the world. Although the main idea is quite simple, after seeing this movie you have a feeling that you have in some level at least learned or remembered something important about the world and human beings.",
            "review_date": "2016-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On of the funniest and smart black comedies of all time.A great character study with lots of wit and humor.This is true cinema!",
            "review_date": "2016-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the early 5 (or a few, mini-stories, sub-plots) in 1 (film) back in the '90s. Kinda amusing in general.",
            "review_date": "2016-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thoroughly enjoyable work by Jim Jarmusch , capturing an exact moment in time in LA, NYC, Paris, Rome and Helsinki. None of the vignettes disappoint but the NYC segment with Giancarlo Esposito, Rosie Perez and Armin Mueller-Stahl  and the Rome segment with wonderful Roberto Benigni  are homeruns!",
            "review_date": "2015-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed movie. 5 scenes in different part of the world. All cab drivers",
            "review_date": "2015-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel safest at nighttime, not on the streets but in the sheets, cemented to my bed with my laptop by my side.  These summer nights seem to beg me to stay up until the earliest hours of the morning, and it's hard not to comply - at two pm, there's nothing in the world stopping a friend from asking you for a favor, a grandma inviting you to move furniture for an estate sale, a parent demanding you mow both lawns, take out the garbage, and clean your bathroom.  But at two am, every one of those people is asleep: nobody expects anything from you, and, for once, the stresses of reality cease because no one else is throwing them in your face.  Nighttime is a period of spooky solitude, elusively appealing.\n\t\"Night on Earth\" divides itself into five vignettes, all set during these wee hours, all involving the relationship between a taxi driver and their temporary client, all in a different city.  Directed by Jim Jarmusch, one might expect a deadpan drama of steeping revelations and scintillating conversations, in the way \"Broken Flowers\" could make even the most awkward of an exchange blossom with black hilarity.  But \"Night on Earth\" is wildly uneven, some of the segments mostly involving, others splendidly acted but unsuccessful in their rendering.  I've always felt that a movie comprised of short films should be so arresting in each segment that it wouldn't be unheard of to pine for a longer, feature adaptation.  But even in its best moments, \"Night on Earth\" is slight, some performers more pleasing than others - a difficulty when some segments are damaged by particular characters.\n\tThe first vignette, set in Los Angeles, stars Winona Ryder as the cab driver, Corky, Gena Rowlands as the passenger, Victoria.  Corky, young and spunky, chain smokes, chews bubblegum, and figures that her dream career is that of a mechanic; Victoria, middle-aged, welcoming, and refined, is a casting agent looking for fresh talent.  She sees a spark in Corky, figuring her rough-and-tumble attitude could be assembled into a rebellious, cool product headed toward stardom.  This segment, though dampened by Ryder's unconvincing portrayal of a grungy youth with small dreams, makes an impression thanks to the always lovely Rowlands, who makes what could be an unlikable character affectionate, motherly even.\n\tThe second, stationed in New York and headed by Armin Mueller-Stahl, Giancarlo Esposito, and Rosie Perez, is the second most annoying of the segments: driver Stahl, a German immigrant, hardly knows how to drive, so his customer Esposito takes over the wheel and loudmouths his way through awkward silences.  Midway through the trip, the two pick up the shrill Perez, who happens to be Esposito's sister-in-law.  The vignette could be enjoyable, with Stahl sweetening the atmosphere as a gentle giant, but Esposito and Perez are so obnoxious that we can hardly wait for the short to be over.\n\tThe third sequence travels to Paris, by far working as the most straightforward, best written moment in the film.  Here, a blind woman (Béatrice Dalle) gets a ride from an endlessly pissed off driver (Isaach De Bankolé) who rethinks his usual grumpiness after she gives him a run for his money: the woman, it seems, is scorned by life and completely disregards her ailment, scoffing whenever her cabbie asks an inappropriately curious question.  The segment works so well because of the rapport between Dalle and Bankolé - whereas the other shorts attempt to have the characters find a mutual understanding between each other, Dalle and Bankolé's mutual curiosity/disdain bears an odd sexual tension, fascinating just enough to leave us potentially wanting more but backing off when considering just how well it works.\n\tI won't go far into the fourth sequence (set in Rome), which is jaw-droppingly irritating as comedian Roberto Benigni delivers a mile-a-minute performance as a cab driver who just won't shut up.  If he's annoying to his guest then he's annoying to us as well - don't expect to want to do anything besides fast-forward as his mouth runs into oblivion, us preferring deafness to hearing any more about another one of his sexual experiences.  Following the exasperation of this vignette, \"Night on Earth\" ends on a melancholy note as it hits the snowy streets of Helsinski, with a group of passengers complaining about how horrible their friend's day was until the driver decides to top it with a soul crushing experience himself.  \n\tWhile I appreciate Jim Jarmusch's enviable ability to turn realism into sardonic astuteness, \"Night on Earth\" feels more like a filmmaking exercise than an actual film.  It doesn't move - it serves as an experiment pleasing only the people involved while the audience sits and waits patiently for something moving to happen.",
            "review_date": "2015-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent movie, with remarkable cast and nice music.",
            "review_date": "2015-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is not just empty - the first story in Los Angeles does not deliver anything at all - or stupid: the episode from Helsinki, supposed to be a tear jerker, is so false and stupid to turn to comic. \nIt is also, in the episode from Rome, offensive well beyond the limit of racism. \nIn this horrible movie Jim jarmusch portrays Italy as an economically underdevolped country, a place where taxi drivers drive the wrong way and smoke in their own taxi  (Italy has been the first country in Europe to introduce restrictions to smoking in public places: ant the law is applied and respected), and the Italian people, according to the racist Jarmusch, are permanently aroused, to the point that, when they do not have sex on the public street, they have sex with pumpkins and animals. \nA collection of the worst anti-italian prejudices.  I strongly suggest to any Italian, and to any person that loves Italy, to boycott Jim Jarmusch forever. \nA horrible movie, when not empty and/or stupid, full of prejudices and prone to the most hideous racism.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice conversational flick, focusing on cabs in 5 different cities around the world...",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Night on Earth  [1991]",
            "review_date": "2015-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad film with curious stories, fine night time towns and jazzy tones of soundtrack. Comic stories at first turn to sad and bleak ones at the end.",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Liked it very much, 5/5 points!",
            "review_date": "2014-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love it, even there are other movies like it.",
            "review_date": "2014-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like a quintet of Ogden Nash rhymes, Mr. J's work here leaves me grinning many times.",
            "review_date": "2014-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film depicting taxi drivers and their unbuttoned and vulnerable passengers... Wonderful storytelling of night people in taxis in various parts of the world on a mission to nowhere at all! Watch it! :-D",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch gran director...",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nI started Jim Jarmusch's filmography with Down By Law, and that film left me kind of disappointed due to it's emotionless and lack of drive during the first half of the film. Though left underwhelmed, I still had faith on Jarmusch as there is something about his style and storytelling that makes me want to come back for more. I came into Night on Earth with small expectations and surprisingly, it succeeded in surpassing it and delivered an experience I wouldn't forget. The film doesn't feature a plot or a even a clear connection or similarities between each of the five storylines, aside from the fact that it tells the story of a cab driver and a passenger. I enjoyed the film all the way through, with each story coming off as beautiful managing to evoke something out of me. Each individual segment explores different themes and I was surprised how much Jarmusch was able to focus on so many and not have the film feel messy and directionless. The film's simplistic and character-centered photography was appealing, and the film's optimistic and sometimes quirky music makes the stories feel light and accessible even when things get dark. The film featured great acting with standout performances from Winona Ryder, Beatrice Dalle, Giancarlo Esposito, Armin Mueller-Stahl, and Matti Pellonpaa. Night on Earth is an example of showing what would be down to earth stories and making something significant out of it.",
            "review_date": "2014-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nI started Jim Jarmusch's filmography with Down By Law, and that film left me kind of disappointed due to it's emotionless and lack of drive during the first half of the film. Though left underwhelmed, I still had faith on Jarmusch as there is something about his style and storytelling that makes me want to come back for more. I came into Night on Earth with small expectations and surprisingly, it succeeded in surpassing it and delivered an experience I wouldn't forget. The film doesn't feature a plot or a even a clear connection or similarities between each of the five storylines, aside from the fact that it tells the story of a cab driver and a passenger. I enjoyed the film all the way through, with each story coming off as beautiful managing to evoke something out of me. Each individual segment explores different themes and I was surprised how much Jarmusch was able to focus on so many and not have the film feel messy and directionless. The film's simplistic and character-centered photography was appealing, and the film's optimistic and sometimes quirky music makes the stories feel light and accessible even when things get dark. The film featured great acting with standout performances from Winona Ryder, Beatrice Dalle, Giancarlo Esposito, Armin Mueller-Stahl, and Matti Pellonpaa. Night on Earth is an example of showing what would be down to earth stories and making something significant out of it.",
            "review_date": "2014-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uncertain about what I was really going to face in another Jim Jarmusch film, I went into Night on Earth with nothing but uncertainty, but I had hope that a collaboration featuring both Winona Ryder and Roberto Bengini would be very entertaining.\n\nThe concept of a taxi driver interacting with clients is a very interesting concept to me because it allows characters to learn from each other and speak with utmost honesty. The premise fascinated me in Michael Mannâ??s 2004 crime thriller Collateral, although it began as a similarly themed drama to Night on Earth and later unfolded into a crime thriller. In Night on Earth, all the important focus rests on the interactions between the complicated characters, and it is actually very interesting. While as the film covers five stories, some which are less interesting than others, Jim Jarmuschâ??s iconic film style and intelligent screenplay renders it a consistently successful feature.\nNight on Earth can be summarised by having its five stories split into various sections, so that is the way I will structure this review. And before I do go into details I will say that the entire feature is filmed with strong quality cinematography which stays true to the details of the characters and keeps the scale down on the character-driven level of a Jim Jarmusch film. Also, it is all edited very well and features an excellent screenplay. The screenplay in Night on Earth gets into the minds of the characters easily and allows the actors to give it their best without problem, and it creates an insightful and entertaining universe which introduces interesting concepts and themes to the film and never looks back\nThe first story of Night on Earth gives it a really good start, as it shows the communication between a young tomboy taxi driver and a female casting agent. The interaction between the two characters is fairly funny and insightful too, particularly in the final scene. The last moment of this story has Victoria Snelling offering a part in a film to Corky who politely refuses, ginving up the potential for â??Every girlâ??s dreamâ?? for what she wants to do in life. The way that she refuses to be seduced into the more commercial industry and instead wants to stick with simply what she is good at and what she wants to do for herself reflects the way Jim Jarmusch has consistently remained one of the most consistent contributors to independent cinema without going into big-budget material which is used more as a commodity than a thought provoking film. The character Corky is a great one and reflects part of Jim Jarmusch himself which is admirable.\nWinona Ryder is one of my all time favourite actresses, and I love it when she takes on very character driven parts. So to have her playing the lead in a segment of Jim Jarmuschâ??s film which partially reflects himself as a human is just excellent. Winona Ryderâ??s charming charisma dominates the screen, even against two-time Academy Award nominated actress Gena Rowlands and her sharp and witty line delivery is perfect for the atmosphere of a Jim Jarmusch film, and she kicks the energy of the film off to a good start.\nGena Rowlandâ??s performance is also an effective one, largely because of her confidence and because of the strong comic charisma that she shares with Winona Ryder as the characters unfold on the screen. Gena Rowlands gives a certain sense of wisdom to her character and delivers her lines with grand strength, and so the relationship between her and Winona Ryder give Night on Earth a great start.\nThe second story is rather interesting as well, mainly because of how the actors handle the material. It is a simple story which reminds us of the humane frustration that comes with dealing with a person that cannot do their job properly while also creating a situation in which the audience can easily sympathise with the man who fails to drive his taxi well enough or take directions intelligently due to his lack of strong understanding of the English language. This part of the film depicts the cultural difference between Germany and America and is full of interesting characters, and the way the actors interact with each other is so real that it is easy to feel the same thing as the characters and have a laugh in the process.\nArmin Mueller-Stahl manages to perfectly depict the archetype of the annoying foreigner who fails to do his job correctly, but he manages to charm audiences into easily sympathising for him with an emotional line delivery and a general sense of friendliness. Armin Muerller-Stahl takes on the role with ease and makes himself a strong presence.\nGiancarlo Esposito who would later take on the unforgettable role of Gustavo â??Gusâ?? Fring in Breaking Bad gives a performance a lot different in Night on Earth. I didnâ??t even recognise him as being the same actor in both roles because his less restrained performance in Night on Earth unleashes his natural acting charisma which is easy for audiences to connect to. His conveying of frustration is done with ease and natural acting strength, and his chemistry with Armin Mueller-Stahl is the source of much laughter.\nAnd eventually Rosie Perez enters the picture, and her natural hilarious energy manages to make her a genial presence that results in making the scene all the more appealing. It gets funnier the second her voice is heard simply because ever since White Men Canâ??t Jump I have learned to associate her voice with comedic material, and I found her naturally funny all over again.\nThe story sort of takes a slight dip in quality by the third section of the film simply because it becomes very repetitive. The first half is mainly obnoxious characters pushing the limits of a taxi driver until he kicks them out, followed by a tense discussion with a blind woman. While we get some kind of insight into her, there isnâ??t too much and this section of the film simply isnâ??t as intelligent or entertaining as the previous ones had been. And while the performances of both Isaach de Bankole and Beatrice Dalle are effective, the strength of this scene simply is not as effective as the preceding scenes and proves to be a letdown.\nThe fourth segment in the movie takes on the story of a man suddenly confessing all his sins to a priest. This scene had the potential to be both a deep and meaningful situation and a comedic one, and it chooses to be the latter which neglects the potential for its dramatic depth and tries to play things out comedically. But it isnâ??t as funny as you may hope which is a shame because it has Roberto Benigni as the main actor in the scene. It has its funny moments because of him, but it is stretched out for a bit long and pushes the limits a bit. This scene isnâ??t too impressive, but it serves as a great front for the immense acting talents of Roberto Benigni.\nI always believed that Roberto Benigni is the greatest Italian actor of all time because his lead performance in La Vita e Bella is the single greatest acting performance I have ever seen in anything ever in my entire life, and he deservingly won the Academy Award for Best Actor for the efforts of his performance. The entire scene revolves mostly around his ability to give a soliloquy with confidence and ease, and while the scene itself isnâ??t perhaps as entertaining and insightful as it could have been, the performance of Roberto Benigni is a powerful and dedicated testament to his ability to hold the screen. Roberto Benigniâ??s quick wit and sharp line delivery ensures that he gives a powerful performance, and it is just terrific to see him working with Jim Jarmusch.\nPaolo Bonacelli also gives a decent effort in this scene.\nThe final story of Night on Earth chronicles three men attempting to hep their drunken friend after he has been fired from his job and chased out of his house by his wife with a knife over in Helsinki. As his two friends consider the sad reality of the situation, the cab driver tells them a story of real sadness. The driving force of the effect in this scene is the performance of Matti Pellonpaa. \nMatti Pellonpaa skilful soliloquy of sadness made me forget that he was an actor because everything simply happened to genuinely. He simply said his lines as if they were on his mind, not as if he had to think about them and learn them. The true strength in his monologue is a powerful thing and is full of powerful emotions, so it is difficult not to walk away from the final scene in Night in Hearth having felt the saddening effect of a poor man's suffering attempts to become a father, and Matti Pellonpaa's lead performance in the role is flawless.\nAnd the film ends on the same note it started on, with a Tom Waits musical piece.\n\nSo Night on Earth has some hits and misses depending on how the audience appreciates one vignette over the next, but the strength of the actors and Jim Jarmusch's iconic style is all too real in Night on Earth.",
            "review_date": "2014-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "entertaining,real, and sometimes humorous dialogue with 5 different taxi drivers and customers around the world.",
            "review_date": "2014-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Night on Earth\" is another anthology film from Jim Jarmusch, much like \"Mystery Train\" before it, and the collection of shorts that eventually became \"Coffee & Cigarettes\". For what its worth this film is great, featuring five stories about nighttime taxi drivers in five different cities throughout the planet...and surprisingly all five stories are good, such a rarity for an anthology film. The film hits all of it's notes perfectly, whether they are funny or sad. Quite good.",
            "review_date": "2014-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is no payoff, there are no lessons; only five taxicab moments and five cities in the dead of night. And it is captivating.",
            "review_date": "2014-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The correct order: 2; 4; 3; 5; 1.",
            "review_date": "2013-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Conversations in cabs in LA, New York, Paris, Rome and Helsinki. This is the kind of thing Jim Jarmusch is good at. I liked especially the New York segment, but the others were good too except for the Rome segment, which I found irritating because of Roberto Bengini's character. As a Helsinki native I found the acting in the Helsinki section a bit too soap opera-like (one actor is overacting and another underacting) and the language not to sound like a Helsinki dialect, but I guess it's a bit harder for Jarmusch to direct when he probably doesn't understand the language. That however will probably not bother people who don't speak the language either. I also found it funny how the cab seemed to teleport around town, especially when first driving next to old wooden houses in some more remote part of town, then turning a corner and being next to a 7-storey building downtown. I'm sure this happened in the other cities too.",
            "review_date": "2013-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Minimalist filmmaking captures much more than it normally does in Jim Jarmusch's 1991 film, a look at five different people getting five different cab rides with five different cab drivers in five different cities. Some of them learn something, some of them commit unintentional murder, some barely accomplish anything, but what all these stories have in common is pure humanity, some good, some bad, some comical. Jarmusch accomplishes a panorama of human nature through a common motif (taxi cabs) and does this with wit, drama, and sheer oddness. Interesting and worth the effort.",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one for the history book",
            "review_date": "2013-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Known about this movie for a while finally got around to seeing it, nothing amazing or life changing just 5 good, interesting stories. even more reason for me to be a Jim Jarmusch fan",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this guy Jim Jarmusch, highly recommended without much words",
            "review_date": "2013-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Jarmusch film which follows five taxi cabs throughout the U.S. and Europe. Despite the visuals being simple and even pale they were blended in perfectly to the surroundings. The dialogue included plenty of hysterical moments. This is the only second film I've seen of Jarmusch (first being Dead Man) and I highly prefer this one. The way this movie was broken up into five short films made it move fast, and keep its up beat character. The acting was genuine, and the two I'd praise the most are Gena Rowlands and Beatrice Dalle. My favorite scene didn't feature either though, and that one is Rome. This one included Roberto Benigni who kept the perverted comedy going in a laugh riot scene.\n3.5 stars++",
            "review_date": "2013-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favourite films.",
            "review_date": "2013-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple. Hysterical. Touching. Crazy. Long live Jim",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Each vignette in 'Night on Earth' works towards its own unique goal, crafting a tonally varied but cohesive film that skillfully explores some of the many interesting ways us humans communicate with---and come to understand---one another and ourselves.",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful examination of human interaction, hilarious, melancholy, and everything in between. Jarmusch is a master at his craft.",
            "review_date": "2013-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the series of vignettes.  Nothing elaborate or complicated... simply a look into life during a cab ride taking place at different points in the world, all at the same time.  It's a great compilation that explores life , life situations and the way individuals deal with the hand dealt to them.",
            "review_date": "2012-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jarmusch is my favorite entertainer ever ..my best companion when i`m not feeling good , this film takes u on a tour  to five different cities in a taxi while enjoying some interesting dialogues between the taxi drivers and their passengers  , all i can say that u will laugh ur a.. out , u will cry and u will sure love every single moment of this film ..go watch it",
            "review_date": "2012-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw the film in MOJO and I want to see it again.",
            "review_date": "2012-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first great film to come from Jim Jarmusch. With an excellent cast (Rowlands, Ryder, Esposito, De Bankolé and Benigni being the best) and great dialogues, this is a total success: most segments grab you immediately and even the ones that don't surely make up for it in the end. Laughs, sadness and humanity.",
            "review_date": "2012-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun film to watch.  I enjoy the 5 different taxi drivers and their experiences",
            "review_date": "2012-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disposable bonds between strangers displayed in absolutely magificent way. Jarmusch in great shape.",
            "review_date": "2012-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch once said he doesn't interested in dramatic moments in life, this movie is the perfect example of it. Just random people in random situations, but that's exactly what's so romantic about this movie. It feels so intimate and exciting at the same time. And oh, Roberto Benigni in Rome segment, priceless.",
            "review_date": "2012-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A delightful cross-cultural nocturnal community. It will make you think differently the next time you get into a cab. Solid deadpan vignettes from Jarmusch and company.",
            "review_date": "2012-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome.  A directorial masterpiece.  How many directors can do 5 stories in 4 different languages?",
            "review_date": "2012-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this at the DIA. Try and see something there it's nice",
            "review_date": "2012-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspirational piece of work!\nJim Jarmusch is just brilliant!",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice movie. Winona Ryder and Roberto Benigni are adorable in it!",
            "review_date": "2012-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totaly fucked up movie. I like it. Benigni the most. But every story have it's spell. I just forget how pristine and authentic movies was 20 years ago. No hight tech special effects, intrusive music, quick-cut editing, stupid dialogs, sound effects... A pure and simple movie based on strong story and meaningfull dialogs. Even cars had genuine sound (I know for all three european models involved). \n\nI miss that kind of simple and effective movies. I like it. Maybe I should give 5 stars for that.",
            "review_date": "2012-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another early attempt at a movie of several pieces to make a whole. This is unique in that one director - Jim Jarmusch is at the helm. The results are varried. I think it starts off with a poor piece with Winona Ryder and the Finn ending is far too dark as a conclusion. The highlight is Roberto Benigni's ride with a priest.",
            "review_date": "2012-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "**** out of ****\r\n\r\nJim Jarmusch understands human beings. The way I see it, he has lived out his life observing them; forever fascinated by the things they say, the ways in which they move, and how they think. A born filmmaker; he brings his general interest in mankind to the screen with much passion. It's what he's been doing since \"Stranger Than Paradise\" and \"Mystery Train\"; and it's what he's doing in \"Night on Earth\" - which is one of my personal favorites from the director. It's an anthology film told in five acts; each one bearing both differences and similarities in both setting and characters (they all take place in taxi cabs and depict the relationship/bond shared between driver and passenger). This is not much unlike \"Mystery Train\"; which only took about three separate anthology pieces to tell the story - but at least it doesn't feel as if Jarmusch is filling his vision to the top with ideas that he can't properly execute. He has one main focus and his grasp is - to say the least - rather tight.\r\n\r\nPart one of five - the driver is Corky (Winona Ryder), the passenger is Hollywood executive Victoria Snelling (Gena Rowlands), and the city is Los Angeles. When the journey begins, it is the evening; the taxi ride goes well into the night. Since there isn't much to do in a cab (unless you've got a cellular phone, like Victoria does *shocker*); the two women decide to engage in some prolonged, thoughtful chats. Initially off-put by Corky's tomboyish and often times unfiltered - vulgar - attitude; Victoria soon learns to appreciate the youngster, and once they arrive at their destination, Jarmusch finds it the perfect moment for an honest, all too human end-of-the-road dialogue exchange between these two characters; and for the night, it shall be their last.\r\n\r\nThe city is now New York. A determined black man - whose name is revealed to be \"Yo Yo\" (Giancarlo Esposito) - calls for just a single cab to pick him up, even when the city that never sleeps happens to be filled with them. Not one will pick him up; it's most likely a racial thing, in this instance. But then, one taxi pulls over and the driver - an older man with the peculiar name of Helmut Grokenberger (Armin Mueller-Stahl) - offers Yo Yo a lift. He accepts, but then considers declining the offer any further when he discovers the position of his driver; an immigrant from Slovakia with little experience as a taxi driver and much more as a clown in his homeland. Like the first unlikely two taxi-occupants, these two get increasingly bored over time and find solace in each-other through conversation. And as can be expected from Jarmusch - a talented and inspired storyteller - the dialogue is engaging.\r\n\r\nSmack dab in the middle we've got Paris, France. We open on the driver (Isaach De Bankole) - who goes unnamed - as he is harassed by two businessmen, and think of it, in the comfort of his own cab! He kicks them out, leaves them in the streets, and looks for new business; ultimately finding it in a blind woman (Beatrice Dalle), with whom he would much like to swap personal life philosophies. But she's a tough cookie; and it isn't going to be particularly easy to reach her. The driver - who is from the Ivory Coast - will find that the racial gap between the two is larger and far more significant than initially predicted.\r\n\r\nNext to last, we end up in Rome, Italy. From the clocks that are shown between each individual segment (and in the beginning of the film), we learn that it is early morning. The cab driver in the fourth part of the story is Gino (Roberto Benigni). He spends his nights and early mornings having lonely - but very funny - conversations with the two-way radio; in which he describes disturbing - but again, quite amusing - sexual fantasies. After his first attempt at this, he finally finds himself a customer; a priest (Paolo Bonacelli). Things just get even weirder than they already were once the priest steps into the cab; as Gino decides this would be a good time to confess his sins to the holy man - some of which include sexual encounters with pumpkins and sheep, and a romantic affair with his brother's wife. His description of such things proves too much for the priest; in the end leaving the driver in a sticky situation.\r\n\r\nFinally, we arrive in Helsinki; where taxi driver Mika (Matt Pellonpaa) feels as desolate and alone as any cab driver working the late night shift; that is until he assigns himself to picking up three good ol' boys. And while one of them is far from OK mentally or physically, they're still, well, good ol' boys. You see, the one who isn't quite right has just had the worst day of his life; he lost his job, his car, his wife, and his daughter is pregnant. It would seem that his buddies tried to aid him and ultimately drowned their collective sorrows in alcohol; which, as we can see, lead to not much of anything at all. However, in telling their friend's sad story; Mika decides to share his own, which is melancholic on a whole new level - but at the same time, entirely heartfelt. \r\n\r\nI've said too much about each fifth that makes up the film's plot; I just couldn't help myself. Now you know all that you NEED to know if you plan on watching this film; which is, in my opinion, a triumph in the understanding of human nature. The dialogue is rich and very...real. The situation are believable and often times, they have some sort of payoff which comes in both the emotional and intellectual variety. As with the best films from writer-director Jarmusch; \"Night on Earth\" has a philosophy and a purpose, both of which run deep in spite of the lack of a \"moral message\". But...must all films have one? I don't think so; of course, a pointless film is needless, but one that is good on its own without a distraction of message-making is just fine by me. For fans of Jarmusch, this one pulls very few punches; it's what you'd expect from one of modern independent cinema's pioneers. You will either find each segment intoxicating and involving or slow and plodding. But that is, ultimately, where the beauty is at.",
            "review_date": "2011-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first two vignettes didn't really do it for me. But the one set in Paris with Isaach De Bankole and Beatrice Dalle is absolute bliss! And the follow up to that is Roberto Benigni in a hilarious one man show. The stories aren't intertwined or wrapped up all tidy. Just 5 stories of 5 sets of people in different parts of the world and how the night lets you unwind and shed your armor.",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not much happens, yet a lot happens.",
            "review_date": "2011-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a series of five entertaining vignettes, all with great performances (especially from Giancarlo Esposito, Winona Ryder, and Armin Mueller-Stahl) and interesting writing.  There are funny moments, touching moments, intense moments, everything.  It's a pretty cool idea, though some segments are better than others.  However, these shorts are good, but they just don't have the effects of five different fully-realized stories.  Also, near the end all the dialogue starts to wear you out.  Still, this is pretty good.",
            "review_date": "2011-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch this entirely because of the Helsinki part, but the other segments are bittersweet too.",
            "review_date": "2011-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely original and brilliantly written.",
            "review_date": "2011-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With this collection of shorts Jarmusch still has done no wrong. I especially love the first sequence with Gena Rowlands and Winona Ryder as well as the sequence with Giancarlo Esposito and Rosie Perez.",
            "review_date": "2011-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not a big fan of Jim Jarmusch, but I really liked what he did with this film.  He seemed to really understand each of the cities his stories were centered in, even the ones in foreign countries.  All the acting was great and I liked each of the segments equally, but I have a bit of a preference for the one with Roberto Benigni in Rome.",
            "review_date": "2011-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 cities. 5 cab rides. 5 stories. All at exactly the same time.\n\nI have mixed feelings about Jim Jarmusch's films. I enjoyed parts of Coffee and Cigarettes and I loved the directorial style and photography but I found Broken Flowers extremely tedious and uninspiring (despite the amazing cast).\n\nNight on Earth, however, was really good. Surprisingly funny, poignant and tragic all at once. A simple (and somewhat overdone) idea executed to perfection. Yes, some stories are better than others.\n\nNew York was my favourite with an unexpected connection between Brooklynite Yo-Yo and East German Helmut and so many laugh-out-loud moments.\n\nL.A. was also notable for Winona Ryder and Gena Rowlands on-screen chemistry. It just felt like such a genuine little look into the lives of two very different people and the brief time when their lives crossed.",
            "review_date": "2011-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot more intriguing than it seems it should be.",
            "review_date": "2011-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of Jarmusch. I laughed my ass off in the Rome episode. Roberto Benigni was fabulous. The other parts were good too. Characters were identified perfectly through the script and filming. The cities had a character too, and I don't think anyone other than Jarmusch can assign one person to these cities, all so different and similar in some ways. It was great, a must see for all Jarmusch fans.",
            "review_date": "2011-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1. Los Angeles - I can see Winona Ryder as a female version of Bill or Ted (Yes, that franchise.), Beavis or Butt-Head with just a few more braincells... Her character is an idiot for not taking that offer, tho.\n\n2. New York - The spirit of \"The Jerry Springer Show\" in all its glory. The second best of the five segment's.\n\n3. Paris - In all of the other segment's the driver's seemed to talk more. In this one the driver is almost mute. More character development would have proved useful, I suspect. The brunette is quite attractive, disability or no.\n\n4. Rome - The funniest segment by far, Benigni talked about some of the most disgusting thing's that I just did not want to hear.. and the \"padre's\" reaction's were spot on perfect! No wonder the padre, the poor bastard, had a heart attack, or something... The death scene was completely unrealistic, tho. Seeing his face move, his eye's popping back open, I kept expecting, after the driver left, the padre to look around, chuckle and then mumble to himself that although he had to listen to that idiot ramble at least he didn't have to pay for the fare and he got a free pair of sunglasses, too. \n\n5. Helsinki - Depressing!\n\n\nAlthough this is a film that is a character driven story, there were wasn't much character development; not enough of it at least to drive the story the way that a character driven story should be. Jim Jarmusch, the director of this film, was quoted as saying ... \"The beauty of life is in small details, not in big events\". You can watch Night on Earth to understand what he meant by that. Honestly, I prefer \"Taxicab Confession's\", the HBO series.",
            "review_date": "2011-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very fun film, full of everything, wit, subtlety, silliness, drama, insight, all the great aspects of storytelling. I liked the Italian and New York stories the best. I was also impressed at the way Jarmusch makes a point of portraying so many different personalities and races and how he handles them so deftly.",
            "review_date": "2011-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well directed and and unique film. Acting and scripting was nicely done and the flow from one vignette to the next went surprisingly well!\n\n  I liked Rome the best from a comedic standpoint but the Helsinki segment taught a wonderful lesson on life. \"It would always be worse no matter how bad you think you have it!\"",
            "review_date": "2011-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't expect to be this good!",
            "review_date": "2011-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of it is really good but some is very bad too but there are worse ways to spend two hours.",
            "review_date": "2011-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Five different taxi rides in different cities in one night.",
            "review_date": "2011-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is fantastic, the character development between each scene is crazy good. Jarmusch never lets down and will continue with fantastic movies!",
            "review_date": "2011-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Jarmusch solves this difficult equation with great lightness, because he is an experimentalist hiding behind an intimate poet with a serious talent for jokes.",
            "review_date": "2011-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice film about 5 different cultures or stereotypes across the world! Funny and nice artistic feel.",
            "review_date": "2011-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slick, charming and extremely watchable taxi cab vignettes set in 5 cities around the world, all of which are excellent; the Helsinki segment perfectly captures the pathetic drunken Russo-Scandinavian lifestyle and attitude, albeit with deeply soulful undercurrents... It is Benigni, however, who steals the show in the Roman episode with his classic, unforgettably hilarious and depraved confessions to his priest passenger",
            "review_date": "2011-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I so don't believe Winona Ryder as a cab driver but I think that's the point.",
            "review_date": "2011-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and funny.",
            "review_date": "2011-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have loved this movie for years and years.  The actors, the music, the overall style...  My favorite segments have changed over the years--I used to love Rome and Paris the best but now I'm more Helsinki...but ahh well.  \r\nThis one is always fun to watch.  Thank you Jim!",
            "review_date": "2011-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "NIGHT ON EARTH (1991), the fourth film by American auteur Jim Jarmusch, is a series of vignettes centered around taxi journeys in the US and Europe over a single winter night. There is no overarching plot, but rather each segment is a study in interaction between the driver and his fare.\n\nIn Los Angeles, Winona Ryder is a 16 year-old tomboy taxi driver and Gena Rowland is a Hollywood casting agent. In New York, Armin Mueller-Stahl is an immigrant from East Germany who gets a crash course on American culture after he takes Giancarlo Esposito and Rosie Perez to Brooklyn. Crossing the Atlantic, we first go to Paris where Isaac de Bankole, an Ivorian immigrant who faces the challenge of racism daily, picks up blind woman Béatrice Dalle who could care less what colour his skin is.\n\nThe last two segments are less about class or race and more humorous and individual. In Rome, Roberto Benigni finds an opportunity to confess a long list of sins after he picks up priest Paolo Bonacelli. This is a hilarious scene, the best part of the film. In Helsinki, Matti Pellonpää brings three drunks home (Kari Väänänen, Sakari Kuosmanen, and Tomi Salmela), but after they bemoan their misfortune, he tells them what real suffering is. \n\nFor the most part, this is one of Jarmusch's weakest films. There is that inconsistency between the study of power hierarchies and the straight-up comedy. The Paris segment is nothing but cliches about how the blind might not see, but their other senses are more powerful than the sighted. The New York and Helsinki segments are hommages to Jarmusch's peers Spike Lee and Aki Kaurismaki respectively, using their settings and borrowing some of their actors. While the New York scene has Jarmusch's characteristic humour, Jarmusch's style is almost completely effaced in the Helsinki scene and one could believe he's watching a Kaurismaki film.\n\nBut oddly, I still feel compelled to give this film a universal recommendation, as the Benigni scene is great. Here the Italian actor is at his best with his trademark rhetoric and -- suprisingly, considering he's behind a steering wheel the whole time -- his skills at physical comedy.",
            "review_date": "2011-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An anthology of 5 different cab drivers in 5 American and European cities and their remarkable fares on the same eventful night. This movie is proof of Jarmusch's genius.",
            "review_date": "2011-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Jarmusch's five-chapter anthology is a hit-and-miss affair which starts well with the Davis/Ryder and Perez/Esposito episodes but had me reaching for the remote as Benigni's irritating Chaplin-on-crack cabbie began to hit his stride. While NoE has some warm and intimate glimpses into the human situation, too many of its themes are either over-emphasised (particularly the Paris sequence) or left unexplored. A bumpy ride that takes the long way round. Don't leave a tip.",
            "review_date": "2011-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had mixed feelings about the \"confession\" sequence in Rome, but otherwise Jim Jarmusch yet again proves his unrelenting talent as a (true) independent filmmaker in this great movie.",
            "review_date": "2011-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i had high hopes for this considering all the glowing reviews, however, this dull \"night\" failed to fulfill my expectations.  it's essentially five short films with nothing in common except the mode of transportation and the interactions of the drivers and passengers. i just didn't find the vast majority of these characters interesting.   the best of the five: rome, benigni (bravo).  the worst of the five: new york, rosie perez gets to expand her vocabulary...not!\npithy review: catch a ride on another jarmusch vehicle, eg: broken flowers, dead man or even the limits of control..",
            "review_date": "2011-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well done story telling of life's mundane details. Enjoyed watching this blast from the past. Pretty funny, made me LOL.",
            "review_date": "2011-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All five stories were amazing, each in its own way. Simple and complex at the same time. Loved it.",
            "review_date": "2011-02-14",
            "source": "rt",
            "lang": "en"
        }
    ]
}