{
    "rating": 9.2,
    "release_date": "1992-12-23",
    "num_reviews": 230,
    "genres": [
        "Drama"
    ],
    "summary": "Frank is a retired Lt. Col. in the US army. He's blind and impossible to get along with. Charlie is at school and is looking forward to going to college. To help pay for a trip home for Christmas, he agrees to look after Frank over Thanksgiving. Frank's niece says this will be easy money, but she didn't reckon on Frank spending his Thanksgiving in New York.",
    "reviews": [
        {
            "content": "Great movie and performance from Al Pacino.",
            "review_date": "2023-04-03",
            "source": "rt"
        },
        {
            "content": "Essential 90s film. The setting, the costumes, the mindsets: all totally 90s.  I used this film as a time machine; bring back the khakis!",
            "review_date": "2023-03-31",
            "source": "rt"
        },
        {
            "content": "Great movie. Very interested. Al Pacino did a really great job on his acting for the movie. ",
            "review_date": "2023-01-16",
            "source": "rt"
        },
        {
            "content": "Stunning performance by Al Pacino, movie to remember from the early 90's. The speech Lt Col Frank Slade (Pacino) delivers at  Baird school towards the end is one of the most iconic sequences that showcases courage, grit and motivation.",
            "review_date": "2022-12-27",
            "source": "rt"
        },
        {
            "content": "Great movie with an amazing performance by Al",
            "review_date": "2022-12-25",
            "source": "rt"
        },
        {
            "content": "Well acted and entertaining movie that suffers from being too long towards the end.  Al Pacino is brilliant as Lt. Col. Frank Slade, who looks to have one last, great Thanksgiving weekend while Chris O'Donnell is nicely matched as his sweet caretaker.  They play off each other well, with both giving life lessons.  Behind the camera, director Martin Brest does mostly a good job adapting the original Italian film but goes for too long at over 2 hours and 30 minutes, and easily could have been cut down.  Nevertheless, when the movie shines, it is fantastic, from the tango scene to Slade's brilliant speech at the end.  Plus, since it takes place during Thanksgiving, a solid holiday film.",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "Wow this movie is just so beautiful, if it dose not touch you, then your heart must be made of stone. Director Martin Brest has made some absolute classics including Midnight run (another masterpiece) but this movie stands with it. \n\nThe chemistry between Al Pachino and Chris O Donnell is just magic, and a nuanced performence by the great Phillip Seymour Hoffman his expressions are just brilliant and on point! Believe me  it's a movie you can watch a thousand times and never get bored. \n\nAlso the music by Thomas Newman sets the tone of the movie perfectly,  heavenly harps, concerto strings, tango, it is like a beautiful floating dream. And the cinematography a warm blanket.\n\nThe blind Colonel is at a bitter low, he has given up, then Charlie boy enters his life, they go on a road trip and discoveries are made. We can all do with a good friend. Integrity that is what is truly important,  and most of all never give up and never stop enjoying the things you love, including the scent of a beautiful woman!\n\nEnjoy the ride, this movies will stay with you. No need to say anymore, just watch it.",
            "review_date": "2022-11-27",
            "source": "rt"
        },
        {
            "content": "a thanksgiving movie with blind Al Pacino",
            "review_date": "2022-11-15",
            "source": "rt"
        },
        {
            "content": "It's hard to decide where to start when talking about the Martin Brest movie which not only follows the details, but also the details of the details. In short, Scent of a Woman is in its own world, and every other movie in another world.\n\nIn the only picture that won him an Oscar, Al Pacino plays the blind Lieutenant Colonel Frank Slade, so meticulously that it results in an oxymoron characterized by the fact that all eyes are on him (quite literally, as seen in the movie).\n\nIt's hard for a scene with Pacino in it not to drag all focus towards him; it's a pure Pacino movie, where he pours every talent he had previously shown and adds even more above that.\n\nProbably only Audrey Hepburn came close to this perfectionism in portraying a blind person, in the movie Wait Until Dark (1967). If Hepburn's role was unbelievable, then Pacino's is metaphysical, to the extent the audience could almost be convinced the actor is actually blind.\n\nPacino uses every form of expression possible, from facial expressions to body language to tone of voice to the eloquent personality, to the superb ability to identify the scent of a woman.\n\nMartin Brest's direction is the cherry on top, and what better example than the famous Ferrari scene or the magical tango scene. Above all, the movie explores the subliminal psychological and emotional factors, with outright criticism of high-class educational institutions.\n\n\"There was a time I could see, annd I have seen boys like these, younger than these, their arms torn out, their legs ripped off. But there isn't nothin' like the sight of an amputated spirit; there is no prosthetic for that.\" – Frank Slade.",
            "review_date": "2022-10-17",
            "source": "rt"
        },
        {
            "content": "Al Pacino really won an Oscar for this performance?\n\nDirector Martin Brest's coming of age drama Scent of a Woman (1992) has aged very strangely. There's charming humor as we hang out with Al Pacino's rude, yelling veteran in an insane performance, but he's also a sleazy sexist and obnoxious jerk that's so over the top, you kind of hate him too.\n\nBrest's direction is so bland that Scent of a Woman is held up by Pacino entirely. It's like a poor man's Dead Poets Society, but a better Finding Forrester, I guess. I hate how writers Bo Goldman and Giovanni Arpino grossly mess an endearing story of a suicidal veteran worn out by life's hardships from being blind and lonely with a goofy coming of age comedy premise of a poor student having to rat on his awful rich friends. These two narratives do not work well together at all.\n\nAlso, why is Scent of a Woman 156 minutes long? It could have been half that length because very little happens really. Editors Michael Tronick, William Steinkamp, and Harvey Rosenstock allow scenes to play out naturally, but could have cut Scent of a Woman down by an hour and you would be able to enjoy it easier. Donald E. Thorin's medium shots of Al Pacino are engrossing as he just holds on striking framing to let Pacino's performance breathe.\n\nChris O'Donnell looks like a young Tom Cruise here in a very endearing and soft spoken performance. He just gets out acted by Pacino's raging bull of a man though. I thought O'Donnell was very emotional and impressive, but not in Pacino's league. James Rebhorn is intimidating as the scumbag head of the college. I hate how his entire character is centered around a luxury car gifted by the school board that gets paint on it as a prank and that's the basis for the scandal. It's the dumbest joke that gets taken too far and somehow has an entire punitive commission appointed to this non-issue. What a terrible idea for a movie.\n\nAl Pacino is entertaining, frustrating, hilarious, shocking, scary, and charming all in one bizarre turn. His big speech in the end is rousing, if absurd to deliver at a prestigious college. His tango dance is fun and his wallowing in misery is poignant. Al Pacino tears you a new one with his ferocious acting, but also starts doing his annoying catchphrase of \"Woo Hah!\" here in Scent of a Woman. Denzel Washington in Malcolm X or Robert Downey Jr. in Chaplin should have won Best Actor that year!\n\nGabrielle Anwar gets to dance the tango with Al Pacino, but her role is merely a short, charming cameo. Philip Seymour Hoffman gets a few lines as the scumbag rich \"friend\" who only looks out for himself and covers for his awful elitist pals. Bradley Whitford gets a strong showing as Pacino's nephew who loathes him for his past disgraces in the army and crude manners. The entire rest of the cast is wasted or gets washed by Al Pacino steam rolling over them all.\n\nComposer Thomas Newman's symphonic score is very touching and pretty, if incredibly manipulative and melodramatic. It sounds exactly like the score for a melodramatic movie like Scent of a Woman would have here. You know every melody before the songs even play. All the costumes and make-up look slick, especially Pacino's tailored suits, but most of the costumes are simple uniforms.\n\nIn all, Scent of a Woman is a finely made film, but a baffling film of life advice and moral questions. Al Pacino's acting is the only ageless quality as he is captivating, but surely overrated here as he's insanely overacting every scene. There's nuance to his work as Pacino is a top tier actor, but his random outbursts get tiresome, while his ethical advice feels sincere and thoughtful.",
            "review_date": "2022-09-27",
            "source": "rt"
        },
        {
            "content": "Absolute Perfection!",
            "review_date": "2022-08-13",
            "source": "rt"
        },
        {
            "content": "Incredible performance from Pacino, but the ending left something to be desired in living out the theme without being such a 180 for the character",
            "review_date": "2022-05-25",
            "source": "rt"
        },
        {
            "content": "My main man randy gets put in a ranger chokehold.",
            "review_date": "2022-05-24",
            "source": "rt"
        },
        {
            "content": "A little bit too much runtime for the message the movie wants to portray but a  message about respect and care, nonetheless.",
            "review_date": "2022-04-10",
            "source": "rt"
        },
        {
            "content": "Can't believe he died in the end. Crazy twist",
            "review_date": "2022-03-06",
            "source": "rt"
        },
        {
            "content": "두 말하면 입 아프죠~\n최고의 영화 중 하나입니다.",
            "review_date": "2022-01-16",
            "source": "rt"
        },
        {
            "content": "This movie is always going to be defined by the incredible performance that finally got Pacino on the Oscar board, however the acting across the board is phenomenal, with the real heart of the movie coming from the wonderful chemistry from the two leads. O'Donnell turns in a career best in this movie as well. Brest proves that when he's on, he's on.",
            "review_date": "2022-01-07",
            "source": "rt"
        },
        {
            "content": "Al Pacino gives the best from himself, but the film as a film never really worked for me, I found it generic and with a disappointing sense of familiarity.",
            "review_date": "2021-11-26",
            "source": "rt"
        },
        {
            "content": "Alguns atores podem estar no pior filme do mundo e o tornaram grandes em todas as vezes que eles surgirem na tela. Esse é o caso de qualquer filme com Al Pacino, nesse filme que por si só, já é maravilhoso",
            "review_date": "2021-11-24",
            "source": "rt"
        },
        {
            "content": "Watch it for the tango alone.",
            "review_date": "2021-11-22",
            "source": "rt"
        },
        {
            "content": "Hoo-ha! that smells rotten. Al Pacino does great acting, the story is bad. The ending brings it all together, but I dislike movies where you have to wait for the ending to finally like it.",
            "review_date": "2021-09-20",
            "source": "rt"
        },
        {
            "content": "Watched Scent of a Woman after a friend of mine recommended it to me. At first, I ignored his recommendation as I doesn't wanted to watch a drama movie but now, here I am.\n\nThis movie is pure beauty. Movie is not perfect but thanks to oscar winning performance by Al Pacino, this movie feels perfect. The way he gave his performance, you can't lay eyes of him. He overshadowed all the co-actors. There were some problem with the movie's length. It felt half an hour long. They could have trimmed it to make it half hour short. But your overall experience doesn't get affected.\n\nOverall, a great piece of work and brilliant acting by Al Pacino (for this role, he won his first Oscars). Would definitely recommend it to drama lovers.",
            "review_date": "2021-08-14",
            "source": "rt"
        },
        {
            "content": "Unbelievable performance by Pacino. I truly think it was his best. I would go out on a limb and say a top 10 acting performance of all time. He absolutely killed it. ",
            "review_date": "2021-08-13",
            "source": "rt"
        },
        {
            "content": "Timeless! Classic! Al Pacino is great as always! Pacino is a great yeller in movies, btw.",
            "review_date": "2021-08-11",
            "source": "rt"
        },
        {
            "content": "Al Pacino arriva al tanto desiderato Oscar con una performance impeccabile, da dominatore assoluto dello schermo e del film; le sue movenze sono perfette e lo fanno sembrare un cieco dalla nascita, e nel monologo finale si esalta come solo lui sa fare in quelle circostanze.\nPer il resto, nulla di trascendentale ma un film interessante e scorrevole; la differenza di calibro tra i due attori però è talmente evidente da risultare marchiana.",
            "review_date": "2021-07-22",
            "source": "rt"
        },
        {
            "content": "When you watch this particular movie, you will see a spectacular performance from Al Pacino and you will wish to attend Tango courses. The dance sequence was just amazing and very uplifting!! You will wonder about who is the real blind at the end: the retired soldier who is physically blind or the young boy who cannot see the inner mechanism of life which is full with corrupted people.",
            "review_date": "2021-06-23",
            "source": "rt"
        },
        {
            "content": "\"If you got tangled up, tangle on.\"\n\nAmazed by strength of life.",
            "review_date": "2021-06-04",
            "source": "rt"
        },
        {
            "content": "A fantastic performance by both Al Pacino and Chris O' Donnell. If this movie doesn't warm your heart, you need therapy. Great flick.",
            "review_date": "2021-06-02",
            "source": "rt"
        },
        {
            "content": "Hoo-waaaa!\nThis movie is not nearly as good as you remember it. Wake up, reviewers.\nHoo-waaaa!",
            "review_date": "2021-05-24",
            "source": "rt"
        },
        {
            "content": "Al Pacino is just the most entertaining and cool actor there will ever be",
            "review_date": "2021-05-11",
            "source": "rt"
        },
        {
            "content": "Better than most. I liked the idea behind it. I've seen several movies after it that used the same setup to tell the same motivational story.",
            "review_date": "2021-05-01",
            "source": "rt"
        },
        {
            "content": "Scent of a Woman is Al Pacino finest triumph performance is a feel good coming of age film.",
            "review_date": "2021-04-15",
            "source": "rt"
        },
        {
            "content": "Very recommended good acting by pacino love it very much",
            "review_date": "2021-04-02",
            "source": "rt"
        },
        {
            "content": "Chris O'Donnell plays a student at a prep school who takes a weekend job over Thanksgiving to take care of a cantankerous blind veteran played iconically by Al Pacino. Pacino has other plans for him as he takes him on a trip to New York City for a specific plan of events. Pacino is arguably great in this role and specifically his mannerisms have become part of pop culture.  Philip Seymour Hoffman also has a memorable supporting role as a fellow student at the school.   Great film.",
            "review_date": "2021-03-21",
            "source": "rt"
        },
        {
            "content": "An amazing flick. Great message/story",
            "review_date": "2020-12-31",
            "source": "rt"
        },
        {
            "content": "26.10.2020 ---------",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "Al Pacino's performance in this is still severely underrated even though he won the oscar.",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "Al Pacino is electric and gives one of the best performances of his career. Chris O'Donnell's performance was nearly just as strong as Pacino's. O'Donnell does a fantastic job of capturing the obedient, low-income upbrought and coming of age nature of his role. Beyond that, the premise of the story seems rather forced and accelerated once Pacino makes his entrance, but this off-putting element reveals its purpose as this film's dramatic and touching story unfolds and satisfactorily concludes. Not a moment is being wasted enjoying this excellent film.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "Loved it! Al Pacino is an amazing actor!",
            "review_date": "2020-12-14",
            "source": "rt"
        },
        {
            "content": "One of the best movies I’ve ever seen. The originality and aesthetic qualities are incomparable. ",
            "review_date": "2020-12-07",
            "source": "rt"
        },
        {
            "content": "You know after along time for finding my favourite actor...\nIt's al pacinoooooooo❤️",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "Though it's a little too long, and I thought the ending was, for lack of a better word, a little corny, Scent of a Woman is a charming movie with a fantastic performance by Al Pacino in his only Oscar-winning role and his chemistry with Chris O'Donnell and the movie's themes on integrity elevate the movie.",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "This is one of those movies that has multiple memorable scenes. I find myself rewinding and watching them each time I rewatch the movie.",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies ever made.The gist of the movie is whether Charlie will sellout to buy his future. He comes close at the end but looks at Frank and keeps his integrity by not saying who the clowns were that pulled the prank. Charlie thought his future was doomed but ol Frank comes through at the end with a legendary speech. Must watch.",
            "review_date": "2020-11-02",
            "source": "rt"
        },
        {
            "content": "Absolutely amazing movie, keeps you entertained throughout the whole film, a must watch, do not miss out on this one!",
            "review_date": "2020-10-12",
            "source": "rt"
        },
        {
            "content": "One of the great movies in film history.  Truly an uplifting story.",
            "review_date": "2020-10-09",
            "source": "rt"
        },
        {
            "content": "The performance of Pacino was perhaps more captivating than the script... but the story has enough substance to keep you engaged, and certainly entertained, despite its unapologetic descent into a predictable ending.",
            "review_date": "2020-10-01",
            "source": "rt"
        },
        {
            "content": "Really beautiful, well-written, and powerfully acted, especially from Pacino",
            "review_date": "2020-07-29",
            "source": "rt"
        },
        {
            "content": "Its story is a little predictable, but it's a mix of coming of age and drama about old age that it's perfectly executed, with a sentimental and emotional narrative, a poignant script, and a talented cast, from which shines an over-the-top, sympathetic and award winning lead performance from Al Pacino.",
            "review_date": "2020-07-22",
            "source": "rt"
        },
        {
            "content": "Es una película muy buena, Al Pacino es un gran actor y brinda mucha energía en la película.",
            "review_date": "2020-07-18",
            "source": "rt"
        },
        {
            "content": "Incrivelmente bem escrito, profundo na mensagem que passa. Fantástica actuação Al Pacino.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "Great performances and an engaging story. It is a lot of fun.",
            "review_date": "2020-07-10",
            "source": "rt"
        },
        {
            "content": "Amazing performance by Al Pacino, but the movie itself is very average.  When Al Pacino is not on the screen, this movie is very boring.  Obviously, this is one of his best performances that won him his only Oscar.  It really shows how amazing an actor Al Pacino is.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "It's a predictable story with corny elements, but you're totally invested in the relationship between the two main characters.  Al Pacino and Chris O'Donnell are great.",
            "review_date": "2020-06-25",
            "source": "rt"
        },
        {
            "content": "It's almost perfect. One of the most moving performances ever by Al Pacino.",
            "review_date": "2020-06-07",
            "source": "rt"
        },
        {
            "content": "A very good film with a bit of everything. Al pacinos very highly deserved Oscar.  Obviously the main thing to look for in a film is a great ending and this has it. Also has a superb speech in it. Highly recommend. One reviewer writes Dustin Hoffman deserves his Oscar haha. Did you actually watch the film ian",
            "review_date": "2020-05-26",
            "source": "rt"
        },
        {
            "content": "Have seen this movie 12 times if that says anything.",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "I couldn't connect with it no matter how desperately i tried. the movie was slow and a bit forced at some parts. i guess i just expected more",
            "review_date": "2020-03-20",
            "source": "rt"
        },
        {
            "content": "Really, Pacino won a Oscar for yelling instead of acting?  This movie sucked.  Don't bother.",
            "review_date": "2020-03-13",
            "source": "rt"
        },
        {
            "content": "I knew that Scent of a Woman was a big movie in Al Pacino’s career (it is the only Oscar he has taken home, after all.) What I didn’t know is that it was also ground zero for virtually every single person’s Al Pacino impression. This is what everyone parodies, because this performance is like freebasing Pacino. He is dialed up to 10 almost the entire film, and at times it proved quite difficult to avoid laughing. I know I’m watching a dramatic Pacino performance, but all I can hear are goofy impressions in my head. His character is quite unlikable, and I’m not sure how it is that Chris O’Donnell’s character ever learns to respect him. I can understand the sense of obligation that comes with being a caregiver for someone who is blind, but at a certain point it seems like it would be nearly impossible to keep going with the flow. I think that is a personal problem with me, though, because the movie does a good job of establishing the young student as a man who struggles to stand up for himself in any way. I definitely enjoyed some story elements of Scent of a Woman. The mock trial at the end was right up my alley. In fact, all of the stuff with the school worked well for me, even if it felt like it came from a different film. However, there were a lot of times when the movie was running on rails down expected paths, and I questioned if the long runtime was necessary. Once we know the Colonel’s plans, it’s not hard to guess where the plot is heading. Even the big, dramatic Oscar scene between our two lead actors felt somewhat expected. That’s not to say that all this drama is bad, in fact I was still drawn into the theatrics of it all. In many ways, Scent of a Woman was like seeing a stage show. There isn’t a lot of action in the film, and most of the pivotal scenes take place on a small set with a few actors giving their all to sell the story. I can’t say that this is a show I would line up for or pay a lot to see, but it was a solid theatrical production. And I respect Al Pacino for giving his all to make a truly memorable character (no matter how much that might have led to parody.)",
            "review_date": "2020-01-28",
            "source": "rt"
        },
        {
            "content": "I understand that as one of the greatest actors of all time Al Pacino needed to win an Academy Award at one point or another but did it have to be for his performance in this film. To describe it as scenery chewing would be kind as he is such a caricature of himself that it is almost sad to watch him recycle the old mannerisms and gestures but without any restraint or finesse. Of course the material he is working with is subpar as this film's screenplay contains such gems as \"Hooh-Hah!\" but you would think he could have brought some gravitas and weight to his role. Mystifyingly this film received recognition not only for Pacino but was a serious contender for Best Picture and it's laughable screenplay picked up an undeserved nomination.\n\nAt the prestigious Baird Preparatory School poor student Charlie Simms, Chris O'Donnell, faces expulsion if he does not inform the school's principal of which wealthy students carried out a prank that embarrassed him. He does not believing that snitching is morally correct but the other student that witnessed the event, George Willis, Jr., Philip Seymour Hoffman, is wealthy and can use his father's connections to protect himself leaving Simms in a vulnerable position. He decides to take on the summer job of caring for blind former Colonel Frank Slade, Al Pacino, so that he can fund a trip to visit his family. Complications arise when the cantankerous older man has them travel to New York City and announces to his new companion that he intends to commit suicide after experiencing the luxuries available in the city. Slade's tragic backstory is revealed and the two begin to bond as Simms sees Slade as a surrogate father figure but as Simms questions whether doing the morally correct thing is worth it Slade begins to lose faith in him.\n\nA film so minimal on plot should not have the audacity to be two and a half hours long especially when considering the fact that most of this running time is not filled with character development but rather cutesy scenes that display just how charming and unusual Slade is. Despite the famous tango scene and the blind man driving through the backstreets of New York sequence did not make me laugh or feel uplifted. All of his kooky actions become repetitive and irritating and you aren't really interested in learning what caused him to become blind or why he has no friends. So much of the film is taken up with him carrying out these little detours to various parts of the city and while I don't mind seeing parts of New York the drama occurring on screen during the two hours we spend watching him do this was hardly compelling. We could have had about half an hour of this carry on at most and it would have been less annoying but stretched out for so long it was hard to take.\n\nWhat I was more drawn to was the prep school intrigue, if it could be described that way, as a smarmy Hoffman was delightful to watch and I could relate more to the stresses that Simms was facing. O'Donnell did not make him the most compelling character in the world as his performance mostly consists of him mumbling and voicing his displeasure with the actions of his employer but at least he did not make me want to slap him. The final ‘courtroom scene' if you could call it that was ruined by just how hard Pacino screams some poorly written lines but there were the seeds of some fascinating ideas sowed as the conflict between the poor and the wealthy is always ripe for examination. When you have such sniveling, uptight villains it would have been thrilling to have a better build up to the sight of them being brutally cut down. It is clear when seeing the promotional material for this film that it's producers were far more interested in producing a vehicle for Pacino but he is one of the worst parts of an already dull and annoying movie.\n\nIn 1992's weak Best Picture lineup this stands out as the worst and that is saying something when considering the inclusion of a film like The Crying Game (1992).",
            "review_date": "2020-01-06",
            "source": "rt"
        },
        {
            "content": "It's regularly good drama but Mr Al Pacino took a not normal role and it's success",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "One of the best  movie i have ever seen",
            "review_date": "2019-11-06",
            "source": "rt"
        },
        {
            "content": "A classic. perfect combination of emotion and building up of empathy with a character who is meant to be disliked",
            "review_date": "2019-11-04",
            "source": "rt"
        },
        {
            "content": "The film is about colonel Frank Slade who lost the meaning of life. The film makes you think that the world around you is wonderful and you just need to find the right angle to notice it with its all colors. The protagonist, in spite of the psychological and physical suffering caused by his blindness, still found the way out. And the talented student of the Charlie College helps him with this. Afterward, the lives of these two persons changed and helped them to overcome all their problems.",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "Before watching this film, I was firmly convinced that the best role of Al Pacino was in the film \"The Scarface\". And I highly doubted that the \"Smell of a Woman\" would convince me of this. But he convinced.\n\nGreat story, great characters. The film somehow reminded me of my favorite painting, The Society of Dead Poets, but was able to surpass it. Half of Frank Slade's replicas can be pulled into quotes. And why is there only one legendary scene with tango or that strong monologue at the end? Anyway, any of his monologues.\n\nAbsolutely honored Oscar Al Pacino for Best Actor. It's a pity that it's only the first one, because before this film he had brilliant roles. But even more sorry that the last ...\n\nThe rest of the actors in their place. Chris O'Donnell is in perfect harmony with Al Pacino, and it was nice to see young Philip Seymour Hoffman.\n\nSo, the film \"The Smell of a Woman\" is automatically put on my favorite list and once again I am convinced that Al Pacino is a great actor, and all the best films have already been shot in the last century.",
            "review_date": "2019-10-15",
            "source": "rt"
        },
        {
            "content": "You cannot go wrong with this film, it is heartwarming, funny, and dramatic, the writing is amazing, every cast member put together an amazing performance.  This is one the great films of all time.",
            "review_date": "2019-09-21",
            "source": "rt"
        },
        {
            "content": "Al Pacino's first Oscar speaks itself, with a very emotional and transcending film, makes it a classic \"must see\". ",
            "review_date": "2019-08-07",
            "source": "rt"
        },
        {
            "content": "A wonderful and incredibly touching movie",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "Al Pacino it's all about his great performance he gives us everything in acting, extraordinary performance as we used to from him.",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "Good movie with especially great acting from the incomparable Al Pacino. He's the whole reason I wanted to watch this movie at all. ",
            "review_date": "2019-04-27",
            "source": "rt"
        },
        {
            "content": "In my Top 30 of All-time.  Pacino is masterful.  What a really good watch this film is.  2 1/2 hrs just zooms by.  Solid, solid film.",
            "review_date": "2019-02-22",
            "source": "rt"
        },
        {
            "content": "The best inspiring movie ever made! With the best movie quote ever spoken: \"Hoo-ah!\"",
            "review_date": "2019-02-02",
            "source": "rt"
        },
        {
            "content": "Scent of a woman is Al Pacino through and through. The larger than life actor is so commanding in his presence that he completely overshadows anyone around him. The film is about Charles Simms (Chris O'Donnell), a Boston prep school senior, and the Thanksgiving weekend he spends working as the aide and companion of Lt. Colonel Frank Slade (Al Pacino), an embittered, lonely, blind veteran. The job, which begins as an onerous task performed principally for money, becomes a tour of self-discovery when Slade decides to make an unexpected visit to New York City. There, amidst all the holiday hoopla, the lieutenant's actions force Charlie into making an emotionally painful - and potentially physically dangerous - decision. O'Donnell gets overshadowed by Pacino but such is his role. There are numerous dynamic scenes in Scent of a Woman, along with a surprising amount of comedy. Director/Producer Martin Brest knows how to blend humor with drama to good effect. His mix is nearly flawless, and he manages to do almost (and I emphasize almost) the entire film without resorting to manipulative tricks.",
            "review_date": "2019-01-15",
            "source": "rt"
        },
        {
            "content": "This is one of my favorite Al Pacino movies ever. Namely, because it was a different character than his usual schtick and it was done so well there is an aura he exudes as the character. Every aspect regarding his character was working, his acting, the script, cinematography, everything. The only caveat on my list and why I don't give it 5 stars is Chris O'Donnell. I know they were going for the innocent kid feeling but it fell a little flat for me. It wasn't terrible, just grossly overshadowed by Pacino's performance.",
            "review_date": "2019-01-05",
            "source": "rt"
        },
        {
            "content": "How movies should be made.",
            "review_date": "2018-12-24",
            "source": "rt"
        },
        {
            "content": "One of my fave movies of all time!  Can watch it over and over again!",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "grows like a family..\n\nScent Of A Woman\n\nBrest's big wallop of drama is a triumph on the exploration of a single relationship that is weaved out with such eerie ingredients, that it doesn't some fictitious at all. This is an elaborated script and not a stretchy one, it knows the difference between two. Ticking for more than two and a half hours, it is a delight to watch it reach its destination. By the time it hits the last act, these two characters grows like a family to you. And just like them, they are flawed, morally challenged, emotionally driven and more human than any other.\n\nThe structure of the script is your typical textbook one, even the process too is rudimentary but the journey is what sweetens the last victory. Brest is looking for glorifying tiny moments between the transition of the sequences and this is where he sweeps away the charm. Whether then be it to test drive a car or enjoy a dinner or stage a dance, his awareness and tactics of keeping the audience tangled in this aftermath bubble is sensational. The story itself follows like an epilogue of these characters and despite of being pathos, its evolution of growing out to be hopeful, is the actual trump card of the makers.\n\nSpeaking of which, Pacino the real gem of the feature is a force to be reckoned with. His eyes, his dialogue delivery, his body language, his ho-ah, everything redefines acting. His performance alone has the potential to pull off this tale with fluidity. Supporting him on a parallel role O'Donnell is decent if not anything extraordinary. Brest never lets the emotions dry out, he keeps them on the surface and the audience on the edge of the seat through his brilliant execution skills. Scent Of A Woman manages to capture all your senses and keep it drawn towards the storytelling.",
            "review_date": "2018-11-05",
            "source": "rt"
        },
        {
            "content": "An incredible performance by Al Pacino.  In turn ruthless,  strict, cynical,  proud, \nviolent,  flamboyant,  sad,  playful,  sensitive and humane,  Al Pacino leads his character from coldness to humanity and from death back to life by resorting to an incredible range of emotions.  Al Pacino turns this film into a masterpiece.  The intrigue is gripping due to his incredible acting skills which take us into an inner journey into his blind and yet so perceptive world. \nAl Pacino leads the blind military man into the light with the help of Charly.  \nWhat could have been a decadent tragedy gradually turns into a hymn for life,  respect,  integrity and love.  \nThumbs up!",
            "review_date": "2018-06-21",
            "source": "rt"
        },
        {
            "content": "Meh.  Not nearly Pacino's best (although as a makeup, he got the Oscar here).  This character is not believable as a military retiree (and became blind after juggling live hand grenades to impress junior officers??  That is the most ridiculous, least credible, and least believable story anyone could have possibly imagined.  Super fail!)  And Pacino is not a good casting choice for the role.  The ending is predictable, as is almost everything else.  There are moments here, but altogether, way too many moments - far too long!",
            "review_date": "2018-06-18",
            "source": "rt"
        },
        {
            "content": "Strong performance by Al Pacino",
            "review_date": "2018-06-07",
            "source": "rt"
        },
        {
            "content": "Fantastic film. Pacino crushed it as usual. It is a drama, but it has tons of comedic moments. One of my favorite films to quote. Just an all around great flick!",
            "review_date": "2018-05-22",
            "source": "rt"
        },
        {
            "content": "Truly amazing performances by both actors. Really makes you get your emotions tingling.",
            "review_date": "2018-05-21",
            "source": "rt"
        },
        {
            "content": "It may be predictable and about 30 minutes too long, but oh what a performance by Al Pacino.",
            "review_date": "2018-05-09",
            "source": "rt"
        },
        {
            "content": "Al Pacino Oscar performance is a must watch.",
            "review_date": "2018-05-07",
            "source": "rt"
        },
        {
            "content": "one of my top ten favorite movies of all time.",
            "review_date": "2018-03-11",
            "source": "rt"
        },
        {
            "content": "I've been taking notes on the \"rare\" sexist scenes of the movie - turns out I now have notes on the whole damn film. Sure, the movie is one of its kind - it touches upon almost every aspect from the characters, plot, scene and lines to meticulously illustrate the story of a misanthropic, sexist, alcoholic fogey who takes a young student (who he'd just met) for his final days of debauchery before planning a poorly executed suicide in a luxury hotel room - and fails. Wait, what?\n\nI won't ignore the only good part of the film - Al Pacino's acting. Declared a masterpiece himself, Al Pacino succeeds in giving his character, Frank Slade a poorly deserved breath of life (he honestly shouldn't have). In fact, Al Pacino's acting is so exceptional that Chris O'Donnell (Charlie Simms) might as well have been replaced by a walking stick to whom Pacino can give his womanizer advices to whenever he wishes. At least then would he influence, with his biased opinion, an object not a growing child. \n\nSpoilers from here*\n\nThe movie feels desperate, trying to connect me to Frank Slade's companionship with O'Donnell. In the process, I'm disgusted by their \"man to man\" conversations about women.  Women are literally a device in the movie - an object that is lovely, smells good and is physically pleasing, a way for him to be happy in his old and helpless age.General Slade and Charlie's conversation on the plane says it all - \"Women, who made em? God must've been a fu**ing genius.\" To this moment I'm screaming internally of this portrayal of women as a man-made object. In fact, women made you, so maybe you shouldn't talk about their \"Tits\" or \"What's in between their legs,\" as a \"passport to heaven,\" Frank. And come on, we're really supposed to accept that he guesses an stewardess's name and features simply from her accent and scent? Just in case Frank Slade doesn't realize, the number of different women in the world doesn't correlate to the number of perfumes there are. \n\nAnd worse, I'm not sure how any of these lines take part in making meaning out of the movie. ANY.\n\nHoo-ah, the infamous tango scene. First of all, why does he come up to the girl with Charlie and expects her to be pleased with Charlie's appearance? And second of all, if General Slade is there to help Charlie talk to the girl in the first place, why does he look more desperate to have a dance with her? Maybe I'm overthinking this scene, but with the conversation about \"pu**y\" and \"t*ts\" the scene before this, the tango feels as if the two (Charlie and Slade) already has come to a consensus that women are sex objects, making the dance seem lustful. Even without considering all of this, Frank Slade is clearly making an \"offer\" that the girl cannot decline. The lines considered beautiful in the film would be considered annoying and forceful in real life. I would be calling my assumptions an opinion until here, but when the film shows Frank asking his driver to call for him a sex worker, the \"finest of their kind,\" and later walks into the house to get his business as \"a man\" done, I am utterly, and horribly disgusted. It's very much solid evidence that the movie generalises women as sex objects and isolates them. Has anyone noticed that every time a female character appears on screen, Frank has something to say about them? If not, please never watch the movie ever again. \n\nEven with its film quality, scent of a woman never arouses an actual interest - the endless dialogues and Frank's loud presence bores me in the first hour. Crippling is its lack of rhythm, as the shots are linear in direction and the scenes are unnecessarily long and draining. The movie is highly predictable, and doesn't give many possible routes to where the story can go. Even the most important, climax of the film is elongated with half the audience already knowing that Slade is not going to shoot himself (although the same half of the audience would have gladly done it for him). Moreover, the movie hardly shows any efforts to make its melodrama interesting, not showing any emotional connections between the main protagonists. It turns out to be more counter-productive in its portrayal of sincerity as evident through its corny, happy ending. \n\nI guarantee you that you'll enjoy this movie as much as you love bumping into a sharp corner or punching yourself in the face. I'll introduce the film to my two sons, as a bible to what they should never say and do - although I doubt they would even want to. Romanticizing discrimination is not part of their interests. So If you're someone who is already a sexist, hard-headed, emotional excuse for a human being, sure, go watch the film. If not, go refresh yourself with a speech on equality and an actual ideal, educated world. Have fun!",
            "review_date": "2018-02-05",
            "source": "rt"
        },
        {
            "content": "A cena do tango é marcante.",
            "review_date": "2018-01-07",
            "source": "rt"
        },
        {
            "content": "Excellent film, heartwarming and surprising.",
            "review_date": "2017-12-30",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 7.5\n\nUna soberbia actuación de Al Pacino y una poderosa historia, que hace de Scent of a Woman un claro exponente de la última década del siglo XX.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "Were it not for Pacino, this film would have its weak points (school disciplinary plot, O’Donnel’s acting). But all is forgotten given his absolute perfection. It’s tough to say this given his filmography: Pacino’s finest. ",
            "review_date": "2017-12-05",
            "source": "rt"
        },
        {
            "content": "I always heard that Pacino's Oscar win for this role was mostly a lifetime achievement award, but I actually think he's pretty incredible here, as are all of the performances (LITTLE BABY SEYMOUR HOFFMAN!). Otherwise, the movie is clichéd and corny. Other than a couple of effective moments (Thanksgiving dinner), this is mostly an abundantly false (gun-hotel scene) 90's drama that was just begging for (and getting) awards with every hoo-wah.",
            "review_date": "2017-11-27",
            "source": "rt"
        },
        {
            "content": "tha part of the speech of Al pacino is my favourite, it makes me cry each time I watch it...",
            "review_date": "2017-11-16",
            "source": "rt"
        },
        {
            "content": "Strap yourselves in for hilarious viewing in this Rain Man meets Dead Poets Society slap-stick comedy that mocks the disabled and reinforces the patriarchy by continually objectifying woman: portraying woman as a trophy that can be won if you pull the right moves. However the real kicker for me was that film culminates around the message that a different set of rules operates for 'the boys' where snitches lack honour and those who perpetuate a lie are rewarded, because what 'happens on the footy trip stays on the footy trip.'",
            "review_date": "2017-10-14",
            "source": "rt"
        },
        {
            "content": "Too long, especially with only two characters, but it still works. Pacino deserved every ounce of his Oscar for his amazing work. I love a redemption story.",
            "review_date": "2017-06-08",
            "source": "rt"
        },
        {
            "content": "AL pacino played legendary",
            "review_date": "2017-06-08",
            "source": "rt"
        },
        {
            "content": "One of the best movies I have ever seen.  Emotional, tragic, powerful.  Very strong performance from Al Pacino at his best. \nUn des meilleurs films que j'ai jamais vus.  Une performance magistrale d'Al Pacino.",
            "review_date": "2017-04-13",
            "source": "rt"
        },
        {
            "content": "\"Puerto Rican make the best infantry men\"",
            "review_date": "2017-01-10",
            "source": "rt"
        },
        {
            "content": "This was a random find on Netflix.  Very enjoyable, with a superb performance from Dustin Hoffman.  No wonder this won him an Oscar, very well deserved.",
            "review_date": "2017-01-03",
            "source": "rt"
        },
        {
            "content": "Al Pacino izvrstan... Lep i poucan film",
            "review_date": "2016-11-08",
            "source": "rt"
        },
        {
            "content": "As much as Pacino is great, the film around him is mediocre.",
            "review_date": "2016-08-13",
            "source": "rt"
        },
        {
            "content": "one of the masterpieces of al pacino",
            "review_date": "2016-08-01",
            "source": "rt"
        },
        {
            "content": "Al Pacino finally gets his Oscar! That's the good news.  The bad news is that this isn't what he should have won for.  Don't get me wrong.  This is not a bad film.  In fact, it's pretty good.  As expected, it is Pacino that carries the picture.",
            "review_date": "2016-07-12",
            "source": "rt"
        },
        {
            "content": "Made famous by the fact it featured a grandstanding Oscar winning Al\nPacino performance and the career making turns of future Robin Chris\nO'Donnell and future Oscar winner Philip Seymour Hoffman, Beverly Hills\nCop and Midnight Run director Martin Brest's Scent of a Woman is a film\nthat by today's standards is a tad too over the top and melodramatic to\nbe highly praised but it's an at times affecting and emotionally\npowerful portrait of friendship and finding ones place in the world.\n\nDrawing out a seemingly simple set up of odd couple pair in the form of\nPacino's blind and disgraced former Army Colonel Frank Slade and\nO'Donnell's baby faced and non-worldly wise prep school\nstudent/makeshift babysitter Charlie Simms going on a life changing\nweekend trip into a 2 and a half hour meditation on living, loving and\ntango dancing, Brest struggles to maintain a consistent momentum to the\nflow of the movie and after a lengthy lead up and a downright cheesy\nfinale, Scent of a Woman stays afloat and becomes something more than\nit perhaps deserves to be thanks to Pacino and O'Donnell's intriguing\npartnering.\n\nIn what's the very incarnation of an award baiting role, Pacino walks\nthe very fine line of parody and an acting masterclass as the\ncantankerous and feisty Slade and while he walked away with the golden\nstatue at the1993 Oscars it's hard to say how his performance would be\nregarded had it come to fruition in today's climate but one suspects a\ngolden statue would not have fallen in his direction.\n\nIt's a committed performance by Pacino but his over reliance on yelling\nof the phrase \"hoo-wah\" is nicely counteracted by O'Donnell's dialled\ndown (sometimes too much so) turn as the well-meaning Charlie. Between\nthe two actors they find a nice middle ground and make the hard to\nbelieve central premise of Scent work despite the fact it's never far\naway from being purely fanciful in terms of character decisions and the\naforementioned over staged finale involving a college court of law.\n\nFor all committed Pacino fans Scent of a Woman is must watch as it\nfeatures the actors most flashy performance outside of Scarface and\nacts as a reminder as to just how dominate the now sporadically\nentertaining actor could be as well as a showcase for O'Donnell, who\njust never quite went on with the talent he showed in his early career.\n\nAs for director Martin Brest whose career story is now Hollywood lore,\nScent of a Woman marked the last noteworthy entry into the filmmaker's\nshort filmography that was put to a swift and sad end by the one two\ndouble pronged attack of cinematic stinkers Meet Joe Black and\nnotorious movie crime that was the 2003 Bennifer led Gigli.\n\n3  1/2 intense tango's out of 5\n\nwww.jordanandeddie.wordpress.com",
            "review_date": "2016-07-03",
            "source": "rt"
        },
        {
            "content": "sensacional um sego dirigindo uma Ferrari Mondial T genial",
            "review_date": "2016-06-30",
            "source": "rt"
        },
        {
            "content": "Pretty strong performance by Al Pacino and interesting enough story to follow, even though, of course, Al Pacino's tour-de-force is the main reason to watch this film.",
            "review_date": "2016-06-20",
            "source": "rt"
        },
        {
            "content": "Decent movie, even though it reeks of Oscar bait, and runs too long.",
            "review_date": "2016-06-05",
            "source": "rt"
        },
        {
            "content": "The ending may seem too formulaic and it definitely suffers from excessive lenght - but Al Pacino's mighty tour de force performance is more than enough to keep this drama solid.",
            "review_date": "2016-05-28",
            "source": "rt"
        },
        {
            "content": "Al Pacino gives a performance for the ages and got his well deserved (and only to date) Academy Award for this movie. Other than that, fairly generic.",
            "review_date": "2016-05-08",
            "source": "rt"
        },
        {
            "content": "Again, pretty good, but fairly cliche drama.  Pacino gives an outstanding performance, even if his character is mostly unlikable.  It's just a little too drawn out and bloated.",
            "review_date": "2016-05-01",
            "source": "rt"
        },
        {
            "content": "My favorite movie.\nMy favorite tango scene.\n\nè??ï¼?ä¸?é?»è¶³ç?£ã??\næ??ï¼?ä¸?æ¬¡å°±å¤ ã??",
            "review_date": "2016-03-14",
            "source": "rt"
        },
        {
            "content": "Once you've seen the original, this remake unveils what it really is: an insipid edulcorated Hollywood version of a beautiful and intense movie. If Pacino deserved an Oscar for it, Gassman outclassed him.",
            "review_date": "2016-02-22",
            "source": "rt"
        },
        {
            "content": "What starts off as a jarringly over-the-top performance by Al Pacino as a loud, obnoxious, blind, southern, retired colonel quickly inspires awe as the movie progresses. Obviously the veteran actor pretty much single-handedly makes this movie, and even crafts one of his most iconic roles in the process. Basically, terrific performances (then newcomer Chris O'Donnell is actually quite good here too) in this character drama elevate the often predictable script.",
            "review_date": "2016-02-21",
            "source": "rt"
        },
        {
            "content": "It is a very deep film, one of the few that captures depression and suicide more accurately than any psychologist or psychology book.",
            "review_date": "2016-02-09",
            "source": "rt"
        },
        {
            "content": "I never wanted to watch this due to a trailer I saw just before it was released. As I remember I thought it was about a blind bloke who liked to dance and that didn't interest me at all. How wrong I was. This is an excellent film; it's funny and possibly Pacino's best performance.",
            "review_date": "2016-01-08",
            "source": "rt"
        },
        {
            "content": "A movie for, of, and by men, but I still enjoyed watching it.",
            "review_date": "2015-12-21",
            "source": "rt"
        },
        {
            "content": "Some top acting,  especially Pacino but bit of a weak plot",
            "review_date": "2015-12-10",
            "source": "rt"
        },
        {
            "content": "Pacino is a riot, whoo ah!",
            "review_date": "2015-09-27",
            "source": "rt"
        },
        {
            "content": "One of those movies that makes you wish it wasn't a movie and that - somewhere, somehow, in some weird parallel movie universe - Chris O'Donnell and Al Pacino are really still cruising around and having fun in New York City. \"Scent Of A Woman\" is Martin Brest's masterpiece; a crowd-pleaser with a big heart and an absolutely legendary performance from Al Pacino.",
            "review_date": "2015-08-28",
            "source": "rt"
        },
        {
            "content": "Enough with Pacino and his hoo-ahhs, and it really lost me when his blind man is driving his car through the streets.",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "Laurence Olivier once said that acting was primarily learning your lines and saying them- In Scent of a Woman Al Pacino shows us that acting is far more than that. A timeless classic with a true legend at it's centre leading the way.",
            "review_date": "2015-07-20",
            "source": "rt"
        },
        {
            "content": "One of my top favorite movies of all time. Al pacino's best roles. Great movie from now start to finish. Never gets boring.",
            "review_date": "2015-06-24",
            "source": "rt"
        },
        {
            "content": "O'Donnell is good and Pacino sensational in a brilliant odd couple-style dramedy. Pacino makes the movie, controlling it in every scene, his patented overacting invigorated by a tight 5 acript and exceptional direction.",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "Al Pacino is sensational",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "Very great movie, with amazing acting from AL Pacino. The other acting was great too. The story was great also. It was just a bit too long and the message was a bit confusing.",
            "review_date": "2015-05-03",
            "source": "rt"
        },
        {
            "content": "Spectacular performances by the entire cast! Proof that Al Pacino is one of my favorite actors! Totally sold me on the idea that the loss of sight cannot hold you back from the pleasures of life! That dining room scene hooks me in every time! Very high recommendation!",
            "review_date": "2015-04-14",
            "source": "rt"
        },
        {
            "content": "There was no denying Pacino the academy award as he powers through this movie leaving little in his wake.",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "Brilliant performance from Al Pacino. Other then that pretty average.",
            "review_date": "2015-03-19",
            "source": "rt"
        },
        {
            "content": "DOUBLE THUMBS UP\nViewed this on 6/3/15\nAl Pacino is one of the best actors to be ever born and this is his best film to date. Scent of a woman is a strangely inspiring motivational movie in which Al Pacino gives a larger than life performance. The guy is so much into the role that you almost believe that it's not Pacino but Frank Slade. Martin Brest has wonderfully directed this film and the acting of Chris O'Donnell must not be left out as well. It's a story that most of us can easily relate (well I did) and it's ending is marvelous and also the film has the same view on women that I have.",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "Well hello boys and girls. Instead of me giving my normal review of movies I figured that I would just simplify things and give you a sample of a review of \"Scent of a Woman\" from the greatest movie critics of all time. \"An amazing film. Intelligently written and movingly told. This is one of Al Pacino's best and riskiest performances.\"-Roger Ebert, Siskel & Ebert/Chicago Sun-Times",
            "review_date": "2015-03-02",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies ever made",
            "review_date": "2015-02-09",
            "source": "rt"
        },
        {
            "content": "What I got to say about \"Scent of a Woman\" is definitely a really good movie. \"It's entertaining to a very good degree, smart, clever, has funny moments and original.\" The performances by the whole cast is perfect. \"Al Pacino gives a tour-de-force performance. Also, Chris O'Donnell is outstanding. Both of them has phenomenal chemistry that you will notice really quickly.\" The directing by Martin Brest is really perfect and the screenplay by Bo Goldman is written so beautifully. The cinematography is fine. Finally, the score in this movie I personally like so much. It's smooth and sweet of a sound. \"I'm raving that \"Scent of a Woman\" is a heart-wrenching and heartwarming story that tell you that life can be sometimes a tough, but you never give up on the one's that are willing to help you succeed in life.\"",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "Hoo-ah! Pacino is fantastic.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "I dont know i loved and hated al pacino's character who was equally a huge dick and scary as he was charming and stand up. How could that lady ask someone to watch her uncle and not inform them what was going on-what a biatch. She shouldnt have let some 18 year old or whatever he was watch him alone with that kind of attitude and mental instability. That kid i felt kept doing things for ppl he shouldnt have. He shouldnt have let frank talk to him or continue to threaten him. He also shouldnt have stood up for those pricks at his school who were brats to the principal. The acting in this movie was excellent and i did really like a lot of the script. Some scenes were not ok like frank threatening to kill charlie and himself with a gun, frank telling charlie he is fired and if charlie touches him he is dead, frank being rude and crass at his brothers house and choking someone, etc... I just had a problem with how the movie tries to excuse franks erratic lunatic behavior just bc he is blind and lonely and say its ok for charlie to be a doormat. Frank was violent and rude to charlie a lot. That being said prob al pacinos best performance.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "An intense yet sweet and emotional ride, one of my favorite films of all time",
            "review_date": "2014-10-27",
            "source": "rt"
        },
        {
            "content": "This may also be referred as Martin Brest's last good movie, and Al Pacino's prime as well. Scent of a Woman is a film that fully relies on the talent of Pacino to bring a funny, touching, delicate dramedy with more heart than conscience.\nThe story goes a little bit like this: Aided college student Charlie Simms (Chris O'Donnell) is on the verge of expulsion when he is witness of a prank at his college. On the same thanksgiving weekend of the occurrence, he takes a job to take care of the foul-mouthed, blind veteran Frank Slade (Pacino), who takes Simms to New York to have a weekend of luxury and fine tastes.\nHaving not seen the italian original, I cannot say which one is better at achieving what the movie wants, but when it comes to this drama, it is certainly mild in every aspect. It is not sad, it's chuckle-worthy and it is LONG. Two hours and a half is a lot for a movie about two generations of people conversating, about whether life is worth living, about women and about their problems. Scent of a Woman, however, keeps the density light thanks to Al Pacino fankly over-the-top performance that is also very riveting and eye-catching. Plus, O'Donnell is not bad at playing Pacino's escort. Although that is what he is: An escort to a top-notch performance. The screenplay, by Bo Goldman who wrote such classics as \"Shoot the Moon\", is also a favourable factor because, as I've said before, the movie is made up of conversations for the most parts, and when this don't go into a dense monologue, they are pretty alluring.\nMartin Brest offers in here a movie that is full of extravagance and self-indungence, as well as enough Pacino to bring joy to our hearts. It could be shorter, but what we've got here, the story of a bucket list turned into a miracle trip, is an above-watchable charmer.",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "Very good movie, Al Pacino at his best, good dialogs that are always relevant.",
            "review_date": "2014-08-22",
            "source": "rt"
        },
        {
            "content": "The movie is all about Al Pacino's performance,but the story is an ordinary one.",
            "review_date": "2014-08-19",
            "source": "rt"
        },
        {
            "content": "The plot is extremely weak in this film. It's poorly structured, lacks consistency and the ending is very weak. Unlike most people here, I'm going to have to criticize Pacino as well for wildly overacting this time around. He is nowhere close to his best and you expect better from an actor of such calibre",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "Incredible. Simply Incredible. Al Pacino surpasses even his typically flawless best. He portrayed a blind man better than most actors would portray a man with vision. Explosive performance. Chris O'Donnell was equally impressive in his role. This was at the start of his career which makes the feat even more remarkable. There are few that can share the screen with Al Pacino and not be completely outshone but Chris O'Donnell pulled it off. A must watch.",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "The plot is extremely weak in this film. It's poorly structured, lacks consistency and the ending is very weak. Unlike most people here, I'm going to have to criticize Pacino as well for wildly overacting this time around. He is nowhere close to his best and you expect better from an actor of such calibre",
            "review_date": "2014-07-17",
            "source": "rt"
        },
        {
            "content": "Watched and loved it as a kid.  Still love it as an adult",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "Hoo-ah! Scent of a Woman is an interesting movie. It s a showcase for Al Pacino, and a reason to give him an Oscar. It throws in some life messages and themes to seem important, and gives Al some good quips to make about prep school life. The character development is on point, an it is entertaining to watch. It doesn't have much substance, but it makes up for it in comedy and themes; and the soundtrack is beautiful.",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "Explosive performance by Pacino.",
            "review_date": "2014-06-28",
            "source": "rt"
        },
        {
            "content": "Now this is a film that has an extremely poor plot. It's poorly structured, lacks consistency, overloaded with plot devices and the ending is very weak. Unlike most people here, I'm going to have to criticize Pacino as well for wildly overacting this time around. He is nowhere close to his best and you expect better from an actor of such calibre.",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "Al Pacino is magic in this film. You can't take his eyes of him. Added to this, the film is moving and carries an important message. It is a satisfying, uplifting, triumphant film that must be watched!",
            "review_date": "2014-06-08",
            "source": "rt"
        },
        {
            "content": "Al Pacino is at his best, his performance is the main reason that will make you enjoy the film despite all the film's drama.",
            "review_date": "2014-06-07",
            "source": "rt"
        },
        {
            "content": "Al Pacino and Scent of a Woman power through a few cliches and caricatures to create a bombastically fun, witty and spirited film.",
            "review_date": "2014-06-02",
            "source": "rt"
        },
        {
            "content": "Al pacino at his best. Great script. Philip seymour hoffman appears in the movie.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "Wisely steers clear of over-sentimentality.",
            "review_date": "2014-04-07",
            "source": "rt"
        },
        {
            "content": "Pacino is good but not great in this tale of a blind man in his allegedly final weekend. Sentimental to perhaps a fault, it is nonetheless good to see Al win an Oscar finally.",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "I absolutely love this movie",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "Al Pacino, simply irresistible! Woo-hah!",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "An Amazing Performance from Al Pacino .",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "Assisted by an innocent young scholarship student, a blind man and former army officer goes on a weekend trip to New York. There is no doubt about the fact that it is mostly down to Al Pacino that this film goes down well and comes across as entertaining. Most of the film's elements are lifted by the original Italian film that starred Vittorio Gassman, in a way that is tainted by the usual Hollywood conventionalities and obnoxious cheesy structural clichés that lack realism.",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "An irascible bully who proves to have a heart of gold, Pacino's character seems manufactured by a computer programmed with box-office grosses. whoo-wa!",
            "review_date": "2013-12-22",
            "source": "rt"
        },
        {
            "content": "I LOVE THIS MOVIE! And no, I'm not a caps lock person, I just love it that much.",
            "review_date": "2013-12-05",
            "source": "rt"
        },
        {
            "content": "Can't figure out why this was on some blogger's list of top 25 romantic movies of all time. Not to mention that the title is misleading too. And somehow this was recommended to me by rottentomatoes because it was presumably related to Notting Hill and Sleepless in Seatle. But if you're a big fan of \"Dead Poet's Society\", this one is definitely for you ;) None else can beat Al Pacino in playing magical roles of the unpredictable kind of men.",
            "review_date": "2013-12-02",
            "source": "rt"
        },
        {
            "content": "Never liked Mr. Trask.",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "Scent of the Woman rides less on drama than on character, on a loud, self-pitying blind colonel whom we grow to respect, and he is played by Al Pacino in a performance that is so daring, so brassy, so extravagant that it won him his Oscar.",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "A typical prep school movie with an atypical level of sophistication and intelligence and a stellar performance by Al Pacino.",
            "review_date": "2013-11-20",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever ...",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "Al gives an incredible performance that smashes you up against a wall and spins you around ready for a slapping to finish off.  The dialogue is startling in its style and panache and brings the actors abilities to the forefront making this a relish for the mind.  Direction is noted for its pointed timing.  Nibbles: Key Lime Pie.",
            "review_date": "2013-10-10",
            "source": "rt"
        },
        {
            "content": "Scent Of A Woman is one of them films that really blows you away if you're not expecting it.\n\nLike The Place Beyond The Pines, I got so much more than I was expecting. Al Pacino has never had a better role since Godfather 1 & 2. He just BLOWS YOU AWAY, he is on top form. It's funny this is Chris O'Donnells best performance to date and yet it was one of his first!\n\nThe running time is 150mins which scared me but I was gripped the whole time. I had to stop half an hour in due to the time but I just wanted to carry on so much. The story is amazing and even carries a moral message. It follows a young college student who goes to earn money by looking after a knowledgable blind war veteran while dealing with a big problem at school. It's captivating from start to finish.\n\nAs I said early, and I cannot stress this enough, Al Pacino has hardly ever been better, he is breathtaking in every scene he is in. The whole mentor, student relationship is interesting throughout & Chris wasn't even a hinderance. There are so many amazing scenes in this movie. It is a classic for sure. It is the only film Al Pacino has ever won an oscar for, and you definitely see why. He is one of the greatest American actors who has ever lived.\n\nOverall, Al Pacino brings out an AMAZING performance, the supporting cast are excellent, the story and it's progression are amazing, a great score and a definite classic.",
            "review_date": "2013-09-29",
            "source": "rt"
        },
        {
            "content": "Probably my most favorite movie of all times!",
            "review_date": "2013-09-18",
            "source": "rt"
        },
        {
            "content": "It is a fantastic film, featuring a fantastic awards worthy performance by Al Pacino, for the first 90% of the movie if not more. But the ending is so terribly written and contrived.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "Well hello boys and girls. Instead of me giving my normal review of movies I figured that I would just simplify things and give you a sample of a review of \"Scent of a Woman\" from the greatest movie critics of all time. \"An amazing film. Intelligently written and movingly told. This is one of Al Pacino's best and riskiest performances.\"-Roger Ebert, Siskel & Ebert/Chicago Sun-Times",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "\"- You're gonna have us killed ! - Not my fault, I can't see clearly !\"",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "Film review: Scent of A Woman\nA film that has so many things, I could't tell all. A laughable film in film situation, but teaches us a lesson about love and the real born nature of many people, like for instant, George: a rich ass hole who would fell when it came to hard situation. Charlie: An excellent and nice behaving poor student, who has a kind heart...It has a spectacular script, which highlighted Al Pacino's story about Colonel Frank Slade. Having the over the top buffoons performance by the awesome couple: Al Pacino and Chris O'Donnell, the film is a work of art, fully painted with many colors. 81/100",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "The drama unfolds as more facets of Al Pacino's character, which he performs impeccably, are revealed. Other than that, the basic premise of the movie is quite a drag.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "It´s a strong and interesting movie that can have different point of views, but I really enjoy it. I like that that is a complicated character with a difficult life , but you can´t see him as a victim because he build or made all the bad things that he got. I can´t stop comparing this final with the Cristmas Carol ending.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "Beautiful! Never gets to the point where it gets overly preachy but makes you laugh and cry at the same time. Pacino is A grade yet again and there's a performance of substance by O'Donnell.",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "Just so, so bad.  A film that is 95% of the time inhabited by total scumbags and then in the final 5 minutes tries to convince you that the chief one of the lot is actually deep down a really great guy.  Why?  Well he does that Hollywood classic of making a ridiculously long speech that suddenly changes everyone's actions!  It's ludicrous, cheesy and downright insulting to your intelligence.  Pacino won an Oscar for this!?  He won an Oscar!  For what?  Stumbling around a bit and saying HOO HAR every 5 minutes??  I'm almost scared to look at who he beat as I might blow an internal gasket.  Laughable.",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "Great movie, a little long but strong themes about what it means to be a respectable man and leader",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "A pleasant drama featuring one of Al Pacino's best performances.",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "Al Pacino's oscar winning poreformance. Scent of a women is based on those dramatic movies where the ending is obvious from the beginning. But where this movie rises is how we get to that point. Although extremely slow paced, its not one bit dragging probably because of Pacino's acting.  Scent of a women takes a ride into the life of a man, lost of all hope and in need of nothing more in life than the love of a women. \n                                                    However this movie dwells deeper into the relationship between Lt. Col. Frank Slades a blind army veteran who sees no reason for his existence and Charlie Simms a poor student with his own string of problems.\n                                             By the end, the feelings between the characters feels so genuine and really gives some food for thought.",
            "review_date": "2013-06-27",
            "source": "rt"
        },
        {
            "content": "This movie was intriguing. It was so plain and simple yet had so much substance. Al Pacino continues to prove he is a hall of fame actor; if they had one. The supporting cast was also pretty good. It had a lot of heart and was a perfect example of how a long movie without action can be interesting and meaningful. A must see 90's film.",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "After being snubbed by the academy over the years, finally Al pacino receives an oscar for best actor which he could have won before. That was the most electrifying performance by any actor specially that last scene which i will never forget. Overall an excellent and very touching movie, must watch for any movie lover.",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "The character of Frank Slade may have felt clichéd if it weren't for Pacino's thunderous performance.  Whilst slightly indulgent and at times formulaic, the characters are so well drawn and the dialogue so sharp, its impossible not to get swept up in this rambling, immersive drama.",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "A drama about integrity and honor with a great performance of Al Pacino. ¡Hoo-ah!",
            "review_date": "2013-06-21",
            "source": "rt"
        },
        {
            "content": "best al pacino movie i've seen yet a big winner",
            "review_date": "2013-06-20",
            "source": "rt"
        },
        {
            "content": "A really moving movie Al Pacino at is best one of the movies that made is reputation of a great actor,all Al Pacino fans and non fans must see movie.Tears will flow for the most sensitive ones lol.",
            "review_date": "2013-06-16",
            "source": "rt"
        },
        {
            "content": "a terrific performance from Al Pacino deserves this rating more than the story itself.",
            "review_date": "2013-06-10",
            "source": "rt"
        },
        {
            "content": "My favourite performance on screen. An outstanding acting achievement.",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "One of the best acting work of al pacino it was soo good one of the best movies he just stole it all in the first 5 minutes he is introduced",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "a great movie. one of the best i have seen",
            "review_date": "2013-06-02",
            "source": "rt"
        },
        {
            "content": "A great, all around movie thanks to the power of Al Pacino's performance.  He nails the role in his first five minutes.  Everything about it is perfect, the writing, the direction, the confrontations, everything.  As long as you have patience for the length of it, then you're good to go.  I highly recommend it.",
            "review_date": "2013-06-02",
            "source": "rt"
        },
        {
            "content": "One of the best movies I ever saw in terms of AlPacino's acting (superb acting)",
            "review_date": "2013-06-01",
            "source": "rt"
        },
        {
            "content": "a different edge and side of Al Pacino. Performance well done",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "Our World They will never Die Blindman see Women heart & soul! El dia que me quieras Ali seremos la pareja perfecta My Heroe One!",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "i love the final monolouge",
            "review_date": "2013-05-05",
            "source": "rt"
        },
        {
            "content": "George W. Is a fine man!!!  Hoo Haa!",
            "review_date": "2013-04-29",
            "source": "rt"
        },
        {
            "content": "Seen it so many times. Still enjoy it. Epic scenes. Had forgotten that Philip Seymor Hoffman was in this one as rather a young man. Funny. Still...... it is all about Al Pacino. That's all.",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "I was amazed at how Al Pacino's only Oscar had come from this amazing movie. The direction of Martin Brest was outstanding, but he seems to have destroyed his filmmaking career after 2003. It's a shame he has not directed a film after that trash heap of a movie \"Gigli\" came out, but he shouldn't let that horrible excuse for a film stop him from doing more movies. I loved this movie. Martin Brest is the reason Al Pacino has won an Oscar. Al Pacino, being one of my favourite actors, is one of the reasons I loved this movie. One of Al Pacino's best performances. You must watch this movie. You will love it. Especially Al Pacino's acting.",
            "review_date": "2013-04-18",
            "source": "rt"
        },
        {
            "content": "Huah! Gotta love Pacino in this movie, huah!",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "al pacino at his best!!",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "Worthwhile updating of De Sica classic.Pacino does the needly for save the day.",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Al Pacino's the man.\nThe movie rotates and revolves around him while he charms and amazes us..\nThere are good actors, there are great actors, and then there's this historic actor laying passionately with his friends.. ;)",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Bonafide Prep-school genre flick. Pacino puts in a performance that was truly oscar worthy, though the film's untrimmed length seems to have been pruning their lead for just the occasion. Chris O'Donnell also has a great performance, but his character seems much flatter than that of Lt. Col. Frank Slade. He goes through only a slight transformation throughout the film, which is really a shame considering it has a run-time of almost 3 hours. Martin Brest filled the genre to its proper, pre-determined limit, and should be commended for it.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "film penuh makna..kedua tokohnya saling menyembuhkan luka yang dimiliki :)",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Excellent movie. Good story, amazing acting.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Powerful performance of Al Pacino. A well told story without falling in sentimentalism, despite its obvious clichés, this film becomes a classic.",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "A bit overlong and some campiness here and there, but it's Al Pacino's performance that makes this worth watching.",
            "review_date": "2013-03-14",
            "source": "rt"
        },
        {
            "content": "A bit overlong and some campiness here and there, but it's Al Pacino's performance that makes this worth watching.",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "I love this movie!  It's one of my favorites.  Pacino's acting is incredible!",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "There are three things which get better with time: cheese, wine and this film. Watch it for Al Pacino and for love of all the great films from 90s !",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "and it goes \"FRESH\"! haha!",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies in cinematic history",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "Al Pacino and Chris O'Donnel's chemistry together is the best part of this movie",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "De mis favoritas de Al Pacino... Actorazo! Y el discurso del final ufff",
            "review_date": "2013-02-25",
            "source": "rt"
        },
        {
            "content": "First Al Pacino movie I watched. Loved it.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "It's Al Pacino...all the way. Whoo-ah!\n\nWell, the story basically revolves around Lt. Cl. Slade and Charlie Simms. \n\nAl Pacino is such just an exciting actor to watch on-screen. His acting as a turn-off retired blind officer is brilliant, top-notch. Chris O'Donnell gets some freshness to this movie. He's supported Al Pacino well.\n\nThe movie has been written well and the characters fit perfectly.\n\nThose last 15 minutes or so, everything just comes alive. To be precise when Al Pacino says \"But he's not a snitch\". Following that moment, it's one helluva an awesome speech.\n\nThe movie might have seemed a little stretched but didn't bother me much.\n\nP.S. - If you're an Al Pacino fan, you'll love this movie. If you're really not one, then I'm sure you'll be one. He is simply superb.",
            "review_date": "2013-02-21",
            "source": "rt"
        },
        {
            "content": "Al Pacino gives the greatest performance of his acting career in this movie.  He has had an amazing career filled with some great performances, but this was his best.  He plays Col. Frank Slade, an ex soldier who went blind in battle, and whose life has gone downhill ever since.  It is Al Pacino's best role, because it is very unusual one for him that is different, and harder then some of his other roles.  Frank Slade is also a much more interesting character then most of the other guys he played.  Frank Slade is quite a character actually.  He is very funny and inappropriate.  He says things that really shock you, and anger people.  He has a really strange voice that make sit so you can tell he was a war colonel.  When he meets Charlie (Chris O'Donnell) he calls him either \"idiot\" or \"moron\" a lot.  He is very funny that way, and he makes the film into a bit of a comedy.  Another thing about Pacino's acting that is really good is that he hardly ever blinks.\n\nHe is a sad character however.  He hires Charlie Simms (Chris O'Donnell) a boy from a nice expensive college to take him to New York and help him around.  He tells Chris that he is going to stay at a high-class hotel, eat dinner with wine, see his brother, make love with a beautiful woman, and them he will blow his brains out.  He is a lonely guy, who doesn't get along well with his family, and because he doesn't have that many things to do anymore.  You see how much he wants to die at certain points in the film like he crosses the street while he isn't supposed to and when there is heavy traffic.  He also drives a car really fast down a dangerous road, when he is blind.  I had forgotten about his death wish for a while until that scene actually.  He also hates to get out of bed, which is a pretty common sign of depression.\n\nCharlie is a poor kid who goes to a school full of rich kids.  His friends are pranksters, and they take a prank to far.  They pop a balloon full of white paint all over the Deans car.  If he doesn't turn his friends in he will be expelled, but his friends are slime balls, and so is the dean but he won't turn his friends in because he is that selfless.  Frank ends up helping him, while he helps Frank.  They both become fond of each other, and the really help each other's lives in the end.\n\nIt is a great movie with a great script, and story.  I would recommend this.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "Al Pacino se merecía su Oscar :D",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "I think you have to watch this film.",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "Picino \"AWSOME\" nuff said....",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "Al Pacino gives the greatest performance of his acting career in this movie.  He has had an amazing career filled with some great performances, but this was his best.  He plays Col. Frank Slade, an ex soldier who went blind in battle, and whose life has gone downhill ever since.  It is Al Pacino's best role, because it is very unusual one for him that is different, and harder then some of his other roles.  Frank Slade is also a much more interesting character then most of the other guys he played.  Frank Slade is quite a character actually.  He is very funny and inappropriate.  He says things that really shock you, and anger people.  He has a really strange voice that make sit so you can tell he was a war colonel.  When he meets Charlie (Chris O'Donnell) he calls him either \"idiot\" or \"moron\" a lot.  He is very funny that way, and he makes the film into a bit of a comedy.  Another thing about Pacino's acting that is really good is that he hardly ever blinks.\n\nHe is a sad character however.  He hires Charlie Simms (Chris O'Donnell) a boy from a nice expensive college to take him to New York and help him around.  He tells Chris that he is going to stay at a high-class hotel, eat dinner with wine, see his brother, make love with a beautiful woman, and them he will blow his brains out.  He is a lonely guy, who doesn't get along well with his family, and because he doesn't have that many things to do anymore.  You see how much he wants to die at certain points in the film like he crosses the street while he isn't supposed to and when there is heavy traffic.  He also drives a car really fast down a dangerous road, when he is blind.  I had forgotten about his death wish for a while until that scene actually.  He also hates to get out of bed, which is a pretty common sign of depression.\n\nCharlie is a poor kid who goes to a school full of rich kids.  His friends are pranksters, and they take a prank to far.  They pop a balloon full of white paint all over the Deans car.  If he doesn't turn his friends in he will be expelled, but his friends are slime balls, and so is the dean but he won't turn his friends in because he is that selfless.  Frank ends up helping him, while he helps Frank.  They both become fond of each other, and the really help each other's lives in the end.\n\nIt is a great movie with a great script, and story.  I would recommend this.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "Al Pacino is wonderful in this.",
            "review_date": "2013-02-07",
            "source": "rt"
        },
        {
            "content": "Al Pacino's performance in this movie was just majestic. His role as Col. Frank Slade has a sense of bitter sweet charm which was not seen in his previous movie. It's a story of a school kid, who himself is facing his school authorities after being a witness of a prank on the headmaster, who spends a weekend with a retired blind Colonel, a lonely man craving for love, and how they develop a bond between them. It's a very good movie overall.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "What really sets this film apart, though, is Al Pacino's brilliant performance. Although he tends to overact on occasion. He still manages to reveal the complexities of his character in a way that no other actor could have managed. While Chris O'Donnell and James Rebhorn are fine in their roles, it is Al Pacino who gives us a reason to watch this otherwise unremarkable film.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "Best movie ever created!",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "Debatively Pacino's best performance ever, Scent of a Woman is an extremely well-done film. Entertaining, compelling, and when it gets good ... it gets GOOD!",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "Another awesome performance by Al Pacino. A great movie.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "Phenomenal movie. The plot is pretty different and unique from other films as it borrows elements from the coming-of-age dramas, and is very funny, really moving, and features incredible performances from its two leads, especially a young O'Donnell. What I find ironic about his performance in this movie is that he would later go on to be a major Navy secretive guy in NCIS, and has dealt with some of the personality issues in that show that he did in this.",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "Al pacino's performance is electrifying!!",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "Pacino used to make such amazing films.  Despite Chris O'Donnell falling all over himself constantly through the entire film, his inability and ineptitude as an actor comes off as cute and immature, so it works.  The final monologue is cinematic genius.  Excellent.",
            "review_date": "2013-01-31",
            "source": "rt"
        },
        {
            "content": "The best blind acting you will ever see, Pacino acts blind with eyes open and CONSTANTLY moving! how the hell can anyone do that! Don't miss this movie for the world.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "The best blind acting you will ever see, Pacino acts blind with eyes open and CONSTANTLY moving! how the hell can anyone do that! Don't miss this movie for the world.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "watching the first fifteen minutes of the film made me feel like i've seen the whole thing before, well i've really seen the whole plot before. i, of course, never give up on a movie once i start it, , but seeing that the film was 2 hours and 37 minutes long, i didn't think it would please me that much. It's not until i came to Al Pacino (i'm sure everyone else would agree) when i started to become interested. His character is one of my favorite characters ever, giving us easily his best performance yet (yes, that's right, even better than Micheal Corleone from the Godfather). Al Pacino's very presence in the film makes Charlie's simple conflicts look very dramatic indeed, and adding great amounts of tension to Frank's attempted suicide. Easily my favorite scene in the film is when Charlie takes Frank out for a ride in a Cherry Red Ferrari (\"Whoo-ah\") and allows Frank to \"drive it\". it was just so fun watching Charlie and Frank interact with each other, that i didn't want it to end, i didn't want to go back to Charlie's problems at his school, but we had to of course. and of course the only thing that got me through it was Al Pacino, still being hilarious in a situation when he shouldn't be. i'm not sure i would've liked it much if Al Pacino hadn't been in it. The character would've still interested me, but not as much as it had with Al in the role.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "al pacino at his best! Fantastic heart warming movie thats not overly sickening",
            "review_date": "2013-01-19",
            "source": "rt"
        }
    ]
}