{
    "rating": 8.6,
    "release_date": "1992-12-11",
    "num_reviews": 390,
    "genres": [
        "Kids&family",
        "Holiday",
        "Fantasy"
    ],
    "summary": "The Muppets perform the classic Dickens holiday tale, with Kermit the Frog playing Bob Cratchit, the put-upon clerk of stingy Ebenezer Scrooge (Michael Caine). Other Muppets -- Miss Piggy, Gonzo, Fozzie Bear and Sam the Eagle -- weave in and out of the story, while Scrooge receives visits from spirits of three Christmases -- past, present and future. They show him the error of his self-serving ways, but the miserable old man seems to be past any hope of redemption and happiness.",
    "reviews": [
        {
            "content": "\"| Ratings Categories |\n{Characters (8/10) ; Cinematography (7.5/10) ; Plot (8.5/10) ; Acting (7/10) ; Pacing (8/10) = 78%}\"",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thousand Muppet characters developed over decades, and the filmmakers create the most disturbing original concept for the Ghost of Christmas Past you'll ever see. It's got a bisque doll face, creeps me out. \n\nMichael Caine as Scrooge is an all-time casting choice, and his performance (played straight alongside a bunch of irreverent felt puppets) fits the rest of the film, which is among the best of what the Muppets franchise has to offer, and a fitting tribute to the then recently-passed Jim Henson. The heartless will complain about the film's sweetness and kind nature, but the adaptation hardly loses any of the remorse and chill of the original Dickens tale while keeping the delightful nature of the Muppets franchise. Even 'serious' adaptations fail to replicate the sincerity and richness of this 1992 holiday classic, which manages to bring not only excellent visual design, but is not commonly cited for its effective pacing despite only running for 85 minutes. \n\nWho is the best Muppet? Personally, I never get tired of seeing Fozzie Bear. Wocka wocka! (4/5)",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although the Muppet Christmas Carol does have a few minor flaws, it is still a fun and entertaining take on Charles Dicken's adaption of the novel in addition to Michael Caine's decent performance as Ebenezer Scrooge.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have a yearly tradition of watching this movie at Xmas",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite retelling and Christmas film, really good for all ages",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite telling of A Christmas Carol and probably my favorite Christmas movie ever. I watch it every year.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie! one of the best Christmas movies of all time.",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching as an adult for the first time, I can still feel the magic and charm of this beautiful Muppet adaption of Dickins' tale. A few creepy animations and some odd song choices for sure, but it's not hard to tell why this Muppet's story endures over 20 years later.",
            "review_date": "2022-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An All Time Classic. This film oozes charm with a great balance between seriousness and lightheartedness. Also a great job at never making it a dumbed down version for kids. Everyone should try this once.",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite ‘A Christmas Carol' movies. It's The Muppets! Where can you go wrong?",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "30 years old and still one of my favorite incarnations of the classic Christmas story by Charles Dickens directed by Brian Henson At first he was very hesitant to do it after Jim’s unfortunate passing in 1990 But it succeeded grossing $27.2 million from a $12 million budget I remember renting it a lot on vhs as a kid It's a very lovable adaptation featuring those colorful Jim Henson puppets The story and characters are pretty much the same from the original story, the Muppets add some more flavor to it Michael Caine plays Ebenezer Scrooge; the man we know of course who hates Christmas and only loves being greedy The Marley Bros. didn’t like him taking advantage of his power charging so many residents of their rent and not being so charitable So on Christmas Eve he is visited by 3 spirits (the ghosts of Christmas past, present, and future) to show him the error of his ways and perhaps change his heart The sets are creative and the atmosphere, the 3 ghosts are pretty cool, and I love how Gonzo and Rizzo constantly liven the tension breaking the fourth wall They go all the way even showing Tiny Tim's passing at one point so the filmmakers don’t shy away showing the dark, depressing nature of Dickens’ writing Kermit does wonders as Bob Cratchet Some might not like Michael Caine as he has awkward line readings, the singing isn't very good on his part , and the songs are too brief to leave an impact But many stuff is funny like Fozzy Bear's hilarious part during a flashback The kids will love the muppets and the adults will enjoy the jokes simultaneously A flawed but worthy adaptation that is required holiday viewing yearly The movie’s popularity is so immense that it has become a focal point of the festive season for many friends and families, who insist that Christmas hasn't really begun until they've belted it out Not to be missed by anyone who loves the holidays or these Muppets ",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most underrated musical scores for any holiday movie. A fun twist on an old classic. Name a better Scrooge than Michael Caine!?",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless classic to enjoy year after year. And the extended edition with the lost song when love is gone makes it even better!",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Christmas movies. Has great songs and a ton of funny moments with keeping the great meaning of the original story. The actor for Scrooge is great.",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun, heart-warming classic that'll get younger viewers into the story into this classic it's a great watch for all and despite including The Muppets it stays for the most part quite faithful to the source material.",
            "review_date": "2022-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though panned by some critics as overly sentimental and lacking the magic touch of Jim Henson who died two years prior it's release, a Muppet Christmas is surprisingly faithful to Dicken's original telling, the legacy of the movies before it, and the traditional spirit of Christmas.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great adaptation of the classic Dickens novel and a modern staple of Christmas.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A forever classic for a reason.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Muppets, The Christmas Carol: it's actually a good mix.",
            "review_date": "2022-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": " One of the best versions for the entire family. A true Christmas classic.",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite rendition of the classic novel! This Jim Henson classic is a must see during the holiday season! You'll be singing the songs long after you've finished.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not a Muppet fan but this is a great film and a great take on Charles Dickens' classic book.",
            "review_date": "2022-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny and heartwarming,",
            "review_date": "2022-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so classical!",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The quintessential rendering of Dickens' classic, in many ways the definition of what we understand by Christmas. Caine's Scrooge is almost willingly repentant when confronted with his own shortcomings in a world of humans and muppets. The muppets themselves are fabulous, a meta Gonzo smashing the fourth wall in his role as narrator; Kermit and Miss Piggy finally having consummated that relationship as the Cratchetts and answering the long asked questions to what their kids would look like: girls pigs, boys frogs; excellent bookkeepers; the Swedish chef even gets a look in despite no obvious role in Dickensian London and Statler and Waldorf multiple well appreciated appearances and a coy little shot of their shop. Spoiler alert HE ISN'T DEAD.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Family-friendly and fun. Michael Caine gives an appealing performance of Scrooge, toned well with the Muppets.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only good thing Brian Henson has ever made. A beautiful tribute to the late, great Jim Henson. Muppet's Christmas Carol cemented itself as one of my favorite Christmas movies with its ability to appeal to children and adults as the muppets always do. Caine delivers a master-class performance that contrasts well with the humor-driven muppets. They never fail to pull out an unexpected emotional moment when needed, though. Every muppet fits in well with the role they have in the movie and it feels like a nice marriage between a beloved old story and the wacky antics of the muppets. The biggest surprise is the film being able to bring in Charles Dickens to narrate, despite his odd new attraction to chickens and strangely curved nose.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine plays an impressively straight Scrooge surrounded by the cute and lovable Muppets cast, who tell the Dickens tale in its bare essentials and add in plenty of their own zingers in mostly appropriate spots.",
            "review_date": "2021-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Version of Christmas Carol.",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is our family favorite!",
            "review_date": "2021-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppet's take on Charles Dickens' classic Christmas story is not perfect, but it is very entertaining.  I have watched the movie multiple times and I have always enjoyed it.  Academy Award winner Michael Caine is terrific as Ebeneezer Scrooge.  The puppetry work is great (as usual).  I especially liked The Ghost of Christmas Present.  Gonzo and Rizzo are very good as the movie's narrators.  They also had some good jokes.  The songs in the movie are good.  There is no \"Rainbow Connection\" in the movie per se, but the songs fit the movie well and the musical numbers are well staged.  I do recommend \"The Muppet Christmas Carol\" to Muppet fans of course but even if you are not a fan I recommend seeing it at least once.  You will at least be entertained.",
            "review_date": "2021-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Christmas Carol adaptation by a mile, and the best Christmas movie ever by a hair.  Michael Caine's emotional performance and commitment to the source material provide a center of gravity that every Muppet idea can be built from, allowing a really supreme range of tones sliding from heartfelt to harrowing.  The pace, which has tripped up plenty of Christmas Carol adaptations, flows perfectly.  The songs are all bangers.  Watch this every year.",
            "review_date": "2021-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it, though I would say: the Muppets are funny, silly, often nonsensical, \"A Christmas Carol\" is touching, heartwarming, but often very sad, I kinda felt like the movie wasn't funny enough to be a \"Muppet movie\" (of course it is because it features all the muppets but the spirit is different) and wasn't serious enough to be \"A Christmas Carol\", so something in between. That may disappoint you if you go watch it thinking it would go all out on a certain aspect of the idea of \"The Muppets Christmas Carol\". But I really like the fact that one of the known versions of the story is by the muppets with Michael Cane. Just knowing that makes the world a bit better.",
            "review_date": "2021-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the fourth Muppet film, but the first released by Disney. Plus the first to be released after the death of Jim Henson. This is a retelling of Charles Dickens's 1843 novella A Christmas Carol as only the Muppets could do. Michael Caine played Scrooge in this version and while he might not be the best Scrooge ever captured on screen, he does a good job here. I do question his musical ability and casting him in a musical. Kermit does feel different with Brian Henson as his performer, but I think Jim Henson's son does capture the character well. Gonzo and Rizzo are the narrators for this version and their comedic antics throughout the film worked well for me. I also think that the Muppets on the whole do add to the story and provide a unique comedic take on the classic tale. The music for this film is fine. \"One More Sleep ‘til Christmas\" is a new classic Christmas song in my humble opinion. The Muppet movies that follow this one also tell a classic story through a Muppet lens. This one is the best of those. I think this is a must watch and I bring it out every Christmas to see it again.",
            "review_date": "2021-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's better than it has any right to be, and Michael Caine's Scrooge is a surprisingly compelling interpretation of the character.  A kid-friendly and heartwarming adaptation.",
            "review_date": "2021-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "greatest christmas film ever made and it's not even close, great songs, michael caine is excellent, and it's muppets. anyone who reviews this lower than five stars belongs in prison.",
            "review_date": "2021-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing but bangers. Top 5 Christmas film.",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppet Christmas Carol is one of my favorite adaptations of Charles Dickens' classic holiday tale. Michael Caine takes his role as Ebenezer Scrooge so seriously, which adds some real power to the story. And while Jim Henson's absence is sadly noticeable, and the musical numbers are hit and miss, The Muppets still add the needed warmth and emotion to this film to make it traditional Christmas viewing in my home.",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppet Christmas Carol is a bit too sappy, bland and tame for my taste. Aside from the amazing puppetry, I expected a telling of one of Charles Dickens' darkest yet most hopeful stories told by some of Jim Henson's most beloved characters to be a little more interesting and a lot more memorable.",
            "review_date": "2021-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny enough, this may just be my favorite version of the Dickens classic. Each viewing just makes me enjoy it more and more. It's just such a fun, warm spirited Christmas flick, with some great songs, and one of the all time great performances of Scrooge.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best version of A Christmas Carol. Michael Caine's perfectly serious performance among muppets who break the fourth wall is what makes it amazingly fun. Plus is has some great songs",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it made tod fall asleep & i could see the puppet strings",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a classic. The Muppets really add everything to this. Loved it growing up, and still do",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh meu god!\nThe best, The best❤️",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Classic movie. Go see it now!",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible music with inspirational lyrics. You’re insane if this movie doesn’t put a smile on your face. I watch it every year and love every single second of it. ",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppet Christmas Carol is an underrated classic. For children, it's a good first look into the stories from Dickens. At the same time, it's just a very good movie for young and old. The songs are very goog en it's even scary sometimes.",
            "review_date": "2020-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was exciting to see Muppet Christmas Carol on the big screen. This year (2020) has been a pretty rotten year and \nsocial distancing requirements have made some of our Christmas traditions difficult. Muppet Christmas Carol back in theaters was the perfect pick-me-up for us!",
            "review_date": "2020-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you don't love this movie, you need the visitations of three ghosts--even if it's not Christmas.",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Muppets! Dickens! Christmas! Michael Caine’s best performance. Makes me smile.",
            "review_date": "2020-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true Xmas classic, not only for the interpretation of Dickens' Christmas Carol but as the Muppets have gained iconic status in pop culture, and this movie is one of their best.",
            "review_date": "2020-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of things are really well done. But the most important thing could have done so much better. And that is the music. Although performed with the best of spirits, the songs are just too middle of the road to make you root for the story, the characters  or feel the Christmas cheer. It surprises me because everything else is mostly great. So next time muppets, get good musical songwriters!",
            "review_date": "2020-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "6 bags, a big ol turkey, and an invitation to the Fozziwig Christmas Party! This movie is the best adaptation of Dicken's classic tale, with enough fun and heart to watch with the family again and again (and again). Michael Caine really brings his A game in this one and does an amazing job bringing the world to life. It really looked like he lived in a world of Muppets! The CGI is amazing, like they had Caine walk on raised platforms above the Muppeteers just like Ian McKellan did in Lord of the Rings! The score and songs are great too, even the sad one that was inexplicably cut and added back as an extra - be sure to watch it because it's meant to be there and makes the reprise at the end all the more special. I was visited by 3 spirits the night after I watched this and the ghost of Christmas future showed me the bleak shadows of what may be if RT never makes me a super reviewer. The lesson here is to live in the past, the present and the future, and we're living it with the 531 movie journey. Quit being such a Scrooge, RT. It's Christmas time after all!",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not just the best Christmas movie ever but also one of the best movies of all time in my opinion!\nSo hilarious and sweet and just simply amazing to watch. I know the script off by heart and I still fill up with emotions whenever I watch it. Gotta have the love is gone song though!",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine acting his best chops off with hand puppets all around him? I know, it sounds awesome, but it's just plain awkward.",
            "review_date": "2020-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most endearing muppet movie of all time, and one of the most wonderful Christmas movies to date. End of story.",
            "review_date": "2020-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This will always be one of my very favorite Christmas movies. It's incredibly charming and heartwarming, as well as very funny. Gonzo as the great Charles Dickens and Rizzo the rat as his sarcastic side kick are brilliant and a real stand out for me in an already great movie. You'll laugh, you'll cry and it will leave you with a warm cozy feeling when it's done.",
            "review_date": "2020-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is heartfelt and funny. This is one of the best Muppet movies and it is a must-watch.",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun enough even if you don't love the Muppets",
            "review_date": "2020-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ultimate Christmas movie, and anytime feelgood movie. \nBrilliant performances by Michael Caine, and Gonzo.",
            "review_date": "2020-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 if it its the version that includes \"the love is gone\" song, 4 without it.",
            "review_date": "2020-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other than the fact that it has been done so many times before and the ghosts aren't already existing muppets, the Muppets Christmas Carol provides for one of the best Christmas movies ever. It has such a charming feeling to it and brings fun and joy wherever it goes. The songs are catchy and memorable and Micheal Caine gives a brilliant performance as Scrooge.",
            "review_date": "2020-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "People love this rendition, but it just doesn't take off for me.",
            "review_date": "2020-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Growing up this is the movie I would watch at Christmastime and the songs, the funny, the heart, the story all weave together to be my favorite (if not, one of my favorite) Christmas movies of all time!",
            "review_date": "2019-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know...before writing this review, I had never seen The Muppet Christmas Carol. I've, in the past, before I started writing reviews on RT, seen the Jim Carrey Christmas Carol movie, Mickey's Christmas Carol and even the Looney Tunes version. But I've never seen the story as told by the Henson family. Until now. I don't think this is one of the greatest adaptations of the Charles Dickens tale but I understand why most people have fond memories of it. It is still an endearing Christmas movie with good songs and decent puppeteering which rises on the strength of Michael Caine's performance as Scrooge since he treats the Muppets as though they were normal people like you and me rather than just mere puppets. Since I didn't grow up with Kermit the Frog and his pals, I can't say I love this version of the timeless story but it is still a decent introduction for children to one of the most iconic pieces of literature.",
            "review_date": "2019-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We all know the story of A Christmas Carol. It works for a reason. Add in the classic Muppets charm and a delightful performance from Michael Caine and you've got a winner.",
            "review_date": "2019-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent! Very sweet, cute characters,heart warming and funny!",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a great version for children. Michael Caine is just as good as you'd expect, which means he hands in one of the better performances of the role I've seen. It's genuinely funny and charming. What's missing is some of the intensity, drama, and yes, horror of the original version. It is a ghost story, and ghosts are supposed to be scary. Still worth your time.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A whimsical retelling of this classic tale that almost hits the mark.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect Christmas movie",
            "review_date": "2019-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the finest, most creative adaptation of the Dickens classic that i have ever seen. Better even than Patrick Stewart's.  Michael Caine plays it straight. The songs are fantastic. The Marley brothers are hysterical but truthful.",
            "review_date": "2019-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine is brilliant as Scrooge!",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas classic. End of.",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Christmas movie of all time, the best Muppets movie ever and certainly the best version of A Christmas Carol there will ever be",
            "review_date": "2019-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Muppet Christmas Carol Pros: Good Acting/Voice Acting Passable Directing Decent Screenplay Fine Cinematography Acceptable Editing Great Puppetry Brilliant Musical Score & Songs Provides a faithful adaptation while trying to be its own thing, which also helps out the film’s pacing (for the most part) Cons: Some of Michael Caine’s delivery can be a bit off The story can feel a bit rushed at times Overall Grade: B+ (8/10)",
            "review_date": "2019-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever made I love it and watch it every year.",
            "review_date": "2019-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece. My favorite adaptation of the Dickens story. a loving and wonderful film full of heart and joy. A tradition that belongs in every family.",
            "review_date": "2019-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although there are better adaptations of this story I challenge anyone to watch this without getting a big smile on there face by the end",
            "review_date": "2019-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Christmas movie. One to watch every year.",
            "review_date": "2019-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a mappettian adaptation of cristmas carol very funny and interesting, this film knows how to expertly blend the humor of the muppets with the depth and gloom of the story in itself making it for this a marvellous movie",
            "review_date": "2019-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although The Muppet Christmas Carol doesnâ(TM)t really work as an adaptation of the beloved Dickens novel or as a Muppet movie, it nevertheless works on its own terms for a niche audience. Itâ(TM)s the kind of high concept family film that can be carted out every Christmas season with boxxy software app and enjoyed.",
            "review_date": "2019-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I haven't seen this since I was a kid myself so it was a delight to sit down with Felix and share this, even if we're a bit late watching it in January.  I'll still always prefer Mickey's Christmas Carol for sentimental reasons but this is still up there, the songs are great, it's funny and quite moving as well.  Ordered on DVD for next year.",
            "review_date": "2019-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This charming rendition of Dickens' most famous tale sees our Muppet friends putting smiles on all the family's faces.",
            "review_date": "2018-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly, it stays very faithful to the book, quoting many passages and having many scenes introduced by Charles Dickens himself (Gonzo).  I felt that the staging, settings, and characterisations also seem modelled on my favourite film version of the story (with Alastair Sim in 1951).  It was fun to remember the various muppets from The Muppet Show (those from Sesame Street are absent here), playing bit parts.  The major roles are taken by Michael Caine (Scrooge) and Kermit (Bob Cratchit).  Paul Williams wrote the songs -which are pretty bland and not up to the level of 1970's Scrooge (with Albert Finney).  In places the story seems abbreviated, particularly when showing Scrooge as a youth in love, but this was probably for the best as attentions of the under 9 crowd were wavering at that point.  There is a lot of comic relief, mostly from Rizzo the Rat and Gonzo (as narrators) but the Ghost of Christmas Yet to Come might be scary for some.  Caine does fine but nothing spectacular. This is the first project for the muppets after Jim Henson's death and it is dedicated to him.",
            "review_date": "2018-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All i have to say is. What are the critics who gave this bad reviews smoking.",
            "review_date": "2018-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite muppets movie, and my favorite addaption of a Christmas Carol.",
            "review_date": "2018-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it does not surpass the classic scrooge 1935 and 1951 but it is a classic retelling with the Muppet they did a good job on it.probably my favorite Muppet movie",
            "review_date": "2018-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still an entertaining xmas film, even now.",
            "review_date": "2018-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nostalgia trip everytime. Such a brilliant adaptation of a classic.",
            "review_date": "2018-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie as long as you watch the original newer versions cut out the scene when love is gone. It is crucial to character development an arguably one of the best scenes in the movie.",
            "review_date": "2018-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas classic!\n\nDirector Brian Henson captures his father Jim Henson's warm spirit with his brilliant take on Charles Dickens' classic novel. The Muppet Christmas Carol (1992) is a holiday season favorite of mine.\n\nThe pace is quick, the songs are memorable, the writing is funny, but also heartfelt, and the puppetry is masterful as always with the Muppets.\n\nMichael Caine is fantastic as Scrooge. His greed, cruelty, and malice is self -evident. Then, his turn into the kind and caring man of the past, present, and future is something to behold. I think Caine really nails the tears in the eyes performance necessary for adding warmth to Scrooge's tricky character. He truly gives a phenomenal performance here.\n\nI think every family should watch The Muppet Christmas Carol each Christmas time annually. It is as fun and humorous with the same depth every time I revisit it.",
            "review_date": "2018-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a muppet Fan, it is good to bring back the classics from Brian Henson 9/10",
            "review_date": "2018-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great for kids now hear it is charming to watch ",
            "review_date": "2018-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great for kids sweet to watch at Christmas or any time my favorite character is Kermit I find him funny as all ways. ",
            "review_date": "2018-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SOMEONE NEEDS TO DUST OFF THOSE PUPPETS! THE GRIME IS MAKIN' MA EYES WATER! Dickens and Muppets are such a great combo; the biting dialogue, meta-textual storytelling, the mixture of heart and humor. The best Christmas Carol film adaptation ever. Deal with it.",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my fave xmas movies ... but Micheal cain cannot sing to save his life XD",
            "review_date": "2017-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great for all ages of the family.",
            "review_date": "2017-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Christmas movies ever made",
            "review_date": "2017-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best version of this Christmas classic!",
            "review_date": "2017-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've never warmed to the Muppets, and this Dickens parody hasn't changed that. If you like twee puppetry and heavy-handed jokiness, fine. But if you prefer your Carol darker, scarier, more serious, avoid. Caine is fine in the early parts, but is eventually swamped by the cutes.",
            "review_date": "2017-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and full of cheer the Muppets Christmas Carol brings the classic tale to life with its love able cast of actors and muppets alike.",
            "review_date": "2017-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Muppet movie and my favorite adaptation of the many adaptations of Charles Dickens' classic.",
            "review_date": "2017-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this show.  This and Polar Express are my 2 favorite Christmas movies.  Yes, even more so than It's A Wonderful Life...which I do like.",
            "review_date": "2017-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Christmas film ever produced. Classic muppet wit juxtaposed against a serious but beloved Michael Caine. The set and feel of the film is so cozy and perfect : it's better when watched on a video tape rather than DVD because it's given extra fuzzy orange lighting. The songs have gone down in my mind as the best xmas songs ever. Overall is just a perfect childhood film",
            "review_date": "2017-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Delightful from beginning to end. This is an every-year holiday must.",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the greatest versions of the story. stunning music and humour. easily the best muppet film",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm glad I saw it with Dana. It was a fun movie and I'd be happy to watch it again sometime. I'm not a big enough fan of the Muppets to really love it, but the story was true to the original with some added songs and extras.",
            "review_date": "2017-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Christmas fare! It's not Christmas unless this film is watched! Great songs, perfect casting of Michael Caine and the Muppets what is there not to like?",
            "review_date": "2017-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily the best Muppet's movie ever, A great take on the classic tale, Some catchy songs, Funny humour, Michael Caine was great but some bits may scare younger kids but there's allot of fun to be had.",
            "review_date": "2016-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Muppet Christmas movie starring the guy who plays Alfred in the dark knight trilogy. This is a great Christmas movie with the Muppets. The Muppets could never go wrong, even though this movie isn't starring a Muppet but an actual human being. It feels like a Muppets movie but at the same time has a seasame street vibe to it with the people. I thought this movie would be bad because Kermit the frog isn't starring the movie but the guy who plays Ebenezer sgrooge does a fantastic job , I love the story of Ebenezer srooge , it's just feel good movie.",
            "review_date": "2016-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't think of a single reason not to give this 5 stars. A perfect version of classic Christmas tale.",
            "review_date": "2016-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppets add a bit of joy in another adaptation of the beloved Christmas Classic",
            "review_date": "2016-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely worth a yearly watch... CHRISTMAS!!!!!!!",
            "review_date": "2016-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unfortunately this movie gets edited for time a lot. Worth renting or buying DVD to see all the songs. Michael Caine is a Great Scrooge.  Just had it's 24th anniversary.",
            "review_date": "2016-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect holiday movie",
            "review_date": "2016-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ebenezer Scrooge (Michael Caine) is a grumpy business man who is an active hater of Christmas, thinking that people shouldn't waste potential working days for leisure time. On the next holiday season, he receives some special visitors who try to show and convince that the true meaning of Christmas is one worth celebrating.\n\nI think the Muppets are very entertaining and can be very funny; I enjoy their comedy shows and I appreciate how diverse the cast is, which helps remember most of them. Their feature length films, though, I feel can be either fairly entertaining and funny (such as \"Muppets from Space\" or \"Muppet Treasure Island\") or annoying and weird (like \"The Great Muppet Caper\").\n\nFor this film, I thought the humor was well balanced to be enjoyable for kids while also appealing to adults who might have grown with these characters. Most of the Muppets have their own moments to showcase their talents but they are not annoying. The musical sequences are good. I don't know if I would say amazing, but they work for this Muppet movie.\n\nThe human cast also does a fine job. Michael Caine has the characteristics of what you might imagine Ebenezer Scrooge to be like: grouchy, a snob, but also a sad man at his core. I don't know most of the other cast members, nor would I probably recognize them by name, but they did well in their parts by showing their Christmas spirits.\n\nBeing an adaptation of Charles Dickens' novel \"A Christmas Carol\", the movie develops its plot well enough to stand on its own while respecting the original story, for the most part. If anything, the last scene of Christmas Past feels a little bit too rushed to get the full feel of Scrooge's motivation of his dislike for Christmas. I thought his character changes in the movie were well done with the songs because they have at least some time to be good. The theatrical edition of \"The Muppet Christmas Carol\" was going to have a song also showing Ebenezer's Christmas past, but apparently it was taken out of the final film because the filmmakers thought it was too hard to understand for kids. Thank goodness for the special edition where we actually listen to that song. Such a shame it was taken out.\n\n\"The Muppet Christmas Carol\" is a mostly beat for beat retelling of the Dickens classic, while having a blend of its Muppet style to go along with it. And honestly, it doesn't need to do anything complex for its story; it should just have good songs, storytelling, and performances to be good. And it is really good.\n8/10",
            "review_date": "2016-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It would be natural to assume that this would be a regular holiday cash maker, overly sentimental and soppy and another Hollywood butting of a classic novel. The only thing is, it isn't.",
            "review_date": "2016-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good kids movie and a good music! A good Christmas movie or at any time!!",
            "review_date": "2016-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well done retelling of the classic Christmas story albeit with a few too many narrative interruptions, often with little purpose other than for the sake of telling an unneeded joke.  The original Christmas songs are absolutely dreadful, but they're often sung with such joyfulness they can be forgiven.  \"The Muppet Christmas Carol\" is a nice, unstuffy alternative for the kids -- old and young -- in your home.",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine was a great Scrooge. Though he shouted more than the book version did, he did scared and remorseful very well. He didn't break down in the end as much as I thought he should, but I think I just like my Scrooge to have a full meltdown. We are supposed to believe this guy went from miser to charitable, happy man. So the old needs to be completely broken down. Overall enjoyable.",
            "review_date": "2016-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you don't love this don't talk to me",
            "review_date": "2016-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You'll get the music stuck in your head until next Christmas.",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's lots to love here, particularly Michael Caine's deadly straight take on Scrooge.",
            "review_date": "2015-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute adaptation of the Disney classic with songs, comedy and a funny Michael Caine as Scrooge.",
            "review_date": "2015-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another spirit hauntsÂ The Muppet Christmas Carol: that of Brian Henson's father and Muppets creator, Jim Henson, who died just two years earlier. While the Muppets' fourth feature film is brimming with wit, sharp humor and memorable musical numbers, a palpable sense of sadness hangs heavy over the production. It permeates every scene, every reflection on death and regret, every puppeteer's work, even the way Kermit's head droops or his smile fades seems to whisper \"we are not what we once were.\" And yet Jim Henson's legacy is alive and well inÂ The Muppet Christmas Carol. Brian Henson, his puppeteers and the Muppets themselves refuse to let a day pass wasted, even in their grief, and allow their sadness to not only invade the production but to inhabit it, enrich it and make it a more sincere, emotionally poignant film. Watching Kermit and Robin as Cratchet and Tiny Tim -- a loving father who devotes every ounce of his strength to his work and his son -- is suddenly utterly heartbreaking and incredibly moving. Seeing Scrooge learn what Jim Henson spent his days teaching -- to live life to its fullest, bringing joy to others whenever possible -- suddenly resonates unlike any \"Christmas Carol\" adaptation before or since. Realizing Brian Henson is coming into his own, in complete, confident command of his craft -- on his feature film directorial debut no less -- is suddenly wonderfully satisfying. \"We are not what we once were\" suddenly translates to something else entirely: \"This too shall pass. We are exactly what Jim wanted us to be.\"",
            "review_date": "2015-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the second best Christmas film in my opinion.  Superb.",
            "review_date": "2015-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The muppets Christmas carol is a Christmas classic that everyone has most likely seen about once in there life. The film has great songs, they are very catchy and fun. It's great to see the muppets all in it and I like how they are all handled. Michael Caine is excellent, the film's funny yet has dark moments. It's a very fun Christmas movie and a classic. B+",
            "review_date": "2015-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine is brilliant as Scrooge. The Muppets are also amazing!",
            "review_date": "2015-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classy, charming and fun take on a Christmas Carol. This movie deserves much higher reviews than just 69%. Since you would think it is impossible not to like.",
            "review_date": "2015-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A charming and cheerful family version of the Charles Dickens classic starring the Muppets. Might not be the best of either Christmas Carol or the Muppets and Michael Caine's performance as Scrooge I think could use just a little bit of work, but The Muppet Christmas Carol is a pretty good way to introduce kids to the story.",
            "review_date": "2015-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good it have some great songs it's sad sometimes!",
            "review_date": "2015-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The classic novel portrayed by everyone's favorite puppets.",
            "review_date": "2015-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "80% on my Tomatometer.",
            "review_date": "2015-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the muppets.I love the story A Christmas Carol.I love Micheal Caine.Ipso facto I love this movie.",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best Muppet or Christmas Carol film, but still a very good movie.",
            "review_date": "2015-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sir Michael Caine deserves a gold medal for the best Ebenezer Scrooge. This was the one I grew up with as a 9-year-old kid. Before I was able to speak, I used to like Scrooge McDuck playing Scrooge. Now I tend to like this one far more. All the other actors playing Scrooge either deserve a silver medal or a bronze medal. Like Sir Patrick Stewart deserves a silver medal for the best Scrooge personally. This Christmas Carol is fun to watch. All the other Christmas Carol adaptations bore me or they don't entertain me as much as this one.",
            "review_date": "2015-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best version of this story, in my opinion. As everybody knows the story like the back of their hand, there needs to be something interesting to make it worth watching. Special effects don't do it for me so the Disney version missed the target. The comedy of the muppets does make a significant difference.",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often very funny and boasting the usual Muppet charm and Michael Caine, The Muppet Christmas Carol is a solid retelling of Charles Dickens' classic tale.",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my Christmas tradition and has been for nearly 20 years. It's a terrific story. \n\n\"God bless us, everyone.\"\n\n-12/24/14",
            "review_date": "2014-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great adaptation of Charles Dickens' classic tale.\n\nFunny, fun and entertaining for all ages, yet without losing its profound and essential Christmas message.\n\nHaving a Muppets version of A Christmas Carol is a masterstroke.  Makes the story and theme more accessible by kids, and keeps adults interested too.\n\nI even didn't mind the singing...\n\nGreat performance by Michael Caine as Scrooge.  I doubt there has been a better performance of the role.  Special effects are fine, especially for 1992. \n\nA movie for the entire family.",
            "review_date": "2014-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A childhood favorite of mine. The Muppet Christmas Carol is the Muppets version of A Christmas Carol. Scrooge (Michael Caine) is a total grinch when it comes to anything. The holidays have made him especially bitter. Anyone who is older than ten should know the story from here, so I won't waste anytime explaining the ghosts and such. Overall, a fantastic little film with a Muppet twist. Funny for kids and adults and a film I can't recommend enough for the holidays!",
            "review_date": "2014-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Muppet Christmas Carol\" is not really my favorite Muppet movie, but it does provide some good laughs as well as seeing your favorite Muppets. Michael Caine does a fine job as Scrooge, and the songs were pretty good. I do recommend this movie. Check it out!",
            "review_date": "2014-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best and only film to watch at Christmas! A must see every year!",
            "review_date": "2014-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How can you not absolutely love this movie!?!? A must watch every year for me at Christmas time :)",
            "review_date": "2014-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know this is over 20 years old, but I only watched now. And now is as a good a time as any..",
            "review_date": "2014-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppets put their own musical spin on this Dickens' tale for youngsters who will find it fun and amusing.",
            "review_date": "2014-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I haven't watched this since elementary school, but its timeless nostalgia is perfect for the season. That nostalgia is only enhanced by the fact that this was an exquisite effort of craftsmanship in 1992. This is a film that could have been made even 1 year ago and the world would still find it appealing in production values and narrative. It's held up for 2 decades and for many decades to come.",
            "review_date": "2014-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As hard and as ruthless as a rose pedal...\n\nThe Muppets retell the tail of Ebenezer Scrooge from the infamous Charles Dickens tale A Christmas Story.  We see Scrooge (as a human, not a Muppet) surrounded by Muppets that either work for him or owe him money.  Scrooge is a ruthless man despite the kindness of the Muppets; however, Scrooge will be visited by three ghosts who hope to change his path before it is too late.\n\n\"If he came in a flavor you can bet it would be sour.\"\n\nBrian Henson, director of Muppet Treasure Island, Jack and the Beanstalk: The Real Story, and episodes of Sid the Science Kid, Nightmares and Dreamscapes, and Dinosaurs, delivers A Muppet Christmas Carol.  The storyline for this picture is fun and very well delivered; while it follows the original plot, it has its own fun Muppet spin.  I also loved Michael Caine playing Scrooge (perfect choice).\n\n\"Why are you whispering?\"\n\"For dramatic emphasis.\"\n\nThis is another film my daughter and I grabbed off Netflix and adored watching together (she was totally wrapped up in the characters and story).  The Muppets are so fun and the mix of comedy with the entertaining Muppets in unique settings was beautiful.  I strongly recommend seeing this and potentially adding it to your DVD collection to watch with your children annually.\n\n\"I'm a stone you can't squeeze blood from.\"\n\nGrade: A",
            "review_date": "2014-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun take on a classic Christmas story with muppets that has great heart and holiday spirit. I love to watch it during the holiday season. I would recommend watching this if you like holiday films and muppets.",
            "review_date": "2014-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Muppet-tastic version of the holiday classic. Michael Caine is a wonderful embodiment of Scrooge, playing it super straight, while the narrators Gonzo & Rizzo (as well as all the other Muppets) ham it up. I'm thankful Jim Henson's son kept the dream alive!",
            "review_date": "2014-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful, hilarious version of Charles Dickens timeless classic!",
            "review_date": "2014-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie to watch with the kids.",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know it's not a perfect movie, but it has so much nostalgia. I watch it every year and sing-a-long as I do so.  This is one of my favorite Muppet movies of all time.",
            "review_date": "2014-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Muppets.  A Christmas Carol.  Michael Caine.  Need I say more?",
            "review_date": "2014-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Muppets movie. Michael Caine is pitch-perfect as Ebenezer Scrooge, and the Muppets do a great job playing all the other characters in the story, particularly Kermit and Miss Piggy as Bob and Mrs. Cratchit. 10/10.",
            "review_date": "2014-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an extremely odd to say, especially since this is the muppets we're talking about, but I think this is one of the best versions of A Christmas Carol put to film. It's heartwarming, funny, occasionally irreverent, and it stays true to the spirit of the book. Great songs and an unforgettable warmth. Only a few other versions are as complete and as powerful as this one.",
            "review_date": "2014-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I had to rank all the Muppet movies, I'm only missing the most recent film, Most Wanted, from worst-to-best it'd be in this order:  Muppets From Space, Muppet Treasure Island, this movie, The Great Muppet Caper, Muppets Take Manhattan, The Muppet Movie, and the excellent 2011 reboot.  So you can see that this is a middle of the road, in terms of quality, for the Muppets.  With that said, it's still a pretty good movie.  The problem is that, while A Christmas Carol is STILL an excellent story of a man's redemption, I don't think the Muppets really work well when trying to fit into the framework of a story that's been told thousands and thousands of times.  There's still the musical numbers, there's still the clever humor that breaks the fourth wall, Miss Piggy is still great...there's just less of it this time around, because they're working within the confines of this book. Not that I can blame them for that, but it's still a little disappointing that there wasn't as much Muppet greatness as there is in other, original, films.  With that said, if there's one thing I liked about this movie more than any adaptation of A Christmas Carol I've ever seen, and that is Michael Caine's performance.  I think he's, head and shoulders, the best Ebenezer Scrooge there has been.  I think his performance isn't as notable because he IS surrounded by Muppets and all this absurd humor, but that doesn't make it any less effective or heartfelt.  This guy is incredible here.  It's not anything Oscar worthy, but it is an excellent performance that makes this film worth it even with its flaws.  It's probably not even the best adaptation of this story that has ever been made.  I even thought about it raising the rating to 3.5, but I genuinely think this film is just good.  I just think the lack of real Muppet insanity held this movie back for me.  But that's just me.  But this is a good movie nonetheless, this story will always bee a good one and with Caine's excellent performance, then this is at least worth a watch.",
            "review_date": "2014-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK WOW! Some of these critics must pass around some really good drugs or something to kick the percentage down to 69%.  This film had a great production value, wonderful songs, and still tried to stay true to the book while at the same time giving it a little Muppet flare/sparkle and humor that audiences know and love.  Micheal Caine does a great job playing a Muppet movie as a human role should be.  Play it straight, play it real, be in the film the same way you would be with other actors not just Muppets.  This was the first film after the sad passing of Jim Henson.  A serious amount of work went into this film to still make it what Jim would have wanted.  A lot was on the line and needed to be proven and boy did they deliver!  \n\nI made this account on this site only because I could not believe the low percentage when I saw it and just couldn't sit still.  I am sure I will be labeled an  \"Muppet Fan Boy\" and I do enjoy the films, The Great Muppet Caper is not that stellar in my opinion so I understood the low percentage but this for me just could not stand.\n\nThank you for your time.\n\nSincerely,\n\nThatguy97d",
            "review_date": "2014-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a good version of the classic tale.",
            "review_date": "2014-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine is marvelous as Scrooge, but his performance is severely diminished by the Muppets, sad to say.",
            "review_date": "2014-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let's not beat around the bush. I adore The Muppet Christmas Carol. Since my parents bought it for me on VHS back in 1993, it is the only Christmas film that I make a point of watching at least once every year. Taking one of the greatest stories ever written from one of the greatest writers of all time and making at least a half-decent film out of it shouldn't be too hard a task. Yet, there are films out there which have completely failed to make anything decent out of Dickens' story and some have even managed to somehow make it boring.\n\nThe biggest problem anyone faces with adapting A Christmas Carol is making it stand out from the other versions of it. To say there's an overabundance of adaptations is a radical understatement. On that basis, you'd think that one of the key ways to help your version stand out is by adopting a gimmick. There's so many failed examples of this though. The last high-profile adaptation was Robert Zemeckis' take on the story with Jim Carrey as Scrooge. The gimmick? Motion capture animation and 3D. Exactly what the story didn't need. Elsewhere, you've got modernizations, a potentially decent idea, but I can't name one that worked. I know some will stand up for Scrooged, but, for me, it was OK at best. Then there's A Christmas Carol 2000, in which ITV decided that a modernization with Ross Kemp playing Scrooge was a good idea.\n\nIt wasn't.\n\nSo, why does The Muppet Christmas Carol work? The main reason is it's refusal to resort to any level of pretentiousness, a real sticking point for some of the worst versions of the story. Here, there is no belief present that they can add anything to the story or make it better, because they know that they can't. Instead, they take the story and everything that's great about it. Then, most crucially of all, they make sure that The Muppets themselves are made to fit around the story, rather than the other way round. I'm not providing a synopsis. If you don't know the plot, where have you been? In addition, I'm also not going to worry too much about avoiding spoilers from this point on.\n\nIn this adaptation, Michael Caine plays Scrooge and, frankly, it's inspired casting. Scrooge is a character that demands an actor with credibility, but the presence of The Muppets would mean that a lot of actors out there would not have taken this role seriously and would have completely phoned in the performance. Caine's not doing that here. He's crafting what I honestly believe to be one of his best performances. The usual style of performance for Caine wouldn't have worked here and it's refreshing to see little to none of his usual mannerisms present here. He delivers a fantastic interpretation and one that feels human, rather than the overly animated cartoonish performances (hello again, Jim Carrey) that we often find ourselves subjected to. That's not to say he's relatable. He's every bit as reprehensible as he should be, but because he seems like a real person, it means that his development over the course of the film feels legitimate and, in no way, forced. As for his singing and dancing, you'll just have to learn to forgive him for that and realize that it could be worse, you could be watching him in Jaws IV.\n\nThe presence of Caine also helps in another matter, as he makes sure the story is respected, allowing a balance to form between that and the antics of The Muppets, who fill most of the other roles. Kermit takes the biggest role of Bob Cratchitt and is really the only instance of a Muppet playing it straight, with the exception of a Kermit Jr. playing Tiny Tim. Elsewhere, the Muppets are pretty much kept to the comedy characters, as they should be. Rizzo's playing the sidekick to Gonzo's narrative performance as Charles Dickens and while Fozziwig may seem an obvious joke, it's a necessary one.\n\nTo be honest, the only place where the presence of a Muppet is fumbled is in Miss Piggy playing Emily Cratchit, or rather Miss Piggy playing Miss Piggy, but going by the name of Emily Cratchit. The jokes work fine for her. Piggy's not exactly my favourite Muppet, but the traditional and necessary elements of her character worked here. The problem is when they expect us to take her seriously as the grieving mother. It just doesn't work and renders what should be one of the most poignant moments of the story feeling a little bit hokey. To be honest though, it probably won't bother you too much and, as my score will demonstrate, it's not something that gets held against the film. In the long run, it's a minor gripe.\n\nThen, we have the Muppet-style comedy transitioning into the Dickensian world and there's only one word to describe how they've handled this. Masterful. First off, it;s actually funny. A requirement that shouldn't need stating about comedy, but I watched Disaster Movie last week and learnt that, apparently, it does. There's also the flawless way that each joke fits into the story without feeling like it's intruding. Each joke is fast and to the point and, crucially, they don't dwell on them. The joke happens, you laugh and they head straight back to the story, meaning that the focus is never lost. They also don't feel the need to saturate every scene with them. The 15 (or so) minutes assigned to The Ghost Of Christmas Yet To Come is pretty much devoid of jokes, relying almost entirely on the words of Dickens to bring out any humour, but, for the most part, keeping the necessarily morbid tone that the scenes require. As a result, that element of the story feels particularly powerful, as we're left to focus on Scrooge's despaired realization of where his actions will take him. If the earlier jokes weren't funny, this wouldn't have felt anywhere near as strong as it did and it also wouldn't provide the relief and joy of the final moments as we return to the jovial nature that dominates the rest of the film.\n\nFinally, there are the songs. I'll say it now. Musicals are not my thing. I would much rather someone just tell me how they feel, rather than sing it to me. Yet, despite that, I love a lot of the songs from the film. I'm sure it helps that I first heard them when I was 6 and far less discerning than I am now, but regardless they are well written songs and my only issue comes from the deletion of one of them. Again, this is not something I will hold against the film as it is entirely down to studio interference, rather than creative choice. The song that's deleted is called When Love Is Gone. It's not the best song and it's almost overbearingly shmaltzy. Despite this, removing it causes far more issues than the quality of the song ever would. The most noticeable is a jarring edit, one of the worst I've ever seen in my life. Even if you haven't seen this film with the song included, you'll almost definitely still notice it and it won't sit right with you. Added to this are the facts that it almost makes the entire character of Belle border on pointless as she's gone faster than she arrives, as well as rendering the whole point of the film's final song effectively moot.\n\nI found myself not sure how to end this review, because I kind of stated my conclusion in my introduction. I also would like to think that my love of this film has been summed up. So, I'll end with this. This review is my first perfect score that I've posted. This is probably more to do with the fact that it's Christmas time more than anything else. When I think about it though, The Muppet Christmas Carol is probably the first film I ever saw that I would have given a perfect score back then and still give a perfect score to now. On that basis, I think it's a fairly appropriate first.",
            "review_date": "2014-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Christmas movie; I have to watch this every year!",
            "review_date": "2014-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable telling of the traditional Christmas Carol story in Muppet style and great job by Michael Caine",
            "review_date": "2014-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know; the Muppets, in this one, came to life",
            "review_date": "2014-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dull and tedious effort. Even the fabulous Miss Piggy cannot cheer things up.  The only plus points are the delightful songs written by Paul Williams and the creative cinematography.  But these elements are insufficient to lift the Christmas spirits.",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite muppet movies",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A surprisingly decent adaptation, The Muppet Christmas Carol is funny, nicely scripted, and features a typically great performance from Michael Caine.",
            "review_date": "2013-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It doesn't do the greatest job delving into the drama for Scrooge or Cratchet, but the Muppets do their job in making a classic story funny and entertaining for kids and adults. Caine is also a more gentler interpretation of Scrooge that makes this movie work.",
            "review_date": "2013-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine gives a heartfelt & much better performance as Scrooge than one would expect from a Muppet picture. Yet it is still very much a wacky Muppet picture.",
            "review_date": "2013-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a fun version of the classic story by Charles Dickens. There are many funny and amusing moments in the movie. Michael Caine does an excellent job playing Scrooge. If you are a fan of The Muppets and Christmas movies you should then check this one out.",
            "review_date": "2013-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may not be the most subtle and dramatic adaption to grace the silver screen, but The Muppet Christmas Carol is probably the most heart-warming version on the screen because of it's hilarious script and it's tender performance by Michael Caine, who brings the usual panache of his dramatic airs to the role.",
            "review_date": "2013-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to hate the muppets and they own spoof's. this movie is funny and they Didn't mess up the story just like other spoofs and the Jokes are not forced or rushed it felt fresh and new.",
            "review_date": "2013-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not very funny, and one of the weaker adaptations to the classic tale. I didn't like it as a kid, and I don't really like it now.",
            "review_date": "2013-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't like Michael Caine playing Scrooge with the supporting cast being Muppets Go all Muppet or not at all!",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full review at: http://worldofblackout.blogspot.co.uk/2013/12/review-muppet-christmas-carol.html\n\nAs timeless as the story it's based on, The Muppet Christmas Carol should be on every Christmas watch-list. Every single frame is an absolute joy to watch, and it's great to see an audience full of youngsters and their parents totally rapt for the entire duration of the film.",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After a huge blow in the passing of JIm Henson, the Muppets regroup and deliver a comedic Christmas classic headed by a great interpretation of Scrooge by My Cocaine",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched: 19 Dec 2013",
            "review_date": "2013-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An xmas classic...growing yp I used to watch this all the time. Michael Caine is awesome as Ebaneezer.",
            "review_date": "2013-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a near perfection, like most early Muppet movies.  First, what is bad about the film.  Well, I have to say, I was most disappointed with the three spirits (not the Marley(s)).  It starts out as Statler and Waldorf as the Marleys (Jacob and Robert), then the original ghosts that follows.  Well, they are original designs, not like what I was expecting.  The are creepy looking and not portrayed by the other in the muppets universe.  Other than that, This is my Favorite Christmas movie of all time.  There is nothing wrong with the story, it is very genius and heartwarming.  Michael Cane at his best.  I love the use of the sets, the songs, and this is a great tribute to the late great Jim Henson. I would recommend it if you were disturbed by the newer Christmas Carol with Jim Carey.  I give it an A",
            "review_date": "2013-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, if not completely magical. Michael Caine's delightfully gruff Scrooge is a match for even the best of the puppet performances. The flaws - Scrooge softening too early and too easily, the incredibly creepy (in the wrong way) ghost of Christmas Past, the rushed wrap up at the end - don't detract too much from the heartfelt charm, good spirits, and wry humor of the film. Although Christmas Past is really distractingly unsettling to look at.",
            "review_date": "2013-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quintessential Christmas viewing. Kids need to see this on the big screen. Muppets continue to evoke hearty laughs years after release. Caine is game as Scrooge and the film is better for it.",
            "review_date": "2013-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The muppets do a great job as the characters from the story, and it neatly balances the drama of the Dickens classic while throwing some (by some, i mean lots!) of muppet humor.",
            "review_date": "2013-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas carol has been overdone for me and so it has to work extra hard for me to like it. The muppets as a whole never really grabbed me. But my husband is muppet obsessed, and that is why I bought him all seasons of the muppets one year for Christmas. \nWere it not for him I'd probably never see this movie again. But I might as well have put it in my vows that we will watch it every Christmas as long as we are married. :p",
            "review_date": "2013-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those that just gives me the warm fuzzies.  heartwarming.  I love the songs; the muppets are charming as always, and Michael Caine is great as ever.",
            "review_date": "2013-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this film. I really do. But what The Muppet Christmas Carol suffers is that the musical numbers aren't up to Muppet perfection (which is disappointing cause the songs were written by Paul Williams, who wrote excellent Muppet material in The Muppet Movie) and Michael Caine isn't really that compelling of a Scrooge. That being said, The Muppets are entertaining as always (particularly Gonzo and Rizzo narrating the story and Statler and Waldorf playing the Marley brothers) and this take on the Charles Dickens Christmas classic is a smart way to introduce children to this timeless Christmas treasure. It may not be the greatest Muppet film, but it certainly isn't the worst to come out of The Muppets (Muppets From Space anyone?).",
            "review_date": "2013-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my absolute favorite Christmas films and, in my opinion, one of the finest Scrooges in Sir Michael Caine.",
            "review_date": "2013-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see every year",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bah, Humbug!\n\n\n\nFor the record, I am not only a cold hearted son of a bitch, but I have never actually seen a muppet movie until now and I can easily say without a doubt that this is a classic. \n\nIt has catchy and highly memorable songs which do show inspiration and occasionally serve as exposition which makes things all the more amusing. The puppetry is absolutely outstanding, once again a top notch job from the Jim Henson studio.\n\nMichael Caine's performance as Ebenezer Scrooge was dark, tragic and fun to watch. He didn't do any wacky, crazy slapstick, he played it straight. Very, very straight. The supporting cast of Muppets and humans alike are also top notch which means that you are more likely to feel for the characters.\n\nRemember that first thing I mentioned at the start of this review? Well, this applies in real life and I will admit that I actually felt bad for Scrooge at times which is also a delightful advantage of Michael Caine's performance. After I watched it, I felt hopelessly jolly to the point of not being able to recognise any other december holidays.\n\nGive this a watch, I strongly recommend this movie.",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though far from the best of Muppet Movies: The Muppets Christmas Carol is a fun Christmas movie with lots of laughs, smiles, and overall fun.",
            "review_date": "2013-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Muppet's adaptation of the Charles Dicken's seasonal favourite, with Michael Caine headlining as Ebenezer Scrooge.\n\nHe has to give the role his all, too, as he is acting against the likes of Kermit the Frog, The Great Gonzo and Miss Piggy: no mean feat, indeed!",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just about perfect :)",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite adaptation of the story!",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny introduction to the famous tale. And a good performance by Michael Caine however this Scrooge is written horribly.",
            "review_date": "2013-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "replacing characters with muppets, however loveable they may be, is not a good enough reason to endure yet another retelling of this over told tale.",
            "review_date": "2013-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! For a Muppet movie this one is pretty serious in tone. Michael Cain is great as Scrooge and i really like how Waldorf and Statler are Marley and Marley. Definatley the best Muppet movie and undoubtedly a great adaptation of the Dickens tale.  (I also like the design of the ghosts. Their not dumbed down too much.)",
            "review_date": "2013-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It somehow isn't quite Christmas yet until this starts playing in the family room.",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppets and Michael Caine create the best adaptation of the Charles Dickens book.",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not my most favorite version of the classic but you can never go wrong with A Christmas Carol.",
            "review_date": "2013-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its not just for Christmas - this is a great film for anyone wanting to turn their lives around!!  Love those muppets!!",
            "review_date": "2013-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of our favorite Muppet Christmas movie for our Childhood in 90s",
            "review_date": "2013-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty solid kids Christmas movie, with Michael Caine stealing the show. The Muppets are good, but they're not as essential as most of their movies, more just pleasant additional extras! Pretty true to the source - Scrooge gets visited by the ghosts of Christmas past, present and future and decides to stop being such a crap human being - the end. Still, it's simple, short & sweet.",
            "review_date": "2013-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite having its slow moments, it's a great movie to watch during for holidays. It also gets the bad taste of The Muppets Take Manhattan's songs out of my mouth.",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a funny Muppet version of the classic tale.",
            "review_date": "2013-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Muppet films and one of my childhood favourites.",
            "review_date": "2013-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppet Christmas Carol",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all-time favorite childhood movies. A pure, distinguished classic. Unafraid of making the darker side of things more jolly than life it's self.",
            "review_date": "2013-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid introduction to the Dickens classic for children with lots of typical Muppet humor and features a fantastic preformance by Michael Caine as Scrooge who makes one of the best Scrooges yet but beyond adding our favorite felt made characters adds little new or particularly clever to the story we have seen too many times",
            "review_date": "2013-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remains faithful to the classic novel and as spirited as a Muppet film can go.",
            "review_date": "2013-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really warm and fuzzy feeling movie.. Great to bring out that holly-jolly-ness in christmas time =)",
            "review_date": "2013-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this version of A Christmas Carol. Michael Caine is probably my favorite Scrooge. The only pitfall in this movie is the \"Love Is Gone\" musical number (awful), which I guess they cut out in recent re-releases.",
            "review_date": "2013-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watch this EVERY YEAR. \r\n\r\nThis and Scrooged.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not....an amazing adaptation of The Charles Dickens Classic but the fact that it's funny heart warming and able to keep both adults and Children(the group it's more aimed at) entertained is a good reason to watch this",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Adaptation of the Christmas carol",
            "review_date": "2013-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite version of this story!",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good christmas movie.",
            "review_date": "2013-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the Muppets!!!  :D",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Muppet film. So good! A seasonal must! GREAT SONGS!!!",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite simply, THE greatest Christmas movie of all time.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I reread A Christmas Carol every year and having Gonzo narrate allows more from the book than other versions. Mixed with the zaniness that only The Muppets can bring makes this my favorite version.",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All those great Muppet touches and Caine is also perfect as Scrooge. Not too scary for kids. With better songs it would be a total classic.",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that is great, but was saved by the Statler and Waldorf music.",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The muppets and Michael Cane, brilliant",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The finest Muppet movie so far, with Michael Caine triumphing as Scrooge in possibly the best screen interpretation of the character. Of course when you're up against felt glove puppets you're going to shine... Right?",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Humbug\".\r\n\r\nI don't have a traditional film in watch each year at Christmas like most do. I tend to just watch whatever's on - but this is the 2nd year in a row I've watched this film and I think it'll be my 'tradition'. I'm not fond of christmas films they get too cheesy and sentimental for my liking - incredibly cringe worthy springs to mind.\r\n\r\nBut 'The Muppet Christmas Carol' I like - in fact I'd say it's great. There's no point in explaining the story everyone knows it. But it comes with a 'Muppet' twist with their patented brand of comedy. 'Gonzo' narrates the story up to the point where the ghosts appear. 'Caine' is 'Scrooge' and as expected puts in a fine performance.\r\n\r\nI don't need to say anymore its a classic in most peoples eyes and I'd almost be incline to agree with them. Its undoubtedly a fine film but it isn't funny enough for my liking. I don't have any problems with the film as such. Its just not constantly brilliant - but it never dips and will no doubt keep your attention.",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this movie because I liked the characters",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow you have to wait a while for  Miss Piggy but when she comes there are  a few of her. A good xmas film",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How friggin' cute was this film?  Michael Caine was a wonderful Scrooge.  A nice retelling of an often told classic.  Great film to introduce your children the story!",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppet Christmas Carol is neither a worthy adaptation of Dickens' classic work, nor is it a one of the better Muppet installments, but the sights gags and the elegant songs render it a worthwhile tradition.",
            "review_date": "2012-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my families Christmas movie traditions!",
            "review_date": "2012-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great version of A Christmas Carol, the Muppets made it funny :)",
            "review_date": "2012-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun adaptation of Dicken's classic story.",
            "review_date": "2012-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This first theatrically released film starring The Muppets without Brian Henson's father on board is still just as great. Jim Henson may have left, but his spirit is still there.\n\nFor my full review of The Muppet Christmas Carol (1992), check it out on this IMDB link: http://imdb.com/title/tt0104940/reviews-139",
            "review_date": "2012-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great christmas classic! In my opinion, the best muppet film & the best film adaption of A Christmas Carol! It's also one of my childhood favourite's.",
            "review_date": "2012-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have seen this many times since the first time I saw it in theaters back around Christmas of '92. \nStill enjoy it to this day.\nWatched it on Blu-ray and it looks and sounds great!",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion there are 3 great film versions of the Christmas Carol. The 1951 Alastair Sim film Scrooge, the 1988 Bill Murray Scrooged and the Muppet's Christmas Carol. If you can see any of these before Christmas then it will really get you in the mood for a good  celebration. I think seeing this film has finally got me in the Christmas mood. Not just a great Children's film but a great film.",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine for the big 'uns to enjoy, and muppets for the little 'uns. Good stuff for the festive season.",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As you might expect with a Muppet movie, The Muppet Christmas Carol is adorable, charming, and fun but it's no work of art with a disjointed tone of drama and light comedy, the same can be said about Caine's performance which is still a delight to watch. Then again, it's a Muppet movie, so you shouldn't be expecting much else.",
            "review_date": "2012-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent retelling of the story with Muppets, but can't hold a candle to the classics of either the Muppet movies OR the Christmas Carol's.",
            "review_date": "2012-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Happy 20th anniversary.  Still good for a few laughs :)",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome version of A Christmas Carol!",
            "review_date": "2012-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great adaptation of the classic tale with the Muppets and the brilliant Michael Caine.  Fun to watch and very christmassy!  (14.12.12).",
            "review_date": "2012-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best adaptation I have ever seen, with actual dialogue taken from the book and Michael Caine as Scrooge. Great songs and heartwarming in a way that only the Muppets can get away with.",
            "review_date": "2012-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far the scariest version I have ever seen of A Christmas Carol.",
            "review_date": "2012-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Christmas film EVER.",
            "review_date": "2012-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Christmas film of all time?! Very possibly! I love it.",
            "review_date": "2012-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty faithful telling of the story with muppets in some key parts.  Gonzo and Rizzo steal the show, as does Animal in a small part.  Cain is an ok Scrooge but he turns nice to fast.  Still a great Christmas movie and one of the better Muppet movies.",
            "review_date": "2012-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another Christmas classic!!!",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid decent film that provides intrigue and keeps you entertained throughout.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "20 years on and Kermit hasn't aged a day! Anyway, Muppets, Michael Caine, Charles Dickens and Christmas... you can't go wrong!",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Takes me back to being a kid at Christmas time which is the greatest thing ever! Fact. Bias rating but who cares invokes good memories",
            "review_date": "2012-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remains faithful to the classic novel and as spirited as a Muppet Christmas film can go.",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cute and clever depiction of Charles Dickens' A Christmas Carol that the kids are sure to love!",
            "review_date": "2012-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Henson was without a doubt, one of the most creative minds in both television and movies during his life.  So it goes without saying that in his death, the world lost both a great person and a great mind.  Considering the success of movies such as Labyrinth, The Dark Crystal and The Muppet Show, following up the success of those features while paying tribute to the Henson's memory at the same time would not be easy.  However, Disney and Henson's son made a valiant effort to accomplish both tasks with the release of The Muppet Christmas Carol in 1992.  Now twenty years after the original release of that story Disney has re-issued it onto a new Blu-ray/DVD combo pack for a whole new generation of audiences to enjoy. \n \nThe Muppet Christmas Carol is just one of any number of renditions of Charles Dickens' classic literary tale.  There are so many different takes on the classic tale that it would seem that one needs a program to tell them all apart.  This modern take on the classic tale is enjoyable first and foremost for its general structure.  Rather than trying to be just another take on Dickens' story, it comes across as a stage play on screen instead of a movie.  The sets and musical numbers alone give it that feel.  And the cast's acting adds to that feel, too.  Veteran actor Michael Caine (Secondhand Lions, Batman Begins, The Dark Knight, The Dark Knight Rises) does an expert job leading the cast as the infamous Ebenezer Scrooge.  While Caine does an extraordinary job as Scrooge, it's The Great Gonzo and Rizzo who take the story's other light.  Unlike other versions of A Christmas Carol in which the narrator is only heard and not seen, Gonzo takes on the mantle of Dickens, helping to guide viewers through the story on screen.  In its own manner, this is actually a visual aid of sorts for viewers.  It's a very valuable aid, too.  The comic turns between Gonzo and Rizzo add for even more entertainment for viewers, as well.  Audiences will enjoy the pair's physical comedy throughout the movie.  At one point, Rizzo falls down a chimney with rather warm results.  And the pair gets knocked off more than one window sill as it attempts to help viewers follow the story.  These are just a handful of examples of how the cast's acting makes The Muppet Christmas Carol enjoyable for the family.  The acting aside, there is at least another aspect that makes this two decade old story enjoyable even today.  That aspect is the movie's general presentation.  \n \nThe acting of both Caine and the puppeteers does a lot to make The Muppet Christmas Carol a believable and enjoyable story.  But it's not all that contributes to the movie's success.  The on-screen stage presentation is what really puts The Muppet Christmas Carol over the top.  As noted already, there are so many renditions of A Christmas Carol out there that it's tough to keep them all straight.  Among that mass of different takes are movies that are obviously take offs of that story, just with different titles.  The Muppet Christmas Carol does the exact opposite of those adaptations.  Rather, it opted to pay homage to the original in its own way.  Instead of trying to be another movie adaptation of the original story, it takes the avenue of being a stage play complete with enjoyable musical numbers and sets that make audiences feel as if they're watching a play on screen.  Combined with the acting, the musical numbers and sets will pull audiences in with ease and keep their attention throughout the near hour and a half story.  And for those audiences who perhaps might have to get up during the movie for any reason, they are treated to something very special courtesy of the bonus \"Intermission\" feature.  The \"Intermission\" feature allows audiences to pause the movie and enjoy extra musical numbers courtesy of other members of the Muppets cast.\n \nSpeaking of bonus features, the bonus features presented in the previous DVD presentation of The Muppet Christmas Carol are carried over to this new Blu-ray/DVD combo pack along with a pair of new additions.  The \"Intermission\" feature is one of that pair of new features.  The other new feature is an interview with Jim Henson's son Brian Henson, who helmed this new take on the holiday standard.  The manner in which the interview was conducted is worth its own share of laughs.  That's because Henson shares the moment with Gonzo and Rizzo.  The three discuss different aspects of the film and behind-the scenes stories that will keep the entire family especially entertained.  It's just one more part of the whole that makes the new 20th Anniversary Edition of The Muppet Christmas Carol fun for the whole family this and every holiday season.",
            "review_date": "2012-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's magic in the muppets that never grows old - never more so than in this festive favourite which includes Michael Caine playing straight to Kermit and Miss Piggy.",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good family fun film for Xmas.\n\nWe watch it as a family EVERY 1st December!",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine is in this \nAHHH YEAH",
            "review_date": "2012-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie just makes everyone happy in the family. So it's one of the fav of the holiday season. The story is not corrupted and the meaning remains as pure as possible with a lot of muppet twists in the middle, funny for older and younger ones. As they say at the end of the movie, if you liked it read the book!",
            "review_date": "2012-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie just makes everyone happy in the family. So it's one of the fav of the holiday season. The story is not corrupted and the meaning remains as pure as possible with a lot of muppet twists in the middle, funny for older and younger ones. As they say at the end of the movie, if you liked it read the book!",
            "review_date": "2012-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "me and my son love this and wastch it all year round",
            "review_date": "2012-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's nearly that time of year to break this one out!!!!! For the children of course!!!",
            "review_date": "2012-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard for any of the 1990's Muppet movies to escape the shadows of the first three classic entries in the franchise starring the charming creatures. \"The Muppet Movie,\" \"The Great Muppet Caper,\" and \"The Muppets Take Manhattan\" are looked at by many to be Jim Henson's sacred trilogy of films starring the beloved characters. \n\nThe title is a good indication of what viewers can expect from \"The Muppet Christmas Carol.\" Michael Caine is old miser Scrooge, who plays straight to a cast of everyone's favorite critters including Kermit the Frog, Miss Piggy, Fozzie Bear, Gonzo, and the rest of the gang. He's visited by three angels on Christmas Eve who teach him the importance of the holiday and showing good will toward men.\n\n\"The Muppet Christmas Carol\" isn't a bad movie. It's just another unnecessary re-telling of a classic Christmas tale. The concept of adapting Charles Dickens' short story and adding wacky characters or updating it was already played out even in 1992. I'm sure children will find it amusing, but their parents will be catching a quick nap amongst the tiny laughter.\n\nMichael Caine is absolutely perfect in the role of Scrooge. He pours his heart and soul into it. The fact that he is surrounded by Jim Henson's hand puppets doesn't affect his performance at all. As far as Caine's concerned, he's starring in a version of the famous tale surrounded by other Oscar-winning actors.\n\nThe film provides good clean family entertainment for everyone. I'm sure it'll be and is considered essential viewing for many during the holiday season. Just don't expect the magic and wit you get when watching 2011's \"The Muppets.\" \n\nhttp://contributor.yahoo.com/user/849014/eric_shirey.html",
            "review_date": "2012-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's not Christmas until you've seen this\n movie",
            "review_date": "2012-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the muppets what do you expect ;)",
            "review_date": "2012-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All time favourite Christmas film, have watched it ever year since release. You must let you children see this film, it will enchant them for eternity.",
            "review_date": "2012-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Christmas just wouldn't be the same without it.  Period.",
            "review_date": "2012-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best versions of a christmas carol ever.",
            "review_date": "2012-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a very fun and really enjoyable Disney live-action family film. It had very impressive special effects, fantastic puppetry, excellent performances, great music, great characters, very excellent cinematography, lots of laughs and a great storyline. It's one of the best Muppet movies I've watched. I highly recommend this movie to both kids and adults.",
            "review_date": "2012-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brilliant one of the few versions of A Christmas Carol I can watch anytume of the year.",
            "review_date": "2012-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a staple for me every Christmas. A wonderful, joyous, hilarious film, and my favourite version of the Dickens classic. The Muppets never disappoint.",
            "review_date": "2012-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Cane as Scrooge? And with Muppets? Sweet.....",
            "review_date": "2012-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love it, Christmas is not the same without it",
            "review_date": "2012-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best version of a Christmas carol, it has been a Christmas tradition to watch this film on Christmas eve in our house for years and will be for years to come:-)",
            "review_date": "2012-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually my favorite Scrooge, Micheal Caine plays the role straight while the muppets around him are silly.",
            "review_date": "2012-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Christmas movies I know.",
            "review_date": "2012-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the top five Xmas movies!!! whats urs",
            "review_date": "2012-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great christmas coral film",
            "review_date": "2012-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Christmas film ever.",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not really Christmas time until I watch this!",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hello Mr Humbug  here comes Mr Scrooge  delightful!",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute classic. A joy for youngsters & the not so young. My number 1 Christmas move now & always",
            "review_date": "2012-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite of all the Muppets' films and my favourite adaptation of the Christmas Carol book, this has a successful blend of their traditional humor with a close and sometimes deep and emotional representation of Dickens' classic story. It will make you laugh, make you cry and make you love the Muppets and Christmas Carol just as much as before.",
            "review_date": "2012-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I adore this movie. We watch it every holiday season.",
            "review_date": "2012-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love 'A Christmas Carol' it is my favourite seasonal tale, but the Muppets make this the best re-telling of all. There's something for children and adults of all ages. Just wonderful!",
            "review_date": "2012-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you love The Muppets you'll love this film!  Gives a warm Christmassy feeling o even the most bah-humbug of people.  Enjoy and Merry Christmas!",
            "review_date": "2012-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my fav version of a christmas carol!",
            "review_date": "2012-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie somehow manages to be one of the most accurate adaptations of the Dickens book, while also being a musical comedy starring puppets.\nAnd a damn good one at that.",
            "review_date": "2012-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the only good rendition",
            "review_date": "2012-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In memory of Jim Henson.\n\nPLOT:The Muppets take the classic story of the Christmas Carol to the big screen. Charles Dickens (The Great Gonzo) tells the story of a Christmas Carol with Rizzo the Rat. Ebenezer Scrooge (Michael Caine) is a cheap, bitter old man who hates Christmas and everything to do with. When Christmas Eve falls, his apprentices come back from the dead to tell him that three ghosts are coming to show him things and try to change him. It's the basic Christams Carol plot, but it's executed warmly.\n\nACTING:The Muppets were the Muppets and there's nothing to that. Caine did a pretty good job as Scrooge, but I don't believe he was the best at all.\n\nSCORE:This is actually what I love best about this movie; the songs. The songs were written by the brilliant Paul Williams, and they are brilliant as well. Each song is catchy, melodic, and gives of a warm and fun feeling (aside from my least favorite, \"The Love Is Gone\"). The score itself isn't too bad either.\n\nEFFECTS:The effects this movie had were actually pretty intricate; from the morphing doorknob, to the sparkling loss of Christmas Present, to the harrowing portals of Christmas Future. The effects actually had effect!\n\nOTHER CONTENT:Now, this is a pretty good portrayal of Charles Dickens' classic story, but it's most definitely not the best. They say this is a wonderful introduction of the tale to younger viewers, and I agree; the Muppets put a certian charm in it with their humor and beloved family following, but the accuracy to the book is somewhat lost and the culture is lowered. The Muppets give it charm, but take away accuracy.\n\nOVERALL,an ok Christmas Carol with a warmly executed plot, good acting, brilliant score, intricate effects, and the Muppets' charm, but with that charm comes loss of culture.",
            "review_date": "2012-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Generally unfavorable. Too slow and not \"Muppety\" enough for many people's liking.",
            "review_date": "2012-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's cute, but that doesn't make up for lazy screen writing and poor cinematography. The sets are wonderful and some moments are a lot of fun, but there are much better Muppet films and much better Christmas Carol films.",
            "review_date": "2012-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a wonderful story told throughout this film. Kids of all ages will enjoy it.",
            "review_date": "2012-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all-time favorites!  Michael Caine singing",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My childhood reborn, Since the new release of the Muppets Movie (2011) i've been back tracking down memorylane.\nAnd boy, what a treat it was to travel through the best story ever told \"Charles Dickens Christmas Carole\". I fell in love all over again with Michael Caine's uncanny portrayal of Scrooge and of coarse the Muppet Gang tackling laughter, endearment and a highly renowned classic done perfectly.",
            "review_date": "2012-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the Muppets, what more can you say? 4.5 out of 5.",
            "review_date": "2012-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine as Scrooge...what's not to love?",
            "review_date": "2012-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this...its a really good remake of a classical tale..a big must!!",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty hilarious dialogue, wonderfully memorable musical numbers amazing use of puppetry and a lovely understated  performance by  Michael Caine make this Christmas film a winner!",
            "review_date": "2012-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sweet Christmas adaption film starring the Muppet and Michael Caine.Isn.t that heart-warming when you saw a Pro-Actor like Michael Caine and act with dolls.Even you stand under a cold zero temperature's degree,inside your heart is still warm.My favorite Christmas film.",
            "review_date": "2012-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppet Christmas Carol is not nearly as good as I was expecting and hoping, but it's still a lot of fun. \n\nOne thing I should clarify, is that if you came to see the muppets, you will probably be disappointed. This film is all about Scrooge, who is played by a very human Michael Caine. This is truly, the biggest flaw in The Muppet Christmas Carol, because with the muppets getting so little screen time then they deserve, this adaption of the Dicken's story doesn't have much to separate itself from other adaptions. \n\nGonzo narrates, and Rizzo the Rat is there to make jokes. This potentially amusing duo isn't very funny, and is only there to move the story along. In fact, they feel a lot like filler. \n\nAnd speaking of filler, did I mention all the songs in this movie? I believe there were 6 or 7 songs total. Though the one at the beginning is somewhat entertaining, and a genius number by the Marley brothers is highly enjoyable, most of the songs are tedious and dull. They exist only to extend the running time. \n\nYou will be seeing a lot of Michael Caine, which should be obvious because he plays that star, Ebeneezer Scrooge. I expected to see more muppets than humans, but this proved incorrect. Michael Caine performs adequately as Scrooge, but in the end, his performance is a little underwhelming. Also, during the musical numbers, it always seems like he has nothing to do. \n\nWhen the muppets get into the act, the film is more enjoyable, but this certainly isn't first class muppet material. It feels like B-movie muppet material, and that was certainly a disappointment. \n\nThe movie adapts the classic faithfully, and there are lots of fun scenes. And even among a lot of dull songs, there are a couple gems. I just expected so much more from the ever-dependable muppets, and I can't help but feel a little let down. \n\nAbove average Christmas tale, under average muppet film.",
            "review_date": "2012-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charles Dicken's seasonal favorite is retold once again in \"The Muppet Christmas Carol.\" Full of music, Muppets and mirth, this is the perfect holiday film for the entire family.\nWhile not the best of the Muppet films -perhaps the restrictiveness of the story held them back- it is still characteristically imaginative and entertaining.\nMichael Caine plays the cheerless Scrooge- king of \"Bah, Humbug.\" With the exception of some supporting bits, his is the only human performance. While not complex, his presence makes it memorable.\nThe remainder of the characters are filled by familiar Muppet faces; with Gonzo and Rizzo the rat as a pair of omnipresent narrators. All of the favorites are here, including Kermit, Piggy, Fozzie, Beeker and Animal. In addition, there is a whole city full of Muppet extras playing the roles of various citizenry, animals, fruits and vegetables.\n\"The Muppet Christmas Carol\" is a visual treat with Muppets and Humans intermixed throughout. Coordinating the variety and density of performers -both those on screen and off- was a major accomplishment; and one that pays off with rich, active scenes that always offer something new for the eye. Even after all these years, I continue to be amazed at the range of expression obtainable from the Muppet creations.\nThe film also contains some first-rate special effects; utilized primarily during the visitations of the Christmas spirits. Blended in with the live action, they are both impressive and effective.\nThat the youthful nature of the audience was always in consideration is made apparent by Rizzo's repeated inquiries of Gonzo during the more \"intense\" scenes. Gonzo (Aka Charles Dickens) justifies the exposure as \"culture.\" Similarly, the more horrific elements of the story, such as the ghost of Christmas future, have been imagined with young viewers in mind.\nThe film introduces a handful of original songs written by Paul Williams. They range from average to excellent, yet all are staged with plenty of energy and enthusiasm to keep the story moving along.\n\"The Muppet Christmas Carol\" is rated G, providing enough sophistication and simplicity to keep both parents and children alike entertained for the duration of the show. If this doesn't get you in the Christmas spirit, then \"Bah, Humbug\" to you.",
            "review_date": "2012-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watch it every year before Christmas, unceasingly, since I was a newborn...and I will continue to!",
            "review_date": "2012-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marley and Marley, woooooah",
            "review_date": "2012-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the greatest films ever made in history. Period. It is a heart warming classic that reminds all of us of our inner child and Jonathan Rosenbaum, Christopher Null, Henry Sheehan, Desson Thomson, Ryan Cracknell and Janet Maslin can all die in a fiery car crash for the good of the universe. If ever you want to have the piss beat out of you, please come find me, otherwise shut your ignorant mouths before you force me to find you and silence them:)",
            "review_date": "2012-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Christmas Charol adaptations are a dime a dozen, but somehow the muppets made the best one since the 1951 classic",
            "review_date": "2012-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Christmas Carol spinoff",
            "review_date": "2012-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another great muppet take on a dickens classic",
            "review_date": "2012-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think the Muppets should be in a \"Christmas Carol\" addaption due to the the depressing tone, but dispite that, this is one of my favortie Christmas movies, next to \"Prep & Landing\" and \"A Christmas Story\". Michael Caine was great as Scrooge, still can't believe in a few years he'd play Finn McMissile in \"Cars 2\".",
            "review_date": "2012-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the greatest rendition of \"A Christmas Carol\" you'll see out for the big screen. Jim Henson is definitely NOT rolling around in his grave.",
            "review_date": "2012-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know often people say everything is better with *blank* simply because they love something and can't get enough of it.  However I'm starting to believe that everything really is better with Muppets.  Who would have thought that putting a Muppet twist on the Charles Dickens classic would be so spectacular?  You'd expect it to be another cheesy take on the holiday story that is dumbed down for the kiddies, but instead it is one of the most faithful adaptations of the book.  In fact most of the lines of the human actors are straight from the source material and, while the Muppets do embellish some, the core of the story is entirely intact.  Yet what they do add is so much fun!\n\nA tip of the hat must be offered to the casting department for what they did here.  Michael Caine is the perfect Scrooge, and I'm actually surprised he hadn't played the role before on film.  However it's not just the human cast that rocks.  They found great voice actors to fill in for the late Jim Henson.  While it's noticeable that the voice of iconic characters like Kermit are slightly different, the personality is still there.  Plus the voices of the first 2 ghosts are perfect.  This movie continued the Muppet tradition perfectly, which is difficult without the founder himself.  Perhaps the Muppets will never be quite the same without Jim Henson, but the magic still lives on.\n\nThen we must talk about the wonderful music.  These tunes are catchy and very well written.  They add to the story and are inserted in a way that doesn't stop the pace, but just keeps it rolling.  However, perhaps the greatest aspect of this film is the addition of Gonzo and Rizzo as narrators.  Whenever the story hits a slow moment these guys come in and break the tension.  Their antics are hilarious and keep the humor in what is often a very serious drama.  I really can't muster anything negative to say about this film.  Muppet Christmas Carol is simultaneously a faithful adaptation of classic literature, and a laugh-out-loud romp.  Everything is better with Muppets!",
            "review_date": "2012-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While there are better adaptations of this Dickens classic, and better Muppet movies for that matter, 'The Muppet Christmas Carol' succeeds on many levels.  It's filled with great songs, funny gags, and not to mention, a truly great performance by Michael Caine as Scrooge, rivaling those of even Sir Patrick Stewart and George C. Scott.",
            "review_date": "2012-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watch this movie with my family every Christmas and  I do like some of the songs. I only took off half a star because of Michael Caine's singing. Sorry, Michael, you're a good actor, but please leave the musical aspects to your puppet co-stars.",
            "review_date": "2012-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic and a tradition",
            "review_date": "2012-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great for the kids and any Muppet fan.",
            "review_date": "2012-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the Muppets! This movie is simply funny!!!",
            "review_date": "2012-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ha ha ha, I love this movie",
            "review_date": "2012-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite versions of The Christmas Carol. I watch it every year!",
            "review_date": "2012-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppet Christmas Carol is one of the most cherished films of my childhood, so nostalgia may be compelling me to give it a higher ranking than it deserves. Still, whenever I watch this adaptation of Charles Dickens' classic fable, I am struck by its humor, heart, beautiful sets, great puppeteering, and general tone. Michael Caine is a great Scrooge and Brian Henson proves to be a worthy successor to his father's legacy.",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nicely done Muppet movie with such delightful songs and scariness.",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unless you're too full of tryptophan from the previous days feasting,  the plot to The Muppet Christmas Carol is well known. Ebeneezer Scrooge (Michael Caine) is visited by three spirits over the course of Christmas Eve, who help to bring back his festive joy.\r\n\r\nAs to be expected, aside from Caine, most of the main parts are played by the titular gang. So, we have Kermit as Bob Cratchit, Miss Piggy as his wife, The Great Gonzo as Charles Dickens, Statler and Waldorf as the brothers Jacob and Robert Marley (Yeah, I know...), even Kermit's nephew gets in on the action as Tiny Tim. The spirits are new creations, with the Henson team having resisted the temptation to have them played by others in the Muppet canon. A move that works well. It's hard to think the resonance of Scrooge seeing his potential would have been as strong if the Ghost of Christmas Yet to Come had been played by original choice, Gonzo!\r\n\r\nDespite the prefix, Muppet, in the title, this is a very straightforward telling of Dicken's classic. It's not in the same vein as, say, The Great Muppet Caper, where Fozzie et al would break the fourth wall and give plot points away before they happen Caine recites lines from the set text with barely a knowing glance to the camera. However, don't think it's all straight faces, this is the Muppets. Expect talking vegetables, ice skating penguins, and hardcore republican Sam the Eagle desperately pretending to be English.\r\n\r\nAll in all, it's a wonderful 90 minutes and deserves to be on anybody's list of Christmas viewing. But beware, as this is a straight-ish tale... Tiny Tim will die. If you thought you couldn't be moved by a felt pig and frog, then think again.",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OH I loved this movie as a child, And I still enjoy it.",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An instant christmas classic. Catchy and fun from start to finish",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVE this movie. Muppets rule the world.",
            "review_date": "2012-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good christmas movies are few and far between.  Lemme just say that it's very hard for Kermit to screw up anything; he's the michael jordan/ Bill Gates/ Wal-mart/ Tiger Woods of movies.  He can't fail!",
            "review_date": "2012-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i love this movie, its too funny",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the Muppets! One of my favorite Christmas movies.",
            "review_date": "2012-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious and fun! Only the Muppets know how to turn A Christmas Carol into an amazing film. With a little help from Michael Caine.",
            "review_date": "2012-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppet Christmas Carol is not nearly as good as I was expecting and hoping, but it's still a lot of fun.  \r\n\r\nOne thing I should clarify, is that if you came to see the muppets, you will probably be disappointed.  This film is all about Scrooge, who is played by a very human Michael Caine.  This is truly, the biggest flaw in The Muppet Christmas Carol, because with the muppets getting so little screen time then they deserve, this adaption of the Dicken's story doesn't have much to separate itself from other adaptions.\r\n\r\nGonzo narrates, and Rizzo the Rat is there to make jokes.  This potentially amusing duo isn't very funny, and is only there to move the story along.  In fact, they feel a lot like filler.\r\n\r\nAnd speaking of filler, did I mention all the songs in this movie?  I believe there were 6 or 7 songs total.  Though the one at the beginning is somewhat entertaining, and a genius number by the Marley brothers is highly enjoyable, most of the songs are tedious and dull.  They exist only to extend the running time.\r\n\r\nYou will be seeing a lot of Michael Caine, which should be obvious because he plays that star, Ebeneezer Scrooge.  I expected to see more muppets than humans, but this proved incorrect.  Michael Caine performs adequately as Scrooge, but in the end, his performance is a little underwhelming.  Also, during the musical numbers, it always seems like he has nothing to do.  \r\n\r\nWhen the muppets get into the act, the film is more enjoyable, but this certainly isn't first class muppet material.  It feels like B-movie muppet material, and that was certainly a disappointment. \r\n\r\nThe movie adapts the classic faithfully, and there are lots of fun scenes.  And even among a lot of dull songs, there are a couple gems.  I just expected so much more from the ever-dependable muppets, and I can't help but feel a little let down.\r\n\r\nAbove average Christmas tale, under average muppet film.",
            "review_date": "2012-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine wizards another breathtaking performance.",
            "review_date": "2012-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They did a nice job with this. I enjoyed it, even without Jim.",
            "review_date": "2012-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Christmas ain't Christmas without this film!!! And when ever i miss the christmas spirit, i watch it to!!! Love this movie with every viber in my body!!!",
            "review_date": "2012-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Personally, one of my favourite muppet movies. (There have been FAR worse!) I find it charming, heartwarming and especially funny with Gonzo and Rizzo the Rat as our hillarious story-tellers (but not so silly that is distracts from the story at hand.) It tells the classic Dickens tale with a typical 'Muppet' twist, and as a result, is entertaining for children and adults alike. Yes I'll admit there are some stomach crunchingly cheesy moments, but as many muppet fans would agree, we can totally forgive them this. Especially when we can't help but get carried away with the happy ending... :)",
            "review_date": "2012-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and with some nice musical numbers this is not the best Muppets film but its still a high point and a fine adaptation in its own right. Not to mention enormously affecting and heartwarming, thanks mostly to the Tiny Tim sub-plot.",
            "review_date": "2012-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favourite Muppets film ^___^ Also the best Christmas Carol version I've ever seen and definitely the funniest :D",
            "review_date": "2012-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't believe that a real \"definitive\" version of Charles Dickens' \"A Christmas Carol\" has been made yet, even as it might just be the most adapted of any non-horror story (I don't know that for a fact, I'm just guessing), in the Muppets' favor, they are not at all interested in being the definitive version.  It's a different kind of Muppet feature (though it has a sort of brother movie in MUPPET TREASURE ISLAND four years later) wherein the well-established characters are cast in the Dickens roles.  Their Muppet personalities are dominant, but in most cases they match up pretty well, such as the nebbish Kermit as Cratchit, the aggressively corny Robin as Tiny Tim and so on.  Some of them, such as Miss Piggy as Mrs. Cratchit, just play the Dickens characters as themselves.  A few Muppets make original appearances, like the Christmas spirits, and Michael Caine, though arguably shown up by his Muppet co-stars is serviceable and even great in some of his moments.  The major pitfall for nearly all Christmas Carol adaptations is the tendency to roll through the motions ineffectually, relying too heavily on the familiarity of the story and never really investing.  Now, the Muppets don't strive for big emotional investment, and here the story is mostly a showcase for their antics, so it's already immune to my common Christmas Carol criticism.  Overall, it's very entertaining, with good songs, humor, and just enough pathos.  It slows a bit in the Christmas Past sequence, but it survives.  Stick with the original theatrical version though, because as the DVD and Blu-Ray contain the theatrical and an extended cut, the extended is only different by one musical number, one that slows things to a dead halt for 4 minutes.",
            "review_date": "2012-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah, I know Christmas is long gone with, but I still wanted to do a review of this movie mainly because, well, Muppets. The Muppet Christmas Carol is flawed and not exactly the smoothest ride I've sat through, but it has some entertaining songs as well as a good heart that makes it worthwhile.\r\n\r\nIf you know the story of A Christmas Carol then you know the plot of this movie. It stays fairly close to original, only adding in the muppets (with Gonzo as Charles Dickens) and some song numbers.\r\n\r\nThis was made after the passing of Jim Henson and Richard Hunt, two of the main puppeteers, so I wasn't expecting this film to be the best of the films. And it isn't, but it's not the worst either. The songs in the movie set the palette that both \"Muppet Treasure Island\" and \"Muppets in Space\" would follow years later and are pretty mixed bag. Some of the most entertaining of the songs were cut from the movie leaving us with some songs that are really good (\"Marley and Marley\" often entertains), but the majority sound almost exactly the same (\"One more sleep Till Christmas\", \"Thankful Heart\", and \"It Feels Like Christmas\" all sound almost exactly the same.) It's more than likely because they're trying to stay close to the era, but it's still a little disappointing for muppets. The jokes are a little stale, but there are some good jokes still left that entertain. Steve Whitmire (who has taken over the voice/puppetering of Kermit, Beaker, and Statler) does a good job for his first time and the other replacing puppeteers also do well. \r\n\r\nIf you're a huge fan of the muppets or have really little kids that you're trying to introduce to the Charles Dickens tale, this is a great way to start. It'll entertain kids long enough and still be fun for the adults. Most others may find it sort of silly and fun, but will be left wanting a little more. (Real Rating: 73%)",
            "review_date": "2012-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a pretty good version of the same old timeless story.  It has the traditional muppet musical spin, but when watching it with kids, it it pretty fun.",
            "review_date": "2012-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite version of A Christmas Carol.",
            "review_date": "2012-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my all-time favorite adaptation of this classic Christmas story. Muppets make it so funny and light-hearted yet it still speaks the message. The music is also great... Oh yea, and Michael Cain rocks!",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically, get any material that children struggle to understand the concept of, add muppets, add a load of fun, you have a winner of a kids' film.",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the most charming film ever released, The Muppet Christmas Carol is a funny and emotional retelling of Dickens' classic tale. Kermit, Miss Piggy, Rizzo and Fozzie all make memorable appearances, but it's Michael Caine's fantastic acting as Scrooge and Gonzo's ridiculous impression of Charles Dickens that steal the show.",
            "review_date": "2012-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine and the Muppets is all good fun and the film was well done, it cheers me up",
            "review_date": "2012-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's still as good and funny as I remember it being. This one is definitely a classic.",
            "review_date": "2011-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps my favorite version of this story",
            "review_date": "2011-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Muppets don't always combine well with Charles Dickens classic story, but the film is sure to provide entertainment for fans of either, and is at least properly anchored by some good laughs and Michael Caine's superb performance.",
            "review_date": "2011-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent Muppets movie... with added Caine for great measure. A Xmas must.",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the first Muppet film produced after Jim Henson's death and the first in collaboration with Disney. Brian Henson does a very good job with continuing his father's legacy (and in some ways he is a better film director) however, there is a sense that something is missing. Also, it is a difficult story to add the type of slapstick humor the Muppets are famous for. That said, this is a highly enjoyable holiday favorite with wonderful songs from Paul Williams.",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gonzo and rizzo the rat are the highlight of this movie",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite christmas movie. The muppets can really bring something new to the old Dickens Tale",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is even better than the human one! I love it!",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charles Dickens and the Muppets come together in the most magical way to create a brilliant rendition of the beloved classic, A Christmas Carol.  With Brian Henson at the helm, the Muppets brave a new world and deliver an enchanting film that's inspired and charming.  The Muppet Christmas Carol is a wonderfully fun and faithful adaptation that truly captures the spirit of the tale.  What's striking is just how faithful an adaptation this is; going so far as to include a Charles Dickens narrator (in the form of Gonzo the Great) who recites passages from the novel.  But even more amazing, is how well each Muppet is tailored to a Dickens character; from Kermit as Bob Cratchit to Statler and Waldorf as the Marleys.  And once more, the music is outstanding and is in perfect harmony with the mood and tone of the Dickens story.  The Muppet Christmas Carol is the best adaptation of Dickens's classic bar none, and is a touching and heartfelt film that carries the spirit of the season.",
            "review_date": "2011-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My family watches this every Christmas!  I like this version of the Christmas Carol the best.  Watched the new DVD that came out.  Was a little disappointed they didn't clean up the Full Screen version with the \"extended\" scene, but still, it's a great movie...",
            "review_date": "2011-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A favorite in our family. We faithfully watch it every Christmas and enjoy it each time a little bit more.",
            "review_date": "2011-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very clever telling of a classic tale, and a wonderful performance from Michael Caine makes this an essential movie for Muppet fans.",
            "review_date": "2011-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I grew up watching The Muppet Show and this takes me right back! It's a really nice version of the familiar story about Ebenezer Scrooge; wonderfully played by Michael Caine. There's a lot to enjoy here including sweet songs, funny moments with our Dickensian Muppets and of course the well-known festive tale about morals and Christmas cheer. A great movie that reminds us about the true meaning of Christmas!",
            "review_date": "2011-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dickens muppefied with some lovely touches but doesn't really get over average thanks to a largely forgettable score.",
            "review_date": "2011-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deduct 1/2 star 'cos it's, a bit, \"Cheesy\"?!  GOOD, though!..  Watch Once, yeah!..",
            "review_date": "2011-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Caine + Muppets + The over-told anual tale. What's not to like?",
            "review_date": "2011-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far the greatest adaptation of the Charles Dickens classic, The Muppet Christmas Carol is a delightfully festive and magical experience of nostalgia and cinematic perfection.",
            "review_date": "2011-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometime after Jim Henson's death, his son Brian would go on to direct two Muppet movies based on literary works. The first of these, THE MUPPET CHRISTMAS CAROL, which recounts the familiar story of miserly Ebenezer Scrooge's fateful Christmas Eve journey to his past, present, and future, respectively, is a genuine delight. The marriage between Dickens' immortal tale and the Muppets' humor is perfectly realized in this 90-minute musical, highlighted by both a holiday-flavored score from Paul Williams, and especially a strong turn from Michael Caine as Scrooge. His performance deserves a shout-out. Instead of mugging the camera or going for laughs, he plays the role both well and with enthusiasm, even treating his Muppet co-stars like real people. This helps make the atmosphere of people and puppets interacting believable and it lends credibility to the emotional arc of the story. The film also has some surprisingly heartfelt, moving moments that are played very straight -- the scene in the future where the Cratchit's mourn their son's death is tearjerking, as is Scrooge's long-lost love's ballad \"When Love is Gone\" (cruelly cut from subsequent releases of the film). As for the Muppets, they are perfectly assigned to the roles they are chosen to portray. Kermit the Frog, surprise, plays Bob Cratchit, and of course Miss Piggy is his wife (and yes, we get to see their offspring), and in a particularly amusing touch, Gonzo portrays Charles Dickens, who narrates the story (using actual passages from Dickens' book) to a skeptical Rizzo the Rat. The chemistry between these two is hilarious and adds another layer of entertainment to the film. What's also fun is the way that they comment on the story's appeal for audiences and how storytellers are genuinely omniscient. Not only one of the best holiday family movies of all time, but one of the Muppets' best movies ever.",
            "review_date": "2011-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "CHRISTMAS TOP TWELVE - Number 3 -",
            "review_date": "2011-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just Watched: My personal favorite christmas film. 5/5",
            "review_date": "2011-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In memory of Jim Henson.\n\nPLOT:The Muppets take the classic story of the Christmas Carol to the big screen. Charles Dickens (The Great Gonzo) tells the story of a Christmas Carol with Rizzo the Rat. Ebenezer Scrooge (Michael Caine) is a cheap, bitter old man who hates Christmas and everything to do with. When Christmas Eve falls, his apprentices come back from the dead to tell him that three ghosts are coming to show him things and try to change him. It's the basic Christams Carol plot, but it's executed warmly.\n\nACTING:The Muppets were the Muppets and there's nothing to that. Caine did a pretty good job as Scrooge, but I don't believe he was the best at all.\n\nSCORE:This is actually what I love best about this movie; the songs. The songs were written by the brilliant Paul Williams, and they are brilliant as well. Each song is catchy, melodic, and gives of a warm and fun feeling (aside from my least favorite, \"The Love Is Gone\"). The score itself isn't too bad either.\n\nEFFECTS:The effects this movie had were actually pretty intricate; from the morphing doorknob, to the sparkling loss of Christmas Present, to the harrowing portals of Christmas Future. The effects actually had effect!\n\nOTHER CONTENT:Now, this is a pretty good portrayal of Charles Dickens' classic story, but it's most definitely not the best. They say this is a wonderful introduction of the tale to younger viewers, and I agree; the Muppets put a certian charm in it with their humor and beloved family following, but the accuracy to the book is somewhat lost and the culture is lowered. The Muppets give it charm, but take away accuracy.\n\nOVERALL,an ok Christmas Carol with a warmly executed plot, good acting, brilliant score, intricate effects, and the Muppets' charm, but with that charm comes loss of culture.",
            "review_date": "2011-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In memory of Jim Henson.\r\n\r\nPLOT:The Muppets take the classic story of the Christmas Carol to the big screen. Charles Dickens (The Great Gonzo) tells the story of a Christmas Carol with Rizzo the Rat. Ebenezer Scrooge (Michael Caine) is a cheap, bitter old man who hates Christmas and everything to do with. When Christmas Eve falls, his apprentices come back from the dead to tell him that three ghosts are coming to show him things and try to change him. It's the basic Christams Carol plot, but it's executed warmly.\r\n\r\nACTING:The Muppets were the Muppets and there's nothing to that. Caine did a pretty good job as Scrooge, but I don't believe he was the best at all.\r\n\r\nSCORE:This is actually what I love best about this movie; the songs. The songs were written by the brilliant Paul Williams, and they are brilliant as well. Each song is catchy, melodic, and gives of a warm and fun feeling (aside from my least favorite, \"The Love Is Gone\"). The score itself isn't too bad either.\r\n\r\nEFFECTS:The effects this movie had were actually pretty intricate; from the morphing doorknob, to the sparkling loss of Christmas Present, to the harrowing portals of Christmas Future. The effects actually had effect!\r\n\r\nOTHER CONTENT:Now, this is a pretty good portrayal of Charles Dickens' classic story, but it's most definitely not the best. They say this is a wonderful introduction of the tale to younger viewers, and I agree; the Muppets put a certian charm in it with their humor and beloved family following, but the accuracy to the book is somewhat lost and the culture is lowered. The Muppets give it charm, but take away accuracy.\r\n\r\nOVERALL,an ok Christmas Carol with a warmly executed plot, good acting, brilliant score, intricate effects, and the Muppets' charm, but with that charm comes loss of culture.",
            "review_date": "2011-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I HATE THE MUPPETS LOVE THE FILM ONLY COZ ITS XMAS",
            "review_date": "2011-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really?  I Haven't Reviewed This?  \r\n\r\nIt's perverse, really.  I've reviewed a terrible direct-to-video Christmas movie they made with David Arquette, and it turns out I've never reviewed the good theatrical release Christmas movie.  Which I don't think I saw in the theatre; despite my family's intense association with the Muppets, we didn't see most of the movies in the theatre, for some reason.  I think probably it was our finances, though they would have straightened out by 1992.  At least mostly.  Still, I've owned this for years, about as long as any other Christmas movie in my collection, and I can't believe I've never gotten around to it.  I am fonder of it than I am of many of the classics, too; I'm not sure I own [i]It's a Wonderful Life[/i] and am not inclined to buy it if I don't.  It is also, as it happens, my favourite version of [i]A Christmas Carol[/i], though I'm notorious among my friends for the fact that I don't actually like Dickens.\r\n\r\nWe, like Charles Dickens (Gonzo the Great), know the story of [i]A Christmas Carol[/i] like the back of our hands.  Still, on the off chance that you don't, it is the story of Ebenezer Scrooge (Michael Caine, or Sir Maurice Micklewhite if you'd rather).  He is a vicious and stingy man who mistreats and underpays his clerk, Bob Cratchit (Kermit the Frog).  He is never kind or merciful and mocks the very idea of Christmas joy.  One Christmas Eve, he is visited by the ghosts of his former partners, Jacob and Robert Marley (Statler and Waldorf).  They inform him that, if he is to escape their doom, he must change his ways.  To that end, he will be visited by three ghosts, the ghosts of Christmas Past, Christmas Present, and Christmas Yet to Come.  They are what they sound like, and they show him what it sounds like they show him.  We learn what has made Ebenezer Scrooge who he is and what his eventual fate will be if nothing is changed.\r\n\r\nIt's true that I don't like Dickens and never really have.  It isn't actually true that he was paid by the word, not entirely--he was for some of his career but not all of it.  However, he did write serials and was therefore paid by the installment.  I think most of his works could benefit from judicious editing, and [i]A Christmas Carol[/i] is on that list.  (For the curious, I don't think [i]A Tale of Two Cities[/i] needs editing--when he babbles, he teaches history--and I think some books, [i]Great Expectations[/i] among them, cannot be saved.)  However, that doesn't mean he was entirely a bad writer, and my favourite part of this movie is that it captures the good lines which don't make it to other versions, because this version is Charles Dickens telling the story to Rizzo the Rat, which leaves in \"Scrooge climbed the stairs, caring not a button for the darkness.  Darkness was cheap, and Scrooge liked it.\"  This is in fact great character description, which is more important than the ludicrously whimsical names so many Dickens characters have.\r\n\r\nI think it was an excellent decision to cast a human as the main character in this, and I think they cast the perfect human.  Disney, when they did the story, had a character to slip into the role--for heaven's sake, they named him Scrooge in the first place.  But there is no Muppet for the part, and I think creating one would have been the wrong decision.  And while I know that Michael Caine is in fact a funny, charming guy, that's not the Scrooge he is able to portray and does so here.  His own origins were much lower than Scrooge's, but he seems to have a great feel for the nature of the character.  He is a somber man, a dark and dour man.  His life did not go the way he wanted it to, and it soured him.  He didn't deal with it; he held it in and let it shape him.  And Michael Caine creates that Scrooge, lets us into that Scrooge's mind and life.  It's a role played by dozens of men in TV and the movies, and I think Michael Caine is one of the best.\r\n\r\nIt does irk me that they trimmed the romantic ballad, and it irks me even more that the DVD only puts it back in if you choose to watch the film fullscreen.  This strikes me as backward; completists watch things widescreen, obviously.  I can see how little kids might find the song boring, but I think it is an important moment for the character.  This is the first turning point for Scrooge, the moment where he realizes that maybe he'd made a mistake somewhere back in his life.  He's still determined to live with that, I think, but he is finally now forced to acknowledge it, whereas he's probably spent every day since it happened pretending it hadn't.  So.  Does it slow things down?  Sure.  But I don't necessarily think that's always wrong.  There are several movies wherein my favourite scene is one that slows things down, but they're often vital to the story for all that.  And after all, it's not as though [i]A Christmas Carol[/i] is exactly non-stop action even without the song in the middle.",
            "review_date": "2011-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite version of Dickens's A Christmas Carol, with nice humor, fun songs, and an appropriate reverence toward the source material.",
            "review_date": "2011-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent. A heartwarming, impressive, and genuine christmas classic.",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great Muppet movie that gives us a unique look on an all time Christmas classic.  Michael Caine is brilliant as Ebenezer Scrooge!",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well there had to be some point where I had to finally start watching and writing reviews to some Christmas films. So let's get started with The Muppet Christmas Carol.\r\n\r\n\r\nPlot: The story is told by Gonzo as Charles Dickens and Rizzo the Rat. Mr. Scrooge is a old greedy money-lender who is more interested in profit than celebration. But on Christmas Eve, he gets a warning from the ghost of his old partners that three spirits will come and attempt make him change his old ways.\r\n\r\n...well... there's not much to say. It's Christmas Carol with the Muppets. Nuthun spectacular about that aside from the fact that it's a nice film that mixed two things that we all love.\r\n\r\nActors/Characters:\r\nMichael Caine/Ebenezer Scrooge:He was good...I just didn't care for the beginning where he made this really creepy grin over how much profit he was making at the time.\r\nThe Muppets: Fun as ever.\r\n\r\nMusic: the music was fairly nice.\r\n\r\nEditing: the editing is nice.\r\n\r\nAnd that's my review for The Muppet Christmas Carol.  I know I'm not saying a whole lot, but it's just that the whole concept of the film kinda speaks for itself.",
            "review_date": "2011-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think I've missed the boat on loving the Muppets and it seems I must've not been that much of a fan as a kid either. It was a good version of this timeless tale, full of fuzz and musical numbers, definitely one for the kids. But Michael Caine, you can do better than this (and by this I refer to his acting, not the choice to be in the movie)! This was by no means my favorite version of this story, but enjoyable nonetheless.",
            "review_date": "2011-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my families fav holiday movie.  The songs are wonderful!",
            "review_date": "2011-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Always enjoy this excellent family friendly version of A Christmas Carol by the Muppets! So funny and entertaining!",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best Christmas Carol movie, but it has heart.",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best Christmas Carol movie, but it has heart.",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this muppet reworking of Christmas Carol. Excellent cast and fun script.",
            "review_date": "2011-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite Christmas movie, period.  Check it out this season!",
            "review_date": "2011-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my second favorite version of this story",
            "review_date": "2011-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best christmas film ever",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        }
    ]
}