{
    "rating": 9.3,
    "release_date": "1994-03-08",
    "num_reviews": 170,
    "genres": [
        "Comedy"
    ],
    "summary": "Every day, Cop 223 (Takeshi Kaneshiro) buys a can of pineapple with an expiration date of May 1, symbolizing the day he'll get over his lost love. He's also got his eye on a mysterious woman in a blond wig (Brigitte Lin), oblivious of the fact she's a drug dealer. Cop 663 (Tony Leung Chiu Wai) is distraught with heartbreak over a breakup. But when his ex drops a spare set of his keys at a local cafe, a waitress (Faye Wong) lets herself into his apartment and spruces up his life.",
    "reviews": [
        {
            "content": "WHAT A DIFFERENCE A DAY MAKES\n\nChungking Express is a 1994 Hong Kong romantic crime comedy-drama film written and directed by Wong Kar-wai 🍍 \n\nMeh, it passed the time. \nJust. 😐\n👍🏼👎🏼\n\nThis is a quirky movie which has some slow sections…\n\nTwo melancholic Hong Kong policemen fall in love: one with a mysterious underworld figure, the other with a beautiful and ethereal server at a late-night restaurant he frequents.",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "An engaging film with a rather unique visual flair, really good score (despite arguably overusing \"California Dreamin'\"), realistic acting, a spontaneous plot that is naturalistic without being pretentious and some great pieces of dialogue now and then. And even though the first story, despite strong moments in both its visuals and content, is nothing I couldn't do without, the second one, where the film comes into its own, is a captivating, touching, humorous depiction of love, loss and change.",
            "review_date": "2023-02-27",
            "source": "rt"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (8/10) ; Cinematography (8.5/10) ; Plot (8/10) ; Acting (8.5/10) ; Pacing (7.5/10) = 81%}\"",
            "review_date": "2023-01-29",
            "source": "rt"
        },
        {
            "content": "Faye Wong is the most beautiful woman I've every seen in films.",
            "review_date": "2023-01-28",
            "source": "rt"
        },
        {
            "content": "One of my all-time favorites.",
            "review_date": "2022-12-30",
            "source": "rt"
        },
        {
            "content": "All the fuss about the movie is mostly related to its cinematography, which is unarguably ethereal and gives the movie a major push. However, the whole movie cannot be purely dependent on that one feature when it comes to gathering favorable reception. This doesn't mean the other present elements are no good; but rather that they simply don't meet up to the expectations and standards which the cinematography potentially sets for the movie. We're talking mainly about the storyline, which may seemingly appear gripping in the beginning, but goes on to express traits of vapidity as it progresses, combined with unneeded elongation which eventually leads the viewer to unjustifiable malaise. In all, it's a tasteful display, but only with a suitable mood prepared afore.",
            "review_date": "2022-12-17",
            "source": "rt"
        },
        {
            "content": "There is no denying the expert technical filmmaking and cinematography in \"Chungking Express.\" Every frame of this movie features a unique style that is well worth noting. The movie is essentially a presentation of two storylines, one of which I felt engaged with, and the other I found repetitive. The movie is trying to tell the stories of everyday people which is admirable, but it is just not always all that engaging. I feel like the movie starts to drag and even though it looks really nice the whole way through, the story just isn't one I connected with. Overall, it is a film that has many truly impressive technical merits but lacks in the storytelling department for me.",
            "review_date": "2022-10-19",
            "source": "rt"
        },
        {
            "content": "Brilliant cinematography, sound tracks, storyline, and all there is to a good film.",
            "review_date": "2022-09-22",
            "source": "rt"
        },
        {
            "content": "Long winded and I really don't get the hype except for some post-production editing that would have seemed really cool when first released.",
            "review_date": "2022-07-11",
            "source": "rt"
        },
        {
            "content": "\"Chungking Express\" is set on a fluorescent, impressionist and hazy Hong Kong, which is the backdrop to the romance of the young characters who wander, trying to grasp the sense of the impossible loves they chase.\nCould be a delusion of love, the constant attraction and indifference of some hesitant lovers, a wound destined to never heal; but, despite all the sufferings of which it is guilty, is the idea of love that the protagonists are in love with, which, naively, they seem to accept its elusiveness and vagueness.\nIn this parable on loss and affection, Wong creates his very particular vision of the impalpable beauty of time, different from the melancholy one of Leone or the ethereal one of Tarkovsky, but romantic and decadent.\nThe human condition is a continuous hurting each other by unrequited loves, in a spiral of incomprehensibility from which the characters seem unable to escape.\nThe fogged aesthetic with which DP Doyle distorts the perception of time is the effect of the emotional filter with which the enchanted lovers feel reality.\nWong depicts \"Chungking Express\" in two parts (originally it should have included also a third chapter which later will become \"Fallen Angels\"), enrich them with the existential monologues of the protagonists who, wallowing in their passive nihilism, give life to a choral imaginary of lonely and dreamy souls, blurry like their idea of love.\n\n\"If memories could be canned, would they also have expiry dates? If so, I hope they last for centuries.\"",
            "review_date": "2022-05-22",
            "source": "rt"
        },
        {
            "content": "Seriously, it's really hard to understand the widespread praise of Chungking Express.  Admittedly, there are some interesting visuals, but there are also plenty of shots taken from odd angles that serve no purpose and visual effects that are nothing more than novelties.  Along the same lines, the two stories and the characters that inhabit them are initially interesting, but the plots become too convoluted and the characters too eccentric.  A conversation with a bar of soap?  How fascinating. And what's with the soundtrack?  California Dreamin' is a catchy tune and relevant to the second story, but how many times does it have to be played?  All in all, a baffling viewing experience.",
            "review_date": "2022-02-12",
            "source": "rt"
        },
        {
            "content": "Amazing story telling. You instantly fall in love with Faye Wong ",
            "review_date": "2022-02-04",
            "source": "rt"
        },
        {
            "content": "The cinematography is to die for- the blur motion for running, the frozen foreground and moving background, the choice of music too!",
            "review_date": "2022-01-25",
            "source": "rt"
        },
        {
            "content": "ChungKing Express explores two tales of love and longing, combined by a constant theme of one sided love. Not unlike Wong Kar Wai's other work, the film is an emotion that hypnotises you through its vivid imagery and masterful editing.",
            "review_date": "2022-01-01",
            "source": "rt"
        },
        {
            "content": "It's lazy and foolish and even good. Every frame is more interesting than the other one. 7/10",
            "review_date": "2021-12-25",
            "source": "rt"
        },
        {
            "content": "Best thing is about movie is simplicity. Two idea about love served in very beautiful way and unique way. Film show us common man hustle in daily life",
            "review_date": "2021-12-12",
            "source": "rt"
        },
        {
            "content": "Wong Kar-Wai's Chungking Express is an incredible peace of art about love, breakups, solitude and the city of Hong Kong. Was released in 1994 and shot in 23 days and yet it feels like it could have been released today. It's a movie that is full of style and substance and has an astounding camera work.\n\nWong's love letter to lonely heartbroken people and the city of Hong Kong. It's a perfectly shot movie in which every frame is extraordinary and so pleaseant to look at. The soundtrack, tough repetitive at times fits incredibly well this picture.\n\nThere is no clear plot and if you try to follow a logical order you will find yourself quite confused. It's a movie that you'll apreciate more if you feel it rather than try to understand every inch of it.\n\nA feel-good relatable work of art that is stained with Kar-Wai's signature work, surrealistic stop-action running scenes, flirty dialogues, western references, sexy dancing scenes and a very personal vision of the city of Hong Kong.\n\nCalifornia Dreaming starts playing...\n''All the leaves are brown (all the leaves are brown)\nAnd the sky is gray (and the sky is gray)\nI've been for a walk (I've been for a walk)\nOn a winter's day (on a winter's day)\nI'd be safe and warm (I'd be safe and warm)\nIf I was in L.A. (if I was in L.A.)\nCalifornia dreamin' (California dreamin')\nOn such a winter's day\nStopped into a church\nI passed along the way\nWell, I got down on my knees (got down on my knees)\nAnd I pretend to pray (I pretend to pray)\nYou know the preacher like the cold (preacher like the cold)\nHe knows I'm gonna stay (knows I'm gonna stay)\nCalifornia dreamin' (California dreamin')\nOn such a winter's day\nAll the leaves are brown (all the leaves are brown)\nAnd the sky is gray (and the sky is gray)\nI've been for a walk (I've been for a walk)\nOn a winter's day (on a winter's day)\nIf I didn't tell her (if I didn't tell her)\nI could leave today (I could leave today)\nCalifornia dreamin' (California dreamin')\nOn such a winter's day (California dreamin')\nOn such a winter's day (California dreamin')\nOn such a winter's day''",
            "review_date": "2021-12-12",
            "source": "rt"
        },
        {
            "content": "Beyond its iconic visual style and importance in the pop culture, Wong Kar-Wai succedees making a film about a universal, wll-known theme which storytelling works even beyond its wild and uneven big heart and sense of autenticity.",
            "review_date": "2021-11-24",
            "source": "rt"
        },
        {
            "content": "A slow-paced movie with losely theme-related stories, that engages not beacuse of the story, but thanks to the incredible play of emotions, the onirical atmosphere of weaving loneliness and matching blurry camera work.",
            "review_date": "2021-10-30",
            "source": "rt"
        },
        {
            "content": "The film is delightful and Faye Wong is so damn cute I could barely stand it.  On the other hand, I never want to hear \"California Dreaming\" again.",
            "review_date": "2021-10-14",
            "source": "rt"
        },
        {
            "content": "I loved every second of it",
            "review_date": "2021-09-26",
            "source": "rt"
        },
        {
            "content": "i really enjoyed this film. It was interesting and well acted throughout. Faye Wong is amazing!!!!",
            "review_date": "2021-09-07",
            "source": "rt"
        },
        {
            "content": "The first half is wildly unpredictable and funny so it is a little disappointing that the second half, despite Tony Leung Chiu Wai's great performance, is centered around a dud of a romance with a manic pixie dream girl. That said, I'm impressed that the near constant repeat of a few pop songs never gets tiresome.",
            "review_date": "2021-07-20",
            "source": "rt"
        },
        {
            "content": "A true masterpiece. Twenty-five (and more) years after its original release, 'Chungking Express', two films that harmoniously blend into one, continues to enchant viewers with its stunning visuals, its fresh outlook on the world, the purity of its emotions, its protagonists' seemingly impeccable performances. It is a film full of vibrant energy whose pace is as fast as it should be in order not to cause much confusion but, instead, to let the viewer become totally engrossed.",
            "review_date": "2021-07-01",
            "source": "rt"
        },
        {
            "content": "An absolute visual masterpiece. Just how Godard did with Paris, this movie makes you want to take the first express flight to Hong-Kong and see the world there, though I think unfortunately life isn't as beautifully vivid and colorful as Wai can picture it.",
            "review_date": "2021-06-15",
            "source": "rt"
        },
        {
            "content": "technically beautiful but less moving than most other wong kar-wai films",
            "review_date": "2021-05-27",
            "source": "rt"
        },
        {
            "content": "01.05.2021 ---------",
            "review_date": "2021-05-02",
            "source": "rt"
        },
        {
            "content": "\"Chungking Express took a different perspective into how it felt to be single. How everything you do is out of a routine...\"\n\nI hate to break it to the people who believe that, but that's what every single break up movie does. The problem with Chungking Express is how pretentious it is about it, constantly riffing off of the same mediocre metaphor for sometimes twenty minutes on end. The film offers really nothing new besides it's really beautiful cinematography, but not even that can make this film watchable. For anyone interested purely for the cinematography, I would recommend just looking at clips of the movie as the narrative is sub-par. \nI would typically give the film two stars, but that would feel unfair to the cinematographers.",
            "review_date": "2021-03-27",
            "source": "rt"
        },
        {
            "content": "While I didn't love the movie as much as most people, I still appreciated Chungking Express for its visual style with every shot looking like a professional photograph and its charming performances and characters.",
            "review_date": "2021-01-30",
            "source": "rt"
        },
        {
            "content": "What an amazing movie. I love Wong Kar-Wai's colors, photography, frames, soundtrack, everything actually! The only thing I was expecting from this movie was a more cohesive narrative. I wanted to see more from the first couple.",
            "review_date": "2021-01-20",
            "source": "rt"
        },
        {
            "content": "Interesting watch but lack of connection between the two stories or clear narrative was odd",
            "review_date": "2021-01-10",
            "source": "rt"
        },
        {
            "content": "Chimerical like the Jukebox CD's, charming like Faye Wong's twirl & inviting like Brigitte Lin's shades, its exotic lingo and flavorful movements remedy romances that are impossible to leave. California Dreamin' takes on a fresher tonic ring, something never thought to be possible.",
            "review_date": "2020-10-20",
            "source": "rt"
        },
        {
            "content": "This is not movie...it is an experience. A timeless story of ordinary people. Memorable emotive language of colour, love, breakups and satisfaction...",
            "review_date": "2020-07-30",
            "source": "rt"
        },
        {
            "content": "Absolutely beautiful !!!",
            "review_date": "2020-07-18",
            "source": "rt"
        },
        {
            "content": "While many American films excel with a clear plotline that grabs attention, the good Chinese films almost all rely heavily on atmosphere and undercurrent emotion building. And as the experts in such styles of films like 王家衛 take a backseat, Chinese films also become stagnant where the great films are all about 20 yrs old now. The new films are like experimental, often excellent in certain peripheral aspects like CG, camera work, but horridly lacking strength in plots or atmosphere. Hopefully, these experiments will soon produce some great films in a wider genre.",
            "review_date": "2020-04-01",
            "source": "rt"
        },
        {
            "content": "This is a movie from 1994 and some of the cheesy video effects haven't aged well. The premise of two romances centered around a small food stand is pretty cool, it feels like that it could have been a short series even. It's a quirky film with two comical, almost manga ridiculous interests and it's cool to see stuff that's clearly out of the norm once in a while. I feel that the switch up of stories in the middle of the movie kept it fresh as well. It seems to have held up well even 26 years later.",
            "review_date": "2020-03-27",
            "source": "rt"
        },
        {
            "content": "In my opinion his most romantic piece, Chungking Express captures the human psyche like very few films can. The typical grand gestures of love are replaced by subtle hints in tone of voice, in the look one gives another, etc.\ngiving the film a way into your heart that you don't see coming. The use of symbolism is also to die for, and makes it a movie worth watching multiple times.",
            "review_date": "2020-02-01",
            "source": "rt"
        },
        {
            "content": "Chung King Express is equal parts good and frustrating. It is really two somewhat distinct movies. The first third of the movie is about a cop whose girlfriend had dumped him April 1, 1994. He's willing to indulge her April Fool's Day joke until May 1, his birthday. He hangs around a little food stand desperately trying to get his ex to return his calls on the pay phone. The night before his birthday, he tells himself he will fall in love with the first woman who walks through the door of the bar (the infamous Bottom's Up Club, of The Man with the Golden Gun fame). In walks a drug smuggler in a blonde wig. The second two-thirds is about another cop who is a regular at the same little food stand. He has been dumped by his flight attendant girlfriend, while an employee at the food stand breaks into his apartment everyday to redecorate it in her taste while listening to \"California Dreamin'\" on loop. Both stories are intriguing, but if you're waiting to see how they are connected or how they will interact, you will be disappointed. It should really be seen as two distinct stories ironed together at the seam. (Also frustrating, the DVD packaging and all the marketing refer to the movie as Chungking Express, but the title screen in the actual movie says Chung King Express. Maybe I'm the only one who cares...)",
            "review_date": "2019-12-17",
            "source": "rt"
        },
        {
            "content": "Fantastic. Gorgeous and inventive cinematography.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "One of the best cult films movies of all times.",
            "review_date": "2019-10-04",
            "source": "rt"
        },
        {
            "content": "incredible. totally loved (and could relate to) the part by faye wong and tony leung",
            "review_date": "2019-09-15",
            "source": "rt"
        },
        {
            "content": "A landmark in 90s and Hong Kong cinema.  This movie made Quentin Tarantino cry.   Everyone who has seen it falls in love with it because of the second part.  The first part is good but the second part of the film is what makes it.  ",
            "review_date": "2019-09-09",
            "source": "rt"
        },
        {
            "content": "Chungking was a spontaneous project developed by the team of Wong Kar-wai during principal photography of Ashes of Time. While waiting for some equipment to arrive, they had free weeks and decided to fill it with another project â\" a kind of movie that students make, as it was described by the director. The film has been shot in just 3 weeks and became an example of work on the incomplete script. Provided the screenplay was a formality, the things depended a lot on the actors being able to improvise or come up with ideas on how to play their roles. Also, Chungking Express was very dependent on Christopher Doyle's cinematography who had to handle lights and colours in a totally new way to give a fresh glimpse into Hong Kong reality and daylight.\n\nAll the scenes were shot during the day time in the overpopulated parts of Hong Kong. We would see the protagonists during the afternoon just a few times. Doyle was trying to make it in a way of creating an emotional response to daily life in crowded Hong Kong where people collide, fall in love, suffer heartbreaks and dream. The colours of Chungking express and its light have created an unmistakably famous image of Kar-wai's style.\n\nChungking Express was initially supposed to consist of three stories, but director ended up shooting just two of them due to lack of budget and time. It was an experiment of telling different stories with unrelated plots in one film. Yet there are some similarities in these stories: both of them concern young Hong Kong policemen dealing with a breakup and hoping to fall in love happily again. The young men wander around the district of Hong Kong where Chungking cafe or express is, and we observe different emotional moments from their lives. The connection between the stories is an emotional, romantic, atmospheric thing. Chungking express is pretty sketchy, it doesn't focus on the narrative part but employes many methods to emphasize the romantic mood of characters â\" the mood for love which is going to be developed and polished by Wong Kar-wai later works. It is a very unusual film for the Hong Kong industry, something completely different from what had been produced there in the last decades. This is one of the main reasons why it was Chunking Express which became a moment of the international breakthrough for Wong Kar-wai and not elaborate Ashes of Time which took such a long time to shoot and edit.",
            "review_date": "2019-04-06",
            "source": "rt"
        },
        {
            "content": "Gorgeous. I spend my life looking for this film's vibe in the real world.",
            "review_date": "2019-03-24",
            "source": "rt"
        },
        {
            "content": "Wong Kar-wai's film of love and lost is beautifully shot and wonderfully written.  Even during the focal shift in the narrative, it still flows nicely with its themes.",
            "review_date": "2019-02-12",
            "source": "rt"
        },
        {
            "content": "in the mood for love was better. still beauts.",
            "review_date": "2018-12-26",
            "source": "rt"
        },
        {
            "content": "This film was solid.",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "Gotta to be my favorite movie of all time . From how it is directed , the cast , the location and the background music . Everything is just perfect .",
            "review_date": "2018-11-03",
            "source": "rt"
        },
        {
            "content": "I never thought that a movie that explores loneliness would end up being one of the most charming feel-good movies I've ever seen! I mean... I was smiling and laughing spontaneously, and that didn't happen to me since I watched Amélie!\n\n(9/10)",
            "review_date": "2018-10-17",
            "source": "rt"
        },
        {
            "content": "Second film from director Kar-Wai Wong, second bullseye. I really like his style and I will probably end up watching more, if not all, of his work. \"Chungking Espress\" is composed of 2 stories, and these stories are a good mix between noir, and a goofy rom-com. but the writing and the visuals are what make this movie more then a worthy watch. I would have liked for the two parts to be more connected maybe, but the connections are mostly platonic, and they never affect the other part, but that is just my love for \"Pulp fictiony\" movies talking.",
            "review_date": "2018-06-09",
            "source": "rt"
        },
        {
            "content": "With Wong Kar-Wai's distinct visual style and characters that grab your attention with just how genuinely they're written, 'Chungking Express' is a truly enthralling piece of entertainment that tells two separate stories set to a perfectly chosen soundtrack. It may be a bit too artsy or disjointed for some, but there is an undeniable magic at work here and it is difficult not to get caught up in it or find yourself affected.",
            "review_date": "2017-11-26",
            "source": "rt"
        },
        {
            "content": "Chungking Express has a singular and elegant cinematic language, a great film to watch with people who speak different languages because there is little need to understand a complex storyline - just sit back and enjoy the experience of watching!",
            "review_date": "2017-11-10",
            "source": "rt"
        },
        {
            "content": "I really love this movie; its style, its melancholy, its characters and its musings on alienation.",
            "review_date": "2017-09-27",
            "source": "rt"
        },
        {
            "content": "Great score and soundtrack, lively direction and the structure is surprisingly satisfying, finding both relationships charming, sad and believable as well as distinctively different in how each get to be that way.",
            "review_date": "2017-06-30",
            "source": "rt"
        },
        {
            "content": "It got better as it went on. The action filming was not for me. 1001 movies to see before you die.",
            "review_date": "2017-06-25",
            "source": "rt"
        },
        {
            "content": "This movie is really something special. I've never really seen anything quite like it. The cinematography and visuals in this movie are so captivating and beautiful. I mean everything, from the way Kar-Wai Wong shoots even the simplest of scenes. Everything is a visual feast.\n\nLet me also mention that the acting as well the characters in this movie were so easy to like and follow along with. The soundtrack was amazing, making me very nostalgic of the 90's as well as California Dreaming. Watching this movie for the first time, I couldn't help but feel like there was something very familiar to me. Let me end by saying that there's this very human quality to the movie that's not seen in American cinema. Like how the two male cops coped with losing their girlfriends. There was something just very genuine and sweet about this whole movie. \n\nOverall, I can definitely say that this movie is in my top 40, if not, my top 30. I'll definitely be watching this beautiful piece of art again soon.",
            "review_date": "2017-04-23",
            "source": "rt"
        },
        {
            "content": "This is the best movie of all time.",
            "review_date": "2017-02-03",
            "source": "rt"
        },
        {
            "content": "This little film by Wong Kar-Wai has made some kind of movement in the states, but only when Quentin Tarantino, straight off of the success of Pulp Fiction, decided to catalogue it in a selection of international deep cuts known as \"Rolling Thunder pictures\". He introduced to us a very simple-minded, un-pretensious, giddy Hong Kong film about love. There's a lot of funny little things here, having to do with canned goods. Also, this film arguably holds the record for the most times California Dreamin' by the Mamas and the Papas is played in a motion picture. It was played so much, that I now hate it. But in retrospect, it added to the gentle, playful nature of the film.",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "I don't know why but I just love this movie. I think it's the organic characters.",
            "review_date": "2016-12-18",
            "source": "rt"
        },
        {
            "content": "Frenetic, exhilarating, & romantic.",
            "review_date": "2016-08-31",
            "source": "rt"
        },
        {
            "content": "Failed to see why all the celebrations",
            "review_date": "2016-08-08",
            "source": "rt"
        },
        {
            "content": "\" Loneliness sometimes is bitterly sweet, soothing and addictive.\"l",
            "review_date": "2016-04-17",
            "source": "rt"
        },
        {
            "content": "When people cry, they can dry their eyes with tissues. But when an apartment cries, it takes a lot to mop it up.",
            "review_date": "2016-04-15",
            "source": "rt"
        },
        {
            "content": "Wong Kar Wai channels Goddard while maintaining his own language. A bit more upbeat than his other movies.",
            "review_date": "2016-04-05",
            "source": "rt"
        },
        {
            "content": "I like the Weird,Distortion and crazy character in this movie",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "Stylish, sometimes depressing, sometimes quirky and fun, Chungking Express is one of the best romantic movies ever made. A movie about four likable characters looking for love, this is one of my favorite movies. I love it.",
            "review_date": "2015-12-07",
            "source": "rt"
        },
        {
            "content": "The performances as a whole are a joy and the script is a gem.",
            "review_date": "2015-10-20",
            "source": "rt"
        },
        {
            "content": "Enormously enchanting, vibrant comedy by writer-director Wong Kar-wai about lonely dreamers in contemporary Hong Kong and their unconventional romantic entanglements. Two police officers attempt to move on from unsuccessful relationships in stories that are connected thematically but not tangentially related. In the first segment, Takeshi Kaneshiro gets involved with a mysterious drug smuggler in a blonde wig (Brigitte Lin). In the second segment, Tony Leung - always excellent - talks to his household items, has separated from a gorgeous flight attendant (Valerie Chow) and becomes enthralled with a kooky waitress (Faye Wong). A major pop star in Asia, the gamine Wong is incredibly luminous and winsome without over playing her character's eccentricities. In those moments when she daydreams, frequently accompanied by The Mamas and The Papas singing \"California Dreamin',\" the feeling is ecstatic. (For me, the song has become synonymous with the movie.) Cinematography is by the marvelous Christopher Doyle and Andrew Lau. In Cantonese and Mandarin with English subtitles.",
            "review_date": "2015-10-04",
            "source": "rt"
        },
        {
            "content": "I am not a fan of the slow-motion effects and frequent freeze frames and I did not appreciate the first story very much, but the second story was really quirky with interesting characters and a seemingly natural plot development.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "Two beautiful love stories that left me feeling quite melancholy but certainly satisfied. Kar-Wai continues to impress me with his fantastic visuals and quirky characters. Supposedly, Tarantino cried like a baby watching this movie. Not because he felt it was sad but because he never imagined he would love a film so much. While I wasn't as emotionally won over as he was, I still loved it and it brought out different emotions in me.",
            "review_date": "2015-07-20",
            "source": "rt"
        },
        {
            "content": "Wong Kar-wai is the Godard of the 1990's!!!!!!!!",
            "review_date": "2015-07-04",
            "source": "rt"
        },
        {
            "content": "Chungking Express is the first Kar Wai Wong film I've ever watched. I am very impressed with it. This really defines what Art House films feels like. The film is very natural, like it does happen to us every day. Yet this is not a one sided film and focusing both different parts of the story with different individuals. The characterization is very well constructed. It is all about love and crazy obsessions. Resembles a western tone, with like 3 different songs played from time to time. Acting is very natural and I love it, especially the clever and simple conversations. Well made, kudos to the actors and this really deserve any award as this is one heck of a memorable love story. 4 out of 5 stars.",
            "review_date": "2015-06-03",
            "source": "rt"
        },
        {
            "content": "Wong Kar Wai takes us into his universe for a slice of Hong Kong cinema unlike anything you have ever seen before. Divided into two stories the film is a visual wonder, filled with dazzling camera work, non conventional storyline and populated by mysterious characters. This is not your typical Saturday night flick but if you are willing to watch something unusual and really well done, this one is for you.",
            "review_date": "2015-04-18",
            "source": "rt"
        },
        {
            "content": "Melancholic dysfunctional love story, in the metropolis Hong Kong. Experimental camera usage is capturing this in a unique way, though the story itself struggling to keep you focused. Things don't always work out.",
            "review_date": "2015-04-01",
            "source": "rt"
        },
        {
            "content": "Tough Chungking Express's story is too confusing to satisfy, is still packed with great cinematography and good performances.",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "This shit is weird, abstract, surreal and nostalgic. Still good, though and a bit cute",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "Chungking Express is the first Kar Wai Wong film I've ever watched. I am very impressed with it. This really defines what Art House films feels like. The film is very natural, like it does happen to us every day. Yet this is not a one sided film and focusing both different parts of the story with different individuals. The characterization is very well constructed. It is all about love and crazy obsessions. Resembles a western tone, with like 3 different songs played from time to time. Acting is very natural and I love it, especially the clever and simple conversations. Well made, kudos to the actors and this really deserve any award as this is one heck of a memorable love story. 4 out of 5 stars.",
            "review_date": "2015-01-02",
            "source": "rt"
        },
        {
            "content": "Like all of Kar-Wai's films, \"Chungking Express\" is involves several chance-happenings and strained relationships, but the mastery he displays in this effort is arguably more accomplished than any of his other work. I can't take issue with any aspect of the production; it's gorgeously shot, beautifully romantic, and overwhelmingly moving. Rarely does a director make more than one masterpiece, but with this film and the excellent \"In the Mood for Love\", Kar-Wai has done just that.",
            "review_date": "2014-12-04",
            "source": "rt"
        },
        {
            "content": "I didn't know that melancholy could be told in such an amusing way like this",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "Nice filming, ok story.",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "One of my favorite films! makes me happy",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Chungking Express has great story, very good acting, important theme, absolutely phenomenal direction, interesting ending and beautiful soundtrack, but that soundtrack can be annoying and even repetitive at times and the characters are not particularly interesting. It is a very good film, just not as terrific as critics make it out to be.",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "Expressionistic visuals, enthralling performances, excellent characters, an intimate and expansive story. Chungking is just plain beautiful, and the perfect gateway into Wong Kar-wai's filmography.",
            "review_date": "2014-09-24",
            "source": "rt"
        },
        {
            "content": "Visual style that fits so well with 90s Hong Kong. Though some may get frustrated with the story progression (like my mother) the visuals were stunningly enough to keep my interest like with every other film by Mr.  Wong. Loved Faye in this, so quirky and offbeat.",
            "review_date": "2014-09-06",
            "source": "rt"
        },
        {
            "content": "True. That a masterpiece of Romance FIlm",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "Quirky, funny, and ultimately, sweeping.",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "It has a lot of the same strengths and weaknesses that most Wai films contain. The visuals, editing, and music are all flawless and beautiful to look at. The story for casual viewers is probably difficult to follow and might baffle some people, but I found it more enjoyable than some of the stories in his other films. The ending was great and I loved all the scenes using California Dreamin'. Definitely going to have to watch it a second time so I can get a better handle on all the details.",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "Updating this old review to my site is a great reminder of how wonderfully crafted this film was upon first viewing it.\r\nAnother indie style, non \"Hollywoodised\" film with strong characters and an intriguing tone.\r\n \r\nKar Wai Wong's Chungking Express is a combination of artistry, drama and comedy.\r\nThe film is merely the story about two cops with no connection to each other who are both heart broken from recent\r\nrelationships and try to get passed the feeling by mingling with females they meet. The movie is broken into 2 parts which make us wonder what ever happened to the first couple and how does their story end? \r\n\r\nWatching this has presented to me a small picture in what I believe some streets of Hong Kong would look like. The director and cinematographer have done a great job in being able to capture the essence of this country and display it in comparison to Hollywood made movies. Handheld shots make it a winner by bringing in the true nature of the environment. \r\nIn addition script was fantastic, taking us into the mind of some characters, listening to their genuine thoughts on life and their daily routine was another intriguing aspect. \r\n\r\nThe only bad thing I can say is how one story ends and another begins. No smooth transition to it, no satisfying solution to the previous tale, it got confusing especially since I thought both female characters might've been the same person. \r\n\r\nOverall it was great, no doubt about it, and a strong recommendation to anyone who lives and breathes film.",
            "review_date": "2014-06-19",
            "source": "rt"
        },
        {
            "content": "It has the feel of a Goddard film, although Wong Kar-Wai has never claimed he was influenced by anyone else's films when he made \"Chungking Express\".  It also has the feel of a crime drama (Quentin Tarrantino) is apparently a big fan of the film, but it's really a romantic comedy, although not the type you would see at the local multiplex.  At the end of the day, it's a great little character study of four people who fall in love in two completely different ways.  An interesting approach and a great entry in Hong Kong cinema (admittedly, I'm not an expert in that field), this is one that probably should be seen twice to be really enjoyed; at first glance, one doesn't notice that the two separate stories in the film are actually intertwined.  Recommended for anyone seeking to see or learn more about Hong Kong cinema.",
            "review_date": "2014-06-08",
            "source": "rt"
        },
        {
            "content": "There is an almost Murakami feel to the movie with a sense of surrealism and two converging storylines. It's great. :)",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "No lie this is probably up there in terms of 'Favorite Movies of All Time'.",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "Chungking Express... Two love stories set in a crowded area of Hong Kong.  Our anchor is the fast food bar that the main characters frequent.  Ironically, it's about loneliness rather than interconnectedness.\r\n\r\nThis film has extraordinary visuals thanks to director Wong Kar-wai.  Every shot is an impressionist painting and colors are juxtaposed in ways that are both surprising and beautiful.  Exciting blurred motion sequences are followed by peaceful stagnation.\r\n\r\nAlthough focused on themes of loneliness and the isolation of social life and individuality, this is an incredibly joy-inducing film.  The second story in particular is highly engaging because of its quirky sense of romance.  The uniqueness of how the characters meet and how they go about getting to know each other (however unconventionally) is a great source of the humor throughout the film.  At its most basic level, this is a grade-A romantic comedy.\r\n\r\nI can say nothing else, but please see this utterly delightful masterpiece.\r\n\r\n(my apologies for all the gushing)",
            "review_date": "2014-03-17",
            "source": "rt"
        },
        {
            "content": "Like Pulp Fiction, Chungking Express has a pretty basic story, but just as Pulp Fiction, it has an outstanding degree of watchability.",
            "review_date": "2014-03-11",
            "source": "rt"
        },
        {
            "content": "This film is divided pretty evenly into two stories of policemen and their romantic trials and tribulations in Hong Kong during the early 1990s. While it's very artfully shot, philosophical, and grounded in its setting it doesn't cut to the heart of the characters the way it does Hong Kong. The portrait of the margins of Hong Kong, it's quickie food counters, neon lit corner stores, commercial bazaars, and tiny apartments is beautiful and memorable.",
            "review_date": "2014-02-20",
            "source": "rt"
        },
        {
            "content": "This is a 2 part film with connected story lines concerning a couple of cops that are heart broken after their girlfriends leave them.\n\nI think it's an interesting approach of filmmaking. The characters are stories were interesting, but probably won't end up resonating with me. Chungking Express was mildly interesting, but came up a little short for me.",
            "review_date": "2014-01-28",
            "source": "rt"
        },
        {
            "content": "A great film on all fronts. This movie has exquisite cinematography. Each frame of this film is art. This movie also has a terrific, meditative, reflective story - it's beautiful itself. The characters are very well-developed, and it's simply a great simple story of personal stories of love in a busy, impersonal city. The ending is a bit flat, but overall it's one of the best, most beautiful films I've watched. Can't believe the same guy that directed the Grandmaster - cinematically beautiful but poor plot - directed this. I guess The Grandmaster was the exception rather than the norm.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "My Favorite Film Is 1941's Citizen Kane.",
            "review_date": "2014-01-15",
            "source": "rt"
        },
        {
            "content": "?? ????? ??????? ?? ????? ?????? :)",
            "review_date": "2013-12-26",
            "source": "rt"
        },
        {
            "content": "Another Wong Kar-Wai film for me this year and probably my secound favorite. This film got a very nice look. The colors are great and there are several visual treats here. The story is typically Kar-Wai like, a love story with a poetic wrapping. Some beautiful quotes and metaphores here, pretty girls and a pace that let the film float smoothly into your mind.\n\nThe chemestry between the actors are great and there are few characters here. You feel you get to know them all. It feels real and relatable at times - this surely is beautiful film making. If there is anything less positive to say about it it must be the impression of the first part being rather flat. That said, it was still interesting and it made sure that the total lenght never got too streched. I must definitely check out the follow up, \"Duo luo tian shi\" and hopefully it's somewhere near as good.\n\n8.5 out of 10 pineapple cans.",
            "review_date": "2013-11-11",
            "source": "rt"
        },
        {
            "content": "Kar Wai Wong is a really talented director",
            "review_date": "2013-11-09",
            "source": "rt"
        },
        {
            "content": "I first saw this movie in International Film Studies. It's one of the few foreign films I'd be willing to watch more than once.",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "One of my favorite films from one of my favorite directors.",
            "review_date": "2013-10-29",
            "source": "rt"
        },
        {
            "content": "Enchanting, colourful, funny.",
            "review_date": "2013-10-27",
            "source": "rt"
        },
        {
            "content": "Faye Wong's best performance. The song she sang, \"the person in dream\", describes her life and two periods marriage.",
            "review_date": "2013-09-13",
            "source": "rt"
        },
        {
            "content": "love everything about this film",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "It turned out to be a love story. It could have been a good thriller. Classic narrative but enjoyable to watch.",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "Did not work for me. I did not find it funny like I expected it to and it was too chinese and too slow for my liking.",
            "review_date": "2013-08-22",
            "source": "rt"
        },
        {
            "content": "A story about nothing and everything. It's been so long since I saw it but I still have flashes when I hear the music. A classic performance from Faye Wong.",
            "review_date": "2013-08-18",
            "source": "rt"
        },
        {
            "content": "zjes? 20 plechviek ananásu, to musí by? skuto?ná láska",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "This film is an entire trip like nothing else out there.",
            "review_date": "2013-07-06",
            "source": "rt"
        },
        {
            "content": "It's a very complex, sometimes baffling movie; the second story is very confusing to follow and demands a second viewing. However I will gladly return to experience the vibrancy and visual dazzle of the stunning cinematography, and charm of the quirky and endearing characters. It's unique, unconventional and essential viewing as one of the great Hong Kong movies.",
            "review_date": "2013-06-11",
            "source": "rt"
        },
        {
            "content": "What a whimsical movie! I really enjoyed it. I was kinda confused at how Takeshi Kaneshiro's storyline (who was multilingual and was totally showing off his skills) related to the main storyline with Tony Leung (who was really cute in the 90s, omg) and Faye Wong, but Faye Wong's adorable romance story with Tony sorta made you forget about the randomness of the Cop 223 part. The entire movie is really pretty though. I can see why Christopher Doyle is such a big deal now, hahah. There's also great use of the movie soundtrack, which makes you want to check it out afterwards. Actually, I would just say to skip over the Takeshi Kaneshiro part and just watch Tony Leung's and Faye Wong's love story carry out. It's absolutely adorable. It's a good movie, even if the first part confuses you and makes you wonder how earth is this movie going to get any better with all the blurry violent visuals (that didn't make it very \"suspenseful\" as the movie perhaps wanted it to be?).",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "Vivacious cinematography and convincing storytelling that reflects its characters, their stories, as well as (and perhaps most compellingly) its local Chinese environment drives this film beyond what we expect from the drama/ romance genre and into the quasi-canon of \"5th Generation\" Chinese cinema.",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "Vibrant Hong Kong drama dealing with love and urban solitude. Two separate stories about lovelorn policemen are told consecutively in the dense, sweaty city.  Cop 223 (Takeshi Kaneshiro) is a heartbroken young officer whose girlfriend left him nearly a month ago. Struggling to move on, he looks for the hand of fate in the expiry dates of tinned pineapples. He crosses paths with a mysterious blonde-wigged woman (Brigitte Lin) - who is deeply tied into the criminal underworld - and it begins to look as if 223 is capable of letting the past go. As one story closes we meet another lovelorn cop, 663 (Tony Leung Chiu-Wai) who is crushed by the recent break-up with his flight attendant girlfriend. An eccentric free-spirited girl, Faye (Faye Wong) begins working at his regular snack bar and, after hearing of his separation, secretly ingratiates herself in his life in an effort to lift his spirits.\n\nTold in a fast cutting collage of handheld shots and colour, this film has all the sensation of claustrophobic city life, together with the loneliness that can arise from perpetually being in a crowd. It's a fluid, poetic look at love, never narratively satisfying as much as it promises but still leaving a warm contentment - and a degree of ambiguity and depth that requires additional viewing. 'Chunking Express' is expertly paced; the striking cinematography, pop soundtrack and disparate lost lovers meld together into a swirling cohesive experience that defies convention. The ceaseless movement of the city is set nicely against the feeling of waiting and dead time, be it waiting for a decision from fate or a customer in the bar - all the characters are seemingly paralysed in their lives, expecting 'something' to come along. The film is less concerned with the relationships of the couples and is more focused on their isolated lives, capturing a subtle individual tranquility while resonating with the intensity of the urban setting.\n\nIt's probably most memorable for the performance of Faye Wong as the oddball, cropped-haired Faye whose youthful energy and peculiarities light up the screen. Her obsession with 'California Dreaming' brings a whole new life to the song and speaks volumes about escape and the world's obsession with America. Played with an overall naturalism the film still has plenty of farcical comedic elements and a western pop soundtrack that sit nicely alongside the more sentimental drama, keeping the overtone fairly breezy while skilfully weaving in thoughtfulness along the way. 'Chunking Express' is a delicately evocative experience that brims with longing and solitude, while remaining thoroughly vibrant and accessible. A wonderful piece of filmmaking that will become increasingly relevant as our cities grow wider and higher.",
            "review_date": "2013-05-29",
            "source": "rt"
        },
        {
            "content": "Just saw this for the first time and it completely floored me.  Everything about it is mesmerizing. Destined to be one of those films that I watch over and over until nearly every frame is burned into my memory.",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "Delightful film. just a nice little film with a very simple premise done right!",
            "review_date": "2013-05-19",
            "source": "rt"
        },
        {
            "content": "Dois policiais, duas mulheres solitárias, duas estórias sobre amor, nas suas mais estranhas e variadas manifestações. A primeira estória é do policial 223, que se encontra com uma viciada traficante de heroína, por quem se apaixona e guarda na memória. A segunda, do policial 633, que acaba de ser rejeitado de um romance de cinco anos e começa a ver em uma atendente de fast food uma nova possibilidade de relacionamento.",
            "review_date": "2013-05-06",
            "source": "rt"
        },
        {
            "content": "Chungking Express is a beautiful anthology romance film. It involves everything from love-struck cops to a woman who is obsessed with the Mamas and Papas song, \"California Dreamin'' falling in love. Most importantly, it is a film about finding love, even in strange places at a train station. There's a lot of chemistry going on in the film and the characters are very involving and unusual, which is quite the contrary compared to most other romantic films. With all that goes on in this film, it's hard not be engaged in the lives of the colorful cast of characters as they find love or seek out love. If you're tired of the usual cliches of romance films, Chungking Express is a film that will quench your need for something unique and engaging. It's also superbly acted, aiding to the chemistry and intensity of each romance. It's one of the most underrated film of the 90's.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "A wonderful film. Some may find the ending unsatisfying, but Chungking Express is endlessly watchable, and it's one of my favorites to date.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "Wai is a master craftsman who knows the art of portraying the unrequited love, the loneliness, the rejection, the craving for fulfillment etc., beautifully with the addition of dream-like qualities to it.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "In the same year that Quentin Tarantino's \"Pulp Fiction\" has unexpectedly revolutionized an entire film culture, a film entitled \"Chungking Express\", directed by one of Tarantino's film heroes, Wong Kar-wai, came forth with a similarly unique visual flair but on a wholly different emotional scale, and the rest, folks, is cinema history. With an imagery that resembles that of paintings created by the most turbulent-minded of artists and with an emotional center that seems so innocent yet so knowing, the film is a stimulating reminder of how nice it is to live and, more importantly, to love. Well, and also maybe some hints of how lovely it really is to eat (the film, after all, is filled with endless shots of food). \n     \nShot mostly within the confines of a cheap but suggestively lucrative lunch shack named \"Midnight Express\", the film chronicles, in achingly beautiful sounds and colors, the story of two lovelorn police officers, Cop 223 (Takeshi Kaneshiro) and Cop 663 (Tony Leung Chiu Wai), and how they painfully (and humorously) cope up with their romantic grief via their own personal idiosyncrasies. The first, a mid-twenties officer, is so pained by the estrangement of a certain girlfriend named May that he decides to buy a can of pineapple every single night until it piles up to 30. But the catch is that he only buys the ones that have an expiry date of May 1 (his birthday) so that when the said date finally comes and 'May' is still not back in his arms, it's only then that he can arrive at the conclusion that she really doesn't want him anymore, and that those fast-expiring pineapples need some desperate eating. \n\nThe second one, an officer literally living beside the airport, is silently devastated when her stewardess of a girlfriend has suddenly left him alone, needy and slightly schizophrenic, as he begins to talk to his stuff toys, console his towels and scold his soaps, among others. \n     \nBut with utter disconnect, naturally, also comes a chance to connect anew. First, there's the mysterious, blond-wigged woman (Brigitte Lin), possibly a high-class low-life who has caught 223's love-hungry eyes. And then there's the infinitely quirkier Faye (Faye Wong), a short-haired young woman who's got this idiosyncratic affinity with the song \"California Dreamin'\". By emotionally patching these characters together to cope up with an increasingly apathetic Metropolitan existence with all their personal frustrations, vulnerabilities and imperfections intact, Wong Kar-wai has cleverly toned down \"Chungking Express'\" potentially overbearing angle on love to the point that the film itself is not anymore a dual tale of love but simply, in itself, a mere cinematic slice of life. \n     \nWell, granted, a more stylized version of life, that is, but still, with Wong Kar-wai's wisely organic yet weirdly fascinating approach on characterization and his purely artistic sensibility of merging his sometimes frantic but often times observant imagery with stirring music to create an audiovisual kaleidoscope, \"Chungking Express\" has attained a cinematic form that is wholly its own. Is the film a romantic fare? Sure, but it has something more to say than that. Is the film, then, an existential feature? Perhaps, but the film evokes so much joy and naïve wonder that problems of existence just cannot seem to feign its enthusiasm and vigor for life (and love) at all. \n     \nWith those certain indecisions about the film's real categorization, I think it's more than safe to assume that \"Chungking Express\", in the process, has created a new, specific type of cinematic language, specifically on how it has meandered and reflected on the qualms of love and life yet preserves its pristine affinity to just breathe, hope and desire. If \"Chungking Express'\" main intent is to shake me out of my apathy and convince me into wandering the streets of wherever to search for a person who may or may not repay the love that I may offer, then the film has failed. The film, after all, is never an operational 'how to' guide on finding a lost soul to connect to. Instead, it is, more significantly, a film that shows the leaps and bounds of how a certain love is lost and once again found; of a life merely wasted and a life well-lived. \"Chungking Express\" is just a reminder of how beautiful and reassuring it is to know that in every stream of people you may come across, there's always that one person who may just return your smile with an even bigger, more luminescent one. And better yet, there may also be that someone who may just go their way to draw you a crude boarding pass that may bring you somewhere worthwhile. \n     \n\"Chungking Express\", with its one-of-a-kind cinematic approach, is more concerned, in the context of love and existence, on how to say things rather than what to say, how to feel than what to feel, and how to properly enunciate emotions rather than how to choose the right words for it. And for that, I fully commend it. Only few films can make you feel so alive, and only few films, simply put, can make you feel very fortunate of having seen them. This counts as one, and I hope that its ability to make people feel may last more than 223's pineapples.",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "Chungking Express's happy ending is a smart move, because up until then it's more sadistic then a Michael Haneke film. Two decades later, its status as a classic is questionable-the female heroine today might be dismissed as a lost manic pixie dream girl, and the film's coincidences often come off as cruel rather than profound. This isn't to dismiss the film's seismic wit and emotional power, but its ranking at the top of 90s lists can mostly be attributed to its influence on Quentin Tarantino.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Arguably my favorite movie of all time. It prompts me to revisit every few years and each time I find more beauty within. You look into each character's mere existence and their yearn for love. With the perfect captures of each scene from Christopher Doyle, there are so many layers to peel through and enjoy.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "A great story mixed with some very good cinematography!",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "So surprising! I was expecting some pretentious story but it was combination of a film noir with a wacky feel-good story, funny and cute.",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "Some may call it trendy, but Chungking Express is one of Wong Kar-Wai's best films and is shows the Hong Kong director fully coming into his stride as a filmmaker. The Hong Kong nightlife is stunningly photographed and Wong's use of music and imagery rival Martin Scorsese. A masterful piece of artistry by one of my favorite contemporary filmmakers.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "From the blurry cinematography to the incessant use of California Dreamin', everything about this film is magical/brilliant.",
            "review_date": "2013-02-14",
            "source": "rt"
        },
        {
            "content": "What's there to say about Wong Kar Wai's 'Chungking Express'? It's a visual spectacular that put a big ol' grin on my face, and if you love film, you'll understand why. The movie is about two cops looking for romance (both of whom frequent a fast-food joint called the 'Midnight Express'). The first one (Cop 223), having just been dumped, pursues a mysterious woman with a blonde wig and sunglasses. The other (Cop 663), is recuperating from his break-up with a flight-attendant, but catches the fancy of an employee at the 'Midnight Express' (Faye Wong). The first one is fun and sets the mood, but the second one is the real charmer. Quentin Tarantino once introduced a screening by recalling how it made him cry. Not because it was sad, but because he was \"so happy to love a movie this much.\" I loved this film, and if you're like me, you'll be smiling throughout. Highly recommended.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "Artistically made and tries to get to places which really you find hard to keep up to. But still has its beautiful moments.",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "california dream engraved in the head",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "Indeed I saw the auteur's \"impressionistic splashes of motion and color\" camera work, plus his trademark poetic monologues, notion of time, and musical repetitions (The Mamas & Papas' California Dreamin' will stick with you for a time). 11/07/11",
            "review_date": "2012-12-17",
            "source": "rt"
        },
        {
            "content": "An extremely complicated film that will have you scratching your head when the light turns on. However, there is no question that Wong Kai Wai's ability to capture awe-inspring shots are shown throughout the film. Despite the lack of any true story, Chungking Express has us falling in love with all the extremely likeable characters, to a point that even the slightest details will have us caring for them. Wong's manipulation of light and the camera is not pretty in a uniquely messy way, but it works. Perhaps there is no story in Chungking Express at all, or that the story simply does not matter, the movie is more about the world the characters are living in and what they are thinking, and that is played out masterfully by the dialogues and cinematography.",
            "review_date": "2012-11-28",
            "source": "rt"
        },
        {
            "content": "After hearing about this film for years, I was surprised at how comedic the tone was. Not a straight forward comedy, of course, but I feel that the washed out lightness in tone subtracted from its catering to empathetic sentiments.",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "Chungking Express is one of the most creative foreign films out there. California girl might just be stuck in your head after it being played seven times throughout the second tale of the story. The characters are so well-intertwined with each other, the themes are extremely tightly bound and the overall presentation is stylish and tasteful.",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "\"Somehow everything comes with an expiry date. Swordfish expires. Meat sauce expires. Even cling-film expires. Is there anything in the world which doesn't? \"",
            "review_date": "2012-11-14",
            "source": "rt"
        },
        {
            "content": "Wong Kar-Wai's Chungking Express is a \"feeling\" film that will probably do many things to your body and mind. It will make you fall in love not only with Faye Wong's character (named Faye, ironically enough), but also with the song \"California Dreamin\", which is essentially the film's theme song. It is colorful, musical, magical; everything I look for in a motion picture. It's never boring and envelopes us in its characters. It's my first Kar-Wai film and most certainly not my last. A true find.",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "A movie for people who love movies and all its possibilities. Kinda like a French New Wave film, but Chinese, and in the 90's.",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "My favorite movie ever.",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "It gets better and better the more you watch it. No sh*t! it's crap to me for the first time though.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "Chungking Express has a terrific energy and atmosphere.",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "like a long cool drink after a hot summer day.",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "Wong-Kar Wai is one o the best director's still working to this day, if you haven't seen his work see it soon.",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "It has a great mood and style and everything, but I don't like the storytelling. I mean, I like the poetic parts, but I need that to come together into something I really care about. I have that same problem with most Godard films. Anyway, it's not a bad movie, just not fully my thing.",
            "review_date": "2012-09-30",
            "source": "rt"
        },
        {
            "content": "With amazing cinematography and well-written script it is truly a Wong Kar Wai's classic!",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "Wong Kar-wai's Chungking Express is a composite of two love stories set in 1990's Hong Kong. The first story is a noir-style romance involving police detective He Qiwu and a mysterious woman in a blonde wig. This is the stronger of the two narratives, mixing the bloody consequences of the drug trade with the whimsical romanticism of pineapples and expiration dates.\n\nQiwu is a very relatable character if highly eccentric; exposing the hopeful nature of humanity. After breaking up with his longtime girlfriend May, he spends a month eating pineapples expiring at the end of April. This story of longing is both humorous and insightful into the workings of human emotion. Along the way Qiwu gets indirectly involved with a drug smuggling scheme involving the Woman in the blonde wig. The crime narrative is not as strong and is only somewhat fleshed-out and the mysterious wigged woman is not nearly as well developed as a character as Qiwu.\n\nStill this half of the first story has its moments of greatness; specifically it takes a look into the city of Hong Kong as a character in itself. You don't only see a stereotypical view of the city; rather Chungking Express introduces the viewer to the multicultural layout of this eastern center of trade and commerce. Whites of British descent are present, as are drug mules from India. Even Qiwu himself is noted to have been raised in Taiwan. At least four languages are present in the short segment as well as a plethora of eclectic and multi-national musical additions.\n\nThe second story drops the noir undertones for a more lighthearted feel; but is also about lost love. Beat cop number 633 is left by his flight attendant girlfriend and enters a very unconventional romance with a girl working at a Hong Kong fast food restaurant. Faye, the love interest, falls for 633 while he is still hung up on his ex. She falls into the possession of a key to his apartment and uses it to covertly enter his life. This story starts out with a romantic charm but quickly devolves into something more bazaar and off-putting.\n\nBoth stories when looked at separately have a lot to offer the viewer; however when brought together into one film these two disparate halves seem to add up to less than their sum. Furthermore the editing, story, and direction make it very hard to distinguish the course of events. For example; Qiwu and 633 are both cops who go to the same restaurant and both are involved in breakups. Compile those similarities with the fact that 633 never receives a formal name; make both characters meld into one. While watching; I believed them to be the same character. Dream sequences, which sprinkled into the stories, further confuse the narrative but without much seeming visual cue. It's not that I find abstract narratives frustrating, but here it seems like the abstraction works more to alienate rather than invite the viewer into the experience.\n\nOverall the films positive aspects far make up for its loose narrative. The actors' performances are delightful to watch, the script is filled with fun and emotion, and the general direction leads to a very realistic seeming view of Hong Kong. Still if Chungking Express had offered a more involving more cohesive narrative; it would be even better.",
            "review_date": "2012-08-09",
            "source": "rt"
        },
        {
            "content": "Tony Leung Chiu Wai and Faye Wong. I mean, like you need more reasons to see this. C'est impossible. Pas de possible.",
            "review_date": "2012-08-03",
            "source": "rt"
        },
        {
            "content": "Wong Kar-Wai is quite easily one of the greatest storytellers working today. Although better know for his action films, his love films are tender, moving, and life-affirming. This is one of his greatest works.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "The second story is stronger than the first but the first story is still good the use of eating pineapple to express his pain was brilliant. The second story revolves around Faye a worker at midnight express who falls for 663. 663s girlfriend dumps him and leaves his keys and Faye uses them to break into his apartment change things around to help him forget about her and make him happier. It's really colorful and it lights up your heart.",
            "review_date": "2012-05-24",
            "source": "rt"
        },
        {
            "content": "really love the music and the tone of the movie! it's love stories with sense of despair and pain",
            "review_date": "2012-05-16",
            "source": "rt"
        },
        {
            "content": "I need to see more films of Wong Kar-wai.",
            "review_date": "2012-05-13",
            "source": "rt"
        },
        {
            "content": "If memories could be canned, would they also have expiry dates? If so, I hope they last for centuries.",
            "review_date": "2012-05-13",
            "source": "rt"
        },
        {
            "content": "gots tah gett this on bluray now!!!",
            "review_date": "2012-04-29",
            "source": "rt"
        },
        {
            "content": "4 stars for style, -3 starts for being boring pretentious crap, -0.5 stars for the repetitive, annoying-as-hell soundtrack.\n\n\"A frenetic one-way ride through The Land of Vaporous Plot, with stops along the way at Irritatingly Cute Extended Metaphor City.\" - Salon.com",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "I woke up the next morning after seeing this film with big, stargazing smile. The story at first may just seem sketched and brightly symbolic, but as I think about it more and more the stories are so rich with emotion, the film is a living thing with a throbbing heartbeat. But the story isn't the best  thing about this film, the blood in the veins of the movie is the cinematography and direction. Not to sound pretentious, but this truly is one of those films that you can call poetic; every still of the film can be placed in an art gallery. Its weaving style was like Terrance Mallick on acid, so it has all his beauty but without the unrelenting slow pace. I would most definitely watch this film on a Sunday evening if you want to have a good week and I will also be watching it again pretty soon coz I saw know it will be more rewarding on my second watch. I will be seeking out more Kar Wai Wong films asap.",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "Quite a good film from a direction and producing perspective but I found that the stories and characters were not engaging enough",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "After watching Fallen Angels, I knew I wanted to see Chungking Express (yes, Chungking Express was made first...). Wong Kar-Wei does such an excellent job in expressing the characters' sense of loneliness and desire for companionship. The characters are fun and eccentric (and oddly, I could relate to some of their quirkiness). The filming style also helps capture the mood and helps the viewer feel involved.",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "My first Wong Kar Wai film was a dazzling experience. Kar Wai is probably the best filmmaker when it comes to use of colour along with Pedro Almodovar whose colour palette is as vibrant and eccentric. As for the two stories, it was a more interesting experience than impressive. There are some quirky and inventive moments (especially the dog refusing canned food moment) which demonstrate Wong Kar Wai's keen eye for everyday moments of genius. But apart from that the film lacked a certain emotional core or warmth one could identify with. These are two cops who are out of love but their pain never gets reflected (The Tony Leung part is marginally better). Nevertheless a good watch.",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "Its woozy depiction of lonely, lost lovers ricocheting off each other finds simple, endearing ways to connect with one's own feelings of romance, heartbreak, and both the monotony and unpredictability of any given day. A good city movie as well. And it's just fun.",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "That is not what the movie is about though. Its about our neverending search for love. And how lonileness is universal. You didnt ,ention the girl with the drug trafficing or the Indians that left with her money and her stash. How she was so very closed off to the world and the girl in the second film, how unusual and cute she is and they both wear glasses, the first one you cant ever see her eyes, and the second girl is always looking over the glasses, as if to say, I want you to see my soul, I invite it. This is a strange bizarre amazing film.",
            "review_date": "2012-03-22",
            "source": "rt"
        },
        {
            "content": "Quite boring, but beautifully conveys lonely nights of yearning in a big city.",
            "review_date": "2012-03-20",
            "source": "rt"
        },
        {
            "content": "my god, the second novella is good!",
            "review_date": "2012-03-13",
            "source": "rt"
        },
        {
            "content": "\"Jumpy, electric, poetic little pink chewing gum bubble\" this is how I would describe this HK movie. \r\n\r\nFell in love with Faye Yong character, and Brigitte Lin's fatal blond (mix between the Twelve monkeys disguise and Greta Garbo) is not bad at all.",
            "review_date": "2012-03-06",
            "source": "rt"
        },
        {
            "content": "Achingly beautiful film-making!!",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "Here is my Valentine Day  film suggestion--visually stunning and stylistic--Wong Kar Wai's double tale of heartbreak, loneliness, and finding love is dazzyling and is sure to bring a smile to your face...watching Brigitte Lin in Her \"Gloria\" role and then watching Faye Wong sing is worth a look by itself...Happy Valentine",
            "review_date": "2012-02-11",
            "source": "rt"
        },
        {
            "content": "Faye Wong is instantly likable and sexy...kind of like this movie. It's pretty wonderful.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "If you know the pain and humour of love, then you'll love this film.",
            "review_date": "2012-02-03",
            "source": "rt"
        },
        {
            "content": "Lost love in the Hong Kong shuffle from four different, very mildly intertwining, perspectives. Moving at the irregular pace of life, its intentionally uneven gait is mesmerizing at times, slow and repetitive at others. Though the four alternating leads aren't the most varied bunch in cinema history, (the two men are overly self-absorbed and detached, while the corresponding ladies share a propensity to crazed social disorders) the inward-staring confessional nature of the story itself gives them each a special chance to shine as unique, relatable characters. There's a certain degree of the audience in each of them, and that makes each story tough to turn away from, even on the occasions when the plot has slowed to a walk. Though occasionally a bit over-ambitious in the wide variety of different shooting techniques it employs, the film is beautifully composed if somewhat firmly planted in the early '90s. Unspectacular at a glance, it's also strangely hypnotic and potently personal.",
            "review_date": "2012-02-03",
            "source": "rt"
        },
        {
            "content": "Fast paced cinematography adds a lot of rather good visuals to this movie. This film is a two parter. The first story ends abruptly, and without a clear resolution, and I can't say that cared for that one much. The second story, however, works a little better. Rather interesting, and quirky. This film was a little more \"artsy\" than I prefer.",
            "review_date": "2012-02-01",
            "source": "rt"
        },
        {
            "content": "I liked the second story more than the first. Also, I found a lot of the camera tricks to be hopelessly dated.",
            "review_date": "2012-01-21",
            "source": "rt"
        },
        {
            "content": "If you look at the cover of Chungking Express, you will catch a glimpse of some of the stylistic choices made by director Wong Kar-Wai. This is a film that intrigues me because of its style rather than the plot itself. Many of the images are blurred deliberately to reflect Hong Kong's fast-paced life. Other segments are shown in slow motion.\n\nThe story is in two parts and shows a glimpse into the lives of two policemen. The first has just broken up with his girlfriend, but he's in denial because it happened on April 1 and she might just be playing a joke on him. He decides to give her one month to reveal that she's joking. As she likes pineapple chunks, he decides to buy one can per day until she comes back to him. The cans must have an expiry date of May 1 as that's when her time expires. When she fails to return, he eats all of the 30 cans in one night. I mention that scene as an example because it demonstrates just how original the script is. The way the characters think and behave is extremely strange and that's part of the reason the film works so well for me.\n\nThere are essentially four characters in the movie. The first cop, after eating the 30 cans of pineapple chunks, decides to talk to the next woman he encounters. She turns out to be a drug dealer with an interesting story of her own.\n\nThe second story is probably the stronger of the two. It concerns a second cop who is about to break up with his girlfriend. She leaves a letter for him at a food bar he regularly frequents. A woman working at the food bar has a crush on him and steals the key to his apartment from the envelope.\n\nThe film contains a lot of humor, as well as drama and romance. It's just interesting to visit this strange world and hang out with the characters once in a while. The color palette and quirky plot reminds me somewhat of Amelie and it's not meant to be taken completely seriously. The story offers some thoughts on how random life can be. We can pass strangers in the street and they could become an important part of our lives in the future. One of the characters loves listening to California Dreamin', so be prepared to hear that throughout the second story.",
            "review_date": "2012-01-19",
            "source": "rt"
        }
    ]
}