{
    "rating": 8.9,
    "release_date": "1994-10-19",
    "num_reviews": 10,
    "genres": [
        "Comedy"
    ],
    "summary": "Dante (Brian O'Halloran) is called in to cover a shift at his New Jersey convenience store on his day off. His friend Randal (Jeff Anderson) helps him pass the time, neglecting his video-store customers next door to hang out in the Quick Stop. The uneventful day is disrupted by news that one of Dante's ex-girlfriends has died. After attending her memorial service, Dante muses over staying with current girlfriend Veronica (Marilyn Ghigliotti) or reuniting with ex Caitlin (Lisa Spoonhauer).",
    "reviews": [
        {
            "content": "I well remember watching this film as a teenager when it first came out. Then it was a true low-budget indie where the total lack of production values just seemed to enhance the whole thing and cement its perfection. The black and white photography, the total lack of a set, the unprofessional actors, it all just works marvelously. The movie is a series of anecdotes in the lives of a convenience store clerk and another clerk at a neighbouring video rental store. It chronicles all the different customers who come in throughout the day and their daily drudgery of ringing people up, changing light bulbs, and getting fined by the state for selling cigarettes to kids. There is a kind of overarching emotional theme as one clerk - Dante - confronts his ambiguous love life and grapples with the way his life is going nowhere, but mostly it's a series of hilariously funny and intellectually stimulating dialogue that unfolds throughout the day. It is a classic and one of the great examples of fantastic filmmaking on a shoestring budget.",
            "review_date": "2023-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very raunchy film but that's what makes it funny. Mixed with the very real sounding dialogue it all adds up to an enjoyable, humorous, and memorable movie for slackers everywhere.",
            "review_date": "2023-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious and a classic even though sometimes the acting doesn't catch up to the writing.",
            "review_date": "2023-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of the best comedic dialogue ever performed.",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny, spectacular, revolutionary comedy that keeps you engaged and laughing every step of the way.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is all about dialog, and it's great. You'll love the characters and humor.",
            "review_date": "2022-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great characters, simple aesthetic and low budget but a memorable film. I've watched it many times over the years and still burst out laughing at some scenes. Way back in the day, I worked in retail. So I can relate to some of these wacky experiences and the frustration of it all.",
            "review_date": "2022-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the absolute best movies ever made. This film along with the other view askew films have meant a lot to me over the years. ",
            "review_date": "2022-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I ever seen I love this",
            "review_date": "2022-09-22",
            "source": "rt",
            "lang": "en"
        }
    ]
}