{
    "title": "Black Hawk Down",
    "rating": 7.9,
    "release_date": "2001-12-28",
    "genre": [
        "Action",
        "Drama",
        "War"
    ],
    "summary": "Director Ridley Scott's adaptation of the true war story of the attack on a group of U.S. special forces sent into Somalia in 1993 to destabilize the government and bring food and humanitarian aid to the starving population.",
    "critic_reviews": [
        "His is a triumph of pure filmmaking, a pitiless, unrelenting, no-excuses war movie so thoroughly convincing it's frequently difficult to believe it is a staged re-creation.",
        "It is an exceptional accomplishment.",
        "Black Hawk turns nightmare into great cinema.",
        "Doesn't just kick your ass. It pummels your entire body; it leaves you trembling.",
        "Scott superbly re-creates the sense of individuals facing astounding odds, with barely a few minutes' respite over a 12-hour battle.",
        "Films like this are more useful than gung-ho capers like \"Behind Enemy Lines.\" They help audiences understand and sympathize with the actual experiences of combat troops, instead of trivializing them into entertainments.",
        "Rivets our interest for its entire lengthy running time. And it does this without any of the usual war movie clichés, false heroics, barracks-humor nonsense or grandstanding absurdities.",
        "A personal best for producer Jerry Bruckheimer, a triumph for Scott and a war film of prodigious power. You will be shaken.",
        "The next worst thing to being there. That's how real it feels.",
        "Absolutely harrowing, shocking in its sudden revelatory immediacy, and very, very well done, Black Hawk Down is one of the best depictions of the outright lunacy inherent to battle I have ever seen.",
        "One hell of a ride. For better or for worse, it will leave you stunned and reeling.",
        "What we need to remember, what Black Hawk Down reminds us, is that there are no safe missions when you're chasing bad guys. Especially when you have to chase them down a hole.",
        "It's one of the most ferociously convincing physical re-creations of warfare ever put on screen.",
        "You're drawn in, like it or not. You can't get away from the immediacy. Or the feeling that you're getting sucked in, too.",
        "Though passionate, doesn't pity or flatter the rank and file.",
        "Black Hawk Down, in the end, is a docudrama. But it's sensationally well done, and it opens up a battlefield that needed to be documented.",
        "A beautifully filmed, scrupulously authentic but strangely evasive exercise in combat ultra-realism.",
        "Even an audience moved to tender patriotism might wonder how Scott, a proven master of ''Gladiator''-size visual showmanship, could have bombed away the personality of every man fighting until he's left with nothing more than pure combat.",
        "In the end, neither the appealing cast -- nor the force of Scott's stunning imagery is enough to make us understand why these men died.",
        "No doubt captures some of the horror and the chaos of the actual situation, but it makes for a loud, often confusing, and always bloody two and a half hours.",
        "An endless battle scene in search of a movie. It's every bit as harrowing -- and also every bit as pointless and misguided -- as the botched military mission it depicts.",
        "It’s a true endurance test, far too grim to be considered exciting, but not really informative enough to enlighten us about the effect of our presence in Somalia in 1993.",
        "Goes down like stiff medicine, leaving one feeling exhausted relief when it's finally over.",
        "Sitting through the accomplished but meaningless Black Hawk Down is like being trapped in an action film version of \"Groundhog Day,\" condemned to sit through the same carnage over and over.",
        "It's a Jerry Bruckheimer art film, perhaps the most extravagantly aestheticized combat movie ever made.",
        "Perhaps they truly believe war is an inescapable aspect of human life. If so, why make movies that rub our faces in its horror? If artists have no antidote to war's evil or insight into the suffering it brings, their motive in depicting it must be merely to sensationalize its terrors and make money from the morbid fascination it holds for audiences. We deserve better."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "I love this movie, because unlike a lot of action and war movies out there, this one has a lot of tension in it, each action scene is dramatic and smart, not something over the top and dumb. It's realism worked to the film's advantage toI love this movie, because unlike a lot of action and war movies out there, this one has a lot of tension in it, each action scene is dramatic and smart, not something over the top and dumb. It's realism worked to the film's advantage to deliver one of the smartest war films since Saving Private Ryan.",
            "review_date": "2012-02-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When i saw this movie i was absolutely impressed. A true Ridley Scott masterpiece, thrilling until the very end with excellent actors performance. In my eyes one of the best war movies I have seen which still did not loose its actuality",
            "review_date": "2012-03-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Black Hawk Down is a movie worth seeing. Non-stop packed action, and thrill. You really see what these soldiers go through. I would rate this movie in my own top 2! Very well done!!",
            "review_date": "2009-02-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ridley Scott's true-story-based \"Black Hawk Down\" is too broad for the picture. During a monotonous 2 hours, the so called 'realism' is seen in his never ending battlefield where the U.S gets all the respect and bad-ass deaths with last lineRidley Scott's true-story-based \"Black Hawk Down\" is too broad for the picture. During a monotonous 2 hours, the so called 'realism' is seen in his never ending battlefield where the U.S gets all the respect and bad-ass deaths with last line memorable quotes spurring out from their tongues. BUT. I still give credit for his decision to portray a battle lost by the US. I think it's one of the first non-bias-tried movies.",
            "review_date": "2011-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie was announced as an anti-war-movie, but its only a detailed story of a mission that fails, in which american soldiers are finally depicted as heroes once more. Supported by the US Army... No real critcism, no background information The movie was announced as an anti-war-movie, but its only a detailed story of a mission that fails, in which american soldiers are finally depicted as heroes once more. Supported by the US Army... No real critcism, no background information about the war that would allow a deeper questioning of the mission - thats not enough. This movie is not more than a show. The show as such is realistically done, but it's just as flat as its characters.",
            "review_date": "2008-03-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is full of fast paced action throughout. Set in Somalia, a group of soldiers are sent in on a peacekeeping operation. However, it all goes wrong and the chopper is shot down, leaving them stranded in the middle of a village withThis movie is full of fast paced action throughout. Set in Somalia, a group of soldiers are sent in on a peacekeeping operation. However, it all goes wrong and the chopper is shot down, leaving them stranded in the middle of a village with angry hostile soldiers and civilians. Other choppers are sent in for backup, and chaos breaks loose. Lot's of violence, blood and guts. Great characters, and played tremendously well by the actors. Black Hawk down is a great war movie. The plot is a bit basic and shaky, but it is a great movie nevertheless and one I recommend to any war movie fan.",
            "review_date": "2011-10-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A pure propaganda movie from Hollywood with no substance, context or theme. No doubt that it gives the military industrial complex a permanent hard-on.It's not only littered with factual errors starting with the very first quote which isA pure propaganda movie from Hollywood with no substance, context or theme. No doubt that it gives the military industrial complex a permanent hard-on.It's not only littered with factual errors starting with the very first quote which is wrongly attributed. Not to mention that there were other armies involved (Pakistan for example), who did the bulk of the work. It's a shame that so much money and starpower literally gets blown to shreds for this glorified commercial.",
            "review_date": "2020-05-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Outstanding production quality. Profoundly empty story. It's a two hour battle sequence with at least a dozen main characters, none of whom are likable.",
            "review_date": "2008-01-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Only action and technical prefection are trying to keep this on a high level. That is too poor. The real story is untold and so the audience can't understand real reason, why the riots really began. Unbelievable that Ridley Scott Only action and technical prefection are trying to keep this on a high level. That is too poor. The real story is untold and so the audience can't understand real reason, why the riots really began. Unbelievable that Ridley Scott produced such a low-level story. If you look at the picture of the somali-citizens, all of them were showen as brainless, killing terrorists. One of many fault facts which were sold as truth in this movie. Because of showing only the chronology of battle scenes, without telling the whole story of this UN-mission, ths movie will not reach more than 3 points.",
            "review_date": "2009-03-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is truly an astonishing movie. The best war movie I have ever seen.",
            "review_date": "2006-10-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Finally good to see a movie which doesn't have a fairy tale happy ending. A deep and inspiring movie which delivers enough action and gripping scenes to keep me watching over and over again.",
            "review_date": "2008-10-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First off, this would be a 9.5 out of 10. Great movie. Acting is good. Everyone does a fine performance in the movie. Score is great. The music throughout the movie is really weLl made. The story is also great as well. The action/war scenesFirst off, this would be a 9.5 out of 10. Great movie. Acting is good. Everyone does a fine performance in the movie. Score is great. The music throughout the movie is really weLl made. The story is also great as well. The action/war scenes are well made. They can be pretty epic. Overall, this is one of the best war movies ever. It's intense and a great movie to watch. Highly recommended.",
            "review_date": "2012-04-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was really great. Unfortunately it starts off too slow and some of the  action scenes were hooking, but for the most part unsatisfactory. This movie had some great scenes though.",
            "review_date": "2017-11-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The action was amazing and unbelievable in every way. It's very well made, and is moving and powerful at the same time. It will change your outlook on war and even the world.",
            "review_date": "2006-01-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An intense movie in that it doesn't follow the cliche American war movie-- it shows that even the most well planned missions, with the most heavilty armed soldiers can go horribly wrong.",
            "review_date": "2008-06-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The way the movie was filmed was genious - it added to the sheer chaos of the whole debacle. I do disagree with Josh Hartnett as the main character - I would have liked to see someone else in that role. Some of the lines are a bit cheezy but The way the movie was filmed was genious - it added to the sheer chaos of the whole debacle. I do disagree with Josh Hartnett as the main character - I would have liked to see someone else in that role. Some of the lines are a bit cheezy but this is an awesome movie.",
            "review_date": "2008-07-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I wish i was in this movie or if there's going to be a part 2 the movie had all the right graphics in there to give you the real feel as if you were there. Director well done.",
            "review_date": "2006-02-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It truly is one of the best war movies of all time. It depicts the modern warfare very well. Since the Gulf War we haven't been fighting militaries, we have been fighting militias and civilians with weapons. It's sad but true. This It truly is one of the best war movies of all time. It depicts the modern warfare very well. Since the Gulf War we haven't been fighting militaries, we have been fighting militias and civilians with weapons. It's sad but true. This movie is without a doubt a 10!",
            "review_date": "2008-02-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of the few movies that I can watch over and over. Of course it is too powerful to watch all the time. It is a great movie about an insane war. Recommend it to anyone wanting to see another side of things.",
            "review_date": "2008-03-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best war movies of all time. Right up there with Saving Privet Ryan.",
            "review_date": "2007-02-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I love the (More then most) realism of this movie! Fingers getting shot off and STAYING SHOT OFF. The characters act like they would in a real battle: Intense, active, and alert. What I also like about Black Hawk Down is that they portray I love the (More then most) realism of this movie! Fingers getting shot off and STAYING SHOT OFF. The characters act like they would in a real battle: Intense, active, and alert. What I also like about Black Hawk Down is that they portray the US Armed Force as heros. \"ONLY WORDS IN THE DICTIONARY CAN BE USED IN SCRABBLE!!!\"",
            "review_date": "2009-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pretty much what MILL said but it was there fault they got shot we wanted to help them and they sent militia after us. If you join the Army or some kind of armed service then dont expect people to not shoot at you. RIP to Delta MSG. Gary Pretty much what MILL said but it was there fault they got shot we wanted to help them and they sent militia after us. If you join the Army or some kind of armed service then dont expect people to not shoot at you. RIP to Delta MSG. Gary Gordon and Delta SFC Randy Shughart who sacraficed there lives for Michael Durant they where true American Heros.",
            "review_date": "2006-12-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "a epic war movie about the 90s war in somalia . ridley scott really catures the feeling that you are in a war . the action is fantastic the acting was well done . the charicter devolpment was very minamal it was pushing foward very fast ita epic war movie about the 90s war in somalia . ridley scott really catures the feeling that you are in a war . the action is fantastic the acting was well done . the charicter devolpment was very minamal it was pushing foward very fast it seemed and introduced alot of different charicters to the film with out getting much into them . it seemed ridley was trying to paint a wide range of charicters to give us many different vantage points of the war instead of making the charicters more devolped which im not gona fault him much on because you do get a wider spectrem of the war . this is one of the best war films ever made mainly cause r. scott stays very true as to what happend . i know a few people who were there and even fought in that battle and they say scott did it right . so kudos to ridley for doing are soldiers justics and telling there tale .",
            "review_date": "2010-08-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "US Forces go into Somalia to get rebel boss, helicopter gets shot down, have to rescue them, another helicopter goes down, more rescuing.Starts off quite slow for the first half hour then once the action starts, it never stops.Top notchUS Forces go into Somalia to get rebel boss, helicopter gets shot down, have to rescue them, another helicopter goes down, more rescuing.Starts off quite slow for the first half hour then once the action starts, it never stops.Top notch battle scenes with a top notch cast, great visuals & breathtaking action throughout.",
            "review_date": "2010-08-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Black Hawk Down is a great action-packed war movie.  But if you look through the absolute insanity that is a country at war with itself, you'll be given a glimpse at what it means for America to be the world superpower and what others seeBlack Hawk Down is a great action-packed war movie.  But if you look through the absolute insanity that is a country at war with itself, you'll be given a glimpse at what it means for America to be the world superpower and what others see when good will is met with ruthless opposition.  Like Vietnam, this wasn't the United States' fight.  But when innocent lives are gratuitously slain in the show of power, earning the fear and submission of those underneath you, movies like Black Hawk Down can easily offer arguments to where politics are a hindrance when there's men and women across the world that are ready to come to the aid of those who cannot help themselves.  If you love cool action, you're going to love Black Hawk Down.  If you love conscience found in the most desperate circumstances, there's something here for you too.",
            "review_date": "2013-09-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movies that simply shows the harsh realities of war. Does it sensationalize? Perhaps but I feel it it does more to show the heroic efforts of our young men in battle. It is somewhat perplexing to see a Christian rag bash it whenGreat movies that simply shows the harsh realities of war. Does it sensationalize? Perhaps but I feel it it does more to show the heroic efforts of our young men in battle. It is somewhat perplexing to see a Christian rag bash it when Christian Conservatives typically march us into these messes.",
            "review_date": "2011-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nBlack Hawk Down. The quintessential movie of every first person shooter junkie. I decided I was gonna dig up this movie when I was sitting half way through Hotel Rwanda and the news story of the tragic 38 fatalities which occurred this past Saturday in Afghanistan came to mind. Mistaking it at first for a â",
            "review_date": "2011-08-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a very good movie, it's show the reality of war along all problems that derivates from it. There is a lot of drammatic and emotional scenes that shows soldiers seriously injured near to death and other scenes that show their braveryThis is a very good movie, it's show the reality of war along all problems that derivates from it. There is a lot of drammatic and emotional scenes that shows soldiers seriously injured near to death and other scenes that show their bravery and also their fear of being in an very dangerous battlefield. This movie demostrates the background of the civilian war in Somalia with a very realistic approach, showing how is the situation of many 3rd world countries and what kind of reality the U.S seals and the native people of this countries have to face daily. One of the weak spots of this film is that there is a lot of action and not much dialogue and story, it's a non stop action film, but it's anyway a good movie, but not an masterpiece.",
            "review_date": "2011-09-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pretty darn good war film by Ridley Scott with great action and good direction.",
            "review_date": "2019-09-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best war movie since Saving Private Ryan, the horrors of war are chillingly depicted, and the cast all give stellar performances, no matter how minor their role is. It's a shame that some of the real story is left out, the additions ofThe best war movie since Saving Private Ryan, the horrors of war are chillingly depicted, and the cast all give stellar performances, no matter how minor their role is. It's a shame that some of the real story is left out, the additions of which would have elevated the film, even if only slightly.",
            "review_date": "2012-06-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Black Hawk Down is a very well made movie with some of the best editing and action scenes in years. Scott brings you into the film like you were actually there, experiencing the terror all around you.",
            "review_date": "2015-11-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie, which by the way, is based of a book of the same name written in 1999 by Mark Bowden is a great way to teach and learn about the events that happened in the Battle of Mogadishu. I, however, knew about this particular battle beforeThis movie, which by the way, is based of a book of the same name written in 1999 by Mark Bowden is a great way to teach and learn about the events that happened in the Battle of Mogadishu. I, however, knew about this particular battle before watching the movie gave me a new perspective on the battle. It was a very depressing and horrid event, but I am glad to say that this movie is very good and you can watch it free on Netflix now so why not watch it? Anyways, I can gladly say that movie has aged well and is still a pleasure to watch. I really do feel the emotions and hardship the troops went through. The key players in this are the U.S. Special Forces (160th SOAR, Delta Force, and the 75th Rangers) and Mohamed Farrah Aidid and his militia, who by the way, are blocking the food/medicine supplies as their weapon. So the US Special Forces are sent in after an attack on UN and Pakistani troops. The movie is all about the title \"Black Hawk Down\" for those of you who don't know a Black Hawk is a military helicopter. A helicopter crashes and ground troops and helicopters are reverted to go back to the crash site to get back the survivors and equipment. Anyways, now that you know the plot, the movie acts this out very well and I think the SFX were brilliant for their age. I also loved the cast of characters and their role in the movie, they all seem connected. I love military movies and documentaries, so this review may be a bit biased. BUT, compared to the other horrible military movies out there this is a must watch for anyone, really.",
            "review_date": "2013-06-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A very good casting, a good story, but it's not a memorable film like Full Metal Jacket for ex.\rI think the film will be better if he had shown more of the side enemies.\rNot the best film of Mr Scott but an honest War Film.",
            "review_date": "2013-08-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic war film. Light on character development, but it's not really needed. Completely engrossing and overwhelming as we watch the Battle of Mogadishu completely unfold for nearly the entire film. All of the actors put their heart intoFantastic war film. Light on character development, but it's not really needed. Completely engrossing and overwhelming as we watch the Battle of Mogadishu completely unfold for nearly the entire film. All of the actors put their heart into this one, as does Ridley Scott, and the result is not the best war film, but certainly one of the best war films.",
            "review_date": "2013-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Contains some of the best action sequences I've ever seen, but the film's true hero is the cinematographer. It's great to look at.",
            "review_date": "2012-11-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Some critics say that the director (Scott) doesn't tell the whole story about the rebellion in Somalia and I agree, but I also think that if you watch these movie you have take under consideration two things: first the title off the movie andSome critics say that the director (Scott) doesn't tell the whole story about the rebellion in Somalia and I agree, but I also think that if you watch these movie you have take under consideration two things: first the title off the movie and second that the title of the movie tells you, on whom perspective is this story being told and this is from the US soldiers perspective. Don't get mad for a movie that represents an American being a hero, this has happened all the way from the beginning in the movies industry.The movie does have great special effects and you can feel the frustration and fear of the soldiers in the battle field. It also has a great cast.",
            "review_date": "2012-12-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Based on the events encompassing the fateful Battle of Mogadishu, \"Black Hawk Down\" successfully delivers a beautiful example of brilliant directorial prowess, a sobering mosaic of heartrending performances, and one of cinema's most enduringBased on the events encompassing the fateful Battle of Mogadishu, \"Black Hawk Down\" successfully delivers a beautiful example of brilliant directorial prowess, a sobering mosaic of heartrending performances, and one of cinema's most enduring thematic ideas  War is hell.",
            "review_date": "2013-07-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Black Hawk Down is a gritty, intense war drama that is more realistic than the average war film. It's all star cast shines with their acting skills in the high-tension, high-thrill combat scenes where anyone could die at any second. And justBlack Hawk Down is a gritty, intense war drama that is more realistic than the average war film. It's all star cast shines with their acting skills in the high-tension, high-thrill combat scenes where anyone could die at any second. And just when you thought the scene couldn't get bloodier, it does. But that's what makes Black Hawk Down a notable movie worth watching.",
            "review_date": "2014-02-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is probably one of the best war-movies ever made. In my own opinion, the actors playing their individual characters feel very authentic and really sticks out one by one. Sincerely touching, even though there is a lot of controversyThis movie is probably one of the best war-movies ever made. In my own opinion, the actors playing their individual characters feel very authentic and really sticks out one by one. Sincerely touching, even though there is a lot of controversy about the US army today. There is not much to say than: “go and watch it”, I can definitely promise an amazing journey through the human ways of war and terror and/or reality of life and death, assuming you love movies and in that case especially war-movies. With that written and on a final note, the music really lifts the movie up and makes it one of my favourite movies of all time. 10/10.",
            "review_date": "2013-12-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A perfect portrait of the bloodiest battle that the US army had fought ever since Vietnam War  It may lack depth in terms of characters, but on the whole it is definitely the best movie of the year for successfully describing the terror ofA perfect portrait of the bloodiest battle that the US army had fought ever since Vietnam War  It may lack depth in terms of characters, but on the whole it is definitely the best movie of the year for successfully describing the terror of war as well as mixed feelings accompanying every Delta soldier as they struggle to rescue their brothers-in-arms and go home with their families.",
            "review_date": "2013-12-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Black Hawk Down is a great war movie. It's intense story which tells of the grueling war against the nation of Somalia, the cast is great though light on actual development. Black Hawk Down is a movie worth seeing and Ridley Scott does aBlack Hawk Down is a great war movie. It's intense story which tells of the grueling war against the nation of Somalia, the cast is great though light on actual development. Black Hawk Down is a movie worth seeing and Ridley Scott does a fantastic job here",
            "review_date": "2020-04-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I have always enjoyed war movies. Black Hawk Down is one of the better war movies I have seen. There is a ton of action to keep everyone entertained the whole way through. This film has been made very well, and isn't to hard to watch worth ofI have always enjoyed war movies. Black Hawk Down is one of the better war movies I have seen. There is a ton of action to keep everyone entertained the whole way through. This film has been made very well, and isn't to hard to watch worth of gore. It is definitely worth watching.",
            "review_date": "2014-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Black Hawk Down is a war movie based on a true story. I liked it very much. Cast of excellent actors like Eric Bana and William Fichtner. Fantastic special effects. Falling helicopter looks really authentic.",
            "review_date": "2014-07-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Bhd certainly looks fantastic in 4k hdr, the cast is full of a listers and yet, there is a shallow space here... The action sequences consist of shakey cameras running alongside panting charechetures of infantrymen  and distracting  greenBhd certainly looks fantastic in 4k hdr, the cast is full of a listers and yet, there is a shallow space here... The action sequences consist of shakey cameras running alongside panting charechetures of infantrymen  and distracting  green screen silhouettes running from the early noughties style 2d explosions with sequence after sequence of poorly choreographed battle scenarios. Sadly both the drama and the action failed to move me in a significant way. After all the type I expect far more than is delivered here.",
            "review_date": "2020-02-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best war movies of all time!There is a dream cast and they are just perfect in their roles.There is non-stop action and this is have some awesome visual effects(Good explosions)",
            "review_date": "2014-04-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Black Hawk Down is a great war movie, with great battle sequences, effects and design. It is unfortunate, because that is all it has. It has no real depth to be found. All of its characters are indistinguishable from each another most times,Black Hawk Down is a great war movie, with great battle sequences, effects and design. It is unfortunate, because that is all it has. It has no real depth to be found. All of its characters are indistinguishable from each another most times, and there is no real message.\r It is a movie with great action, but no message. No personality. It's all flash and no substance. Of course, I will give special mention to Tom Sizemore, for giving the best performance in the film. Whether or not that is really \"saying something\" or not is unclear. Regardless, Black Hawk Down is a great war film, but is mediocre at almost everything else. But, its gritty and accurate depiction of combat makes up for this often times, so I can't complain.",
            "review_date": "2014-09-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not just a thoughtless quip-and-rip action blockbuster - decently memorable characters, precise tactical narrative, and a good amount of heart. And surprisingly, bridging the edge of my gore tolerance but not too overwhelmingly violent for me.",
            "review_date": "2015-03-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A great war movie , which tells grueling war against the nation of Somalia, but even surpassed by the movie Saving Private Ryan , Ridley Scott does not lose the move to film .",
            "review_date": "2015-12-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "really good it really shows the horror of war and as one who hates when America is always the greatest I can say this is ok because this rally happened",
            "review_date": "2016-05-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "War is hell for 100 continuous minutes of screen time in “Black Hawk Down,” a relentless immersion in combat strikingly realized but none too pleasurable to sit through. Based on journalist Mark Bowden’s bestselling account of the 1993 fiascoWar is hell for 100 continuous minutes of screen time in “Black Hawk Down,” a relentless immersion in combat strikingly realized but none too pleasurable to sit through. Based on journalist Mark Bowden’s bestselling account of the 1993 fiasco on the streets of Mogadishu, Somalia, which left 18 American soldiers dead and more than 70 badly injured, this grim piece of work forcefully puts the viewer in the middle of the action in a harrowing way. But it crucially lacks almost everything but fighting, most particularly characterization, making Ridley Scott’s second picture this year, after “Hannibal,” almost entirely about logistics. Very well judged in its philosophical stance toward the material, this collaboration between Revolution Studios and Jerry Bruckheimer at Sony goes down like stiff medicine, leaving one feeling exhausted relief when it’s finally over. War film buffs and Scott fans will turn out, but general audiences, and women in particular, will approach with extreme caution.\r Of the war films that have come out since “Saving Private Ryan,” “Black Hawk Down” most closely resembles “Enemy at the Gates,” about the siege of Stalingrad, in that both are cold accounts of remorseless urban warfare marked by constant sniping in abjectly squalid settings. The new film’s protracted detailing of door-by-door, block-by-block fighting may also remind viewers of portions of “Band of Brothers,” but that comparison only serves to underscore the present feature’s shortcomings, in that the epic HBO series was able to develop interesting characters in the service of dramatic involvement and tension, elements conspicuously missing here.\r Unfortunately, it also refrains from giving you anything to feel other than general revulsion for war. Token attempts are made to differentiate the Delta Force, the aristocrats of U.S. military, from the only somewhat less exalted Task Force Rangers, but with their buzz cuts, buff bods and similar ways of talking, it’s not easy to tell the soldiers apart, nor is one encouraged to think that it’s going to be worth the effort, given how little attention Scott and the script give to the matter.\r Perhaps receiving marginally more screen time than most of the others is Staff Sgt. Matt Eversmann (Josh Hartnett), who is unexpectedly put in command of one of the “chalks” that will secure the area around the Mogadishu building being raided by the Deltas. Also standing out from the pack from time to time are Ranger Lt. Col. Danny McKnight (Tom Sizemore), a fearless older soldier who comes across as a more human version of Robert Duvall’s Kilgore in “Apocalypse Now;” Delta Sgt. First Class Jeff Sanderson (William Fichtner), a resourceful pro; and Ranger Spec. Grimes (Ewan McGregor), a desk man who finally gets his shot at combat.\r After a half-hour of preliminaries, Operation “Irene” begins, and the sight of 19 helicopters buzzing over the desert beaches toward the bleached-white city in the afternoon sun is stunning to behold. The 160 men, some of whom arrive on 12 Humvees and trucks, expect to be in and out within an hour and, indeed, it takes only 20 minutes for the Deltas to land, assault the building and take the two “Tier One” targets and numerous other prisoners.\r A solid hour consists of little but constant shooting and shouted dialogue, making it tough to engage with characters you barely know. It may well have been Scott’s aim to keep the men basically anonymous and interchangeable — to further the point that this is what war is, that it has always been thus and always will be. And while the specific historical setting of Mogadishu is stunningly evoked via an amazing blend of location shooting, mostly in the city of Sale, Morocco, near Rabat, and on production designer Arthur Max’s utterly realistic sets, there is a simultaneous generalized feeling to the action that makes the film an expression of resignation over humankind’s need to play out these fatal scenarios over and over.\r Perhaps at somewhat shorter length these points could have been made more effectively, but the pummeling viewers get — which can be rationalized intellectually as “putting them through” the firefight as vividly as possible — makes the film more rewarding to think about afterward than to actually experience. Pic will have a decidedly limited pool of repeat viewers.\r However, Hans Zimmer’s score effectively juggles numerous different modes, from World Music sounds and choral work to source material.",
            "review_date": "2016-03-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film is based on an actual US military operation that went wrong and left several US military personnel surrounded by hostile forces in the Somali capital, Mogadishu. The film tries to portray the facts, but I do not know how faithful itThis film is based on an actual US military operation that went wrong and left several US military personnel surrounded by hostile forces in the Somali capital, Mogadishu. The film tries to portray the facts, but I do not know how faithful it was to them. Its likely that much of it has been subverted to emphasize the dramatic effect. It's a war movie, so it's full of intense fighting and fighting scenes. They are the strongest part of the movie, and were truly well made. Through these scenes, its very easy for the public to move to the scene and fight alongside the gi's.The major problem with this film is its inability to convey the lesson learned by the Americans in Somalia. The lesson is that America can not be the police of the world, and that it should not interfere in the internal problems of other countries lightly, as it did in Somalia (and other countries, usually with the worst consequences). The film never reflects on this either on the bad consequences of war, or from ill-thought military operations. It's just an excuse for a war movie with Americans dying and killing enemies like sparrows, which removes the film from any depth or meaning. If you had chosen to think about it, it could easily be compared to an \"Apocalypse Now\", for example. This iconic film speaks not only of the Vietnam War but also of how war affects all, winners and losers, for the worse. There is a profound message behind this film. There is no such thing here. It is a war movie that justifies itself, and loses quality with it. The film does not even dare to show the failure that was truly the American intervention in Somalia. At this point, it is simply advertisement. It is a propaganda piece to the heroism and blind patriotism of the Americans.The cast plays a fairly reasonable role, but with a script condemned at the start and highly partial, we can not expect miracles. The characters are very poorly developed, to the point that the public quickly loses the notion of who is who in the ray of the film. Losing that feeling is halfway to losing interest in what is happening. But as I said, the movie's strong point is action, and everything else was kind of relegated to the background by the production team. It's a good looking action movie or a movie that attempts to show real military combat. But compared to other war films, it's pretty primary, it gets boring and confusing, it does not appeal to everyone and it's easily forgettable.",
            "review_date": "2018-04-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie does have great special effects and you can feel the frustration and fear of the soldiers in the battle field.",
            "review_date": "2018-12-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An unrelenting action/war movie, but no matter how hard it tries, it doesn't quite get the message it's trying to convey through.",
            "review_date": "2021-01-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie couldn't take my attention as it felt loud and confusing. The charachters aren't deeped in such a way the viewer can care about them. This film turns out to be a pure exercise in style by director with lots of aerial combats andThis movie couldn't take my attention as it felt loud and confusing. The charachters aren't deeped in such a way the viewer can care about them. This film turns out to be a pure exercise in style by director with lots of aerial combats and shootings that make it look like a war video game.",
            "review_date": "2021-11-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie. One of the better war movies there. It shares a compelling view of the American military.",
            "review_date": "2022-10-24",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 84
}