{
  "title": "Harry Potter and the Sorcerer's Stone",
  "rating": 7.8,
  "release_date": "2001-11-16",
  "summary": "An adaptation of the first of J.K. Rowling's immensely popular novels about Harry Potter, a boy whose life is tranformed on his eleventh  birthday when he learns that he is the orphaned son of two powerful wizards and possesses unique magical powers of his own.",
  "critic_reviews": [
    "It’s still a very entertaining and spectacular movie, with a rush of nostalgia to go alongside the exhilaration of fun.",
    "A red-blooded adventure movie, dripping with atmosphere, filled with the gruesome and the sublime, and surprisingly faithful to the novel.",
    "It's eye-filling, well-cast, often very funny and executed with great imagination and flair.",
    "The script is faithful, the actors are just right, the sets, costumes, makeup and effects match and sometimes exceed anything one could imagine.",
    "Happily, then, the first movie of the Harry Potter series casts a splendid spell, as screenwriter Steve Kloves has transcribed J.K. Rowling's novel nearly to a T, with precious little tweaked or trimmed.",
    "If the movie doesn't ultimately transport us to places The Wizard of Oz once took us, that may be partly because \"The Sorcerer's Stone\" is just the first chapter, with more magic waiting to be parceled out in the coming years.",
    "Can there be higher praise for a motion picture designed to capture a beloved book with fidelity, thoroughness and affection? Only this: They made it better.",
    "Retains (and in many cases, boosts) as much of the spirit [of the book] as you could reasonably expect. And it makes a worthy attempt to duplicate Rowling's engaging sense of humor.",
    "What saves Harry Potter and the Sorcerer's Stone is what created it in the first place: J.K. Rowling's enrapturing imagination. At those sporadic moments when the film allows us to share in Harry's wonder, it lets us recapture our own as well.",
    "That sense of déjà vu is at once this Harry Potter's balm and its limitation: many charms, but few surprises.",
    "Does it immerse the uninitiated into a new, fabulous world? Yes. To the book's many readers, does this feel like the real \"Harry Potter\"? For the most part, yes.",
    "Absolutely the best single moment, beautifully presented, comes when the orphaned Harry looks in a mirror and sees his parents there. It is brilliant in its simplicity and very moving.",
    "Though the film will undoubtedly please the young viewers who flock to it, ultimately many of the book's readers may wish for a more magical incarnation.",
    "At its best, the film's visual dazzle equals the tasty wordplay of the novel. But it is overlong, overscored, and curiously misshapen.",
    "Columbus has done a rousing job of bringing Rowling's rambunctious story to the screen. The eerie corridors and ever-shifting stairways of Hogwarts are as daunting, haunting, initially bewildering, and ultimately comforting as when Rowling painted them in prose.",
    "As entertaining as it is amazingly faithful.",
    "The film, while slavishly faithful, contains little innovative juice outside of its visual richness.",
    "Is the movie any good? At the dawn of the twenty-first century, when art is defined by commerce, this question is beside the point.",
    "Yes, this \"Harry\" does indeed fly -- just don't expect the movie to soar into the higher altitudes of imagination.",
    "It may be long, but it's not boring -- how could it be when jack o' lanterns float lazily overhead in the dining hall, and the venerable Maggie Smith turns into a cat?",
    "Columbus' film version is fine, and it's bound to make kids happy while simultaneously generating untold box office, but if you haven't yet picked up a copy, don't let the film override the novel; set aside a weekend, dive in, and then head off to the cineplex to take in this well-done companion piece.",
    "It's a very busy movie, designed to appeal to short attention spans, and it leaves you feeling full, but not satisfied, because it's missing the most important ingredient of all: genuine magic.",
    "There's a palpable avoidance of risk as this new mythology is wheeled gingerly into the marketplace and carefully positioned to zap your pre-sold brain...Solid but uninspired, Harry lacks brio. It's respectable and a bit dull.",
    "The English cast is fun; but this is more spectacle than story, and the Steve Kloves script deserves better handling than director Chris Columbus -- plus any number of studio deliberators -- gave it.",
    "This version of the Potter saga is fun and harmless rather than memorable or imaginative. That's certainly no crime.",
    "In their hands [Terry Gilliam or Tim Burton or even Steven Spielberg], Harry Potter and the Sorcerer's Stone might have made as terrific a movie as it is a book. When Columbus got the job, however, it was guaranteed only to be a commercial success.",
    "Potter-philes are sure to get what they want -- if what they want is, in fact, an exacting version of J.K. Rowling's charming children's fantasy. If it's enchantment they are after, that's quite another matter.",
    "As a movie, Harry Potter and the Sorcerer's Stone has no inner life -- no pulse -- of its own: It's secondhand.",
    "A clumsily directed, painstakingly faithful adaptation thats heavy on plot, light on nuance, and features in its title role a young newcomer whose most striking quality is an almost preternatural absence of oomph.",
    "I wish Harry Potter and the Sorcerer's Stone had developed more of a life of its own instead of being essentially a flat visualization of the book.",
    "Given that movies can now show us everything, the manifestations that Ms. Rowling described could be less magical only if they were delivered at a news conference."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Director Chris Columbus has created \"Harry Potter and the Sorcerer's Stone\" a dazzling movie that stays true to its book and adding itself with pure zeal and passion with impressive visuals.",
      "review_date": "2011-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Both deeply enriching and wondrously enchanting. Chris Columbus puts the \"m\" in magic and makes Harry Potter the introductory chapter it needs to be and more.",
      "review_date": "2019-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very Good StartPhilosopher’s Stone proves that you can adapt a book and massively succeed.",
      "review_date": "2019-06-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film was released when I was only six and I remember watching it in cinema, terrified by the last scene) memories",
      "review_date": "2020-03-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An astonishing movie that was perfect in its tone. It captured the world of magic perfectly and John Williams score connected brilliantly. A classic it certainly is. Who knew what would come of this series. It will always remain the beginningAn astonishing movie that was perfect in its tone. It captured the world of magic perfectly and John Williams score connected brilliantly. A classic it certainly is. Who knew what would come of this series. It will always remain the beginning of a franchise that will be remembered forever in cinema.",
      "review_date": "2012-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing this movie, is really interesting, amazing, a bigger sorprise, I think that have some mistakes, but is awesome movie. I love Harry Potter and the Sorcerer's Stone is a classic.",
      "review_date": "2012-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the most-\"loyal\"-to-the-book Harry Potter movie, and it's from one of the best books. Logically, results in a wonderfull, amazing movie. Even if the effects aren't so good compared with the later films, the plot line is This is the most-\"loyal\"-to-the-book Harry Potter movie, and it's from one of the best books. Logically, results in a wonderfull, amazing movie. Even if the effects aren't so good compared with the later films, the plot line is incredible. I have to repeat it, the \"loyalty\" to the book was amazing, that made this film awesome. I watched it 7 times in video and 2 times in the cinema. Yes, you heard well. I repeated a movie in the cinema, without beeing a super-fan. I loved it.",
      "review_date": "2006-02-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Where do I start?! This movie presents the greatest entertainment the business had to offer in 2001! I personally love this series, and this is a wonderful introduction. Harry Potter has arrived at Hogwarts School of Witchcraft and Wizardry,Where do I start?! This movie presents the greatest entertainment the business had to offer in 2001! I personally love this series, and this is a wonderful introduction. Harry Potter has arrived at Hogwarts School of Witchcraft and Wizardry, and the magic begins here. Harry meets two children named Ron and Hermione, and he wouldn't live without them. The choice of casting surpasses perfection, and the movie is an awesome start to an awesome series!",
      "review_date": "2011-11-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have to say that I did not enjoy this film very much when I first saw it, but after multiple viewings, I have grown very fond of it. The magic is really in the air when you watch this movie, as Columbus visualizes Hogwarts so brilliantlyI have to say that I did not enjoy this film very much when I first saw it, but after multiple viewings, I have grown very fond of it. The magic is really in the air when you watch this movie, as Columbus visualizes Hogwarts so brilliantly and faithfully to the book. The performances are not the best obviously (they're just kids) but they're good enough. Rickman makes a terrific Snape, but I wish the characters were a bit deeper in the movie, as they were in the book. Still, one of the best of the series.",
      "review_date": "2010-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Unlike the second one, does not show it's length, and with a fine cast and set design to keep things afloat, but slavishly workmanlike and deadening in it's writing and directing and with rather mediocre special effects in key scenes.",
      "review_date": "2007-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "We all know the story to Harry Potter. Orphan who has nothing turns into the greatest wizard of all time. The first film instalment sticks true to the original book and includes some good special effects but nothing that will stand out fromWe all know the story to Harry Potter. Orphan who has nothing turns into the greatest wizard of all time. The first film instalment sticks true to the original book and includes some good special effects but nothing that will stand out from anything but a kids film.",
      "review_date": "2012-08-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An 11-year old boy named Harry Potter discovers that he's a wizard and receives an invitation to a magical school called Hogwarts. Along the way, he meets two friends named Ron Weasley and Hermione Granger as they spend their natural lives atAn 11-year old boy named Harry Potter discovers that he's a wizard and receives an invitation to a magical school called Hogwarts. Along the way, he meets two friends named Ron Weasley and Hermione Granger as they spend their natural lives at the school, but little do they know that an evil sorcerer plots to steal the magic stone known as The Sorcerer's Stone and they must find it and solve the mystery about the death of Harry's parents.\r Wow. I was very speechless when I first saw this movie in theaters as a little child. To tell the truth, I've never read the book in which this movie was based on, but when I read it, the chapters showed the same thing that were included in the movie and I think it followed the book quite well.\r What else can you say about it? The actors were very entertaining and had a lot of talent with their performances since they look like the same characters from the book. Daniel Radcliffe did very well as the main character (god bless him) and I can't say anything else about the rest of the actors because they did great as well as him.\r The storyline was well-paced and the John Williams music score was very memorable and had a lot of emotion to it.\r The CGI effects were great and the fantasy action was very good.\r There's nothing negative to say about this movie and that's it.\r Harry Potter and the Sorcerer's Stone is a faithful adaptation of the book with excellent performances, great settings, and a well-paced storyline. Thumbs up from me.\r 8/10",
      "review_date": "2011-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not the best of the Harry Potter movies (needed to be closer to the books). Nevertheless, the movie was a great introduction to a ten year long franchise.",
      "review_date": "2011-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I've never been the kind of person that buys into hype and to be honest, I hate most big budget films, So until this weekend, I've avoided everything Harry Potter. That being said, I have never met anyone who had anything bad to say about theI've never been the kind of person that buys into hype and to be honest, I hate most big budget films, So until this weekend, I've avoided everything Harry Potter. That being said, I have never met anyone who had anything bad to say about the Potter films, so I finally decided to give it a shot, and boy was I surprised! For those select few who don't know the story, Harry Potter is the son of two legendary wizards, who was hidden with distant relatives, in order to protect him. Until his eleventh birthday, he had no idea that he was famous or had the potential to be the most power wizard the world has ever known. Potter is invited to join the Hogwarts school of wizardry and that is when the adventure begins. British Actor, Daniel Radcliffe, plays Potter and is nothing short of spectacular. Before the Potter films, Radcliffe had very limited acting experience and many say, he got the part, because of his resemblance to Harry Potter on the cover of the book. That may be how he got the part, but he defiantly shows he has the talent to go along with the right look. His performance was terrific, but there is something to be said about having the right Director, and Christopher Columbus was the perfect choice. Columbus has a ton of experience working with young newcomers in films with high expectations. Overall, the story is extremely well written, the young cast was refreshing and full of energy, the direction was stellar, and the set, costumes, and effects were some of the best I've ever seen. I'm not going to go run out and join a quitage team, but I am going to see the rest of the series. Harry Potter is a huge budget franchise, but for once, a blockbuster film does live up to the hype, and earns the title of a must see movie!",
      "review_date": "2013-04-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Released in 2001, J.K. Rowling's international bestseller got its film adaptation here. While it must be admitted that it does have a nice charm to it, its sometimes lopsided pacing can break it off from the perfection it was so dramaticallyReleased in 2001, J.K. Rowling's international bestseller got its film adaptation here. While it must be admitted that it does have a nice charm to it, its sometimes lopsided pacing can break it off from the perfection it was so dramatically close to.",
      "review_date": "2012-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Dark, mystical, and not afraid to leave the audience begging for more, \"The Sorcerer's Stone\" truly remains a worthy start to a great franchise.",
      "review_date": "2012-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Harry Potter and the Sorcerer's Stone is outstanding and magical, it has everything that a family movie should have, the acting, story and visuals are excellent, it is original and one of the best.",
      "review_date": "2013-06-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Even though it was all kids, or for the most part, Chris Columbus did it pretty well this time in 'Harry Potter and the Sorcerer's Stone'. It stayed really true to the book and had decent effect for its time.",
      "review_date": "2013-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first installment of a great intriguing series from J.K. Rowling, becomes to be a dark and addictive fantasy film that makes you like Harry Potter. He finds out he is a wizard, and asks to stray from his evil step-parents to attend theThe first installment of a great intriguing series from J.K. Rowling, becomes to be a dark and addictive fantasy film that makes you like Harry Potter. He finds out he is a wizard, and asks to stray from his evil step-parents to attend the Hogwarts School of Witchcraft and Wizardry. More secrets about his close evil relationship with Lord Voldemort unveil and he cannot wait to meet him. The film in general was well directed, but the film lacks a sense of greatness. Despite it's PG rating, it has several instances of dark sequences of action that might frighten small children. The film's maturity should appeal to anyone who has read the book, but the instensity of the film could be more intense, but with a young cast and a PG rating, the direction and tone of the film is mild.",
      "review_date": "2010-11-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Even though this movie was eventually topped by almost all of the following films in the series, it is a modern classic and a very satisfying first chapter. There are also some stand-out adult performances that elevate this movie (Alan Rickman)",
      "review_date": "2011-08-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's an excellent start to an excellent franchise. It's very faithful to it's literary counterpart and it's pure cinematic magic. It's impressively designed and sports likable characters, emotion, friendship and bravery to coincide with theIt's an excellent start to an excellent franchise. It's very faithful to it's literary counterpart and it's pure cinematic magic. It's impressively designed and sports likable characters, emotion, friendship and bravery to coincide with the story . There are some moments I found a little too childish, but that's understandable given the film's general child-friendly demographic. The young actors weren't that convincing through certain parts of the film. But, again, it's understandable given their age and lack of real acting experience. 3/4 stars.",
      "review_date": "2011-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I saw this at a friend's house along with the second Harry Potter movie after it was released on video. This movie just bored me to death. I don't see what all the hype is about. Maybe you had to read the book, my friends who have read theI saw this at a friend's house along with the second Harry Potter movie after it was released on video. This movie just bored me to death. I don't see what all the hype is about. Maybe you had to read the book, my friends who have read the book tell me that the book is way better than the movie. Rating it as a bad movie since it was so boring I only remember two parts, the beginning and the end and neither or those were that exciting either. I thought the ending was stupid actually. After seeing the first two movies, I have never bothered seeing any others since I was so bored by the first two.",
      "review_date": "2013-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Harry Potter is dazzling and magical. It's a film of pure of wonder that's enjoyable for the whole family.",
      "review_date": "2012-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "With fantastic and heartwarming debut performances from the children, good visual effects, a heartwarming, sometimes thrilling story, make this a good start to one of the greatest franchises ever. Despite the fact of the incredibly longWith fantastic and heartwarming debut performances from the children, good visual effects, a heartwarming, sometimes thrilling story, make this a good start to one of the greatest franchises ever. Despite the fact of the incredibly long length and the lack of adventure. I give this excellent movie an 84% of a good movie.",
      "review_date": "2011-12-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The story was kind of fun, but the kids couldn't act and many scenes dragged on and on and on...",
      "review_date": "2007-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Harry Potter the movie was great! Yes the book was better, but isn't that always the way when there is a novel to film adaptation? There was magic, friendships and basically evil magicians going around wanting to win the world and killHarry Potter the movie was great! Yes the book was better, but isn't that always the way when there is a novel to film adaptation? There was magic, friendships and basically evil magicians going around wanting to win the world and kill specific people. Great movie and fun for the kids and a good family viewing movie.",
      "review_date": "2012-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just watched this and it sucks hard! Horrible CGI effects, horrible acting from the youths (apart from Harry who was okay)....utterly charmless. I did like John Williams score though.",
      "review_date": "2016-10-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Sorcerer's Stone is an excellent start to Harry Potter. It is a magical a joyful film. Everything i expected from reading the book Christopher Columbus has turned into something even more special. i suspect this will continue into the others.",
      "review_date": "2012-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Though it was a good start to the most sucessful trilogy of all time, I thought it was a little childish and not extremeley well written. Other than that the movie was a sucess.",
      "review_date": "2012-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Close to the book but still entertains. Excitingly enough I thought it would be great though it fared lower than most of its sequels. Zeal needed but a total failure when it came to dialogue. But very good stuff.\r Next Movie!",
      "review_date": "2013-05-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic film that boasts of adventure, emotion, music (that theme- John Williams never disappoints), amazing sets, visuals, directing and great acting (every actor/actress cast perfectly).  Everything about this film is lovable, classicalA classic film that boasts of adventure, emotion, music (that theme- John Williams never disappoints), amazing sets, visuals, directing and great acting (every actor/actress cast perfectly).  Everything about this film is lovable, classical and perfect and follows the book wonderfully.",
      "review_date": "2013-07-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A spellbinding story of a young wizard that electrifies.\rHarry Potter and the Sorcerer's Stone enchants audiences with a well forged script and impressive young actors.",
      "review_date": "2013-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An adaptation of the first of J.K. Rowling's immensely popular novels about Harry Potter, a boy whose life is tranformed on his eleventh birthday when he learns that he is the orphaned son of two powerful wizards and possesses unique magicalAn adaptation of the first of J.K. Rowling's immensely popular novels about Harry Potter, a boy whose life is tranformed on his eleventh birthday when he learns that he is the orphaned son of two powerful wizards and possesses unique magical powers of his own.",
      "review_date": "2014-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A young boy's lonely life is turned around when he discovers that he is a wizard in \"Harry Potter and the Sorcerer's Stone\", a story written by J.K. Rowling and adapted onto the big screen.\r Daniel Radcliffe plays the title character, HarryA young boy's lonely life is turned around when he discovers that he is a wizard in \"Harry Potter and the Sorcerer's Stone\", a story written by J.K. Rowling and adapted onto the big screen.\r Daniel Radcliffe plays the title character, Harry Potter, who, as a baby, was left to be looked after by his aunt and uncle, along with his raging cousin, and they all mistreat him for years of his life.\r Not long after Harry turns 11, a strange, huge and hairy man who goes by the name \"Hagrid\" (Robbie Coltrane) informs Harry that he is a wizard, and that his parents were exceptional students at a school named \"Hogwarts\", where gifted, magical youngsters are able to use their spells to their very best, and learn other new skills in regards to magic.\r Harry begins to learn more about his past, such as the fate of his parents' death was caused a by a \"Lord Voldermort\", and how he managed to get the scar that is on his forehead.\r Hagrid then decides to take Harry to the magical world of Diagon Alley, where Harry can purchase wands and broomsticks galore. After getting the essentials he needs, he then takes the train that leads directly to Hogwarts. It is there that he meets two other young students, Ron Weasley (Rupert Grint), and Hermione Granger (Emma Watson). He also comes across a very cynical young boy named Draco Malfoy (Tom Felton) who proves to be one not to be trusted.\r The movie is filled with wonderful imagination, and a sense of strong, individual characters that many will choose to identify with. Director Chris Columbus ('Home Alone' and 'Mrs. Doubtfire') crafts an amazing magical adventure that is enchanting and thrilling all at the same time. The young actors do fine in their roles, although, there are some room for improvement, but they are young. The movie is also very well paced and should hold one's attention for longer than possible.\r It is an excellent start to one of the most iconic franchises of all time. You wouldn't want to miss it.",
      "review_date": "2016-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Though it kicked off the Harry Potter franchise, I can't help but feel a little underwhelmed by Chris Columbus' first entry in this franchise. Though the acting is great and it is faithful to JK Rowling's great novel, the film is just okay.",
      "review_date": "2018-11-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I guess it shouldn't be surprising considering the source material, but this movie is dull to a criminal degree.  It's hard to believe they couldn't find better child actors for the lead roles, but come prepared to cringe hard at theI guess it shouldn't be surprising considering the source material, but this movie is dull to a criminal degree.  It's hard to believe they couldn't find better child actors for the lead roles, but come prepared to cringe hard at the performances here.  I guess Potter fans will accept this since liking the books is like admitting you have no taste",
      "review_date": "2019-04-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "(84/100)A fun setup to the franchise. CGI was a bit dodgy sometimes, but it is 2001 so I didn't expect much. Dialogue was also a bit dodgy.",
      "review_date": "2018-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A mixed tone, bloated runtime, uneven plotting, and unbearable expository pacing completely diminish the film's desire to provide a more cheery and empowering story that its following installments fail to achieve. The Sorcerer's Stone'sA mixed tone, bloated runtime, uneven plotting, and unbearable expository pacing completely diminish the film's desire to provide a more cheery and empowering story that its following installments fail to achieve. The Sorcerer's Stone's minuscule intentions are unable to overcome its colossal troubles to adapt the story.",
      "review_date": "2022-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAn amazing movie with an amazing cast!! Love it!! Would recommend 100% best movie I’ve ever watched!",
      "review_date": "2021-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great movie that was taken off an awsome book.",
      "review_date": "2007-08-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this movie was really good but too different from the book to get a ten.",
      "review_date": "2006-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Average but has its merits for remaining faithful to the book and giving a good insight into Harrys world.",
      "review_date": "2007-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It gets better with the second attempt, but does not quite capture me as much as I would like it to. The actors are becoming better in their roles, which leaves a big promise for the next installment.",
      "review_date": "2007-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I haven't had chance to read this book but as films go its a good introduction the the Potter world. Acting is a bit weak but most of them (the child actors that is) are just starting out. It defines the characters well enough ready for I haven't had chance to read this book but as films go its a good introduction the the Potter world. Acting is a bit weak but most of them (the child actors that is) are just starting out. It defines the characters well enough ready for the follow up movies which seem to get better and better.",
      "review_date": "2005-09-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film is fun very enjoyable, but it's not matching the book's environment as well, it's a little bit more childish than the books.",
      "review_date": "2007-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Harry Potter and the Sorcerer’s Stone will delight fans of the book with its mostly faithful adaptation hitting all the main points and representing the characters well especially the adult actors and others will no doubt be swept up by theHarry Potter and the Sorcerer’s Stone will delight fans of the book with its mostly faithful adaptation hitting all the main points and representing the characters well especially the adult actors and others will no doubt be swept up by the fantastic world Rowling has created and Columbus and crew have brought to life fully realized with special effects, score, and cinematography. With all that said though it doesn’t make for a coherent film. The director is so caught up in establishing the world and hitting all the necessary plot points that he forgets to flesh out the characters. Harry isn’t that interesting serving more as a vehicle to get exposition about the world and the transitions between scenes are jumpy with so much emphasis on hitting the main beats of the film that the story doesn’t flow. At 2 ½ hours the film can drag a tad. While the film is nothing great that doesn’t mean it isn’t a pleasure to watch. Seeing the story of Harry Potter come to life was and still is a major treat and considering how popular the books are/were the fact that it was done this well is impressive they gave the fans what they wanted. And when you consider all the failed attempts at starting a franchise seeing one succeed is magic.",
      "review_date": "2016-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wasnt as bad as I remembered. The older cast members were great and played their parts perfectly, The young cast was solid as well. The movie was decent and was as loyal to the book as it could be. However it lacked originality and the CGIWasnt as bad as I remembered. The older cast members were great and played their parts perfectly, The young cast was solid as well. The movie was decent and was as loyal to the book as it could be. However it lacked originality and the CGI wasnt that good either (The troll looked poorly done).",
      "review_date": "2011-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies in the series, it has humor, and action, and an enjoyable plot, and extremely charming characters, a movie I would recommend seeing.",
      "review_date": "2011-02-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Sorcerer's Stone is a decent opener for the Harry Potter franchise. There is a lot of fun to be had discovering the world of Hogwarts. The film isn't perfect however; hefty over-length and an uneven final third keep it from joining theThe Sorcerer's Stone is a decent opener for the Harry Potter franchise. There is a lot of fun to be had discovering the world of Hogwarts. The film isn't perfect however; hefty over-length and an uneven final third keep it from joining the truly brilliant Potter outings.",
      "review_date": "2012-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I first saw this film when I was around 4 when it was released on DVD and I loved it when I first saw it! Ten years later, this film is still the most faithful to the book unlike the others. Seeing the actors playing the trio at such a youngI first saw this film when I was around 4 when it was released on DVD and I loved it when I first saw it! Ten years later, this film is still the most faithful to the book unlike the others. Seeing the actors playing the trio at such a young age is still a delight to see as they grow up. The visuals are fantastic and it certainly gets you introduced to the world of Harry Potter. Not the best  Harry Potter film, but is a great film.",
      "review_date": "2011-07-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The lack of discernment between the boundaries by literature and the cinema compromises part of the movie, which seems oddly limited and unimaginative in a universe that is just the opposite. Chris Columbus, with a monstrous technicalThe lack of discernment between the boundaries by literature and the cinema compromises part of the movie, which seems oddly limited and unimaginative in a universe that is just the opposite. Chris Columbus, with a monstrous technical department, prepares the magical world beautifully, however fills the air. The scenes seem a succession of sketches made strategically to put the narrative in motion, without any soul or your driving style. The soundtrack by John Williams, however, besides having a theme already unforgettable simply creates beside the photograph the whole mood and atmosphere of Hogwarts. As a product, is a beautiful film and well done, but it suffers from the absence of a different taste and own something that is only acquired later along the saga goes on.",
      "review_date": "2011-05-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great entry to the world of Harry Potter. The beginning of it all. I believe this is probably the best of it's lot because of the way it introduces all these things. Quidditch, Broomsticks, withes and wizards like you've never imagined. J.KA great entry to the world of Harry Potter. The beginning of it all. I believe this is probably the best of it's lot because of the way it introduces all these things. Quidditch, Broomsticks, withes and wizards like you've never imagined. J.K rowling has definitley got alot of inspiration from fairy tales and stories of witches and magic but revamps it like no one has ever seen. It's one of the most original film series since Star Wars. I guess the story I don't really need to talk about because i'm sure most of you out there have heard of Harry Potter. Basically Harry is 'the boy that lived' from a dark evil wizard by the name of Voldemort when he was just an infant. Dumbeldore, the headmaster of Hogwarts, Hagrid and the other teachers of Hogwarts leave him off at his closest relatives, his uncle an aunt. At the age of 11 Harry is revisited by Hagrid and is taken to Hogwarts. this is where he learns all about wizardry and why he is their. It's a fnatastic story and a pretty touching story. Harry grew up with his uncle and aunt who are extremely mean to him along with his cousin, Dudley who is the selfish spoilt little brat. All three of them are characters you love to hate. As much as they are extremely mean people it's enjoyable to see them be so pompus and narcistic at times. Most of the characters in the story are brilliant. It makes this world very believable and reels you in.Hagrid i'd like to start with. He is a brilliant character at about the height of 7 foot. As much as he looks monstrous he's actually a gentle heartfelt man who can cook and do gardening. The relation he has with Harry, Ron and Hermione is great. He looks like such a good friend. Ron weasley, a friend Harry meets on the train to Hogwarts. He's silly at times and things sometimes don't work out for him. Hermione is a school addict who knows plenty about spells and potions. Harry is played wonderfully by Daniel Radcliffe and it's easy to see how he got the role. All the characters of the story seem fit for the film. The way they look, the way the talk has a magnificent style. That's what the Harry Potter films have. Alot of style. They are very distinct from other films. How many films involve stories as deep as this along with mythical creatures, Witched, Spells and thousand year old castles. As the first of the Harry Potter films this is a wonderful entry and if you haven't watched ANY of the Harry Potter films then it's worth starting with this one.",
      "review_date": "2011-04-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Innovative special effects and picture perfect child acting. I am proud to say that this film is the greatest children's movie of all-times. Don't believe me? Watch the film and see if you don't enjoy it. Few films can take a children's novelInnovative special effects and picture perfect child acting. I am proud to say that this film is the greatest children's movie of all-times. Don't believe me? Watch the film and see if you don't enjoy it. Few films can take a children's novel and make it a serious contender for greatness but Chris Columbus does it and does it well!!!",
      "review_date": "2011-07-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While this is only the first installment in the series and remarkably Disney-like, I thoroughly enjoyed this movie. It's in no way a groundbreaking movie, but it has no major drawbacks either. Good character build-up combined with a nicelyWhile this is only the first installment in the series and remarkably Disney-like, I thoroughly enjoyed this movie. It's in no way a groundbreaking movie, but it has no major drawbacks either. Good character build-up combined with a nicely produced movie makes this an easy recommendation.",
      "review_date": "2012-12-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is a fantastical achievement. It introduces us to a richly detailed world with great characters and above all a good story. It doesn't particularly flow at times and Chris Columbus seems a bit stale with the camera but the actors, sets andIt is a fantastical achievement. It introduces us to a richly detailed world with great characters and above all a good story. It doesn't particularly flow at times and Chris Columbus seems a bit stale with the camera but the actors, sets and John William's score more than make up for it.  Dan, Rupert and Emma are perfectly cast and all the other older british actors give Hogwarts a rich atmosphere. The story provided by JK Rowling is really strong so the filmmakers were wise in following it closely. In the end, Chris Columbus deserves much credit for starting off the series on the right foot. I saw this when I was 14 and it just resonated with me on a very personal level. It's a classic.",
      "review_date": "2011-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A charming, sweet and colourful film. The acting among the young is iffy, and the effects are rather poor, but the emotion and the very faithful plot quickly pull you in. The sets are one of the key delights of this film. Everything isA charming, sweet and colourful film. The acting among the young is iffy, and the effects are rather poor, but the emotion and the very faithful plot quickly pull you in. The sets are one of the key delights of this film. Everything is beautifully decorated and lavishly coloured to make it absolutely awe-inspiring. Together with the rich cinematography, it really brings the magic to life. The music also adds to the magic and the wonder, and follows the emotion closely. This can make it slightly boring, as there is nothing really converse about how it flows, but it adds something really satisfying and real to the film.",
      "review_date": "2011-07-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was where one of the highest grossing and most critically acclaimed series began, with a somewhat humble adaptation of J.K. Rowling's bestseller.  These actors back then were completely unknown, and though they weren't at the level theyThis was where one of the highest grossing and most critically acclaimed series began, with a somewhat humble adaptation of J.K. Rowling's bestseller.  These actors back then were completely unknown, and though they weren't at the level they are now, they were still good enough for a movie that depended on a wonderful and well-represented story as well as some of the best directing of the series.",
      "review_date": "2011-07-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "SO The HP saga begins with the sorcerer stone. I started writing the reviews after the last movie come out so i really understand the all the films. So where i began the first movie was a good movie where you saw that harry has magical powersSO The HP saga begins with the sorcerer stone. I started writing the reviews after the last movie come out so i really understand the all the films. So where i began the first movie was a good movie where you saw that harry has magical powers and begins on hogwarts the school for wizardy. It was a spectacular movie with good specialeffects and good acting especially for the litle harry. But there a few minors in the first movie that was later be solved by other directors, professor dumbledore is much better in the next films than in the firts 2 and the old look at hogwarts does not fit in the movie, further is was a thrill and it was a good firts harry potter but not the best. so i give it an 7",
      "review_date": "2011-07-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first in the highly lucrative wizard franchise is heavy on magic, low on character. The visuals are pretty dreadful, too. Still, it's a fun introduction to the Harry Potter mythology and boasts some great performances by the supporting cast.",
      "review_date": "2011-09-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first movie, Chris Columbus opened a saga that would mark a generation. I was dazzling, visually beautiful, funny and magic. John William's music was wonderful, it fitted very well to every sequence.",
      "review_date": "2012-06-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is faithful to what happened in the novel. A great story and visuals are what make it perfect/near perfect. The actors give great performances and it is believable.",
      "review_date": "2011-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This first Potter film is pretty decent with good acting and effects but the story has more holes than swiss cheese.",
      "review_date": "2019-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There was quite the air of anticipation when this film was announced, based on a book, and full of magical tendencies, at 11 years old I was deep into the books, and was really looking forward to see the characters I read about and come toThere was quite the air of anticipation when this film was announced, based on a book, and full of magical tendencies, at 11 years old I was deep into the books, and was really looking forward to see the characters I read about and come to know over the years, brought to life on the big screen, because this franchise was truly the stepping stone for all other fantasy novels and genres to take the leap out of the black and white pages. Chris Columbus kicked off what was to become a worldwide phenomenon, brimming with excitement and passionate stories that JK Rowling has written.\rHarry Potter (Daniel Radcliffe) is met with the unimaginable after finding out on his 11th birthday that he is a wizard, and that he is scheduled to enrol in Hogwarts, a magical school for witches and wizards that is vastly different from our seemingly routine earth. Harry is introduced to all kinds of magical anomalies, complete towns behind dead end walls, wands, broomsticks, every sort of out of this world thing imaginable. But of course there is always darkness with light, and Harry soon discovers that there is a reason people whisper is name as he passes and why the professors at Hogwarts take such an interest in his life.\rJoining him for the journey are dynamic duo is red-haired Ron Weasley (Rupert Grint) and the brains and elegance that is Hermione Granger (Emma Watson). These three truly get more than they bargain for as they form unlikely friendships, particularly with the half-giant Hagrid (Robbie Coltrane) who has more than a few secrets to divulge.\rThe huge British cast the film boasts is quite fitting for these characters are pictured when reading the book, and in terms of the scale of the film, it simply doesn't get much bigger, while also staying as true as it can to the source material for the purposes of film, a lot of effort and attention to detail is quite breathtaking, from the Great Hall to the dormitories within each house. While the child at times can be a little jarring and too much on cue, the overall tone of the film maintains a light-hearted approach the way the first book entry in the series outlined.\rThe film succeeds in adventure and emotional clarification for our main man Harry, this boy has lost his parents and only eleven years later knows the truth surrounding his whole life, but with this quite tragic story the creators have managed to create a film that appeals to all ages, with a perfect mixture of comedy, action, amazement, but most of all, magic.",
      "review_date": "2013-07-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While it does a good job taking a bulk of the details from the book and putting it into film, The movie is pretty corny and rather childish (yes I know it's based off a childrens book). The acting is solid but I am a bit disapointed that theyWhile it does a good job taking a bulk of the details from the book and putting it into film, The movie is pretty corny and rather childish (yes I know it's based off a childrens book). The acting is solid but I am a bit disapointed that they didnt use their experianced older cast members more. It was enjoyable for the most part though.",
      "review_date": "2011-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis was a really well done movie. I was really intrigued to see how well they would portray the book on film and I must say, they did a fantastic job. There were undoubtedly some major and minor differences but I felt almost all of these were perfectly fine. Obviously it's impossible to include every aspect but there were some things that I think they could've/should've done differently. For one, I understand you can't add everything and that some things might have to be changed in order to make the movie work but if that's the case, why add things that are completely unnecessary? For example, the moving stairs. As for the things taken out or changes, I have no problem with all of them, except one. In the end when they're making their way through the various challenges, they took out Snape's potion riddle. To me, that was the second most important and memorable challenge of them all behind the chess challenge. This would've only added another minute or two and should've been included in the movie. Nonetheless, this was a well done book-to-movie adaptation. The acting of some of the students left a little to be desired but it wasn't too bad and I've heard it improves as they, and the book/movies age.",
      "review_date": "2012-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It does an impeccable job of conveying all the emotional warmth and utter enchantment that the book had, and John Williams's fantastic soundtrack makes it all the better. This is a movie that will truly capture your sense of wonder.",
      "review_date": "2011-12-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The most loyal book to film adaption of the series. Everything is just spot on and there's truly not a single weak spot imo. It's just a wonderfully done movie that really brings the book to life.",
      "review_date": "2016-06-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An enchanting debut to a magical series of films. You'll be transported into an exciting world that you'll learn to crave despite the resonating evil within it.",
      "review_date": "2014-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first Harry Potter in the movie series of Harry Potter film's. The start had no interest for me at all. But after the troll scene it start's to get really good, but the start effects this movie in ,a big way. The middle and the end of theThe first Harry Potter in the movie series of Harry Potter film's. The start had no interest for me at all. But after the troll scene it start's to get really good, but the start effects this movie in ,a big way. The middle and the end of the film did it for me. Harry Potter and the Sorcerer's Stone 6.9/10",
      "review_date": "2012-05-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Harry Potter and the Sorcerer's Stone\" is a great and magical start to the Harry Potter series. It's surprisingly very faithful to the book, as Director Chris Columbus makes the film so that it's exactly like the book, so there's not much\"Harry Potter and the Sorcerer's Stone\" is a great and magical start to the Harry Potter series. It's surprisingly very faithful to the book, as Director Chris Columbus makes the film so that it's exactly like the book, so there's not much room for surprises. But this movie is an intense and fun adventure with impressive visual effects.",
      "review_date": "2013-11-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "At times it does feel to family orientated and isn't as dark as you'd like, but the first in the 'Harry Potter' franchise is a fun mystery adventure that introduces us to the world of Hogwarts, while being a wonderfully magical adaptation ofAt times it does feel to family orientated and isn't as dark as you'd like, but the first in the 'Harry Potter' franchise is a fun mystery adventure that introduces us to the world of Hogwarts, while being a wonderfully magical adaptation of the classic J.K Rowling novels.",
      "review_date": "2013-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Truly magical. Yes, there is more of a kiddie approach to everything and Radcliffe's acting isn't exactly great (but he was a kid, come on!) but everything else was perfect. They did a spectacular job capturing the magic of Hogwarts andTruly magical. Yes, there is more of a kiddie approach to everything and Radcliffe's acting isn't exactly great (but he was a kid, come on!) but everything else was perfect. They did a spectacular job capturing the magic of Hogwarts and everything else in the Harry Potter universe, and the casting, oh the casting is so, so great. Kicks off one of the greatest franchises in movie history with a bang.",
      "review_date": "2012-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Having not seen any Harry Potter in its entirety, it seemed that it was finally time to embark upon this franchise that dominated the childhood of many of my peers. Until today, the only time I had seen any portion of a Harry Potter film was,Having not seen any Harry Potter in its entirety, it seemed that it was finally time to embark upon this franchise that dominated the childhood of many of my peers. Until today, the only time I had seen any portion of a Harry Potter film was, I believe, this film in the car of a friend that had a dvd player in their parents car. It absolutely terrified me, rendering this a franchise that would get put off for a long time. Add in some parental worry regarding the depiction of witchcraft and it was obvious that this was not a franchise I would see as a child. As an adult, however, this became an inevitability and, well, the time has come. In this first entry into the series, The Sorcerer's Store is a Spielbergian film with a great sense of wonder, magic, and a child-like view of the world in which it inhabits that makes it a true expression of childish glee and joy, even when it can become quite cheesy and a bit hokey.Those cheesy and hokey bits come at a few moments that can certainly be pin-pointed at the real lowlights of the film. The first is the Quidditch sequence. In 2001, the special effects in that scene were bad and they are somehow even worse in 2017. The flying as a whole is often quite rough, but the prolonged Quidditch scene is the most obvious portion that really fails to live up to expectations, especially because it is so long. Another bit that was a bit cheesy and cliche is the first act of the film. With young Harry (Daniel Radcliffe) dumped with his aunt and uncle after the death of his parents, he is constantly emotionally abused by his family with them constantly favoring their own son, Dudley. The exaggerated and cringy behavior of the family really never lands. It makes the audience hate the aunt and uncle, as they should, but it feels inauthentic and derived from a child's hyperbolic belief of how his guardians raise him, except it is all true. Overwrought and an entirely cliche way to introduce us to this magical world of wizardy, the opening is a rather pedestrian start to the beloved franchise. Finally, the ending is similarly pedestrian with the House of Gryffindor coming from behind after some last minute point additions. It is too much like a classic sports movie with the cliche of the protagonist team always snatching victory out of the jaws of defeat at the hands of the enemy - House of Slytherin, which includes Draco Malfoy (Tom Felton) and is led by Snape (Alan Rickman) - to really work. It is too happy and cheerful for a film that had already ended happily. Letting Gryffindor lose in the first year would have been a nice touch, as it gives them room to grow even in the game of Quidditch and not just as wizards.Aside from those issues, however, it is hard to rely find fault in the first foray into the world of Hogwarts and magic. Potter is a modern icon for a reason: his story is damn captivating. With a Spielbergian sense of wonder - just see Hagrid (Robbie Coltrane) ride in on a bike akin to E.T. for how Spielbergian it becomes - The Sorcerer's Stone always delivers the goods. It delves into this world of wizardy just enough without ever diving into full-on exposition, instead it sprinkles in mythology every so often to really wet your palette. The refusal to divulge every secret of this world really keeps you hooked in and aching for the next installment to the series in order for more of those questions to be answered and more magical doors unlocked.What makes the film so undeniably charming, however, has to be the cast. With young Daniel Radcliffe, Emma Watson, and Rupert Grint, leading the way, this deeply British cast always makes the film incredibly appealing. Though child actors, the trio of young leads strike the right balance between childish earnestness and strong acting. They retain that confused innocence of their situation - especially Radcliffe throughout, particularly before he gets to Hogwarts - without ever letting their performances devolve into truly annoying childhood roles. Alongside them, the reliable cast of elders deliver excellent performances. John Hurt is delightful in a brief appearance as the wand salesman. Maggie Smith nails her role as the headmistress, really possessing the right look and demeanor for a nice, but expectant headmistress. Richard Harris is lightly used as Dumbledore, but nonetheless a positive and friendly presence. However, nobody really nails their role like Alan Rickman. Reserved, cold, calculating, and menacing, he plays Snape like a villain and makes Harry's confusion regarding Snape's intentions all the more believable. Whenever on screen, Rickman steals the show.",
      "review_date": "2017-07-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is great for a beginning of a great visual effects saga.Os so perfect for a year called 2001 the Soundtrack ta perfect film is good in every way until the script legal.O ta ta good cast is Ron Rupert Emma surprised me and Daniel isThis movie is great for a beginning of a great visual effects saga.Os so perfect for a year called 2001 the Soundtrack ta perfect film is good in every way until the script legal.O ta ta good cast is Ron Rupert Emma surprised me and Daniel is a good actor.",
      "review_date": "2012-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very good adaptation of the book. All Harry Potter movies are good and recommended.",
      "review_date": "2013-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is such a cool movie. With seeing the wizarding world and going to Hogwarts. The effects were also prettty sweet. Daniel Radcliffe did a good job woth potraying Harry Potter. The presentation to this film was dramatic which made meThis is such a cool movie. With seeing the wizarding world and going to Hogwarts. The effects were also prettty sweet. Daniel Radcliffe did a good job woth potraying Harry Potter. The presentation to this film was dramatic which made me prepared for the film. Looking back nowadays this is a classic in my opinion hat will never leave my childhood memory.",
      "review_date": "2014-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Such a magical film for kids everywhere. I remember seeing this for the first time when I was a kid. It was spellbinding. Every time I watch Sorcerer's Stone I still feel that old feeling of happiness, but HP1 is not as dark and gritty asSuch a magical film for kids everywhere. I remember seeing this for the first time when I was a kid. It was spellbinding. Every time I watch Sorcerer's Stone I still feel that old feeling of happiness, but HP1 is not as dark and gritty as later Harry Potter's that I believe to produce more emotional depth. Some people prefer this one and think it is the best one. What more could Potter fans ask for? This is a wonderful film to watch. It starts off a series in spectacular fashion.",
      "review_date": "2012-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great score, fantastic sets and costumes and brilliant acting throughout. Amazing transformation from book to screen, including almost all of the detail provided in the book, done superbly.",
      "review_date": "2012-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I will say that I did try to avoid this series for as long as I could when it first came out, but after the first DVD release I got curious and wanted to see what all the fuss was about. I am so happy I gave this a chance.\r The Harry PotterI will say that I did try to avoid this series for as long as I could when it first came out, but after the first DVD release I got curious and wanted to see what all the fuss was about. I am so happy I gave this a chance.\r The Harry Potter universe is a rich one that is filed with great fantasy and wonder which, at that point, wasn't that common.\r Great visuals, nice acting and some masterful writing. Not to mention the grand set pieces,perfect wardrobe, and timeless musical score.\r Perhaps the only real gripe I have with the first movie is that feels like one very long prologue,focusing a bit to much on introductions and setting up future plot points.\r Overall:\rHPatSS is a great introduction to the series, but feels like it lacks a strong enough plot of its own. Still a great movie that helped me become a fan of the series.",
      "review_date": "2015-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The main characters acted well for children. There were some boring parts, but overall, it was enjoyable. It had a bright point of view and a dark point of view. The background music was well conducted. Graphics were good for a movie made 12The main characters acted well for children. There were some boring parts, but overall, it was enjoyable. It had a bright point of view and a dark point of view. The background music was well conducted. Graphics were good for a movie made 12 years ago. But there were some parts that connected the seens in the book, while in the movie, there isn't some connecting scenes from one sceene to another, so people that didn't read the book and only watched the movie might be a little confused, but it was great, and I hope that they keep on developing, and make movies that get top scores.",
      "review_date": "2013-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An amazing piece of art, great and really entertaining, a movie for the whole family, really well done! But it is more for kids.",
      "review_date": "2013-05-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not a bad start to one of the most successful franchises in history, mainly because it does so well with character introduction and development, but this movie gets slightly boring in a sense that they could show off so much more magic too itNot a bad start to one of the most successful franchises in history, mainly because it does so well with character introduction and development, but this movie gets slightly boring in a sense that they could show off so much more magic too it and go into more detail with the drusleys and more fantasy action in the third act. Pretty good movie",
      "review_date": "2015-08-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I absolutely loved it. The creativity, the special effects, the story, the characters, the performances, and the villain were so carefully and perfectly put together to make a heck of a movie. I can't describe how great this movie is comparedI absolutely loved it. The creativity, the special effects, the story, the characters, the performances, and the villain were so carefully and perfectly put together to make a heck of a movie. I can't describe how great this movie is compared to all the other fantasy movies I have ever seen.",
      "review_date": "2013-04-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest movie experiences of my childhood. The first part of the greatest magical saga \"Harry Potter\" is probably the best choice you can make if you haven't watch, especially if you like mysteries,magic and if you haveOne of the greatest movie experiences of my childhood. The first part of the greatest magical saga \"Harry Potter\" is probably the best choice you can make if you haven't watch, especially if you like mysteries,magic and if you have imagination! This movie is an example of PERFECTION! Full 10/10, without no doubt! I'm proud with the fact that i grew up with this movies and i'm proud to call myself a huge Harry Potter fan!",
      "review_date": "2013-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Remarkably well acting by a group of eleven-year-old children who would eventually become superstars in the film world. Very strong effects for the early 21st century.",
      "review_date": "2013-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not only was it a great start to one of the most beloved book series/franchise of all time, it stayed loyal to the books and introduced children everywhere to a whole new breed of wizardry. Overall, this is the same guy who made \"TheNot only was it a great start to one of the most beloved book series/franchise of all time, it stayed loyal to the books and introduced children everywhere to a whole new breed of wizardry. Overall, this is the same guy who made \"The Lightening Thief\"? Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies.",
      "review_date": "2013-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I first saw this movie when i was 4, i'm now 14 and I still love it. The film is outstanding, the acting excellent, the special effects mind blowing and the characters brilliant.",
      "review_date": "2013-04-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "his is the most-\"loyal\"-to-the-book Harry Potter movie, and it's from one of the best books. Logically, results in a wonderfull, amazing movie. Even if the effects aren't so good compared with the later films, the plot line is incredible. Ihis is the most-\"loyal\"-to-the-book Harry Potter movie, and it's from one of the best books. Logically, results in a wonderfull, amazing movie. Even if the effects aren't so good compared with the later films, the plot line is incredible. I have to repeat it, the \"loyalty\" to the book was amazing, that made this film awesome. I watched it 7 times in video and 2 times in the cinema. Yes, you heard well. I repeated a movie in the cinema, without beeing a super-fan. I loved it.",
      "review_date": "2014-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Harry Potter and the Philosopher's Stone brings everything a movie needs, from amazing young cast, a more mature cast, great special effects for the year of 2001, art direction magic that surely deserved an Oscar, the script does not speak toHarry Potter and the Philosopher's Stone brings everything a movie needs, from amazing young cast, a more mature cast, great special effects for the year of 2001, art direction magic that surely deserved an Oscar, the script does not speak to what is really amazing how Steve Kloves was faithful to livro.E Chris Columbus for the first time (in my opinion) been in a serious movie and respected.",
      "review_date": "2013-06-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is honestly... overrated. There is far too much talking, and too many scenes where people aren't really doing much, with a few exciting scenes, and that's about it. Talking scenes are okay for books, but, for movies, I'd like to seeThe movie is honestly... overrated. There is far too much talking, and too many scenes where people aren't really doing much, with a few exciting scenes, and that's about it. Talking scenes are okay for books, but, for movies, I'd like to see a lot more. And, even though it's common for dramatic movies to have uncolorful lighting, for a world of magic, it sure looked a bit dull. Not very memorable.",
      "review_date": "2013-07-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There are plenty creative ideas in the movie and the fantasy world of Hagwort looks also great. The story is good, because it is interesting to discover this fantasy world and it has even some twists. The visual effects are top, you can enjoyThere are plenty creative ideas in the movie and the fantasy world of Hagwort looks also great. The story is good, because it is interesting to discover this fantasy world and it has even some twists. The visual effects are top, you can enjoy them even today.The problem is of course, that kids are in the centre of the movie and their acting is just average.",
      "review_date": "2021-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wonderful music, passionate, beautiful visuals, and true to the book, \"Harry Potter and the Sorcerer's Stone\" is a delight, but still suffers from the fact that it may not surprise to the book fans.",
      "review_date": "2013-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A truly magical journey of mystery -- both characters and the basic premise is cleverly hidden behind this warm & happy character-diverse world. Well chosen actors and natural chemistry is a gigantic plus -- meanwhile a too simplistic andA truly magical journey of mystery -- both characters and the basic premise is cleverly hidden behind this warm & happy character-diverse world. Well chosen actors and natural chemistry is a gigantic plus -- meanwhile a too simplistic and slow story might bring it a but further down. Its far-stretched and slowly developed plot, but a happy one; is a wonder to follow. Add the never ending parallels with childhood & the struggles of being young and to grow up -- with a touching and never-forgetting score by Williams. It’s a classic first (but not flawless) entry.\r Personal rating: 79/100\rCritical rating: 77/100",
      "review_date": "2016-09-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this is an good adaptation of the j.k. rowlling book wich defines a good start point for this franchise,it is not a so perfect movie.Unfortunately daniel redcliffe isn't a so good actor to make this rule.",
      "review_date": "2013-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "With well-written dialogue and stunning visual effects, as well well-executed acting performances, 'Harry Potter and the Sorcerer's Stone' is truly magical.",
      "review_date": "2013-10-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When I was a kid this was incredible. The imagination of the book put onto the screen...the desire to be at hogwarts. once your older the novelty wears off. And you see while this movie has alot of positives...it is not one of the better Potters",
      "review_date": "2014-05-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An enjoyable, family friendly fantasy movie for audiences young and old. Pretty solid performances by new-comers and industry veterans alike. Looking forward to watching how Harry's story unfolds.",
      "review_date": "2018-11-18",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 131,
  "genres": [
    "Adventure",
    "Mystery",
    "Fantasy",
    "Family"
  ]
}