{
  "title": "Memento",
  "rating": 9.0,
  "release_date": "2001-03-16",
  "genre": [
    "Mystery",
    "Thriller"
  ],
  "summary": "Dismissed by the police, Leonard Shelby (Pearce) is obsessed with pursuing vengeance for the rape and murder of his wife.  The difficulty of his quest is compounded by his rare, untreatable form of memory loss.",
  "critic_reviews": [
    "A delicious one-time treat.",
    "Pearce, who's in every scene except the Sammy flashbacks, dominates the picture through his feral performance.",
    "Memento, which may be the ultimate existential thriller, has a spooky repetitive urgency that takes on the clarity of a dream.",
    "You're exhilarated from beginning to end.",
    "One of the most original and ultimately confounding mind games to reach the screen since \"The Usual Suspects.\"",
    "A provocatively structured and thrillingly executed film noir, an intricate, inventive use of cinema's possibilities that pushes what can be done on screen in an unusual direction.",
    "Like the best filmmakers at Sundance 2001, Nolan leaps into the wild blue and dares us to leap with him. Go for it.",
    "The video stores are filled with examples of retro-noir and neo-noir, but Christopher Nolan's audacious timebender is something else. Call it meta-noir.",
    "A brilliant feat of rug-pulling, sure to delight fans of movies like \"The Usual Suspects\" and \"Pi.\"",
    "Unforgettable, especially in Pearce's startling performance.",
    "Enthralling or infuriating.",
    "Deconstructs time and space with Einstein-caliber dexterity in the service of a delectably disturbing tale of revenge.",
    "Has the unanticipated craft and artfully ambiguous appeal of last year's \"Croupier,\" a movie whose art-house word-of-mouth success could be duplicated here.",
    "A puzzle movie in which the puzzle is actually worth the time and effort to solve.",
    "Despite the first-rate acting, the narrative is the star of this show, so much so that you feel yourself occasionally losing interest in the travails of the characters. Instead, you hang on every word and every tiny object, every cut and bruise in the frame, looking for clues that will help you make sense of what's going on.",
    "Nolan sustains an arty note of existential dread that probably will work better for noir-steeped film critics and overserious philosophy grad students than for general audiences, but he brings off a few brisk bravura moments.",
    "If nothing else, Memento is a savvy comment on the queasy uncertainties of the postmodern condition, in which history goes no further back than yesterday's news, and knowledge is supplanted by \"information\" from a tumult of spin-controlled, unreliable narrators.",
    "This unconventionally structured thriller moves at an energetic pace, spurred by a string of clever variations on conventional film narrative.",
    "A diabolical and absorbing experience.",
    "Bound to be talked about, debated and eviscerated far more than it's understood.",
    "It's scary to have to puzzle out a plot line scene by scene -- scary and exhilarating, at least for an hour.",
    "Feels mostly like an audacious prank.",
    "Whenever Harris or Tobolowsky come on-screen they stop Memento dead in its clever tracks. You want to tell Nolan to stop all the po-mo deconstructive game playing and pay attention to the two human beings in front of him.",
    "Once you've seen it all once I bet you'll wish you were watching \"Groundhog Day\" -- again."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "A Christopher Nolan's masterpiece, complex narrative is skillfully executed, keeping audiences guessing. Overall it's up to us, our interpretation, it's not just about the evidences",
      "review_date": "2011-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a movie with a \"twist\" but it doesn't put one in just to have a twist ... it's a part of the whole story, and somehow makes the whole weird story seem more real.",
      "review_date": "2011-02-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "well, this was complex man..great directing and storytelling. nice performance form Pearce, and i surely didn't expect an ending like it. it was genius really. it made me so confusing but i figured it out with the ending. unlike inception.well, this was complex man..great directing and storytelling. nice performance form Pearce, and i surely didn't expect an ending like it. it was genius really. it made me so confusing but i figured it out with the ending. unlike inception. so, a great movie, if you like watching dramas and mysteries then this is the one. OK?",
      "review_date": "2011-01-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "At first I was like What's going on? But then it hit me. The movie is getting told backwards. And it's doing it in such a great way. So imaginative. Just wanting to see what's going to happen next and how he did get there.",
      "review_date": "2012-01-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So the \"innovative\" concept of filming out of sequence has been cliche for at least a few years now, but here's a film that makes it work far better than its been shown in a while.Sir Nolan mixed confusion, uncertainty, and paranoia as anSo the \"innovative\" concept of filming out of sequence has been cliche for at least a few years now, but here's a film that makes it work far better than its been shown in a while.Sir Nolan mixed confusion, uncertainty, and paranoia as an art form and it went on splendidly. If I told you the entire plot of this film it really wouldn't matter as it is an exquisite paean to the subjectivity of memory and therefore is in itself ambiguous; the â",
      "review_date": "2011-10-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the most innovative movie that I have ever seen. I recommend it to everyone who loves complex movies. You'll be a bit confused at the beginning and you're actually not understand the movie until the half. It's just a great movie!",
      "review_date": "2012-05-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An unsparingly gripping and unforgettably remarkable thriller with an excellent story and intricately written characters. Masterstroke work here from one of the greatest directors still in this business.",
      "review_date": "2012-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Nolan suceeds in grabbing audience interests by making this a Whats gonna happen next film. It provided superb performances from many actors that you would not have guessed to have ever done any good and leaves you mind blown. Nolan at hisNolan suceeds in grabbing audience interests by making this a Whats gonna happen next film. It provided superb performances from many actors that you would not have guessed to have ever done any good and leaves you mind blown. Nolan at his absolute best.",
      "review_date": "2013-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The coolest film noir I've ever seen. It's way of telling a story is very effective and gets viewers to feel like they themselves have to solve the mystery. It is well written and is probably my favorite of all Christopher Nolan films.",
      "review_date": "2013-02-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "AMAZING! My mind has literally been raped...If you aren't an analytical thinker; don't watch this film. If you love mystery and puzzle logic--then by all means this is the film for you!!! I am still trying to recover from the ecstatic shock IAMAZING! My mind has literally been raped...If you aren't an analytical thinker; don't watch this film. If you love mystery and puzzle logic--then by all means this is the film for you!!! I am still trying to recover from the ecstatic shock I experienced while viewing the film. Wow! You're not just watching the film; you're alongside the character in his quest to find out the truth--and you solve the mystery before he does. I've never been so fully engaged in watching a movie...EVER!",
      "review_date": "2013-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best movies ever concieved and also the best Christopher Nolan movie. It has the most unique storytelling you will ever experience and tells a brilliant story with a lot more room for free thinking. my favourite movie!",
      "review_date": "2014-02-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The planning this film must of taken must of been long and extensive for this is a complicated,calculated yet incredibly successful script. So clever and so revolutionary if Nolan had not nailed this we may not have seen him take on the bigThe planning this film must of taken must of been long and extensive for this is a complicated,calculated yet incredibly successful script. So clever and so revolutionary if Nolan had not nailed this we may not have seen him take on the big money films later on. This is confident cinema that comes at you fully in the face. My only criticism is that it requires the upmost attention most of time,something you can't manage later on in the day. Apart from that, it's a Nolan essential.",
      "review_date": "2010-10-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "th movie makes such excellent use of it's plot device, that it's hard not to praise. i couldn't believe how difficult it was to play a movie back in time. everyone has to see it just for that.",
      "review_date": "2013-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Simply mind blowing. An absolute masterpiece in script. There is no movie like it. It starts at the ending of the story, and the movie ends with the beginning. Sounds simple enough? Watch it. 9.5/10",
      "review_date": "2013-11-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Memento is not just any other movie, it",
      "review_date": "2012-11-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Christopher Nolan's best movie. It makes you think and follow the story line by actually paying attention. It brings great life to movies that need some new blood in them. I asked for a physiological visionary and I got one.",
      "review_date": "2013-01-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So inventive a film in reverse.  Christopher Nolan has made a film here that cannot be replicated.  A rare film that you can't miss a second of or you must start over.",
      "review_date": "2013-06-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is not a usual film. All the movies that i saw which were directed by christopher nolan were great and had of course twists. Loved this one. A masterpiece actually. Watch it",
      "review_date": "2013-06-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best Nolan's movie. Absolute mindblowing thrilling. Main character memory defect renders genial plot and even hillarious moments. This picture complexity is amazing and movie is brilliant. A movie that makes watcher thinks a lot.",
      "review_date": "2018-07-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Memento makes use of its unique premise into what is a near masterpiece. Christopher Nolan once again proves his storytelling skills with a non-linear storyline filled with twists, turns and shocking reveals.",
      "review_date": "2013-12-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "the movie is great , the plot very well knit . I admire Mr Nolan about this work > I enjoy this movie very clever plot . It takes me a while to understand it .\r I believe the story of the movie goes like this :\r\n\r\nthe whole movie began whenthe movie is great , the plot very well knit . I admire Mr Nolan about this work > I enjoy this movie very clever plot . It takes me a while to understand it .\r I believe the story of the movie goes like this :\r the whole movie began when Lenny was speaking on the phone with a cop about a drug-dealer called Jimmy Grants , Teddy who claimed to be the cop gave Lenny some details about Jimmy where he would be in order to kill him , Lenny took Jimmy's clothes and the car then made some fact about Teddy his car license in order to kill him earlier .\r-the bar card from his pocket from Jimmy's suit which said \" come after Natalie \" this note suppose to be for jimmy not for him but he already didn't remember .\r Natalie after she knows about his condition ,she used him to get rid of Doddy who asked her about the money drugs and what happened to Jimmy . here maybe Jimmy was her boyfriend ,she recognize the car and the clothes that Lenny used .\rSammi's story : I believe it's a side story to bind with Lenny to make the audience to think that Sammi is Lenny himself .",
      "review_date": "2014-03-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is Christopher Nolan's masterpiece. Is the only one of his films that it is completely brilliant, it doesn't treat you like you are five years old by explaining the movie's world in an sloppy way with side-characters like Inception does.This is Christopher Nolan's masterpiece. Is the only one of his films that it is completely brilliant, it doesn't treat you like you are five years old by explaining the movie's world in an sloppy way with side-characters like Inception does. The writing is brilliant, every decision that was made had an amazing purpose and fit the movie in an intelligent way. It is a very original thriller with personality, it is its own movie; there will not be a movie like this. The issues i had were extremely minor and nit-picky, so for now this movie is a 9 or maybe a 10 If it grows on me. I will let time change my opinion, because this movie is excellent!",
      "review_date": "2015-04-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nEvery time I think about Christopher Nolan, I remember him as the guy who directed the The Dark Knight trilogy and made amazing films that are still watchable to understand, but then I heard about this film how complex it was and how it requires multiple rewatches to see it and understand.\r When I first saw Memento, I didn't understand it I was afraid I made pass it on saying I hated it,, but when I look back at the details and add them to the second viewing and getting advice from another cinemaphile, I realized in my second viewing wait.....I think I got it, amazing new storytelling technique, smart directing, mind-blowing twisted scrip, shocking ending and the results:\r OMG! MEMENTO IS CHRISTOPHER NOLAN'S BEST FILM EVER!!!!!! oh thank you Platypusbunny419!\r you've got to see this movie several times to understand. if your looking for something complex and hard to understand, a film you wanna keep digging deeper this is a film for you!!\r Its like a modern experiment using similar techniques from Quentin Tarantino's Pulp Fiction and Stanley Kubrick's non-linear film-noir 'The Killing' and make into something interesting! I dare you to see it MORE THAN ONCE!!!!!!!!! and for further information don't use reverse because it will ruin the special recipe.\r A Complex Achievement\r ***** - 5 stars instant certified classic",
      "review_date": "2015-05-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Complex, perfectly structured and just thrilling. Memento, is at pair with The Dark Knight and Inception, the best of Nolan's and truly a masterpiece. I heard somewhere that there's a orderly remastered version of this film, please just don'tComplex, perfectly structured and just thrilling. Memento, is at pair with The Dark Knight and Inception, the best of Nolan's and truly a masterpiece. I heard somewhere that there's a orderly remastered version of this film, please just don't do it. Watch it in the director's order, get your mind twisted and enjoy.",
      "review_date": "2018-09-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A character study of the most socially well-adjusted subject, with both short-term and long-term memory loss.The stylistic choice of editing the film in reverse, to help the audience relate and understand the character of Leonard (as wellA character study of the most socially well-adjusted subject, with both short-term and long-term memory loss.The stylistic choice of editing the film in reverse, to help the audience relate and understand the character of Leonard (as well as his condition), is a stroke of genius for director Christopher Nolan and film editor Dody Dorn. It is a rarity to find a film that makes an effort to convey how a character perceives the world around them.Obviously, there is a lot more detail to pick up on with multiple viewings of this film, and it is quite sound in the psychology department - as far as how damage to the hippocampus affects memory at least. Which adds to the effect of having the film's events play out in way that feels all too real.The acting is also quite the accomplishment, there is not a single weak performance from anyone in the film. There really isn’t much more I can add to the discussion about how good Guy Pearce’s performance was. He really does embody someone obsessed with the notion of how justice needs only a person's own perceived facts, no discussion or critic necessary. In many ways this film parables the folly of Egocentrism; in that how many people are unable to fit new information into their own personal perception of the world.If you are looking for a film tells an interesting story both contextually and narratively, then I would highly recommend Memento.",
      "review_date": "2018-04-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of my favorite films of all time. When it first came out, I watched it over and over, trying to piece it together; I think I was about 12. I watched it about 7 times as I recall. There is such deep thought put into this film. I also readOne of my favorite films of all time. When it first came out, I watched it over and over, trying to piece it together; I think I was about 12. I watched it about 7 times as I recall. There is such deep thought put into this film. I also read the story his brother wrote as inspiration for the film, and liked it as well. Of course the film instantly grabs your attention with a gory photo of a man covered in blood, but the film also keeps you engaged, as every scene is shot to perfection. Perfect cast, excellent acting. Even the 'sick and twisted' ending, I would not change, its just extra flare, like a cherry on top. This film oozzes EXCELLENCE on all levels.",
      "review_date": "2018-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If I could remember it, I'd call it the most malleable mythology I ever faced.Memento\n\nNolan's career defining and signature marking neo noir film is a bold statement on not just filmmaking but entertainment industry too. And he does it byIf I could remember it, I'd call it the most malleable mythology I ever faced.MementoNolan's career defining and signature marking neo noir film is a bold statement on not just filmmaking but entertainment industry too. And he does it by raising a simple question. How far should you go as a storyteller to express yourself and communicate coherently to your viewers? In this case, it is evidently reported for 8 years to put all this puzzled work in one big crime scene. Leanord (Guy Pearce) is suffering from short term memory loss and for a guy who can barely survive going through his own routine, he has embarked himself to cross a big revengeful mountain.To be honest, the film does most of its magic on paper. What's to wonder about is, Nolan who used props and elements for the style in Following, has now cornered himself into being obliged to use those same props. But this is Nolan, he doesn't bow down to such limitations in the script. He has simply jumbled up the events for some levity and uses it to give you enough reason to hang on to this trippy ride. Once again, the editing gets a shout out, But I'd also like to mention Nolan's choice of picturization of those abstract yet contextual repetitive part of the act. He hides the facts by acknowledging the fact that he is hiding it. Nolan has confessed that he loved using the similar picturization of both the flashbacks and real time screenplay that he learned from Terrence Malick's style, especially from The Thin Red Line.Let's follow the lead character Leonard and Pearce embodying a tattooed (scarred) personality as such. The bluff of Nolan is how to make him sympathetic that goes unnoticed in the film. His handicapped part of the personality is abused over and over by the other characters that actually mirrors their own figure, and as a result you are worried sick and exhausted by this experience. And Pearce plays it simply as Nolan reveals it in the \"guilty\" section of the storytelling, later in the film. The assumption is what leads us into this misunderstanding. Not the props, not the Memento.",
      "review_date": "2019-08-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "transcends the values of any movie, because it manages to create a unique timeline that came up with an incredible work of filming and editing",
      "review_date": "2018-01-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "(93/100)Backwards? Aaaaaah it's backwards! This is a f*cking amazing movie.",
      "review_date": "2018-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Memory is important. The protagonist goes through a struggle of finding truth and getting vengeance for his wife. This film proves how memory is so important because its shapes your perspective of things and life's encounters and it makes youMemory is important. The protagonist goes through a struggle of finding truth and getting vengeance for his wife. This film proves how memory is so important because its shapes your perspective of things and life's encounters and it makes you know who you are and know your truth with everyone and yourself.",
      "review_date": "2019-02-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Memento was a smart, clever and suspenful film that truly deserves its accolades as a cerebral thriller and classic. I absolutely loved it! It was Christopher Nolan's third best film behind The Dark Knight and Inception. A 10/10.",
      "review_date": "2010-08-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awesome movie Ill give it a 9.3 (9 in meta critic ). incredible story, cool actors and very emotional. This a movie. Christopher nolan you are the best!!!",
      "review_date": "2011-10-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Christopher's best movie till date.Absolutely drop-dead brilliant. You just don't see film-making like this anymore. Christopher Nolan is the genius we\"ve all been waiting for. Welcome to the second revival of great film-makers. It feels good.",
      "review_date": "2011-07-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Leonard Shelby-\"I have to believe in a world outside my own mind. I have to believe that my actions still have meaning, even if I can't remember them. I have to believe that when my eyes are closed, the world's still there. Do I believe theLeonard Shelby-\"I have to believe in a world outside my own mind. I have to believe that my actions still have meaning, even if I can't remember them. I have to believe that when my eyes are closed, the world's still there. Do I believe the world's still there? Is it still out there?... Yeah. We all need mirrors to remind ourselves who we are. I'm no different.\"Christopher Nolan once again creates one of the most mind bending and thrilling movie that has to be one of the greatest experiance you will have on film history. Memento is a confusing but a clever and unique movie that will blow your mind just by a few minutes into the movie. This Movie also relates to Insomnia and Inception, meaning the filming (using random flashbacks and using some sort of strange vision, like filming backwards or extreme close-ups).Christopher Nolan also brings back the looks and characters to his later movies, Like the name Kobb from Followin, might refer to Dom \"Cobb\" from Inception and the looks of Teddy and Catherine from Memento to Gordon (Batman Begins and Dark Knight) and Maul (Inception). Memento is based on the short story, Memento Mori, witch Guy Pearce Dominates in this classic thriller playing Leonard, a man with short-term memory loss that wakes up in a random room, not knowing what's going on, until looking at his body. tattoos fill up his chest with one saying \"JOHN G. RAPED AND MURDERED MY WIFE\", and the rest saying facts leading up to the murderer. He also finds his Polaroid pictures, one with a guy with glasses and a mustache, named Teddy, and other pictures of information. Everyday he has to go through the same thing, so you gotta feel bad for the guy. For the rest, you probably have to find out the stuff yourself. I love how Nolan takes control of his movies like this, I guess he wants everything to be good, and he did a pretty good job doing so. He creates the most innovated dramas that nobody can miss, and thats why he goes right up to one of my favorite directors. Thuis movie is also filmed in different time periods like Following, except playing the parts of the movie backwards, making the beginning actually the ending. If this movie is too confusing for you, the ending will sum it all up for you, then you can watch it the second time to try to pick up info, like I did, and boy was I confused.",
      "review_date": "2011-09-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I cannot believe how well this movie was put together. The potential it had to be repetitive, a la \"Groundhog's Day,\" was totally obliterated by Christopher Nolan's excellent storytelling. Nolan's first of a long line of accomplishments.",
      "review_date": "2011-07-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The most unique thriller of all time, with the best \"OH **** ending I can think of. Incredibly original, satisfying and, to top it all off, it makes you feel damn clever. A Nolan masterpiece and a must see for everyone.",
      "review_date": "2015-01-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The second best Christopher Nolan movie behind the dark knight. A movie unlike any other. It actually tells the movie backwards. This movie brings enjoyment. Awesome! 10/10",
      "review_date": "2013-07-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie \"Memento\" is one bizarre illustration of a rape story and its later consequences. It sets off with a murder from the look of which, the protagonist of the movie kills the guy who's raped and got it over with his wife. The look ofThe movie \"Memento\" is one bizarre illustration of a rape story and its later consequences. It sets off with a murder from the look of which, the protagonist of the movie kills the guy who's raped and got it over with his wife. The look of satisfaction and enthusiasm on his face implies that he's gotten his revenge and will live relieved after this, but you can never say that as there is no afterward events; the story enjoys a reverse chronology. In a story employing this technique, the first scene shown is actually the conclusion to the plot. Once that scene ends, the penultimate scene is shown, and so on, so that the final scene the viewer sees is the first chronologically.\rThis 2000 Christopher Nolan movie which is made well before Batman trilogy, The Prestige, and Inception, is based on a short story from Johnathan Nolan, the outstanding director’s brother who has been the co-screenwriter for Nolan’s other great works as well. All the first scenes are happening after the next one and just come to an end when the other one starts which is as strange on paper as it looks on the screen! Nonetheless, this is not the most moving factor in the movie as it is about to get even creepier. The main character of the story, Leonard Shelby [personalized by Guy Pearce] has lost his short memory in the unfortunate incident in a fight with the jerk raping his love. He would only keep the stuff going around him in his recollection for less than ten minutes. To remember things by, he has developed this taking pictures plus adding notes under them method. He usually carries a camera around and takes pictures from the people and places to have in his pocket which will be his only tool to judge people on their good and bad nature. It does not often pay off as the man would choose to write notes about people at the wrong time.\rBesides, Lenny has developed the habit of getting tattoos on his body about very important facts and information. The numbers of tattoos increase constantly, but never stop. The main character, who remembers to be a psychologist, usually talks of a Sammy Jackson which the viewer can never be certain of its existence which is the most terrifying fact.\rThe movie leaves the viewer holding the bag and awing at the heaviness of a 2-hour backward story. It educates you that you can never judge people based on one situation, teaches you that even short term memory is a full blessing, and shows you that everything could start only when you think they've come to a bitter end.\rThere it is: Christopher Nolan's weirdly overwhelming haunting movie that will make your jaw drop and leave you asking \"what did I just watch?\"",
      "review_date": "2013-09-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A beautifully crafted, mind bending thriller that will keep you guessing.\rFrom the brilliant mind of Christopher Nolan, Memento is an instant classic.",
      "review_date": "2013-11-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Magnificent! This film kept me at the edge of my seat the entire time. When it comes to Psychological/Mystery Thrillers, things can get a little old hacked. After watching enough movies from this genre one can begin to sense where the storyMagnificent! This film kept me at the edge of my seat the entire time. When it comes to Psychological/Mystery Thrillers, things can get a little old hacked. After watching enough movies from this genre one can begin to sense where the story is headed, but when it came to the conclusion of this masterpiece I was completely dumbfounded. This is a must see for those who love a movie that will keep your attention and in fact, this movie demands it!",
      "review_date": "2014-01-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is not just a film. It's an experience to what it must feel like having short term memory. This is a completely original way of filmmaking. It blew my mind..",
      "review_date": "2014-12-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie ...... it was a joy ride from beginning til end the whole thing just how it puts itself together is amazing and plays in reverse. The story is my favorite part. A man creates a strange system to help him remember things; so he canThis movie ...... it was a joy ride from beginning til end the whole thing just how it puts itself together is amazing and plays in reverse. The story is my favorite part. A man creates a strange system to help him remember things; so he can hunt for the murderer of his wife without his short-term memory loss being an obstacle.",
      "review_date": "2015-01-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent debut of the genius Nolan. Perfectly given story upside-down with unique flashbacks of Nolan. Excellent game of Guy Pearce. Well both the culmination and a tie are fine)",
      "review_date": "2017-07-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An eerie psychological thriller with a unique conceit that unfolds masterfully through a wonderfully demented presentation. Twists and turns galore, though this film never loses sight of what makes it so watchable.",
      "review_date": "2017-11-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best movies of the millenia. Christopher Nolan never dissapionts you! I can't wait to see the reboot! One of the things that are not that showing off about the movie was the soundtrack! It didn't get that kind of credit asOne of the best movies of the millenia. Christopher Nolan never dissapionts you! I can't wait to see the reboot! One of the things that are not that showing off about the movie was the soundtrack! It didn't get that kind of credit as Inception got! It was amazing to listen it! Anyway, the movie is spectecular!",
      "review_date": "2017-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The most original format to a simple revenge/thriller, the story genuinely puts the audience in the brain of the protagonist.",
      "review_date": "2020-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI guessed... I never got close.I know that it's a little late by now for this review considering this movie is twenty years old by now. However, it's still amazing. The way that Christopher Nolan puts this movie in a jumbled order that you don't quite realize until halfway through is genius. What's very interesting is how you have to think for a while then you get it. Spoilers ahead stop reading if you haven't seen it yet! You have the movie starting with him shooting Teddy, and then how he got there in the next scene, but what's funny is you think it's leading up to (or I guess leading down to) how he's going to reveal that Teddy is the bad guy. He is not! He's a cop, a not crooked one but a cop all the same, that's using a guy with no short-term memory to kill off drug dealers. Then you have Natalie, who seems nice but is ripping him off just the same and is using him to kill drug dealers that are competition and to get the cop off of the streets. You have him being used by everyone around to fit their purpose, turning him from a man on a revenged quest to basically a serial killer. They make him kill who they want as long as they justify it will help him. It's very well told and really makes you mad that the guy you're rotting for is a killer that's been duped. Nobody is a good guy. There is no hero. And why is it good then? It plays with your mind so well, you walk away and contemplate on it forever. Great movie, one of Nolan's best ever.",
      "review_date": "2021-06-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Perhaps one of the most original ideas and script for a film in last 20 something years, it's evenly-paced with scientific accuracy, great acting from Guy Pearce and Joe Pantoliano, and Nolan's brilliant direction to drive this this thrillerPerhaps one of the most original ideas and script for a film in last 20 something years, it's evenly-paced with scientific accuracy, great acting from Guy Pearce and Joe Pantoliano, and Nolan's brilliant direction to drive this this thriller as one of the more intricate ones.",
      "review_date": "2014-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This and The Prestige are the two best films by Chris Nolan which you have to watch more than once to understand, and this is the arguably the better film because of its unique storytelling technique, but I personally like The Prestige moreThis and The Prestige are the two best films by Chris Nolan which you have to watch more than once to understand, and this is the arguably the better film because of its unique storytelling technique, but I personally like The Prestige more for its historical setting. Shame he doesn't make thought provoking films like this any more.",
      "review_date": "2017-01-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A richly rewarding and incredibly innovative twist on the revenge thriller, Christopher Nolan's \"Memento\" features a standout performance from Guy Pearce and a story so intelligently and skilfully plotted and rendered, the payoff can makeA richly rewarding and incredibly innovative twist on the revenge thriller, Christopher Nolan's \"Memento\" features a standout performance from Guy Pearce and a story so intelligently and skilfully plotted and rendered, the payoff can make your jaw drop as all the pieces fall into place in your mind. Having only seen it once, I am conscious that perhaps my opinion may change with repeat viewings; however, \"Memento\" certainly makes the right first impression. It grips you, challenges you and, above all else, entertains you.",
      "review_date": "2014-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There's not much to say about \"Memento\" without spoiling anything, so I'm just gonna say: Watch it. The film's narrative structure will blow your mind.",
      "review_date": "2014-06-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Memento makes use of its unique premise into what is a near masterpiece. Christopher Nolan once again proves his storytelling skills with a non-linear storyline filled with twists, turns and shocking reveals.",
      "review_date": "2014-11-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A movie that will literally leave you speechless, Momento will keep you guessing and forces you to pay attention to really get what is going on. One of Nolan's best works.",
      "review_date": "2015-01-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wow, this is a great film. They used a very interesting way of telling the story and the mystery only gets unravelled at the very end. It's a very good twist, I liked it.",
      "review_date": "2015-11-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A bravura tribute to the spirit of “Point Blank” and the importance of short-term memory, “Memento” deconstructs time and space with Einstein-caliber dexterity in the service of a delectably disturbing tale of revenge. British-bornA bravura tribute to the spirit of “Point Blank” and the importance of short-term memory, “Memento” deconstructs time and space with Einstein-caliber dexterity in the service of a delectably disturbing tale of revenge. British-born scripter-helmer Christopher Nolan avoids the sophomore slump with flying colors while deepening some of the themes so craftily explored in his debut effort, “Following.” Pic’s aggressively nonlinear structure and subtle accretion of clues suggest a second viewing may yield additional rewards, although it’s all there the first time around for attentive auds.\r Opening credits show a hand holding a Polaroid photo of a bloodied dead man lying face down on concrete. The photo “un-develops” — indicating the scene is being shown in reverse. It’s a crucial image as well as an apt intro to a story told via constant episodes of backtracking and partial repetition, all meticulously layered to approximate the waking nightmare and endless conundrum of Leonard Shelby (Guy Pearce, with bleached blond hair and an American accent).\r If ever there was an unreliable narrator, Leonard is it. He can recall everything that happened in his life until the night of the assault that left his wife dead and him with brain damage from being hit over the head. Since then, he hasn’t been able to make a memory “stick.”\r Thanks to his condition, Leonard is simultaneously miserable and serene. He has to write himself notes about everything, with the most crucial reminders concerning his mission — such as “John G. raped and murdered your wife” — tattooed on his skin. Unable to remember anyone he’s met post-assault, no matter how many times they’ve interacted, Leonard takes Polaroids of everyone he meets and jots captions on them such as “She will help you out of pity” (in reference to a barmaid, played by Carrie-Anne Moss) or “Don’t believe his lies” (in reference to an alleged friend, played by Joe Pantoliano).\r Leonard’s curse is that even if he does get revenge, he won’t remember it a few minutes later. His condition also puts a fresh, frequently comical, twist on elements as basic as a chase scene: Leonard is running, but he can’t recall whether he’s doing the chasing or is being chased.\r Terrific idea and ingenious execution may wear thin or grow irritating for viewers unaccustomed to paying close attention. But anybody who dug the trippy triptych structure of “Pulp Fiction” should be able to keep up with the temporal shifts as narrative moves back, forward and sometimes sideways with the alacrity of a crab scuttling across the widescreen. Dody Dorn’s editing is top-notch as pic — scripted, acted and lensed with precision — smoothly toggles back and forth between sequences in B&W and in color.\r Pearce is superb, Moss and Pantoliano are vital sounding boards for Leonard’s quest and Mark Boone Jr. is a hoot as the motel desk clerk who rents Leonard two rooms on the theory he won’t recall having paid for either one. Stephen Tobolowsky is poignant as another victim of short-term memory loss whose sad evolution haunts Leonard.\r L.A.-set pic has an impressive noir-in-the-sunshine feel, built of cars, bars, motels and isolated hideaways. The ambient rumble of the unsettling, ominous score contributes enormously to the discomfiting mood.",
      "review_date": "2016-04-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie that made Nolan catch my eye. An absolute beast of a movie, nearly perfect in every way. The movie is cut up in to small sections (much like the memory capacity of the protagonist) and played out to the viewer back to front. TheThe movie that made Nolan catch my eye. An absolute beast of a movie, nearly perfect in every way. The movie is cut up in to small sections (much like the memory capacity of the protagonist) and played out to the viewer back to front. The movie starts with the last scene in real chronological order and you start the mystery there. Whilst it does not spoon-feed you the answers, it does answer all the questions you may have - thus fulfilling the story and satisfying everyone who watches it. Superb.",
      "review_date": "2016-09-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A completely underrated film that gave Christopher Nolan a tool to use in his later movies. This movie is not only physiologically enticing but also a movie that will continue to pester your mind until you'll stop questioning yourself. PardonA completely underrated film that gave Christopher Nolan a tool to use in his later movies. This movie is not only physiologically enticing but also a movie that will continue to pester your mind until you'll stop questioning yourself. Pardon my words, but this was a complete **** of a movie. I cannot express in words of how mysterious and rare this film is in the film industry. 9.5/10.",
      "review_date": "2017-12-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Christopher Nolan wanted Peter Deming to be the film's cinematographer, but he was unavailable, having already signed on to shoot Scream 3 (2000)",
      "review_date": "2021-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe blood coming out of Lenny's head when he is hit by his wife's attackers was Guy Pearce's idea, as well. Christopher Nolan thought it would be a bit too much at first, but then acquiesced to it after seeing it shot. \"It felt like his mind leaking out. It felt like the end of his past self.\"",
      "review_date": "2021-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPlot HolesDuring the confrontation between Leonard and Teddy after Leonard has killed Jimmy, Leonard mentions the $200,000 in Jimmy's car. However, at this point he has already forgotten about killing Jimmy, so he should also have forgotten about the money as Teddy doesn't mention it.",
      "review_date": "2021-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "mohiggugiihihihihihihhihu................+×÷=€£_()?*!&,,▪○●□■¤•°⊙☆《》¤¡¿◇♧♡♤{}[]●▪■•°°°¤¤°°~~~°°°°》°°",
      "review_date": "2021-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe real thing !If you hate reality-based film-making this is awful. If you hate Film Noir, this is ugly. But for me, Nolan has convinced me he is one of the most important directors out there. I was even thinking, \"It must be easy to edit a movie so that it's all backwards.\" But it's not, it's not any easier - and he leaves you straining and watching from scene to scene, searching for the truth. Even the final revelation will affect each viewer and leaves them searching for their own \"ultimate truth\" according to their own experience.Most people comment about manipulation in connection with this movie, but after watching the last scene, I'm convinced that manipulation is not the main theme at all. I don't want to spoil it for you, but the basis of unfolding backwards in time is that you are enlisted to scrutinize the film trying to discover some set of motivations behind each character's actions later in time that makes sense. If you think you would enjoy this sort of puzzle, I think you will enjoy this excellently crafted film.",
      "review_date": "2021-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "buguguggjjgjbjbbjjbjbjbjbhdwwetuopmmbvxadgukpoiyrqwsxchjiopoutedobjbjgyfygjgjgjgjgjgugugugufttstfffuugguugsmrmfm",
      "review_date": "2021-05-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_",
      "review_date": "2021-06-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "++++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■",
      "review_date": "2021-06-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Christopher Nolan's \"Memento\" may a little confusing at times, but ultimately the film is a complex, harrowing visual masterpiece that dives into the realm of psychology and the importance of memory in one's life. With Nolan's plannedChristopher Nolan's \"Memento\" may a little confusing at times, but ultimately the film is a complex, harrowing visual masterpiece that dives into the realm of psychology and the importance of memory in one's life. With Nolan's planned precision and some experienced acting from Guy Pearce, \"Memento\" is a definite must watch, a film that serves as a benchmark for the future films Nolan will create.",
      "review_date": "2016-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie demands a lot from the viewer. It is not only very confusing but also hard to entertain, because of the structure of the movie. But if you are curious about what really happened you will be rewarded with one of the best **** moviesThis movie demands a lot from the viewer. It is not only very confusing but also hard to entertain, because of the structure of the movie. But if you are curious about what really happened you will be rewarded with one of the best **** movies of all times. This movie is also the start of Christopher Nolans big career as one of the best director in the present.",
      "review_date": "2021-02-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A Christopher Nolan's masterpiece, the complex narrative is skillfully executed, keeping audiences guessing. Overall it's up to us, our interpretation, it's not just about the evidence.",
      "review_date": "2021-04-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nTeddy's (Joe Pantoliano) phone number (555 0134) is same as Marla Singer's (Helena Bonham Carter) in Fight Club (1999).",
      "review_date": "2020-01-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Memento is one of the greatest movies ever made, a neo-noir psychological thriller with motifs of memory, grief, and self-deception.The main character, Leonard Shelby, who suffers from anterograde amnesia (the inability to create newMemento is one of the greatest movies ever made, a neo-noir psychological thriller with motifs of memory, grief, and self-deception.The main character, Leonard Shelby, who suffers from anterograde amnesia (the inability to create new memories), relies on an intricate system of Polaroid photographs and tattoos to track the elusive John G., the man who raped and murdered his wife and took away his memory.A sequence of black-and-white scenes in chronological order is interspersed with a sequence of color scenes in reverse order (simulating the main character's mental state for the audience). The two sequences coincide at the climax, which is chronologically at the midpoint of the story. Along the way, all characters develop plans to exact revenge through manipulating others.",
      "review_date": "2020-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When I first heard about this film I was intriguied.And the thing that got my attention was not only the name of it's creator but the fact that our protoganist is having a rather strange and frightening sickness.Many say that the movie isWhen I first heard about this film I was intriguied.And the thing that got my attention was not only the name of it's creator but the fact that our protoganist is having a rather strange and frightening sickness.Many say that the movie is hard to understand or that it's structure is very complex.Well personally I don't think so.I watched the movie with great enjoyment.I remember the moment when realized HOW the movie works and trust me it was a thrilling realization.You may not like the characters as people,but you will surely believe that they are real. The storyline itself is great.It has many hidden parts and interesting details that took me one more watch to fully see and understand most of them.I won't spoil it for you,because even the slightest hint could ruin your experience,and trust this experience should't be ruined.The only thing is that I didn't quite remembered the soundtrack,but in other aspects the movie is fantastic and must be watched.9/10.",
      "review_date": "2020-06-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of Christopher Nolan's Best! Memento is an experience like no other, having the B&W scenes in Chronological order and the colored scenes in reverse. Making the audience question what is going on even after watching the movie. With a greatOne of Christopher Nolan's Best! Memento is an experience like no other, having the B&W scenes in Chronological order and the colored scenes in reverse. Making the audience question what is going on even after watching the movie. With a great story, actors, and director, Memento exceeds all expectations!",
      "review_date": "2021-01-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was Nolan's best work, even before he got popular. With this 19 going on 20 years later I still find myself re-watching this film.",
      "review_date": "2020-09-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was so beautifully put together. Without a doubt one of my all time favorites.",
      "review_date": "2020-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Memento is as good as movies get and probably Nolan's best work. It's an 'intelligent' movie, but surprisingly easy to keep track of despite the many flashbacks. Cinematography is superb, acting well done and an immersive plot. Film editingMemento is as good as movies get and probably Nolan's best work. It's an 'intelligent' movie, but surprisingly easy to keep track of despite the many flashbacks. Cinematography is superb, acting well done and an immersive plot. Film editing is done with black and white and colour in such a way that it warrants a second view time.",
      "review_date": "2021-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "akdmfnisijqjehiuujiopiuyreqeryiplkmlmjhjbnggvgcfxdzsaseryikooopoiuuytewadghkkkkok",
      "review_date": "2021-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe narrative jumps one hundred thirteen times, from one time period in the story to another. The first scene of the movie is the end of the story, and the story begins in the middle of the movie (when Leonard meets Sammy Jenkis).",
      "review_date": "2021-04-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nCharacter Error In the Jaguar Teddy gives Leonard the address of the Discount Inn. Teddy met Leonard at this motel earlier and therefore knows that he is already staying there. Leonard did not check out when they left and should therefore have both a picture and the key to room 21 in his possession.",
      "review_date": "2021-04-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nChronology: When numbering the scenes chronologically, then sorting them how they appear in the film, the pattern becomes more clear. The letters A-V will represent the color scenes (with A happening chronologically first, and V chronologically last), and the numbers 1-22 represent the black and white scenes chronologically. The scenes appear in the film like this: 1, V, 2, U, 3, T, 4, S, 5, R, 6, Q...20, C, 21, B, 22/A[1] The two types of scenes alternate. The black and white scenes (numbers) start from the beginning, and work forward to the climax at 22/A, while the color scenes (letters) work backward from the climax at 22/A. The climax scene (22/A) changes to color halfway through, showing the convergence of the two story lines.Christopher Nolan loves how Teddy randomly pops up unannounced, as if there is a whole side story that we're not seeing. Teddy already being in the car when Lenny gets in at one point was Joe Pantoliano's idea.",
      "review_date": "2021-05-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nFor the first \"loop,\" as Christopher Nolan refers to each scene, the director wanted to throw in all the main elements that would make up Lenny's character as well as the idea of repetition with a very jarring and memorable image. \"With this first loop in time, we wanted to have something truly unforgettable. A gunshot to the head seemed about as good as you can get.\" Nolan also mentions a key element to each loop was in the sound. He wanted to create a distinct sound for the end of each loop, Teddy knocking on the door to the motel, Lenny putting the clip into the gun, to give each section its own identity. Later in the film, Nolan used fragments of scene to transition, as the audience would then be comfortable with the film's rhythm.",
      "review_date": "2021-05-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■",
      "review_date": "2021-06-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤::;:;:;:;:;:;:;:;:;:;:;:;:;:;:◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇",
      "review_date": "2021-06-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡",
      "review_date": "2021-06-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "[][][][][][][][][][][][][][][][][][][][][][][][][][][][]!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,",
      "review_date": "2021-07-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************",
      "review_date": "2021-07-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "On my top 5 fav list! captivating and original, u may need a second veiwing to get what it means, but you wont mind seeing it again and again and again.",
      "review_date": "2005-10-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "□□□□□□□□□□□□□□□□■■■■■■■■■■■■■■■■■■¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡",
      "review_date": "2021-07-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely drop-dead brilliant. You just don't see film-making like this anymore. Christopher Nolan is the genius we\"ve all been waiting for. Welcome to the second revival of great film-makers. It feels good.",
      "review_date": "2011-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another of my all-time favorites.  Deep, compelling and always toeing the line of audaciousness.  Great cast, genuinely original and watchable a dozen times over.  A masterpiece that got swept under the rug years ago, shamefully....  AnAnother of my all-time favorites.  Deep, compelling and always toeing the line of audaciousness.  Great cast, genuinely original and watchable a dozen times over.  A masterpiece that got swept under the rug years ago, shamefully....  An absolute must-watch!!!",
      "review_date": "2012-03-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is an amazing movie, with an amazing concept, and an expert storyline to fit it. The idea of telling the story backwards is brilliant and works for his short-term memory loss. Guy Pearce was amazing in his role as Leonard Shelby. ThisThis is an amazing movie, with an amazing concept, and an expert storyline to fit it. The idea of telling the story backwards is brilliant and works for his short-term memory loss. Guy Pearce was amazing in his role as Leonard Shelby. This film makes it obvious as to why Christopher Nolan is the greatest modern director and writer.",
      "review_date": "2013-02-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the greatest, most unpredictable movies of the decade. A must-see.",
      "review_date": "2013-04-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Memory - it is one of the key elements that separates human beings from animals. It is one of the basic building blocks of personality. Who we are is shaped as much by our experiences as by our environment. Memory can also be unreliable, notMemory - it is one of the key elements that separates human beings from animals. It is one of the basic building blocks of personality. Who we are is shaped as much by our experiences as by our environment. Memory can also be unreliable, not to mention easily influenced. Ask three people to describe the same event, and none of those accounts will be the same. But, although memories are skewed by perspective, they are critical to the human experience. Memento is very much concerned with all aspects of memory, especially the manipulation of it, and this endlessly fascinating, wonderfully open-ended motion picture will be remembered by many who see it as one of the best films of the year.\r When I initially saw Memento at the 2001 Sundance Film Festival, where it played in competition, I recognized this as a shoo-in for a spot on my year's end Top 10 list. There's no way this film could miss. Had it been released last year, it would have landed in the #1 or #2 position (right ahead of or behind Requiem for a Dream). This is a great motion picture, and, as an added bonus, it has a tremendous \"replayability\", meaning that subsequent viewings are almost as rewarding as the first. The only downside is that, with a small distributor like Newmarket Capital Group, it may be difficult to find, especially for those who don't live near major metropolitan areas.\r Memento doesn't stop with a great premise. In fact, what really distinguishes this film is its brilliant, innovative structure. Nolan has elected to tell the story backwards. He starts at the end and finishes near the beginning. The main narrative is presented as a series of three-to-eight minute segments, each of which ends where the previous one began. A second thread, which starts at an unspecified time in the past and moves forward to intersect with the main storyline, is used to buffer the \"reverse\" segments as well as to provide background information. (It also tells the important \"Sammy Jankis\" story, which becomes increasingly important the deeper we get into the film.) Although this approach might at first seem confusing, it doesn't take long to get used to it, and to understand how well it works with this material.\r By presenting events in Memento backwards, Nolan allows us to get into the mindset of the main character. Like Leonard, we don't have a clear indication of what happened before the current segment of time. We know some things from the past, but not the recent past. Like him, we are presented with numerous cryptic clues, some of which may mean something other than what they initially appear to represent. And, although it might seem that an approach which reveals the story's conclusion in the first five minutes would lack tension, that's far from the case. Memento builds to a surprising yet completely logical finale, and there's plenty of suspense along the way to keep the viewer riveted.\r In some ways, Memento can almost be described as anti-Groundhog Day. (The presence of Stephen Tobolowsky in supporting roles in both movies strengthens the connection.) Both pictures toy with timelines and memory, but, while Groundhog Day re-treads one period of time, constantly re-shaping recent history, Memento represents the past as a vacuum. Bill Murray's character in the 1993 film has multiple memories of a single time period. Here, Leonard has none. Another movie that comes to mind when discussing Memento is the Dana Carvey comedy Clean Slate. The two films have pretty much the same premise, but, while Clean Slate does little with it, Memento draws every ounce of potential from this rich well.\r Every festival has a defining film. Sometimes it wins awards; sometimes it doesn't. For Sundance 2001, Memento was that movie. Despite its diversity of genres, the festival couldn't boast anything better; now, in the bleak movie-going climate of early spring, Memento is poised to breathe life back into art houses and independent theaters that have been as stung as multiplexes by mediocre fare. For those who love films and don't mind endings that don't wrap everything into a tidy package, Memento is not to be missed, even if you have to make a long trip to reach a theater showing it.\r When it comes to making a Top 10 list for 2001, one title I won't forget is Memento.",
      "review_date": "2015-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first masterpiece of the genius Cristopher Nolan. The most innovative thing about this movie is the way the plot unfolds, which made me think of the movie Irreversible, but this time, the \"backwards\" plot actually makes sense from aThe first masterpiece of the genius Cristopher Nolan. The most innovative thing about this movie is the way the plot unfolds, which made me think of the movie Irreversible, but this time, the \"backwards\" plot actually makes sense from a narrative point of view.",
      "review_date": "2017-11-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I personally don't like Christopher Nolan's more recent movies but I love his old ones.  In my opinion, this is Nolan's best film.  Yes, even better than The Dark Knight or Inception.  I wish Guy Pearce would do more movies because I reallyI personally don't like Christopher Nolan's more recent movies but I love his old ones.  In my opinion, this is Nolan's best film.  Yes, even better than The Dark Knight or Inception.  I wish Guy Pearce would do more movies because I really enjoyed his role in this film.  Also Carrie Anne Moss (From The Matrix) was incredible in this movie as well.  Nolan did a very nice job with the writing and plot in this movie and I think it might be some of the best of all time and that's why it was nominated for an academy award for writing.  If you ask me, you can't call yourself a Nolan fan if you haven't seen this movie.",
      "review_date": "2014-11-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Memory - it is one of the key elements that separates human beings from animals. It is one of the basic building blocks of personality. Who we are is shaped as much by our experiences as by our environment. Memory can also be unreliable, notMemory - it is one of the key elements that separates human beings from animals. It is one of the basic building blocks of personality. Who we are is shaped as much by our experiences as by our environment. Memory can also be unreliable, not to mention easily influenced. Ask three people to describe the same event, and none of those accounts will be the same. But, although memories are skewed by perspective, they are critical to the human experience. Memento is very much concerned with all aspects of memory, especially the manipulation of it, and this endlessly fascinating, wonderfully open-ended motion picture will be remembered by many who see it as one of the best films of the year.\r When I initially saw Memento at the 2001 Sundance Film Festival, where it played in competition, I recognized this as a shoo-in for a spot on my year's end Top 10 list. There's no way this film could miss. Had it been released last year, it would have landed in the #1 or #2 position (right ahead of or behind Requiem for a Dream). This is a great motion picture, and, as an added bonus, it has a tremendous \"replayability\", meaning that subsequent viewings are almost as rewarding as the first. The only downside is that, with a small distributor like Newmarket Capital Group, it may be difficult to find, especially for those who don't live near major metropolitan areas.\r Memento doesn't stop with a great premise. In fact, what really distinguishes this film is its brilliant, innovative structure. Nolan has elected to tell the story backwards. He starts at the end and finishes near the beginning. The main narrative is presented as a series of three-to-eight minute segments, each of which ends where the previous one began. A second thread, which starts at an unspecified time in the past and moves forward to intersect with the main storyline, is used to buffer the \"reverse\" segments as well as to provide background information. (It also tells the important \"Sammy Jankis\" story, which becomes increasingly important the deeper we get into the film.) Although this approach might at first seem confusing, it doesn't take long to get used to it, and to understand how well it works with this material.\r By presenting events in Memento backwards, Nolan allows us to get into the mindset of the main character. Like Leonard, we don't have a clear indication of what happened before the current segment of time. We know some things from the past, but not the recent past. Like him, we are presented with numerous cryptic clues, some of which may mean something other than what they initially appear to represent. And, although it might seem that an approach which reveals the story's conclusion in the first five minutes would lack tension, that's far from the case. Memento builds to a surprising yet completely logical finale, and there's plenty of suspense along the way to keep the viewer riveted.\r In some ways, Memento can almost be described as anti-Groundhog Day. (The presence of Stephen Tobolowsky in supporting roles in both movies strengthens the connection.) Both pictures toy with timelines and memory, but, while Groundhog Day re-treads one period of time, constantly re-shaping recent history, Memento represents the past as a vacuum. Bill Murray's character in the 1993 film has multiple memories of a single time period. Here, Leonard has none. Another movie that comes to mind when discussing Memento is the Dana Carvey comedy Clean Slate. The two films have pretty much the same premise, but, while Clean Slate does little with it, Memento draws every ounce of potential from this rich well.\r Every festival has a defining film. Sometimes it wins awards; sometimes it doesn't. For Sundance 2001, Memento was that movie. Despite its diversity of genres, the festival couldn't boast anything better; now, in the bleak movie-going climate of early spring, Memento is poised to breathe life back into art houses and independent theaters that have been as stung as multiplexes by mediocre fare. For those who love films and don't mind endings that don't wrap everything into a tidy package, Memento is not to be missed, even if you have to make a long trip to reach a theater showing it.\r When it comes to making a Top 10 list for 2001, one title I won't forget is Memento.",
      "review_date": "2015-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Challengingly complex thriller from Christopher Nolan about a man with short-term memory loss out to avenge the murder of his wife. With two converging sequences of events being played out in parallel, Memento both demands and warrantsChallengingly complex thriller from Christopher Nolan about a man with short-term memory loss out to avenge the murder of his wife. With two converging sequences of events being played out in parallel, Memento both demands and warrants careful attention throughout as the audience must hunt for clues in every scene to help piece together the puzzle. Watching one half of the story unfold backwards is demanding but genuinely rewarding as earlier events in the film are explained retrospectively.The film owes a great debt to the clever story telling technique employed by Nolan, as without this the story would actually be far less dramatic.Guy Pearce is superb as the aggrieved husband and plays his character with a subtly sly sense of humour considering the events unfolding.",
      "review_date": "2012-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As one of the first Nolan-esque movies of its kind, Memento and its director deserve a lot of credit. Movies like this must be so hard to write, film, and edit. The continuity issues, anachronisms, and the plot holes all have to be tied up inAs one of the first Nolan-esque movies of its kind, Memento and its director deserve a lot of credit. Movies like this must be so hard to write, film, and edit. The continuity issues, anachronisms, and the plot holes all have to be tied up in a nice little bow in order for it to work. Well, for the most part, Nolan has done the best he can with this complex-yet-simple, twisty-and-turny, flash-forward-flashback screenplay of his. The repetition and the way the story unfolds is pretty neat, and the cinematography is great thanks to Team Nolan's good ol' Wally Pfister. It's the type of Inception-ish movie where you have to be 100% focused on it at all times, and you have to be ready to think for a second. For the way the non-linear story plays out, it is a cinematic achievement, right up there with Pulp Fiction.",
      "review_date": "2014-06-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Perplexing, Chilling, Stunning, Riveting--- following more puzzlement---- accompany this piece of work and paints a masterpiece of film-making with such precision that it requires multiple viewings just to make sense of it all. The ultimatePerplexing, Chilling, Stunning, Riveting--- following more puzzlement---- accompany this piece of work and paints a masterpiece of film-making with such precision that it requires multiple viewings just to make sense of it all. The ultimate thriller for the patient of mind.",
      "review_date": "2011-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥",
      "review_date": "2021-06-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "when I first saw this film, I was simply shocked. It's not only 100 minute film, because it will make you think about this for a year. I loved the way that Chris Nolan formed the plot, and showing everything out when it was climax. It's thewhen I first saw this film, I was simply shocked. It's not only 100 minute film, because it will make you think about this for a year. I loved the way that Chris Nolan formed the plot, and showing everything out when it was climax. It's the best film in 2000 for me, and I crazily love this film.",
      "review_date": "2018-04-24",
      "source": "metacritic"
    }
  ],
  "num_reviews": 124
}