{
    "title": "Monsters, Inc.",
    "rating": 8.6,
    "release_date": "2001-11-02",
    "genre": [
        "Adventure",
        "Fantasy",
        "Comedy",
        "Animation",
        "Family"
    ],
    "summary": "The Academy Award-winning creators of \"Toy Story\" open the door to a frightfully funny world of monsters and mayhem and scare up lots of laughs in their new movie, Monsters, Inc.  [Disney/Pixar]",
    "critic_reviews": [
        "As giddy and antic as any great Warner Bros. cartoon of the 1930s and '40s -- it bears seeing more than once, if only to allow for the sight gags that play second fiddle to the plot, a rarity in animation -- but also resonant and real. In other words, it's the perfect movie.",
        "It's the Pixar animators who keep grown-ups as riveted as the kids with visual marvels that dazzle and delight.",
        "The story's charming, the set pieces are wildly inventive, and even the throwaway one-liners, about everything from movie-animation pioneer Ray Harryhausen to the old Oscar Meyer jingle, are hilarious.",
        "It's unfailingly lively entertainment that doesn't stint on (earned) feeling. Ideas about fear of the unknown, industrial corruption, and the splendours of polymorphity are all taken in stride. The balance tilts towards action and gags, and does them gloriously.",
        "There hasn't been a film in years to use creative energy as efficiently as Monsters, Inc.",
        "It comes from Pixar, the animation studio that scored with the \"Toy Story\" series and \"A Bug's Life,\" and it has more zip and a tad less soul than those predecessors.",
        "The climax, featuring what's essentially a suspended roller coaster of closet doors, is as thrilling as it is imaginative.",
        "Movies like Monsters, Inc. literally make you feel like a kid again, marveling at the joyously inventive sights before you, and that's a feat that should not be taken lightly.",
        "\"Shrek\" is a scintilla funnier, \"Toy Story 2\" a hair's breadth more poignant, but \"MI\" is every bit as imaginative and lovable as these other contemporary animation classics.",
        "Smart, funny and ingeniously detailed with terrific vocal teamwork.",
        "Though the comedy is sometimes more frenetic than inspired and viewer emotions are rarely touched to any notable degree, the movie is as visually inventive as its Pixar predecessors.",
        "Not quite up to the exalted level of the two predecessors (\"Toy Story\" and \"Toy Story 2\"), be assured it's still the most eye-popping and thoroughly entertaining animated film to come down the pike so far this year.",
        "Confirms that despite all the technical tools at their disposal, one thing counts head and shoulders above razzle-dazzle eye candy (or anything else, for that matter): the story and characters, and Monsters, Inc. introduces worthy additions to the Pixar pantheon.",
        "Much more kid-oriented than any other computer-animated movie thus far. In other words, it's much more Disneyish. I enjoyed it.",
        "An unprecedented friendship between a monster and a child leads to an amazing chase scene.",
        "The spirited interplay between Goodman and Crystal is both wacky and, dare I say, charming.",
        "The movie's cutest twist is that the monsters are more scared of kids than kids are of them, because they think human children are toxic.",
        "Funny and sweet enough to delight kids and inventive enough to satisfy adults.",
        "Monsters, Inc. has got that swing, that zippity, multilevel awareness of kids'-eye sensibilities and adult-pitched humor.",
        "Monsters, Inc. is cheerful, high-energy fun, and like the other Pixar movies, has a running supply of gags and references aimed at grownups.",
        "It's a nice movie. But Disney has never learned that \"nice,\" especially in comedy, is a negative virtue.",
        "Clever and jokey in a vaudeville sort of way, but lacks the heart and sheer imagination of the company's best work for Disney, \"Toy Story 2\" and \"A Bug's Life.\"",
        "Doesn’t have the warmth of the Toy Story pictures, but it still boasts a very entertaining slapstick-farce structure and some neat hairy, oozy, tendrilly creatures.",
        "Though it has its charms, Monsters, Inc. does not measure up. As a childhood entertainment it is certainly fine, but Pixar's celebrated lure for adults is largely absent.",
        "The funny lines fall flat and the relationships and conversations among adult characters are straight out of 1950s sitcoms. Now that's scary.",
        "But Monsters, Inc. -- directed by Pixar soldier Pete Docter, not by master digital comic John Lasseter -- turns out to be stingy on context, commentary, and the prism-ing view of pop culture that made the earlier films mint."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "\"Monsters Inc.\" is the milestone animation of Pixar's big debut to the 21st century. As expecting, the film is amazing, containing good morals that audience of every age can understand and appeal. Two thumbs up!!!",
            "review_date": "2011-09-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the greatest movies I've ever seen. The characters are likeable and the story is original and heartwarming. Disney never fails to entertain both children and adults.",
            "review_date": "2011-08-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of my favourite Pixar films, and a true popular classic. While it lacks the soul of Toy Story, it's a crackingly good film, with impressive animation and loveable characters. While just missing out on perfection, Monsters Inc. is aOne of my favourite Pixar films, and a true popular classic. While it lacks the soul of Toy Story, it's a crackingly good film, with impressive animation and loveable characters. While just missing out on perfection, Monsters Inc. is a brilliant, loveable and well done film that anyone can enjoy.",
            "review_date": "2010-09-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters, Inc. is film animation at its most heart-warming, poignant and hilarious. The film is not just a simple, pretty diversion to keep the young ones quiet for 90 minutes, but an incredibly clever, multi-faceted film for all ages. It's aMonsters, Inc. is film animation at its most heart-warming, poignant and hilarious. The film is not just a simple, pretty diversion to keep the young ones quiet for 90 minutes, but an incredibly clever, multi-faceted film for all ages. It's a buddy movie, it's a work-based sitcom, an imaginative fantasy film, and most pleasingly a biting and intelligent satire on both the world energy crisis and the over-exposure of children to increasingly horrific images in the modern world. Inventively, the monster city is not powered by electricity, gas and oil, but by children's screams, which the workers of Monsters Incorporated, dubbed \"scarers\" are tasked with collecting by going through portals into the human world, portals which appear as closet doors in the bedrooms of children. The monster world is facing an energy shortage due to the fact that kids \"just don't get scared like they used to\", resulting in some monsters resorting to increasingly drastic and amoral techniques to extract childrens' screams. The cast all give sterling vocal performances - John Goodman's hairy soft-hearted giant Sulley and Billy Crystal's minuscule green cyclops Mike make a great comedy double-act, Steve Buscemi's reptilian villain Randall is appropriately slimy and conniving, and the staggeringly multi-talented animator/writer/director/occasional actor Bob Peterson voices the cynical slug-secretary-from-hell Roz, and never fails to raise a smile. Monsters, Inc. gets the balance between vastly differing moods just right, with cuteness (Sulley's adorable father-daughter relationship with Boo), humour (anything said or done by Mike) and darkness (Randall's unsavory evil master plan) all given equal service throughout the film by director Pete Doctor and the multiple writers. I also challenge anyone who's in possession of a working heart not to blub at the film's bittersweet, utterly heartbreaking finale. This might provoke considerable debate amongst Pixar devotees (as the vast majority of the studio's output is jolly good, afterall) but I say that Monsters, Inc., while only being the fourth film released, is the very best work the animation powerhouse has produced thus far. It's truly Pixar's finest hour not only due to its flawless technical craftsmanship, but because of its abundance of heart and soul.",
            "review_date": "2012-06-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For some reason, though I like almost all Pixar films, this is my undeniable favorite.  I don't know whether it's the comedic aspect or the fact that it actually drills in some suspense near the end, but this is that kind of movie that,For some reason, though I like almost all Pixar films, this is my undeniable favorite.  I don't know whether it's the comedic aspect or the fact that it actually drills in some suspense near the end, but this is that kind of movie that, wherever and whenever I see it on, I will watch it to the very end.",
            "review_date": "2011-08-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters, Inc is a great film. What it is is funny, well animated and well written. What it isn't is Pixar's best, it's still a classic, but not up there with the best of the Pixar films. Mike, Scully and the gang are a memorable bunch, whichMonsters, Inc is a great film. What it is is funny, well animated and well written. What it isn't is Pixar's best, it's still a classic, but not up there with the best of the Pixar films. Mike, Scully and the gang are a memorable bunch, which is why I suppose Pixar are making a prequel to the film for 2013. The film is great but not superb, it shows that Pixar can yet again make a great film about just about anything that is great viewing for kids and adults alike.",
            "review_date": "2012-01-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nIt is perhaps the most heart-warming film that Pixar has created. Mike and Sulley work at Monsters Inc., where their jobs are to scare children to create electricity for the monster world. When a child escapes into the monster world for the first time in history, Mike and Sulley must help her get home safely",
            "review_date": "2011-11-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monster's Inc is extremely heartwarming and original along with mostly going for laughs the whole time which it most definitely does. And the film may scare some children but overall it is fantastic. I give this film 86%.",
            "review_date": "2012-01-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I love this movie! It's a work of art made by Pixar in the aspects of comedy, animation, and heartwarming moments. Not to mention the marvelous one-liners and hidden jokes worked into the script so that you have to watch it numerous times toI love this movie! It's a work of art made by Pixar in the aspects of comedy, animation, and heartwarming moments. Not to mention the marvelous one-liners and hidden jokes worked into the script so that you have to watch it numerous times to fully appreciate the hidden humor.",
            "review_date": "2012-05-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'll be honest, I have a soft spot for this movie. Monsters Inc. isn't my favorite Pixar movie, and I do have my gripes with it. But on the whole I just found it utterly charming.\r It's funny and sad. Carefree and serious. Slow and fastI'll be honest, I have a soft spot for this movie. Monsters Inc. isn't my favorite Pixar movie, and I do have my gripes with it. But on the whole I just found it utterly charming.\r It's funny and sad. Carefree and serious. Slow and fast paced. Monsters Inc. really does try to do everything, but for the most part I think this is the movie's downside. It's trying so hard to do everything, that it kind of has your emotions all over the place. Making it difficult to fixate on how you are supposed to feel.\r Boo is perhaps the most adorable animated child EVER! Crystal & Goodman do a great job and deliver non stop laughs.\r Overall:\rMonsters Inc. is perhaps the funniest of all the Pixar movies and still retains the Pixar magic of family friendly storytelling (even with monsters.) I thoroughly enjoyed this movie and will continue to do so every time I watch it.\r Side Note:\rPixar's \"bloopers\" are by far the star of each Pixar film, a real shame they don't do them anymore.",
            "review_date": "2013-12-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Won of the first and the best of the Pixar films.  Really entertaining characters that are enjoyable for kids and adults.  Also perfect voice casting with Billy Crystal and John Goodman.",
            "review_date": "2013-07-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The heart of the movie and it's comedic dynamic duo make this an amazing story of how anyone can find love in the things that everyone fears. Loved this movie, and I've watched multiple times.",
            "review_date": "2013-08-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One thing about Pixar's movies that are true to this day is their trailers do absolutely no justice for the film. There's so much depth and artistry in Pixar's work it's amazing that they have yet to falter after all of these years.",
            "review_date": "2015-03-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As well as original, Monsters, Inc. is fantastic and has its charms. The main characters, Sully and Mike, are lovable, as is the adorable child 'Boo'. With great voice-acting and animation, this makes one of Pixar's best, and a must see forAs well as original, Monsters, Inc. is fantastic and has its charms. The main characters, Sully and Mike, are lovable, as is the adorable child 'Boo'. With great voice-acting and animation, this makes one of Pixar's best, and a must see for Pixar fans.",
            "review_date": "2015-11-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am mixed on this movie. On one end I think it is a great kids film. The story is simple and easy to follow. There is an imaginative concept behind the Monsters world. The characters are likeable. Plus, the animation is great giving us aI am mixed on this movie. On one end I think it is a great kids film. The story is simple and easy to follow. There is an imaginative concept behind the Monsters world. The characters are likeable. Plus, the animation is great giving us a bright and colorful world. On the other hand, this film does not offer much for an older audience. The story does not have much too it and the characters are simple, both lacking the sosphistication of later Pixar films and Toy Story although I have not seen the original in a while so I cannot say that. So I will wrap up my review with this. If you have little kids and you are looking for something fun and safe to show them, show them this film they will probably love it like I did back when I first saw the film in first grade. However, if you are looking for animated film with some sophistication then you might want to look elsewhere. While Monsters Inc. is a great kids film it is an ok film. Given the weak performance of Cars 2, which is for babies, and Brave, which was consisted mostly of an unoriginal story with only the last third being interesting, I am worried that Monsters University will be another film for the kiddies as opposed to the people who saw the original as kids and are now adults and/or in college.",
            "review_date": "2013-05-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In my opinion, this is probably the least memorable Pixar movie. But on its own, its a very good movie. Better than the other big animated movie released in the same year, Shrek.",
            "review_date": "2011-04-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "it doesn't have the same sophistication as Toy Story, but still its an awesome Pixar movie!",
            "review_date": "2010-10-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was actually rather good and interesting if you ask me. I enjoyed the film quite a bit. The only bad thing is that it can get rather boring towards the middle of the film but it ends perfectly.",
            "review_date": "2011-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "James P. Sullivan is the top kid scarer at Montsers, Inc. and alongside best friend Mike Wazowski they form a formidable team. When a mistake leads to a human escaping from the human world into their own things get complicated.    AsideJames P. Sullivan is the top kid scarer at Montsers, Inc. and alongside best friend Mike Wazowski they form a formidable team. When a mistake leads to a human escaping from the human world into their own things get complicated.    Aside from the Toy Story series Monsters Inc is probably my favourite of all the Disney Pixar movies. Featuring a memorable cast of characters (as ever voiced by a superb cast) this is great fun for adults and kids of all ages.",
            "review_date": "2013-12-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The connection of humans and monsters in this movie is so out of this world, and that is truly proven with its fantastic story. The graphics and visuals are just incredible. It is truly a delight to watch from start to finish, I just cannotThe connection of humans and monsters in this movie is so out of this world, and that is truly proven with its fantastic story. The graphics and visuals are just incredible. It is truly a delight to watch from start to finish, I just cannot fault this wonderful movie. Because of these amazing features, this film is definitely one of Pixar's best..........",
            "review_date": "2012-05-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A wildly imaginative story and film that is executed  close to perfection. Like other pixar films Monsters inc will not just entertain the kids, but also their parents. Not pixar's best because of it's lack of pathos for it's characters, butA wildly imaginative story and film that is executed  close to perfection. Like other pixar films Monsters inc will not just entertain the kids, but also their parents. Not pixar's best because of it's lack of pathos for it's characters, but still a very good and imaginative film.",
            "review_date": "2012-06-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is not one of Pixar's absolute masterpieces but it's really funny and its originality definitely makes it a good film worth watching. Not to mention how awesome the voices are",
            "review_date": "2011-08-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters, Inc. has many reasons to be praised. It has cool characters, a creative job the monsters have to do, and, of course, it's really silly. The movie has outstanding animation with stunning fur design. The story can get pretty bland andMonsters, Inc. has many reasons to be praised. It has cool characters, a creative job the monsters have to do, and, of course, it's really silly. The movie has outstanding animation with stunning fur design. The story can get pretty bland and thin at times, but it was great otherwise. It has a fairly high \"encore\" value.",
            "review_date": "2011-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters, Inc. is one of the cutest and most original movies Disney Pixar has made. It is a nearly perfect family film that children can be entertained by and parents and adults can relate to. Goodman and Crystal are golden as the mainMonsters, Inc. is one of the cutest and most original movies Disney Pixar has made. It is a nearly perfect family film that children can be entertained by and parents and adults can relate to. Goodman and Crystal are golden as the main characters and Boo is just adorable. The only thing I can say I wish they did was give Sully and Mike even more screen time. This is a must watch if you enjoy these types of films.",
            "review_date": "2013-11-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I have seen it three times. This movie has both funny and moving scene. I really enjoyed it. If you want to  see heartwarming movie, I recommend it to you.",
            "review_date": "2012-02-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monster inc may not be as good as the other pixar's movies but is still done in a brillant way with funny jokes and a great moral for all while appealing to the our past about the monster in the closet.",
            "review_date": "2012-03-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Such an incredibly creative story, that is so exciting to watch. It was funny, sad, and heartwarming. Very imaginative and well executed. Pixar is the master's at what they do.",
            "review_date": "2012-09-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excellently animated and voice acted, \"Monsters Inc.\" is yet another reason why Pixar is the king daddy of noteworthy animated movie storytelling.",
            "review_date": "2012-11-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautiful, lovely, heart touching. There is a connection between Sullivan and Boo, a father- daughter coonection, nobody could think a monster could love and scared of a little human girl. You should watch this movies",
            "review_date": "2013-02-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters Inc. is a childhood favorite of mine and getting to experience it in 3D was just taking me back to my childhood and the greatness of Pixar.  When I was younger, I would always have a few movies to watch whenever I was in a bad moodMonsters Inc. is a childhood favorite of mine and getting to experience it in 3D was just taking me back to my childhood and the greatness of Pixar.  When I was younger, I would always have a few movies to watch whenever I was in a bad mood and this was one of them.  This movie has such great laughs and likable characters that you must have a heart made of stone not to love.  The animation is beautiful even to this day and you can't help but smile at the colors and appeal that this film gives off.  All the settings that you see were beautiful for its time and the characters look incredible for being so early in the stages of computer animation.  We all were scared of the darkness and monsters at one point in our lives, and if you weren't, well then you will still love this film.  Pixar has always had a knack for making lovable characters, and I think with this movie they show some of their most creative and fun characters of all.  The movie talks about friendship, and although many children's movies talk about that, I think this movie is one of the first to do it correctly.  There isn't much to talk about in a film that has been out for about 11 years, but I think we can all agree this is a classic piece of animation and one that everyone, both young and old, can love.",
            "review_date": "2013-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I fell in love with Monster,Inc. the first time I saw it as a kid. It was the movie I got most excited for to watch, fast forward eleven years and I still get excited for it. This monster world is so different from what we know yet soI fell in love with Monster,Inc. the first time I saw it as a kid. It was the movie I got most excited for to watch, fast forward eleven years and I still get excited for it. This monster world is so different from what we know yet so interesting and fun. Their source of power comes from the screams of children which seems so very strange but in the context of this film, makes perfect sense. I am never forced to accept anything the film throws at me, I choose to accept them because they make sense.\r Another important reason for why I love Monsters, Inc. is the characters. James P. Sullivan is our protagonist. He is very good at his job, known to many as the top Scarer in Monstropolis. Throughout this film, Sullivan's perspective on everything changes while his caring and comforting character grows stronger. His best friend and roommate, Mike Wazowski, is a funny and smart character who sometimes fails to see the obvious. He is full of energy and charisma, making it impossible for me to dislike him.\r Apart from the characters and the beautiful chemistry they share, the story is very well written and enjoyable. It had some hilarious laugh out loud moments, but also some very sad ones. The 3-D is okay, but seems non-existent at times.\rAnyone who hasn't seen this movie yet must do so, and those who have should go back and revisit it. It's the well written story, the colorful characters and the heart this film carries that makes it such a timeless classic.",
            "review_date": "2014-09-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "WHAT I LIKED: It's a quirky story that actually entertains on many levels - 'Monsters Inc' is fun, light hearted and well animated. Plus it's got some emotion and character development that makes you feel for the characters\rWHAT I DIDN'TWHAT I LIKED: It's a quirky story that actually entertains on many levels - 'Monsters Inc' is fun, light hearted and well animated. Plus it's got some emotion and character development that makes you feel for the characters\rWHAT I DIDN'T LIKE: It could be more fun, and the overall plot isn't as fleshed out as it could be\rVERDICT: Another memorable classic from Pixar - this is proper entertainment with few let downs",
            "review_date": "2016-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is on of my favorite movies from my childhood. Funny for both young and old!",
            "review_date": "2019-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yet another masterpiece from Pixar. Great, funny, exciting and emotional story that has a cute message that anyone can understand and get something from it.The characters are really charismatic, well developed and memorable, the villainsYet another masterpiece from Pixar. Great, funny, exciting and emotional story that has a cute message that anyone can understand and get something from it.The characters are really charismatic, well developed and memorable, the villains have clear goals and motivations and are intimidating and menacing to our main characters.The \"moster world\" has some cute, creative ideas and I like the concept of monsters being scared of human contact because they think they're toxic or something, it's hilarious and cute.The director behind this movie had a vision and a story to tell and I really liked it. Animated movies that have someone's vision are, most of the time, destined to be great and this is no exception.",
            "review_date": "2019-04-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not just one of the best Pixar movies I have ever seen, but also one of the besf monster movies I have ever seen",
            "review_date": "2019-04-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's either this or WALL-E as the best Pixar movie ever. It is hilarious, heartfelt, beautifully animated and two extremely likable lead characters. This was my absolute favorite movie growing up, and today, I still love this movie.",
            "review_date": "2020-03-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Another Pixars Masterpiece Really as a kid its great experience to be a part of such animated characters specially sulivan!",
            "review_date": "2019-10-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters, Inc. The movie's got a great plot which is pretty much about these scarers and it includes Sully (John Goodman) as the main scarer and Mike (Billy Crystal) as his best friend.After we get to know these two characters, we laterMonsters, Inc. The movie's got a great plot which is pretty much about these scarers and it includes Sully (John Goodman) as the main scarer and Mike (Billy Crystal) as his best friend.After we get to know these two characters, we later realise that a little girl gets into the monstropolis and they've got to get her back to her door before it's too late.Sully and Mike have got great chemistry with each other throughout this movie and those two are honestly hilarious characters throughout this movie.Also, you can tell that the pixar team have put lots of time and effort into making the animation look brilliantly good, especially the fur on certain characters like Sully.The characters are very memorable and they're not very forgettable at all, the main characters throughout this movie have a lot of heart and soul which I honestly love about these classic Pixar movies.Finally, all the voice actors suit who they play and they do a very good job on their dialogue and playing the role of their characters throughout this movie.The humour throughout this movie is honestly great, I actually forgot on how good the humour really was while watching this movie again.Also, I'm pretty sure right Henry J. Waternoose III is actually a nonce in this movie, he says this exact quote \"I'll kidnap a thousand children before I let this company die\".Overall, Monsters, Inc. Is honestly a brilliant Pixar movie. It's got a great plot, brilliant animation, memorable characters, great chemistry between Sully and Mike, all the voice actors do very well in their roles and it's got great humour. It's such a great classic Pixar movie and it's honestly brilliant, it's definitely worth the watch.",
            "review_date": "2020-08-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Funny moments, cutest scenes, an entertaining and original story, a beautiful world and memorable characters like Sully, Mike and Boo (so sweet) make this film funny, rewatchable and absolutely PRECIOUS.",
            "review_date": "2020-04-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It can't beat \"Toy Story 3\" or \"Finding Nemo\", but \"Monsters Inc.\" is another well-animated Pixar delight. The only problem with this film is that the funny dialogues are not as effective as other Pixar masterpieces, and it becomes irrelevantIt can't beat \"Toy Story 3\" or \"Finding Nemo\", but \"Monsters Inc.\" is another well-animated Pixar delight. The only problem with this film is that the funny dialogues are not as effective as other Pixar masterpieces, and it becomes irrelevant at times. Still, this is definitely a worthy film to check out.",
            "review_date": "2013-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A fantastic movie that has a touching story, fantastic characters, and a lot of humor, one of the best animated  movies for kids of all time, a must watch.",
            "review_date": "2011-03-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters, Inc. has basically captured what Pixar did. It's watchable and the best for you and your family! Although not able to express the feelings of the original Toy Story and 2, but it's still great!",
            "review_date": "2015-12-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThe animation and creature designs were remarkable. The movie was funny, cute, and touching. The voice overs from John Goodman, Billy Crystal, Bob Peterson, Steve Buscemi, Jennifer Tilly, James Coburn, and Mary Gibbs were stupendous. The writing and story were extremely well written and outstanding. The soundtrack was fantastic, I loved John Goodman and Billy Crystals duet If I Didn't Have You. Monsters Inc. is one of my top 10 favorite Pixar movies, one of my favorite animated movies, and one of my favorite movies of all and it gets a for sure A+.",
            "review_date": "2019-06-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Sully and Boo's relationship has some spark, but the supporting characters are unlikable (especially Mike) and  the plot is just weak. One of my least favorite Pixar movies.",
            "review_date": "2014-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very good though not great film from Pixar with great humour and characters but problematic plot.",
            "review_date": "2019-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am not a big fan of this movie. It tries to be adventurous but falls flat",
            "review_date": "2022-04-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Watched at least 30 times withthe kids and not once did I feel forced, fantastic.",
            "review_date": "2007-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When you stop and consider the subject matter, you realise how gifted Pixar actually are in being able to turn a story about monsters hiding in children's closets to scare them into a funny and warm children's animation. Imagine if Tim BurtonWhen you stop and consider the subject matter, you realise how gifted Pixar actually are in being able to turn a story about monsters hiding in children's closets to scare them into a funny and warm children's animation. Imagine if Tim Burton has got his hands onto the story!\r Monsters, Inc. looks great and tells a hugely original story, however I did find that the film largely relies heavily on slapstick jokes, for the younger audience, and lacks more subtle jokes for adult appreciation that some other children's animations do successfully integrate.\r John Goodman is perfectly cast as the gentle Scarer Sully while Billy Crystal, voicing Mike, does become frustratingly annoying as the irritatingly talkative one of the pair.",
            "review_date": "2013-07-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's odd to see that this movie is so underrated. In my opinion, this might just be Pixar's best and most creative movie to date. It's hilarious at times and heart breaking at other times. Every character is interesting and very well animatedIt's odd to see that this movie is so underrated. In my opinion, this might just be Pixar's best and most creative movie to date. It's hilarious at times and heart breaking at other times. Every character is interesting and very well animated given their unique appearances. Be sure to see this one, it's just awesome.",
            "review_date": "2013-06-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The all-time favorite movie of my childhood. I loved Billy Crystal and John Goodman's chemistry during the film, which made the story even better. The series of twists at the end will not disappoint it's viewers.",
            "review_date": "2013-03-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "These classic pixar movies take me back, such as Toy Story 1 and 2 and Finding Nemo and this one is no exception. Monster's Inc is truly one of the most fun of all the Pixar movies. It's not only a fun adventure into a new world beyond our's,These classic pixar movies take me back, such as Toy Story 1 and 2 and Finding Nemo and this one is no exception. Monster's Inc is truly one of the most fun of all the Pixar movies. It's not only a fun adventure into a new world beyond our's, but it also really captures heart (just like most Pixar movies). To me ,(just like the earlier Toy Story movies) this is a movie that i grew up watching almost every single day. It's a fun movie for both kids and adults. Plus, I can't wait for \"Monster's University\" coming out this summer. Overall, it's a classic Pixar movie that truly should not be taken lightly.",
            "review_date": "2013-04-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "With Monsters University coming out soon, I figured I'd do a quick review on the original.  Like most Pixar movies, it really is good for both kids and adults.  The plot is solid, although not as good as I've seen in other Pixar movies.  TheWith Monsters University coming out soon, I figured I'd do a quick review on the original.  Like most Pixar movies, it really is good for both kids and adults.  The plot is solid, although not as good as I've seen in other Pixar movies.  The characters are very likable, and there is some good humor thrown into the mix.",
            "review_date": "2013-06-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters Inc. is one of my favorite movies of all time, it is my childhood movie, that I grew up with, it is original and funny with lots of jokes and a great time for families and children, the plot is original and clever with lots of cleverMonsters Inc. is one of my favorite movies of all time, it is my childhood movie, that I grew up with, it is original and funny with lots of jokes and a great time for families and children, the plot is original and clever with lots of clever moments and touching scenes, Monsters Inc. is one of the greatest animated movies ever made!",
            "review_date": "2013-06-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Monsters Inc.\" brings a wonderful cast put in an inventive world that is very creative. The movie is built up on the main characters Mike and Sulley, who are incredibly likable. The animation is beautiful and really proves Pixar's animation\"Monsters Inc.\" brings a wonderful cast put in an inventive world that is very creative. The movie is built up on the main characters Mike and Sulley, who are incredibly likable. The animation is beautiful and really proves Pixar's animation is just superb. Its storytelling is wonderful, and is like watching as a kid again. With newer films coming out by the second, movies like \"Monsters Inc.\" remind you of the good old days.",
            "review_date": "2013-07-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nA charming story full of comedy and adventure. It is really enjoyable and my favourite animated movie ever. The two main characters are brilliant and unbeatable.",
            "review_date": "2013-07-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excellent and very funny movie full action that is about friendship. Some scenes made me laugh the end almost made me cry. A beautiful experience for anyone to watch.",
            "review_date": "2013-10-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pixar is so incredible for one reason: making stories with the same formula but each one with a very unique charactheristic. Monsters Inc. isn't different. Beyond this film is absolutely nostalgic and tasteful watching,even for adults.",
            "review_date": "2018-09-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A fun, intelligent film disguised as a kids movie, but really is a great movie to watch for all ages. The voice acting is great and the laughs are there, as well as some mild scares for the kids. It's genius.",
            "review_date": "2013-09-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What makes a film a children’s movie?  A children’s movie does not just contain the friendly voices behind animated characters in a made up world.  A movie for children is much more than just the goofy characters, the vibrant colors, and theWhat makes a film a children’s movie?  A children’s movie does not just contain the friendly voices behind animated characters in a made up world.  A movie for children is much more than just the goofy characters, the vibrant colors, and the silly skit.  The make or break of a children’s movie is one thing: the moral.\rIn the fall of 2001, together, Disney and Pixar came out with another classic movie of made up worlds and interesting creatures.  Director Pete Docter, with co-directors David Silverman and Lee Unkrich, created a movie for all the viewers to watch and take a small life lesson from.  The entertaining, comical, and adventurous movie is aimed at the younger children, but some life lesson can be taken from the movie for those of all ages.\rMonster’s Inc. is a movie unlike any the children have seen before.  The originality of this film lies in the plot of the skit, as a message to the children behind the lines.  Not only is Monster’s Inc. an animated film, with fuzzy characters, in a fantasy world, but also gives the young viewers a lesson to watch and take from the events of the movie.\rAlthough some may say that the “charm” of this film is from the vocal cast, they are only looking at the movie from an educated adults view.  The targeted viewers for Monster’s Inc. are the young children, given from the animations.\rBased on the common criteria of animations, vocals, colors, scenery, characters, etc., the movie alone rates very well.  The uniqueness of each character adds to the moral of the movie.  Sully, the big-hearted monster, with this “partner in crime” Mike, the small comical monster, make a great dynamic duo.  Together, they are the top ranking partnership in their “scream factory”, bringing in the most money by walking into different worlds through kid’s closets and scaring them to record their screams for the monster’s worlds power.\rThe movie seems to sound like a horror film, monsters crawling into kid’s rooms from their closet and scaring them.  Well that’s the twist with the moral.  The town’s biggest, scariest monster is actually the one with the biggest heart.  The monster Mike, looks scary with his one eye, but is actually extremely comical.\rWhen one “scare” goes wrong, and a human, Boo, is released into the monster’s world, she becomes acquainted with Sully and Mike.  At first the monsters are afraid of Boo, because it’s believed that they have diseases and will kill the monsters.  How ironic, that the little human girl is afraid of the big monsters?  After a night, they become friends but Sully and Mike must hide Boo from the rest of the community because having her holds the risk of being fired.\rBoo’s name comes from her as a human and living in the monsters world.  Ironically, she is not scared of the monsters, but the monsters are scared of her.  The uniqueness of this idea adds to the entertainment of the film, showing that not everything is how it seems.  In reality, Boo should be scared of the monsters, but she is not.\rThis ironic plot gives the movie a different outcome of the overall moral: don’t judge a book by the cover.  Just because something is believed to be scary, like monsters coming out of the closet, does not mean that they are scary in reality.  Just because Mike and Sully are monsters, and they look strange, different, and scary, does not mean that they actually are.  The main message given to the children teaches them that a monster, or anything else, is not actually what it appears to be.  Sully is big and scary, but in reality, he is not and he actually has the biggest heart.\rViewers of this movie should come out feeling as though they should reevaluate what they feared, or judged too quickly.  Not everything is how it should seem.  Ordinary children associate monsters as scary creatures to be afraid of and fear.  Monster’s Inc. takes this fear of monsters, and turns it around.  The movie doesn’t just explain monsters are not real, but takes it in a more creative direction by showing that just because monsters appear scary, does not mean that they are scary creatures.  The movie shows monsters as nice, caring, and funny creatures.\rMonster’s Inc. brought in a $34 Million into the box office, and scored a 3.8/5, according to the movie rating website, Rotten Tomatoes.  The average viewer takes into consideration, the skit, voice-overs, character’s appearance and every last detail.  Every viewer should, at least, walk away with a new view on monsters and a laugh.\rThe originality of this movie is unlike any other.  Monster’s Inc. uses what children fear most, monsters, and make them seem like harmful creatures.  This movie puts the imaginations of these young kids and has them look behind appearance and what they expected.  Monster’s Inc. expresses a new idea in their growing minds and opens up their thoughts to see that appearance is not always what it seems and to take a look on the insides, because you cannot judge without getting familiar with somet",
            "review_date": "2013-09-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A film that deserves no introduction, \"Monsters, Inc.\" is absolutely fantastic. A great story, some extremely fantastic characters, brilliant animation, humor, heart, charm, and some catchy tunes, \"Monsters, Inc.\" has it all. There's no twoA film that deserves no introduction, \"Monsters, Inc.\" is absolutely fantastic. A great story, some extremely fantastic characters, brilliant animation, humor, heart, charm, and some catchy tunes, \"Monsters, Inc.\" has it all. There's no two ways about it, \"Monsters, Inc.\" is an absolute blast that I couldn't recommend highly enough.",
            "review_date": "2016-10-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "monsters inc forme is the best film of disney pixar so far,it was the first movie i ever watch in the movies,and it was a so terrific film,it deserves a lot of prizes.",
            "review_date": "2013-10-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters Inc scares animation into reality.\rPixar once again exceeds expectations with an unbelievably well crafted story of two monsters and a little girl. The voices of John Goodman and Billy Crystal excel the films creativeness to life.",
            "review_date": "2013-11-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Would you be scare of a monster on a closet that terrorizes children while their asleep at night? Well, not anymore because these monsters just only work for their jobs to create electricity for the Monster world. The company their working atWould you be scare of a monster on a closet that terrorizes children while their asleep at night? Well, not anymore because these monsters just only work for their jobs to create electricity for the Monster world. The company their working at is called Monsters Inc.  that serves as a diversion of the film's realism to our world  while you're in the company you will meet joyful and humorous characters such as the loving and charming, James Sullivan  John Goodman  a talkative one-eyed green monster, Mike Wazowski  Billy Crystal  a selfish and easily distracted monster-like chameleon, Randall Boggs  Steve Buscemi  and many more.\r These characters shows enjoyable break time for children who watch this, maybe unforgettable, They work as like employees and the company their working at, even shows employee of the month. Now, for the main characters- Sully and Mike acts as best friends throughout their jobs, they show cleverness to entertain viewers in a way of humor. Especially, Roz, who appeals using her slow-paced talking and reminding the paper work assignment of Mike in a hilarious silent way.\r Monsters Inc. is really a great time if you are bored, it can entertained you because the characters are charismatic and joyful which makes the film feel alive. And they even not stop entertaining till the credits, they showed that the film is real and the characters worked as Hollywood actors and even mentioned \"No monsters were harmed in this film\", really a diversion of realism that can caught adult's attention to watch it. Even my aunt loves this movie even she's 27 years old.\r Monsters Inc. is a good film and look it even won Academy awards. It may not seem as fresh as the Toy Story film but outstanding packed humor and realism makes it sufficient enough to be added to PIxar's success in the animation universe.\r Rating: 9  10",
            "review_date": "2013-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "monsters inc is   better then monsters university . how ? because its a monsterific  animated film . A film by peter doctor   who created toy story and wall-e .",
            "review_date": "2014-03-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A fantastic concept for a children's movie, and it is rather concise and well thought out. Great comedy, great characters and a fairly solid script. Not the best Pixar movie, but pretty damn close!",
            "review_date": "2014-03-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Another pixar classic with a great cast holding up the more average screenplay. Everything felt 'by the books' in terms of execution, for me, the best sequence was towards the end flying through the rollarcoaster of doors. I seem to rememberAnother pixar classic with a great cast holding up the more average screenplay. Everything felt 'by the books' in terms of execution, for me, the best sequence was towards the end flying through the rollarcoaster of doors. I seem to remember being blown away by the visuals when it came out, but in 2020 even sulleys fur seems rudimentary by todays standard.",
            "review_date": "2020-03-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of my favourite movies ever and my most beloved movies when I was a kid. Mike is one of my favourite movie characters he is just so funny. There are so many memorable scenes in this movie from all the jokes and the door scenes in thisOne of my favourite movies ever and my most beloved movies when I was a kid. Mike is one of my favourite movie characters he is just so funny. There are so many memorable scenes in this movie from all the jokes and the door scenes in this movie were great. Amazing voice acting and story made this films one of my favourite and my favourite Pixar films to date.",
            "review_date": "2014-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's cute, creative, and a lot of fun. whilst it lacks some of the charm that Toy Story had, it still delivers a great story, memorable characters (Not to mention great designs on the monsters) and in my opinion has one of the greatest chaseIt's cute, creative, and a lot of fun. whilst it lacks some of the charm that Toy Story had, it still delivers a great story, memorable characters (Not to mention great designs on the monsters) and in my opinion has one of the greatest chase scenes I've ever seen. In conclusion Monsters, Inc may not be as good as Toy Story, but it's still enjoyable no matter what.",
            "review_date": "2014-10-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Academy Award-winning creators of \"Toy Story\" open the door to a frightfully funny world of monsters and mayhem and scare up lots of laughs in their new movie, Monsters, Inc.",
            "review_date": "2014-10-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This by far my favorite movie. The Story is original, the plot is engaging, and the voice acting is amazing. This is Pixar's finest work, and that's saying something considering classics such as Toy Story, Wall-E, and Up.",
            "review_date": "2015-01-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monster's Inc is one of Pixar's most wildly creative movies. I do have some knit picks but overall the movie is great. Mike, Sully, and Boo really are good main characters while support characters are also strong. Overall this movie is justMonster's Inc is one of Pixar's most wildly creative movies. I do have some knit picks but overall the movie is great. Mike, Sully, and Boo really are good main characters while support characters are also strong. Overall this movie is just great, It may get a little choppy going into the 2nd and 3rd act but they did fix themselves pretty quickly.",
            "review_date": "2018-06-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While it's far from my favorite Pixar film (that title belongs to 'Finding Nemo'), 'Monsters, Inc' is nonetheless a worthy film in the Pixar canon, directed by Pete Docter and starring Billy Crystal as Mike and John Goodman as Sulley, thisWhile it's far from my favorite Pixar film (that title belongs to 'Finding Nemo'), 'Monsters, Inc' is nonetheless a worthy film in the Pixar canon, directed by Pete Docter and starring Billy Crystal as Mike and John Goodman as Sulley, this film is better when you think about it.\r Mike and Sulley are two monsters (Mike is a green eye-ball with arms and legs and Sulley is a blue, hairy beast-like monster) who work in a corporation called \"Monsters Incorporated\" in which their job is to scare little kids from their world as kid's screams seem to generate energy for the monster world to have electricity. This is where I really have to praise the film, the writing is the film's strength, as we all remember being scared of monsters as little kids, but this film makes it out like it's their day jobs, and as a grown-up, this kind of character development is extremely clever.\r Craziness ensues as Sulley finds a little girl entering the monster world, every monster is scared of a child (another clever writing technique) as they fear to be touched by a child, the same as children being scared of these monsters.\r This is a fantastic debut for director Pete Docter, while it may not be as strong as the \"Toy Story\" films, it is better than one would expect when it comes down to the writing. It's funny and entertaining, and people of all ages will love it.",
            "review_date": "2016-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Remember when, as a child, you used to fear the monster under the bed or in the closet - how your parents would tell you to go to sleep, that it wasn't real? Monsters, Inc. confirms what every child really knows - the things that go bump inRemember when, as a child, you used to fear the monster under the bed or in the closet - how your parents would tell you to go to sleep, that it wasn't real? Monsters, Inc. confirms what every child really knows - the things that go bump in the night have more substance than silly grown ups recognize. Brought to the screen by the marriage of Disney and Pixar, Monsters, Inc. is the fourth computer animated motion picture offspring of this union. Like its older siblings, Toy Story, A Bug's Life, and Toy Story 2, Monsters, Inc. is a triumph of storytelling. Each new movie of this sort raises the bar a little more, and, while Monsters, Inc. doesn't eclipse Dreamworks' Shrek, it comes close.\r There's a world out there, somewhere under the rainbow, where monsters live. The sprawling city where they go about their daily lives is called Monstropolis - a vast, bustling place populated by all sorts of misshapen creatures who would cause the average human child to crawl under the covers. Energy in Monstropolis comes from an unusual source - the screams of children. Employees working for mega-corporation Monsters, Inc. go through gateways into the bedroom of human kids on Earth, frighten them into screaming, capture the energy from the screams, and convert it to electricity in Monstropolis. But, since children are becoming harder to scare, Monstropolis is facing a \"scream shortage.\"\r Everything that was true of the two Toy Story movies and A Bug's Life can be said about Monsters, Inc. - this is the kind of movie that works on multiple levels - as fast-moving, lively fun for children and as slyly written, visually impressive entertainment for adults. Monsters, Inc. is one of those rare family films that parents can enjoy (rather than endure) along with their kids. And childless individuals venturing into a theater showing this picture need not worry that they'll be viewed as deviants - Monsters, Inc. is capable of drawing audience members from across the age spectrum.\r The older the viewer, the more in-jokes they'll get. Most everyone will appreciate the \"Don't Stalk\" street sign and the tabloid newspaper called \"The Glob\". But it will take someone with a little more sophistication than the average 10-year old to get a chuckle out of the club named \"Harryhausen's\". From a visual standpoint, Monsters, Inc. is a small step forward from Toy Story 2 in its variety, richness of design, and background detail. I say a \"small step\" because Toy Story 2 was strong in all of these areas - Monsters, Inc. is just a little better.\r The great strength of the previous Pixar films, as well as Shrek, is that they offer a genuine emotional component that runs deeper than that of the run-of-the-mill animated feature. Such is the case here, where the attachment between burly Sulley and tiny Boo touches the heart. Part of it is because the animators have pulled out all the stops in making Boo shamelessly cute, but it does the job. The little girl brings out Sulley's soft side and smoothes some of Mike's rough edges. (As in Shrek, the animators opt to make the human characters somewhat \"unreal\", rather than going the Final Fantasy route and attempting to replicate actual human appearance.)\r Monsters, Inc. manages to last 90 minutes without a single song. Too often, music has become a crutch in animated productions (rather than the asset it can be when used appropriately). The fact that Monsters, Inc. doesn't need Randy Newman songs sprinkled throughout (although there is one during the end credits) is a testimony to the strength of the writing and the vocal characterizations. John Goodman and Billy Crystal make for an effective odd couple (in a break from tradition, they recorded their parts together, rather than separately). James Coburn is suitably dignified as Henry J. Waternoose, the owner of Monsters, Inc. Jennifer Tilly lends her helium-like voice to Celia, Mike's girlfriend; Steve Buscemi is hardly recognizable as the diabolical Randall; and Mary Gibbs' baby-talk makes Boo all the more adorable.\r Monsters, Inc. reaffirms the fact that a good animated film can be every bit as stimulating and emotionally satisfying a motion picture as a high quality live action endeavor. While this movie may threaten to be swamped by Harry Potter mania this fall, it definitely deserves to be seen. Young Mr. Potter may practice magic, but Monsters, Inc. is nothing short of enchanting.",
            "review_date": "2015-04-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mildly amusing and visually up to Pixar’s usual high standards in computer animation, “Monsters, Inc.” streaks to the height of its trajectory right out of the box and gradually loses altitude the rest of the way. Pivoting on the novel ideaMildly amusing and visually up to Pixar’s usual high standards in computer animation, “Monsters, Inc.” streaks to the height of its trajectory right out of the box and gradually loses altitude the rest of the way. Pivoting on the novel idea of monsters as genial working stiffs who scare kids just for a living, pic is clever and jokey in a vaudeville sort of way.\r Not measuring up to Pixar’s usual level, artistically or financially, is no disgrace; the outfit’s three previous features have grossed a combined $1.2 billion worldwide, and the Bay Area operation has quickly built up a reputation for consistency in the kid pic realm perhaps equaled only by Disney himself in the 1940s and ’50s. Still, “Monsters” is noticeably more relentless, frantic and noisy than its predecessors, as well as less charming and captivating. Nor does it come close to rivaling “Shrek” as the standout animated picture of the year.\r Pacey item centers on the team of Sulley and Mike, the top “scarer” and “scare assistant” in Monstropolis, a town dedicated to and powered by the screams its professional monsters provoke from Earth’s young children. A towering, horned, purple-and-green-haired bear of a creature, Sulley (voiced by John Goodman) is the proverbial softie inside a hulking exterior, and he’s encouraged, prodded and provoked at every step by the literal ball of energy that is Mike (Billy Crystal), a lime on legs distinguished by one giant eye and a motor mouth.\r Great fun is had laying out the basic contours of Monstropolis life: Beasts of every imaginable shape, size and configuration report daily to a giant factory to scare the bejesus out of kids everywhere, who are accessed via portable doors that magically provide direct entree to their bedrooms. Air tanks instantly capture the resultant screams, the energy source for the entire city.\r Workaday banter, friendly joshing, office romances and professional rivalries are effortlessly laid out, with Sulley’s status as every child’s worst nightmare challenged only by Randall (Steve Buscemi), a purple, multi-armed lizard who covets the popular Sulley’s rank and enjoys the extra advantage of being able to turn invisible at will. Other colorful characters imprinted instantly and engagingly on the mind include Mike slinky, snake-haired receptionist girlfriend Celia (Jennifer Tilly), the crotchety office overseer Roz (Bob Peterson) and the old-school, crablike big boss Waternoose (James Coburn).\r Dramatic gears are set in motion when a tiny girl named Boo (Mary Gibbs) slips through her door from the human world into Monstropolis. However fearsome they can be when called upon, monsters have a paralyzing fear of contact with homo sapiens, whom they’ve been taught are highly toxic if touched; an entire organization, the Child Detection Agency, staffed by emergency personnel in sealed yellow suits, exists for the sole reason of dealing with such intruders.\r Knowing what will happen to Boo if she’s caught, and quickly suspecting that physical contact with her isn’t so dangerous after all, Sulley and Mike protect the pig-tailed kid, a pre-verbal imp whose utterances sound like those of a Teletubbie on speed and who is, unfortunately, not the most endearing tyke ever put onscreen. In fact, she’s pretty obnoxious, which doesn’t help during the film’s longish midsection that’s mostly devoted to the monster team’s frantic efforts to hide Boo from everyone else. Much of the film, then, becomes a cat-and-mouse chase, with distractions offered by the smoothly malicious plottings of Randall and an amusing digression when the duo is momentarily banished to the Himalayas, where they are enthusiastically welcomed by a boisterous Abominable Snowman (John Ratzenberger).\r But as the chasing about continues, it becomes increasingly apparent how insufficiently the premise has been developed; the excellent basic ideas have yielded too few twists and dramatic junctures to keep the picture flying at the level at which it starts. The climactic roller-coaster ride pursuit — on tracks in the giant warehouse where the portals are kept — provides some sensory thrills, but the poignant note on which the story ends forcibly reminds the audience of the genuine emotional chords the film has previously failed to strike.\r Pixar’s vast army of design personnel has hardly been asleep at the wheel, as the monsters and settings overflow with imagination and wit. Even when the narrative becomes a bit tedious, there are visual and verbal references to keep adult auds amused; little kids may be scared at times, but in a reasonable, unthreatening way. In ways that viewers may now begin to be taking for granted, the computer animation here is still incredibly impressive.\r “Monsters” is preceded on prints by a jolly three-minute Pixar trifle, “For the Birds.”",
            "review_date": "2016-03-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "PIXAR was pounding again, this time with the story of monsters that work to scare children , but the monsters are really fancy but excellent film pure and argument",
            "review_date": "2015-07-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Another instant classic from Pixar. Billy Crystal gives a wonderful performance as Mike Wasowski and it has some really moving moments that will bring a tear to even the most cynical person's eye.  The story is intriguing and smart andAnother instant classic from Pixar. Billy Crystal gives a wonderful performance as Mike Wasowski and it has some really moving moments that will bring a tear to even the most cynical person's eye.  The story is intriguing and smart and Randall makes a good villain. Well done Pixar!",
            "review_date": "2015-09-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pixar must be due to slip up soon. Companies rarely rack up critical and commercial hits like Toy Story, A Bug's Life and the law-of-diminishing-returns-shattering Toy Story 2 without the cinema gods arranging some major disaster for them.Pixar must be due to slip up soon. Companies rarely rack up critical and commercial hits like Toy Story, A Bug's Life and the law-of-diminishing-returns-shattering Toy Story 2 without the cinema gods arranging some major disaster for them. There just has to be a ticking bomb nestled in their upcoming schedule somewhere. This ain't it, though. Monsters, Inc isn't just good - - it's fantastic.\r Sharp, clever, frighteningly funny and 24-carat feelgood, this is the story of the boogeymen who creep out of the cupboard every night to scare rugrats silly. A kiddiwink nightmare come true? Umm, not really, because these monsters don't really mean any harm - - they're just doing their job...\r Every day, green one-eyed Mike (voiced by Billy Crystal) and purple-and-blue-spotted furball Sulley (John Candy) go to work at scare factory Monsters, Inc. Sulley crosses over from Monstropolis into the world of humans and puts the frighteners on some poor little boy or girl. Meanwhile Mike bottles their screams and uses them to provide power for the monster world's every need. It's nothing personal - - it's just clock-punching employment. Or it is until a little girl they christen Boo (Mary Gibbs) manages to cross over to Mike and Sulley's dimension.\r If the monster world authorities find her, the boys are going to be out of a job and Boo's going to be detoxed out of existence since monsters are convinced that kids are poisonous. Will Mike and Sulley get Boo safely back to her own world? Can Monstropolis survive without the power of kiddie screams? What is evil Monsters, Inc employee Randall (Steve Buscemi) up to? And is Mike ever going to successfully date medusa-haired Monsters Inc receptionist Celia (Jennifer Tilly)?\r Flawlessly animated, Monsters, Inc glows with loving care and attention, but talking about the quality of the CG work is akin to watching The Godfather and rambling on about how all those flickering single images successfully create the illusion of movement. It's Pixar's storytelling and not the technology that makes their films fly.\r Goodman's deep rumbling tones turn Sulley into the most huggable of huge, furry critters - - his slow-burn realisation that Boo may not be the lethal killing machine he's always believed human kids to be is simply joyous. And while Sulley's the heart, Crystal's furiously ad-libbing Mike is the lippy, fast-talking brain, pumping out one-liners to compliment the sight gags and slapstick. It's the classic buddy movie combo of big 'n' loveable and small 'n' sarky.\r But Monsters, Inc is much more than just a framework to hang jokes on. The humour works as part of a thumpingly good narrative that finds time to slot in a truly creepy villain, some serious tension and two belting action sequences. Not to mention a big soppy ending that sends you out into the night with the warmest of hearts.\r It's not quite up to Toy Story 2, but it doesn't fall that far short. Monsters, Inc stakes an early claim to this year's family entertainment crown - - it'll take something truly spectacular to beat it.",
            "review_date": "2016-01-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pixar must be due to slip up soon. Companies rarely rack up critical and commercial hits like Toy Story, A Bug's Life and the law-of-diminishing-returns-shattering Toy Story 2 without the cinema gods arranging some major disaster for them.Pixar must be due to slip up soon. Companies rarely rack up critical and commercial hits like Toy Story, A Bug's Life and the law-of-diminishing-returns-shattering Toy Story 2 without the cinema gods arranging some major disaster for them. There just has to be a ticking bomb nestled in their upcoming schedule somewhere. This ain't it, though. Monsters, Inc isn't just good - - it's fantastic.\r Sharp, clever, frighteningly funny and 24-carat feelgood, this is the story of the boogeymen who creep out of the cupboard every night to scare rugrats silly. A kiddiwink nightmare come true? Umm, not really, because these monsters don't really mean any harm - - they're just doing their job...\r Every day, green one-eyed Mike (voiced by Billy Crystal) and purple-and-blue-spotted furball Sulley (John Candy) go to work at scare factory Monsters, Inc. Sulley crosses over from Monstropolis into the world of humans and puts the frighteners on some poor little boy or girl. Meanwhile Mike bottles their screams and uses them to provide power for the monster world's every need. It's nothing personal - - it's just clock-punching employment. Or it is until a little girl they christen Boo (Mary Gibbs) manages to cross over to Mike and Sulley's dimension.\r If the monster world authorities find her, the boys are going to be out of a job and Boo's going to be detoxed out of existence since monsters are convinced that kids are poisonous. Will Mike and Sulley get Boo safely back to her own world? Can Monstropolis survive without the power of kiddie screams? What is evil Monsters, Inc employee Randall (Steve Buscemi) up to? And is Mike ever going to successfully date medusa-haired Monsters Inc receptionist Celia (Jennifer Tilly)?\r Flawlessly animated, Monsters, Inc glows with loving care and attention, but talking about the quality of the CG work is akin to watching The Godfather and rambling on about how all those flickering single images successfully create the illusion of movement. It's Pixar's storytelling and not the technology that makes their films fly.\r Goodman's deep rumbling tones turn Sulley into the most huggable of huge, furry critters - - his slow-burn realisation that Boo may not be the lethal killing machine he's always believed human kids to be is simply joyous. And while Sulley's the heart, Crystal's furiously ad-libbing Mike is the lippy, fast-talking brain, pumping out one-liners to compliment the sight gags and slapstick. It's the classic buddy movie combo of big 'n' loveable and small 'n' sarky.\r But Monsters, Inc is much more than just a framework to hang jokes on. The humour works as part of a thumpingly good narrative that finds time to slot in a truly creepy villain, some serious tension and two belting action sequences. Not to mention a big soppy ending that sends you out into the night with the warmest of hearts.\r It's not quite up to Toy Story 2, but it doesn't fall that far short. Monsters, Inc stakes an early claim to this year's family entertainment crown - - it'll take something truly spectacular to beat it.",
            "review_date": "2016-01-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Who ever thought an idea like this could work. Well, pixar did as it managed to make a fun, touching, and engaging story. The strong point is the relationship between sully and boo.",
            "review_date": "2016-08-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters inc uses inventive and interesting story-telling for keep the audience paged to the film, with colored and inventive characters. It also has a good beginning and a great end, as it should. Pete Docter gives us another great animatedMonsters inc uses inventive and interesting story-telling for keep the audience paged to the film, with colored and inventive characters. It also has a good beginning and a great end, as it should. Pete Docter gives us another great animated film that really deserves take part of Pixar universe and, of course, the Oscar.",
            "review_date": "2016-04-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beaming with humor, wit, and usual Pixar charm, Monsters, Inc. may not be the most brilliant when it comes to story, but Director Pete Doctor and crew make up for its flaws with beautiful animation and wonderful characters.",
            "review_date": "2016-08-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Makes sense throughout the entire synopsis. Monsters, Inc. It believes what every character does to humans and what they do back to them but doesn't capture that good humor.",
            "review_date": "2016-11-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Pixar magic is strong in this movie. The characters are great and were well thought out. But don't forget the story, one of Pixar's best. It is a must watch.",
            "review_date": "2017-05-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Another Pixar ClassicMonsters Inc is hilarious, has great casting, beautiful animation, a unique world, and has many creative ideas as well as a look into how corporations work.",
            "review_date": "2019-06-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A very fun movie. Great animation, great voice acting and a great story to go with it. It is yet another masterpiece by Pixar and really separates itself from other animated films.",
            "review_date": "2017-07-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "There are many people who think that this movie was one of the best produced by Pixar. Well, my personal taste differs a little, there are some other films from this studio that I prefer and that I like more (Inside Out, Up and Wall-E areThere are many people who think that this movie was one of the best produced by Pixar. Well, my personal taste differs a little, there are some other films from this studio that I prefer and that I like more (Inside Out, Up and Wall-E are some of them), but that is a matter of personal taste and not properly a matter of merit. It's a great movie, worth watching as a family.The script couldn't be better: the film takes us to a world parallel to ours, where the monsters of our childhood nightmares live. They have found a way to get in and out of our world through a machine, and harness the energy of frightened children's screams to generate electricity for their world. Sullivan and Mike are two monsters who share a good friendship and work together on this task, with Sullivan holding the record for scariest monster. However, things get out of hand when a human child ends up entering the world of monsters (they think children are toxic, and they poison everything they touch) and become very fond of the two friends, who now need to get rid of her.The film has a very good cinematography, full of color, light and movement. The digital animation is excellent, creative, original (the details are the key to understanding the originality of the whole set) and very well done. As is the hallmark of this studio, very good actors were chosen to voice the various characters, starting with John Goodman and Billy Crystal. I also liked the participation of Steve Buscemi, who gave life to the villain, Randall, and Jennifer Tilly also deserves praise for her work here. The soundtrack, honestly, didn't add that much to the film, in my opinion, with the exception of a few occasional jazz tones.",
            "review_date": "2022-03-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters Inc is one of the best Pixar films the great animation combined by the great performances of John Goodman and Billy Crystal as Mike Wazowski and Sully respectively and the film has other great talents Steve Buscemi as Randall andMonsters Inc is one of the best Pixar films the great animation combined by the great performances of John Goodman and Billy Crystal as Mike Wazowski and Sully respectively and the film has other great talents Steve Buscemi as Randall and many others, wrapped around the film's imaginitive plot. It makes Monsters Inc. a must watch",
            "review_date": "2018-09-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best computer animated film of them all, and the most adultUntil now I couldn't bring myself to believe that computer animation was the equal of either stop motion animation or hand-drawn animation. All computer animated films looked aThe best computer animated film of them all, and the most adultUntil now I couldn't bring myself to believe that computer animation was the equal of either stop motion animation or hand-drawn animation. All computer animated films looked a little (usually more than a little) too sterile, many were animated poorly (\"Antz\", \"Shrek\", \"Final Fantasy\"), and even the single unqualified success (\"Toy Story 2\") provided little evidence that a computer animated film COULD reach the heights other kinds of animation could. \"Toy Story 2\" had flawless character animation, but nothing as inspired as the best in \"Tarzan\" (released the same year, although I could have chosen almost any other Disney cartoon to make my point); effective art direction, but nothing to match \"Fantasia\" or \"The Nightmare Before Christmas\". And I thought that \"Toy Story 2\" was as good as the art was ever going to get.I was wrong. This is far better. And what's more, there's no sense whatever that the script (an unusually rich and uninhibited script) is bumping up against the limits of what the medium will allow. It's now been proven that computer animation CAN be just as good as any other kind. Whether it will be allowed to be in future is another question, but for now, I'm hopeful. What we have here is computer animation's first ENTIRELY unalloyed artistic delight, with every character gracefully and characteristically animated, every virtual set just right and pleasing to look at, and an eye-tickling mastery of colour, light and shade that I thought would forever elude CGI artists.It's not fair to judge anything good as \"Monsters, Inc.\" as though it were a children's movie, but I can't resist comparing it with \"Shrek\" - which emphatically IS a children's movie. \"Monsters, inc.\" is admittedly ABOUT children, in a sort of a way. The inhabitants of Monstropolis rely on children's screams for their energy, and the central story is kicked off when one of the monsters accidentally brings a small child (which he calls \"Boo\") into the city. But we never see things from her point of view. We see things from the point of view of the monsters, who are all adults - and who, like most adults, see children as frightening, almost incomprehensible members of another species. And they ARE. To be sure, Wazowski comes to feel strong affection for Boo, but she never becomes more than a humanoid pet (which is not to demean the relationship). This is a story about adults looking at childhood from the outside.\"Shrek\", of course, is a children's movie through and through. Its attention span is short, it has an unthinking mean streak, and children will have a whale of a time watching the central characters (the bigger they are, the more fun it is) act childishly and make poo-poo jokes. \"Monsters, Inc.\" has too much genuine wit, characters too rich, a world with too much depth, and a story at once too coherent and too complicated, to be PRIMARILY a film for children. This is not to say children won't like it. Maybe they will. (Who can say?) Here's the bonus: if they DO like it, it will (unlike \"Shrek\") actually have a beneficial effect. It will make them less frightened of the dark.",
            "review_date": "2020-12-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It blends family adventure, comedy and emotion together brilliantly, making \"Monsters Inc.\" another great addition into the Pixar universe.",
            "review_date": "2018-10-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was actually rather good and interesting if you ask me. I enjoyed the film quite a bit. The only bad thing is that it can get rather boring towards the middle of the film but it ends perfectly.",
            "review_date": "2019-01-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Monsters inc is a charming, delightful and creative film from Pixar that never fails to put a smile on my face. The characters are so likeable and the chemistry between Billy Crystal and John Goodman is amazing. The emotional moments betweenMonsters inc is a charming, delightful and creative film from Pixar that never fails to put a smile on my face. The characters are so likeable and the chemistry between Billy Crystal and John Goodman is amazing. The emotional moments between Boo and Sully work really well and the ending is just perfection.",
            "review_date": "2021-07-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nWhile it's not perfect, Monsters Inc. is a amazingly original, emotional, and funny Pixar movies. The real highlight is the ending, where Sully meets Boo again, its an extremely emotional moment, and a brilliant movie. The middle does lag a bit, but the remarkable premise, along with wonderful voice-acting make it one of Pixar's best. PS Damn Shrek, this should have won the animated feature award at the oscars.",
            "review_date": "2020-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nMy first ever exposure to Monsters, Inc. was when we had gone to McDonald's and I got a Mike Wazowski toy. I was really scared of it, and my sister used to often scare me with it. Little did I know that Mike is supposed to be the comic relief of the movie. Later on I saw the trailer, and eventually the whole movie. And now I can say with a guarantee that Monsters Inc is one of the better Disney movies. Sure there are some things I didn't like (which I will talk about later) but other than those things, this is absolutely perfect.One thing I really like about Pixar is that they always take one thing we like from our lives and then expand it into a full blown story. You play with toys? There's Toy Story. You like fishes and the ocean? There's Finding Nemo. You like cars? There's...well, Cars. So similarly over here we were all afraid of monsters coming into our rooms when we were sleeping alone as kids, and that's what this movie is based on. Unlike the conventional monsters who want to kill us, these monsters are working for a power company who just use children's screams for powering up their world.The story revolves around Sullivan and his best friend Mike Wazowski, who work at Monsters, Inc. Sully is a professional scarer while Mike collects the screams from the children. However, there is one rule that the monsters must abide by - children should not learn about their world otherwise they will no longer be scared and the monster world will run out of energy. Things go down very badly when Mike and Sully find out that Sully accidentally brought a little girl named Boo back to their world. Meanwhile Randall, the second best scarer and Sully's rival, is making a scream extractor which will help him extract the most screams and make him the best employee.The movie is twenty years old and still the world shown here is very dynamic even by today's standards. The third act where Sully, Mike, Boo and Randall are jumping from one door to another was very cool. The animation is also very good, especially the fact that every single hair on Sully's body is distinguishable, and all the pores on Randall's body can be seen. The comic timing is also great, like the part where Randall says, \"Say hello to my scream extractor!\" and Mike immediately says \"Hello.\". And also the part where Sully thinks Boo got crushed so he faints just as the emotional music starts playing.Now like I said, there are a couple of things I didn't like in this movie, which is what stopped me from giving it a perfect score. First of all I really liked Randall. He was my favourite character in the whole movie. He looks cool, his superpowers are admirable and he's stronger than he looks. But he still loses to humans. First with Boo, who is literally a child who can't even speak. And then by grown humans who beat him with a broom in the end. It would have been better if he got stuck in the middle of nowhere like he made Sully and Mike do so. And the second thing is the part where they are in Nepal. That was boring to say the least.Monsters, Inc. is one of those movies that can be enjoyed by both children and adults. It is very rare for a Disney movie to be that way nowadays, so it can be revisited back even today. Like I said, its animation has aged very well, which is why it is so much fun to watch it without feeling something is off. And it has a sequel too, something it took me too long to learn about. I really liked it compared to most movies Disney has been making nowadays.",
            "review_date": "2021-08-20",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 126
}