{
  "title": "The Royal Tenenbaums",
  "rating": 7.9,
  "release_date": "2001-12-14",
  "summary": "Royal Tenenbaum (Gene Hackman) and his wife, Etheline (Anjelica Huston), had three children—Chas, Margot, and Richie—and then they separated. Chas (Ben Stiller) started buying real estate in his early teens and seemed to have an almost preternatural understanding of international finance. Margot (Gwyneth Paltrow) was a playwright andRoyal Tenenbaum (Gene Hackman) and his wife, Etheline (Anjelica Huston), had three children—Chas, Margot, and Richie—and then they separated. Chas (Ben Stiller) started buying real estate in his early teens and seemed to have an almost preternatural understanding of international finance. Margot (Gwyneth Paltrow) was a playwright and received a Braverman Grant of $50,000 in the ninth grade. Richie (Luke Wilson) was a junior champion tennis player and won the U.S. Nationals three years in a row. Virtually all memory of the brilliance of the young Tenenbaums was subsequently erased by two decades of betrayal, failure, and disaster. [Touchstone Pictures]]… Expand",
  "critic_reviews": [
    "You'll laugh, you'll cry -- the year's best movie.",
    "Anderson offers no phony uplift for the Tenenbaums or for audiences. But he does know how to take a sad song and make it better. In these troubled times, that's a gift.",
    "In a film that verges on greatness, it is a sign of terrific faith, as well as of Anderson's promise as a director, that when one of the characters in The Royal Tenenbaums wears hospital pajamas after a detour into grief, the words over his heart read \"recovery area.\"",
    "May not be the movie of the year, but it is a seasonal gift to us all. Sweet and funny, doggedly oddball if bordering precious.",
    "A very funny and painfully relevant two hours of entertainment.",
    "Along with his writing partner, actor Owen Wilson, who also plays (hilariously) a supporting role in the film, Anderson reveals himself to be a highly original comic talent, impressive both for his strongly controlled deadpan style and for providing a sense of emotional heft lacking in most mainstream film comedies.",
    "A big generational saga that woos the audience with its humor, spirit, style, and ability. Genius here is an evolutionary thing.",
    "The performances are all terrific, but Gene Hackman is close to a career best as the family patriarch Royal, the most useless man you can't help loving.",
    "More flat-out funny than \"Rushmore,\" but in neither film is the humor joke-based. What you're laughing at is the behavior of characters who are so fixed in their idiosyncratic worldviews that they can't help but careen into each other like out-of-control bumper cars.",
    "A devastatingly funny portrait of a wildly dysfunctional clan, Wes Anderson's The Royal Tenenbaums is a movie about how people never really mature in ways that matter.",
    "Exists on a knife edge between comedy and sadness. There are big laughs, and then quiet moments when we're touched.",
    "It's a B+, not an A. This would be enough for most filmmakers. But Anderson must contend with a higher standard. It's his fault for being original.",
    "Far and away the funniest comedy in town.",
    "Underachieves in its own way by trapping an expansive, probing story in a brittle, highly artificial style that constricts character and emotional development.",
    "Hackman gives the con-man lines a simple, straight-ahead urgency that makes the man first hilarious and then, as the pleasures of human company are withdrawn and his resentment begins to bubble up, inexplicably touching. This is a great performance.",
    "This is not a movie that wraps up its story in a tidy bow, but it's a lot more fun than most of the ones that do.",
    "It makes for chuckling entertainment and it's fun to watch as it's happening. But its New York characters are not a bit believable, there's no real bite to the humor, and the film never adds up to be more than the sum of its parts.",
    "Anderson's cinematic style gets more adventurous from one movie to the next, and he begins this story with bursts of originality that leave his respected \"Rushmore\" far behind.",
    "Might have been about the rise and fall of a family of gifted children. That would have been the typical way to approach the story. \r\nInstead, it's something rare -- a movie about people who have already fallen, whose best days are behind them.",
    "At once endearing and unbearably show-offy, it seems to be the product of a sensibility formed by age-inappropriate reading.",
    "One expects more from writer-director Wes Anderson (and his co-scribbler, Owen Wilson) than such frivolous fun that bears no lingering effect.",
    "Over the course of 108 minutes, The Royal Tenenbaums drops downward on the humor scale from hilarious to funny to quirky to pretentiously bizarre to chaotic.",
    "The film grows on you, but more substance and less calculated quirks would have been a royal treat.",
    "Anderson is something of a prodigy himself, and he's riddled with talent, but he hasn't figured out how to be askew and heartfelt at the same time. When he does, he'll probably make the movie The Royal Tenenbaums was meant to be, and it'll be a sight to see.",
    "Precociously glib and never less than engaging.",
    "Director Wes Anderson, who also co-wrote the \"Royal\" script with actor Owen Wilson, unquestionably has one of America's most distinctive filmmaking sensibilities, but that is part of the problem. As my mother used to say, too good is no good.",
    "Anderson's other hallmarks here are brilliant gags that deflate in the execution, potentially interesting characters that end up so flat they feel as if they'd been cut out of paper, a plot that's all setup and no story."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "The Whole thing about the dysfunctional family, that reunites for the sake of a sick family member (Royal Tenenbaun, played by Gene Hackman, which by the way he was fantastic on the movie), i enjoyed watching it, the final scene I wasn'tThe Whole thing about the dysfunctional family, that reunites for the sake of a sick family member (Royal Tenenbaun, played by Gene Hackman, which by the way he was fantastic on the movie), i enjoyed watching it, the final scene I wasn't expecting for that, so that made me like it even more, i do think it was a good movie, with a great cast.",
      "review_date": "2011-08-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the most down-rated movie ever! Great director, fu**ing good actor and a perfect story. A superb family, who cant evolve because of their own fear.",
      "review_date": "2012-08-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Royal Tenenbaums contains all the usual things Wes Anderson puts in his movies. Quirky effective humor and jokes, unique interesting characters, an unpredictable plot and that bizarre visual flair. The fact that I can always tell when I'mThe Royal Tenenbaums contains all the usual things Wes Anderson puts in his movies. Quirky effective humor and jokes, unique interesting characters, an unpredictable plot and that bizarre visual flair. The fact that I can always tell when I'm watching a Wes Anderson movie just by looking at one frame draws me to his work. The Royal Tenenbaums is one of his best, ever second is enjoyable and I cannot even stress how ridiculously entertaining the last 20 minutes is. One of my favorite comedies, worth watching as long as you understand Anderson's type of humor.",
      "review_date": "2014-02-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Rarely do the elements of detaching quirkiness and heartbreaking drama combine to create such an irresistible product. Of course at the helm is Wes Andersen whose (borderline OCD) meticulous craft completely pays off for the enjoyment of the viewer.",
      "review_date": "2010-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Royal Tenenbaums is an extremely funny and devastatingly sad movie from Wes Anderson. With superb acting, exquisite timing and an unbelievably brilliant script, The Royal Tenebaums is perfect in every way. If you want to cry yourself toThe Royal Tenenbaums is an extremely funny and devastatingly sad movie from Wes Anderson. With superb acting, exquisite timing and an unbelievably brilliant script, The Royal Tenebaums is perfect in every way. If you want to cry yourself to sleep, I have five words for you; \"I've had a rough year.\"",
      "review_date": "2012-07-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "At first, I wasn't quite sure what to make of The Royal Tenenbaums, but as you gradually get to know the titular weird and wonderful dysfunctional clan, and experience the same trials and tribulations that they do, you truly grow to care forAt first, I wasn't quite sure what to make of The Royal Tenenbaums, but as you gradually get to know the titular weird and wonderful dysfunctional clan, and experience the same trials and tribulations that they do, you truly grow to care for them. As always with Wes Anderson's films it's beautifully written, and simple but striking in its visual style. A brilliantly talented ensemble cast perform for your pleasure, and Gene Hackman is simply mesmerising as the complex Tenenbaum patriarch who is far more than another distant father - he's a real puzzle-box of a character whose layers are gradually pealed back as the narrative progresses. Gwyneth Paltrow and Luke Wilson also stand out as the severely depressed adopted daughter and the youngest son who has drifted aimlessly through life since his career as a professional tennis player floundered. The title cards used between narrative segments of the film, presented like chapters of a novel are a little irritating, and tend to break up the flow of the story rather than link this tale to storytelling tropes of classic literature, as was likely the intention. This is a minor gripe though, and The Royal Tenenbaums remains an engrossing, darkly comic tale of short-lived successes and persistent failures, love and hate, joy and depression, and above all else, family.",
      "review_date": "2012-08-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm actually surprised by the user reviews of this film. This film hits all the right spots. Along with Rushmore, Wes Anderson has already created the new foundation for future comedy-dramas in just his first few films. I'm willing to debateI'm actually surprised by the user reviews of this film. This film hits all the right spots. Along with Rushmore, Wes Anderson has already created the new foundation for future comedy-dramas in just his first few films. I'm willing to debate that what Anderson has done for the \"dramedy\" is similar to what Martin Scorsese did for the crime drama. In tone and pace (not to mention their use of camera techniques), their work will be copied for decades to come. The Royal Tenenbaums is hilarious, heartbreaking, and if you're paying attention, filled with emotion of all corners. Great ensemble cast, great narration by Alec Baldwin, and for those who call it off-beat, I question your rhythm. Gene Hackman delivers his finest performance to date. The best film of 2001, possibly the decade, and my favorite film of all time.",
      "review_date": "2011-06-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have found that this movie polarizes people into two camps. You are either going to hate it or love it. I personally think that it is one of the greatest movies ever made, but I like everything that Wes Anderson has directed. It has one ofI have found that this movie polarizes people into two camps. You are either going to hate it or love it. I personally think that it is one of the greatest movies ever made, but I like everything that Wes Anderson has directed. It has one of the most amazing casts that has ever been assembled, and every actor shines in his/her own unique way in this movie. If you are looking for a laugh out loud comedy that is filled to the brim with sex, farts, and genitals than this is definitely not the movie for you. If, however, you are looking for a subtly funny, and deeply moving movie that has the ability to stay with you for years to come than I recommend this movie to you.Side note- I don't know what it is exactly, but I am totally in love with Margot Tenenbaum. Maybe it is her wooden ring finger. Perhaps it is her black eyeliner. Maybe it is because she never really smiles. It's weird. She is so not my type, but I just want to . . .Anyways. Check this one out.",
      "review_date": "2012-02-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wes Anderson is truly on display here. The quirkiness of this family certainly shines through with great acting from the whole cast. Good, fun comedy here without a doubt. But, if you're going to watch this, be ready for it to be weird.",
      "review_date": "2013-07-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Royal Tennenbaums is one of the most underrated movies ever made. It is a masterpiece by writer and director Wes Anderson, and arguably his best film. The trials and tribulations of the Tennenbaum family will have you rolling withThe Royal Tennenbaums is one of the most underrated movies ever made. It is a masterpiece by writer and director Wes Anderson, and arguably his best film. The trials and tribulations of the Tennenbaum family will have you rolling with laughter one moment and weeping with despair at the next. Somehow this movie seamlessly blends the highest comedy and lowest tragedy. I watch this movie at least once a year. This is a timeless classic about family and the human condition.",
      "review_date": "2017-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very funny and touching. It is funnier than sex comedies which have only 6-7 big laughs. This has very consistent small but smart laughs.",
      "review_date": "2007-02-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you want a movie filled with cheap laughs,silly slapstick humor, or fart jokes, don't watch this movie! It's a sophisticated comedy/drama that makes me teary even after watching it dozens of times. The acting is spot on, the If you want a movie filled with cheap laughs,silly slapstick humor, or fart jokes, don't watch this movie! It's a sophisticated comedy/drama that makes me teary even after watching it dozens of times. The acting is spot on, the soundtrack is superb, and Wes Anderson's directing has never been so flawless. This is my favorite movie and it deserves to be worshiped.",
      "review_date": "2008-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is my favourite Wes Anderson movie, the story telling, cast and everything come together perfectly.  Gene Hackman gives one of his best performances and I can't think of anyone else in the cast who didn't also perform perfectly.  Funny,This is my favourite Wes Anderson movie, the story telling, cast and everything come together perfectly.  Gene Hackman gives one of his best performances and I can't think of anyone else in the cast who didn't also perform perfectly.  Funny, stylish and entertaining.",
      "review_date": "2014-09-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The definitive Wes Anderson masterpiece. The Royal Tenenbaums is one of the quirkiest films of all-time. And yes, quirky does often attribute to quality filmmaking--especially in the hands of Wes Anderson.",
      "review_date": "2014-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An indescribably brilliant piece of cinematic storytelling and the first true \"Wes Anderson\" movie to come out of Wes Anderson. \"The Royal Tenenbaums\" is high above the audience's heads, but still somehow down to the proverbial earth. It'sAn indescribably brilliant piece of cinematic storytelling and the first true \"Wes Anderson\" movie to come out of Wes Anderson. \"The Royal Tenenbaums\" is high above the audience's heads, but still somehow down to the proverbial earth. It's absolutely hilarious in delivering its quirky eccentricities, but also truly heartbreaking when it pauses for its deep moments of reflection. It's both frustrating and endearing, childish and refined, droll and flavorful, ribald and prudish, etc. - all at once. In the film, one of the superbly well-realized characters aptly states, \"I always wanted to be a Tenenbaum.\" And, simply put, after sitting through the entirety of this piece, so do I.",
      "review_date": "2016-05-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The characters of this movie and the relationships between these characters are what makes this movie one of the best movies ever made. Wes Anderson is one of my favorite directors. His movies are unlike any others. His movies have countlessThe characters of this movie and the relationships between these characters are what makes this movie one of the best movies ever made. Wes Anderson is one of my favorite directors. His movies are unlike any others. His movies have countless good qualities, but what stands out in this movie are the characters and the complex relationships between these characters. The characters pop off the screen and into real life like magic in that special kind of way that makes me love movies. There are countless intricate and amazing relationships in this movie like Margot and Richie's who are in love but related (not by blood). Or even like the small but hilarious relationship between Raleigh st Clair and Dudley who has a rare learning disability. However my favorite is the relationship between Chas and Royal, that royal has ruined and is able to mend it through time, and saving the thing Chas loves most in the world (his two boys). Royal is able to mend this relationship and in the end chas loves him again and this is beautiful. Royal accomplished what he wanted to do all along, and make it right and earn the love of his children again.",
      "review_date": "2018-04-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Truly Wes Anderson's masterpiece. A family drama in the same vein as The Magnificent Ambersons. This is a must-see-film for any lover of cinema. A real treat!",
      "review_date": "2018-10-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The characters go from fascinating to funny to complete dead weight much like the movie itself. It had moments of great potential, but they are eventually sucked up with a lot of boring weird scenes.",
      "review_date": "2013-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "With an excellent cast and a very entertaining \"style\" this movie is lots of fun to watch. I've watched it multiple times and I could watch many scenes in it over and over again. This movie will talk to a lot of young people but at the sameWith an excellent cast and a very entertaining \"style\" this movie is lots of fun to watch. I've watched it multiple times and I could watch many scenes in it over and over again. This movie will talk to a lot of young people but at the same time it's not for everyone. That should not be hard to figure out though.",
      "review_date": "2010-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's not a bad movie.  It's pleasant enough, but so much of it is just completely flat.  There are a couple funny moments, and a couple emotionally affecting ones, but the cast is wasted.  I didn't mind the characters so much as the wayIt's not a bad movie.  It's pleasant enough, but so much of it is just completely flat.  There are a couple funny moments, and a couple emotionally affecting ones, but the cast is wasted.  I didn't mind the characters so much as the way they're used.  Wilson's and Stiller's characters are funny, but they almost never get a chance to steal the show.  I also had a problem with the one character falling in love with his adopted sister.  Maybe not actual incest but still weird and uncomfortable.  It could have been so much better but Anderson's need for meticulousness completely distracts from the story and not in a good way.  I wouldn't call myself either a Wes Anderson fan or hater.  Some of his work, like The Grand Budapest Hotel, I really like, and other times it just doesn't.  This was one of those times it just didn't do anything for me.  I'll eventually re-watch this, and maybe I'll come back with a different opinion, but for now it's a meh for me.",
      "review_date": "2015-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Family comedy drama. Stylishly shot, but I didn't like the characters enough so it left me feeling unmoved. Quirky is all very well, but it has to have heart to make me like it.",
      "review_date": "2016-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Reminds me of the bad old days when American comedy exports were not funny they were just appalling. Anyone who found this nonsense funny really needs to get out and get a life. This film was utter dross from beginning to end and a totalReminds me of the bad old days when American comedy exports were not funny they were just appalling. Anyone who found this nonsense funny really needs to get out and get a life. This film was utter dross from beginning to end and a total waste of Gene Hackman and the rest of the cast looked really bored all the way through.  Wes Anderson has no sense of humour, no talent and should go back to commercials.  The fact this film was put up for awards proves to me professional critics have not got a clue about the film industry and should go and get real jobs as they clearly have no talent as film critics, mainly because I doubt they even see the films they write about.",
      "review_date": "2011-04-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "For all the detail and production, all the characters are monotone!  Even people who LOVE this movie give a \"but\" to their explanation.   Be honest.  It's a large glass of rum and coke with mostly coke in it.",
      "review_date": "2012-01-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was a waste of time. A sad commentary that anyone would consider giving this anything higher than a 1. Drivel.",
      "review_date": "2008-03-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the worst film I have ever seen in my life. Only White Noise and The Weather Man come close to as bad as this.",
      "review_date": "2007-05-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "WORST FILM EVER!!!!!!! Boring, not funny, terrible, everything about it is rubbish, i hate it. Seriously, how it got good reviews is beyond me. There are so many better comedies out there.",
      "review_date": "2010-08-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Quirky, surprising and off-beat... sounds like a Wes Anderson film, right?... Packed with some solid stars (both comedic and straight-laced), 'The Royal Tenenbaums' is a delightful and much slanted look at the coessential Quirky, surprising and off-beat... sounds like a Wes Anderson film, right?... Packed with some solid stars (both comedic and straight-laced), 'The Royal Tenenbaums' is a delightful and much slanted look at the coessential dysfunctional family that could be from Anywhere, USA. Well, actually it could be from anywhere in the galaxy as you may not come across a more strange slew of characters in one place anywhere on God's green earth. For openers, Gene Hackman plays a hysterical deadbeat dad who had been alienated by the rest of his bizarre family for ignorance to them and vulgarity to others which can include even us the audience. Yet at the same time the viewer will be sympathetic to him and his mischievous routine and rebellious nature given his sly warmheartedness and charm. The trio of the children's life stories (wild and wholly tales portrayed in retrospect and real-time by Ben Stiller, Gwyneth Paltrow & Luke Wilson) surround this rude and complex father shortcomings in spectacular fashion while combative yet dignified mom played by Angelica Houston is a steady presence amongst the chaos. Owen Wilson and Bill Murray round out the supporting cast for this fun-filled comedy. It's a good idea to screen early Anderson efforts like Rushmore and/or Bottle Rocket to prep for the amount of quirkiness thrown at you in this romp but designed to even challenge the zaniest of viewers on its own.",
      "review_date": "2008-02-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its absolutely terrible. The acting ,or rather lack of it, is terrible.  The entire film is really just poor from start to finish and an absolute waste of time.",
      "review_date": "2012-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Upper class New Yorkers Royal and Etheline Tenenbaum had three children. Three child prodigies: Chas, a little financial genius inventor of Dalmatian mice; Richie, a young tennis champion; and Margot, adopted daughter and hyper-depressedUpper class New Yorkers Royal and Etheline Tenenbaum had three children. Three child prodigies: Chas, a little financial genius inventor of Dalmatian mice; Richie, a young tennis champion; and Margot, adopted daughter and hyper-depressed playwright.After years of separation, the three adult siblings find themselves taking a dip in the past of the large and colorful childhood home on Archer Avenue.It is a grotesque psycho-comedy, melancholy in the background and hilarious on the surface, original and nostalgic.",
      "review_date": "2022-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An astounding film, one of my top 5 of all time! To those who say they dislike it because actors arn't type cast...i have to ask, huh? How can you dislike a film for not conforming to the usual? The casting is EXCELENT, esspecially in An astounding film, one of my top 5 of all time! To those who say they dislike it because actors arn't type cast...i have to ask, huh? How can you dislike a film for not conforming to the usual? The casting is EXCELENT, esspecially in Hackman's case, but also Luke Wilson and whoever played Pagoda. This is the way films should be made. Dont expect the usual Ben Stiller/Owen Wilson esc comedy, because you wont find it here. That in no way makes it a bad film because the press misinformed people about it's true genre. Life Aquatic is the same, its subtle humor, the result of performances with depth and a director unbelievably good considering his relative inexperience. Wes Anderson is becoming a rule onto himself, creating a portfolio of work that is pushed under the title \"Comedy\", but is really just an Anderson movie. Like life itself, this film has drama and comedy in equal measure and potency. Some may find that boring, I find it beautiful film making. Take your pick.",
      "review_date": "2005-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies ever made -- hilarious, touching, weird, and beautiful, with great visuals, fantastic music, snappy writing, and that ephemeral otherness that is the hallmark of true art. I sometimes wish I'd never seen it so One of my favorite movies ever made -- hilarious, touching, weird, and beautiful, with great visuals, fantastic music, snappy writing, and that ephemeral otherness that is the hallmark of true art. I sometimes wish I'd never seen it so I could see it again for the first time.",
      "review_date": "2006-07-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Perfect. This movie is a perfect example of Wes Anderson's vision coming to life completely through absolute control and superb acting. \"You wanna talk some jive?\"",
      "review_date": "2008-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply delightful! i enjoyed every minute of this splendid film and the splendid acting in it. one of the funniest and best films ive ever seen",
      "review_date": "2008-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hipster sensibility wears a bit, but it's consistently funny.",
      "review_date": "2008-08-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie snuck by me and i never knew it was in theaters, but i watched it on comedy central and it was great.",
      "review_date": "2008-09-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is my favorite movie of all time simply because it has the best of both worlds. its an intelligent comedy with good drama and good character study it tells you why these characters are they way they are and u can acctually feel for them This is my favorite movie of all time simply because it has the best of both worlds. its an intelligent comedy with good drama and good character study it tells you why these characters are they way they are and u can acctually feel for them and can acctually see a family being like that. I think wes anderson is one of the greatest director/screen writters ever. great writting great characters an great camera angles in all of his films i havent seen one i havent seen a single film I havent LOVED that wes anderson has created and you poeple are stupid who say you only like this film because you want to feel intelligent you're a moron.",
      "review_date": "2005-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you gave this a zero... then you don't understand wes anderson. His humor is in the characters and it takes a few times of watching to fully apreciate it sometimes.",
      "review_date": "2006-04-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love Wes Anderson's quirky movies.  Gene Hackman is brilliant in this film and possibly my favorite performance by him ever.  If not for him, the film would be depressing and too melancholy.  Good performances by everyone else as well.",
      "review_date": "2018-07-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In my own opinion this has got to be one of the most underrated comedy-dramas of the decade, It has a very unique mood, has a great appropriate and not overused amount of comedy and drama, great writing from Wes Anderson and Owen Wilson,In my own opinion this has got to be one of the most underrated comedy-dramas of the decade, It has a very unique mood, has a great appropriate and not overused amount of comedy and drama, great writing from Wes Anderson and Owen Wilson, Great performances from Hackman, Huston, Stiller, Paltrow, Glover, Murray and the Wilson brothers",
      "review_date": "2014-07-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Episodial story of an unconventional family.  Funny, stylish, dark-humor filled, AAA actors, often use humor to describe complex problems ( Like..mourning, adoption, falling from grace and other that i can't describe to avoid spoilers)Episodial story of an unconventional family.  Funny, stylish, dark-humor filled, AAA actors, often use humor to describe complex problems ( Like..mourning, adoption, falling from grace and other that i can't describe to avoid spoilers) stunning wardrobe and room interiors decorations......Highly recommended if u're in the right mood....it brag a little bit here and there, but nothing unbareable.Very good movie overall",
      "review_date": "2022-02-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A superb film about an 'old money' family who like the current generation of the Kennedy's, ended up dysfunctional and emotionally disturbed. The casting is perfect and the film-making feels handmade and exquisite.",
      "review_date": "2020-08-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe Royal Tennenbaum, The Man and The Tennenbaums, his family. The moment I realized that I would get to see Gene Hackman, the baddest badass of the 80s and 90s, in a Wes Anderson probably with all its silly and odd quirks and ridiculous storyline to back that up, I was all in for it. As a pleasant surprise, this movie didn't disappoint. In fact, I would go so far as to disagree with general ratings and it is a 9+ sorta film and it is a probably a top 3 amongst Wes Anderson films.Ben Stiller is perhaps the most underwhelming of the cast since he didn't much to do beyond wearing the red jumpsuit. Danny Glover (unrelated to Donald of the same namesake and Atlanta Fame) is a subdued presence whose flying off the handle during an rude and hysterical altercation with Royal is the moment of the whole movie. Wilson brothers are delightful but Owen definitely is the better performer, his speech a perfect setup for his line to resonate on your funny-bones. Honestly though, no one could possibly be as hilarious as Angelica Huston who always seem like she is about to crack into a grin but keeps going on with straight non-hilarious things. She is only next to Ralph Fiennes (The Grand Budapest Hotel) and Bruce Willis (Moonlight Paradise) in terms of hilarious factors. And as a Gwyneth Paltrow is the perfect fit as the adopted daughter with upmteen secrets. Definitely the best Wes Anderson movie cast ever and even if the story goes soft at times, the same can't be said of the presentation by the actors. Do watch it before you die, or you will regret not having streaming services in The Afterlife (if it exist, that is).",
      "review_date": "2018-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "enriching into a cathartic release..The Royal Tenenbaums\n\nThe symmetric world and the camera work has always been the maker's signature that lures in the audience through its stunning visuals and pleasingly light and breezy tone of theenriching into a cathartic release..The Royal TenenbaumsThe symmetric world and the camera work has always been the maker's signature that lures in the audience through its stunning visuals and pleasingly light and breezy tone of the feature; contradict to its premise. As mentioned, it is rich on such technical aspects like costume design and cinematography but is short on sound department. Owen Wilson and Wes Anderson; the screenwriters, has done an excellent work on offering concrete material that is flat out hilarious and keeps the audience engaged where no one can defy that he or she isn't entertained. Wes Anderson; the director, as always, is excellent in his work on execution and the primary reason it always works is his awareness of the vision that he wishes to implement on screen. The performance is of course, amazingly done because of such a great cast especially Ben Stiller, Owen Wilson, Gwyneth Paltrow and Gene Hackman. The only minor conflict in here, is that the material hits on screen all together and offers very little time to breathe to the audience which can be off putting at times. The Royal Tenenbaums is a family drama enriching into a cathartic release where even though there isn't much to connect to the world depicted in here, it certainly is supremely entertaining.",
      "review_date": "2018-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I absolutely loved this movie. Very unique and unlike any other movie you will see, especially in 2020's. The characters are flawed but likeable, it's quirky, absorbing and brilliantly acted.",
      "review_date": "2020-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best movie of 2001.Original, quirky and most of all laugh out loud hilarious.Gene Hackman is brilliant as Royal, a grifter who finds some heart. Wes Anderson's best movie to date.",
      "review_date": "2021-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "8.5/10The only major problem that i have with The Royal Tenenbaums is the relationship between Margot and Richie which i found very unnecessary and it is kinda bothering me, and some couple of nit pick, but overall the rest of The Royal8.5/10The only major problem that i have with The Royal Tenenbaums is the relationship between Margot and Richie which i found very unnecessary and it is kinda bothering me, and some couple of nit pick, but overall the rest of The Royal Tenenbaums is a very entertaining movie in terms of a story, performance, character, and of course Wes Anderson style that are not too exaggerating (which is my problem with later Wes Anderson movie started with The Grand Budapest Hotel), it's enjoyable and it's also funny, a not so original story that i really like and much prefer more rather than Bottle Rocket which i still like and Rushmore which i don't like, so overall, loved the performance, liked the characters, very entertaining, The Royal Tenenbaums is one of the good Wes Anderson movie.",
      "review_date": "2022-06-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As an unfortunate soul who was yet to see The Grand Budapest Hotel, I can safely say that The Royal Tenenbaums is my favorite of Wes Anderson's films. The bleak humour blended with the wonderful performances from an incredible cast bring toAs an unfortunate soul who was yet to see The Grand Budapest Hotel, I can safely say that The Royal Tenenbaums is my favorite of Wes Anderson's films. The bleak humour blended with the wonderful performances from an incredible cast bring to life a family struggling to figure out their purpose in the world. Watching them reconcile with one another is really special, and Wes Anderson's style is perfect for this story. This is a movie with a lot of heart that is an extremely enjoyable watch despite its dark themes.",
      "review_date": "2022-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "4.2It’s an alright movie in the grand scheme of things, but I can’t not stand the main romance of the film, they had no chemistry and were annoying. It is still certainty worth your time.",
      "review_date": "2023-03-16",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 76,
  "genres": [
    "Drama",
    "Comedy"
  ]
}