{
    "rating": 9.5,
    "release_date": "1946-01-07",
    "num_reviews": 330,
    "genres": [
        "Holiday",
        "Comedy",
        "Drama"
    ],
    "summary": "After George Bailey (James Stewart) wishes he had never been born, an angel (Henry Travers) is sent to earth to make George's wish come true. George starts to realize how many lives he has changed and impacted, and how they would be different if he was never there.",
    "reviews": [
        {
            "content": "My personal favorite Christmas movie and one of my overall favorites. Just a great movie- classic.",
            "review_date": "2023-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a wonderful life is a the best Christmas movie you can watch. A real great sitdown with your family and enjoy whilst you eat cookies and stuff your face with all kinds of foods. The movie balances family,love, anguish perfectly. The negative is the middle of the movie can be boring and drag on at times. Overall a great must see with the family during the holidays.",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The world could have been worse, without you.",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could be cynical about this movie, it would be easy, but it's better than that.",
            "review_date": "2023-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful movie speaking a lot for each individual out there who is helpful, friendly, selfless. This world needs movies like this. Thank you Frank Capra & entire team for making this movie!",
            "review_date": "2023-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion the greatest film ever made. Jimmy Stewart is absolutely brilliant in showing you just how much value each person has, and how important it is to cherish this life we're given.",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great movie to watch around the holidays, no matter whether you celebrate them or not, or even care for them or not to begin with, and that's probably what makes it watchable all-year-round. I don't think my input will add anything significant in describing how great this movie was and still is after so many decades, especially in terms of the message it compellingly conceives. After watching this, and no matter what you might be going through, you will realize that it is indeed a wonderful life.",
            "review_date": "2023-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a wonderful life is the perfect movie.",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless tale. Frank Capra's 1946 film about appreciating life, helping others and acknowledging goodness, no matter how hard life is or irrelevant one feels is sometimes more important than pursuing individual goals. It reminds us that we are not alone, that the lows in life should make us cherish the highs, and that we should recognize not only the impact we've had others, but what impact they've made on us. This is a film not only for Christmas, but for any time, one that helps us to see that, well, it really is a wonderful life.",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could not be a better movie. The acting and writing are insanely well done.",
            "review_date": "2022-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Because of the dated editing/pacing, it feels longer than it really is. Incredible acting, decent script.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BEST CHRISTMAS MOVIE EVER!!!!!!!!!!!!! I would say that this movie is absolutely perfect for everyone 7+.",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sappy commercial for all the stupidity that capitalism brings to the people.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie brings me to tears every year.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my very very favorite movies. In my top 5 of all-time!",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watched it again. What a triumph of a film!",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Classic....Simple as that...Classic!",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must-see Christmas movie. Jimmy Stewart plays his role so well and the story is beyond entertaining! Truly a classic for the ages!",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How is this not getting 110%??",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Clarence.  He is the best!!  The rest of it gives me a small inclination to jump off a cliff into the rocks. Towns like that have folded up. I know because I currently live in Pottersville. \nThe rest of my family loves it.\nHappy Holidays",
            "review_date": "2022-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Christmas movie. I actually watched it on the big screen and took my adult kids to see it. They had never seen it. They loved it.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the top movies in American Cinematic History. Tells the story of not just George Bailey but the whole town and shows what true happiness is. Yes, it's very date for some of the intellectual hipster movie buffs now adays. The movie in that era by the way was panned by critics for being too depressing and real which is funny when you see people panning the movie for being too cookie cutter/artificial. Guess we need a remake where George Bailey has a needle sticking out his skin and Mary has an only fans account just to raise money.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is by far my most favorite movie of all time!! It's all encompassing!! It makes you truly evaluate and put into prospective how valuable each of our lives truly are and the effect we have on the lives of others!! A must see for all!!!",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Christmas movie hands down!  Makes you remember what is important in life.  Gorgeous movie.",
            "review_date": "2022-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best feel-good movie ever made! Feeling blue? Things have you down? This movie will move you, inspire you. My favorite movie of all time, LOVE LOVE LOVE IT!",
            "review_date": "2022-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant film, with a lovely meaning, though it took some time to develop, but still loved it",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "MY FAV CHRISTMAS MOVIE OF ALL TIME!  I cry and cry at the end every time I see it.  MUST SEE!",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (9/10) ; Cinematography (8.5/10) ; Plot (9/10) ; Acting (9.5/10) ; Pacing (9/10) = 90%}\"",
            "review_date": "2022-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest movie ever!",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is incredibly overrated it's astounding. Too saccharine and boring. Yawn.",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": ")\nOne of the best movies ever, its sad we will never see such wonderful movies ever again, Hollywood has no class anymore.",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever!",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its A Wonderful Life is a delightful and heartwarming movie with a close to heart message. James Stewart, Donna Reed, and Lionel Barrymore give excellent performances. A true holiday classic.",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true holiday classic that shares the spirit of love and generosity.",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is The seasonal movie to watch. Some great performances in a marvellous story.",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just because a movie is a Christmas movie and is on TV every year doesn't mean it's good. I'm sorry, someone has to say it. It wasn't considered good when it came out, and it's not good now.",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "George Bailey really did live a wonderful life ",
            "review_date": "2022-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible, depressing disaster of a movie. It's no wonder the guy wants to kill himself. He spends his whole life catering to his entire town, being taken advantage of, and falsely accused. Over and over and over again. And then his angel shows him the worst case scenerio and suddenly he wants to live and go back to his drafty, dead-end life. For all that it's supposed to be, I will gladly pass on this movie.",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, cathartic, and refreshing. ",
            "review_date": "2022-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is everything! And is a true life lesson of appreciation for your life even with issues you think are overwhelming!! Love it and watch it every year since I was a teenager!!",
            "review_date": "2022-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal movie. great acting, great story. Classic Christmas movie to watch every year.",
            "review_date": "2022-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest Christmas movie of all time. Jimmy Stewart is the GOAT.",
            "review_date": "2022-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless story of faith and love.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great classic movie that is a must see for everyone",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is in the list of the Top 10 Movies of all time",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "George Bailey is the protagonist of the story. He's a very ambitious person, living in the small and boring town of Bedford Falls. He works in his father's building and loan firm and dreams of traveling around the world, but everytime something comes up and he is unable to leave Bedford Falls.  He and His whole family are in trouble because a lot of money has gone missing and George is blamed for it. When in reality the money was stolen by the evil Mr Potter, who is known as the richest and meanest man in town. On Christmas day he contemplated committing suicide because he thinks everyone would be better off without him. George's whole life is then shown through flashbacks to see just how he got to that place. He's desperate and doesn't see a way out and just as George is about to jump off a bridge, Clarence, his guardian angel, shows up and shows George what life would have looked like for everyone if he hadn't been born. \n\nThe main theme of the movie is coping with failure and success in life, but there are also many components of love, family, friendship, and Christmas.\nThe main message of the movie is showing how one person can make a difference. Sometimes it is the lack of perspective that causes people to forget how much impact they have on others lives. Great evidence of this is a quote that comes at the end of the film when all is well again.George embraces his family under the Christmas tree and suddenly he finds a Mark Twain book with a message from Clarence that reads \"No man is a failure who has friends\". What this scene shows is how good relationships with friends and family are what truly means to have success in life.\nMost of the movie is a little demoralizing and seems to go against the message of the movie and how everyone is more successful than they think, because through out the movie nothing seems to work out in Geroge's life. Everytime the opportunity presents itself he chooses to help other people instead of following his dreams even though he's punished for it. It isn't until close to the end when George realizes how much success he has had in his life as he looks at how many people he has helped. \n\nI saw this movie for the first time with some friends that wanted to watch a Christmas movie. And we saw \"It's A Wonderful Life\" , an old black and white movie. It was an emotional rollercoaster, never before in my life had a movie made me laugh, feel angry, and tear up so much.\n\nThis is my favorite movie of all time, I've probably seen it more times than anything else. Although it's a very old movie, it is a timeless masterpiece. George Bailey's story of trying to pursue his dreams and feeling like a failure because he hasn't  accomplished his goals is something that is very relatable and has spoken very personal to me has I have tried to make a difference in the world The moral of the story, which is how everyone can make a difference, is something that I believe can inspire any kind of person, so obviously I 100% recommend this movie.",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "George Bailey (James Stewart) is a pillar of his small community, always eager to offer a kind word or a helping hand to those less fortunate, willing to sacrifice his dreams to make the dreams of others come true.  However, when misfortune calls and he is faced with financial ruin and considerable legal problems, a guardian angel is sent to save him from his fate.  It is a touching and timeless story of redemption as one man comes to terms with the significant role he has played in the lives of others.  At the risk of committing some sort of cinematic sacrilege, it takes far too long for director Frank Capra to set up the story for the ultimate pay-off and there are a couple of scenes with some horrible jump cuts, but overall, warts and all, it is a rewarding viewing experience for the whole family.",
            "review_date": "2022-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a Wonderful Life is something truly special, and along with Scrooge, the original Miracle on 34th Street and Home Alones 1 and 2, it is something I watch every Christmas. Why? Because I love this movie, seriously I do. Looking through my 1000 or so reviews here, I couldn't believe I hadn't reviewed this movie; I have seen movies that I have loved and cherished since childhood and I have seen movies that belong at the bottom of the garbage. It's a Wonderful Life belongs to the former, although I am 17, I appreciate a good movie when I see one. This is more than a good movie, it's a timeless masterpiece, that holds up on repeated viewings and never loses its magic.\n\nIt's a Wonderful Life could have easily been overly-sentimental and clichéd, but the quality of the direction and the screenplay that others have summed up perfectly assured it was a beautiful, heart-warming and somewhat poignant film. While there are some funny parts, not bursting-your-gut funny but funny in a subtle sort of way, other parts are close to heart-rending. The direction from Frank Capra is excellent, sensitive and nuanced, and Capra shows even more talent as a screenwriter having penned one of the most honest and touching scripts ever in a film. Casablanca, All About Eve and The Shawshank Redemption all had wonderful scripts, but the script here has a lot to say about community spirit and shows that this film is much more than feel-good sentimentality. There is the element of feel good here, no doubt about it, but it doesn't overpower what the film intends.\n\nVisually, It's a Wonderful Life is a wonder. I don't think it is dated at all, the cinematography is crisp, the black and white looks beautiful and the pristine Christmas scenery really does take me back. Some of my favourite ever memories was of Christmas, whether it was watching nostalgic Christmas videos, eating Christmas dinner or singing carols under the Christmas tree. Another thing I have to mention is that the movie is richly and beautifully scored, Dmitri Tiomkin's music here is absolutely gorgeous, lyrical, whimsical, nostalgic and most importantly it never felt intrusive in the more integral parts of the film. And I have to mention the story, never in my life(and I genuinely mean this) have I seen a movie where it communicates such a strong message and so well too. The story of a suicidal man who is shown the value of his life by his guardian angel is an effective, timeless one, imitated perhaps but never equalled.\n\nFinally the acting is wonderful. James Stewart, and I seriously don't give a damn whether he was a racist or not and neither should you, is absolutely superb as George Bailey, a truly complex character who goes through such a lot to get to where he is at the end of the movie. George Bailey is like Mr Deeds, John Doe and Mr Smith rolled into one, and in my opinion only James Stewart could have given justice to a character that has self-doubt gnawed at his essential decency. Also the character change, like that of Alistair Sim's Scrooge at the end of Scrooge, was heart-breakingly believable. Donna Reed is radiant and charming as his wife, who is like a caring lover, devoted wife and dedicated mother, while Thomas Mitchell gives one of his more memorable performances as Uncle Billy. Henry Travers is a revelation as Clarence the guardian angel, but there is another performance I think is worth of mention. For a good morality tale, you need a good villain. Well in the name of Potter, you have one. Who better to portray him than the great Lionel Barrymore acting at the peak of his powers?\n\nOverall, a timeless classic with a true and heart-rendingly poignant ending. 10/10, one of the easiest perfect scores I have made recently. Bethany Cox",
            "review_date": "2022-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a very heartwarming view of what matters in life and what makes it wonderful. It demonstrates the role of families in the 1940's which is one of traditional value. George's life shows different signs and symbols of the times and what the movie really shows about God and his presence and how he tries to help us. It gives emotional value with the relationship between George and Mary.",
            "review_date": "2022-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"It's A Wonderful Life\" is one of Frank Capra's most touching and inspirational films and this masterpiece is the most inspirational of all time according to The American Film Institute.  The AFI also rated it #20 of the 100 Greatest Films of All Time (American films only). My family has an annual tradition of viewing the film, always in its original B&W version, around Christmas. The film deserves Its reputation and is truly a masterwork that is so realistically human and filled with every type of emotion we have as humans. What a wonderful and beautifully shot film that's looks gorgeous on blu-ray! Going from my parents vhs to dvd and now owning it myself in the definitive version on blu-ray, it holds a special place in my collection and heart! Gather family and friends and watch one of America's greatest and most inspirational films!",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I used to think this was a heartwarming tale of family, faith and all that was good about America. Then a friend pointed out that it's essentially two hours of misery for two minutes of catharsis at the end. Still, what's better than having Frank Capra remind us that, while we might be stuck and thwarted in our dreams, it could be a helluva lot worse - so shut up, get back to work and let some angel get its dam wings.",
            "review_date": "2022-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Favorite Frank Capra Film, Favorite Jimmy Stewart Film. One Of My favorite Endings ever. Truly brings me to tears of Joy every time no matter how many times I watch it. The message is timeless as well. Very Unique story structure as 85% of the movie is devoted to the first act which I have never seen in another movie but it oddly works wonderfully and makes the ending carry that much more weight. Jimmy Stewart (My favorite actor of all time) is phenomenal and is character is one of Top 5 Favorite Heroes Of All Time for his relatability, selflessness and sincerity. Never does the film feel self righteous, cheesy, or overdramatic as a lot of films around this time do. It truly feels modern. Mr. Potter is one of My Favorite Villains of All Time for his heartlessness and greed, representing the worst of humanity in juxtaposition to George who represents the best. Even though this is watched mostly around Christmas this is so good you can watch anytime of the year and feel happy. The Final 5 Minutes will make anyone tear up with tears of Joy. One of the Best Endings I've Ever Seen.",
            "review_date": "2022-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greats. Never fails to get me teary eyed, and that's hard to do for me. If I was to say a bad thing about it, it's that there's maybe a handful of lines that are awkward/clunky. Recommend watching in black & white the first time.\n\nIt's telling of the quality of this movie when the only things people can knock it for is something idiotic like being \"too white\" or \"too christian\". Look at almost every bad review on here and that's one of their reasons.",
            "review_date": "2022-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Christmas movie of all time. The film has a spectacular performance by Jimmy Stewart. A very heart warming story that will make feel the Christmas spirit. True the movie ends in Christmastime while the movie builds up the characters and story to its great climax.",
            "review_date": "2022-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas classic I'm head over heels in love with this glorious and triumphant movie.",
            "review_date": "2022-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "they don't make movies like this anymore.. got heart",
            "review_date": "2022-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film lost money upon release in 1946, but now is a holiday classic. It's a timeless film showing the value of life and friendship. George, a struggling man wants to kill himself after losing $8000, but eventually realizing that his existence has made a big impact on others. This is one of those classic films that will have appeal to almost every type of audience.",
            "review_date": "2022-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas classic for me for many years.  It is a wonderful story, with a joyful ending.",
            "review_date": "2022-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic, very memorable and good.",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie that never gets old. I've watched it every Christmas and will for the rest of my life.",
            "review_date": "2022-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A 76 year old pure cinematic masterpiece that continues to remind us of the greatness of life that we often take for granted. The content of character manifested in the admirable man, George Bailey throughout the movie and its sublimely ceremonious ending will never cease to inspire and move its audience. Not only does this movie absolutely entertain us with its impeccable storytelling and beguiling performances, it makes us better as human beings by the time the credits roll.  An epitome of why we watch and love movies.",
            "review_date": "2022-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless classic that has entertained for decades and will continue to be one of the best Holiday movies ever made for generations to come. Watching the new colorized version of It's a Wonderful Life was a brilliant experience and a highly recommended one for fans of this masterpiece.",
            "review_date": "2022-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WARNING! THIS REVIEW HAS SPOILERS (It's a movie from 1946, I think almost everyone watched it)! Life is wonderful. It is worth a lot more than 8,000 dollars. George Bailey's personality irritated me a little bit, he's a guy who always puts money on the second plan, but it's impossible to be this way in a capitalist world, especially after the Great Depression or World War II. And Mr Potter (Lionel Barrymore), who's portrayed as the villain, is the actual voice reason of the film, alongside Mary (Donna Reed) and Clarence (Henry Travers). The film successfully doesn't contradict the messages \"life's worth more than any money\" and \"'money doesn't buy happiness' is a lie\". Despite looking antagonistic, they're, in fact, complementary. The movie is essentially George's journey back to reality, even though he was never out of it. I think a more appropriate expression would be \"put his head in the right place\". Oh, and the ending is undeniably heartwarming. And I got where \"Sesame Street\" picked up the names Bert and Ernie, hahaha!",
            "review_date": "2022-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What I don't understand is the rumor of how a standup guy like Stewart could blame is co-star actress for its initial failure.  Donna Reed was simply stunning.  She embodied, in fact, totally WAS, Mary Bailey.  Without her it might not have been nearly as wonderful.",
            "review_date": "2022-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It actually is a wonderful life.",
            "review_date": "2022-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film, made just after the second world war, has an optimistic objective.  It begins with an attempted suicide and thereafter moves upward to a firework's ending.  It goes from deep depression to happiness thanks to the fantasy of Christianity, which begs the question why this guy warranted angelic intervention compared with others - especially considering the recency of WW2.  This is the least of its problems.   The film has not aged well.  The problem is it clearly has American audiences of the late 1940s in mind and one imagines the storyboard looking like a collection of Norman Rockwell paintings.  The combined effect is a fantasy belonging to a fantasy-view of American society - filled with Christian white people and the American can-do myth.  It's appalling.",
            "review_date": "2022-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a Wonderful Life is something truly special, and along with Scrooge, the original Miracle on 34th Street and Home Alones 1 and 2, it is something I watch every Christmas. Why? Because I love this movie, seriously I do. Looking through my 1000 or so reviews here, I couldn't believe I hadn't reviewed this movie; I have seen movies that I have loved and cherished since childhood and I have seen movies that belong at the bottom of the garbage. It's a Wonderful Life belongs to the former, although I am 17, I appreciate a good movie when I see one. This is more than a good movie, it's a timeless masterpiece, that holds up on repeated viewings and never loses its magic.\n\nIt's a Wonderful Life could have easily been overly-sentimental and clichéd, but the quality of the direction and the screenplay that others have summed up perfectly assured it was a beautiful, heart-warming and somewhat poignant film. While there are some funny parts, not bursting-your-gut funny but funny in a subtle sort of way, other parts are close to heart-rending. The direction from Frank Capra is excellent, sensitive and nuanced, and Capra shows even more talent as a screenwriter having penned one of the most honest and touching scripts ever in a film. Casablanca, All About Eve and The Shawshank Redemption all had wonderful scripts, but the script here has a lot to say about community spirit and shows that this film is much more than feel-good sentimentality. There is the element of feel good here, no doubt about it, but it doesn't overpower what the film intends.\n\nVisually, It's a Wonderful Life is a wonder. I don't think it is dated at all, the cinematography is crisp, the black and white looks beautiful and the pristine Christmas scenery really does take me back. Some of my favourite ever memories was of Christmas, whether it was watching nostalgic Christmas videos, eating Christmas dinner or singing carols under the Christmas tree. Another thing I have to mention is that the movie is richly and beautifully scored, Dmitri Tiomkin's music here is absolutely gorgeous, lyrical, whimsical, nostalgic and most importantly it never felt intrusive in the more integral parts of the film. And I have to mention the story, never in my life(and I genuinely mean this) have I seen a movie where it communicates such a strong message and so well too. The story of a suicidal man who is shown the value of his life by his guardian angel is an effective, timeless one, imitated perhaps but never equalled.\n\nFinally the acting is wonderful. James Stewart, and I seriously don't give a damn whether he was a racist or not and neither should you, is absolutely superb as George Bailey, a truly complex character who goes through such a lot to get to where he is at the end of the movie. George Bailey is like Mr Deeds, John Doe and Mr Smith rolled into one, and in my opinion only James Stewart could have given justice to a character that has self-doubt gnawed at his essential decency. Also the character change, like that of Alistair Sim's Scrooge at the end of Scrooge, was heart-breakingly believable. Donna Reed is radiant and charming as his wife, who is like a caring lover, devoted wife and dedicated mother, while Thomas Mitchell gives one of his more memorable performances as Uncle Billy. Henry Travers is a revelation as Clarence the guardian angel, but there is another performance I think is worth of mention. For a good morality tale, you need a good villain. Well in the name of Potter, you have one. Who better to portray him than the great Lionel Barrymore acting at the peak of his powers?\n\nOverall, a timeless classic with a true and heart-rendingly poignant ending. 10/10, one of the easiest perfect scores I have made recently. Bethany Cox",
            "review_date": "2022-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My review will not be liked, but I thought it was a trashy movie with a good message.",
            "review_date": "2022-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Movie of all time",
            "review_date": "2022-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films ever made. Is it sentimental? Yes, indeed. But it is also honest. It helps us understand some of the most profound principles in life without preaching. One of the best lines in the movie, \"All you can take away is that which you have given away\", isn't even spoken. But can you get more profound than that?",
            "review_date": "2022-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing film. Nothing more needs to be said.",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Always Look forward to watching this movie each year. reminds you of how beautiful life is and how you really have it all no matter what your life situation is. Jimmy Stewart will always be one of my Favorites! Must see!",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although old, It's a Wonderful Life remains to be an incredible and influential movie. It is funny, has some great acting and has a near-perfect story. Although the first half of the movie is certainly not as good as its second, it provides important details that may only be noticed upon a second viewing.",
            "review_date": "2022-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I want a good cry or to get made at that drunk uncle, I'll watch It's a Wonderful Life. But until then, I am done watching It's a Wonderful Life. I've seen it too many times and the events are too burned into my brain. \n\nit's a good film - worth watching and studying.",
            "review_date": "2022-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impressive to see that in the 40s they could portray such meaningful storytelling in such eloquent way",
            "review_date": "2022-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly one of the universally human films, brimming with heart and emotion. A must-see for any movie fan around the holidays. It'll restore your faith in your fellow man.",
            "review_date": "2022-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thank you for showing a classic!",
            "review_date": "2022-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true Christmas classic.  One of the all time best movies.  And Jimmy Stewart is a true American treasure",
            "review_date": "2021-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a wonderful life is a wonderful movie. A great refreshment, story and performances.",
            "review_date": "2021-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is there to say About It's a Wonderful Life that hasn't been said before? It is King of the Christmas movies and one of the greatest pictures ever made in human history. It's themes are universal, and are still relevant today, if not more so than when it was filmed. Everyone needs to see this movie at least once.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really sweet feel-good movie with solid acting, and a unique spiritual element that helps differentiate itself from other movies. It's also got a great take-home message. Probably the best holiday movie that I've ever seen.",
            "review_date": "2021-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true classic. Puts life into perspective and very easy to re-watch. Great acting all around ",
            "review_date": "2021-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent! It was great to see on the big screen! Terrific quality clear picture.",
            "review_date": "2021-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the quintessential Christmas movie. Jimmy Stewart as the benevolent \"Everyman\" who is forced to to take a look at the impact his presence has had on the lives of people around him.  Capra ask an aged old question of whether our life has any real impact in an ageless way.  The imagery and visual command of this movie was celebrated and replicated for decades.  It is moving and impactful and still holds ups.  One of Stewart's best",
            "review_date": "2021-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There isn't a better Christmas movie to put you in the spirit.  There is a little of George Bailey in all of us!",
            "review_date": "2021-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a Wonderful Life is a timeless Christmas tradition for many households. Hope, family, magic and despair. You will enjoy at any point in the year. A film that makes life more wonderful.",
            "review_date": "2021-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We began a Christmas tradition several years ago to watch Its A Wonderful Life every Christmas Eve. We were a little disappointed that we had to go on 12/22 as that was the only day it was available.",
            "review_date": "2021-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Always loved this Christmas classic, but this was my first time to see it on the big screen.  Thank you!\n\nTook a buddy, it was his first time seeing through to the end in one sitting.",
            "review_date": "2021-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Timeless Classic Christmas movie, I loved seeing it in the Theater, it was wonderful as always, it brings you back to what is truly important in life, your family and friends that love you!!",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is the definition of a classic. It hits you in the feels no matter your age. Even those whom don't like to watch \"black and white\" films, always end this movie with a smile.... ding ding.",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies ever made. Pretty hard to hold back the tears for the ending. This will forever be a classic — Christmastime or not",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite movie of all-time! This is a film that I can watch over & over again, and it’s appropriate to watch with the family or a loved one over the holidays, or when you just want to motivate someone that their life is unique and important. ",
            "review_date": "2021-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This truly is number 1 for a reason. Its warm and who wouldn't want to live there.\nBrings out the feels every time.",
            "review_date": "2021-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie made me cry.",
            "review_date": "2021-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It certainly takes its frustrating time and forgets it's about Christmas for a lot of it, but one would be lying if they thought it wasn't the best , most proper version of a Christmas Carol anyone could ever empathize with.",
            "review_date": "2021-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "EVO Kyle doesn't have recliner chairs like some others. But watching the movie again on the big screen is a definite improvement from a small TV.",
            "review_date": "2021-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a strong message, \"It's a wonderful life\" is about virtues that we don't see very often.",
            "review_date": "2021-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's A Wonderful Life has well deserved its title for the very definition of Christmas movies. Capra's pretty much iconic Christmas masterpiece is well worth a watch!",
            "review_date": "2021-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best Christmas movie ever.\nAmazing acting and actual acting from these professionals in 1946.",
            "review_date": "2021-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what one would call a genuine feel-good movie, especially if you're looking to get into the Christmas spirit with loved ones! The humor in this film still works and the main actor James Stewart puts on a great performance. One of the best black and white movies I've seen!",
            "review_date": "2021-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that everyone should see.",
            "review_date": "2021-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic. Nominated for Oscars, but did not receive one ! Got mixed reviews and lost money at the box-office at that time (go figure). Superb performances by James Stewart and Donna Reed.",
            "review_date": "2021-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real classic about the important things in life.",
            "review_date": "2021-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a perennial masterpiece that should be watched every year.It's  The Ultimate Family film that for me has become a Christmas classic.  James Stewart as George Bailey has changed the lives of many people in Bedford Falls a classic movie that deserves every ounce of a five star rating.",
            "review_date": "2021-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of all time. Classic story from a bygone and simpler era. Love it. ",
            "review_date": "2021-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anyone who gives this less than 5 stars should be banned from the app.",
            "review_date": "2021-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a story about a person which did wanna end self life but understand that his life is wonderful. Not without angel help. Excellent Christmas story.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie so far\nDefinitely inspirational",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No matter how often you see this perennial Christmas favorite, you will be entranced.  Flawless.  Indeed, it has become such a familiar part of the holiday landscape that those who have never seen it might dismiss it as \"Capra-corn\" sentimental and syrupy.  In fact, the movie's vision is that of a dark-edged world in which heroes are necessary.  George discovers his existence has saved his community from the cruelty of robber barons and more importantly, from its own greed and shortsightedness.\n\nMade just after the war, it was a favorite for both leading man Jimmy Stewart and director Frank Capra.  It is easy to see why.  There's a delightful song and dance sequence, visually witty moments like the dance floor that converts into a swimming pool during a feverish Charleston competition, and a sophisticated dialogue.  Stewart gives the performance of a lifetime.  Alternately affable and bitter, he is the. movie's little man hero.   And if the movie is about broken dreams, it's conclusion is that these broken dreams can turn out to be a blessing.",
            "review_date": "2021-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Technically the best Christmas movie of all time, It's a Wonderful Life remains as iconic as its first release.🎄🎅",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Frank Capra's (Here Comes the Groom, Arsenic and Old Lace) festive masterpiece still holds up with James Stewart (The Man Who Shot Liberty Valance, The FBI Story) magnetic performance and I'm shocked it didn't win next picture",
            "review_date": "2021-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as I’m concerned, this is the greatest film ever made. I have seen it 20 times in a movie theater and 40 times on DVD without commercials (which would be sacrilege). Sure, there are moments that now seem corny or schmaltzy, but in terms of emotional impact and transformational, even healing power, no other film comes close. This is actually quite a dark film, a film about suicide, and yet is funny, exhilarating, and deeply moving. My favorite filmmakers all agree. ",
            "review_date": "2021-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably best movie ever",
            "review_date": "2021-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think there is a better Holiday movie.  This is something I have to watch at least once a year. I can recite it line by line. It makes me tear up even know when I think about George looking for ZuZu's rose petals.  Highly recommend.",
            "review_date": "2021-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing fills my heart with as much joy as finding the true meaning of life. Loving those close to you and never letting go",
            "review_date": "2021-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Christmas movie my favorite and I love to catch it every year!",
            "review_date": "2021-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film gave us the moon.",
            "review_date": "2021-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of all time!!!!!",
            "review_date": "2021-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic that makes me nostalgic for simpler times",
            "review_date": "2021-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films of all time!",
            "review_date": "2021-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite simply, my favourite movie of all time. ❤️❤️",
            "review_date": "2021-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The premise of the story is, of course, how a man named George Bailey keeps sacrificing his money and his desires all his life to help others in various ways over the years, and when later in life he is finally overwhelmed by his latest problems which he cannot solve himself and is ready to commit suicide, an angel from Heaven whose eyes are upon promotion is sent down to tell George about how all his self-sacrificing had saved so many people from disaster.\n\nOne can nitpick about various things in the movie: reading a Bible, there are references to cherubs and seraphs, angels whose status in Heaven is indicated by the number of wings they have; the fact that George, despite his frustrated ambitions, didn't do too badly-he has a nice wife and children and is not living in poverty, and not being eligible to serve in the military would not necessarily be considered by some people (including people who had) to be a bad thing.\n\nMy problem, though, is this-it turns out that Bailey has lots of friends because of all the good he had done, and they're willing to pay him back to get him out of his financial hole and save him from jail. Unfortunately, in real life self-sacrifice, especially excessive self- sacrifice, does not necessarily result in gratitude from those one had sacrificed for. They might necessarily take your actions for granted and in fact might regard you as a slave, which all too often happens in real life. Once your purpose is served, the sacrificer is discarded and forgotten, or even despised. And that, alas, would have been the far more credible ending.",
            "review_date": "2021-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great film that's become a perennial classic.",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sad story about a local boy who is trying to save his neighborhood from being commercialized, while at the same time conflicted with the feeling that he needs to make a life away from his home town. The story is a tear jerker and Jimmy Stewart performs as usual (outstanding). The story of the movie pushes a powerful message to the viewer that they mean more to the ones who love them more than they might realize. Though I feel the climax of the movie was a bit lacking due to the fact that the main character was drunk, which seemed to make the visions he was having seem a little less important to him. Other than that small problem, the plot mixed with the acting makes this classic indefinitely a must see.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those movies that gets way overrated just because it's old and some people have been watching it for decades so it's like a piece of them. But it doesn't hold up well in 2021. It's way too long and uninteresting.",
            "review_date": "2021-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those movies I will watch at least once a year until I die.  It contains so much drama, warmth, potential, tragedy - and awareness - of the fleeting nature of existence.  Its one of the most beautiful pieces of art that exists.  \n\nI show it to my kids every year at the holidays.  I know the words verbatim.  I play it in my mind and know every scene.  This is the only movie of which I know that has this effect.  I love it deeply.  I hope it continues to be something people cherish for years to come.  The story is universal.",
            "review_date": "2021-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite movie of all time! It deals with suicide, financial poverty, death, and mental illness whilst being made in 1946! Many still consider these topics taboo but this movie was brave enough to talk about these topics and did an amazing job at it. It received mixed reviews and did poorly in the box office when it came out due to the previously mentioned subjects it had. Because of this, the movie was put in the public domain and television stations were able to air it for free. Because of that, it became a lot more popular as more and more people were able to watch it through the ages. This movie has become a classic that has stood the test of time. I highly recommend that everyone see this at least once and if you don't cry the first time then watch it again till you do.",
            "review_date": "2021-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, joyful, life affirming! I cry every time.",
            "review_date": "2021-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite movie of all time!! The execution of the message of this movie is perfect! The acting is phenomenal!! It's the Citizen Kane of christmas movies.",
            "review_date": "2021-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest modern fairy tail",
            "review_date": "2021-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Strange, isn't it? Each man's life touches so many other lives. When he isn't around he leaves an awful hole, doesn't he?\"\n\nI watched this in class about film & philosophy and our professor started the lecture by apologising for this rare occasion of watching a happy movie.\nI think a lot of people find themselves wondering how life would look like without them, and if stuff could be better if they weren't here, I know i think about it often and the fact this movie touched this subject in such a heartwarming way managed to bright up my week which was pretty difficult. Being in a loving & caring community is really one of the reasons to live and this movie it just so perfect in showing how each and every one of us touches, even slightly, the lives of other people. Even when we think things would be better off without us. I usually don't like cheesy movies but sometimes it's just what you need when things are not looking great. Here for optimistic future prospects & FUCK CAPITALISM",
            "review_date": "2021-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's one of those movies you just gotta watch",
            "review_date": "2021-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily my favorite movie of all time.  Great acting, direction, script, story, etc.  If you haven't seen it, at it to your list.",
            "review_date": "2021-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No other film before or since has captured the joy that Capra and Co. created in the final scenes of this film, it's utter magic, plain and simple.",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate how much Back to the Future Part II stole from this because now I’m obligated to like it less cause it did exactly what the end of this film did. But yeah this movie is basically perfection.",
            "review_date": "2021-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took me quite some time to watch this, but boy oh boy it's a joy of a film.\n\n\nI can see now why they said Click stole from this.\n\nI saw the colorized version, don't judge me, it was the only way for me to saw this legally at the moment. It looks very good!",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Families today still really enjoy this movie, we watched the black and white version and it didn't feel aged at all. It has sad moments but it's overall uplifting.",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "yes this is a five star movie",
            "review_date": "2020-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Favorite movie of all TIME! Truly puts life in perspective! ",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like it. Not much else to say. It's good",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie about a suicidally-depressed family man is somehow also the secret meaning of Christmas. It will restore your joy in living and should be viewed regularly for good health.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "probably the best Christmas movie of all time. storyline to acting was superb. ",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its a wonderful life is just as important now as it was when it first came out.  And the Mr. Potters of the world are doing everything they can to make sure everything goes their way.  But instead of slums, Americans are now living in tents under bridges that are rotting above them and we are being told the by the Mr. Potters that they want you to rent everything in the future, even the clothes on your back.  You will own nothing and are cattle.  Well the goodness of people will shine through just like in the movie, it has to, or we are all finished.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, still one of the best films in history.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whole I was aware of this movie for years, I never really watched it all the way through. I'm glad that I finally did. This is a well written story with excellent character development and pacing. It manages to be heartwarming without being smarmy or hokie. I'm not normally someone who gets emotional at movies, but the ending always makes me misty eyed.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of all time! An annual Christmas treat!",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunning. This is pure artistry of film-making across all elements. It's engrossing, and engages you from the beginning, with characters who are masterfully written and developed. The sense of wonder builds and delivers something believable, humbling and emotional. Cannot believe I've not watched this before! It'll be a yearly viewing from hereon in, that's for sure",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a Wonderful Life (1946) is a film I've never watched until tonight. This is the best holiday movie I've ever seen and I highly recommend this classic from the 1940s.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest Christmas film of all time and one if the greatest films of all time period. Timeless classic full of heart and joy absolutely love",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely film.\n\n'It's a Wonderful Life' is enjoyable, hearty and well crafted. It takes longer than I would've predicted to get to 'the event', but it's very much worth seeing the journey that comes before - as we see the arc of James Stewart's George. It all crescendos with an ending that you can't help but smile at.\n\nStewart is excellent in the lead role, you really do see every single emotion that his character goes through. He is, by far, the standout performer, but there are of course good performances from the likes of Donna Reed (Mary), Lionel Barrymore (Henry) and Henry Travers (Clarence).\n\nI did notice a few weird cuts in there, not that I hold that against it or did it affect my enjoyment - it's just noticeable. I see, via other reviewers, that there's a colour version - Channel 4 showed the black-and-white version over here in the UK. I can't say I felt the need for colour, which is always a good sign.\n\nWholesome. Not that it, evidently given the average rating, needs to be said by someone like me, but: I'd certainly recommend this.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest Christmas Movie of all time. If its close to Christmas time it's worth watching it every single year.",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Doesn't get much better than this when it comes to Christmas films...can't believe it took me so long to finally experience it. I need more James Stewart in my life!!!",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though I checked my watch a few times, this movie is very good. This is definitely one of, if not the best, Christmas movie of all time. The plot is well developed, the cast is great in their roles, and I loved the alternate-universe scene, which is one of the iconic movie scenes of all time. Honestly, I don't understand why it took me 15 years to watch it.",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My all time favorite movie is also the best Christmas film.  Annual viewing with yearly tears.  Treat yourself to a good cry!",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily the most acclaimed Christmas movie, Wonderful Life holds up pretty well for being from 1946. The movies themes of helping others and our purpose in life still ring true today. They don't make a lot of movies like this anymore, but they should.",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic! Great on the big screen!",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie !! My all time favorite Christmas movie a must watch every Christmas season !",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every time I watch this movie, I can't help thinking of Dicken's  Christmas carol. Yes, the story, with it's modified elements, is different from the Dicken's classic, but the narrative is really telling you, this is an alternative version but instead of the main character confronted with several spirits, George Bailey has a visitation from one...celestial being , a guardian angel named Clarence. The setting: It's Christmas...snow everywhere, although, Scrooge has been relegated from the main character down to the mean swindler Mr Potter, George Bailey's epiphany at the end of the movie is almost identical in it's jubilation to the spirited Mr Scrooge at the end of A Christmas Carol. \nI wouldn't say it carries the same depth and integrity as A Christmas Carol and as a film, very dated in it's social predicament of the 1940's but still a very watchable and emotionally fulfilling movie.",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie with a good message of how we should love what we have instead of having what we love.",
            "review_date": "2020-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a wonderful film. Yes, It's a Wonderful Life is a wonderful film for many reasons. A beautifully written storyline highlighting the noteworthy events in the life of an ordinary man who slowly morphs into a town hero. The performances from James Stewart, Donna Reed, Lionel Barrymore, and Henry Travers are well done. A wonderful idea was to have a guardian angel by one's side made this film very emotional in a good way. To top it all off, the ending is one of the most heartwarming. Especially all the sacrifices George had to make and dreams he had to abandon for the sake of others happiness, safety and protection. It is really nice to see him get helped out in return.",
            "review_date": "2020-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally enjoyed it. Had never seen before. Wished the crying little children were not there.",
            "review_date": "2020-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas classic that has stood the test of time and will live on for Multiple decades to come.",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it all my life! extra special on big screen",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Xmas movies I've seen. Great message.",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still the best Christmas movie ever. Wish they would colorize it. The drive -in was spectacular. Well organized with good popcorn and clear screen. Fun and safety for the whole family.",
            "review_date": "2020-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas classic. But for people of the modern era, many may find the tone of this movie to be extremely corny. And it is, it makes the movie feel pretty silly sometimes. But it wasn't exceptional for the time, so it's alright. The main highlight of this film is the great and powerful performance by James Stewart, alongside Donna Reed. They were great in this film. The first half can actually be a little too much of a slow-build. But in the end, It's a Wonderful Life can be an uplifting and beautiful movie. Overall, it's a good Christmas flick, and I recommend it for the holidays!",
            "review_date": "2020-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great tale to keep the people you care about close to you no matter what life throws at you. ",
            "review_date": "2020-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Angels won't get their wings if you have not watched this one in your lifetime..",
            "review_date": "2020-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AFI 100 Greatest Films - #11: Another classic from the \"how have I never seen this category\", and despite being fully aware of many plot points and characters due to the prominent place this film still holds in popular culture, the story felt fresh, absorbing, and was surprisingly moving emotionally. Jimmy Stewart gives another banger of a performance and the universal relatability he brings to the role of George Bailey is likely a large reason for the timeless adoration his character has received. Definitely creates warm, positive feelings inside, even without the nostalgia effect, so I can't imagine what this film does for those who've grown up with it.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So much happening! Movie get better every time see.  (See silver skull on mean man desk?  Is mean \"foreshadow.\")",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Five stars all the way.  Got To be high in anyones top movie list of all time.",
            "review_date": "2020-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a wonderful movie. Only People named Potter from places like Pottersville could possibly disagree.",
            "review_date": "2020-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just the most wholesome film ever 😂",
            "review_date": "2020-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was bored to tears with this movie. The Christmas tree that they had was the best part of the picture.",
            "review_date": "2020-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true classic. One the best movies ever made, IMO. Will never get old. ",
            "review_date": "2020-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending is very heart warming. The build up to when George came to beg Potter is excellent. Despite all that, I'm not very convinced by how George came to change his mind and didn't want to commit suicide any more. Somehow his wish of stop living got turned into not having ever been born. Anyways, I can imagine how this movie can be a go to for a Christmas night.",
            "review_date": "2020-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well acted but the story is just too darn depressing.",
            "review_date": "2020-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a book and concidered a Christmas film (though not really Christmassy) this film is one of my personal favourite 40's films alongside The Third Man. James Stewart was a fantastic actor and really shows it in this masterpiece of cinema.",
            "review_date": "2020-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jeff Barnes \n12/21/18 \n\n\nIt's a Wonderful Life Review \nIt's a Wonderful Life teaches us a lot about life with teaching us how to go about living our lives such as with improving our lives. It's very relatable with having characters that we can relate to particularly the character of George Bailey. James Stewart tops this off with an excellent performance. It does however have a fair amount of flaws.  \nIt's a Wonderful Life is about a down on his luck businessman who looks more at the negative aspects of his essence rather than the positive aspects of his essence. He looks at the negative aspects so much that he contemplates suicide however an Angel from heaven named Clarence saves him from doing so. \nGeorge has plenty of financial problems with the town he lives in Bedford Falls and this comes from a bank owner by the name of Henry Potter who not only wants to do whatever it takes to own everything in Bedford Falls, but also wants to do whatever it takes to own all the money in Bedford Falls even if it means enabling people to live poor in slums. Mr. Potter reminds us of our selfish side or can relate to anyone who's just flat out selfish because he's willing to do whatever it takes to make himself satisfied, and it's said or believed that this is the only way to have fulfillment in life, but we don't have to always be selfish in order to have fulfillment in life we can be selfless, and this is what George Bailey represents. \n\tGeorge saves his brother Harry from drowning which leads to him giving him his money and this leads to him playing college football and shooting down many fighter planes and saving men from a transport during World War 2, which also leads to President Harry Truman awarding him the congressional medal of honor, and what this teaches us is that we can change the world for the better by being generous. George also gives out loans to good friends of his such as Violet and Tom and this instills us that we should be more generous than egocentric if we want a friendship to last for a long time or even forever. \nGeorge does another devoted act by using Potter's money to turn a graveyard into a town with tons of houses called Bailey's Park, and what this proves is that we can improve our lives by being noble towards others because it makes us more likeable and because it can enable people to be noble to you by improving your life. An example would be at the end of the film when all of George's friends and family end up giving his wife and kids money, they had left over because of how generous he was to them by giving them money. \nGeorge however looks at the negative aspects more than the positive aspects of his life with his financial problems and this leads to him forgetting all the good that he has done and pondering over suicide, and this leads up to his guardian angel Clarence showing him what the world would be like if he had never existed, which leads to the Bailey's Bros Building and Loan Association going out of business and his brother Harry dying at the age of 9 because he wasn't there to save him from drowning when he was a kid, and this leads up to him not becoming a war hero and receiving the congressional medal of honor. George's wife Mary has never married and perhaps this is because her one and only true soul mate was George, and what this teaches us that if we ever ponder or are about to commit suicide god forbid, we should think more about the positive rather than the negative elements of our lives and all the good we've done as opposed to all the bad that we've done or all the problems we've had.\n\tThe character of Violet reminds sophisticated and popular people of themselves because she's not only nice looking, but she dresses nice as well, and in fact there are men who stare at her as she walks down the street, and this reminds me of when the character of Ilsa in the film Casablanca walks in the nightclub with her husband Victor and men stare at her and the character of Renault comments on her beauty as does George comments on Violet's beauty in It's a Wonderful Life.\n\tJames Stewart really makes George Bailey come alive with his performance by adding lots of vigor, intensity, and strength to his voice especially in the scenes in which he has disputes with Henry Potter such as when he wants the people in Bedford Falls to live in decent homes rather than in slums, and when Mr. Potter offers him $20,000. He also adds a great quantity to his facial expressions exclusively during the scene in which Potter is talking to him in his office, and he squints his eyes as he looks at him as if he certainly despises him, and he looks down in shame when Potter tells him his weaknesses. There is also a scene worth mentioning when he gives George a very perplexed, shocked, and confused look on his face when he finds out his mother in other words his own flesh and blood doesn't recognize him in the world in which he doesn't exists, and during this scene there seems to be more emotions going on in his face than I can even describe.\n\tIt's a Wonderful Life despite these strengths has a fair amount of weaknesses such as with plot holes with it never being explained as to why there's a bunch of animals in the Bailey's Bros Building and Loan Association such as a crow, squirrel, dog, and owl. It's a Wonderful Life is also disappointing with the case that none of the other performances in it are memorable, and the only memorable performance in it is that of James Stewart's performance his performance is so memorable that we wish the other performances in it were just as memorable or more memorable. I highly recommend It's a Wonderful Life despite having a fair amount of flaws and give it a score of a 9 out of 10.",
            "review_date": "2020-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas classic toatal",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great classic movie!",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Takes a long time to get to the point. Very schmaltzy but a few good parts to the film. No one seems to age in the film weirdly. Hated the ending.",
            "review_date": "2020-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a great Christmas movie.",
            "review_date": "2020-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly, to this day still, the best movie of all time.",
            "review_date": "2020-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing movie which will make you think about all of the things that are important to our life, things that we couldn't live without, but things we forget that are important in crucial situations. Also fantastic theme about existential choice, amazingly transformed into one of the best movie of all time.",
            "review_date": "2020-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genuine empathy for our morally driven protagonist and \"what might have been\" within Capra's resolutely tender treatment of the ideal everyman, coupled with the terror of unfulfilled potential, allow this classic to avoid becoming saccharine. While Capra's optimism may not strike as much of a generational note among today's audiences, this one still pulls at the heartstrings. (4.5/5)",
            "review_date": "2020-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This absolute classic is one of my favourite films ever. It has a beautifully created Christmas spirit, and it really pulls strong emotions for certain charactes and the company. Great film , must see.",
            "review_date": "2020-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thee best movie. Period.",
            "review_date": "2020-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the ultimate Christmas classic, this film is an existential look at the value of life, family, love, charity, and effort. Jimmy Stuart's performance as George Bailey is timeless. Every moviegoer should give this film at least one chance.",
            "review_date": "2020-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was not expecting that whole universe galaxy scene. Very creative and imaginative the way they filmed it. I almost can't even believe they would think up something so original like that especially for back in the 50's. This Potter character is the devil. He's so greedy, unempatheic and only looks out for his money. Doesn't care about people. The perfect characteristics to make it as a cold hearted business man. \n\nIncredible how selfless and giving George and his family is. He had $2000 that he was going to spend with his wife vacationing and having a good time. But instead they used it to help the people get there loan money back. It's very inspirational this movie. And it's so unfortunate and frustrating that every time something wonderful is happening in George's life, Potter always has to stick his devilish hands and ruin everything.\n\nDonna Reed seems so sweet and charming. That scene where they had there honeymoon in the old house that they threw rocks at was very heartwarming and sweet. Amazing WWII footage that they used. Potter is the devil. It's because of people like him that people have to struggle just to make ends meet. It's why people end up being miserable with there lives. \n\nI love the concept of angels in this movie. The visual concept of angels as human form but also as galaxies and stars in the universe is really beautiful. The concept of being able to see what life would be like if you were never born was powerful and impactful. But also a nightmare as well. \n\nThat ending had me crying like a baby. My nose even started running. What a wonderful movie with such a timeless and beautiful message. Incredibly written, beautifully shot and impeccably acted. Undoubtedly charming, sweet and funny while wearing it's emotions right on it's sleeve. This movie just goes to show that you don't need to live a rich and expensive life to live a wonderful life. \n\nThis is officially one of my favorite movies of all time.",
            "review_date": "2020-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[MASTERPIECE] I am fairly certain that anyone with a heart cries at the end of this movie, and I am not afraid to say I cry multiple times whenever I watch this movie. It is, without a doubt, the greatest of all holiday movies. This movie gives me hope in the darkest of times, and is probably the most uplifting film ever made.",
            "review_date": "2020-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Christmas classic. One of a kind",
            "review_date": "2020-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Stewart's performance is incredible in this timeless classic. Essential viewing, and especially around late December.",
            "review_date": "2020-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoy watching this every Christmas.  This year our local theatre played it.",
            "review_date": "2020-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So thankful for Flashback Cinema!! Now all three generations of our family can see these wonderful classics on the big screen.",
            "review_date": "2020-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the common consensus, I don't think the movie aged well. The early events are hard to follow and the movie takes forever to reveal it's point. One saving grace is that James Stewart's acting is still great to watch.",
            "review_date": "2020-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can you say about this movie that hasn't already been said? I can't think of anything. Just know that if you haven't seen this movie before... you have a giant hole in your life. James Stewart is delightful and It's a Wonderful Life will always be one of the best movies of all time. Even if it does take a lot from Charles Dickens.",
            "review_date": "2020-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It speaks to you if you're having anger issues with family. The sequence towards the ending was really heartbreaking. One of my favorite Christmas films.",
            "review_date": "2019-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Christmas movie by excellence. James Steward gives a moving performance in a story that'll cheer you up, give you goosebumps and make you laugh and cry.",
            "review_date": "2019-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its sooo much better on the big screen!!",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic I watch every year! We need more old movies re-released (not remade!) and showing regularly in the theatres!",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of if not the Greatest Christmas movie ever.",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked that it was shown in black and white even thou your ad poster was in color.  Thank you for the chance to see these great old movies the way they were meant to be seen, on the big screen.  Love these.",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After watching this film again for the Xth time on Christmas in 2019, I must say this is one of the best holiday classics of all time. Its message is timeless and a great reminder of the importance of family, friends, and, most of all, the \"Wonderful gift of Life!\" It's an absolute must-see for anyone, especially those seeking some warmth in their hearts at Christmas!",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching It's a Wonderful Life has been a family tradition for many years. Getting to watch it on the big screen was a dream come true!!!",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thanks for showing the classics!!!",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic! So we'll done for a film made in the 40s",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "by far one of my favorite films. seeing it on the big screen made viewing amazing.",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie that stands the test of time.  We were luck enough to see it with a few people in the theater that never saw it before.",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily my favorite movie of all time, there's not even a close second. \n\nThis timeless classic is superbly written, acted and directed.",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless classic! I loved seeing in on the big screen",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a world of depravity, where every virtue has been turned into a character flaw, and every vice into a blockbuster hit,  this movie stands the test of time. Here there is dreaming and longing, here there is disappointment and adversity, and here there is the answer; God, family, and friends. Had this movie been made today, George Bailey would have concocted some scheme to make millions in the stock market or real estate or what have you, or it would've turned into a social justice rant on the evils of crony capitalism, Blah blah blah ad nausea um. It's a Wonderful Life is the antidote to the cynicism of today",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Jimmy Stewart's finest acting performances! It's all here. Deep abiding love for family and community, desperation, fear, greed and above all hope that succeeds when all else has failed. One for the ages.",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Christmas movie ever.",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute classic xmas movie",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a great movie. Most people have seen this many times around xmas. I've only seen it once, but after all the hype, I was not disappointed, and that counts for a lot.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seasonal affective disorder hits George Bailey hard and he decides to cash in on his life insurance early. After a quick stop into the Twilight Zone he helps an angel get his wings and remembers spring is only a few months away.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A message we all can relate to done in an uplifting way and performed by the best actors in the business!",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful classic which is always a pleasure to watch but especially around the Christmas holidays",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only one of the great Holiday movies, one of the greatest movies ever.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We always love to see Its a Wonderful Life!  We LOVE that movie!",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply put a classic!",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So happy we were able to see it on the big screen!!",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorite Christmas movies!  One of my all time favorite movies!",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great timeless story.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it never gets old and i cry every time !",
            "review_date": "2019-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We enjoyed the movie. the only thing that was wrong was the lights in the theater were on during the last 10 minutes of the movie.",
            "review_date": "2019-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing that after all these years this movie still holds up and a great message. We could use more like this and even better on the big screen!",
            "review_date": "2019-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie!  have watched it at home and this was the first time on the big screen, highly recommend doing that if you like the movie.",
            "review_date": "2019-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic.  Great Christmas movie.",
            "review_date": "2019-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you haven't yet seen this movie...\nAnyway, seeing it again this season and thinking about the difference it sets forth of those who worship wealth & money and those who choose instead love & honor.  The Potters of the world (ironic name that - what art thou but a maker of pots?) do not see human beings but only financial assets or burdens;\n\"to my father they were human beings - but to you, a warped, frustrated old man, they're cattle!\"\nThe Potters do not show mercy when mercy is necessary, or compassion when it would be the right thing to do;\n\"have you put any real pressure on these people?\"\n\"Mr. Potter, these people have children.\"\n\"well they're not my children!\"\nThe Potters do not act in an honorable or even reasonable way;\n\"somehow I've misplaced $8,000 dollars\"\n\"you've misplaced?\" (he looks at his steward knowing it was Uncle Billy and not George who was at fault)\nThe Potters like to twist the knife once it's in, causing pain and agony towards others;\n\"Look at you. You used to be so cocky. You were going to go out and conquer the world. You once called me \"a warped, frustrated, old man\"! What are you but a warped, frustrated young man? A miserable little clerk crawling in here on your hands and knees and begging for help....I'll tell you what I'm going to do for you, George. Since the state examiner is still here, as a stockholder of the Building and Loan, I'm going to swear out a warrant for your arrest. Misappropriation of funds, manipulation, malfeasance...\"\nThose that pursue money, though, live in great fear too - fear of being found out, fear of not making the grade, fear of never having enough.  To measure all things by their financial worth is to be\n\"cooped up for the rest of your life in a shabby little office...\" \nto deal with the \"business of nickels and dimes and spending all your life trying to figure out how to save three cents on a length of pipe...\"\nThe movie may seem a bit romantic, echoing that Beatles' line of \"all you need is love\" but it also seems to echo the older maxim from 1 Timothy that \"the love of money is the root of all evil.\"  \nGeorge Bailey, a good man with noble dreams, consistently chooses the honorable path of self-sacrifice; but surrounded by a world that views money as the only defining factor (the scene of the '29 crash for instance) he eventually becomes resentful, fearful, and desperate teetering on the brink of real despair and losing the vision that, rich or poor, his little family loves him.  It takes a near-death event and the intervention of a silly little angel to cleanse the doors of his perception.  \n\"There must be an easier way to get my wings.\"\nThus this is the quintessential Christmas movie - not b/c of the singing of \"Hark the Herald Angels\" or b/c of the setting at Christmas time or the snow or the little town charm, but b/c the birth of the Christ child in our own hearts is a perennial event.  Bedford Falls is the world stage itself and the actors play out the drama of the human heart as it perpetually wrestles with despair.  \"Behold,\" says the Lord, \"I make all things new!\"  And indeed, the birth of the Christ Child at this season symbolizes the cleansing of our own vision away from that enslaving view that the world is a shabby little town in which the only answer to life's questions is to acquire more money, more power, more worldly gain.  The Advent prayer from Revelation \n\"the Spirit and the bride say, Come. And let him that heareth say, Come.\"\ndefies this dark vision and in a similar way George Bailey, having seen what the world without him looks like, returns in joy to his rollicking children, his drafty old barn of a house, and the love of his wife - only to find that no man is a failure who has friends.  Amen, come Lord Jesus.",
            "review_date": "2019-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a Wonderful Life has an unforgettable climax that sends a good lesson to audiences of all ages and has cemented itself in the minds of everybody who's seen either the movie or a video that spoofs the concept...and the rest of the movie that preceded it was pretty good too. Yeah, I was surprised that the iconic finale doesn't occur near the very end but fortunately there was such a well-done buildup to it that I didn't even complain. The acting is great, Frank Capra's direction is great, the cinematography is great, is there any reason why this isn't considered a Christmas classic, despite no Christmas decorations showing up until we're near the third act? You easily sympathize with George Bailey. The guy wishes to travel the world but he never does and it ends up taking his toll on him since he's trying so hard to make everybody else happy he feels like its come at the expense of his own happiness. The movie does show that those acts of selflessness mean that, if it weren't for somebody intervening, peoples' lives could've been much worse. I doubt my review will stand out amongst anybody else's, which is why I find it impossible to say anything anybody likely hasn't said already so I'll just tell you this: you haven't watched It's a Wonderful Life? Well, then, what are you waiting for? Next Christmas? Just remember that the iconic moment doesn't happen until near the very end and most of the movie is buildup towards it. But it is really good buildup.",
            "review_date": "2019-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic, as entertaining today as it was decades ago.",
            "review_date": "2019-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was awesome to see our favorite movie on the big screen.",
            "review_date": "2019-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect all the way. Tons of history, great acting and a heart warming message. All of us have an opportunity to live a life, which affects many. Live a good life no matter what hand you're dealt and you will be remembered well.",
            "review_date": "2019-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love it. Live it. America.",
            "review_date": "2019-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "too depressing, didn't finish it.",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the movie since it shows the value of relationships in life",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see every year great classic",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of 5 movies that made me cry.",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was thrilled to be able to watch Its a Wonderful Life in the theater.  Thank you for showing it at Christmas.",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is as classic as a movie can get. Not just a great Christmas movie, a great movie period. Simpler times, good people, doing things the right way, not perfect, but always the right way.",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the movie and atmosphere in the theater! The experience was great from entry to exit! Very efficient picking up tickets at customer service and friendly staff!!",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film did start out a little slow but once it ended I was really glad to have watched it. It is so \nuplifting.\n\nGrade: A",
            "review_date": "2019-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is my favorite Christmas movie. It was great seeing it on the big screen!!!",
            "review_date": "2019-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BEST holiday movie ever!!",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Part Christmas Carol, part Twilight Zone all masterpiece. Cinema's original everyman, James Stewart in a Capra-corn classic centering on a disillusioned man finding out what the world would be like if he'd never been born all on Christmas Eve.",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was wonderful to see this classic movie on the big screen! I notice so many details that I never seen watching it on TV.",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The theater was fully  packed you can hear a pin drop. It was one of the best shows on the big screen that Ive joyed in a long time. This movie should play every single day so every single person could watch it and see what the true meaning of life is all about.",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To the 5 critics who gave It's a Wonderful Life a negative review: who hurt you? Is it just too happy and sweet? I honestly can't see any human being justifying not enjoying this must-see Christmas flick. I'll admit it, I am a little biased considering this is my favorite Christmas movie, but for very good reason. The emotion inducing dialogue executed by the great cast led by Jimmy Stewart just makes me ball my eyes out every time I watch it. It is so hopeful and is such a feel-good movie that makes you sad for a while then ultimately happy that there may just be people like George Bailey out there in the world. Still over seventy years later no other film has been able to surpass the quintessential holiday movie that is It's a Wonderful Life.",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this timeless classic with Jimmy Stewart and Donna Reed.  It's the perfect Christmas movie.",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the classic Christmas movie!  We had only seen bits and pieces.  Great story for the season.",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun to see a great old movie on the big screen",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful story about one man's life and how much one person touches so many others.",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its an awesome movie. Its my favorite Christmas movie",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great classic movie!!! Loved it.",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming. Almost brings tears at the poignancy of the final scene.",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the message, honestly heartwarming!",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s a classic, no need to review.",
            "review_date": "2019-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie.  Classic!",
            "review_date": "2019-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watched for the first time. Far and away the best Christmas time movie I've ever seen and believe me, I have watched ALOT of Christmas classics. Would strongly recommend for the whole fam. Great ending and storyline. They sure don't make movies like this anymore unfortunately.",
            "review_date": "2019-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful classic movie!",
            "review_date": "2019-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would rate it more if I could!  Love the showing of the classics on the big screen!",
            "review_date": "2019-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It needed to be full screen",
            "review_date": "2019-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing like watching a classic black and white movie on the big screen.  You see things you never saw before and it's lovely and new.",
            "review_date": "2019-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant, thank you!!",
            "review_date": "2019-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review: \n‘It's a Wonderful Life' is a Christmas fantasy-drama film directed by Frank Capra. It's based on the short story and booklet ‘The Greatest Gift' by Philip Van Doren Stern.\nThis movie is why I always say the ending to a movie is the most important part. I didn't classify this as a Christmas movie, nor was I 100% invested in the story until the final act of the film. I loved it!\nThe film stars James Stewart as George Bailey, a man who has given up his dreams to help others, and whose imminent suicide on Christmas Eve brings about the intervention of his guardian angel, Clarence Odbody (Henry Travers). Clarence shows George all the lives he has touched, and how different life in his community of Bedford Falls would be if he had never been born.\nI honestly can't talk about the acting being good or bad, it was a different time back then and you really can't judge. I will say that I love James Stewart and I know what he can do and what he usually does. This was a different role for him to take on and he did a great job.\nThe story really doesn't pull you in, and it's not the most exciting. The movie does a good job at creating a protagonist that you are rooting for in the very beginning. You want George Bailey to succeed and travel around the world, but he always puts others before himself, until he feels he just can't do it anymore. The ending of this movie is brilliant and breathtaking. I found myself in tears by the end and it really captures that if you have friends you're never truly alone. I don't really consider this to be a true Christmas movie, being the ending is the only part where Christmas is even mentioned.\nOverall, the movie is a heartwarming story that should be watched at least once in everyone's lifetime.\n4/5",
            "review_date": "2019-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true Christmas classic!",
            "review_date": "2019-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a major blind spot in my film knowledge as it is considered the most iconic Christmas film of all time, at least in the United States, and is frequently referred to in discussions I have had with other cineastes. One of my worries was that the film had been built up so much in my mind that it could not possibly match up to my expectations when I finally saw the film. I had enjoyed the films of Frank Capra in the past as It Happened One Night (1934) is one of the greatest romantic comedies ever made and the somewhat overlooked today You Can't Take It with You (1938) and in that way I did not like this film quite as much as I wanted to. It is a fine film considered on it's own merits but don't be too taken in by all of the hype as it may disappoint just slightly.\n\nGeorge Bailey, James Stewart, plans to leave the small town of Bedford Falls, New York to travel to other countries and then study but he is forced to stay after his father dies and he is forced to run the bank they own. He has met and fallen in love with former classmate Mary Hatch, Donna Reed, but his commitment to work and rivalry with the evil Mr. Potter, Lionel Barrymore, who drives up prices on property and intends to enslave the town leaves him feeling sad. When his brother, who was meant to take over from him, is married and offered a better job Bailey is resigned to the fact that he will spend the rest of his life in Bedford Falls. He is married to Hatch and has multiple children with her but struggles to keep the bank financially solvent and a blunder that his uncle makes leaves him broke and vulnerable to the possibility of criminal conviction. This leads him to consider committing suicide but the intervention of an angel causes him to appreciate what he has.\n\nI suppose the wonder of the film is that it is able to take dark issues like suicide and financial struggles and tie them into a film that is made to appeal to a wide audience of children and adults. The moral struggle that Bailey faces is genuinely difficult and most adults can relate to giving up many of the dreams they had as youths to take care of their families or responsibilities passed down to them. The pain of seeing another, young version of yourself, in this case Bailey's brother, getting to achieve the dreams that you had is also a painful moment that rings true. What Capra does that is so fantastic, as he does in all of his films, is balance these darker elements with light comedic moments of slapstick or cheesy verbal gags. There is also the sweetness of the central relationship between Reed and Stewart which buoys the film and while at times Reed feels like too much of a good thing we are willing to forgive this because she is exceptionally good as the ideal woman. There is somehow not the overload of sentimentality that exists in some of Capra's lesser films as there is a brilliant balance to this film and even the most cynical are likely to be won over by it's charms.\n\nStewart makes a warm, likable lead and is totally convincing as the family man but he also gets a chance to do some serious dramatic work here as he is convincing as a hardened, embittered man for a brief stretch in the film. As previously stated Reed is excellent as the dream girl with her naiveté and total infatuation with Stewart in early scenes endearing us to her and her steady support only allowing our affection for her to grow. Barrymore is cast against type as he is the antithesis of Grandpa Martin Vanderhof and uses his persona as a cute, cuddly older man to shock the audiences and it is uncomfortable to find ourselves hating him. The only thing the film is missing is Jean Arthur but Capra does make sure to include Gloria Grahame playing to type as flirtatious floozy.\n\nMost will find themselves loving this film and it is a decent choice if you are looking to occupy two hours of time but as much as there is that is good about it I was never really wowed and it felt far too long.",
            "review_date": "2019-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THE classic. \nThe grand themes of life, love, and despair all housed in a Christmas film. But it's much more than a Christmas film. It's life-inspiring. Even after 30 or more times seeing it, I still want to watch it every year. Maybe twice this Christmas.",
            "review_date": "2019-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a wonderful classic film. Love seeing this at the holidays!",
            "review_date": "2019-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An annual Christmas treasure I never miss. The holidays are incomplete without George & Mary and the  quaint characters of this film classic.  🎞 I discovered it over 30 years ago by accident, and it still warms my heart and brings me to tears. \n \nTwo heartfelt thumbs up! 👍 👍",
            "review_date": "2019-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie that can be added to holiday tradition.",
            "review_date": "2019-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch it yearly...Love it",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this as a kid... I love it even more as an adult.  Quite possibly the single most important movie to see about appreciating life and realizing how important each one of us are... no matter how insignificant you may feel you are.",
            "review_date": "2019-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still holds up well.\n\nJimmy Stewart is the best....and always will be.",
            "review_date": "2019-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Christmas classic. Must watch movie once a year.",
            "review_date": "2019-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful, thematic, and brilliantly assembled for its time, Frank Capra’s Classic Christmas tale remains one of the most revolutionary films in cinema history with Jimmy Stewart at his peak.",
            "review_date": "2019-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most wonderful film of all time. It's a Wonderful Life showcases outstanding cinematography, important themes, and beautiful messages that mark it as the clear definition of a holiday classic.",
            "review_date": "2019-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a wonderful life combines multiple elements to make a Christmas classic with a very important message.",
            "review_date": "2019-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this in high school.  Rewatch warranted.",
            "review_date": "2019-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a Wonderful Movie. ",
            "review_date": "2019-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this movie a couple of times in my mid-teens, and if I'm being perfectly honest didn't get why people liked this movie so much. I thought it was fine, but I didn't understand the overwhelming love.\nWell, after being thrust into the real world after graduating high school, taking five years to put myself through community college, coming to terms with the unlikelihood of achieving my ambitious dreams, and making mistakes along the way... yeah, I get it. It's a Wonderful Life is exactly what I needed, and it claimed another viewer to cry their eyes out with a beaming smile across their face.\n\u2028I loved it!\u2028\n9/10",
            "review_date": "2019-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a Wonderful Movie!  Jimmy Stewart's Everyman finds redemption and discovers it right under his nose.",
            "review_date": "2019-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mr. potter should of hired a hitman to solve his problems",
            "review_date": "2019-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most boring idiotic movie ever",
            "review_date": "2019-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You do know this film is an advert for socialism and a warning about capitalism? If you want to praise it, bear that in mind. It shows in stark clarity that the greed engendered in the capitalist system ruins both the lives of its poor victims and the happiness of the exploiter himself, Potter, who (like, for example, Donald Trump) can never accumulate enough to be content. \n\nThis is not a feel-good holiday movie like something from Disney. \n\n\"It's A Wonderful Life is a movie about socialism and how socialist values can triumph over capital. It makes a more thoroughï¿ 1/2\"though at times subtleï¿ 1/2\"case for socialism than any piece of American popular culture I can think of and it contains as many lessons about solidarity and collective action as it does about the kind of holiday morality we usually associate with it.\"\nhttps://www.currentaffairs.org/2019/04/its-a-wonderful-socialist-life",
            "review_date": "2019-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You have to be real stupid to not love this movie",
            "review_date": "2019-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the greatest Christmas film of all time, and one of the best ever made. A timeless and touching story that's as wonderfully filmed as it is acted.",
            "review_date": "2019-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything you've heard is probably true. It's cheesy. It plays with your emotions. It gets pretty slow in some places. But after seeing this movie a million times every Christmas, I still end up blubbering like a sentimental fool at the end of it and loving every minute of it.",
            "review_date": "2019-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most inspirational film you'll ever see! Capra captures the core being of George Bailey with all the sacrifices made, tying it all together oh so brilliantly to create my favorite film of all time. An absolute must watch, and one of the greatest films ever made!!!!",
            "review_date": "2019-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While only about 25 percent of it is Christmas related, it's no doubt a swell feature during it's time.",
            "review_date": "2018-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent, powerful, and overwhelming Christmas movie",
            "review_date": "2018-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy Mackerel!\n\nWith its timeless inspirational message, groundbreaking techniques, unequalled storytelling, extremely clever and subtle use of imagery, unbelievably fluid shifting between contradictory continuously-changing tones, outstanding performances from the entire cast, and joyful and optimistic spirit, this \"Wonderful\" piece of cinema will always be the most charming, valuable and daring kid-friendly Christmas film ever!\n\nI'm sooooooooooo glad I finally watched this classic at the perfect time.\nMerry Christmas, Y'all!",
            "review_date": "2018-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartwarming 1946 Christmas tale of how goodness wins over greed. Starring Jimmy Stewart and Donna Reed, among others.",
            "review_date": "2018-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What amazes me is that this film was apparently not a hit when it was first releases.  Maybe it's the nostalgia or the sentiment of the story, but this film delivers on all accounts, on every viewing.",
            "review_date": "2018-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review\nGeorge represents the typical Male American Worker.\nHe started low at a store, but then worked his way up to become a banker\nHis love interest represents his muse his flame his desire\nThe great depression took a toll on his career and his family life.\nHis Guardian Angel was sent from God to guide him back home.\nThe Celebration of Christmas at the end represents Christ being born, the savior of the world, and his second coming.",
            "review_date": "2018-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How could you not give this one a perfect score? Find but a handful of movies lasting 72 years and worth watching every year.",
            "review_date": "2018-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s A Wonderful Life is a classic Christmas story. The love of family is everything & with the help of Clarence, George Bailey will be the wealthiest man in town. ",
            "review_date": "2018-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie helped me understand banking as a concept. ",
            "review_date": "2018-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A feel good film for anyone feeling down about their life. It’s A Wonderful Life is a pure holiday classic. ",
            "review_date": "2018-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This classic movie is kinda okay for me, but it’s a little bit boring until the good ending as reconciles of his family for Christmas. ",
            "review_date": "2018-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I’ve seen this 20 times in a theater and 15 times on DVD (no commercials), and in my unbiased opinion this is the greatest film ever made.",
            "review_date": "2018-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully crafted and scripted timeless classic with perfectly cast characters that make this an immensely rewatchable movie.",
            "review_date": "2018-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply a beautiful movie. The story, the acting, the characters... Everything that went into this movie was done properly. Possibly the greatest Christmas movie of all time. ",
            "review_date": "2018-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No way !  this is the biggest /worst xmass movie  EVER !!! PURE CRAP.  0 STARS . no how about  - 50 stars . makes me puke.",
            "review_date": "2018-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing classic that still is as relevant and important today!",
            "review_date": "2018-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A holiday classic that is really a gripping drama about one's man's life.\n\nIt's a Wonderful Life (1946) is director Frank Capra's masterpiece of humanistic drama. He revels into the simple pleasures of family, kindness, giving, and decency. While often played during the Christmas season, It's a Wonderful Life carries a timeless message of appreciating what you have in life. It remains a beautiful film and timepiece of how people can treat each other better just for the sake of doing the right thing.\n\nCapra's direction is marvelous. The black and white colors are so crisp and carefully lit with bright lighting around the faces and moody street atmosphere. There are multiple long panning shots down streets and around corners that remain impressive technical feats. The few special effects of fading a person in or out are seamless, while the heavenly framing device is a charming as ever. Capra knew how to depict a man's entire life scene by scene by showing only what was necessary to understand how this man came to want to end it all. The graduation dance party over the pool is as impressive a sequence as the memorable Great Depression episode is likewise.\n\nJames Stewart is the protagonist George Bailey, whom we follow closely from adolescence to adulthood. Stewart is fascinating as the relatable everyman. You like him and want him to succeed because of his decency, but empathize with his pain as it all comes crumbling down around him time and again. Stewart gives one of his best and most versatile performances in It's a Wonderful Life. From joy for dreams to agony for loss, Stewart displays everything he had.\n\nDonna Reed is similarly magnificent. She is as lovely and charming as any young leading actress, but so sincere in her love for George. You hope for her happiness and Reed demonstrates a playful, kind, loyal, and thoughtful wife as any man could hope to marry one day. Reed captures the magic of real love on film in It's a Wonderful Life.\n\nI really appreciate the many great supporting roles from the boy that portrayed the childhood George to Lionel Barrymore as the greedy and lecherous Mr. Potter. Thomas Mitchell is so sweet and fun as Uncle Billy like Henry Travers is so naively innocent as George Bailey's guardian angel Clarence Oddbody.\n\nOverall, It's a Wonderful Life is to be cherished as it is appreciated. It is a lively and entertaining film, but also particularly well crafted by the master Frank Capra. Give it a watch and see if you like it.",
            "review_date": "2018-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "been meaning to watch it for a long time. great classic film. superb message.",
            "review_date": "2018-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I seem to be one of only a small number of people who have seen this film, which for many has become a staple Christmas movie.\nI watched a decent colorized version of a film that was originally released in black and white back in 1946.\nThe colorization technology on recent restoration of old films is very good and I couldn't tell I was watching an old black and white film.\nI digress. Why has the film gained cult like status?\nIt stars James Stewart in the star role as a character George Bailey who has done good deeds throughout his life but now doubts his contribution to the world around him, making him contemplate suicide on Christmas Eve.\nA trainee angel, Clarence literally saves him and in a parallel time line makes George realise what life would have been like without his interventions.\nGeorge part owns a loan company which faces financial problems and the possible imprisonment of George unless $8000 can be found to pay off the shortfall. \nGeorge saves his brother's life for example in 1919. His brother as an adult is awarded the Congressional Medal of Honor for his bravery in the Second World War.\nWe see the actions of a greedy man Mr. Potter throughout the film. The opposite to George in helping the local towns population in owning their own homes. He comes across as an evil banker. Charging high rents for poor properties.\nIn the angel Clarence's parallel timeline the local town Bedford Hills is renamed Pottersville.\nThere is also a second story in the film. The angel Clarence is 'second class' and as yet has no wings. Saving George just may earn him his wings and elevate him to a 'normal' angel level.\nIn the end George's fate is saved as the townfolk raise the cash and Potter, who attempts to have George jailed sees his warrant ripped up.\nA feel good film with some excellent performances. \nStewart revelled in this kind of role throughout his film career.\nThe history of the film reveals copyright issues. Colorization issues as discussed and a top Christmas film that could really be watched at other times of the year.",
            "review_date": "2018-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time",
            "review_date": "2018-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most overrated movies of all time!",
            "review_date": "2018-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not originally released at Christmas, but a film that has become a classic, I make sure to watch it every year at some point in December",
            "review_date": "2018-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is an absolute holiday classic. It reminds one of everything important in life, and makes me all verklempt every time I watch it.",
            "review_date": "2018-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My absolute favorite Christmas movie!",
            "review_date": "2018-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies EVER made. An UPLIFTING movie?!?\nThis is about as depressing as a movie you could ever see.\nCompletely unrealistic, it sells itself off as a realistic story which is part of the problem - this movie states that unless you have had a great effect on many others your life isn't worth a dime.\nThe other thing is that this is the worst movie to see if you are lonely and struggling in life and DON'T have a wife and children who love you, and the whole town on your side, but you live in great loneliness; I wish this movie was never made. Jimmy Stewart was a fine actor, though not in this; Capra made some great movies (It Happened One Night, Mr. Deeds Goes To Town, Arsenic and Old Lace), but as celebrated as this is, this is not one of them. This is a movie to increase the suicide rate during the holidays. Best to avoid this one if you are struggling in life, if you are alone; this won't pick your spirits up. This should only bee seen by people who are happily married, with large families, tons of friends and financial wealth.",
            "review_date": "2018-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily the best Christmas movie of all time. It is the movie that I watch Christmas Eve every year!!!",
            "review_date": "2018-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This shouldn't just be watched during the holidays, this movie should be watched year round. It shows the life of a man who overcomes one of his biggest feats, himself. It allows the audience to step back and question whether they need to change. This movie truly is wonderful.",
            "review_date": "2018-11-07",
            "source": "rt",
            "lang": "en"
        }
    ]
}