{
    "rating": 9.3,
    "release_date": "1946-11-21",
    "num_reviews": 130,
    "genres": [
        "English"
    ],
    "summary": "Fred, Al and Homer are three World War II veterans facing difficulties as they re-enter civilian life. Fred (Dana Andrews) is a war hero who, unable to compete with more highly skilled workers, has to return to his low-wage soda jerk job. Bank executive Al (Fredric March) gets into trouble for offering favorable loans to veterans. After losing both hands in the war, Homer (Harold Russell) returns to his loving fiancée, but must struggle to adjust.",
    "reviews": [
        {
            "content": "The greatest war story in 02 hours: and 52 minutes!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the first film to deal with the issue of men coming home after the war and having issues adjusting to life, but probably the best or definitely one of the best, little to long, almost 3 hours, only fault I can see in this wonderfully acted film from the everyone in a very well casted film ",
            "review_date": "2023-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very much looking forward to the thrilling plot",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "William Wyler's The Best Years of Our Lives feels like it was a brave film for its time.  In the celebratory afterglow of the Allied victory in World War 2, three soldiers (Fredric March, Dana Andrews, Harold Russell) make their way home to their small town in the Midwest, only to find difficulty adjusting to civilian life due to physical and psychological issues.  It's a surprisingly restrained film as it delves into the interpersonal relationships of the three protagonists, the script filled with subtle observations and quiet commentaries.  Clocking in at almost three hours, it does feel a bit long at times, especially over the last hour where it teeters on the edge of becoming a soap opera but, despite being released over seventy years ago, feels more timely today than ever.",
            "review_date": "2022-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If any old motion picture deserves the character Classic or Epic, The best Years Of Our Lives truly fits the bill. It's basically flawless, and with several brilliant acting performances that feel way ahead of it's time. Everyone in the main cast deserves great honor, but it's amazing to think that Harold Russell earned an Academy Award for best supporting actor, the first non professional to do so. However, he also won an Academy Honorary Award, and is the only actor to have received two Oscars for the same performance.",
            "review_date": "2022-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of The Best Dramas I've Ever Seen. I was truly blown away at how modern, sincere and grounded this movie felt with a timeless message of As long As you find a reason to have hope for a better tomorrow it is worth enduring the challenges of today. The acting is incredible, never feeling robotic, forced, self righteous or overly dramatic which is amazing for a 3 Hour film. But rather presenting a very unbiased look at the Battle when Veterans return home. The cinematography is honestly some of the most clean & subtle work I've ever seen. Tons of simple Deep Focus Shots that focus on the actors expressing there concerns or showing the challenges they face (Most of them Mental Ones) to convey the struggles. In 3 Hours across 3 characters so many subjects are covered and I truly appreciated how the film never attempted to say there is easy solutions to all these problems. Every scene with Homer is so powerful.",
            "review_date": "2022-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"William Wyler brilliantly captures the social REINTEGRATION of the veteran\"\n\nThe best years of our lives, is a masterpiece for the melodramatic style that adheres to the complex themes portrayed in the film. Wyler is original in this aspect and does it extremely well, thanks to the different points of view that come together within the plot.\n\nThe credibility and realism stand out thanks to the tone and the deep look that is exposed in each aspect of the film, an achievement not by coincidence, since the actors work from a very different emotional approach from one another. The best years of our lives is still an important reference in cinema for its way of incorporating elements of everyday reality and using them as a counterpoint in the plots of each character.\n\n\"The best years of our lives is a magnificent tribute to the plight of millions of people as they rejoined post-war life\"",
            "review_date": "2022-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Years of Our Lives captures the true plight of World War II veterans better than any modern award winning film ever could. It's very earnest in its depiction of their lives and struggle to fit in back home. It also feels genuine and accurate due to the fact that it was released at the same time of its story.",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deserved multiple-Oscar winner!",
            "review_date": "2022-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even as a genius, William Wyler may be the most underrated filmmaker to date. This is one of the best films ever made, quite possibly THE best film ever made. If you haven't seen this, you're not a cinephile. You're not. And you suck!",
            "review_date": "2021-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The three main characters interact as if they are real soldiers coming home from a war. This movie seems to shed light on the way vets are treated when returning home. The scenes with Harold Russel made it hard to watch. Seeing the loveable Homer turn to isolation because of his battle wounds actually made me cry. Any movie that provokes this much emotion is a must see.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ahead of its time. PTSD. Great cinematography.",
            "review_date": "2021-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This classic drama educates about the issues & recovery of returning war veterans.",
            "review_date": "2021-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most movies of this vintage and era (early post World War II) are so formulaic and difficult to engage with, that this one stands out, despite its extended length.",
            "review_date": "2021-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a perfect film. So wonderful and beautiful and effective. A must see. If you know anything about anything you will know that this picture is top of the tops",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't expecting much and it did start off a bit slow, BUT it soon drew me in. The subject matter was hard-hitting and beautifully and sensitively played by the cast. A must-see",
            "review_date": "2021-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deep and emotional look at the difficulty our servicemen have returning from war and adapting to life at home. Wonderfully cast, and near perfect acting. A must see classic.",
            "review_date": "2020-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AFI 100 Greatest Films - #37: I had never even heard of this film until getting well into the AFI list, so was naturally quite surprised considering how exceptional the acting is and how well it tackles some very important, then unnamed, social issues that society still deals with today. I am willing to now call myself a Frederic March fan as I found him even better here, especially on his first night home, than I did in Jekyll and Hyde, which I first watched a few months back. Myrna Loy was probably my personal favorite here as I found her non verbal acting, just as captivating, and important, as the lines she delivered. Dana Andrews kept reminding me of other classic leading men so I was also surprised I was unfamiliar with his work, but Harold Russell is deserving of the most praise as a former serviceman who lost his hands playing a returning soldier with prosthetics, offering a large dose of humanity in his portrayal. I was pleasantly floored with how well this tackled the issue of PTSD, and so soon after the war ended, acting as a psuedo PSA in helping America to understand what our returning soldiers were going through, and needed, in order to successfully reintegrate into society. This one definitely sees a bump in my rating when viewed in the context of the era in which it was released.",
            "review_date": "2020-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless and warm telling of veterans struggling to adapt to domestic life after war. A bit predictable and soppy but you can't help but root for the likeable characters.",
            "review_date": "2020-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is one of my personal favorites. Rather than focusing on the combat the main characters faced in WWII, this movie focuses squarely on how different men and their families deal with scars both mental and physical. The use of amazing camerawork, a well-written screenplay, and robust characters make this movie an essential film in Hollywood's golden age.",
            "review_date": "2020-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Years of Our Lives was probably one of the first Hollywood pictures to depict post-traumatic stress disorder. The story follows the lives of three World War II veterans, Al Stephenson (Fredric March), Fred Derry (Dana Andrews), and Homer Parrish (Harold Russell) who have returned to their homes in Boone City. There, they are assigned jobs in banking, reapply as a soda jerk, struggle with marriage, and struggle with post-war trauma. The greatest parts were anything involving the hook-handed Homer Parrish, who practically stole the movie. William Wyler's decision to cast a real-life war veteran with no acting experience added a sense of honesty and authenticity as the film delved into his heartbreak and isolation. His fight to blend in with society and his shell shock interfere with his insecurities and hopes of marrying Wilma (Cathy O'Donnell). Al, while certainly wild at heart, knows how to shape his life and family. Fred, on the other hand, has let war occupy him so much that it costs his marriage and his old job as a soda jerk. Even though it leads to a conventional happy ending, The Best Years of Our Lives does a great job at capturing the honest, yet humble effects of American war veterans. Furthermore, I especially admire Wyler's metaphysical construct. \n\n(4 ½ Scrap Metal Propellers out of 5)",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well written and beautifully acted.",
            "review_date": "2020-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest war movie ever made, and just possibly the greatest movie ever made.",
            "review_date": "2020-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once a year it's an absolute must for me, usually memorial day.  very white bread and very real from that perspective.  clearly speaking from a baby boomer white girl. harold russell as homer parrish is amazing phenomenal a life history from a 1947 POV that is part of the soundtrack of my life ❤️",
            "review_date": "2020-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The balance between the relatively conventional romantic subplots and the radically unvarnished look at the reintroduction of veterans to American society is not always entirely cohesive, but The Best Years of Our Lives deserves credit for standing in stark contrast to the wave of popular nationalism (to some degree) in the aftermath of the Second World War. On a practical note, a few slipups in the editing process are notable in the film's first half hour, and the narrative subplots are not as consistent or fleshed out (March's role in particular feels relatively incomplete relative to those of the other two leads). Still, the popular influence of this film on the perception of the postwar environment cannot be overstated. (4/5)",
            "review_date": "2020-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If it had centered on the veterans struggles rather than on the unecessary American pride and sentimentalism, it might have been a really great film.",
            "review_date": "2020-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "William Wyler's 1946 film The Best Years of Our Lives follows the lives of three US servicemen as they return home after the Second World War. It's a simple premise, but one rich in promise, and the film realises this to good effect: there's a palpable vein of anger running through it about how countries treat their veterans that still applies today.\nThe story opens with three men meeting as they return to America, each to face different domestic situations and different problems. The common factor that unites them is that all their problems are due to long absence or their experiences during the war. Homer Parrish has to adjust to life with prosthetic metal claws after losing his hands; Al Stephenson returns to his family and his job; and Fred Derry returns to the wife he was married to only briefly before joining up. Robert E. Sherwood's screenplay, based on MacKinlay Kantor's novella Glory for Me, draws these characters well and the situations they have to deal with are wholly believable. Homer, despite not wanting people to focus on his disability, tries to push his girlfriend Wilma away because he feels that she would be better off without him. Meanwhile, Al's children have grown up and he has to get to know them all over again, whilst Fred discovers that the domestic bliss he hoped to return to is not all he thought it would be.\nThe characterisation is so well written that it is easy to empathise with all three men, and the other characters – most obviously the women in their lives – are equally believable. Wyler's tactic of assembling a cast that includes character actors pays off, with Fredric March and Dana Andrews giving excellent performances as Al and Fred. Myrna Loy – who plays Al's wife Milly – was probably the biggest star at the time, and whilst she gives an excellent performance her character's prominence doesn't reflect her billing at the top of the credits. In fact one of the most naturalistic performances in the film comes from Harold Russell who plays Homer: he was a non-professional actor who lost his hands in real life whilst working as an army instructor and is remarkable in his role.\nWyler's direction is exemplary: to create realistic mise-en-scéne, he told the actors to buy their own clothes and he built life-size sets, all of which enhances the realism. Gregg Toland's cinematography helps: as in Citizen Kane and many of the other films he worked on, he uses many deep-focus shots, which (literally) adds depth to the film. The scene in which Fred has a nightmare is realised purely through the combination of camerawork, the soundtrack and lighting, and similarly towards the end of the film close-ups, music and Andrews' facial acting effectively and economically convey the emotions that Fred feels as he recalls the war when he climbs into a cockpit.\nThe quiet rage about the treatment of veterans is simultaneously underplayed and powerful, whether banker Al is defying his bosses by approving a lone for another veteran without security, or Fred is punching an obnoxious customer who tells Homer that he lost his hands for nothing since America should have fought on the side of the Nazis and the Japanese against the Communists. There is great compassion and understanding of the characters as well, as demonstrated by the genuinely touching scene when Homer tries to make Wilma realise what life with him would be like by showing her how he takes his arms off. It doesn't work: she simply fastens his pyjama top buttons for him and tells him she loves him.\nThe Best Years of Our Lives is a powerful, elegant film that is possibly William Wyler's best motion picture. It is little surprise that it won the Academy Award for Best Picture and that – unlike some Oscar winners – it remains highly regarded by critics.",
            "review_date": "2020-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In 1947, the Oscar for Best Picture went to \"The Best Years of Our Lives\". All in all it received 8 Oscar nominations, and won 7 of those. The film was released just one year after the end of World War II, and it follows three veterans as they return from battle and reintegrate into their families and their public lives.\n\nWhile slightly dated (no one curses, and sex is only alluded to) this is a fantastic film that never once attempts to justify or condemn war, instead it just unfolds all the ramifications that result from one. And it does so amazingly. It is unflinching in showing not only the adoration of those that serve in battle, but the animosity that many have for the elevated adoration soldiers receive. The inner workings of relationships and marriages are spread bare in a manner typically not shown in films of this period.\n\nAll three primary characters are continually on the run not only from what they experienced in war, but also from the evolution and growth of their families and friends during their absence. The conflicting duality of both things leads each of them to an agonizing stage of loneliness, despite being surrounded by familiarity. The film also does an exemplary job of demonstrating that compensation and suffering are shared experiences not only of those in the military, but for those that remained behind.\n\nFrederic March, Dana Andrews and Harold Russell (a real life double amputee) are all wonderful as the returning veterans, but the film is carried equally by Myrna Loy, Teresa Wright, Virginia Mayo and Cathie O'Donnell. Despite being almost 3 hours long, there is not a wasted moment of screen time.",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very honest and engrossing movie. From an excellent cast including stand outs Harold Russel, Mryna Loy and Teresa Wright. The movie is a tad too long but its well directed and has many moments that i will remember. With an excellent script which at terms is thought provoking and challenges us to understand how hard it is to settle back into normality after fighting in a war. Russel deserved his best supporting actor Oscar with the right sense of determination and self pity through his performance that becomes very undeserved. He wants to do things for himself but has to accept he needs help. Loy as the wife of one of the main characters, at times she is unsure of how to help her husband and make it easier for him. She keeps positive and very warm throughout. The scene as the three men on the travel home and look over the world is very well done, as is Russel getting ready for bed with his girlfriend and the realisation that she still loves him is very sweet and offered a crying moment.  The wedding at the end was sweet which ends the film on a positive. It may take time for the men to readjust to their surrounding but little by little they will be. The world has changed. The society has changed. The scene where Dana Andrews character finds himself around planes that are to turned into new homes is a powerful motif. The leftovers from the war are to be used in a new future. I will never know what men go through after being at war, this film showed the issues from jobs, to love lives and how other people treat them. A very brave and honest film.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film has a lot of heart and despite its near 3 hours length, it doesn't drag. Not afraid to be tough, it earns its happy endings and sentimentality is generally avoided. Very brave for the time in its many downbeat moments and its casting of a real disabled veteran in a central role.",
            "review_date": "2020-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the better movies I've seen, about returning soldiers.",
            "review_date": "2020-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A profound call to appreciate veterans.\n\nWilliam Wyler's postwar drama The Best Years of Our Lives (1946) is a brilliant, contemporary take on how veterans are treated after a war is over. Wyler's direction is smooth and easy to follow with Greg Toland's striking cinematography. The clever framing lets characters all react and exist on screen together despite having numerous people all experiencing The Best Years of Our Lives at once. I think Wyler finds the heart of the story as you sympathize with the plight of soldiers returning home to America as everything feels strange to them now. The idea that veterans are not treated well and not given enough opportunities to survive still rings true today.\n\nI love Teresa Wright here as a modern woman desperate to find love despite the situation. She is empathetic to the plight of veterans and lonesome souls alike. I think Wright is beautiful and kind as a genuinely lovely character of good morals and relatable patience. Myrna Loy is fascinating as a wife awkwardly trying to win back her husband's affections once he's returned home. On the other hand, Virginia Mayo is fun as a girl that knows what she wants and does not want to struggle to survive. Then, there's the delightful and endearing Cathy O'Donnell as a girl trying to communicate with her distant fiance that she still loves him. All the ladies of The Best Years of Our Lives kill it with relatable and complex performances.\n\nFredric March is interesting, daring, and hilarious as Al Stephenson, a banker returning home from war who cannot feel comfortable in his privileged position after the war. Harold Russell is engaging and sympathetic as the independent disabled veteran Homer Parrish. I think Dana Andrews is riveting as the poor pilot Fred Derry, who has a hard time finding work or love after WWII has ended. All three men represent a wide array of veterans with respectful acting and intriguing realism.\n\nIn all, The Best Years of Our Lives is a phenomenal drama that boasts timeless themes and incredible filmmaking. The well rounded cast make the film all the more contemporary in feel. I loved it!",
            "review_date": "2020-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional story of men returning home after serving in world war II.",
            "review_date": "2019-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely loved the pace of the film. For a 3 hour film, this felt so seamless and smooth. The editing is fantastic and the story is simple. The characters have their complexity yet genuineness about them. I felt connected to all characters. The writing was crisp and movie deserves all the accolades it received. It is very refreshing in this Netflix-hungry world to see old-school drama holding its own and how!",
            "review_date": "2019-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While many elements may have been blunted by the passage of time and increasing acceptance of things outside the norm, The Best Years Of Our Lives is still a powerful and eye-opening account of veterans returning home after a long and arduous war, and finding that nothing can quite be the same again. William Wyler, as always, gets the very best out of his actors, and there's a gripping authenticity in everything from the costumes to the characters camaraderie, helped along by the wartimes experiences of Wyler himself, as well as Harold Russell, who may only get a relatively short amount of screen time, but makes the most of it. The runtime is excessive, as is the often overbearing score, which Wyler himself detested, but it made me appreciate the quiet moments all the more, especially when one of the leads utters a statement that pertains in someway to the war or their readjustment, and the thought is allowed to linger. Its richly deserving of its accolades and boxing office success, and while its length might make it difficult to watch frequently, I highly recommend that you see it at least once, and you'll know why it was so wildly popular.",
            "review_date": "2019-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a film that's very much of it's time as you know that the themes of this film and the experiences depicted would have been extremely moving for the audiences of 1946 but it feels over long and slightly mawkish by today's standards. One of the stories in this ensemble drama was really touching and moving but it was drowned out amidst mishandled subplots and scenes that stretch on for far too long. This film did not deserve to win Best Picture when considering the fact that it was nominated against It's a Wonderful Life (1946) and it's not the best film directed by William Wyler as The Heiress (1949) and Ben-Hur (1959) are more entertaining by today's standards.\n\nThree men, disabled officer Homer, Harold Russell, successful bombardier Fred, Dana Andrews, and older sergeant Al, Fredric March, return home to their loved ones after World War II. Homer worries that his longtime sweetheart Wilma, Cathy O'Donnell, will be disgusted by his prosthetic hands and won't want to marry him while he struggles in his new job. Fred falls in love with Peggy, Teresa Wright, who is Al's daughter but his marriage complicates their burgeoning relationship as he begins to suspect his wife Marie, Virginia Mayo, of infidelity. Al watches over his daughter nervously while he and his loyal wife Milly, Myrna Loy, are against the new policies of the bank. \n\nThe biggest selling point of this film is Wright in the role of the innocent but plucky Peggy who is conflicted over her feelings for a married man who is considerably older than she is. She imbues every scene she is in with a delicate touch that brings her relationships with her mother and her potential love interest to life. Quiet scenes of her and her mother simply talking about how to maintain a relationship are the best in the film as her parents affirm that while love is hard it's worth the effort, rather trite maybe but still a worthy message. I always feel troubled when I am asked to support infidelity between two characters in a film but here I was charmed because Wright and Andrews made their characters simply adorable and we spend enough time with the two of them that their connection is believable. Wright would have been deserving of a Best Supporting Actress nomination for her work in this film and she seems like one of the natural actresses of the 1940s that I have seen.\n\nMayo also stands out as the shallow, bitchy wife who may have been a prostitute when her husband was away at war. The scenes of her impressing her views on marriage on the impressionable Wright have a touch of All About Eve (1950) and their cynicism is a welcome break from the rosy eyed view that the rest of the film takes. I wanted to see more of her running around occurring in the film and her talking back to her husband was gratifying in a movie where she is surrounded by women who worship the ground their husbands walk on. Had there been more of Mayo and Wright's characters in this film I would have found more to love as the balance between the two of them is the most exciting part of the film and while I relished the happy ending that Peggy and Fred get I equally wanted to see Marie swindling some poor men out of their money.\n\nMy big issue is that about two thirds of the film isn't particularly engaging, unfortunately it's the plot concerning the disabled character, and even the fun scenes stretch on for too long. Had the other plotlines been cut out or just reduced in screen time then the film would have been undoubtedly stronger and more palatable to audiences who are not willing to watch a slow moving film that stretches to almost three hours.\n\nIt's obvious that It's a Wonderful Life was the best film of 1946 and that it deserved Best Picture over this largely forgotten ensemble drama. It's not a terrible film but it's hardly gripping stuff and it presents too much dull content to keep the audience invested in the lives of the characters.",
            "review_date": "2019-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic post-WW II coming home to reality story couldn't be done better.  The actors were all superb and were cast perfectly.   Myrna Loy shows again her depth in drama, and this great talent she possessed should not have been relegated mostly to comedy material.  ",
            "review_date": "2019-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A memorable film about the aftermath of World War II in the United States., this film opens with the homecoming of three veterans to the same small town. The movie exposes the reality of altered lives and the inability to communicate the experience of war on the front lines or the home front.\n\nThe Best Years of Our Lives is one of the most timely and immediate Best Picture winners in Academy history. \nProfoundly and sensitively balances the private demons of scarred veterans and the press of public policies that leave their mark on daily life.This movie is a masterpiece. The writing, the acting, the blending of several stories without being even the least bit choppy, everything about this movie is exceptional. Seven Academy Awards. No wonder, it certainly  deserved them. The all star cast Fredric March, Dana Andrews, Harold Russell, Myrna Loy , Virginia Mayo , Teresa Wright , Cathy O'Donnell . Director  William Wyler's heartbreaking postwar ballad seems even more radical today than it did in its Oscar-thick heyday. It's as non-propagandistic as an unemployment line.\nIt's a masterpiece, a combination of a genuinely felt emotional narrative and a microcosm of a country recovering from war.",
            "review_date": "2019-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best, GREATEST inspiring movie ever made! With the best movie character ever portrayed: Harold Russell as Homer Parrish! And the best movie score ever composed!",
            "review_date": "2019-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "quite a few WW II vets in our small town that I grew up around..",
            "review_date": "2018-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tells a moral story with surprisingly good performances from Frederic March, Dana Andrews and Teresa Wright. Skip the melodrama, this is the electromagnet of wartime and what happens when the current is turned off.",
            "review_date": "2018-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film mostly delivers with a minimally-entertaining post-WWII storytelling that was thoroughly represented with well-performed soulful characterization within enough substance to put up with worthwhile length. (A-)\n\n(Full review TBD)",
            "review_date": "2018-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films of all time.",
            "review_date": "2018-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie that more than stands the test of time. In most war movies directors shy away from going too far ove the top , obviously they want you to sympathize with the protagonist but they hold back, but here no punches are pulled, almost from the beginning when Fred has a problem in the Airport , can't get a seat on a airplane home while a rich man rudely interrupts him to ask about his own airplane seat, all of that is classic manipulation but we go along with it because unlike the rich man in the airport and his damned golf clubs, we the audience respect everything these returning war heroes have done and what they've been through. A similar thing happens to both Al and Homer, in fact you can say all three men live among the most insensitive people in the world. Fortunately for as many detractors, fascists  and just plain awful people who surround them, each has their own guardian Angels, from loving parents to the women in their lives, each is saved, and we are rooting for them all the way. The movie has many powerful scenes made even more so by our emotional connection to each man. Each has to deal with a personal demon and people designed almost perfectly to break them, but through personnel courage as well as the companionship of each other, each makes it through. No movie has ever dealt with the problems of returning veterans as well as this one, and I doubt any ever will. Every person involved with the making of this movie gave their best effort. I knew many veterans of world war 2 , men who went through very similar things as the men in this movie, none of them would ever speak of their war experiences. This movie speaks for them...and says it all.",
            "review_date": "2018-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember watching this film at various times throughout my life. I always enjoyed it. But the film became truly personal after my return from deployment to Iraq with the UA Army. I was amazed at how much I had in common with the characters. From the PTSD suffered by Fred Derry to the impact of disability on Homer Parrish (I'm a 100% combat disabled veteran), my experiences virtually mirrored theirs. More than fifty years later \"The Best Years of Our Lives\" is still having an impact. The public could learn much about the difficulties that veterans, especially those disabled, have when returning home from war.",
            "review_date": "2018-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I’ve seen plenty of war movies, and there are a fair number of those movies that have a brief section at the end about how the soldiers adjust back to normal life after the war. The Best Years of Our Lives was a unique experience for me, because it is a war film that never once shows war. Instead it is a movie that centers the entire plot on veterans returning from war. I love the fact that it not only focuses in on the effects the fighting had on these men, but also how the time separated has impacted their families, and how the aftermath of the war has changed the entire nation. By featuring three different leads the film also allows us to experience these struggles from a number of unique angles. On the one hand we have the weathered old soldier who is trying to reintegrate into a happy home life that has managed to function without him in the meantime. Then we have the airman who had attained medals and a higher rank in the war, who now must adjust to his more modest and less-respected role on the home front. Finally, there is the young sailor who has been seriously injured in battle, and can’t deal with the changes that will bring into his life and the way people treat him. Every one of these stories took me on a roller coaster of emotions that I seldom get from movies that only have one story to handle. I laughed and cried in equal amounts with The Best Years of Our Lives, and it all felt so satisfying. The cast is not filled with that many names from the era that I know off the top of my head, but they all inhabited the characters brilliantly. Perhaps the most impressive performance came from Harold Russell who is so endearing that you instantly want to be his friend and hang out with him. It’s a shame that he wasn’t given many opportunities to act after this, because he adds a lot of heart and joy to this film. The script is crafted well so that you can weave in and out of the lives of all three characters, and just when you feel like they’ve forgotten about one of the storylines it comes back in no time. It’s impressive how each veteran has their own struggles, and their own triumphs, but they still have relevance to one another. The Best Years of Our Lives is not disjointed in the way the story is constructed instead it flows like one cohesive narrative. This is the kind of film that will become a perennial favorite for me, because it warmed my heart and made me feel good while also telling a powerful story.",
            "review_date": "2018-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well done tear-jerker that follows the lives of three servicemen immediately after returning from World War II. All three men have inspiring stories. Their individual romances are tender, too, thanks in great part part to the leading ladies.",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I first saw this movie in the early 1980s, as part of a program called \"The Goldwyn Years\". It shocked me, as the movies of that era that I grew up on concluded with the troops returning home to a \"happily ever after\". This one was the first movie I can remember that accurately depicted the struggles of the returning vet as they attempt to find their way back to some semblance of a peaceful civilian life and out from under the shadows of their war experiences. Powerful stuff, and remarkable performances from the entire cast.",
            "review_date": "2017-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an engrossing, well acted and written classic that still holds up well today. It definitely verges on melodrama at times, but it's some brilliant melodrama at all times IMO.",
            "review_date": "2017-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sobering look at the after effects of war. Incredible performances by real-life war survivor Harold Russell, Myrna Loy, Hoagy Carmichael, and Fredric March.",
            "review_date": "2017-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie. I watch at least a few x a year.   This was the day of such an awesome group of movie actors/stars.  Do yourself a favor and check it out. You will not be disappointed!",
            "review_date": "2017-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film stands on its own merit.  It's no surprise some viewers and critics are so obtuse and biased they lack the perceptual aptitude to become immersed in the multi-dimensional dynamics of every character in this film... experiencing the cruelty of war's after shocks at some recognizable level by everyone.  No one catches a break in this movie - not even the charming and innocent little sister and her friends.  Everyone feels the aftershock of three soldiers returning from war and trying to pick up the pieces and move on - confronting survivor guilt, ptsd, love's betrayal, family estrangement.  The film has authenticity and pulls no punches, and the use of framing, deep focus and mirrors are used to full effect and for affect - the powder-room mirror scene being one of the most brilliant uses of a mirror shot in any film with no cuts.  It's a scene even professional film critics miss. But the tools of direction, script and camera work are secondary to the performances and story line that provide a time machine-like view into the past.  Indeed, some audiences of the 21st century will have trouble understanding without keeping in mind that this was a time when an entire country of citizens felt the reality of war with rationing, restrictions and blackouts after sundown with armed neighborhood escorts.  Americans have forgotten.  Every American felt WWII - not like it is in this century where soldiers return home from combat to see their fellow Americans completely detached from the hardships of war taking place abroad... but for them just another day like nothing traumatic ever happened.  This movie reminds us of a time when everyone felt war, and the story offers its 1946 audience the thing it needed most in that year facing recovery - a hope of reconciliation.",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A near perfect film; great in every way.",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On the point important on the back-from-war issue, building up in a great classic way with real depth and strength around the story. As mentioned the movies takes a bite of a important question, not just for the time around WW2, but still significant for today.",
            "review_date": "2017-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This groudbreaking film deals with many themes faced by postwar veterans that were rarely discussed previously.  Matters dealing with occupational handicap, military-civilian role reversal, society status and unemployment are dealt with head-on.  Excellent acting, somewhat overacted, with an engaging plot and characters come together in a strong rally cry for the immediate postwar era.  Some themes are remarkably similar to \"All Quiet On The Western Front\".",
            "review_date": "2016-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riveting and heart-wrenching, even 70 years later - war is war and war is hell, for all - those directly involved and those at home waiting.",
            "review_date": "2016-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great film that won 8 Oscars in 1946, and was one of the few films in the IMDB Top#250 I hadn't seen.  Frederich March and Dana Andrews star as returning WWII vets trying to adjust to civilian life.  Harold Russell who was a real Vet costars and won an Oscar in the process playing someone who had lost both his hands, which he had in real life.  It's an epic film at almost 3hrs, but is well written and acted so I didn't mind.  This is a must watch!",
            "review_date": "2016-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mixed bag.  Nice story about men coming home from the war and trying to pick up the pieces in differing circumstances.  A lot of it is cornball now but I suspect it was considered edgy in its time.  There is a frankness and astuteness that you don't see much of in oldies.  PTSD is lightly touched on.  Real life double amputee (i.e. hooks instead of hands) Harold Russell won the Supporting Actor Oscar (although his acting was painfully bad at times), but I give them credit for taking a chance on the concept..  Big thing for me unfortunately - like so many old movies - there are just a ton of scenes that don't ring true.  I am too aware that I am being manipulated with dramatic devices rather than just seeing something organic.  6.8 out of 10",
            "review_date": "2016-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent move, especially because even though this movie was made in 1946 it resonates even today with our veterans. Much like the 1938 classic All Quiet on the Western Front. Don't let the age of the movie fool you how good it really is. Most  movies from back then had integrity and didn't rely on crass language an situations to make a decent film.",
            "review_date": "2016-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Human...very human film",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great Willy Wyler movie.\nThe story, with time, is quite expectable but the characters are well defined and developed by the cast.\nAlso, it is a good (and probably, too positive) review of the after WWII war lives of the US veterans.\nA must to be seen.",
            "review_date": "2015-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poignant in places, illuminating in others; an excellent representation of what it must have been like coming home from WWII with life as they knew it changed in the interim. Really good movie.",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is, hands down, the best film EVER made about the transition from military to civilian life. Any veteran watching this wil be able to identify with it immediately.",
            "review_date": "2015-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I usually tread carefully around multiple award winners (seven Oscars for this one), just because they sometimes err on the side of cloying sentimentality and populist opinion, losing some edge in exchange.  However, this is not true of The Best Years of Our Lives, the story of three servicemen returning from WWII to uncertain futures back in the US.  Indeed, the title itself is ironic. Under ex-Air Force officer Willy Wyler's direction and following Robert E. Sherwood's script, the film pulls no punches in its uncompromising view of the difficulties facing those returning from war, whether they be blue collar (Dana Andrews), middle class (Harold Russell), or better off (Fredric March).  After falling in together on their way back to \"Boone City\" (a stand in for Cincinnati, more or less) from points overseas, the three leads stick with each other and we follow their intersecting paths.  Russell has lost both hands (true of the actor as well as the character) and has trouble accepting his girl's love thinking it only pity. March takes to drinking and has a run in with his boss at the bank over small loans to returning G.I.'s (but he has the support of his lovely wife Myrna Loy and daughter Teresa Wright).   Andrews suffers from PTSD, discovers that his war bride is a party girl who wants no part of him now that he is broke, and can't even keep his old job as a soda jerk at the drugstore (now taken over by a corporate chain - a sign of things to come).  Although the film follows these men (and their families) long enough to see them start to adapt, I agree with critic Kent Jones that there is plenty of evidence that things may not go well for them in the future.  And as critic Jonathan Rosenbaum points out, the film offers an eye-opening vantage point for the real lived experiences of that generation, quite different from the burnished brass-plated nostalgia that often passes for reality.  Moreover, I fear that society continues to offer an insensitive cold shoulder to our returning vets and ever will it be thus. This film could offer a useful corrective.",
            "review_date": "2015-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even generations not living in the immediate aftermath of war are sure to be moved by this portrait of soldiers readjusting to their old lives.",
            "review_date": "2015-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll be straight out here. I think the film, while not a terrible film, has been seriously over rated. The characters were somewhat short of being completely convincing for me, and it played much to heavily on the \"love of a good woman (as a housewife, of course)\" and the \"happy every after\" memes. I strongly suspect that the timing of when it came out contributed to its academy award status. In a sense it was a feel good movie about the aftermath of WWII. By rights the best movie belonged to It's A Wonderful Life.\"",
            "review_date": "2015-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Years of Our Lives is a powerful film that deals with the hardships some war veterans have adjusting to civilian life. It is a well-made movie and it features a number of powerful performances - in particular Harold Russell as Homer Parrish. However, the run time is unnecessarily long (172 minutes) and the story drags in certain scenes. It's a Wonderful Life may be the most memorable film of 1946, but this Best Picture winner is definitely worth watching.",
            "review_date": "2015-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starring Myrna Loy, Fredric March and Dana Andrews. The first serious American film to examine the problems faced by veterans returning home from WWII is also the best. Quite deliberately, we see the problems of three men each from a different branch of the service, each from a different economic and social background. Yet nothing here ever feels fake -- quite the opposite, we feel these are real people. Myrna Loy brings a welcome light touch to the proceedings as troubled banker March's wife. Incredible authenticity is lent by the presence of non-actor Harold Russell, who lost both hands in the war. He was cast in the film after director William Wyler saw him in a documentary about war \namputees. One of the great triumphs of American filmmaking.",
            "review_date": "2015-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hollywood's finest movies depicting 3 WWII service men coming home and readjusting to civilian life.  Each has his own challenges to conquer.  Engrossing film portrayed by a wonderful cast.",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most personally impactful films I have ever seen.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is, in my opinion, the summit of artistic excellence in cinema. Everything that film can do as an art form this film does brilliantly, movingly, tenderly, and tragically. From the script to the acting to the cinematography it's simply perfect. The story about veterans returning to a city in the midwest captures a mood of alienation in an all-American setting that speaks brilliantly of the midwest, post-war America, and the human condition.",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films ever made. Thankfully Hollywood hasn't screwed it up with a half assed remake.",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is perfect.",
            "review_date": "2014-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is it the best movie about veterans coming back to civilian life? No, it's def dated and a bit saccharine, but it touches on many important topics and is relatable. At it's time it was bold, but nowadays its pretty tame. I could relate to some of these problems today, having a spouse who had come back from war. It's a feel-good kind of movie and it follows three service men making transition back to civilian life after WWII. It never really completely ties up the one guy's story and the disabled guy they don't really spend much time on, so at times its disjointed. However, it had some touching moments and a powerful message about what's really important in life and what it's like for soldier families.",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic movie!  One of the best I have seen in a long time!",
            "review_date": "2014-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the all time great films. It deserved all the accolades it has received; eight Academy Awards including Best Picture and being ranked 37 on AFI's 100 Greatest Films of all time.",
            "review_date": "2014-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"You'll think it's tragic when that moment arrives, - ah - but it's magic, it's the best years of our lives!\" I figured I'd go with the much less popular Steve Harley & Cockney Rebels song, because I'm tired of Modern Love's \"Best Years of Our Lives\", and because the Cockney Rebels song's release is a little closer to this film's. Well, maybe I could have gone with the Modern Romance song when you look at that way, for although this film was released back in 1946, I think that it bled over into 1982. I see that they abridged this film's title from \"The Best Years of Our Lives... in Real Time\". Well, clearly, back in the '40s, people didn't have much to do, because this three-hour-long opus was the most-watched film since \"Gone with the Wind\", although, in all fairness, it's not like anyone who went to see \"Gone with the Wind\" had much time to see anything else afterwards. I'd say that MGM sure knew how to get people interested in punishingly long dramas which were partly about war, during a time of war, and I think I know what their secret was: ...making the film good. So yeah, this film is far from a waste of three hours (Now, after 36 years, it might get on your nerves worse than Modern Romance's \"Best Years of Our Lives\"), but it's still no \"Gone with the Wind\", for a number of reasons.\r\n\r\nWell, actually, this film may be less histrionic than \"Gone with the Wind\", and it is certainly less histrionic than many other films of its type, although it remains more melodramatic than it probably should be as a generally genuine portrait on the struggles of war veterans, hitting certain touches in dialogue, characterization and dramatics which suffer from classic, dated sensibilities. Robert E. Sherwood's written dramatics are not the only ones to have fallen short with the test of time, for William Wyler, even with all of his subtle touches, gets a little carried away with his handling of the unsubtle writing and Hugo Friedhofer's emotive scoring, until sentimentality sets in, betraying the unique grace of this drama by falling back into the conventions of the time. Really, formulaic storytelling holds this film back in a number of ways, because whether it's melodramatic or not, the familiarity of this film sort of blands up a primarily engrossing affair, whose conventions can at least be appreciated for standing among the handful of consistent aspects in the plot. Perhaps I exaggerate the unevenness of the focus to this narrative, but storytelling ambitiously tackles three separate portraits on the struggles of a man returning from war, and does so with a certain inconsistency that convolutes the sense of importance of each story, and derives from the film's lack of tightness. Falling just short of three hours, this film's runtime is questionable, and seeing as how as big a problem as anything in the final product is bloating, Sherwood's script is packed with fat around the edges that drags filler to the point of meandering, and taints material with excess that it typically of a melodramatic, or formulaic, or focally uneven nature. Pacing proves to be the root of all issues in this film, and on top of that, it keeps you around longer than it probably should, and no matter how compelling the final product always is, this drama falls short of what it could have been under the weight of an ambition too great to transcend limitations of the time. Still, like I said, the film compel thoroughly throughout its questionable course, even though its story concept promises to really enthrall.\r\n\r\nAlcoholism, financial struggles, finding new love amidst the collapse of the old, and coming to terms with limitations one brings home are all conflicts found by veterans returning from war to a world which was not what they dreamed of, and that makes for an overblown and melodramatic, but powerful story concept that helps a great deal in making the final product so rewarding. Of course, it does ultimately come down to the interpretation of intriguing subject matter, and when it comes to that, Robert E. Sherwood drops the ball in a lot of places as screenwriter, getting melodramatic and excessive, but tight where it counts, making sure that there's enough going on to prevent dull spells, and putting a then-daring and still-powerful deal of attention into the heavy depths of this dramatic subject matter. Although genuineness lapses at times, where this script could have really succumb to dramatic superficialities of the time, it's not afraid to get relatively edgy, and even on paper, it engrosses in its capturing the hope, anguish and other layers of memorable, humanized characters which are further sold by a strong cast. The material may be a touch too dated for the performances to really prove outstanding through the years, but everyone delivers, and that especially goes for the leads, whether it be Dana Andrews as a traumatized man who struggles both to satisfy his wife and with feelings for another woman, or Fredric March as a now-alcoholic family man, or the particularly unevenly used and, in my opinion, show-stealing Harold Russell as a good-spirited, but ultimately handicapped veteran who must learn to live with his limitations and how his peers interpret them. There's a lot of emotional commitment put in each one of these performances, and although they were more remarkable at the time, they remain piercing to this day, much like an offscreen performance by William Wyler that can make or break the engagement value of this drama. Sure, this film flirts with flat spots, thanks to Wyler's sentimentality and failure to completely compensate for pacing issues through tight scene structuring, but Wyler never allows entertainment value to abate, holding your attention until moments of dramatic realization which range from compelling to penetrating in a fashion which was ahead of the time. This film could have gone far if it was even more realized, but as things stand, the final product is never less than engrossing as a conceptually important and ultimately rewarding drama.\r\n\r\nIn conclusion, some histrionic and formulaic writing and sentimental direction shake the genuineness of this drama, while uneven focus and an excessive structure which stands at the root of most all of the issues shake the momentum of the final product, until it falls short of what it could have been, yet by no means so short that worthy subject matter, audacious scripting, compelling performances and inspired direction fail to make \"The Best Years of Our Lives\" a rewarding classic of a portrait on the painful struggles war veterans found in themselves and the world around them upon returning home.\r\n\r\n3/5 - Good",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film! I loved it! It is a fantastic film of how greedy and narrow-sighted typical Americans are. And how tough of a society returning veterans have to face. Such a good film! Romantic, entertaining, sad at times, and what a realistic film.",
            "review_date": "2014-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fantastic performances and an incisive story outweigh any concerns about its 3 hr runtime",
            "review_date": "2014-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Years of Our Lives has a few moments that may appear sappy to modern moviegoer sensibilities, but as a whole it is very relatable to a 21st Century audience. Several postwar vets (and people in general) of today can relate to the economic hardships Fred Derry goes through, and the difficulty to adapt to change at the workplace that Al Stephenson goes through. Every modern young woman often runs into a great man in a bad marriage like Al's daughter Peggy does. In other words, even if you don't typically like films from the 40's, you will probably relate to and enjoy this film, worthy of all the Oscars it won back in 1946. It won Best Picture over It's a Wonderful Life. That alone should tell you something.",
            "review_date": "2014-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful, emotional, incredibly realistic story.  This film was so well-written and acted, and every character was developed and easy to sympathize with.  A perfect movie to watch on Memorial Day.  The situations and lives of the three main charactesrs are timeless enough that this could be shown today in theaters and still be totally relevant and relatable.  When I saw that the person playing the disabled character (Homer) was not an actor but was truly a disabled WWII veteran, I was stunned.  The scenes must have been like replaying his actual life experiences.  No wonder the emotion was so raw.  Highly, highly recommend this film to everyone!",
            "review_date": "2014-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deeply touching and significant post-WWII classic that depicts the psychological trauma and several obstacles encountered by veteran soldiers of different backgrounds returning from war, and it does so with an expert use of deep focus and a wonderful mise-en-scène to create many meaningful visual compositions.",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching and powerful.",
            "review_date": "2014-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A unique and compelling drama. Unique in that it deals with soldiers returning home from World War 2, and their struggles as they try to fit back into civilian life.  Some are physically scarred, and some mentally.  Little was known about Post Traumatic Stress Disorder at the time, so the fact that this topic is dealt with so sensitively is quite incredible for the time.\n\nThis, plus the adjustments they have to make and the fact that their world has changed while they have been away make make for interesting viewing.\n\nCompelling too in that it as much a human / relationship drama as an effects-of-war drama.  Very emotional, as the servicemen piece their lives back together and try to reestablish / establish relationships, get jobs, etc.\n\nSuperb directing and camera work by William Wyler.  Also a great deal of sensitivity in telling the story.  Wyler was involved in the Allied war effort through making documentaries, like the original documentary on the Memphis Belle, so was well aware of what went in to winning the war.\n\nPerformances are astounding.  Dana Andrews is suitably debonair as Fred Derry.  Fredric March is a surprise package.  His character seems to that of a dull banker but as the movie goes on and on his character becomes funnier and funnier, climaxing in the hilarious dinner speech.  March seemed to revel in this side of the role and is great in it.\n\nStandout performance, however, goes to Harold Russell as Homer Parish.  Russell was not an actor, and was a genuine amputee, playing the role of an amputee.  Incredible performance from him, for which he received a Best Supporting Actor Oscar, which showed just how much some soldiers sacrificed in the war, and how they carried on without bitterness.\n\nSuperb female cast too.  Teresa Wright is beautiful and wonderful as Peggy.  Virginia Mayo is stunningly beautiful as Marie.  Myrna Loy provides the gravitas as Milly Stephenson.\n\nA wonderful, emotional, sometimes funny, always compelling movie.",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Years of Our Lives is chiefly interested with the victories and struggles of post-World War II veterans, but its themes express much more - it's about America as a whole.",
            "review_date": "2014-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty hokey, but surprisingly nonconformist for the 40's.",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Best Years of Our Lives\" is an introspective movie about three veterans adjusting to civilian life after World War II. The film, directed by William Wyler and released in 1946 strikes a significant chord even today. The story follows Fred Derry (Dana Andrews) an Army Air Force Captain, Homer Parrish (Harold Russel) a Navy man who lost his hands in the war, and Al Stephenson (Frederic March) an infantry platoon Sergeant. They meet on their way home to Boone City and each one experiences excitement and apprehension in resuming the life they had before the war. The three veterans have their own personal story. Fred Derry before leaving for the war, impulsively married a showgirl (Virginia Mayo) who turns out is only interested in money and having a good time. Harold and his longtime girlfriend Wilma had plans to marry, but fears she won't accept him with his physical disability, and Al Stephenson returns to his banker's job and a family who has grown up while he's been away. \"The Best Years of Our Lives\" is beautifully and poignantly shot by Academy award cinematographer Gregg Toland, famous for films like \"Citizen Cane\" and \"Grapes of Wrath.\" Some of the scenes are wideshots with depth and real life activity, as in the department store scenes where Fred works as a Soda Jerk, the bar scene of Harold playing piano with his hooks along with Uncle Butch (Hoagy Carmichael) and the aircraft graveyard. Personal conflicts, transitioning to civilian life, and the difficulty of finding work are all interwoven realistically in this film. A strong performance by Theresa Wright as Stephenson's daughter who is in love with Fred Derry, adds to the conflict. Myrna Loy and Cathy O'Donnell round out an excellent cast. The biggest surprise for me was the performance of real life disabled veteran Harold Russell. He gives a sensitive and straightforward performance as \"Homer\" that earned him an Oscar for Best Supporting Actor. \"The Best Years of Our Lives\" won 8 academy awards including one for best music score and for best film. This is a wonderful movie that addresses real life issues for war veterans and it does not gloss over one bit. This is a really good story with relevance, a must see!",
            "review_date": "2014-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so good. It captures the human condition in a rare and genuine way. Highly recommended.",
            "review_date": "2014-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IM PROGRESS\r\n\r\nThe Best Years of Our Lives is the story of three United States servicemen readjusting to civilian life after coming home from World War II.",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice story minus the whole homewrecker plotline.",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "even theresa wright did a decent job in this melodrama.",
            "review_date": "2014-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this movie was outstanding, plain and simple. Probably within the 100 best movies I've seen. Highly recommend.",
            "review_date": "2014-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is almost three hours long and slow-paced, but it doesn't feel three hours long. You get so invested in the characters you just want it to keep going. Strikingly realistic for its time.",
            "review_date": "2014-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie wonderfully acted by its stars, it was one of the 1st movies to show soldiers after the war. William Wyler's direction is subtle, which makes for an almost closer to documentary style, which he picked up filming during the war. The acting is so key to carrying this film as it allows the story to breathe through its actors. One of the few best Pictures to get it right then and in its opinion today.",
            "review_date": "2013-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw this one!",
            "review_date": "2013-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Three World War 2 soldiers return home to face the problems of \"re-adjustment.\"  Almost three hours and not a moment wasted, with an all-star cast that swept the Oscars.  Essential.",
            "review_date": "2013-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poignant, gentle, relatively (for the time) unmelodramatic and unsentimental look at PTSD in war veterans, long before PTSD was a thing. Its massive success in the late 40s means that it's a really fascinating reflection of the times. Far from jingoistic, almost the opposite at times, gratifyingly, despite the Hollywoodised happy ending. A bit too long, perhaps by today's standards, but I easily stayed with it. All three stories are nicely dealt with, but the way the film deals with Russell's real life disability is...beautifully sensitive.",
            "review_date": "2013-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that deals the difficulty of returning to civilian life after WWII.  Harold Russell steals the show and he is one of two non-actors to ever win an Oscar. It gave me a better insight of what my grandparents generation had to go through.  Both my grandpa and my great-uncle fought in WWII and they went through the same tough transition.  This is a must-see classic for any movie fan.",
            "review_date": "2013-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite its soap opera plot elements, few films have as much heart and compassion as this story about three World War II veterans who meet each other on the way home from the war and instantly become close friends despite being quite different men. Few films will move you as deeply as this one, and it moved the Academy enough to win seven awards, including best picture.",
            "review_date": "2013-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Magnificent drama that explores the life of three WWII heroes just right after the aftermath.",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great flick for its time but really the issues of the film where really only at that time when ww2 ended",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good film, quite long, but has some good performances and the story is quite good.",
            "review_date": "2013-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is film 37 in my list of top 100 movies of all time. As i started watching, i realised very early on that i didn't know a single actor. That being said, Harold Russell restores any faith lost that film is not about stunts, massive action sequences and big cast names. This guy fought in the war, lost both hands and landed a role with a backstory of exactly the same. But this is his first acting job, and there weren't many that followed either, but he is the one character who stands out as compelling. His story arc as Homer is truly inspiring and the whole film was spent with me rooting him on. The rest of the cast are very good at what they do, but for me Russell stands out as a superstar. Great film, great story.",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I totally agree with some of the other posted reviews, this film is emotional but never sentimental. A truly brilliant film that will shock many with its frankness regarding the return home of soldiers from WWII. Extraordinary on every level. I've now seen BEST at least 100 times and each time I pass it on TV, I have to stop and watch it to the end. It's simply that wonderful!",
            "review_date": "2013-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just finished watching this, after having somehow missed it all these years, and I am still profoundly moved by the experience. Not since I first watched It's a Wonderful Life have I been left so teary-eyed and sentimental. The final wedding scene between real-life double-amputee Harold Russell - as Homer Parish - and his childhood sweetheart, Wilma, which unfolds as the luminescent Teresa Wright and extremely appealiing Dana Andrews gaze longingly at each other, caused me to choke up. Never has a film left me feeling more bereft at my own inability to find true love . . . Of course, I have never had Teresa Wright yearn for me in this way, either.",
            "review_date": "2013-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So this best picture winner is the film that came a year after the end of WWII and is also the film that actually beat It's A Wonderful Life for the best picture slot ( I know right?) So here's my review for The Best Years of Our Lives.\n\nPlot: Three veterans named Fred, Homer and Al all return home in Boone City after the end of WWII. Fred is a decorated Air Force captain, Homer is a sailor who lost both of his hands when his carrier sunk, and Al is a platoon sergeant. All three of them have trouble getting back into civilization after the war. Fred has been given his old job as a soda jerk much to his wife's displeasure. Al has been given back his job as a bank loan officer because of his experience, but when he gives a fellow veteran a loan, his boss tell him not to make a habit of it. And Homer and his parents have trouble adapting to his disability and pushes his fiancee away to avoid being a burden for her despite her claims that she feels otherwise.\n\nI actually ended up particularly enjoying this movie. It didn't start out too strong at first, but after a while I did come to really care about these characters and what they went through. It shows how rough it was for veterans during the aftermath of the war with trying to find jobs, seeing their families again, and just all around trying to get back into civilization. It's well acted, it's touching... it may leave out some characters that I kind of wanted to see more or and go on a couple of directions that I figured they were going to go, but I found those issues to be minor issues personally. Now as I said in the intro paragraph,    this was the film that defeated It's A Wonderful Life for best picture during this year. Now is this another issue where the winner had no right to defeat the loser? You better believe it. Don't get me wrong, I understand why the academy did it. It's a film that has all to do what's happened to our troops after only one year of being home from the biggest war at that time. So it makes sense to have this film pulls the strings for the academy and have a good portion of the audience to feel the same way with that decision. But there's no way around it, It's A Wonderful Life is better. It just had so much more power and heartstring-pulling that makes it VERY little wonder that it's much more popular and memorable then this film. (hmm...personal note: make sure to finally review It's A Wonderful Life this christmas even though I keep failing to do that every year.) But just because that one is so much grander as a film, that doesn't automatically mean The Best Years of our Lives is a bad movie. Because it's still has it's moments of being emotional through the experience of these characters. So while The Best Years of Our Lives has little to no right to win against a classic like It's A Wonderful Life, it's still a good enough movie to be a somewhat respectful opponent for It's A Wonderful Life to lost to.\n\nAnd that's my review for The Best Years of Our Lives. It's well acted, it's touching, it goes very deep (but not completely deep) into what veterans and their families go through after WWII and while shouldn't have won, it's still enjoyable and it makes sense why it won best picture during its year.",
            "review_date": "2013-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I have ever seen in my life.",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing post WWII movie with these amazing inter connecting stories of these three men. Harold Russell makes me cry everytime I see this movie.",
            "review_date": "2013-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sensitive and honest treatment of the difficulties of re-assimilating back into society.\nAs relevant today as it was in 1946.",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A forthright portrayal of the difficulties faced by WW2 veterans returning home seen through the eyes of 3 men from the same small town. Outstanding performances from a very talented cast sensitively directed by William Wyler.",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was good, but I'm not sure we needed 2:41 to fully flesh out all the points. Interesting plot and solid acting.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Years of Our Lives is still a powerful, beautifully acted and well-crafted motion picture even tought it was made in 1946. A must see.",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One just could not imagine how sincere and delicate approach on the subject, difficulties of war veterans returning to their previous 'normal' life,unless watching this film. A complete picture on the sociology-psychological life at the end of WWII.And the most surprising part this one is made in those commercial golden era Hollywood days. No excessive melodrama or over-optimism is shown for a single moment. Very realistic approach with inventive techniques and first class performances.",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOVE this movie. Incredibly romantic, just as good as The Notebook!",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "William Wyler is perhaps best known for massively scoped epics and introducing the world to Audrey Hepburn, but it's his unknown prescient drama about the re-adjustment of returning servicemen that ranks highest among critics and cinephiles alike. Epic in runtime, clocking in at nearly three hours, but it takes that long it takes to tell the story of three men who strike up a friendship on their plane ride home from battle, soon finding each other's company essential to cope with the cruel world they had fought to save. The plot takes multiple soap-operatic turns in the form of forbidden love and shallow trophy wives, but Robert Sherwood's deep focus and the naturalistic performances from the cast keep The Best Years of our Lives from being just another schmaltz fest. The emotions are a little pressed and everything wraps up all-to0-peachy in the end, but cinema's annals are overloaded with cinematic marvels depicting visceral war carnage. A film about the healing power of love and family in the aftermath of a war that claimed the lives of over 60 million is a wondrous breath of fresh air.",
            "review_date": "2013-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing film from 1946 about 3 WW2 veterans coming home and attempting to go back to their \"normal\" lives. The film chronicles their hardships from dealing with injuries suffered at war, to finding employment, to being with loved ones for the first time in years. This film feels raw and doesn't sugar coat the issues or characters as you'd expect to see if this were made in Hollywood at the present time. There is no patriotism beyond the brief encounter at the soda counter. I loved this movie despite its long running time; almost 3 hours. There are no parts that drag in this movie, it's an engaging and heartbreaking portrait of American life post WW2.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directed by William Wyler, the film chronicles the lives of three men as they return from World War II. They feel joy and then angst trying to integrate back into society  with lives that are strangely different from when they left. They face various struggles like finding a job, holding a marriage together, to just trying to get used to a disability. Although they each have their own lives which we get to see first hand, they are still intertwined. Together these three men find it within themselves to make these the best years possible. Full of both highs and lows, this movie is extremely touching and leaves you with a smile. The cast is superb including Dana Andrews, Fredric March, Harold Russell (real life amputee), Myrna Loy, Teresa Wright, Virginia Mayo, and of course Hoagy Carmichael. This film is great because it does not try to glamorize and it stands the test of time in my mind.",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another powerful story from the war and post-war era of Hollywood. The cast is superb and the wit and emotion of the characters is so charming and palpable, that it's almost impossible not to care what happens to these simple people trying to return to simple lives. Each delivers a home run in scene after scene concerning with doing the right thing, being a better person, and learning from the awful truths of a now recent world war. Harold Russell has a special place in this movie and he is truly the heart of what this film is about. Endurance, self-determination, and the courage and grace it takes to come from such disaster into the light of a new life filled with joy. March and Loy are brilliant as the strong and true couple: characters which are lacking in today's cinema. The film deserves the awards it received in many areas of achievement. The films lasting testimony is also something lacking in today's cinema, the triumph of reality. So much now is lost in fantasy and relativity which devoid much of meaning. This film is all about what is real and why it lasts. I think the real and true things seldom are what we choose but are what are revealed to us from higher understanding. The Best Years of Our Lives means what do we live for and why do we live.",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Three WWII veterans return home to small-town America to discover that they and their families have been irreparably changed.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really watchable drama about three servicemen who return from war duties to their domestic set-ups and all three of them struggle to adjust to their new lowly statuses. One has lost the use of his hands and now has crude mechanical ones in place. Another is forced to return to work in a drugstore for a measly wage, which is not enough to keep his materalistic wife happy, and the other finds work as a bank lender, but he finds his newfound empathy with soldiers seeking a financial hand-up lands him in trouble. The film is rather long at nearly three hours' long, but it doesn't ever get boring with really good characters and dialogue.",
            "review_date": "2012-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The \"I don't have any hands\" parts were poorly acted at first, but that story got a lot better as it progressed. Towards the end, it really started to hit it's stride. Sure, it could have been an hour shorter, but I liked it.",
            "review_date": "2012-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One powerful movie. I think it's the best Veterans Day movie ever. It focuses on three Vet's returning home after WWII and the character Homer actually lost his arms in the war.",
            "review_date": "2012-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In The Best Years of Our Lives, an important element was William Wylerâ(TM)s use of subtle social commentary and a plot which lends itself to cultural diplomacy. The films lead characters, Fred, Homer, and Al, are changed forever after their experience in World War II. Homer looses his hands, Fredâ(TM)s lack of commercially-viable experience relegates him to working-class jobs, and although Al gets to return to life as usual, his war experience leaves him sympathetic to the struggles of veterans. Importantly, tension is created when the embodiment of the charactersâ(TM) shared experience with war clashes with mainstream society. Al is forced to explain his leniency toward a veteran seeking a loan, Homerâ(TM)s wife leaves him because sheâ(TM)s unable accept that heâ(TM)s on the low-end of the economic ladder, and Homer struggles to reconcile his relationship with his fiancÃ (C) for fear that his disability will bring her shame. The film attempts to create a sense of community by bridging the gap between the veterans and society by anchoring the story in universal experiences of friendship, family, and love to illuminate the theme that true love is that which is found within people who are able to understand and accept one for what one is. I was particularly moved by the scene where Homerâ(TM)s fiancÃ (C), Wilma confronts him at home, demanding an answer to whether or not he wishes to stay with her. During Homerâ(TM)s most vulnerable moment when he reveals the extent of the impact of his disability, she shows her love and affection by buttoning Homerâ(TM)s shirt, offering to take care of him, and stating that she will never leave him. Another moving scene was one where after an argument between a war-isolationist and Homer, Fred knocks out the isolationist. Both scenes emphasize a desire for communityâ\"Al and Fred are empathetic to one another due to their shared experience in war, while Wilma welcomes Homer into her community through her expression of unconditional love.  I was particularly moved by the scene where Fred enters an old wartime fighter jet, reminiscing his days of service. This scene highlights yet another theme in Wylerâ(TM)s filmâ\"change is necessary. My critiques include: the slow pacing and unnecessary dialogue, and the dissonant music.",
            "review_date": "2012-10-12",
            "source": "rt",
            "lang": "en"
        }
    ]
}