{
    "rating": 0.0,
    "release_date": "2015-05-15",
    "num_reviews": 130,
    "genres": [
        "Horror",
        "Mystery",
        "Sci-Fi"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "The government should deny this films existence.....",
            "content": "Reid has always been obsessed with UFOs. While on a weekend trip to Vegas, he convinces two friends to join him on a mission to break into Area 51, where they find terrifying proof of alien presence......Found footage films, you either love them, or hate the socks off them. Unfortunately, every once in a while there is a really good movie released in this genre. Willow Creek, Exists, The Borderlands, and the V/H/S series are fine examples of how a found footage movie can work..........but there is a slew of rubbish that you have to trudge through to get to the impressive ones.This falls far into the latter category.So we have the usual gang of teens that we get in these films, one is always obsessed with the subject matter, and the others, dubious as they are, always go along for the ride, because it's a road trip isn't it?So we get the usual footage of people driving to desolate areas, where they are confronted by suspicious looking people, they talk to other people with whom are also obsessed with the subject matter, and this happens for the majority of the film, and the first two acts just drag and drag until we finally reach the titular place.By this time, you couldn't care less with what they discover, and even though the last ten minutes are impressive, both visually and atmospheric, it's too little too late, for the rest of the film is just so boring you lose any interest for the characters, and their quest.Copies are destined to be buried in the Nevada desert next to E.T.",
            "review_date": "2015-06-06"
        },
        {
            "review_title": "Extremely Disappointing from the Start",
            "content": "I definitely had higher expectations for Area 51, especially given that Oren Peli had written and directed and reinvigorated the \"found footage\" genre with Paranormal Activity. I'm a fan of the genre, a fan of the Peli, but this was absolutely abysmal from the very start. The concept could have been extremely engaging and given a unique twist, but it performs and plays out as expected- completely typical and utterly predictable, very poorly acted and nonsensical most of the time. I would have been disappointed even if it were a Direct to DVD or On Demand release. I guess the merits of this film like wholly on \"From the writer and director of Paranormal Activity!\" However, don't expect the competency which the latter film was delivered. There is very little entertainment value, lines are cut off mid-sentence, and somehow, despite being allegedly filmed with one camera, it switches angles regularly without disrupting other dialog. It places it's weight on technical talk, the late night AM radio conspiracy chatter, but does nothing to actually give the viewer anything to grab on to and immerse themselves in the adventure of these three hormonal boys.If you'd like to reduce your IQ level or waste your time while sick and just need to say you've seen it, you're better served by searching online for conspiracy videos, which provide far more interesting concepts and, despite being rather extraordinary, manage to entertain, which Area 51 fail to do.",
            "review_date": "2015-05-15"
        },
        {
            "review_title": "waste of an hour and a half of film",
            "content": "Okay so first off let me just say that I created this IMDb account after watching this movie, just to review it!. My friends and I have been waiting for this movie to come out for a while after first seeing the trailer for it on Facebook, which mind you, was probably scarier than this entire movie. I am a huge fan of alien movies like dark skies, alien abduction etc, and if you share the same interest then I suggest you only watch this movie if you have absolutely nothing else to watch but if you can avoid it, do it. It had some semi scary scenes, maybe a whole 5 minutes of the movie was actually exciting but other than that it was a bunch of 20 something year old, who seemed to know way too much on how to break into various locations on government technology, running around with video cameras. A lot of the story wasn't explained properly, it left me feeling confused and unfulfilled.",
            "review_date": "2015-05-19"
        },
        {
            "review_title": "The minimalist approach surprisingly creates an involving trip, although it's hampered with vague visual and unsatisfying conclusion",
            "content": "Found footage genre hasn't found much success after the initial trend start with REC or Cloverfield. It attempts to create a more personal experience with first person view often falls flat with cumbersome shaky shots and unclear scenes. Area 51 suffers from the same exact problems and it stutters towards the end, but it also manages to set an occasionally interesting trip, especially in the first half.Story follows Reid and his friends as he tries to infiltrate the highly secured titular facility. To do so he must investigate the area and bypass many security measures. For most early parts, the film delivers quite the ride as audiences follow these guys on Vegas and its surrounding. Some investigations and interviews set the tone right, and not in overly silly way. Characters are also pretty decent and likable as though they are real life friends.Unfortunately, it soon arrives at familiar territory of hazy shots and mindless running. The scenes in the city or desert are identifiable, but when it is stranded in dark corners, the movie loses the momentum significantly. Script is also numbingly bland as characters would yell the same thing over and over again, this is especially true when they are repeatedly shouting, \"We gotta go\". With both visual and audio decrease in quality, it just turns into a confusing escapade.Cinematography is to be expected from this kind of found footage flick, it's rather elementary, but there are a few good shots with modified vision. At several scenes the film builds up the suspense pretty well, these are not all translated into thrilling moments. It almost seems like it has problems in latter half, resorting to cheap alien gimmick and nullifying its early decent production.Area 51 has a presentable start with more engaging use of the found footage, but it falls to the same issues and ends up like the rest without accomplishing much.",
            "review_date": "2015-05-16"
        },
        {
            "review_title": "The era of the camcorder movie just keeps going on and on.",
            "content": "The first question needs to be, are we not getting tired of these camcorder lost footage movies? Ever since the overrated \"Blair Witch Project,\" we have been deluged with similar-themed films; most of which fall way, way short of being anything but tiresome. So enter Oren Peli with his own take on the concept, but in his favor we have the mysterious and always-intriguing Area 51 as the backdrop. That fact alone is precisely why I decided to give this film a look.At first it appeared that Peli might have done it right. Blending actors and sets with real people and locations associated with Area 51, the set-up is intriguing. Even the process in which these filmmakers attempt to foil some of the high-tech base security systems, seems plausible. So far so good.But it is when the title characters break into the house of an Area 51 / S4 worker and steal his 'card', eventually actually getting inside the top-secret facility, that the movie becomes completely unbelievable and downright ridiculous. Everything that follows is what we have come to know, and depending on how you feel about these shaky-cam movies, love or hate about the concept.It's not that \"Area 51\" is a bad movie: the performances and design is actually of high-caliber, but given the exciting story set-up, Peli really should have given us a whole lot more than just another camcorder film. In fairness, I think some people will enjoy this. I did not.",
            "review_date": "2015-05-16"
        },
        {
            "review_title": "Better than Expected",
            "content": "If you're seeing this film and expecting something spectacular like Casablanca or Citizen Kane, that's not going to happen. This film isn't meant to be great, but made for those who like something a bit scary. It really isn't too bad of a film once it gets going.It starts out slow and stumbles a bit, that's true, but in the second half it picks up. It gets interesting once the characters are inside Area 51. From there, it's hard to look away, not knowing what to expect. It was definitely different, but not great and not terrible either.",
            "review_date": "2019-09-04"
        },
        {
            "review_title": "Abysmal film; not scary!",
            "content": "I love scary movies, and I really love \"scary\" movies-- from Blair Witch to Paranormal Activity, I've always been a huge fan of shaky cameras and found footage. Ghosts and aliens scare me, and classic terror tropes work wonders on me! Things jumping out from behind other things and unexpected screams are my idea of a fun movie night.If you are looking for a scary movie with aliens as the focus, I would recommend picking up Dark Skies, or John Carpenter's The Thing... but not Area 51, because this is a terrible film. I put it on expecting to be shock-scared, or at least creeped out... but all I got was progressively more and more annoyed.The first half of the film does absolutely nothing but establish that the viewer should lack empathy for the main characters-- they are vapid young men who enjoy drinking, planning ineffectively, and disrespecting professional entertainers.The second half of the film is meant to heighten the viewer's anxiety and presumably scare us, but it falls disappointingly short in that respect. Instead it devolves into lots of running and flailing, lots of awful camera work, and terrible physical acting. When the end finally comes, it's more a relief than anything else.The only positive thing I have to say about this movie is that the main characters' treatment of their female colleague was basically respectful, which is more than what I can say for most movies that are structured in the \"x number of guys + 1 girl\" model. Nobody grabs her breasts or calls her disgusting names or belittles her intelligence based on her gender. That's awesome.The rest of the film? Really not so much.",
            "review_date": "2015-06-21"
        },
        {
            "review_title": "Cool budget film",
            "content": "The film was a cut above the rest of the usual hand held found footage horror films. The Area 51 itself was interesting and they had some cool special FX. The downside is the camera shaking all the time which makes it very annoying to watch. Beside that I enjoyed it.",
            "review_date": "2019-12-29"
        },
        {
            "review_title": "Area 51 (5/10)",
            "content": "Oren Peli is now officially a one trick pony after his latest found footage flick called Area 51. Again, similar to the first Paranormal Activity, there is a lack of story and realistic actions by characters in Peli's latest. Additionally, characters are weak, having little to no back-story and often times unlikable. Even with Peli's out used hand-held style of filmmaking, there is a particular originality to the film based on the alien side story. There are creative imaginary thoughts and well done shots of cinematography with this film. It almost seemed the film steadily managed to save itself as the film progressed. By no means would it be a film I recommend to people looking for the latest and greatest of 2015 but it's not a total waste, even when I wanted it and expected it to be.",
            "review_date": "2015-12-14"
        },
        {
            "review_title": "Don't believe the haters, it's a good movie",
            "content": "So much haters on this website. You wonder why? Because honestly if you like alien stories and suspense then you definitely going to like this movie. Well at least I did. And I am not even a big fan of camcorder movies. In fact I don't really like that way of filming. I am sure it would have been even better if they would have filmed it normally. Nevertheless the whole movie is full of suspense. From the part where they prepare themselves to the part where they decide to execute their plan to enter Area 51 it's all suspense. The actors might not be well known but at least they put down a believable performance. I really don't get why so many people don't like this movie. You know it's going to be about aliens just by the title of the movie. If you don't like that then just don't watch it, but please stop wasting our time with negative comments.",
            "review_date": "2015-10-14"
        },
        {
            "review_title": "Typical found footage...",
            "content": "AREA 51 is a typical kind of found footage movie, watchable enough but not offering anything up that hasn't been done a million times before. A bunch of kids decide to head off and infiltrate Area 51 to find out if they can uncover evidence of extraterrestrial life, but of course there are the usual surprises in store for them. Much of the running time smacks of padding and there's only real substance at the climax, but even then it feels like a sci-fi focused BLAIR WITCH re-run.",
            "review_date": "2019-02-02"
        },
        {
            "review_title": "DEADLY FORCE IS AUTHORIZED",
            "content": "Three guys plus a woman conspire to break into Area 51 and learn its secrets. The secret US test base for experimental aircraft? Nope. That other Area 51 with all those alien secrets. Filmed in Nevada, the film spends the first hour attempting to make us believe these High Tech Macgyvers can pull it off. Then the rest of the film attempts to be interesting, but fails, thinking throwing a few decent special effects at us will compensate for a boring first hour and haphazard ending.My advice is to fast forward through the first hour, so you won't be out of steam when it starts to get decent.Guide: F-bomb and nudity",
            "review_date": "2018-11-01"
        },
        {
            "review_title": "Peli's sophomore effort works",
            "content": "Oren Peli gave us Paranormal Activity way back in '07. I liked it a lot, and it kind of brought a new resurgence to the found footage genre which has exploded since then. Since then he has racked up a bunch of writing and producing credits but now finally 8 years later he has directed his second feature.Area 51 begins like so many other found footage entries of late. A bunch of young adults with a camera film their partying, going to strip clubs, basically doing a bunch of young adult stuff.But when they decide and plan to infiltrate Area 51, things get really interesting. Peli brings a lot of refreshing ideas to the table and in my opinion, totally delivers. The tension and suspense as these people infiltrate first the area, and then the actual facility is nailbiting. Once inside, we are treated to a non-stop ride of weirdness and all kinds of alien technology and other stuff I won't mention.Definitely a must-see for found footage nuts like me and fans of sci-fi horror in general. There's a lot to like here. 8/10.",
            "review_date": "2015-05-16"
        },
        {
            "review_title": "Awful, boring and terrible acting",
            "content": "I have recently just finished watching this movie, and what torture it was, but thankfully I made it through with only 1hr 30 of missing time.I decided to watch this movie because I love anything to do with UFO's, aliens, ET etc..so this should have been right up my street. It wasn't.From the first 10 minutes I knew i would hate this movie, the acting is laughable, absolutely laughably bad which completely put me off. The plot is completely ridiculous and stupid and all the way through you are thinking, sure, of course they would make these stupid decisions. Every UFO/Area 51 cliché is in here which to any avid UFO fan who has a keen interest in the field it just makes you cringe. Its like they have read a few UFO stories on the net and put little bits of detail from each story in here. The most secure base on the planet and some young idiots manage to break in without being seen. You cant even get near the place because of the perimeter control yet they manage to get in easily.And finally the whole film being recorded through a camera has been done to death, its not fun or clever anymore, its a cheap way for a director to make a quick buck for little time and effort. This movie probably took around a week to film its that bad. Please, no more shaky camera films, they are boring and unoriginal, they have been done too many times.All in all, this movie was genuinely one of the worst films i've ever had the misfortune of seeing. People can make their own minds up but I cannot recommend avoiding this movie enough, its a terrible waste of time.",
            "review_date": "2015-08-16"
        },
        {
            "review_title": "Not Great, but it was Fun and Tense,",
            "content": "This was better than I thought it would be. I had no hopes for this at all. I'm tired of the found-footage films, though I'm not sure that's actually what this would be. I found myself entertained.The part towards the beginning when Reid and Derrin are sneaking around in some guy's house was tense, and it had a jump scare. There were actually a few throughout the film, but not many.They had an interesting storyline, because who doesn't want to know about Area 51? However, for such a top-secret, high-security military base, the security seemed rather lacking both before and after they entered the base. Through quite a lot of their time in the base, Reid, Derrin, and Jelena would talk with normal pitched voices and run down the stairs like a pack of elephants. No security was around. That's not how I'd envision any military base, let alone Area 51.The alien was interesting, in the very few frames they showed it. I guess the design wasn't considered serious enough, so they devoted as little footage as they could.The tenseness of the scenes was fun. I would've waited in the car with Ben.Overall, I thought it was a fun movie. I gave this a 6-star rating.",
            "review_date": "2015-05-15"
        },
        {
            "review_title": "Yet another boring found footage movie",
            "content": "When will these movie makers realize that the current format for found footage movies are just downright terrible. They all follow the same format. 60 minutes of extreme boredom,then there is fifteen minutes of planning a trip, ten minutes of lets do something incredibly stupid, and then if, just if they show you what is attacking/chasing it is a millisecond of a glimpse.Just one rhetorical question though. Why is it every single alien movie that is made anymore is always found footage? Have writers lost their creativity and can't actually write a good blockbuster alien movie? One last note. Found Footage movies would be a million times better if they would show you what the creatures look like. And not just a glimpse.",
            "review_date": "2015-05-22"
        },
        {
            "review_title": "Nightmarea - not really",
            "content": "A young guy obsessed with government secrets rounds up a gang to infiltrate a remote facility and uncover the dreadful truth.Literal found footage - wait for the post-credits clip - and a voyage through the varying degrees of hand-held shakiness. I think it's well shot up to the 2/3 stage, then the jitters break loose and it gets a bit annoying.The set-up is pretty much the tale of a depressed obsessive, and I enjoyed the characterisation. But they leave the impression he's a chosen one, which doesn't play out in the end. Also there's drama about bringing the girl on the mission, but she doesn't add to the climax.Few sound effects - the editors very selective - and I don't think there was any music (apart from the party stuff).Overall, it sets up well but falls short on spooks in its descent into Hardy Boys yarniness.",
            "review_date": "2015-06-06"
        },
        {
            "review_title": "Decent for a found footage flick",
            "content": "I did not expect much going into this movie. I was hoping for a little better than Alien Abduction. That being the case, I ended up pleasantly surprised! The first 70% of the movie could have been condensed into about 10 minutes of plot actually necessary to understand and enjoy the movie. However, it was worth sitting through to get to the last 30%. The suspense was surprisingly effective. I even found myself tensed up and gritting my teeth a few times. Special effects, although not plentiful, we effective as well. I agree with a previous reviewer that I felt dissatisfied with the end of the movie. I think that, maybe with a bigger budget and a well thought out ending, it could have been much better. A pure horror fan will likely not appreciate it. On the other hand, if you enjoy SciFi/horror/suspense combo flicks, then it's definitely worth a watch.",
            "review_date": "2015-05-16"
        },
        {
            "review_title": "What a load of rubbish",
            "content": "Bought this film from Sky. What a load of crap. Only watched it because I'd paid money for it and thought it might get better. Unfortunately, it only got worse. If this had been free, I would have deleted it within 30 mins. Please, please, please, do not waste any of your life watching this utter crap. This Film Is Complete And Utter Rubbish. Quite honestly I think it was written and acted as if this was your first drama project in secondary school. You're given an idea and had to develop it. If I had been their teacher, I would have gave them an F, in fact it would have been ungraded. It was like they'd ran out of ideas at the end, or the school bell had rung and they had to make an ending. It was that bad, that there isn't even a soundtrack when the titles rolled at the end.",
            "review_date": "2015-06-06"
        },
        {
            "review_title": "Take It From A Horror Movie Type",
            "content": "Director Oren Peli (Paranormal Activity) demonstrates that low key acting and high-tension situations combined with the right amount of digital effects can rock \"found footage\" horror films. Writer Christopher Denham fleshes out the mysteries of Area 51 with a disturbingly realistic tone.All three mains Jelena Nik, Reid Warner and Darrin Bragg commit fully to their roles as unlikely explorers thrown into a maze of military secrets, alien artifacts and very real, very ticked-off extraterrestrials.The third act was so good and so hard hitting that I had to remind myself it was \"only a movie\" several times.",
            "review_date": "2015-08-27"
        },
        {
            "review_title": "Pleasant surprise!",
            "content": "First, I must say that most of the low ratings for this movie say \"not scary!\" The movie may have been sold to audiences as a pure horror movie, but false advertising shouldn't take away from the movie for what it is: A found-footage movie about a group of friends (one way more than the others) who go to great lengths to break into Area 51 that should be classified as a suspense sci-fi movie; definitely not horror.A great portion of this movie is about the set-up of these guys (and a girl) getting ready to sneak into the lower levels of the base, which I can see how the average movie-goer could scoff at. If you go into this movie hoping for action, I'm sorry. Though it isn't what many were expecting, it is still very interesting to see their plans unfold.The third act is where it really surprised me. Oren keeps with the golden rule of good horror: waiting for the unknown is a lot scarier than finding the unknown. You see very little of the aliens, which could be a let down to those looking for a monster movie. But watching the shadow of the aliens walking down the hall, or seeing an alien slowly slide from the darkness is truly creepy. There were many times I was very tense and on the edge of my seat.The ending isn't as bad as many people are saying, for I kind of liked it. With some slightly better writing/imagination towards the ending, it could've made this movie a true diamond-in-the-rough. The acting, despite what many say, is tolerable and, for the most part, believable. The main character does have these moments of awful, goosebumps- inducing acting, but the other elements of the movie made me forget about it.All in all, give it a shot. Its streaming on Netflix, and I'd say its well worth a shot. Worst scenario, you lose an hour and thirty minutes of your day. Or you could walk away with a pleasant experience. Just remember to keep your mind open to what the movie wants to be, not what you want it to be. Have fun!",
            "review_date": "2015-09-07"
        },
        {
            "review_title": "\"Critics\" gave Gravity a 9, and flunked Area 51.",
            "content": "As a big sci-fi fan and UFO-enthusiast, I really recommend watching this film. Even though I watch a lot of movies, I was a bit discouraged watching it because of the '4/10' rating. But unlike what many people here wrote... This movie did not disappoint me in any possible way. It has a great build-up, strong climax and mind-challenging ending. The constant suspense (after the introductions), no obvious scientific 'mistakes', some good jokes at the right times and zero jokes in serious/tense moments. The acting, the story, It all felt very credible to me. Bottom line: If you like the Area 51 mystery, give the movie a chance and the credit it deserves. Don't always rely on IMDb/'critic' ratings. I was physically ill after watching Gravity. If you agree with me on that part, I think you'll be safe watching this movie! Also, If you enjoyed the movie \"as above, so below\", you're quite certain to enjoy this.",
            "review_date": "2015-07-07"
        },
        {
            "review_title": "We've Got to Get Out of Here",
            "content": "After a mysterious encounter at a party, Reed becomes obsessed with breaking into Area 51. Unfortunately, we're just not as interested as he is.Area 51 scores a zero on character development, deciding on character templates that are so familiar to schlocky found footage films that they instantly feel overdone. Along with his two friends and the daughter of an Area 51 tell all book, Reed is suspiciously erudite when it comes to the craft of breaking into top secret government installations. Out of the box he knows how to get past the high tech detection grid, and even has a map of the prized underground S-4 base.There is little suspense and most of the more 'tense' moments are too predictable to raise any anxiety.As for the discoveries themselves, most are torn out of the most boring chapters of UFO Folklore. Spoiler Alert: there are aliens at Area 51. We never get to see them.The ending is a contrived bit of Alien Abduction straight out of every Alien Abduction film you've ever seen; just nowhere near as good.An Embarrassing moment for Oren Peli.",
            "review_date": "2015-05-18"
        },
        {
            "review_title": "When will the director come up with a real movie instead of \"found foot ages\"",
            "content": "Looks like the director has found an easy and cheap way of making films in which all he has to worry about is a handy CAM. All that he ever has to do is to record some people from around and after adding a title, releases it as a \"found foot aged\" movie. I'm really getting sick of this found foot age type junk. this is an easy way out where you do not have to plan anything and you end up making a movie in just few dollars. If you think you cannot do any better please stop making films and do something useful for the society. I hate people who watched and made that rotten para-abnormal activity a popular film. Hey Mr. Director, Come up with a real movie. you can't fool people every time with your nonsense found footage crap.",
            "review_date": "2015-05-15"
        },
        {
            "review_title": "Drags a bit, but improves as it goes along",
            "content": "Three young conspiracy theorists stumble into much more than they bargained for when they devise a bold plan to break into the legendary government base Area 51 to find out if rumors about alien life on said base are indeed true. While director/co-writer Oren Peli takes a tad too long to set the basic premise up and the opening third feels more than a tad padded, Peli nonetheless still manages to generate a considerable amount of nerve-wracking tension and thrilling excitement once our obsessed and determined protagonists break into the base and find themselves in considerable jeopardy. The briefly glimpsed extraterrestrial creatures are genuinely creepy and convincing. The acting by the game no-name cast is solid and persuasive. Nice chillingly grim ending, too. By no means a perfect movie, but overall a solid and effective little sci-fi/horror thriller.",
            "review_date": "2020-09-22"
        },
        {
            "review_title": "Extremely satisfying",
            "content": "See when you're dealing with aliens, you just don't know what to expect. They could teleport or take over your mind. They can shapeshift, or time travel. We think we are cutting edge because we've finally learned how to isolate individual electrons. We think we're advanced because we've created Qbits. False. Our reality is actually most likely a simulation. The simulation is being created holographically by an extra-dimensional alien race. I think this movie did very well in showing what Area 51 could actually look like. We'll never get to see it in real life so the fact that they made this movie was pretty awesome. It gave a really amazing glimpse into what it could look like. The directing and acting was great. This is real Sci Fi.",
            "review_date": "2015-05-17"
        },
        {
            "review_title": "A wasted opportunity to bring the interesting idea alive",
            "content": "Area 51: Directed by Oren Peli and written by Christopher Denham and Oren PeliI have to just lay this out there for folks right off the bat. I can not stand found footage movies. That shaky cam and trying to make things realistic to make people believe that what is happening is real really make me nauseous. I get severe motion sickness from watching this type of cinema. I decided to forgoe my distaste for found footage movies because I found the idea behind this movie to be interesting. Three friends decide to sneak into Area 51 and document what they find there. Every person who is interested in aliens and UFOs know all about Area 51 and everyone wants to know what is going on there. I'm no different. I went out there to Rachel, Nevada to visit it. I got a little giddy by watching these places on the screen again. I enjoy it and I'm intrigued by it. I still have this nagging feeling though that this movie had no need to be found footage. It could have been a standard narrative and achieved far more success. When they make it into the base and the camera is still going wild, I had a difficult time determining what was happening. I wanted to know some semblance of what was happening. I wanted those moments between the friends and the woman who helps them where we learn about who they were as people. I wanted to know why they were obsessed. We never really learn much about any of them. You also find yourself asking why are they still filming when things go insane. It's the same question people ask when they watch a found footage movie. Making this a standard narrative removes that problem from the story. The ending was also blah. It has that usual bad ending that a lot of these found footage movies have and it was kinda BS. The beginning spoils this ending as well. The performances are pretty meaningless and outside of the interest in UFOs and Area 51, there's nothing to do here. It's scattered and a wasted potential. I hate to see that. I give this movie a D.",
            "review_date": "2018-04-13"
        },
        {
            "review_title": "6/10!",
            "content": "A rather...strange movie. All the clichés of what an alien could be, but interesting at some points!",
            "review_date": "2021-09-22"
        },
        {
            "review_title": "Better than the rating suggests",
            "content": "This film is a pretty solid found footage movie. I have to concur with other reviewers and agree that the first hour could have been condensed into at most thirty minutes. That said it is important to see Area 51 for what it is and it is a low budget horror movie that relies on all of the stereotypes of found footage films including camera work too shaky for you to really see too much of what is going on, lots of people running about yelling, people who seem to value their camera's more than their own lives etc. Right, now that it out of the way, the film is actually quite enjoyable and pretty tense. It is clear from the get-go that the group are going to end up inside Area 51 so that is not a spoiler. How they do this is pretty clever in my opinion. The story is pretty interesting as it progresses. We have it all soldiers, men in black, scientists, aliens chases, the works. I didn't really care for any of the cast but as a piece of 90 minute no brain work needed entertainment I think it is certainly worth the time. A solid six from me.",
            "review_date": "2015-08-18"
        },
        {
            "review_title": "Greatly underrated",
            "content": "The way this movie starts off with the sort of frat boy vibe to it, I didn't have much of an expectation. I found myself riveted to the tv about half way in and it was definitely worth it. It's a suspenseful ride and considering lower budgeted I was very surprised. It's not the movie of 2015 but seeing some of the other reviews it's a testimony for me that consensus is not always in line with ones taste.",
            "review_date": "2020-02-17"
        },
        {
            "review_title": "Boring found footage",
            "content": "This movie is a complete waste of time. Its a found footage movie, and its a total waste of time. For more than 3/4 of the movie, you just follow these guys while they are on their way to Area 51. And nothing happens. Nothing, zip zilch.\nAnd the last quarter of the movie, is just screaming and confusing.\nI rather watch paint dry on a wall.",
            "review_date": "2020-05-07"
        },
        {
            "review_title": "Utter Cr%&",
            "content": "OMG how bad is this film, its like its been put in a shredder and randomly glued back together again, the film jumps the dialogue too, it is totally awful awful film. All I can say is this is like a film students first effort and randomly shoots everything this is by far the worst film ever made utter garbage",
            "review_date": "2019-02-04"
        },
        {
            "review_title": "Start well but end in terrible way.",
            "content": "The first part is good, the center part is bad, the end part is terrible. If you like UFOs stay away. If you don't like ufos watch some other movie.",
            "review_date": "2019-11-20"
        },
        {
            "review_title": "Unrated",
            "content": "I actually thought this was a really interesting and good ending found footage film. I would day this and Apollo 18 are unrated and worth watching.",
            "review_date": "2020-06-06"
        },
        {
            "review_title": "Very surprised in a good way",
            "content": "I'm shocked that this film only has an average of 4.1. I thought the trailer looked really cool. The movie starts out a little on the slow side and like the guy said before me, you could've condensed the first 70% into about 10 minutes. But it's worth every minute. I'm a ufologist (a person who studies ufo's, alien abductions, etc). I have a friend who actually works at area 51 and she's brilliant. By brilliant, I mean a brilliant mind. Funny thing is, her area is studying alien life, lol. I'm not joking either. Anyway, everything I've read and learned about area 51 over the past 20 years seemed amazingly accurate in the film, and honestly, I don't know how they pulled it off. But it worked surprisingly well. And the last 20 minutes of the movie are intense! Go see it.",
            "review_date": "2015-05-17"
        },
        {
            "review_title": "A very slow \"build up\"",
            "content": "I'm sightly disappointed at the final product. We've literally been waiting 2 years for the movie to finally get released and this is what we get? The major issue that I personally had with the movie was the build up. It just takes way to long to get rolling. You can literally skip the first 40 minutes without missing anything. That's how bad it really is. Granted, towards the end the movie gets actually really interesting but unfortunately most people don't even make it that far, I reckon.The movie itself is clearly targeted towards conspiracy theorists who might not have such a hard time getting over the aforementioned fact.",
            "review_date": "2016-10-12"
        },
        {
            "review_title": "Not as quiet as a church mouse, but still more fun than i expected at 4.9.",
            "content": "The film has many flaws. The group is terrible at \"sneaking around\", and the filler set-up could have been chopped-down a bit. They're also a bit TOO prepared imo. All that said - when the film gets to the last half \"actually doing it\", it IS genuinely fun exciting stuff, and some of the ideas were fresh and looked rather convincing. It's totally unrealistic, but if u can suspend your disdain for that aspect and just sit back and enjoy the last 45 minutes, you might be Pleasantly surprised(again, given its rating). It was more fun(& actually rating a touch higher) , albeit not as well acted as \"child 44\"(its rental companion). I say watch it. Its not nearly as bad as the score. I think some of the younger crowd votes this low because they think this young group is stupid and silly, just like they are, but they don't want to admit it.Don't get me wrong. Concept wise its ridiculous. They're clumsy and loud while sneaking around. The ending could have had a twist of sorts but really doesn't. BUT, its still quite fun and thrilling at times. 52/100 I've seen much worse. You'll like this if you liked: the signal( tad better), cloverfield(much better), or that found footage flick were the young couple is in bfe ireland(cant remember name/ about even or slightly below this).",
            "review_date": "2015-08-05"
        },
        {
            "review_title": "Area 51, or 51 minutes of pointless trip prep footage.",
            "content": "Apparently Oren Peli had been working on this project since 2009, and there was plenty of hype surrounding what it was going to be like after his success with the overrated but fun \"Paranormal activity\". After finally getting it out to us in a limited theater release and on demand, I must say I was a little skeptical due to that type of small scale release, and that it was another found footage film which we have been bombarded with in the horror genre of late. I went in with low expectations as with most horror and found footage type films. This film starts at an incredibly slow rate trying to show 3 friends in their preparations to break into the heavily guarded and controversial Area 51 base. It seems like for about an hour they wasted time with unnecessary scenes en route to their destination. Just absolutely unnecessary scenes that could've been cut down into about 30 min rather than 60, but I'm sure it was cheaper on the budget this way. When they FINALLY arrive things do actually start happening and getting somewhat interesting. They find some alien technology and a UFO which had some creative yet cliché aspects. They then find some sort of secret chamber in which you definitely start thinking you'll see an alien pop out. After some tense suspense and claustrophobia you realize they aren't going to really show any aliens, but just rely on jump scares and loud bangs. At this point the movie is pretty much wrapping up and it does have a pretty cool unexpected ending which I won't get into detail with, but I still can't believe they barely showed the aliens at all. You get maybe one scene where you can get an outline of a gray, but other than that it's a tease. For what this was hyped up to be, it was a huge disappointment, but I wasn't surprised honestly. If you want to waste an hour watching the build up to a half hour of creative and decently ambitious and exciting found footage, then go ahead. Just know that it takes awhile for things to start. If you're looking for visual aliens, this really doesn't offer any probably so they could save on the budget which must have been pretty low. All in all an entertaining last half hour of found footage, yet overall a very boring mediocre film.",
            "review_date": "2015-05-15"
        },
        {
            "review_title": "Awesome",
            "content": "So the US government will probably never tell us what REALLY happens at Area 51 but this film is an excellent speculation.According to this movie if you manage to sneak past the motion sensors, cameo dudes and cameras that guard the base you will be met by minimal security and just freely be able to wander around inside without having to worry about more surveillance cameras.They stole security clearance card that wasn't immediately cancelled after the theft hmmmmm....From what I understand workers at Area 51 don't get to take their clearance cards home with them they get given them when they enter the base to work there and have to surrender them when they leave, and all access clearance cards like shown in this movie don't exist. According to documentaries I have watched you clearance card only grants you access to the specific area you will be working in, not every and any door in the base.I will not hate on this movie just because it is a 'found footage' movie with grainy and shaky imagery. Although I don't tend to like this specific genre of movie I watched it because it seemed like a sequel to 'Hangar 10', a movie about Britain's Roswell.It did annoy me that after they set the alarms off all they seemed to be doing mainly was running around panting \"Gotta get outta here...Gotta get the f outta here.\" A 12-year-old could've written a better script.The had every detail planned on how to get in to the base as well, but didn't seem to have a plan for getting back out again. Somehow one of them managed to escape the base and all its external security without any stealth suit or sensor jamming equipment right before getting getting dragged up into a spaceship. The ending seemed a bit rushed.",
            "review_date": "2015-12-16"
        },
        {
            "review_title": "IMDb: Populated by Hipsters.",
            "content": "First off; I'm a massive found footage fan. Always have been since the initial Blair Witch Project (Which I also thought was a masterpiece of a movie - Especially for the budget.) Even now, I still think it's completely relevant to the horror genre.Area 51 isn't perfect. I don't think any movie is; possibly with the exception of Fight Club. However it's the best piece of cinema I've seen lately. I think it's ludicrous that Area 51 has received a 4.3 rating when movies that are much worse (YellowBrickRoad) receive a much higher rating.Not even gonna lie; when I watched YellowBrickRoad I was expecting it to pick up any moment. The entire time. I was left feeling robbed, cheated and in a state of confusion - What the hell was that garbage?It seems reviewers on here only tend to give high ratings to the \"Artsy\" films with subtle hints at trivial things.. Like a plot. Or any body whatsoever to the movie..This was entertaining. It did the job and definitely does not deserve a 4.3 rating.",
            "review_date": "2015-05-16"
        },
        {
            "review_title": "Complete Nonsense",
            "content": "I wish I wouldn't have wasted my time watching this, as it was nothing but complete nonsense from start to end. In my opinion, you will be dumber for watching it. There's no possible way anything done by the kids in the movie could have been accomplished to penetrate the defenses of the Groom Lake facility, just for starters, let alone getting into buildings or finding what they supposedly found, and the ending... good lord.",
            "review_date": "2017-11-04"
        },
        {
            "review_title": "Has the Key Ingredient if Not Much Else",
            "content": "The pseudo reality style of film is easy to paint yourself into a corner with if you are a filmmaker, in the same way that writing in the first-person is a trap to avoid for fiction writers. As an example of that style, \"Area 51\" indeed becomes awkward from time to time. Notwithstanding, pound-for-pound, \"Area 51\" is one of the better recent examples of the pseudo reality style of movie, a style which can, after all, be chosen simply to meet budgetary restrictions. Therefore, I'm not deducting substantially for use of that style.What I liked about this movie is that it built and sustained suspense in a very healthy and economical way for a science fiction horror movie, and for that type of movie, that's the key to success.Although \"Area 51\" started off somewhat weakly, as its story and tension built up, I gradually liked it, until, by the end, I actually liked it more than I disliked it. So I gave it a six out of ten stars.",
            "review_date": "2015-09-03"
        },
        {
            "review_title": "\"From the director of Paranormal Activity.\" That says it all...",
            "content": "If you really enjoyed PARANORMAL ACTIVITY and thought the director was a genius, then you might enjoy this. If you hated PARANORMAL ACTIVITY and thought it was cheap and amateurish and undeserving of the \"hype\" it created before its release, then you most likely will not enjoy AREA 51 either.I don't believe in the alien angle that has been thrust upon the real Area 51, though I do like the real mystery that it presents - that being a top secret military compound that is creating all the next big technologies. I do also like aliens though, and I am a sucker for alien Area 51 movies, even though I don't think our government is hiding some dead alien from the Roswell crash or reverse-engineering an alien spaceship.There are some decent and pretty good Area 51 alien movies and \"documentaries\" out there, but this one is just not one of them. It's just more of the same old, same old found footage where nothing worthwhile happens until the last 15 minutes or so and even when something does finally happen, it's a huge disappointment.If you want to watch good found footage films or POV films, in my opinion, there are some pretty cool ones...such as: REC & REC 2, CLOVERFIELD, TROLL HUNTER, V/H/S & V/H/S 2, GRAVE ENCOUNTERS & GRAVE ENCOUNTERS 2, THE TUNNEL MOVIE, THE LAST HORROR MOVIE and even THE BLACK WATER VAMPIRE. I would suggest, by far, watching any one of those over AREA 51.",
            "review_date": "2015-05-20"
        },
        {
            "review_title": "Not a scary film, but I don't think it's supposed to be",
            "content": "I believe this movie has been mis-labeled. It is by no means a \"horror\" film. It is, however, better classified as a \"sci-fi thriller\".I enjoy the found-footage genre, for the most part. When it's done correctly, which this film is. Everything that's filmed makes sense given the context. Quite a few times, my adrenaline was up while watching and I was genuinely concerned about the main characters.That's one of the things I liked about this film was the character development. Unlike a lot of thrillers, where the characters are hackneyed and cliched, these characters were actually written like people and you can genuinely understand where they're all coming from.So I do recommend this movie, just not as a horror flick.",
            "review_date": "2020-05-29"
        },
        {
            "review_title": "Found footage alien romp",
            "content": "A grouplet of three twenty-somethings sneaks into Area 51 with all this gadgetry that HAS to exceed their credit card limits! First the central character gets zapped or transfixed or some such at a party that happens to be near Area 51 - the 51st state. As a result he becomes obsessed and convinces one of his two best buds to break into Area 51 with him. The other won't go but agrees to drive them there and wait for them while they go on they adventure. Also a girl comes along for reasons that make her important enough to do so. This flick is kinda great for the FF fanatic, which is me. It's fun to watch the outlandish plans be made and then later unfold. FF always, if well done, has an air of unsettled tension. It's like a layer of safety has been removed. That's the situation once they get into the Area. It's like the men who chase them are the safety and if you run away from them you have removed a layer of safety. For instance they never would have gotten into the tots scary underground catacomb-like place. They never would have unleashed the alien who chases down Darrin in the Jurassic Park cafeteria scene. Which wasn't half bad.",
            "review_date": "2020-07-22"
        },
        {
            "review_title": "So, you're telling me...",
            "content": "That Area 51, a government facility holding top secret answers about the very existence of intelligent life forms in our universe that could unleash chaos upon our world, has such terrible security that 3 average jackasses can sneak into it?Okay I'll be honest, it all seemed believable when they were explaining how they were going to get near it and went through with it, but how were they walking around inside without getting caught? Does Area 51 not have security cameras and guards monitoring them 24/7? They were legit sneaking and walking around inside the base and no one notices this until near the end. Like.....I know I said this already, but just stop and think for a second about how stupid this sounds.A government facility, funded by unlimited amounts of money, which holds answers to hard questions we ask every time we look into the sky, has such terrible security that 3 average teens/young adults holding cameras could break into it...........'kayOtherwise, the acting was passable, the special effects were great, and the found footage feel was there, I just couldn't get over how stupid the writing was.",
            "review_date": "2017-05-21"
        },
        {
            "review_title": "Just fast forward to last 20 mins",
            "content": "The only reason, I saw this was that, I got it confused with report 51, which I thought this was.I found this movie, very boring from the start, so dull and I fell a sleep in first hour.they were far , far , far to much build up and when stuff happens.Nothing really stand out, as we don't get to see anything. I had to rewind last 20 mins 3 times, as the rest of the movie drained me out and i still nodding off again Yawn fest, not need to see unless you want a nap Going to rate this 3 out of 10",
            "review_date": "2015-05-18"
        },
        {
            "review_title": "It's entertaining...",
            "content": "If you enjoy \"The Blair Witch Project\" this one will add something to the \"found footage\" genre :) I liked it, although I am sure that I watched it only because of the quarantine.",
            "review_date": "2020-03-31"
        },
        {
            "review_title": "Well that's 91 minutes of my life wasted....",
            "content": "To describe this film as awful would be unkind to awful films. The entire thing is supposedly constructed from \"found footage\" meaning there isn't a steady shot in the entire thing and those inclined to motion sickness may feel the need to vomit. To make matters worse, much of it is seen through a \"night vision\" meaning it's green and viewed through a telescope.Then there's the story - or should I say the lack of it. This isn't a movie that reaches a conclusion - there isn't even a hint at a story arc. Instead there's a basic premise (that the main character was abducted by aliens and now feels compelled to break into Area 51) and a complete lack of any sort of resolution - why does he feel that way? what was his mission? Did he succeed? This film feels like a student art project with a special effects budget. Do yourself a favor and avoid!",
            "review_date": "2015-09-04"
        },
        {
            "review_title": "A poor attempt at film making...",
            "content": "You would think that young film makers want to be noticed...so they would try very hard to create something memorable...The only thing memorable about this movie, is the realization that these kids thought shakycam is super duper...This is a one camera (cell phone???) adventure, that bounces your eyeballs from start to finish, trying to watch it...and that is it !! Nothing more, no script, most of the time a single flashlight for lighting...and, of course, that shaky view that makes you wonder, \"Where's the story, where's the movie...\"I surprised myself by actually giving this a 2 star rating...",
            "review_date": "2018-10-02"
        },
        {
            "review_title": "Area 51 is NOT a horror film! Its a good sci-fi!",
            "content": "This is a surprisingly effective sci-fi. And certainly has something that other \"found footage\" movies do not have. All my life I have been a major horror genre fan, who happens to like sci-fi too, but obviously there are differences in said genre. To be honest I sat back and prepared myself for a \"very\" standard movie ride, and as for reading the terrible reviews I had almost convinced myself it would be awful. Its NOT! Area 51 is certainly more stylish and well thought out, but it is certainly not a horror film. The flow of the movie is smooth in what I call a nice to bad situation. For instance I call \"single white female\" and \"fatal attraction\", to be \"nice to bad\" films. You can feel the passion for the base, from the characters, who are likable, and come across as just a bunch of young friends on an adventure. There are no jump scares that might induce a heart attack, and the dialogue is clear and not drowned out by music or effects. You feel as if your on this adventure with them. If your a fan of sci-fi or conspiracies about area 51, I am sure you will be impressed by this solid effort. So turn off the lights, grab some popcorn and a beer, sit back and enjoy. This movie is unpretentious, and refreshingly does not take itself too seriously. However, if your looking for a horror gore fest, please look elsewhere...This is NOT a horror movie!",
            "review_date": "2016-01-23"
        },
        {
            "review_title": "Wow......",
            "content": "How the F*** did this script get funded???? But please let me say, i really love Paranormal Activity.I am so speechless right now..... gosh.....So... let me say what you want to know.This movie has it all, it got:* 2 (!!!!) minutes of Aliens * unlikable Characters * really stupid story-development * and again 2 !!!!!! MINUTES of aliens and i am rounding up!!!Oren Peli really destroys his starting moviecarreer with this one.I am really sorry for him.... but..... wow what a heck.",
            "review_date": "2015-05-15"
        },
        {
            "review_title": "Area - Fifty Dumb",
            "content": "First things first.This movie wants to copy Blair Witch really hard. REALLY hard. So expect a lot of shaky cam and night vision use. Unlike Blair Witch, the camera work is terrible here.Second, this movie is dumb.Characters have no useful skill-set that's ever specified. You don't know who they are, what their skills are, why they suddenly decide to turn suicidal and break into a military facility.. nope, nothing. One guy at the start of the movie is supposed to be kidnapped by aliens (this isn't a spoiler, trust me), at least that's what I think happens since the movie is about aliens. For all we know, he got drunk and wandered around. But that STILL doesn't explain why his black friend is stupid enough to follow a nut-job trying to enter into an army base. Don't these people have jobs?So when three nobodies, manage to casually walk into a military facility, running around laughably in the open, with only ONE SECURITY CAMERA in the whole base (which they fail to avoid, of course)... you know you are in for a treat. Don't even get me started on the terrible acting, script, camera-work, lighting and CGI. The aliens especially are just hilariously bad and I burst out laughing the first time they showed one moving on-screen.Anyway, this movie lasts for 1hr 30mins. The alien bits happen after 1hr 13mins of watching them run around in an empty military facility with no security cameras (except THAT one which they fail to avoid).This is just torture. I am betting real aliens probing you would feel like a heaven after sitting through this.",
            "review_date": "2016-11-10"
        },
        {
            "review_title": "underated",
            "content": "Top 10 found footage movie for sure! good acting, good effects, area 51 looks amazing, this is the best alien found footage movie in my opinion!",
            "review_date": "2020-06-06"
        },
        {
            "review_title": "Blair Witch Meets the Aliens - Area 51 - MST 3000 Fodder",
            "content": "MST 3000 always needs new fodder for its really bad turkeys, and this film? is really qualified for the Turkey Farm. Unintentionally hilarious. I was waiting for Joe Flaherty from Second City Television to come on the screen halfway through and say \"That was a really scary one, eh kids?\" Not. Hopefully Oren Peli can find another line of work.",
            "review_date": "2019-09-06"
        },
        {
            "review_title": "3 words, Stupidest Movie Ever",
            "content": "I don't know what I just watched, I don't know how they even managed to categorize this movie, SMH. It is nothing of a horror, No thrill Anywhere, and Sci-Fi Only because it had to do with aliens/more just talk about aliens, but other then that, Nothing! Total waste of my time, Thank goodness I didn't pay a thing to watch it but I would like my hour and a half of my life back. There is No explanation to Anything that \"happens\" in it's entire story-line. I honestly don't know How they managed to spend Five Hundred Thousand Dollars on this, other then paying a Sh*t ton to the one guy who plays himself, and for no reason as he sucked and wasn't in it long. How can anyone even justify spending that kind of money on the most Boring film Ever! Go feed poor people with that movie, not make crap. And whoever thinks my review \"sucks\", you obviously don't know a good or bad movie when you see one.",
            "review_date": "2015-07-01"
        },
        {
            "review_title": "Below average found footage",
            "content": "One of plenty found footage movies that don't even try to be creative with its subject.The film maker could go absolutely wild with this Area 51 conspiracy flick but for some reason decided to stick to \"safe\" cliché depiction of what's inside the base.The \"big reveal\" at the end is laughably poor and makes you regret sitting throw the mediocre acting and story telling.Also movie raises so many basic questions like - why were there no security cameras inside this top secret lab/base, what those ppl would do with the video after getting out (since their faces/names are all over it.",
            "review_date": "2020-02-11"
        },
        {
            "review_title": "Alien horror film",
            "content": "Good visual effects. - Very slow - Plot was more then weak.Simply it was hard to watch without fast-forward. Had higher expectations but it is the oldest clichés film that I've have ever watched.For being a remake, they could have done a much better plot then this.",
            "review_date": "2017-06-24"
        },
        {
            "review_title": "It is NOT as bad as some of the reviews",
            "content": "Let's please keep in mind this is an Indie film. I am not sure if people were expecting this movie to have a $100,000,000 budget but it didn't. With that said, I thought the movie was fairly well directed and the acting was not bad at all! I have heard some mention the lack of \"scaryness\". I don't think it would be considered a horror flick. It is a faux documentary.What I liked about the film: I thought they did a pretty solid job at building the suspense. I fully expected to watch this and see Greys everywhere and with little suspense. I also felt like the movie was as believable as it could possibly be (considering 3 twenty somethings getting away with, what they got away with. I gave this a 7 because it was a low budget film and yet they pulled it off pretty well. I guess the room for improvement would be; a few guards showing up in the film. That would have made it a little more believable",
            "review_date": "2015-06-22"
        },
        {
            "review_title": "Poking around",
            "content": "Do you believe in Aliens? Does it matter? Everyone knows about Area 51 and the rumors ... probably even a new born baby. Alright I may exaggerate a little by saying that .. or a lot. Add to that the found footage aspect and you got a winner/loser - depending on your first feelings on hearing that. I'm certain the movie will not convince you of the other if you already have strong feelings towards it.It has its moments of course and especially the beginning is quite intriguing ... and then the end on some level of course. The added scene after the credits is a nice touch, but again ... do we need it? How many have seen it and would they even feel they missed out on something?",
            "review_date": "2021-04-18"
        },
        {
            "review_title": "Ugh",
            "content": "I was hoping for a little better than this. These bunch of idiots couldn't keep their traps shut for 5 seconds. Then there is the \"go down the stairwell in the loudest shoes\" part, thinking they are being all kinds of stealthy in the worlds most secure \"secrete base\". If they are going to try and pass off a movie like this being anywhere near supposedly serious, they should at the very least try to do it properly, and not have the viewer want to look for 6' of rope to end it all quicker. Dumbed the IQ down right from the get go. Please, please, I implore you to stay away from this movie. Go watch something more stimulating for the mind...like the latest Barbie movie.",
            "review_date": "2015-05-18"
        },
        {
            "review_title": "Don't waste your time",
            "content": "What an awful ending. It left all 10 of us thinking what a dumb film. It tries to build suspense but fails at delivering. I think the producers are running out ideas with this found footage style genre.We are led through corridors, hallways and rooms in area 51. Someone accidentally breaks a glass containing a floating rock of some sort, OK, no problem, but it leads to nothing after wards. They trip the alarm and get split up, then an alien starts haunting them, just wondering why they didn't attack all the soldiers but only one is killed by the alien.Then the ending is the worst, the rest of the crew are dragged into the spaceship, again the aliens must be prejudice and racists not to drag all the soldiers too.The film leaves you thinking...yeah...OK there.",
            "review_date": "2015-05-16"
        },
        {
            "review_title": "No one does night shift at Area 51?",
            "content": "This is a stupid film. Where are all the guards? Are we really expected to believe that if the US government had a spacecraft in Area 51 there would be no one guarding it?There's a lab with alien technology and a device that negates gravity just lying in some unlocked side room. The characters are VERY loud for people \"sneaking\" into top secret military base. They speak loudly and whisper loudly. They run down corridors shouting to each other, voices echoing. The girl irritatingly shout-whispers \"OH MY GOD THEY'RE GOING TO HEAR US\" - so stop shouting and maybe they won't hear you? Although I don't know who they think is going to hear them since according to this film no one does night shift in Area 51.They eventually set off some alarm and the only two guards that apparently are on duty chase them around a bit.The only good thing about this film is the irritating characters all probably die in the end.",
            "review_date": "2015-10-10"
        },
        {
            "review_title": "Entertaining",
            "content": "I was entertained. It's not a great movie, but for movie night it's not too bad. Popcorn and laughs makes it better. Don't expect to be scared though, it's not scary. In some places it reminded me of Outlast/Outlast 2 and Blair Witch Project (as in the original) -but sadly with none of the scary factors.",
            "review_date": "2017-09-25"
        },
        {
            "review_title": "Weak...",
            "content": "Despite the super beat technique, camera in hand, blurry image, darkness, fake documentary, I love these B terrors, about area 52, Ets and the like, curious and inconsequential young people, it was kind of boring from the middle to the end I survived in fits, the interesting, weak ending, one of the weakest on the subject, but it was worth wasting a few minutes for it...",
            "review_date": "2022-06-12"
        },
        {
            "review_title": "Enjoyed it!",
            "content": "There have been so many poor reviews from hardcore movie buffs for this movie. I for one, thoroughly enjoyed this film. It had a great story, it was fun, the buildup was great, and at times, it was quite intense. I caught myself holding my breath along with the cast most of the time. They didn't use cheap jump scares like 70% of movies made in recent times rely on. It's definitely not a \"scary\" movie, but more of a sci-fi thriller with some surprises. It had my attention until the end and it didn't have many \"slow\" parts. There were a few cheesy jokes and a few bad acting moments, but all in all, it doesn't deserve the terrible ratings that it's been given by so many viewers. Before you judge this movie, please do yourself a favor and watch it. You may end up enjoying it as much as I did!",
            "review_date": "2015-09-09"
        },
        {
            "review_title": "Quite awful to say the least...",
            "content": "I put this movie in my watch least about a year ago expecting something of taste and frankly it was a quite a deception. I could not sit watching this movie without doing something else on aside. The action takes million of years to take place and not really much does happen unless around the middle-end of the film. The acting is what it is but when you can't really see the action it's hard to actually evaluate the actors.This movie is really actually hard to judge considering the angle with which they decided to shoot it. It's really hard to see and understand the action most of the time. Quite terrible to be honest. As for the end, it's actually quite anti-climatic but at the same time you could not expect much from a film where more than half of it is about literally nothing.I'm really deceived to say the least.",
            "review_date": "2016-01-31"
        },
        {
            "review_title": "Yet another \"advanced\" alien species that allowed inferior humans to capture them.",
            "content": "Not as bad as one would expect a found-footage UFO flick to be. In fact, I expected this to be worse. A film that perpetuates the goofy 51 myth, but also perpetuates a fact we all know so well: that UFOlogists are the laughing stock of the \"scientific\" world.Yes, the aliens are bug-eyed (OK, those are merely their suits - a slight attempt at originality). Yes, the aliens fly around in flying saucers. Yes, the aliens are so elegant and advanced they don't need any machinery to fly their circular thingies. Yes, the aliens are held captive by the U.S. government who for some reason never want to tell us anything about them. (Nor do we understand how come superior creatures allow themselves to be trapped and held by such inferior species as humans). Yes, Area 51 is made up of huge underground mazes just as you've seen them in computer games. Yes, those mazes are quite empty whenever intruders find themselves there. Because, clearly, it takes 5 people to keep the aliens imprisoned.So, yes, it's full of idiotic cliches. But it's also watchable. Sure, it tells us from the get-go that nobody survived, which kinda makes the ending less exciting (not that it would have been a lot more exciting if we didn't know), but this IS found footage, which means that whoever filmed the nonsense must be dead, abducted or exploring alien dimensions in a hypercube or something or other.",
            "review_date": "2019-12-10"
        },
        {
            "review_title": "Interesting premise - Terrible by the final act",
            "content": "I remember putting Area 51 on Netflix one day because I was bored and even though it's silly, I like the set up and the idea of how they get in to Area 51. However once the film actually gets going, there is cliché after cliché with a ending that was really quite crap. If you don't take it seriously (which is probably what they intended because it does get rather silly), you'll have fun - especially when if you're drunk with your friends and need a bad movie. But if you're sober, don't bother.",
            "review_date": "2020-02-26"
        },
        {
            "review_title": "Disgrace to found footage",
            "content": "Ridiculous film. Had some terrible clichés - mysterious planes shuttling into Vegas without tail numbers?? You may as well print \"top secrety secret plane for secret people\" down the side of the fuselage. The site security pretending to be a tourist given away by the absence of license plates on his car?? Top secrety secret car... it felt like site security was set up by Austin Powers.As they are approaching the base the line \"security should be quite light at this time of night\" was a personal favourite. It turned out to be so light in fact they were able to shout without being heard at certain points as they were galloping around. Appalling acting ending with a spectacular anticlimax.",
            "review_date": "2017-10-11"
        },
        {
            "review_title": "Good concept",
            "content": "1. From the creator of Paranormal Activity franchise. I liked the whole vibe of this film with somewhat believable plot and scenario. The realistic set pieces, practical and visual effects (outstanding for a $5 million production budget) brilliantly made it as a real life found footage film. I loved the UFO design, it's function and it felt real and awesome. But the tedious direction and the extremely slow pacing damaged this films' enjoyability.I love these kinds of films. It's such a shame very few are made nowadays.2. From the creator of Paranormal Activity franchise. I liked the whole vibe of this film with somewhat believable plot and scenario. The realistic set pieces, practical and visual effects (outstanding for a $5 million production budget) brilliantly made it as a real life found footage film. I loved the UFO design, it's function and it felt real and awesome. But the tedious direction and the extremely slow pacing damaged this films' enjoyability.I love these kinds of films. It's such a shame very few are made nowadays.",
            "review_date": "2022-08-28"
        },
        {
            "review_title": "not a bad found footage type sci-fy",
            "content": "This was an alright film. Acting was ok and I always enjoy a good fan footage type film. It was interesting the way the movie went and revolving around area 51. There were some parts that made me jump. Not a lot of scares and there shouldn't be. Overall a good watch.",
            "review_date": "2022-07-15"
        },
        {
            "review_title": "Average Alien Found Footage",
            "content": "There is no way these characters would want to do what they did and there is no way they could do what they did. That said, let's say four idiots with GoPros break into Area 51, release Aliens and run around. It is original and well acted. It has some great sets and effects. I wish the characters were likable and I wish the writers had spent more time developing a story that made sense.",
            "review_date": "2020-03-15"
        },
        {
            "review_title": "There Be Aliens",
            "content": "Very effective found-footage horror film from Oren Peli, the director of \"Paranormal Activity\" and produced by Jason Blum, who would go on to produce \"The Purge\" franchise as well as many other modern-horror classics like the Oscar-nominated \"Get Out\". The actors in this film are what makes it. Some viewers thought the action before they get to Area 51 was the low-point of the film and that it picks up but I am of the opposite sentiment. I enjoyed the banter and the build-up. Once we get to Area 51 the film adequately changes pace and style and although it's low-budget is very telling at points (Area 51 is clearly some out-of-hours industrial estate) it is nevertheless effective at raising and sustaining suspense. Completed in 2011, I believe, this film did not get a release until 2015.",
            "review_date": "2022-01-03"
        },
        {
            "review_title": "Area 51 memes storms coming this summer",
            "content": "If you want a happy ending don't look at handhaled camera UFO movies especially this. Now let's see if groundbreaking news will come out of the real Area 51. Good movie for an space themed Halloween party.",
            "review_date": "2019-07-20"
        },
        {
            "review_title": "I loved it personally",
            "content": "IF you are into Government conspiracies,UFO's or generally interested in Area 51 I think you will have fun watching this movie. The acting was good,not bad in any ways. This is not one of those cheesy B-movies that TV stations put out. Sure the story of the movie is way out there but fun to watch none the less. There are some good tense moments and this movie is not boring in the least. It kept me interested until the very end and is one of those movies where you are wondering what will happen next. I compare it to the 'Wicksboro incident' another great similar film.I enjoyed it and recommend giving it a watch!",
            "review_date": "2015-06-12"
        },
        {
            "review_title": "Utter crap, but a somewhat ok last half hour",
            "content": "I have seen 10 ratings (thus a superb movie), compliments about the acting, .... In matters of taste, there can be no disputes. For my taste : utter crap. Still some stars for a few points of interest and a nice pace in the last half hour.",
            "review_date": "2021-09-10"
        },
        {
            "review_title": "A promise unfulfilled.",
            "content": "This is a garbage movie. I was somewhat encouraged at the beginning as it started well enough. The tension was good at points to hold my attention but then it just unraveled. The whole point of this movie is it is building up to something but that something was just not worth the wait. They started with a half- decent concept but had no idea where to go with it. The whole plot just fell apart. The ending is so lame and predictable that it beggars belief! Really? Is that the best you could come up with?They came they saw they just wasted my time.Don't waste your time... it simply is not worth the time and energy.",
            "review_date": "2015-08-13"
        },
        {
            "review_title": "Open your mind and focus....",
            "content": "I read a lot of reviews about this movie and they were usually negative but I still decided to give it a go. The movie starts off slow but with the realistic aspect and everything is done very well. The actors make us believe that they are real people. It starts with bunch of people saying that the people (the main characters) are not crazy and that they were normal.Then we are off from there in the car where the main characters are recording and driving, they go to a party and have a good time but one of the main characters *Reid* goes missing and they drive off looking for him and accidentally stumble upon him on the middle of the road. He seems to be in a trance state and gives no explanation as to what happened to him but they don't think much of it. *Spoilers* But this is where I think everything begins. He was obviously kidnapped by aliens and they implanted something in his head that lead him to the area 51, this is referring to when he tells his friend that the place seems to be calling to him. Then they meet the locals and one of them seems to be a crazy guy, says they sent him out here and we just dismiss him as a crazy guy. But this movie requires a lot of brain-thinking from the viewers. As they infiltrate into the base and they go deeper and deeper, they stumble upon a UFO and when Reid touches it, it does something, but then the girl tries and nothing happens. This is where you have to start thinking that something is going on. They go into the lab and find an anti-gravity rock and some white liquid but it appears to be moving itself when the girl is close-by and it tries to throw itself at her *hints hints*!.They go to the caves/tunnels and they find human dresses and alien rubber suit explaining that they might be like space-suit but clearly Aliens are big and scary when we are being chased at some point. The girl claims that one of the dolls looks exactly like the one she had when she was a kid. Her father was also trying to get into this place but why? Maybe they're doing experiments and she's a hybrid alien/human.Then things go downhill very very fast and it just ends with everything thinking what the hell just happened? This is stupid. But what you actually have to do is broaden your mind and reverse the whole movie and think. You have to focus on very specific things to be able to understand this movie. It's very intelligently written. You have to be willing to think outside the box and look for the main points they're trying to throw at you. You have to remember what happened before and connect the dots, as to why Reid was gone missing? In the end you can see UFO flying away and then they take their friends.. I think it was an escape plan by the aliens who kidnapped Reid earlier in the movie.",
            "review_date": "2015-07-27"
        },
        {
            "review_title": "Is that it?",
            "content": "Seriously? Is that it? Really? Ok, this guy has never set foot on any military base anywhere ever. The sheer mundanity of these places you can't set foot anywhere without being noticed, anytjing out if place stands out like a sore thumb. Throw in young adults crashing and thrashing about the place like a humpback whale in crockery shop. Why did I watch this to the end? Even within the genre it fell away, ideas set up but not explored. It could be reworked to make a genuinely frightening film with the strong aliens among us myth.",
            "review_date": "2019-12-22"
        },
        {
            "review_title": "Found poo",
            "content": "I'm a fan of found footage. This ruined it right out of the gate... first rule: no credits or title cards. Second: give a reason why or how it's found, and why we're watching it. Even if you use the same \"first time being released to the public...\" stuff. Literally an hour of boring background. Once they arrive it's still boring and hard to see. The ending was so boring, and I felt like I saw this one a thousand times. Ugh, skip.",
            "review_date": "2022-05-08"
        },
        {
            "review_title": "Should be declared Off Limits.",
            "content": "In this 'found-footage' movie in the vein of Blair Witch, four teens come a serious cropper when they decide to venture into Area 51 on a hunt for alien life.But not as unlucky as the audience members unfortunate enough to stumble upon this mess, which takes an age to get to its destination with pointless stops at a party, strip club and various motels along the way. Also, chatter. Lots and lots of trivial chatter. Zzzzz.Even when we do reach the alleged extraterrestrial hotbed (which is FAR too easy to break into, btw) things proceed at a snail's pace, with only the last ten minutes providing anything by way of excitement. By then, it's already too late, and you'll probably wish to be sucked up into the sky like our unlucky protagonists long before the credits roll.No, for a movie with a meagre 5 million dollar budget, I don't expect perfection. What I do want however, is a few thrills, chills and the feeling this is all actually happening.When everything mostly feels dull and fake (climax aside) I think I'm entitled to feel a bit gipped. Many exciting horror films have been made on a shoestring, with tons more excitement and professionalism on offer. It can be done, guys. So try. 4/10",
            "review_date": "2019-09-13"
        },
        {
            "review_title": "Boring",
            "content": "I never liked found footage movies ala Blair Witch Project, so this was a big No for me as soon as it started. I gave up after 10 minutes, I couldn't care less about what was happening: a party, college kids getting wasted and jumping naked into the pool, meh... I quit watching.",
            "review_date": "2022-01-04"
        },
        {
            "review_title": "More suspension of disbelief than ten movies put together.",
            "content": "My friend told me this was awesome. It's not bad but I didn't really like the ending.The director did a lot with a little.So little. Be warned. Don't watch this movie with a critical eye. If seeing a sawhorse in an empty concrete room and being told it's part of Area 51 will anger or annoy you then definitely don't watch this movie.But each movie has its own internal reality. And budget. Though at times this felt a bit lazy. But mostly I just didn't love the ending.",
            "review_date": "2021-08-03"
        },
        {
            "review_title": "Area 51",
            "content": "Considering the topic it should be interesting. But when you keep the audience on tenterhooks, and you don't show anything, you are letting. And the getting caught breachin a government facility.",
            "review_date": "2020-06-24"
        },
        {
            "review_title": "OK enough",
            "content": "I think the movie is simple enough. It has moments of thriller and suspense, but not really that extreme like most horror mockumentaries' third act. The film isn't filled with theories of Area 51 and more about the experience that can only be done with characters with simple reasoning. It's like watching B-slasher movie. It's bad but it's ok enough to watch.",
            "review_date": "2022-08-12"
        },
        {
            "review_title": "Dissatisfying",
            "content": "Watched this as it was on TV and i couldn't sleep. It was boring apart from when they got inside but then it turned weird at the end Spoiler alertThe ending where they get lifted up is so stupid and over used in most other movies about aliens. Just boring and stupid and confusing but nothing else to watch then sure.",
            "review_date": "2017-03-08"
        },
        {
            "review_title": "The Truth is Not in Here",
            "content": "Director Oren Peli's first feature was the phenomenally successful \"Paranormal Activity\" back in 2007. If he'd directed \"Area 51\" the following year, it might make sense as an attempt to strike while the iron was hot. But an eight year gap raises expectations that this film can't meet. This is competently made but bland in every way. Three friends, one very reluctantly, hatch and execute an elaborate plan to break into the secret facilities of Area 51, where our government supposedly experiments with aliens and/or alien technology. At one point the reluctant friend, Ben (the only character with a modicum of personality), refuses to go on until the ringleader, Reid, satisfactorily explains what is driving him forward in his plan. Viewers might well want to demand the same of Peli and co-writer Christopher Denham. If \"The X-Files\" taught us that the Truth Is Out There, \"Area 51\" teaches us that only people with a clearer vision than Peli and his collaborators can help illuminate it.",
            "review_date": "2015-12-02"
        },
        {
            "review_title": "If that's what Area 51 is, we are screwed",
            "content": "A little too extravaggant on many issues. Hyperbole one many issues (what/how/where in sci fi and science) and not enough visuals to explain it. Not enough for effective horror.",
            "review_date": "2019-01-04"
        },
        {
            "review_title": "Didn't last 5 minutes",
            "content": "I was very excited to see that the director of the original Paranormal Activity did this, but immediately lost interest. The instant killer of a found footage-genre movie is bad acting. It's even worse when there's some really decent acting mixed in with the bad so that the bad stands out and turns you off. Some of the interviews at the beginning of this made me feel as if I were watching a collection of zoom auditions for a community theatre production. Some felt natural and believable, while others were so over the top and melodramatic that I knew instantly that there was no way I could continue watching. Do better with casting next time.",
            "review_date": "2022-09-26"
        },
        {
            "review_title": "Beam me up",
            "content": "A truly awful movie. It's boring and long, nothing happens. Frankly, it's just bad.",
            "review_date": "2019-12-29"
        },
        {
            "review_title": "Well I didn't like paranormal activity either so...",
            "content": "I dig horror movies and sometimes even the mystery behind found footage flicks. I was one of the few who liked Blair Witch 1999 and those old school cannibal holocaust movies of the 80s. Paranormal activity wasn't that great and I really thought all of those movies were boring. I saw this on tv because my internet was acting up and couldn't stream my Shudder subscription.Anyhow this came on, so why not? What a snooze fest. Some scary noises, gooey stuff, and jump scares about as fake as the chicken in Subway sandwiches. Nothing about this movie is scary which sucks because the premise is there for something that could have been a decent science fiction movie. I learned this was made in 2009 when another movie about aliens came out called The Fourth Kind. That movie was freaking intense when I saw it in a packed theater. This one is more like those bad horror flicks that come on Netflix all the time.Skip this and check out The Fourth Kind instead.",
            "review_date": "2022-10-16"
        },
        {
            "review_title": "Average film, yes..but these reviews are just idiotic",
            "content": "If the first line of your review is \"I don't like found footage films\", you're an actual idiot. Not because you don't like found footage. Rather, because you chose to watch something you knew you weren't going to like and then came here to tell us you didn't like it. Your review is absolutely pointless.Anyway, for those of you who, like myself, really love found footage horror, this is going to disappoint you. It's not bad but it certainly isn't anything worth watching. This movie had a decent budget and was even backed by the guy who did Paranormal Activity. Most found footage horror movies are working with scraps and tiny budgets. This film had the resources to create something special but completely failed.",
            "review_date": "2021-09-28"
        },
        {
            "review_title": "Not a bad found footage movie",
            "content": "Wasn't expecting much but recorded this the other week on film4 and have actually got round to watching it. It kinda reminds me of Chronicle the way it sets up with the main cast. The only thing with found footage films is that the camera bounces about and it hurts my head after a while.The story is decent although they seemed to be able to break into everywhere a little to easily for me. Also I couldn't really understand where the big powerful alien came from and why it was different to the others. The film left me a little creeped out which I'm sure was its purpose. Not a bad effort and certainly a genre that I would love to see more of.",
            "review_date": "2022-11-06"
        },
        {
            "review_title": "No comments",
            "content": "Completely waste your time!! Please do not watch!!!",
            "review_date": "2020-11-02"
        },
        {
            "review_title": "Dreadful!",
            "content": "Not worth one star. Made in a style virtually the same as Blair Witch. Very poor characters, none of which I managed to have any rapoor, in fact they were all extremely irritating human beings. As surrutiouse invaders of a government facility, they were probably the most noisy I've ever heard or seen. Dreadful film!",
            "review_date": "2021-04-01"
        },
        {
            "review_title": "Garbage",
            "content": "It's just the sheer arrogance that anyone thought this formulaic garbage was good enough that people spend their hard earned money on. Of course as I've never been involved in film making it's easy to judge...... it's also fun. I hope the producers hate themselves.",
            "review_date": "2021-02-01"
        },
        {
            "review_title": "Area 4.5",
            "content": "Quite disappointing, was expecting much more. Too much time dedicated to presenting the characters - that are as tedious at the 50-minute mark as they are at the beginning of the movie - compared to the actual action that only gets slightly interesting in the second part of the last act. Guys, dark corridors and empty rooms are creepy, ok, but enough is enough! A note: IMDb doesn't currently allow users to rate movies using tenths so I must clarify: my displayed rating of 5 is actually a rounder 4.5",
            "review_date": "2019-09-08"
        },
        {
            "review_title": "A desent found footage Film.",
            "content": "I honestly do not understand the raters that hated this movie. Sure, it could have a better ending and a little better setting at first. But , in general, it was suspenseful with good directing and montage.I really like \"found footage\" movies so that is something to consider. But, as objectively as I can, I am telling you this was a good ,fictitious view of how area 51 would be.I can say that I would also make some change during the film and at the ending. But what can you do?I would recommend it.",
            "review_date": "2022-07-25"
        },
        {
            "review_title": "The same 'generic' found footage horror with a touch of classic Alien mythology.",
            "content": "After watching the previous Alien abduction 'found footage' film, the segment in V/H/S/2 and Extraterrestrial i had no excitement in any found footage styled alien movies. I thought the character development was sadly dull, seeing as they took their time doing character development while it takes 45 minutes for them to actually break into Area 51. As a fan of extraterrestrial horror movies i was hoping to see more aliens or spacecrafts though i was very pleased to see that the spacecrafts were designed to look like actual UFO's instead of a H.R Giger inspired machine. Buuuut sadly the film did exceed to disappoint and show that the popular question 'will we ever have alien contact? can be questioned the same as 'Will we ever get a found footage movie that isn't generic and terrible'",
            "review_date": "2015-05-22"
        },
        {
            "review_title": "Gripping film - pleasantly surprised!",
            "content": "I didn't know what to expect with this film but it's a really good effort with a gripping story. It follows some fairly standard themes around Area 51 so no surprises there, but it actually delves into more detail than other attempts I've seen in this genre. It was well planned and the ideas (no spoilers!) had been really thought through.The CGI was impressive and the style of filming was unexpected but worked really well with the storyline. This is an entertaining horror film that sits outside of the box. It's definitely worth a watch.",
            "review_date": "2017-09-27"
        },
        {
            "review_title": "Waste of time",
            "content": "After watching the trailer I thought this movie will be pretty good. I was wrong. Please avoid this movie, it's just a waste of time. It has few exciting parts, but the story has not been explained properly. I am really confused about the ending.\n2/10",
            "review_date": "2020-04-01"
        },
        {
            "review_title": "Bad movie with some cool elements.",
            "content": "Just to sum it up immediately, it is not a good movie. Typical \"found-footage\"-type movie. But what I liked about it was that the approach towards the Area 51 was filmed on the actual route to Rachel and ahead from there. The stuff that will happen once the group is inside the so-called Area 51, is quite boring and not that well made. But the first part of the movie is well worth watching, especially if you have been in Rachel.",
            "review_date": "2019-12-30"
        },
        {
            "review_title": "Needs a sequel.",
            "content": "This was one of the Best films in this genre. I really enjoyed it.",
            "review_date": "2020-03-19"
        },
        {
            "review_title": "it's ok",
            "content": "A lot of filler in the beginning but overall you tell tell that they at least tried and put effort in most parts. It's a movie where you probably wouldn't watch it more than once. Rarely scared me but its pretty suspenseful.",
            "review_date": "2022-05-28"
        },
        {
            "review_title": "Awful, just awful",
            "content": "This is what happens when you let the 12 year olds in the drama club make a 'film' using mobile phones. This found footage thing didn't impress me with Blair Witch, it seems to have set a really low standard for anyone who fancies being an actor/director/writer. Badly shot poorly lit heavy breathing scenes with poorly executed jump scares featuring out of focus 'dad with a grey bed sheet over him' don't achieve the jump or the scare. So disappointed that this waste featured in the so bad it's bad section of Kermode and Mayo's Friday film reviews.",
            "review_date": "2020-04-07"
        },
        {
            "review_title": "The death of a genre",
            "content": "If Blair Witch was the birth of the shaky camera/reality, horror genre; then Area 51, must surely be the death of it. One amusing aspect was the ease in which the over excited troop gained access to Area 51, which then returned to the usual boredom of nothing. Because nothing happens. Until about ten minutes until then end, but you've well and truly lost any interest you may have had for the rather two dimensional characters. Some films are good because they are bad, while others are just bad.",
            "review_date": "2020-04-07"
        },
        {
            "review_title": "Worst film",
            "content": "I dont know why this film is made. Idea is good but filming is worst. Cam not still for a second. Worst film i ever see.",
            "review_date": "2018-09-02"
        },
        {
            "review_title": "Really Disappointing",
            "content": "I expected so much more from an Oren Peli film. Missed the mark and what could have been a much better film.",
            "review_date": "2018-07-06"
        },
        {
            "review_title": "Omg please",
            "content": "I almost fell asleep! Seriously! Is this a joke?!!!!!",
            "review_date": "2020-07-15"
        },
        {
            "review_title": "Se queda en intenciones..",
            "content": "It's a film that promises but never fulfills the expectation of viewer. Abuse art \"hand-held\" and makes this type of film is not the novelty as if it was \"The Blair Witch Project\". On the other hand we must emphasize that were able to create the atmosphere a little too much favored by the good luck of the protagonists, but they failed to give a final chord and the little that is he had managed it was diluted in the final minutes. For lovers the genre \"UFO\" maybe they can find some nice, but not I think it is a part of the genre icon . The performances are not all bad for being a teen movie I finally left the each approach the final conclusion , really to me, not like me .",
            "review_date": "2015-05-26"
        },
        {
            "review_title": "B Movie",
            "content": "I mean, I hated Blair Witch and this is another handheld first person filmed movie. That said, the suspense and build up is very good. But it is pretty sh't.Enjoy it if you like a very slow burn but for me it really isn't very good.2/10 just because I thought it was crap. Lowest score I've ever given.",
            "review_date": "2022-03-17"
        },
        {
            "review_title": "A solid yet forgettable flick",
            "content": "Straight to the point: it's not great, but it's certainly not bad. Starts rough, but eventually gets better when things start happening.The characters won't hold this film up. But some cool special effects and clever little twists kept me watching.",
            "review_date": "2019-12-08"
        },
        {
            "review_title": "Area 51",
            "content": "Spoiler Alert, it is a terrible movie.What a waste of an estimated $5 million dollars. Having worked in stage production and in American theater I know that there was some hard work done by the actors and the film crew. But the plot is terrible and the writing isn't much better. And the entire premise is simply ridiculous. There is no way anyone can \"sneak\" into Area 51. \"Three young conspiracy theorists\" simply walk in without anything but some cell phones. Come on a twelve year old would know to be better prepared. Jeez, next time ask one of your children to proof read the script and then listen to them! Sorry, even decent acting and a few good props will not save a bad idea.",
            "review_date": "2016-08-14"
        },
        {
            "review_title": "Terrible",
            "content": "I started watching, and quickly got irritated with the hormonal teenage antics. I thought it would get better, it got worse. Due to the trailer I was sure it would soon get better, maybe it was good in the bit when I dozed off, but I will never know, as I won't be watching again. Bad acting, bad filming, dialogue often indecipherable, unbelievable, just bad!",
            "review_date": "2021-02-22"
        },
        {
            "review_title": "Biggest crap of century",
            "content": "Tons of crap in the history of man kind. An unconnected themes which was not making sense. This movie even does not deserve 5 minutes of watching. Waste of time and money. Do not know what was writing doing while calling it a horror and thriller. It was so easy to intrude in such a high surveillance area, making so much noise and none is watching. Even the guards arrived and they managed to escape.",
            "review_date": "2017-08-26"
        },
        {
            "review_title": "Interesting till the end",
            "content": "The Movie is very interesting to me as I am interested in the Subject described in its Name. I think, those who are interested in the same Thing, will find this Movie good and positive. Of course, I can not say that the Film is 100% realistic, but at least it tries to be as realistic as it is possible for the Movie. The \"Atmosphere\" of the Action keeps you intrigued till the End. Not to make a Spoiler I can say only that the final Scenes of the Movie were not as I expected them to be. P. S. There is still no Movie (in the Humans' Cinema of the Year 2018) where I could find the Process of close Communications with extra terrestrial Humanoids which some of us have experienced or wished to experience. The closest I could find is the 'Arrival' Film of the Year 2016.",
            "review_date": "2018-06-12"
        },
        {
            "review_title": "Spoiler: It's a rip off...",
            "content": "Blatant rip off of The Blair Witch, but about aliens.Don't believe me? Watch or rewatch the original Blair Witch and then try to sit through this steaming turd of a movie. Notice any similarities?",
            "review_date": "2021-10-05"
        },
        {
            "review_title": "So-so",
            "content": "If you loved Paranormal Activity, you're going to love Area 51, if only for the simple reason that we're going to need a boatload of sequels or one hell of an extended edition to understand what was going on.We are introduced to Reid, Darrin, and Ben who are going to a party in the middle of nowhere in some big house. Soon enough the party gets started and during the party Reid loses a bet. The punishment? Karaoke! Just before the song starts, there's a power outage and Reid disappears. Thinking he chickened out, Darrin and Ben leave for home not much later. They almost run over Reid, who has been away without an explanation.Skip ahead 3 months. Reid has started to act weird. So weird that he starts making plans to sneak into Area 51. What they find there is a few random, not to mention cheap, jump scares and a lot of loose ends.As far as found footage movies go, Area 51 is not the worst. (I refer you to my review of the 2012 movie Hollow for that). It's also certainly not the worst. All in all, you have a decent movie that perfectly straddles the middle ground between terrible and brilliant without leaning too much either way.",
            "review_date": "2015-05-20"
        },
        {
            "review_title": "The best thing to do with this movie",
            "content": "The acting is bad, the script is not existent, the plot (using the word loosely) is unbelievable even for sifi standards. The props are ridiculous. For example: When getting ready to hike into area 51, they are well prepared with maps, only one problem, they are a stack of aviation sectionals, not topographic maps. If you are determined to watch this movie I recommend that you: Get your favorite alcoholic beverage Get your friends together Start the movie Take a drink every time you hear \"f*ck.\" See who passes out last. The game should be over in about 10 minutes. If you don't drink, don't waste your time If you do drink.... it is still a waste of time. My recommendation is find another movie.. FAST! You have been warned.",
            "review_date": "2015-09-14"
        },
        {
            "review_title": "This is Awesome",
            "content": "This is a Awesome Film first of all,This is one of all time favourites Paranormal Activity Type film, Although i did expect a lot more from this film i still enjoyed it anyways. The characters a flawless they are play there roles really well.The Main objective in this movie was to break into Area 51, there some parts in the movie i think that were confusing or could have been taken out and would still would be a Great film.What i wanna know is why did the end have to end like that don't most films end in a happy ending Thanks,",
            "review_date": "2016-11-15"
        },
        {
            "review_title": "Like Paranormal Only Terrible (and not scary)",
            "content": ". I watch the movies so you don't have to. And this week I watched \"Area 51\", which is available for free on Netflix. And it's overpriced. Area 51 was written and directed by Oren Peli. If you google \"Oren Peli\" you will instantly see a picture of a man who looks like he is named \"Oren\". He is worth fifty million dollars and nothing in this review will have any effect on him. He is the writer and director of \"Paranormal Activity\", which, for a found footage movie, did not suck. Area 51 sucked. But let's not focus on the negative. We have all eternity for that (Preview- You and Me minus Me watching \"You Me and Dupree\" for 100 years- with occasional breaks for forcible sodomy). Area 51 did some things right. It didn't overuse certain horror tropes. For example, at no point in this movie did Sean Bean die. He just wished he was dead, while watching it. I assume that this movie was footage found by Sean Bean. It just makes it more sense to imagine him watching it. So aside from that, it was all pretty much what you would expect minus anything remotely scary. There were teenagers with portable cameras who had a plan to break into Area 51. This was inspired by their friend (played by Reid Warner), who was clearly under Alien Control the entire movie. Through a series of time filling drivel compelling escapades the teen (or young adults-it doesn't matter) make it to Area 51 and the third act of the movie begins. This is the only portion of the film that has special effects. Nothing remotely scary here either, just a lot of alien technology. I kept thinking that at some point the teens would come across scientists dissecting an alien, a live alien, and that the film would end with the teens being captured by an alien that they set free and they would find themselves on a dissection table. Or whatever a table that dissections take place on is called. SPOILER- that doesn't happen.In fact, the ending is simply that, it's the end of ninety minutes of nothing. No big twist, scare, or fulfillment of any subtle promise made earlier in the film. In similar films, like the Blair Witch Project, the last thirty seconds of the film justify the first ninety minutes in a spectacular way. Not so much here. This movie would have been better if the first ninety minutes were the characters driving to area 51 while watching \"Paranormal Activity\" on an iPad. At least Sean Bean would have seen something entertaining. On a side note- there was one scene in the movie where a woman's breasts were thrust in front of a camera. It reminded me of the scene in \"Airplane\", where for no reason breasts filled the camera. I could not help but think that somewhere on the west coast, the day before this scene was shot (for Area 51), this woman had a conversation with a friend, perhaps a lover, where she said \"tomorrow I'm going to be shooting a scene for a major movie! It's being done by the director of Paranormal!\" Maybe she called her dad and told him. She was uncredited in this film. One Star. One Star for crushing the dreams of this uncredited actress, you sick bastards. That was the only angst this movie caused. And we don't even know her name. http://majorhorror.blogspot.com/2015/09/area-51-review-by- damien.html",
            "review_date": "2015-09-30"
        },
        {
            "review_title": "It's all about the Grays",
            "content": "In terms of cinematography it's not gonna announce for Oscar or any festival prizes, but in terms of telling facts that people wetness early in their ages it does that with simply way which make it so connected because it's just a guys adventure.... This film has lower rate because people still don't believe there is some other creatures living with us in this flat earth and government in different country deal with them secretly this simple adventure tells that in interesting film",
            "review_date": "2021-02-19"
        },
        {
            "review_title": "If you like the style of filming, It's pretty good!",
            "content": "First off, if you don't like the shaky cam films then don't watch it. I personally like the style of films. I thought this movie was well done, found it very..satisfying, most movies about aliens and stuff they never really find anything but this one was different. It was a little slow at first but wasn't totally unwatchable like others have stated. It quickly gets to hidden secrets and trippy stuff. It's like he wanted to go down the rabbit hole so bad, once he was in it it just kept getting deeper. Once he got to that last point, he knew he had gone to far and was f*ct. Just like that guy told him. That freaked me out. N that's what I was looking for.",
            "review_date": "2016-01-25"
        },
        {
            "review_title": "Awful movie, awful concept.",
            "content": "This movie was, quite easily one of the worst I have ever seen. The acting was mediocre at best, the plot was non-existent, and the ending (if you can even call it that) was predictable, in the sense that whomever wrote the script for this pile of alien manure ran out of ideas and completely copped out. The filming is headache inducing (think of a drunken Blair Witch Project, and that's pretty much what you get.) The only saving grace is the actor portraying Reid, while not being the greatest actor in the history of cinema, is at least easy on the eyes. This is, sadly... an hour and a half of my life that I will never get back. And neither will you.",
            "review_date": "2015-09-13"
        }
    ]
}