{
    "rating": 4.4,
    "release_date": "2015-04-17",
    "num_reviews": 190,
    "genres": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "summary": null,
    "reviews": [
        {
            "review_title": "Blart Side of the Moon",
            "content": "Don't get me wrong, this is a terrible movie. The only reason to watch it is when it is on mute and is synched up with Pink Floyd's \"Dark Side of the Moon\". Trust me, that is an experience!",
            "review_date": "2018-12-27",
            "lang": "en"
        },
        {
            "review_title": "Way worse than the original",
            "content": "I don't write reviews very often. I have to feel moved to write one.I liked the first Paul Blart movie. It was goofy innocent fun.IMDb can be a joke as people rate and comment on movies they have not seen. Many of these comments and ratings come even before the movie has even really been released. Many comments out there were bashing the first one and saying there was no reason for a second one. But yes, there was reason for a second one if it is well done.I will keep it light and avoid spoilers. This movie lacked the charm of the first one. Paul Blart was likable in the first one. For this one he was a total buffoon.In addition, the first one made sense as Paul Blart was the only person other than the criminals and hostages in the mall as it was closed. This one takes place in a casino in Las Vegas and everyone knows that they are open 24 hours a day. Why were the police never contacted? Paul Blart was never even hired by the casino as security he was only there for a convention.Also, the fighting scenes with the bad guys last 15 to 20 minutes. Paul actually only fights 2 guys on his own.I really wanted to like this one, but the 3 of us that tried watching it were all bored.There are a couple laugh out loud moments and this movie is suitable for families, but it was awful. Reminded me of the old Dana Carvey movie the Master of Disguise. Just a moronic stupid movie and not likable either. Do yourself a favor and leave your Paul Blart memories with the conclusion of the first movie. This script needed a major overhaul.",
            "review_date": "2015-07-22",
            "lang": "en"
        },
        {
            "review_title": "The Cinematic Equivalent of Getting Shot in the Face",
            "content": "Speed 2. Caddyshack 2. Exorcist 2. Star Wars Episode II. These are what are typically named as the worst direct sequels ever.Paul Blart: Mall Cop 2 may be worse than a quadruple feature of all of those. I mean it when I say Paul Blart 2 is one of the most unfunny, moronic, brain cell killing experiences I've had in a cinema. There's an extended sequence where an old man eats a rotten banana that goes on for around 15 seconds. The film begins with Blart's elderly mom getting killed by a milk truck. There's a part where Blart interrupts a stage show and knocks out all the dancers by spinning around on a rope while squealing. There's a part where Blart is attacked by and beats an exotic bird while a piano player nods and smiles (DUDE JUXTAPOSITION LMAO). There's a entire segment dedicated to showcasing multiple Checkov's Guns in the form of a mall cop convention (As if those even existed). I dunno \u0085 I didn't enjoy it.Blart is somehow more unlikable this time around. Rather than a smug dumbass, he's now a smug asshole. The \"film\" is 50% him making fun of people, 30% Blart falling down, 20% plot holes, and 0% funny. I maybe chucked at some points, but truth is I don't even remember the movie or what it was I chucked at. I can say for sure there are more helicopter shots reminding the target audience (Who to be fair also probably need to be reminded to breathe and blink) that the movie is set in Vegas than there were chuckles.You know that rotten banana I mentioned? Paul Blart 2 is that banana, and the man eating is is the decrepit and moronic public eating up the film's schlock yet again, probably paving the way for another opportunity for Adam Sandler and co. to shill even more money out of Hollywood for his posse. Like my painful experience with Transformers 4, people once again applauded upon conclusion, one elderly couple saying \"That was too funny!\"There's tastes in humor and then there's standards in humor. Paul Blart 2 wasn't unfunny to me because it did not pander to my sense of humor. If anything it should have; with all the misogyny and ridiculing of fat people it should have struck my dark humor funny bone. However, there's no gags, there's no punchlines, there's no jokes. There's also no emotional backbone, chemistry, or even real characters to back it up. Characters literally appear and disappear throughout the narrative. I don't even think the villain had a name. I don't think anyone not buds with Blart had one.This time around, not only is Paul Blart a bland copy of Die Hard, but Taken and Ocean's 11. The plot is a cluster-f of nothing. The first 45 minutes are, like I mentioned, just Blart riding around and getting up in everyone's faces for \"comedic\" purposes, with plenty of empty time given for the target audience to laugh hysterically at like a bad sitcom. The actual \"Paul Blart beating baddies\" isn't until the film's finale, and even then he doesn't actually beat anyone, because all of his \"weapons\" are stupidly non-lethal, including a stun gun that only stuns people for 5 seconds, a gun that shoots gum, a gun that spills marbles vertically, and a bean bag cannon. Two characters actually fall asleep in the movie, one of them twice. I felt a kinship to them for that reason.There's a romantic subplot with Blart's daughter and a bellhop that goes literally nowhere and an even more forced \"romantic subplot\" between a hotel manager and Blart. She gets progressively wetter and wetter for him throughout the film, which to me is too far of a stretch of imagination to comprehend and accept. This also leads to nowhere. The female cop on the horse in he trailer? That is literally the ending. Blart himself is beyond unlikable and revolting. He is not reluctant like John McClain from Die Hard, he craves to be the center of attention since his saving on the mall 6 years ago became utterly irrelevant the day after (I wish I could say the same for the movie itself). He's incompetent, rude, crude, and physically unable to actually do anything heroic. He'd make a good anti-hero if he wasn't presented as this humble all American goody two shoes as the movie does.The movie doesn't even take place in a mall. What's up with that? With truly atrocious jokeless dialogue (\"I will bring a folk guitar to a pumpkin fight, because that's how crazy I am!\"), beyond unlikable characters, an incompetent lead, a transparent and personality-less villain, disappearing subplots, stretched imagination, cliché and trope filled writing I can say Baul Plart: pop Tart Too is one of the worst films I've ever seen. Offensively stupid and brash, this blatant cashgrab managed one seemingly impossible feat, sink even lower than the previous film. Utterly baffling, this 1.5 hour Wynn commercial (Not a single scene takes place outside of it once they arrive) is to me the Transformers 2 of comedy, a wretched anorexic piece with no soul, craft, or effort put into it at all. The fraction of points I award it are for the laughs my friends and I had at making fun of it and a single shot that lasted a third of a second that looked pretty cool.",
            "review_date": "2015-05-26",
            "lang": "en"
        },
        {
            "review_title": "Come on, it wasn't that bad...",
            "content": "With the reviews here, I was expecting a terrible movie. I probably wouldn't have bothered with it but it was a free On Demand option recently. The worst thing about it was the lengthy setup, with plenty of exposition from the previous film followed by a lot of nothing before the actual story takes place. Once that began, I thought it had reasonably funny moments reminiscent of the original. I also appreciated that it had no memorable profanity that would have made it unsuitable for children, like so many \"family\" films these days. However, it was a one and done film; I don't see subjecting myself to repeat viewings.",
            "review_date": "2016-01-01",
            "lang": "en"
        },
        {
            "review_title": "More of the same",
            "content": "Although the original \"Paul Blart: Mall Cop\" was a box office hit, I don't think anyone was exactly clamouring for a sequel. But here one is, and it's pretty much like the first movie, namely that it's a comic take on the formula the action movie \"Die Hard\" gave birth to. While there are a handful of gags that this adult did find to be (mildly) amusing, the humor for the most part is simple-minded and lame, with a number of gags recycled from the first movie. Kids (YOUNG kids) might find the humor to be funny, but I think other adults like myself will sit in silence like I did. Is there anything of merit to be found in the movie? Well, Kevin James does bring in an instant likability, like he did in the first movie. But he really needs someone else to write his material. And the movie looks great, with expert photography and lighting that makes the colors pop out of your television set. So if your kids insist on dragging you to see this movie with them, make sure you get the Blu-ray disc.",
            "review_date": "2015-08-10",
            "lang": "en"
        },
        {
            "review_title": "Truly an excellent piece of art, one of the best",
            "content": "Perfect 10 is not a phrase I throw around often. However this movie truly deserves it. Kevin James of course reprises his deeply loved character once again and I couldn't be happier and honestly he delivers a performance on par with Robert de Niro in the godfather part 2. His character is complex and on many levels a hero. When I was younger I could only dream of having a movie such as this guiding me through my childhood. From the moment I see those segway wheels to the ending scene where Blart embraces death as a part of life and comes to terms with the fact his family died in a tragic fire while he was on duty, I was laughing and crying. This also has one of the best plots of a Kevin James film. *SPOILER ALERT* Paul Blart has all his escapades in what he believes to be las vegas. Unfortunately thats only a reality he created. As aforementioned Blart comes to terms with death etc. To further that This movie is actually a construction of Blarts despair filled mind. He went to vegas originally to drink and gamble his problems away until he fell into the deep depression. The very final scene is possibly one of the most tear-jerking scenes I have ever seen in cinema. Blart awakes and he walks through the graveyard where his family is buried. He breaks down in a flurry of tears before shooting himself in the head, thus joining his family. Truly this is an excellent film, worthy of its ten star rating #Blartforever",
            "review_date": "2015-04-29",
            "lang": "en"
        },
        {
            "review_title": "Paul Blart Mall Cop 2 was an unbearable watch",
            "content": "PAUL BLART MALL COP 2 review by Mike SmithAfter six years of keeping our malls safe, Paul Blart has earned a well-deserved vacation. He heads to Vegas with his teenage daughter before she heads off to college. But safety never takes a holiday and when duty calls, Blart answers.Well the first film wasn't the best movie I have ever seen but it was a good family movie and I did have some chuckles. On the other hand Paul Blart Mall Cop 2 was an unbearable watch; the jokes fall flat and they feel really forced. The first movie was a good family film, but to make your family watch this god awful sequel is more like torture.The cast did feel like they had fun making it but I wish I felt the same way about watching this movie. There wasn't anything good about the film at all so take my word for it and save yourself some time. Cheers and remember I watch the crappy movies so you don't have to.1 out of 10 edited by Samantha Locke twitter: @FatMikeTPK facebook page: https://www.facebook.com/FatMikesMovieReviews",
            "review_date": "2015-07-28",
            "lang": "en"
        },
        {
            "review_title": "Wasted money",
            "content": "I've never seen the original Paul Blart film, but from what the reviews say, it's apparently not bad. but the 2nd one is the real deal, it sucks.First of all, you could've hired a fanfiction writer to write the script, and it probably would have been funnier. Heck, I could've written a funnier script than what they came up with.There's only one real redeeming quality to this film, and that's it's physical comedy. Some of the bits were well timed, but most of the time, it's just Paul Blart falling down.The story is a hack plot. Blart's off to Las Vegas, and just happens to get wrapped up in the middle of an art heist. There's not much else that I cared about in the film.1/10...don't go see it.",
            "review_date": "2015-06-05",
            "lang": "en"
        },
        {
            "review_title": "Bigger Doesn't Mean Better",
            "content": "If bigger always guaranteed better, then \"Paul Blart: Mall Cop 2\" would surpass the original. As it is, this long overdue sequel about a buffoonish, hypoglycemic security guard at an obscure New Jersey shopping mall is neither as funny nor as fresh as its haywire predecessor. \"You Again\" director Andy Fickman has replaced \"Paul Blart: Mall Cop\" helmer Steve Carr for this harmless but predictable PG-rated laffer. Aside from either its change of setting or the elimination of two original characters, little has been altered for this lightweight action farce. Anybody who missed the 2009 original should know \"Paul Blart: Mall Cop\" was a parody of the classic Bruce Willis thriller \"Die Hard,\" with a colorful villain whose identity generated the biggest surprise of the film. Nothing about the identity of the criminal mastermind in \"Paul Blart, Mall Cop 2\" is surprising. Indeed, we know who he is from the get-go, and actor Neal McDonough struggles to make this colorless mastermind memorable. Original \"Blart\" scribes Nick Bakay and star Kevin James have complicated the \"Die Hard\" plot with an elaborate \"Ocean's Eleven\" heist. In a nod to \"The Expendables,\" the blundering Blart assembles a motley crew of older security guards armed with non-lethal weapons and pits them against a trigger-happy gang of younger adversaries with lethal weapons. Since you know Blart and company cannot fail, this action farce delivers its best laughs with sight gags that have little to do with its formulaic tomfoolery. The best scene in \"Paul Blart: Mall Cop 2\" has nothing to do with the heist. Our bumbling hero runs afoul of an exotic bird that gives him a royal pecking and sends him packing.\"Paul Blart: Mall Cop 2\" opens with our newlywed security guard discovering that his wife Amy (Jayma Mays) wants a divorce after six days of marriage. No sooner has Blart coped with this tragedy than he contends with another devastating disaster. Blart's mom Margaret (Shirley Knight of \"Grandma's Boy\") sets foot in the street to retrieve the newspaper. Out of nowhere, a milk truck mows down the dear old dame in a crude example of slapstick comedy. Now, the woebegone Blart is despondent because everybody but his teenage daughter has left him. All this occurs during the first quarter hour. Things change for Blart when he receives a letter with an invitation to attend the annual security guard convention in sunny Las Vegas. What our unsuspecting hero doesn't know is that his dutiful daughter, Maya (Raini Rodriguez of \"Babysitters Beware\"), has just qualified to attend UCLA in California. Wisely, Maya declines to let her distraught dad know about UCLA until she thinks he can handle her departure, too. Meanwhile, Maya and Blart check into the luxurious Wynn Las Vegas hotel and casino; the entire film serves as product placement for the casino. While Maya and Blart unpack in their room, an unscrupulous criminal mastermind, Vincent (Neal McDonough of \"Flags of Our Fathers\"), plans the crime of the century. Systematically and secretly, Vincent's gang of high-tech hooligans loot the hotel of art treasures on display and replace them with replicas. Inevitably, it is only a matter of time before Blart and Vincent tangle. This dramatic collision takes place because Maya and Blart quarrel about her extracurricular activities at the hotel. She wants to enjoy the sun and fun of Vegas without her domineering dad hovering over her shoulder. Earlier, when they unloaded their luggage, Blart did his best to discourage any chance of a romance between Maya and an attractive valet, Lane (David Henrie of \"Grown-Ups 2\"), who wanted to help handle their luggage. Anyway, Maya ignores her father and accompanies Lane to a party in the hotel. An anxious Blart tries to contact Maya on her cell phone after she disappears without a word to him. Blart is convinced that Maya has been kidnapped. Reluctantly, Maya tries to return his call, but the party is so noisy that she has to go into another room. Maya walks right in on the nefarious Vincent and his goon squad masquerading as hotel personnel. Predictably, chaos ensues. When Lane follows her, Vincent's hooligans take him hostage, too.\"Paul Blart: Mall Cop 2\" confines virtually all its action to the Wynn Las Vegas hotel and resort. Clearly, the filmmakers had the run of the joint because the cast rarely ventures outside to tour any of the other Sin City sights. Most of the scenes that occur inside the hotel look as if director Andy Fickman recreated them on a sound stage so as not to interfere with Wynn's business. Meantime, James and Bakay learned from the first film not to provide their rotund protagonist a romantic interest like Amy. Reportedly, James and Bakay wrote Amy (Jamya Mays) out of the sequel because Mays had scheduling conflicts between her television series \"Glee\" and \"Paul Blart: Mall Cop 2.\" Sequels that eliminate characters, unless the actors die in real life, sacrifice some of their continuity. Mind you, Mays would have been a welcome addition to the cast. Rather than providing Blart with another drop-dead-gorgeous gal, the writers have him play 'hard-to-get' with a hapless hotel manager, Divina (Daniella Alonso of \"The Collector\"), who reluctantly finds herself attracted to him. This creates comic conflict between Blart and Divina's jealous boyfriend Eduardo, who happens to be the hotel security chief, and Eduardo tries to upstage the presumptuous Blart. Most of the antics that James indulges in other that careening around for laughs on his Segway involve routine, uninspired slapstick. Aside from his flap with an exotic bird, James' second best scene occurs when he fills in at the last minute as the conference keynote speaker. \"If you believe the purpose of life is to help yourself, then your life has no purpose,\" he proclaims to applause. \"Help someone today!\" Altogether, \"Paul Blart: Mall Cop 2\" isn't as hilarious as its witty predecessor, but it is not a total bust.",
            "review_date": "2015-04-19",
            "lang": "en"
        },
        {
            "review_title": "Poor",
            "content": "Well this is just poor quite frankly.The first one, while not being great, at least made sense, and you rooted for the main character.This is contrast is just weak. The lovely ending of the first is quickly shot through, and Paul becomes increasingly unlikeable as the film progresses.Sometimes the powers that be should just be grateful a film was a hit, and not try and milk it with a sequel.",
            "review_date": "2019-08-14",
            "lang": "en"
        },
        {
            "review_title": "Bad cop",
            "content": "Superman II (1981)For a Few Dollars More (1965)The Godfather, Part II (1974)The Empire Strikes Back (1980)Aliens (1986)Lethal Weapon 2 (1989)Terminator 2 (1991)Toy Story 2 (1999)These are all sequels worth watching. Paul Blart: Mall Cop 2 is not one of them.This movie is a stinking pile of freshly laid horse manure. The first film was just about OK but here the character of Blart is smug, obnoxious, unappealing. He is more annoying as I recall from the first movie and star Kevin James co-wrote this film.The only positive is you get some nice shots of the Wynn & Encore Hotels in Las Vegas. However legendary hotel magnate Steve Wynn must be bemoaning the slack security in his hotels if the plot of this film is to believed.",
            "review_date": "2015-06-27",
            "lang": "en"
        },
        {
            "review_title": "Even Worse Than The First One!",
            "content": "Why on Earth would I choose to watch this movie when I disliked the first one so much? An excellent question that is! Honestly, I didn't really want to watch this, but my roommates were watching it so I joined them.It was bad! It makes the first one seem good. I suppose there are some people who would enjoy it, but they must be very drunk people. Everything about this movie is bad. The jokes are bad, the acting is bad, it's all so very bad. Do not recommend.",
            "review_date": "2019-03-27",
            "lang": "en"
        },
        {
            "review_title": "Not good",
            "content": "This isn't a good movie. Maybe cute, but not good. It's not even funny.",
            "review_date": "2019-02-16",
            "lang": "en"
        },
        {
            "review_title": "The U.S. City of Baltimore is burning as I write this . . .",
            "content": ". . . and people at Japan's Sony Corporation must be smirking as they enjoy the fruits of their inexorable onslaught of anti-American flicks such as PAUL BLART, designed to scorch our values blacker than Tokyo after its WWII fire-bombing. This ill-natured movie presents Mr. Blart as a U.S. law \"officer.\" Yet, it depicts him as an insufferable boor and clueless buffoon. Worse yet, he flees the scene of a hit-and-run crash caused by his reckless driving of the segue he has just stolen. He tries to kick and punch an exotic endangered bird to death. Blart cold-cocks an elderly lady doing community service to the floor. His demeaning psychological abuse of his only child seems sure to provoke her suicide, or at least a hefty shrink's bill. I've seen the movies Japan makes for Japanese audiences. They are NOT carefully calibrated to provoke social disorder and disrespect for Japanese authority. If you look at Columbia Pictures' releases since it was gobbled by Sony, nearly every one of them appears to be crafted to promote internal chaos (BLART) or international calamity (THE INTERVIEW) for the U.S. \"Blart!\" is probably a rallying cry for the too-impressionable youngsters cutting fire hoses as \"Blar-Timore\" goes up in flames. Sony must be deported NOW!",
            "review_date": "2015-04-28",
            "lang": "en"
        },
        {
            "review_title": "Don't watch it.",
            "content": "Do you ever watch a movie and pause at one moment and just think to yourself: Why? Why am I watching this? That's how I felt when Paul Blart was lying on the casino floor licking ice cream off of it. Paul Blart: Mall Cop (the first movie) is a harmless comedy that's just a lot of slapstick and goofy humor. In this adventure, Paul Blart and his daughter Maya, now grown up, go to Las Vegas for a convention after his mother gets run over by a bus. Maya tries to get romantically involved with this dude, but Blart, being the overprotective father he is, disapproves. Meanwhile, this bland heterochromic villain attempts to steal Van Gogh's Sunflowers, which for some reason is at the Wynn. Oh, yeah, another thing that sucks about this movie is that it seems like an ad for the Wynn. The signage on the hotels, while present throughout Las Vegas, is seen often throughout this movie. While the Wynn is probably is an extravagant place to stay, we don't need that much product placement in this movie. Plus, if you're spending your money to see this movie, you're probably too young for Vegas anyway. Anyway, the villain's eye color is the most memorable thing about him. What was his name again? So, after that, it's nothing but generic slapstick humor and cliché plot points. Way too much of the humor depends on Blart's hypoglycemia, which is not particularly funny, especially after its been done before. There's also a scene where he gets his ass kicked by a goose. There's one where he falls down stairs in a suitcase, and also a lot of jokes involving the use of Blart's Segway. It's just forgettable, generic, and above all, not funny. But what do you really expect? It's a comedy sequel. The list of good comedy sequels is very short, and this certainly isn't on it.",
            "review_date": "2018-04-03",
            "lang": "en"
        },
        {
            "review_title": "Blart gets even more unlikeable",
            "content": "Paul Blart (Kevin James) happily marries Amy but she divorces him a week later. His mom gets run over by a milk truck. He seeks comfort from his mall security job. He's invited to speak at the security officers' convention in Las Vegas. He takes his daughter Maya (Raini Rodriguez) on the trip but she's reluctant to tell her over-protective father about her college acceptance. There is an ominous new guest Vincent Sofel (Neal McDonough) at the hotel. Divina Martinez (Daniella Alonso) is the beautiful hostess.Did Paul Blart get more mean-spirited? It's understandable after Amy leaves him and his mother is killed. It doesn't make him or the movie more appealing. The character starts off at a deficit already but at least, his love for Amy in the first movie is adorable. This time around there is nothing likable left. The only cute thing in this movie is Divina's insistence to deny her infatuation with Blart.",
            "review_date": "2015-07-29",
            "lang": "en"
        },
        {
            "review_title": "A Neigh to This One",
            "content": "This movie shouldn't have been made in the first place. It pulled the \"Go Set a Watchman\" in the Paul Blart universe, completely ruining the heroic goodness of Blart and making him out to be a dickhead. Maybe Paul Blart isn't on the same level as Atticus Finch... But, the film ruined Blart regardless.\nAlso, for a stupid crime comedy, the comedy was weak and the plot was surprisingly difficult to follow. I'd go as far as to say there wasn't much of a plot at all. As for the weak comedy, the only jokes that were funny were few and far between and involved a horse.\nThis movie is generic, dumb, and shouldn't have been made, just as the second *Benchwarmers *movie shouldn't have been made.",
            "review_date": "2020-08-17",
            "lang": "en"
        },
        {
            "review_title": "I mean what is there to really say?",
            "content": "I mean what is there to really say? It is what it is. In the never ending vein of comedy sequels, one that is not warranted will always be in the mix. This time, \"Paul Blart: Mall Cop 2\" ladies and gentlemen. Kevin James once again proves why he is just an unlikable actor. Sure, he has had a few hits and/or decent performances, but when he continues to lead films like this, it only furthers his downward spiral. This time, Pul Blart is invited to a convention in Las Vegas, where he is lead to believe he will be receiving an award. Like every other cliche in the movie, of course a conflict had to happen. Paul Blart becomes the hero taking down bad guys again, and it is as unfunny as it is unnecessary. This film defines why we no longer need sequels to comedies, especially ones that never worked in the first place. There is not much to say about this picture really. It's script is horribly lazy, it's direction is un-inspired, and the comedy is slim to none. There is a forced attempt to make you care about the father daughter relationship, but it keeps going back and forth to the point that I didn't care. In the end, you know exactly what to expect going in, nothing good.",
            "review_date": "2019-09-29",
            "lang": "en"
        },
        {
            "review_title": "One major disaster of a sequel",
            "content": "In this sequel of the 2009 action comedy Paul Blart: Mall Cop, Kevin James returns as Paul Blart, a security guard at a New Jersey mall. He and his teenager daughter Maya (Raini Rodriguez), who is heading off to UCLA real soon, are invented to a security officers ' convention at a luxury hotel in Las Vegas. Along the way, Maya falls in love with one of the hotel workers (David Henrie), much to Blart's fear. While attending, Blart discovers a heist by a group of criminal masterminds who take Maya and her crush hostage and decides to take matters into his own hands by facing off each criminal one by one.I am gonna start by saying I really enjoyed the first film. While it was only an average comedy, Kevin James brought out the charm and laughter that many comedy goers could ask for. This film, however, is a total disaster. It was nowhere even remotely funny to the first film. It was filled an cheesy gags, unfunny dialogue, and dumb slapstick violence that fail bring out any sort of laughter. Throughout its runtime, I maybe laughed like once or twice; and they weren't good laughs, just quick little chuckles. The rest of time left me checking my watch multiple times. I was quite disappointed in Kevin James, he wasn't very funny this time around, nor were the other characters. Almost every one-liner they spit out just corny, dumb, or makes absolutely no sense. Like the first film, you have the gag where Paul Blart passing out when he runs low of sugar and gets some sort of sweet to re-energize himself. This part isn't even funny this time around. This movie just takes everything that made the first film funny and just throws it all way. It tries getting out its laughs by having characters act stupid and it just fails miserably. Secondly, since this takes place at hotel in Las Vegas, shouldn't it be called Paul Blart: Hotel Cop?Paul Blart: Mall Cop 2 is a big disaster of a movie, I didn't enjoy one bit of it. If you are looking to find a good time of laughter, you better look elsewhere.",
            "review_date": "2015-07-21",
            "lang": "en"
        },
        {
            "review_title": "As Good As the First One",
            "content": "I saw \"Paul Blart:Mall Cop 2\", starring Kevin James-Here Comes the Boom, Hitch; Raini Rodriguez-Austin & Ally_tv, Girl in Progress, and FYI, she is the older sister of Rico Rodriguez from Modern Family_tv; Daniella Alonso- The Collector, Friday Night Lights_tv and Neal McDonough-Captain America:The First Avenger, Minority Report.This is a sequel to the 2009 hit-it did make about $150 million-that follows the adventures of Kevin, and his exciting career as a mall cop. It takes place 6 years later than the first one-Wow, they even used real time- and Kevin is headed to Las Vegas for a security guard convention. His teen aged daughter, Raini, is tagging along, for support. Daniella is the hotel manager that may or may not have romantic feelings towards Kevin. Neal plays the required baddie that has plans to rob the hotel that Kevin just happens to be staying in. Neal just doesn't know who he is messing with. I guess it depends on whether you liked the first one or not-I did-but if you like goofy, slap stick comedies, this one is just as good as the first one. It's rated \"PG\" for violence and has a running time of 1 hour & 34 minutes. I enjoyed it and would probably buy it on DVD.",
            "review_date": "2015-04-17",
            "lang": "en"
        },
        {
            "review_title": "A better entertaining sequel then Hot Tub Time Machine 2",
            "content": "I liked the first Paul Blart, but did I think this was just as good, well almost. There are some funny scenes, but there are moments it comes across like it tries to hard, and the jokes are hit and miss in spots. Kevin James is enjoyable in the role, he is always fun to watch.The Die Hard send up works here like it did the first one, Paul while staying in a Las Vegas Hotel with his daughter, for a security guard convention, but becomes in a duel with some thieves who are robbing the Hotel.The scenes with the daughter does not give the movie much, and scenes with her sort off boyfriend pretty much go nowhere. But when this movie picks up it really picks up. Neal McDonough seems like he is having fun has the main villain. It's up there with first film, not a great film, but an entertaining film something that Hot Tub Time Machine 2 failed to be.",
            "review_date": "2015-04-27",
            "lang": "en"
        },
        {
            "review_title": "Here He Comes to Save the – Whoops! Crash! Ow! Sorry! – Day\u0085Again!",
            "content": "During one of those Three Stooges life retrospectives that pop up now and again on TV, I remember the narrator (don't remember his name) remarking about Curly Howard: \"Nobody likes him except the public.\" I think this observation applies to actor Kevin James as well. He may never become the darling of uppity, sophisticated, \"cultured\" critics, especially if he continues pursuing \"Lovable Schlump\" roles. But to the hoi polloi (regular folks), James perfectly embodies that endearing eternal underdog everyman determined to succeed no matter how many detractors he has, how many faults he has, and how many obstacles life puts in his way. This explains why his latest movie, \"Paul Blart: Mall Cop 2\" (hereafter \"Blart 2\") is confounding those disdainful critics with an unexpected, initial, 3-week box office take that has already twice recouped its $30 million budget, which by definition makes this movie a hit.In the first \"Paul Blart: Mall Cop\" movie, Blart (Kevin James) rises above his limitations to successfully defend a mall from, and eventually capture, an acrobatic band of thieves. In \"Blart 2\", the sequel, Blart has fashioned a noteworthy 6-year mall cop career (in spite of the headaches he receives from ungrateful customers he helps). Therefore, he feels confident that he will be chosen as the main speaker at a mall cop convention taking place in Las Vegas.However a series of set-backs, both self-inflicted and beyond his control, gradually seems to erode his self-esteem. Checking into a Vegas hotel with his radiant, sensible, and comfortably confident daughter Maya (Raini Rodriguez), Blart makes a self-conscious, clumsy, insecure fool of himself before Divina Martinez, the hotel general manager. He both annoys, and yet fascinates, Divina by boasting about his mall cop abilities and the desire Divina MUST be feeling for him. Blart also embarrasses and frustrates Maya with his obsessive overprotectiveness and suspicion towards her love interest, Lane (David Henrie) – a product of his fear of loneliness since his divorce six years ago. Worst of all, Blart learns that he was not chosen to be the mall cop convention main speaker. Finally, adding injury and insult to injury, an exotic crane-like bird kicks the crap out of him while he tries to seek solitude and pull himself together.Then dangerous things start to happen. While attending a party with Lance at an abandoned hotel suite, Maya accidentally opens a door to the adjoining suite, which happens to be occupied by fine art thieves led by the well-groomed, ruthless Vincent (Neal McDonough). Vincent holds both Maya and Lane hostage. Maya tries to contact her dad by cellphone, but Paul glumly ignores her calls both because of the main speaker slight and because Maya had earlier told him to leave her alone. But fate also has some good things in store for Paul. The main speaker has become drunk and incapacitated, so Paul is asked to substitute. After a faltering start, he manages to give an inspirational speech about why mall cops are needed. Maya's resourcefulness and scientific ingenuity finally manage to warn her dad about the danger she's in. As a result, Paul slowly gets his act together as he combines his own MacGyver-like scientific smarts, his killer Segway-riding ability, the help of his heroic fellow mall cop attendees Donna Ericone (Loni Love), Nick Manero (Nicholas Turturro), and Saul Gundermutt (Gary Valenture), and his fatherly determination to save his daughter to track down and confront Vincent's international, professional criminals.You could have a field day shredding apart \"Blart 2\"'s improbable storyline, ludicrous coincidences, and juvenile slapstick (e.g. Vincent and his team being found out by a teenager, Blart surviving a horse's kick). However, in my opinion, even at his bullheaded, maladroit worst, and even when you are cracking up at his predicament, Kevin James's Blart keeps you rooting for him, because he is fighting a world that thinks that he's no good to prove, after all, that he has the proper stuff to be a worthwhile father, mall cop, and man. If Blart, the \"underest\" of underdogs, can beat the odds (and without uttering any profanity or resorting to preaching), then the rest of us can overcome our personal shortcomings and triumph.P.S.: In the Sunday, April 12, 2015 edition of Parade magazine, Kevin James's own article \"Underdogs\" explains how his Paul Blart character parallels and reflects his own resolve to overcome his hard-knock life to become a noted standup comedian and TV/movie actor.",
            "review_date": "2015-05-01",
            "lang": "en"
        },
        {
            "review_title": "Are you kidding me!",
            "content": "Who are theses people who loved this movie. It is a complete waste of time and any resources required to produce this steaming pile of garbage. Everyone involved should be ashamed. I ashamed that I watched it. It cost me a whole 75 cents to rent this disaster and in my history of bad investments this is definite the worst offense. That is how bad I think this thing, I can't even call it a movie, is. I can't even believe I have to write ten lines to have this posted. How many ways can I say I hated everything about it. The acting was grade school quality, the plot was nonexistent. To say every bit of cheap comedy and slap stick was predictable is an understatement. Seriously, I only gave it one star because that's as low as the ratings go.",
            "review_date": "2015-07-16",
            "lang": "en"
        },
        {
            "review_title": "You liked the first one?",
            "content": "Then you might be able to enjoy this one too. Actually if you go into this with very low expectations, you'll be able to sort of enjoy this as \"trash\" watching (or whatever you want to call it). What worked for K. James on his TV show, is stretched for too long in this movie and his charisma (if you think he has any) does not save the day either. No matter what the running gag of the movie might suggest: delusion does not make a man sexy (although some might find this funny, as it was obviously intended to be).Having said that: you've got clichés all around, a story that is too simple, a villain that almost works (at least in some scenes and with the mentioned lowered expectations), and a movie that could be used to entertain children: If they're not already \"spoiled\" by Pixar and the likes ...",
            "review_date": "2015-12-17",
            "lang": "en"
        },
        {
            "review_title": "a comedy filled with silence....",
            "content": "is not good. This had to be one of the worst comedies in a long time. Nothing about it was funny. At one point Paul Blart gives a keynote speech and the room is filled with silence at his stupid jokes. Well, the whole movie was like that.In the sequel Paul got married to the girl he saved from the first film but she left him in a week. So, this movie just has Paul and his daughter, Maya. Paul is awarded a trip to Las Vegas for his good work and of course while there, runs into some criminals. So he uses his goofiness to stop the thieves.The movie wasn't funny and lacked all the charm from the first movie.FINAL VERDICT: Stay very far away.",
            "review_date": "2015-11-08",
            "lang": "en"
        },
        {
            "review_title": "tire fire",
            "content": "Review: I hated this movie because it offers absolutely nothing for an action comedy. There is not one shred of action or humor. The direction and screenplay are both terrible. Both the casting and acting are terrible. All in all I would give this zero out of a possible five stars.",
            "review_date": "2018-11-20",
            "lang": "en"
        },
        {
            "review_title": "Segway crashes and content eating do not make Paul Blart a funny character or movie!",
            "content": "Comedy is not a science, but there is a technique that makes it funny. A lot of modern comedies like Knocked Up, This is the End, and The Interview (yes, I know all of these have Seth Rogan) work thanks to developed characters and smart jokes. Classic comedies had these moments as well, but one genre of comedy we rarely see anymore is slapstick. Buster Keaton and Charlie Chaplin were all master of creating large stunts that would evoke laughter for generations to come. Sitting on a train wheel as it's moving in motion? Hilarious! A factory worker that can't keep up with the strenuous machines? My sides are splitting!Somehow, slapstick has become more associated with satire then with regular comedies. But since the genres have seemed to cross, parodies are no longer playing in theaters as many of the last features including Disaster Movie, Stan Helsing and Haunted House have shown to be unfunny. These kinds of slapstick movie fail because they go with the most obvious answers to the joke. Comedy is all about expectation, and if you can see what's coming, then your comedy is going to fall faster then your comic on a banana peal. I guess no one considered this for Paul Blart: Mall Cop 2. Paul Blart (played by Kevin James) is still proud of having saved his New Jersey mall six years ago from the thieves that tried to take it over on Black Friday six years ago (from the first Paul Blart: Mall Cop movie). But the woman he married from the ending of the previous film divorced him after six days and a milk truck hit his mother. Two of the most important people have left him and he's about to lose a third; his teenage daughter Maya (played by Raini Rodriguiz) as she's been accepted into UCLA.For his actions, Blart is invited to a security guards convention where he'll give the keynote speech. He accepts, knowing that he and his daughter need a vacation. They arrive at the Wynn Hotel where Blart meets with four other guards, Saul, Khan, Donna, and Gino, and makes tough chit-chat with the hotel staff. Blart finds out that he won't be making a speech after all, deflating his spirits. Things get worse as a bunch of international thieves are planning on steeling some fine art from the hotel, including a Van Gogh. The thieves kidnap Maya get and it's up to Blart to save the day again.I never cared for the first movie and I really don't care for Paul Blart: Mall Cop 2. The movie was produced by Adam Sandler's Happy Madison company (this movie seemed to be ashamed by this as I did not see their logo in the opening credits), and it reveals why no one should be associated with this production house; high amounts of product placements, emphasis of gross out gags, and worse of all, unfunny material. Perhaps Kevin James can be a funny actor, but he shows little interest here. Paul Blart is unlikable as a character and unamusing as a comedic personality. He spews jokes throughout the movie, yet not one joke made me laugh. NOT ONE! All he has is fat shaming jokes and food jokes. These are the kind of movies that set fat guys ten years behind, only saying that they eat and are lazy. I know plenty of fat people that are productive and find this movie repulsive. Even if a skinny actor had been cast, Paul Blart: Mall Cop 2 still wouldn't have worked as over protective father stories are not funny and even the heist is not interesting. I'll give credit that art is something that people don't steel in Vegas, but still, a missed opportunity.I'll give this one broken Segway out of ten. Paul Blart: Mall Cop 1 and 2 are both so unfunny and lazy, that they belong in the seventy cent DVD bin at Wal Mart rather then a ten dollar cinema. Perhaps for Paul Blart 3, our hero will save people from a holdup at a Dunkin Donuts or something.",
            "review_date": "2015-04-20",
            "lang": "en"
        },
        {
            "review_title": "Dear Happy Madison Productions, we're starting to hate you",
            "content": "When a sequel of a bad movie is made, one must prepare themselves for the onslaught of awfulness to come. This is so of Paul Blart: Mall Cop 2.Dear Sony, what ever compelled you to green light financing of Paul Blart: Mall Cop 2. We know you've been making a string of terrible decisions like mocking your talent in hacked emails, but we think Mall Cop 2 wins the award for top in stupidity.Six years after saving the West Orange Pavilion Mall, Paul Blart gets invited to a conference for security professionals in Las Vegas. Basically the same nonsensical plot occurs as the last film, but this time its art thieves at the Wynn and Blart gets to call in some back up.The team behind Get Hard should thank Kevin James and Happy Madison Productions for making the worst comedy of 2015. It all goes back to the abhorrent writing of the movie on behalf of James and his collaborator Nick Bakay.Paul Blart: Mall Cop 2 is a kindergartener's version of what is funny actually in a movie packaged for adults. It has fat jokes, prat falls, and redundant re-writes from the original. I half expected James to bend down to pick up a gun and a fart to slip out.If you like heinously stupid humor then you might not want to vomit after watching Paul Blart: Mall Cop 2. The fact that this film could break even from the cost of producing this abomination is a testament to the idiocy of humanity.Please check out our website for full reviews of all the recent releases.",
            "review_date": "2015-04-27",
            "lang": "en"
        },
        {
            "review_title": "This movie changed my life for the better and I couldn't be happier.",
            "content": "This movie changed my life. It made my wife come back to me, cured both my children of malaria, and reversed my male pattern baldness and erectile dysfunction. My wife is so pleased! When watching this movie, expect to be in for a dramatically life changing experience. Although the first was downright mediocre, this sequel surpassed all expectations I could possibly have formed and then some. My boss even hired my back to the stapler company. This movie reveals the duality of man and the strength of the bond between father and daughter that can surpass time, space, and malls. Fin",
            "review_date": "2017-09-11",
            "lang": "en"
        },
        {
            "review_title": "my notes",
            "content": "I watched about 5 minutes and that was enough for me to determine it deserves a half star rating (0 viewings)",
            "review_date": "2019-06-25",
            "lang": "en"
        },
        {
            "review_title": "Infinitely Amazing",
            "content": "My eyes are getting weary\nMy back is getting tight\nI'm sitting here in traffic on the Queensborough bridge tonight\nBut, I don't care 'cause all I want to do...\nis cash my check and drive right home to you\n'cause Baby, all my life\nI will be driving home to you",
            "review_date": "2018-04-25",
            "lang": "en"
        },
        {
            "review_title": "Blart Side of The Moon",
            "content": "This movie is a 10 but only when synchronized with Pink Floyd's Dark Side of The Moon",
            "review_date": "2019-10-20",
            "lang": "en"
        },
        {
            "review_title": "Unfunny sequel to an original that wasn't much cop",
            "content": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning After a tumultuous few years, mall security guy Paul Blart (Kevin James) heads off to a convention in Vegas, which will double as a break, with his daughter Maya (Raini Rodriguez) who's heading off to UCLA soon. However, sure enough, disaster strikes when criminal mastermind Vincent Sofel (Neal McDonough) hatches a plot to steal a fortune from the vaults of a mega casino. Blart must use all his resources to stop him.Comedy sequels have been popping out of the Hollywood cookie cutter like something malfunctioned over the last year or so, and the sequel to 2009's lukewarm but widely received comedy flick Paul Blart was among them. Not a great comic achievement in itself, with Kevin James's fat buffoon act hardly ground breaking stuff, this sequel manages to be an even less funnier, more stifling experience than that, only this time with no structured plot to follow and a set up that takes an eternity to establish itself and get up and running. James may be a whole lot of man, but his comic creation really ain't much Cop. *",
            "review_date": "2015-11-24",
            "lang": "en"
        },
        {
            "review_title": "Not the movie critics say it is. Better than Jack and Jill at least!",
            "content": "First off, my real rating is close to a 6 out of 10, but I saw the horrible reviews from critics and the sadly low score on IMDb and put a 10 out of 10 to hopefully help bring it up. It really doesn't deserve this backlash. I'm not a paid reviewer who wants to give this film false advertisement to go see it. I've seen the movie with the family and I can assure you it is fun. Very fun. It does have a few annoying moments, but they are just moments that pass by quickly before more fun aspects take place. This isn't an amazing movie. It's not an Oscar darling feature. But it never strives to be. Its clear from the previews and the fact that this is a sequel to PAUL BLART that this is just meant to make you laugh or at least smile and shake your head in a positive way. Its wacky, its stupid, its funny! Its also best for kids. I promise you if you take your kids to see this they will leave happy. But its also great for all ages. Just a film to sit back and watch goofy Blart and his goofy antics. People are calling this the worst movie ever. Many are saying it's this years Jack and Jill. It has a 0% rating on a certain movie website that rhymes with Totten Romatoes, and it's just sickening. I don't go by critics reviews most of the time nowadays mostly because of movies like this that get this treatment. People who gave this movie a scathing review saw the movie to hate it. They walked into the theater already hating it just to hate it. I'm betting many of them didn't even see the movie. If you want a good family film to see with a crowd and have a good time, then ignore the critics and go see this. You wont regret it. If you are one of those people who just has a dumbfounded hate for Kevin James or this kind of humor then don't even bother to see it. It's that simple. You'll just hate it and make people who could have loved it not even see it.",
            "review_date": "2015-04-19",
            "lang": "en"
        },
        {
            "review_title": "Paycheck day",
            "content": "Happy Madison Productions is almost always guaranteed to return on investment. Whatever Adam Sandler and co. are doing, they have the mass market formula downpat. Even for more bottom of the barrel cinematic affairs, this doesn't provide much. It leaves you checking the time and asking \"how much longer.\" Don't spend any time trying to piece together the plot. The Vegas setting is cool, too bad it takes little advantage of it. Among other cons, bad guys with no distinct personalities and a Kevin James' character that is more detestable than lovable. Maybe cream of the crop in spiteful Christmas gifts and dollar theaters, but loathed everywhere else.",
            "review_date": "2021-01-21",
            "lang": "en"
        },
        {
            "review_title": "Paul Blart nearly killed me",
            "content": "I am not surprise to see this movie rated low because not everyone like the same things and unfortunately on IMDb I have learnt not to listen to what most are saying and just watch what you think you would like. So as I enjoyed the first one I went ahead and watched the sequel. Thank goodness that I did. This movie was great, it's funny and had my wife and myself laugh hard. At one stage I nearly chocked on some peanuts. While I was chewing away something unexpected happened in the movie that as I tried to laugh, anyway I guess you get the picture.I really enjoyed it and hope to see another one after this. If you like slapstick comedies that are clean but funny then this is a really good movie. The characters are all likable and I feel that everyone involved did a brilliant job. Great movie 10/10.",
            "review_date": "2015-06-26",
            "lang": "en"
        },
        {
            "review_title": "a nice lean back and be entertained movie..",
            "content": "Today we have been to the Movie Premiere of Paul Blart : Mall Cop 2 at the Novo Cinemas at the Ibn Batutta Mall courtesy of Empire International Gulf LLC.We got Kevin James starring again as Paul Blart in the sequel of the 2009 Movie Mall Cop. While with Kevin James and Nick Bakay the writers are the same in both movies the director in Mall Cop 2 is Andy Fickman (You Again). Raini Rodriguez is back as Blarts daughter and as well Gary Valentine (in a different role this time). It as well stars Eduardo Verástegui, Daniela Alonso and Neal McDonough who was brilliant as Villain.I was not a huge fan of the first part of Paul Blart :Mall Cop. Luckily the second part is better in my opinion. While the story is not far away from each other the location is. This time in Las Vegas instead of a Mall in Jersey the whole Movie is a bit more on Big City level. While this is not the greatest movie Kevin James has done it does entertain and give you plenty of laughs. A little bit of Die Hard mixed with a bit of 96hours and some gags, that is basically what you get here. Straight forward easy predictable action comedy in which as well a part of serious topics like kids growing up and leaving the parents safe home, are shortly put in scene.If you liked Mall Cop and The Grown Ups than you will as well have fun with this movie. If you are a die hard fan of The King of Queens you might walk out the theater a bit disappointed. For me it is not the greatest movie on earth, but it does what it promises, it entertains you and gives you a good time out with quite some laughs.Verdict: We had good fun watching Paul Blart : Mall Cop 2 and think it is a nice lean back and be entertained movie.",
            "review_date": "2015-04-14",
            "lang": "en"
        },
        {
            "review_title": "Gave new meaning to life",
            "content": "This film is the embodiment of everything American. Kevin james truly shows his prowess as an actor by playing a dynamic character whose motives are easily understood by the viewer. The writing in this film is superb, with meaningful dialogue that shows the culture of society whilst having some comic relief. Paul Blart: Mall Cop 2 is a masterpiece and everyone should see it immediately, as the experience is enlightening to the true society that we, as human beings, live in. Everything from the writing, the directing, and my favorite; the acting, is on point in this all around flawless film. The pinnacle of film making is evident in this amazing film, and hopefully this is a sign to the new renaissance of not only Hollywood films, but worldwide film making as well. I applaud the director and actors for this brilliant piece of modern art.",
            "review_date": "2016-12-12",
            "lang": "en"
        },
        {
            "review_title": "Pure Fun",
            "content": "Now, of course this movie isn't going to be a blockbuster film, nor will it top the number one spot for movies. However, being 16, this movie made me CRACK UP, and die of laughter. Right off the bat, it gets you in tears of joy. This movie as mentioned above, isn't like Fast and Furious 7 crying, but a happy tear (RIP PW). PLOT: Paul Blart(Kevin James) returns in Mall Cop 2, yet he is sent to Vegas for a \"Mall Cop Seminar\", and when he is there, he discovers a covert operation, thieving art. This movie doesn't have the \"Taken\" fighting scenes, but more of a kid fighting style. Absolute perfection in the comedy department. AGE: This movie is honestly great for ALL ages, whether you're 64, or 6, this movie will make you laugh. RATING: I give this a 7/10, because well its Mall Cop... not the best plot/content/acting aside from Kevin James & David Henrie, but higher than the avg because it made me laugh, and I enjoyed myself. FINAL RESULT: I would recommend this movie to anyone looking for a fun night out, whether you're on a date, or a family movie night. Great Movie!",
            "review_date": "2015-04-21",
            "lang": "en"
        },
        {
            "review_title": "Wow the Americans love this movie",
            "content": "I asked my co-workers to recommend a Hollywood movie. I expected \"Dumb and Dumber\" by the title. It wasn't that at all. It is more of an inspirational comedy with some serious but good messages. A more accurate title would have been \"The Legend of Paul Blart\".Odd to me is that they speak in part English, part gibberish through the movie, kinda like some speak \"Spanglish\" here I suppose. I know none of the actors but the acting was good, and there was plenty of humor. The characters were believable. Most movie dancing I find a little silly but I even liked the dancing routines in the bathroom.I will be asking my co-workers for more recommendations after this one!",
            "review_date": "2015-04-23",
            "lang": "en"
        },
        {
            "review_title": "Mall Clop 2",
            "content": "Should've called it Paul Blart: Fall Cop because that's the only joke in this movie.",
            "review_date": "2020-02-16",
            "lang": "en"
        },
        {
            "review_title": "A misunderstood avant-garde masterpiece",
            "content": "Godard, Truffaut, Bergman, Bunuel....and Blart.Few names echo across the wavering dune of cinema. These directors and their ilk will always have an imprint. Be it French New Wave or Italian Neo-Realism, the lasting genius of these auteurs is immortal.Now - imagine all of that - being PALED in comparison to Paul Blart Mall Cop II. \"Vegas has a high roller\" the poster tells me. But this \"high roller\" is unprecedented. A wiggling bowl of gelatin, Blart is a comic masterpiece. Yet when I say \"comic\" it is in the classical, machiavellian sense of the term: Paul Blart cannot be classified as a comedy. Sadly, this has gone over the heads of virtually every critic residing in this great big beautiful sphere we live atop. Paul Blart Mall Cop II ascends all genres. It is a one of a kind work - no, I refuse to say film because it is far greater than that.Paul Blart is sui genris.",
            "review_date": "2015-04-19",
            "lang": "en"
        },
        {
            "review_title": "The only good to come out of it is the foreshadowing of the end of Kevin James' \"career\"",
            "content": "Lets face it, Kevin James is a talent-free hack who can't be counted upon to carry his own belly for more than an hour, let alone a movie. This movie deserves all the credit in the world for exposing this blatant fact once more for the public to see. Not realizing he was already pushing his luck tumbling his way onto becoming a C-list TV \"star\", ol' chubby James probably thought he could make the transition to the big screen and carry over his dumb, clumsy, man-child persona successfully, riding on the coattails of his shmucky looking face and folksy mannerisms (the relatable round shape of the body for the average American also helps).Well, he didn't. The movie is a flop in many ways. The plot is stale and predictable, the characters are bereft of depth, intelligence and nuance. The tired old shticks such as the underdog tale (professional and romantic) don't even come close to being emotionally invested in. Kevin James does nothing to improve any of the above, either.",
            "review_date": "2019-10-27",
            "lang": "en"
        },
        {
            "review_title": "Clean and Painfully Awkward",
            "content": "I really enjoyed this movie because of its morals. No cussing, sex, or real violence, and that's getting rarer each year. It's a lot of slapstick and situational humor, which is not for everyone but is great for me. People who enjoy R-rated comedies should not watch this, but those who like awkward dialogue and \"fail\" moments will enjoy the next saga of the Segway Sergeant.The setting is in Vegas, and it was nice to see the visuals and colors of the Wynn Casino, where the film primarily takes place. I also really liked how a gorgeous character falls for Paul, which is awkwardness along the lines of when Bar Refaeli kissed that fat dude in the Super Bowl commercial.Summarize: family-friendly and funny. I'm happy Blart's back!",
            "review_date": "2015-05-18",
            "lang": "en"
        },
        {
            "review_title": "I want Dredd 2 not this",
            "content": "Okay so your telling me that Dredd doesn't have a squeal but Paul Blart dose...life can be unfair sometimes.The story is about the hero mall cop Paul Blart has been accepted an invitation to the Security Guard Exp in Las Vegas. He takes along daughter Maya in order to spend more time with her before she heads to college. But nothing can be easy and when Blart learns about a heist about to go down, he does everything in his power to stop it.The first Paul Blart: Mall Cop I thought was pretty terrible and not that funny, I haven't spoke to anyone who liked the first film so why the hell is they a squeal? maybe for money well if that's the case that back fired as this movie failed at the box office so that's money down the f**king drain. Damn you Hollywood for producing movies like this only for money and nothing else just to insult your auditions who went out of they way to pay and see your movie.The whole running joke in the movie is fat Kevin James falling over or getting hurt by many different things around him and my god dose this movie repeat it. That is bad and lazy writing right there when your only joke is that. Is that what you could think of seriously?.The acting from everyone was bad even Kevin James just did the stick in the mood \"Hey I'm Kevin James\", acting like in every movie he's been in. I know Kevin James is better than this and I actually like the guy in real life and I'm not here wanting him to fail, no I want him to pick roles were he's not just playing Kevin James in his past movies.Paul Blart is a mall cop and you think his in the mall all through out the movie, nope most of the movie his far away from the mall and he's in Vegas and he still wears the uniform and drives around in that stupid electric mall cop scooter. This movie sucks in so many ways that it sucks out the sense of humor and the lack of intelligence when it comes to it's characters and storytelling.",
            "review_date": "2015-04-23",
            "lang": "en"
        },
        {
            "review_title": "Worse than water boarding.",
            "content": "Only two parts were funny. The cape and walking across the street when he sees a cop on horseback.Everything else torture beyond words with every cliché you see in all Happy Madison movies over and over and over.They always use the same plots only changing the location. Save your family. Save your time. Save yourself from a complete waste. I am only writing these lines because you need 10 to post. I just don't want anyone else to waste their time. I will never , ever watch any happy Gilmore movie again or one by those affiliated with such. They have really gotten lazy and lack creativity and imagination in the worst way and keep running the same plots.",
            "review_date": "2015-09-04",
            "lang": "en"
        },
        {
            "review_title": "Comedy that's funny for all the right reasons",
            "content": "Is this movie kinda silly? Of course. Does it rely on slap stick humor? You betcha. Should any of that surprise you from a sequel movie about a mall cop? Nope. It seems that the comedy genre has gone from edgy to over the edge this past decade. Gone are the Waterboy and even Tommy Boy films and now, at least it seems, are raunchy, low-brow, we can't be funny any other way type films. I used to love comedy movies but for this reason, I haven't watched a comedy in years. This movie is proof that you can elicit genuine laughter without the F word, without nudity, and without sexual innuendo every 3 seconds. If you want sophisticated humor and plot, this is not the movie for you (and neither is Hangover for that matter). What are we after in comedy films anyway? Isn't it silliness and laughs? Paul Blart is funny and it's funny for all the right reasons.",
            "review_date": "2015-04-28",
            "lang": "en"
        },
        {
            "review_title": "This movie is so insecurity with itself, that we all suffer, because of its mistakes.",
            "content": "I really can't believe, that a sequel to 2009 film, Paul Blart: Mall Cop was even made. Directed by Andy Fickman and written by Kevin James and Nick Bakay. This movie doesn't know if it wants to be a comedy or a depressing tragedy piece. The movie brings back, the affable Average Joe lug head, Paul Blart (Kevin James) for one more adventure. This time, he must stop, an art heist from happening, at Wynn Hotel in Las Vegas, where he was staying for a security convention. Without spoiling too much of the movie; I have to say, what a let-down, this film is. I was a huge fan of the first film. While, I know, the first movie was kinda dumb; it was a guilty pleasure of mine, because how likable, the character of Paul Blart, was in the first movie. He's a straight-forward family man who love his daughter, Maya (Raini Rodriguez) & mother, Margret (Shirley Knight). You can't help, feel bad for Paul Blart, in the first movie, as he's just trying to win the heart of the girl of his dreams, Amy Anderson (Jayma Mays). Their relationship might not be realistic, but you buy into it, just to see Paul Blart be happy for once. In this movie, not only does it start with Amy leaving him, but also Paul Blart's mother getting kill in an automobile accident. I don't know, who, though, it was funny to have a nice old lady, getting whack, but it wasn't funny. It was just down-right depressing. –Because of these events, Paul Blart became, unbearable to watch, due to his annoying needy nature. The movie moves in a slow pace and spends way too much time, making him miserable with unfunny gags, and not enough time, establishing the heist plot. Literally, the heist plot, really comes out of nowhere, 3/4 into the film. Unlike, the first movie, that kinda satire, 1988's Die Hard. This movie didn't feel, like anything like that. The movie didn't play out in a closed off surrounding area, like the first movie. It didn't even, bother with keeping with the mall theme. I really didn't get, why the movie was shot in Las Vegas on Steve Wynn's hotel in the first place, when Paul Blart is a mall cop. It doesn't make any sense. I guess, the production crew, wanted a Vegas Vacation. In my opinion, I really didn't think, they put, much work in this film and spent, most of the production time, drinking, being lazy and gambling. I have, never saw a movie so-misused, a Las Vegas theme, before. There were barely anything Las Vegas related in this film. For a movie to be, set in Sin City. There was barely any sin. No, Las Vegas Strip landmarks scenes, barely any gambling, and most of all, no sex appeal. This movie might have work, if they used the sites & sounds, but no, they didn't. Honestly, the movie would have been better, if this movie took place at the Mall of America in Minnesota, like it was supposed to. I hate that this movie change the location, at the last second, because the state of NV eligibility them for a tax credit. It really ticks me off. Also, this film makes the Wynn hotel looks really bad. They allow their employees to host underage drinking party in presidential suites!? Employee will give out information to anybody, about a guest, if they happen to be in love with them!? They lack good security for theater shows. The staff doesn't help you if you're being attack by an animal or pass out on the floor in the lobby. Nor, do they alarmed or evacuate the hotel guests, when gun fire, vandalism or large amount of violence fighting is doing on. WTF!? It was pretty odd to have an action movie, with hotel guests calmly, walking around. There is no realism with this film. The film's mild violence and dumb Keatonesque slapstick humor was alright for the most part, but it became a bit repetitive. While, Paul Blart: Mall Cop 2 is indeed less crude than previous Adam Sandler productions, it did have some profanities, and a couple of gross-out gags. I really didn't like, the gross banana or melting ice cream scenes. At least, it didn't have as much awful fat jokes as the first film. What the movie fails to have is really good smart humor. I have mixed results with the supporting cast acting and how their characters are portray. Some are portray as racial stereotypes, while others are just one-dimensional. One character that I was really glad, they work more, on establishing was Maya. We really see, her blossom as a realistic cool person. It was nice to see, her, have a sub-plot, with her being more independent from her father, by hanging out, with Lane (David Henrie), a hotel busboy. She really made the film, somewhat likable. Unlike the original movie, there are no extras during/after the credits. Overall: This movie is not as entertaining as the first movie. This is one movie, not worth the trip to the mall.",
            "review_date": "2015-05-14",
            "lang": "en"
        },
        {
            "review_title": "Disgusting",
            "content": "This movie is a sad, sad excuse for a sequel. I watched this with high hopes when it came out in 2015, as I do love Paul Blart: mall cop. But this was quite the disappointment. Since then I haven't been able to speak of the movie without getting so agitated I have to call my therapist.",
            "review_date": "2019-12-13",
            "lang": "en"
        },
        {
            "review_title": "greatest film in the history of cinema",
            "content": "Hero. A word that embodies a person of strength, high moral value, \n extreme fortitude when it's comes to times of adversity, and the \n willingness to put oneself above others. Paul Blart (Kevin James) is \n none of these things. On the surface, it's easy to see that these \n traits don't personify a man such as Paul Blart but it's beneath the \n surface that we find what Paul Blart and this film are truly made of; a \n warrior spirit, determination, a lot of laughs and probably a few \n stuffed crust pizzas ;). The film opens in a time of tragedy in Paul's \n life. After his marriage of 6 days ends in an ugly divorce and his mom \n is run over by a murderous milk truck driver, a treacherous void is \n left in Blarts life. it seems as if things couldn't get any worse. \n until one day 2 sealed envelopes enter the Blart family's life that \n would change the course of their destinies forever. To his surprise \n Paul is welcomed to an all expenses paid Security Officers honors \n convention in none other than Sin City. That's right. Las Vegas, baby! \n his daughter is given an acceptance letter to UCLA although she decides \n the timing isn't right to reveal this to her bereaved father in his \n time of grief. With much excitement the Blarts are whisked away to \n Vegas to start their vacation. At the hotel PB and company convene with \n security associates from across the nation who all have heard of Blarts \n exploits but fail to hold him in high regard despite Paul's \n accomplishments. once again we see Paul being underestimated and openly \n mocked for his incompetence by those around him even though he shows \n enormous passion for his work. We are introduced by a spicy Latina love \n interest in the hotels manager who feigns no interest in Paul but \n beneath the surface a small fire burns in her chest for the mysterious \n anomaly that is Paul Blart. Ah, but what is a hero without a villain? \n an eccentric millionaire who frequents the hotel has set up a plot to \n steal various art pieces from the hotel and sell them for profit. It's \n not long before Paul catches on to this horrific ploy due to his \n daughter Maya accidentally seeing some rather unruly dealings of these \n delinquents and being captured. Not only must Paul stop this corrupt \n crook but also save his beloved and only remaining support system. His \n daughter. Paul Blart may seem like an incompetent, overweight, buffoon \n of a security guard, but he has something that is hard to find. Heart \n Determination and Loyalty to those he loves. to me, the story of the \n sequel to mall cop is one of the Underdog. a story that often times \n goes unnoticed and swept under the rug. This film shows us that you \n don't have to the smartest, fastest, strongest or even the bravest to \n be a hero. you just have to have the will and determination to do the \n right thing. With an A+ cast, hilarious dialogue and James' mastery of \n physical comedy i HIGHLY recommend this film to anyone searching for a \n little bit of hope, and a lot of laughs along the way.",
            "review_date": "2015-04-22",
            "lang": "en"
        },
        {
            "review_title": "What a garbage fire",
            "content": "This is actually my least favorite movie I've ever seen. They made Paul a completely unlikeable sex offender and I hated every second he was on screen. This movie actually gave me cancer, I feel the the tumors growing on my back.",
            "review_date": "2019-09-22",
            "lang": "en"
        },
        {
            "review_title": "Paul Blart: Mall Cop 2",
            "content": "I guess it was inevitable that we would see a sequel, the first movie was quite good fun I can't deny, unsure how well it did but most things get sequels these days. Hell I'm sure there will be a third too, because all the bigwigs like to make trilogies, its great for DVD sales. But yeah...I did like the first movie somewhat, it was a reasonable idea, a mall cop thinking he's a real cop, trying to be a real cop, it worked on some levels.The main pull for this franchise was/is of course Kevin James who uses his weight to gain laughs lets not beat around the bush. Admittedly I am a fan of the guy to a degree (said it before and I'll say it again), I think he's enjoyable, fun and effective with his physical gags, plus he's a good everyman that we the audience can relate too. Unfortunately he does seem to have had more success on TV than the big screen, and he's not helping himself here.This movie is virtually the same sh*t that we saw in the first movie. Blart and his daughter go to a security convention in Vegas, low and behold at the exact same time a group of criminals are planning to steal all the valuable paintings from the same hotel Blart is staying in. Just like the first movie Blart blunders into the crime caper and ends up stopping it in his usual clumsy overweight manner, spoiler alert! he manages it. Oh...would a Las Vegas hotel have the Van Gogh Sunflowers painting in it?Yep its the same as the first movie yet somehow its much worse, probably because its a babyish infantile pile of crap this time around. Seriously, the last movie has some good moments of sarcastic humour, this has nothing, its completely void of anything that would make an adult or child smile. Its bizarre, there literately isn't anything funny at all! not a single moment that made me smile. Hell there aren't any actual jokes! it pretty much consists of James making stupid faces (that aren't funny faces) and mincing around trying to be funny. What I really don't get is the franchises obsession with those Segway things, seriously there is an entire scene dedicated to trying to make out those things are funny. I realise its Blart's little trademark and part of his character but it isn't funny! watching him trying to show off on one isn't funny, its just lame.Everything else is completely predictable throwaway spiel we've seen a shitzillion times before. Blart's daughter is fat just like him, she falls for a good looking guy who is clearly out of her league and Blart doesn't like it, the main baddie looks like a Bond villain, the baddie henchmen are a standard bunch with a token black guy and token sexy females, the hotels security is headed by some uber sexy male hothead and the hotels general manager is a sexy supermodel type. The only thing they add here which had promise and showed some ingenuity, was the little gang of security officers that meet with Blart for the convention. A ragtag team of misfits that really shouldn't be in security...but are, clearly for reasons other than actual security. James older brother Gary Valentine stars in this as one of the aging, fat, balding security guards in this little gang. Again clearly meant to be a hilarious addition...but it isn't.The whole security convention aspect could of been a winner, they did the same silly thing in the US TV version of 'The Office' with an office supply convention. Seeing that episode shows how funny this movie could have been in the right hands, even with James, the material was there (albeit a little bit of good material) but its been wasted. That one small idea does not make up an entire movie of course, and as already explained there is nothing else here of value. Even the apparent suspenseful finale where Blart takes down the bad guys is pathetic and not even up to the meager standards of the first movie! This could have been better with a slight adult edge, it was never gonna be great but it could of been better, but its not, its pretty darn terrible.2/10",
            "review_date": "2015-06-30",
            "lang": "en"
        },
        {
            "review_title": "Paul Blart: Mall Cop 2 is another enjoyable Kevin James comedy of one of his clueless lovable characters",
            "content": "I remember liking the original Paul Blart several years back though the beginning didn't do it any favors, initially. I seem to have felt the same way here. There are some lines and scenes explaining why certain characters don't return for this sequel. Not that that actually matters since the only reason this was made was 1) Make some more money and 2) Have Kevin James reprise a role that helped him make that money back then. And he's the reason this sequel is still quite likable with his character a mix of dumb, a little smartass, and a little wise when needed to be. In summation, Paul Blart: Mall Cop 2 is no great shakes but if you're in the right mood, it's still a humorously enjoyable time-waster, if you don't mind that...",
            "review_date": "2015-05-20",
            "lang": "en"
        },
        {
            "review_title": "Up there wit 2001 a space odyssey and the Schindler's li+st",
            "content": "Lets go through 2 key scenes in the film, the first scene is a masterpiece, the direction of sanely Kubrick in this scene is incredible, I was supersede that they used dark magic and a blood sacrifice to bring him back but it was well worth it. \nThe jokers heist on the mall is jaw dropping they did it all in 1 take and they got Denial Day Lewis to play the joker, how incredible.\nAnd the last scene where Paul Blart breaks out of the prison by digging a hole through the wall and then covering it up with a poster is absolute film making genius, and then the very last shot where Paul is standing out in the rain is such an overwhelming amount of emotion that i simply can not convay to you in this review, \n Your's truly Rhys.",
            "review_date": "2018-07-11",
            "lang": "en"
        },
        {
            "review_title": "Fat Guy Fall Down Go Boom, Ha Ha!",
            "content": "Paul Blart is a fat mall security guard who falls down a lot and takes his job way too seriously. That is what this entire movie, no wait actually two movies, is based on. I guess we are supposed to find it funny every single time he falls down on the ground because he is overweight?Also he has a silly little mustache so I guess that is also supposed to make us laugh non stop too. Every single character in these movies is unbelievable and annoying. The writing is garbage and none of the predictable jokes are funny.Please stop making Paul Blart and please stop watching Paul Blart. These movies will kill your brain.",
            "review_date": "2017-10-20",
            "lang": "en"
        },
        {
            "review_title": "Good Clean American Film",
            "content": "This is the kind of film we need more of in America. No profanity, no homos, no murder, no blood, just good clean family friendly fun. I am a big fan of Kevin James and his comedy, and I was not disappointed with this film. Loved every minute of this film. The actual film concerns Paul Blart and his daughter's vacation to Las Vegas. Of course crime and hilarity ensue. You will especially love the scene with the large bird. I found myself laughing out loud at this scene. Kevin James' brother, Gary Valentine, has a wonderful part in this film. I like the way Kevin James looks out for him family. Do yourself and your family a favor and catch this film.",
            "review_date": "2015-12-15",
            "lang": "en"
        },
        {
            "review_title": "More silly than funny! 2/10",
            "content": "Review: I really don't know how this movie made three times the budget because the storyline is ridiculous. The jokes were really bad and the far fetched plot just went from bad to worse. Anyway, it's about a mall cop, Paul Blart, who is feeling pretty depressed after his wife has left him and his mum gets run over by a milk truck, so he heads to Vegas with his daughter to spend some time with her before she heads to college. He's also been invited to an security officer award ceremony in a posh hotel so they pack there bags and they make there way there. His daughter immediately falls for one of the porters so she spends most of her time with him while Paul is preparing his speech and checking out the security in the hotel. He then finds out that another officer is giving the speech but on the day, he is too drunk to say a word so Blart takes over. His daughter mistakenly walks into a heist of people trying to steal some expensive paintings from the hotel and so she calls on her dad to save her life, along with the porter who is also mixed up in the whole mess. Blart then recruits some of the other security officers to help save his daughter but it's Blart who saves the day, as usual. This movie did take me some time to watch because I kept on falling asleep, out of shear boredom. It goes from one crazy scene to the next and the actors, especially Kevin James, just seemed to make complete fools of themselves. The whole painting scam was a shambles and I cant believe that the professional killers got taken out by a bunch of amateurs that didn't have a clue about what they were doing. Anyway, I'm sure that there going to make another Paul Blart movie because of the profit that this one made but I will be staying clear of it. Awful!Round-Up: Kevin James has made quite a hefty sum from making a fool out of himself, $1.2Billion to be exact but his biggest achievement to date is his role in Hitch which made $370million worldwide. At 50 years old, he is a bit of a late bloomer because he didn't start making movies until 2002 were he had a small role in Roberto Benigni's Pinocchio. He then played cameo roles in 50 First Date and Hitch and he added his voice to Monster House, Barnyard and Hotel Transylvania which made $358million worldwide. After starring in a couple of TV series, he finally hit the big screen alongside Adam Sandler in 2007 with I Now Pronounce You Chuck & Larry which made $186million worldwide. Since then, his career has been pretty impressive but were yet to see another side to his acting. He did have a slightly serious side in Here Comes The Boom but he still ended up making a fool out of himself. Anyway, the film was directed by Andy Fickman whose known for his comedy movies like the Game Plan, She's The Man, Race To Witch Mountain, You Again and Parental Guidance with Billy Crystal and Bette Midler. Judging by his previous work, I'm not surprised with the outcome of this movie because he seems to like light hearted fun with silly jokes and not that much depth. Personally, I couldn't stand this movie because I just didn't find it that funny but they will keep on bringing out movies like this because they make so much money.Budget: $30million Worldwide Gross: $107millionI recommend this movie to people who are into their comedies about a mall cop who goes to Las Vegas for a security award ceremony with his daughter and ends up saving her life after she witnesses a heist. 2/10",
            "review_date": "2015-08-31",
            "lang": "en"
        },
        {
            "review_title": "Gives sequels a bad name.",
            "content": "If you liked the original this sequel is for you. Anyone else should stay away. The Las Vegas location adds a bit of life to the dull lack of action for nearly two thirds of the movie.The movie is short but you'll be looking at your watch. So many things don't work. The daughters' story and scenes are painful to watch. The love interest from the hotel manager seems forced. The most interesting thing is the two eye color of the villain.The trailer showed every funny thing in the movie. If you've seen the trailer there is nothing more to see. The movie might be enjoyed by nine year old boys. Some of the gun play and cartoon type violence may not be appropriate in what should have been a family movie.There is no need to see this in a theater. It will be on a home platform very soon.",
            "review_date": "2015-04-19",
            "lang": "en"
        },
        {
            "review_title": "Cinema is saved",
            "content": "Kevin James is brilliant as the titular character, Paul Blart, a timid mall cop, who deserves a vacation after his heroic escapade back in '09. James' performance as a middle-aged, overweight security guard is Oscar worthy. Watching this movie was an emotional ride from start to finish. At some hilarious moments, I was rolling on the floor with gut- wrenching laughter. However, at other tear-jerking moments, I was sobbing with sympathy for Blart. Even less sentimental viewers will find themselves struggling to contain tears. One or two boxes of tissues is highly recommended for watching this film. James somehow manages to keep the audience from collapsing with sadness, by including some of the best comedic jokes of the century, such as the fight between Blart and a bird, which will surely be remembered as a classic movie scene, even many years from now. Blart's skills on a motorized Segway are second to none, and the stunts are expertly choreographed. In a similar scene to the original classic, Blart rushes to aid his daughter, but is unable to do so, because of his hypoglycemic condition. During this scene, I was reduced to a quivering mass of tears, as I watched Blart struggle to overcome his condition, but to no avail. All in all, this movie should be awarded 11 stars out of 10 if possible. Kevin James somehow manages to combine both tragedy and comedy into a brilliant action comedy, all while delivering an excellent performance. Though thoroughly entertaining, \"Paul Blart 2\" hides deeper meanings, such as Blart's inner struggle with all of the changes occurring in his life, such as the death of his mother, and his divorce with his beloved wife of 6 days. After watching this movie, I was both in laughter and in tears, and I immediately stayed at the theatre to watch it for a second time. \"Paul Blart 2\" proves that a timeless classic can still be created in 2015.",
            "review_date": "2015-07-25",
            "lang": "en"
        },
        {
            "review_title": "Worse than offensive, but unlikable",
            "content": "The original \"Paul Blart: Mall Cop\" was by no means a comedic gem, but it was a genial film with a character that was likable because he helped put a face to those uniformed officers we see exercising authority around our local malls. It took a demographic that is often patronized and laughed at and gave those individuals a heroic quality, whilst still allows its titular character to be a goofball himself. It was a silly little film that almost won my heart. \"Paul Blart: Mall Cop 2,\" however, isn't even entitled to an eighth of my heart. Material that was once passably genial has grown up and become tiresome drivel that attempts to get the laughs out of its viewers by obtaining jokes that constitute as the low-hanging fruit. In just one two minute trailer for the film, I counted Kevin James falling five times, which shows exactly the kind of humor you're in for with this particular film.The story needs little exposition: Paul Blart (Kevin James), who we saw marry at the end of original film, is now divorced after a marriage that lasted only six days and his mother died after being hit by a milk truck, leaving his daughter Maya (Raini Rodriguez) as the closest remaining relative he has. Blart still keeps his mall safe and takes his job very seriously, which he feels is a feat that will be recognized at the upcoming security convention and seminar he'll be attending in Las Vegas. However, when he discovers that the Wynn Hotel, where him and his daughter are staying, is being raided for its art by a group of thugs, Blart must find a way to take down the criminals while employing the integrity he has long possessed to keep his mall safe.The most immediate and, in turn, fatal flaw of the film is Blart himself. A character that was once charming for his goofiness and the way he upheld honor at his job has now turned into a mean-spirited, pompous narcissist who overcompensates the importance of his job. If this kind of attitude was reserved for scenes like Blart addressing a conference of other mall cops, then that would be one thing, but throughout the entire film Blart possesses an uneasy superiority complex that undermines the abilities of his daughter, his peers, and Divina Martinez (Daniella Alonso), the Wynn's general manager who can't stop herself from falling for him. If the original film made us appreciate mall cops a bit more, this one rekindles our worst stereotypes about them.On top of that, \"Paul Blart: Mall Cop 2\" is so drearily repetitive in its gags, and this time, we don't even have a real colorful or lively mall setting to look at. Everything is slicker and more overblown, with Blart finding a whole new inventory of weaponry, physical tricks, and even a new motorized vehicle to employ, all of which does nothing but take a formerly simple concept and extend it past credulous principles. Paradoxically, the fact things are being taken to the next level should mean something significant for the story, but here, it just destroys the simplicity of the original story and cannot find a way to make up for it.Kevin James has never been an unlikable actor, but more of an actor frequently victim to shallow characters. Here, however, watching him be so demeaning to those around him is something that wears on one rather quickly. Then there's the extra elements of the film being a monotonous array of sight gags and other mindless humor that simply degrades whatever meager impact the original film had on us. While \"offensive\" just doesn't seem to be the right word for \"Paul Blart: Mall Cop 2,\" \"unlikable\" certainly paints a more accurate and defining picture.",
            "review_date": "2015-04-20",
            "lang": "en"
        },
        {
            "review_title": "\"Paul Blart: Mall Cop 2\" is two too many.",
            "content": "I LOVE Las Vegas! After multiple trips there, I'll watch any movie or TV show that features that beautiful and fun city. Unfortunately, that doesn't always work out for me. For every \"The Hangover\", there's something like \"The Incredible Burt Wonderstone\". So, when I saw the theatrical trailers for \"Paul Blart: Mall Cop 2\" (PG, 1:34), I said to myself, \"Self? You know something? This one has potential.\" Paging Burt Wonderstone.\"Paul Blart: Mall Cop 2\" is the sequel to the very profitable (read: low budget) \"Paul Blart: Mall Cop\" from 2009. Six years after thwarting a Black Friday heist at his local mall, and in spite of the original movie's tag line (\"Security Never Takes a Holiday\"), we now see Blart (Kevin James) and his daughter, Maya (Raini Rodriguez) on vacation in \"Fabulous Las Vegas\". Well, it's not completely a vacation. There's a security convention in town and Blart is hearing rumors he's going to be asked to be the convention's surprise guest speaker. And he's still the same old Blart – excessively proud of being a mall cop and insulted when someone doesn't give him his due, or give his job the respect that he feels it deserves.During the back-and-forth over whether Blart is giving that speech, thieves begin stealing the hotel's art – and kidnaps Blart's daughter and the hotel valet (David Henrie) that she's been talking to. In the inevitable face-to-face showdown between Blart and Vincent (Neal McDonough),the thieves' leader, Vincent has his henchmen and Blart has his fellow security officers, each one more\u0085 unusual than the last. Throughout Blart's attempts to stop the bad guys, he proves as resourceful and physically resilient as he was in the first movie, as do his back-ups. But when the ways they battle for truth, justice and Steve Wynn's art reminded me of the scene in \"Vegas Vacation\" when Cousin Eddie takes Clark to a casino with silly simple, but impossible-to-win table games. But even \"Pick a Number\" or \"Which Hand Is It In\" were more amusing than this film's marble gun or goop sprayer.One subplot in the movie has Blart dealing with his beloved daughter's rapidly approaching departure for college, which will leave Blart even more alone than you'd think based on how the last movie ended. There's a definite family-friendly vibe in the Paul Blart movies. The conflicts lack any real danger (unless you count the many assaults on Blart's person, mostly born of his own clumsiness). There's no real profanity and no sexual content, but also a plot, characters and dialog that are so bland that they make dry toast look like a fancy Vegas buffet. I enjoy family-friendly comedies as much as the next open-minded movie reviewer, but I do expect them to be funny.This movie is earnest and tame, but just not that enjoyable. The script is lazy and settles for bon mots like \"It's a bad day\u0085 to be a bad guy.\" James' delivery of supposedly comedic lines is so over-the-top that they're more likely to produce eye rolls than guffaws. He literally throws himself into the film's physical comedy, but the effect wears thin quickly. There are about four laugh-out-loud sight gags in the movie, but ONLY four – and they've probably already gotten their laughs out of you if you've seen a TV commercial or theatrical trailer for the movie. James' antics might give some kids a few giggles (very few), but there's not much here for adults to appreciate. Personally, I'd take James' work in his erstwhile TV series \"The King of Queens\" over most of his movie roles, including and especially this one.This was the first film to receive Nevada's newly-enacted film tax credit. That's potentially a good news / bad news scenario. It'll probably mean more Sin City scenery splashed across the big screen\u0085 but that might mean I'll be subjecting myself to more cinematic suffering. Well, better me than you. After all, that's what our Facebook page is here for. So, instead of seeing this particular motion picture, I'd advise reading a nice family-friendly joke book\u0085 or taking a trip to your local mall. It's safe. \"Paul Blart: Mall Cop 2\" is fiction, grade \"D\" fiction.",
            "review_date": "2015-04-17",
            "lang": "en"
        },
        {
            "review_title": "I'm pretending this doesn't exist",
            "content": "This movie not only sucks, but ruins the first. Please, DO NOT WATCH. I'm just going to live my life pretending this movie was never made and Paul's life continued as we would have expected it to go after the end of the first movie. That movie was a treasure. This one is trash.",
            "review_date": "2021-01-09",
            "lang": "en"
        },
        {
            "review_title": "A really funny comedy for all ages to enjoy!",
            "content": "Mall Cop 2 is directed by Andy Fickman and stars Kevin James, Raini Rodriguez, David Henrie and Neal Mcdonough. Basically, the plot is that after six years of keeping the malls safe, Paul Blart has earned a vacation to Vegas for a conference with other security guards. He heads to Vegas with his teenage daughter before she heads off to college. But safety never takes a holiday when a gang of people try to steal some paintings. I really enjoyed the first Mall Cop movie and it is one of my favourite comedies of recent years. The first one was directed by Steve Carr and you can really tell the change of director. This movie is set in Las Vegas and I really liked the fact that they changed the setting because it was more conducive to comedy and a much funnier place. Kevin James in the movie is as funny as the first one, I couldn't think of anyone else to play his role and he does it perfectly. He is really funny in the movie and is really dedicated to his role. A thing that the first movie was missing but that this one got right is that the sidekicks where actually funny and added a lot to the story. For instance, the other Mall Cops where as funny as Kevin James and that definitely added a lot to the movie. The first had no real sidekicks and though Kevin James was funny he could have needed the help of others to make it better. I really like this style of comedies and Mall Cop 2 did it very well. A lot of good jokes and memorable moments. My only issue was that the movie takes about 25 minutes to really get going. The first part of the movie is slow but does have a few good gags. But once it gets started it is great! This movie was as good as the first one because of a minor issue but the setting and story was better than the first movie and that's why I highly recommend checking this movie out. It is a perfect summer movie that isn't too long and that will make laugh everyone from all ages. Check it out and have a lot of fun!",
            "review_date": "2015-04-21",
            "lang": "en"
        },
        {
            "review_title": "Very dumb, but somewhat entertaining",
            "content": "-Paul Blart: Mall Cop 2 (2015) movie review: -Kevin James is back as Paul Blart who, after years of keeping his mall safe, finally takes a vacation with his daughter. But when a team of criminals tries to rob the hotel he is staying at, he must rise to the occasion and once again save the day! This sequel did see a different and probably more experienced director at the helm! \u0085.but the same writer.-You should know that I am going to try to be fair, but overall it does come down to what I personally thought of the film. Ultimately if you enjoyed it that is fine; I thought it was cute and entertaining, but kinda dumb.-The story's plot develops through convenience and I think it highly unlikely that these villains would rob a high profile hotel while it is hosting a security conference. The subplot and subsequential added drama works fine though. Cliché, but it is hard to have a super original plot for a movie like this, so I am understanding of that.-The pace was actually pretty good. Yeah.-Kevin James did an over-the-top job as usual, because his character is kinda ridiculous. However I can't think of anyone better for the role, sooo\u0085. The rest of the cast did fine for as goofy or simple as their characters were.-One of my problems with some films like this is that it is very hard to take any of the characters seriously. I know, I know\u0085. Family comedy. Paul Blart's character is just soooooo overdone. And all the other 'team' he assembles is too. Plus they literally had to make the villain have two different eye colors to make him stand out. Although there was one super random exchange they had that had me laughing a good bit.-The music was good but generic. Rupert Gregson-Williams, Harry Gregson-Williams's son I believe, composed, and I hope to hear more from him. There was also one scene set to classical music that had me laughing. A lot.-There are some good laughs in this film, some of which are in the trailer, and most of which are situational humor. However most of the film is Kevin James making a fool of himself, which some people probably find funny. Personal bias, I don't.-Ultimately I thought it was funny, but poorly written and kinda cheesy. Nonetheless, it was not made to be a super great film, or even a believable film. It was made to entertain, and it kinda does. Is it worth paying to see? I don't think so, but I am just usually not into these films. So I will personally land somewhere between not worth the time and Netflix, but if you are looking for a fairly entertaining time with no brainpower required, by all means don't let me stop you! -Paul Blart: Mall Cop 2 holds a PG rating for some peril and one SUPER gross scene I literally had to look away from. Oh my gosh. It was for laughs, but I just couldn't.",
            "review_date": "2015-04-18",
            "lang": "en"
        },
        {
            "review_title": "Overly Harsh",
            "content": "All the reviews for this sequel have been very harsh and I think ever so slightly unfair.While I cannot imagine any Oscars for this it seems to have a quiet, almost hidden funny quality. If your reading this and shouting, what I'm saying is everybody tries and at the beginning his bumbling antics do provide a few giggle out moments and even though it's true that they fade rapidly I can see the appeal to some people. It seems to be aimed at the 12 year old girls who watch the Disney Channel and programmes like \" I Carly \" and \" Sam and Cat\". It will bring in millions and sell well on DVD ( It will be released very quickly) but heaven forbid a \"Mall Cop 3\".Daft and repetitive it is but then again I'm not 12 so can't really judge much more. I gave it a 3 because 2 was a bit harsh",
            "review_date": "2015-04-13",
            "lang": "en"
        },
        {
            "review_title": "Really great movie for kids",
            "content": "This was a really great kids movie that was fun but not inappropriate. Kids loved it – I would highly recommend it to those looking for a good easy-going movie to make their kids laugh. Before you listen to other reviews take your kids to see this one because you won't regret it. First movie I have seen in a long time that didn't use inappropriate humor that confused kids. Compared to other kids movies right now, this one was one of the best. Great for families as well – many adults and teenagers were laughing at this one – it really does reach a large audience. Funnier than the first one, and contains a much better message as well.",
            "review_date": "2015-04-18",
            "lang": "en"
        },
        {
            "review_title": "A really great and hilarious film!",
            "content": "I was so surprised to see so many negative reviews for this movie. By far it is the best movie I have seen in years! The storyline is well written the acting is amazing. The humor is just plain funny! It is now my favorite movie! Kevin James is by far my favorite actor. It is about Paul Blart and his daughter Maya, who were both excellent in this film. They get invited to beautiful Wynn las Vegas for a vacation and the security guards honor ceremony. But safety never takes a holiday. When thieves plan to steal valuable art from the resort, Paul has to pull off another one of his heroic saves! Never listen to a critic. It is a must see!",
            "review_date": "2015-08-25",
            "lang": "en"
        },
        {
            "review_title": "This film was lazy and not funny.",
            "content": "Paul Blart: Mall Cop 2 is the story of a down-on-his-luck mall cop who is invited to Las Vegas to attend a conference celebrating the best mall cops in the country. While he is there, a high class criminal is planning to steal priceless art located in the same casino that Paul is staying in. This film is quite terrible\u0085 just about everything it tries to do falls flat. First off, we have Paul Blart himself. He feels like a knockoff of a knockoff of Jacques Clouseau from the Pink Panther series. When Paul needs to be an oaf, he is, and when he needs to be skilled, he is. There is no consistency in his character. There is a scene early on in the film where he can't hit targets about five feet in front of him, while later he can hit moving targets from twenty feet or more away. There is no consistency, so whenever the good guys win or lose; it is because the writers said that they do and not because they actually would have. The overall plot has no flow either. Instead of letting comedy naturally flow into the plot, the entire movie will stop to try and tell a joke every five minutes just for them to fall flat and drag on, consistently. The first five minutes alone managed to make my opinion of the first movie worse. There are numerous subplots, all of which lead nowhere, are completely irrelevant or feel incredibly forced. I can't stress the word 'forced' enough. Why would Blart be invited to this conference if he hasn't done anything in six years? Why would a villain shoot an empty Segway? Why would Blart put on angel wings while being chased? There are no real explanations that would make sense. Instead of creating unique and fresh jokes, standard jokes that we have seen a hundred times in much better movies are shoved into the plot instead. This makes the movie incredibly predictable. I can't give this movie just a single star because I smiled (not laughed) once or twice and there were one or two shots that I liked; however, avoid this movie at all costs. I never laughed once, the plot was lazy, and the acting was pretty bad.",
            "review_date": "2015-04-27",
            "lang": "en"
        },
        {
            "review_title": "Great Funny Movie",
            "content": "I watched Kevin James in his t.v series \"King of Queens\" and in his break out movies \"Hitch\" with Will Smith and \"Here Comes the Boom\" with beautiful Salma Hayek. Kevin was good and funny in all of them. I had seen him in the first Paul Blart movie and it was funny.My wife and I went to see Paul Blart-Mall cop2 and it was even funnier. It is much funnier than Melissa McCarthy in \"Spy\". Plus Kevin's movies are funny without all the hard core harsh crude profanity. All of Melissa's movie have way to much unnecessary profanity in them. I will Not be seeing anymore of Melissa's movies. I give \"Mall Cop2\" and Kevin James and the whole cast two thumbs up. Funny, funny, funny stuff.Also there is pretty eye candy for us men who love women, a very pretty Latin actress in Mall Cop2 whose name is Daniella Alonso who looks a lot like beautiful biracial actress, Paula Patton. They could easily pass for sisters or cousins. Paula and Daniella are both very pretty. Overall, I give this movie 2 thumbs up.",
            "review_date": "2015-06-07",
            "lang": "en"
        },
        {
            "review_title": "Awful",
            "content": "Presumably people who gave this movie a 10 and a glowing review are being sarcastic because this movie is awful. Wooden characters with no reason to like them. Typical Kevin James fat jokes which aren't funny. How are these films funded?",
            "review_date": "2019-09-17",
            "lang": "en"
        },
        {
            "review_title": "Trying to be a legend",
            "content": "To me it seems he is trying to be John Candy, fails on all accounts, but I wish him well.\nWith writers who can get the best out of Kevin then I hope he can be an actor I wish to watch.\nNot really a rating of this film, but an average of all I have seen(which is most) so mid range.",
            "review_date": "2019-08-26",
            "lang": "en"
        },
        {
            "review_title": "Could have been better.",
            "content": "Unfortunately despite huge effort from Kevin James, the films fails to match the first movie. It isn't bad at all,there are some laughs to be had but the plot is just to far fetched and the supporting cast isn't great.. Its worth a watch, did well at the box office but unlike the first one, you'll probably only watch it once",
            "review_date": "2020-11-03",
            "lang": "en"
        },
        {
            "review_title": "great film But It was missing one thing-- SAMUEL L. JACKSON",
            "content": "Yes this film would have gotten a higher grade from this LOVER of comedy. But how dare they make any film in Hollywood without SAMUEL L.JACKSON .This is 2016 movies that have no SAM have no va BAM ...Mall Cop 2 is directed by Andy Fickman and stars Kevin James, Raini Rodriguez, David Henrie and Neal Mcdonough. Basically, the plot is that after six years of keeping the malls safe, Paul Blart has earned a vacation to Vegas for a conference with other security guards. He heads to Vegas with his teenage daughter before she heads off to college. But safety never takes a holiday when a gang of people try to steal some paintings. I really enjoyed the first Mall Cop movie and it is one of my favourite comedies of recent years. The first one was directed by Steve Carr and you can really tell the change of director. This movie is set in Las Vegas and I really liked the fact that they changed the setting because it was more conducive to comedy and a much funnier place. Kevin James in the movie is as funny as the first one, I couldn't think of anyone else to play his role and he does it perfectly. He is really funny in the movie and is really dedicated to his role. A thing that the first movie was missing but that this one got right is that the sidekicks where actually funny and added a lot to the story. For instance, the other Mall Cops where as funny as Kevin James and that definitely added a lot to the movie. The first had no real sidekicks and though Kevin James was funny he could have needed the help of others to make it better. I really like this style of comedies and Mall Cop 2 did it very well. A lot of good jokes and memorable moments. My only issue was that the movie takes about 25 minutes to really get going. The first part of the movie is slow but does have a few good gags. But once it gets started it is great! This movie was as good as the first one because of a minor issue but the setting and story was better than the first movie and that's why I highly recommend checking this movie out. It is a perfect summer movie that isn't too long and that will make laugh everyone from all ages. Check it out and have a lot of fun!",
            "review_date": "2015-05-20",
            "lang": "en"
        },
        {
            "review_title": "Slapstick and Kevin James antics saves the day",
            "content": "For both part 1 and 2, I will give Kevin James the points for trying to bring out new formula to decennia-old antics . Yes, it is slapstick humor which will not be appreciated by the politically correct. Blart rhymes with you know what so the switch gear should be set back a few times and be easy on your intelligence accelerator. Kevin James must have planned a sequel because his material is not enough for just one film so like his line in the film - fool me once, shame on you, fool me twice, shame on me. Since we are just passive watchers we should not be ashamed that we have seen this film ( even twice). Just think of it, variety is the spice of life and it can be tiring to demand quality all the time. Not everyday is a steak day.",
            "review_date": "2018-05-24",
            "lang": "en"
        },
        {
            "review_title": "This is pretty good!",
            "content": "I've seen this movie recently and it's pretty good, but it's not my favourite and it's not my least favourite either. I think it was funny and the plot is interesting. In my opinion, this movie is worth seeing and it's worth the money, so I'd recommend this if you're out at the mall and you need a good movie to lighten up your day. I'd also buy this movie on DVD and it really lightened up my day when I went out to the mall to see it when I was having a terrible day. I came out of the movie theatre much calmer.I enjoyed the ending of the movie as well and it's something I'd watch a second time.",
            "review_date": "2015-05-08",
            "lang": "en"
        },
        {
            "review_title": "Execrable",
            "content": "What did I just watch? This movie is absolutely awful. Obviously a shameless cash grab riding on the coat tails of the first.\nIt's a supposed comedy that's just plain unfunny.\nDon't believe the 10/10 reviews on here, they're obviously paid for, fake reviews. How am I so sure? Only a reviewer on here describing this steaming pile of dung as \"art\".",
            "review_date": "2019-11-12",
            "lang": "en"
        },
        {
            "review_title": "Paul Blarts Sad Days",
            "content": "I feel super bad for Paul, after like 5 seconds of the movie I'm so shocked that his Mom died and he got divorced and his Daughters going to college. I just feel so bad for him, he deserves a big hug.I wished that I could go into the tv and give him a hug and say \"It's okay I'll give you all the cake you want.",
            "review_date": "2021-05-27",
            "lang": "en"
        },
        {
            "review_title": "It's really stupid in all the right ways",
            "content": "It starts off weak as we go through the back story of Paul Blart, a jersey mall cop who life has not been kind to, with the exception of his daughter Maya (once again played by Raini Rodriguez whose part is way bigger and way better in this one)To make this movie bigger and better than the first, they set if in Vegas at a security convention were a group criminals attempt to rob the place blind and Paul is there to stop them.The action sequences are pretty good. Nice balance of funny and exciting.And I love Kevin James. Who could not love Kevin James. He's funny and moves swiftly for a big guy, which adds to the funny. Kevin James is lovable and the movie is good for a few laughs so it works for me.",
            "review_date": "2015-05-03",
            "lang": "en"
        },
        {
            "review_title": "Could have taken A Segway right to TV movie",
            "content": "Many times when I hear a sequel is coming, I cringe in fear at the horrors that studios may churn out. Often many follow ups to a film series pale in comparison to the original, many times being a poor movie overall. Today I hesitantly returned to the theater to see what actor Kevin James had in store for me in the form of Paul Blart: Mall Cop 2. I can't say I had my hopes up high for this movie, but you never know what surprises may be in store. So let's get started shall we?The first adventure of Blart was a cute, wholesome adventure that was good for some stupid laughs and the notion that anyone can get a happy ending. Unfortunately, they couldn't leave it there and thought it would be good to send our aspiring cop back into action to hopefully entertain the crowd. Despite my wishes for fun comedy, Paul Blart 2 fails to deliver the same enjoyment the first one did. Most of the jokes are rehashes, many poking at James' weight and his clumsiness when it comes to chasing down the bad guys. Blart's obsessions with Segways have lost their appeal, his over- exaggerated stunts just looking stupid and more ridiculous with each pull. Crushing people with his weight is also crosses into the stupid zone, especially when he lays on a woman and wiggles on top of them trying to knock them out. I would have to say the worse things though are Blart's rambles about justice, honor, and trying to prove he is a tough guy. His monologues go on and on with much of his dialog being extremely simplistic or drawn out that left me rolling my eyes more so than laughing. I can't lie that I did laugh at a few jokes and antics, mainly the window ramming scene and a few well- timed limericks. As a whole though this movie lost what made the last one fun. Storywise there was not much improvement. Mall Cop 2 starts out quite sad, and again ridiculous, as Blart's world is turned upside down twice in terms of family and love. To escape the depression he heads to Vegas for a convention that will hopefully recognize him for his heroism from the first film, which took six years prior to this movie. Once there the story breaks down to three things: Paul trying to stop the bad guys, Paul learning to let go of his daughter, and Paul trying to find himself. The first aspect is rather pathetic, the bad guys are there to steal art for a client, going through little struggle to acquire their precious cargo. In truth, I found these bad guys more boobs than threats, the main guy lacking any real bite with his bleach blonde hair and different colored eyes. Blart's whole ordeal against them was too easy, and much more diluted than I had hoped to see. The second tale is probably the best part of the movie. Maya (Raini Rodriguez) is about to go to college, leaving her dad alone and without support. Paul must learn the hard lesson of letting go, something I too struggle with, to allow all parties involved to live a better life. While cheesy as it is in this movie, the morale is sweet and helps bring some of the nostalgic charm. The final story of Paul finding himself is not quite as strong. His struggles of accepting himself start out sweet, but quickly fall back to funny as another joke or gag takes place. There are a few exceptions to the rules where Blart makes a motivational speech, or defends the geeks and mocked. Much of this story though has little sustenance and gets hastily wrapped up near the end of this fortunately short movie. As for acting, James seems to have a lot of fun with this role, immersing himself in the Mall Cop with a heart as big as his body. James seems like a guy who loves to make people laugh and smile, and the younger audience members love his antics. His delivery of some of his lines is spot on, using his voice to really emphasize the puns and small wit the dialog has. What really made me laugh were his facial expressions though. Somehow James just has to look a certain way and I will crack up, maybe it is due to his chubby cheeks or maybe I'm just weird. Either way James can still bring out some funny moments. On the sweet side, he still has that cuddly teddy bear attitude that we all fell in love with during King of Queens. He is a lovable lug who is willing to take verbal abuse to do what is right, and he gets points for playing the underdog role I relate to so well. However, there is no award winning performance, outside a Kid's Choice Awards, for this role as it is still the same part he always plays. The other cast do their roles okay, but James is the soul of this movie so I won't go into details on them. Paul Blart 2 is a movie I describe as could have gone directly to TV. The humor has been reduced to something only young and young at heart will like, and the story can't back up the rather bland comedy. I still applaud James for his commitment to roles, but not even the big man can save the drab this film is. You can guess that this movie is not recommended for a theater visit, unless you are looking for something to take your kids too. Wait for it to come on basic cable, and save your money for Avengers 2 in the next few weeks. Paul Blart 2 gets:Action/Comedy: 5.5 Movie Overall: 4.0",
            "review_date": "2015-04-17",
            "lang": "en"
        },
        {
            "review_title": "Better than most comedy sequels",
            "content": "Paul Blart: Mall Cop 2 is a sequel to 2009's Paul Blart: Mall Cop. In my opinion the first one was a great film to watch with some friends and family and have a good time with an alright comedy. The second one holds the first one up well.Paul Blart: Mall Cop 2 is littered with fat jokes and fart jokes as slapstick. I'm not so much a fan of fat and fart jokes but I will admit some of them in here did get me. The slapstick is just great. In the beginning something out of the blue happens in his mall with a little boy that got me and everyone else in the theater to belly laugh. Another gem is when Blart and his fellow Mall Cops fight the evil bad guys at the end in an almost Spartan like battle. They charge at each other screaming their heads off and when they defeat a bad guy it is usually by dumb luck. That is probably one of the best moments in the movie. As well as Blart trying to get sugar. The movie does have it flaws. Though out of its many one thing had me during it. The fact that some of the big scenes that I was absolutely supposed to belly laugh were in the trailer! It's something that irks me and not moviegoers as well. You know in the trailer that exotic bird that was attacking him? Yeah well I did not laugh. I new it was coming. I may have had a slight smile but I felt as if I was being forced to.Another one is when Blart is kicked by the horse and flies into a car. Yeah, that was the closing scene. You do not reveal your last scene in the trailer people! You are supposed to make the audience belly laugh at the end so that it creates the illusion it was a hysterical film! Overall Paul Blart: Mall Cop 2 is a decent flick and is a lot better than some followup comedies, ( I'm looking at you Dumb and Dumber 2). It's a good family friendly film with no innuendos (again Dumb and Dumber To) if you enjoyed the first one and would give it a five star or up watch this one while you wait for the big Summer movies to hit. 6/10",
            "review_date": "2015-04-27",
            "lang": "en"
        },
        {
            "review_title": "The Fat Guy Falls Down More",
            "content": "This is garbage. I felt like my eyes and ears were being assaulted.",
            "review_date": "2020-05-10",
            "lang": "en"
        },
        {
            "review_title": "Wow, A complete let down",
            "content": "I guess it all made sense in the rolling credits at the end that Adam Sandler had his hand in this piece of junk movie. The whole movie plays out like a very bad Nickelodeon after school special. I think the movie could of been rated \"G\" if it wasn't for a few fake karate kicks. My 6 year old thought it was even crap. Take a decent movie and make a dumb sequel. That's what Hollywood loves to do, and they did it again with this terrible movie. Adam Sandler is a has been and should never put his hands on anything. This is another one of his failures, I wish he would go back to SNL and sing the lunch lady song again. At least he couldn't mess that up. I even watched the whole movie hoping that it would get better seeing that I waited so long for it to come out on Bluray. Rent it and be disappointed, don't buy it and feel regret. 1 * is being generous.",
            "review_date": "2015-06-26",
            "lang": "en"
        },
        {
            "review_title": "It had me laughing throughout - silly and fun!",
            "content": "First, in full disclosure I'm a huge Kevin Janes fan and will see him in just about anything he's in. I felt compelled to post after reading so many extremely negative reviews. What were you guys expecting with the title \"Paul Blart: Mall Cop 2\"?This is not meant to be a high brow movie. However if you check all of your expectations at the door and simply enjoy the movie, I don't see how you couldn't find yourself laughing at all the silliness that ensues. Is it the best movie of all time? Not even close. But it's not trying to be. So enjoy it for what it is, and if you're not a fan of these type of comedies, don't see it or review it. I saw it with two girlfriends and the 3 of us were in stitches throughout. Admittedly we seemed to be laughing the loudest in the pretty full theater. Life can be pretty serious and sometimes you need a fun, completely mindless escape. For me, Paul Blart 2 fulfilled this perfectly.",
            "review_date": "2015-04-20",
            "lang": "en"
        },
        {
            "review_title": "Paul Blart: Mall Cop 2 was a blast 2!",
            "content": "Often, a sequel can fail to live up to the original, particularly when it was made later to cash in on the popularity of the first. Paul Blart: Mall Cop 2 lives up to all expectations, and is a must-see for anyone who has seen Paul Blart: Mall Cop, which in itself is a must-see film. This time, we see a different Paul Blart. He has lost many of those close to him, and his daughter is about to go off to university. On top of this, during the climax of this film, he is away from his home-turf and up against even tougher foes, a top-level gang of project criminals! The pacing is again excellent. We are introduced to all the key characters and locations towards the start of the film, while not left bored waiting for the action to begin. The themes of security and art present in this film are well-presented in the visual style, just as the theme of a shopping centre was constantly seen in the original. The plot itself is again solid, and refreshingly not simply the same plot as the original. We are also given a large selection of new gags, as well as a few cheeky homages to the original. As ever, Kevin James delivers a strong performance. In conclusion, 10/10. Paul Blart: Mall Cop 2 will have you stood up, chanting BLART BLART SHOPPING CART by the end. We can only hope the next one arrives before 2021!",
            "review_date": "2018-04-02",
            "lang": "en"
        },
        {
            "review_title": "Just awful in every way, stay far away from this",
            "content": "Do you remember Paul Blart Mall Cop? That movie that made you laugh hysterically for an hour and a half? The one that after watching you thought \"i need to have a sequel to this\"? No? well neither did i, and six years on someone answered your request for a film you didn't want. This has to be one of the laziest attempts at a comedy sequel i have ever seen. The structure is extremely unoriginal, just following the exact same formula as the last film from start to finish. And the jokes were unbearably awful, every single one made me sigh and ask \"really?\" It looks like a five year old wrote the jokes in this film to entertain his 4 year old friends, and it just makes this whole film look stupid, as well as Kevin James. Do you remember the days when he was funny? No? well neither do i, he is like a parody of his character from the first film thrown into a similar situation and makes a fool of himself every 5 minutes. Not only was the plot terrible, i had no idea what the actual plot was until almost half way into the movie, yes there are bad guys from the start but i had no idea what they were doing until like 45 minutes into the movie, maybe because it wasn't clear enough or i just didn't care. I must say i smirked like twice in the entire film, one of those times was seeing Kevin James get smashed into the side of a car, and so was the other time. I have to say there was nothing good about this movie, the comedy was atrocious, the plot was pointless and at times non-existent and the bad guys were stereotypical movie bad guys from the moment you see them. It also tries to shove some emotional crap down your throat the entire time and i actually bought some of that for like 5 minutes and then i remembered that i don't care. There were also a crap-load of secondary characters that all factor in through many side plots, most of which were there to fill the hour and 30 minute runtime. So in the end, even Kevin James on a Segway could not save this pile of horse crap, do yourself a favour, and stay far away from this excuse of a comedy. - 1.8/10",
            "review_date": "2015-07-08",
            "lang": "en"
        },
        {
            "review_title": "Paul blot",
            "content": "mall cop Baal plait. call mop the movies about Paul Ruddy. being a mall cop he does an okay job like its. not as good as Fairfield 2 a tail of two kitties also they brought Michaella. Jason back thats pretty cool i really. don't want to write ten lines of this thats pretty .much it also he's the cop of the mall like the whole damn mall do you know how. big malls are like this big I'm. holding my arms out really wide to demonstrate its big okay thats it thanks for reading god. bless you have a nice. day Coxguess who's back with a branch new trackmeI don't even care I don't fnjkerbg fndksjnrfw srnfjlkgnHVYQEGFMWKEFOGL no those are not spelling errors noi went to the doctor the other day he said i need to stop coming in so often because like i have problems opening doors so I really identify with Paul Fart because he also has trouble doing simple tasks like being comedic or acting like a human individual or even using a fruit to eat italso i highly recommend watching this movie with your closest buddies because i didn't do that and now I'm sad because i spent actual human life on this moviehot damn it was so good i dream of Pol Blot every night i can hear his galloping mustache inn my earthis is not a drill. evacuate immediately.",
            "review_date": "2015-10-27",
            "lang": "en"
        },
        {
            "review_title": "Silly, Not Funny",
            "content": "I watched this and would have left, but then I wouldn't have been able to write this. The first movie wasn't that good, but at least it was partially funny, this one had almost no funny moments, and has tons of other issues. The plot is another ripoff of Die Hard (so was the first Paul Blart), the movie is way too silly, it's downright stupid, and it suffers from sporadic pacing. On top of that the film has a plethora of other issues, to the point where it would be easier just to say what the film did well. On that note that's what I'm going to do, tell you what this film did well just to save time. The film wasn't to complex to follow, the ending was climactic, and what action sequences were in the film were serviceable. There was also a little development between the 2 main characters, but other than that most aspects of this film were bad.",
            "review_date": "2015-05-06",
            "lang": "en"
        },
        {
            "review_title": "oH gOD",
            "content": "I felt embarrassed when I finally walked out of this movie. I felt embarrassed that I stayed so long.This is another one of those movies where if you've seen the trailers you've seen the best parts of the movie. I did not even make it to the part where the the horse kicks Paul Blart.This movie should have received an R rating for the way Paul Blart treats his daughter except that there is nothing likable about the daughter or any of the characters in this movie.The idea of the hotel manager with the handsome boyfriend/security chief falling for Paul Blart is totally ludicrous and not very well scripted.This movie crashes and burns worse than Get Hard. If you though Get Hard was a good movie you have serious problems. If you think this movie is funny you are a sick person.",
            "review_date": "2015-04-18",
            "lang": "en"
        },
        {
            "review_title": "Help someone today",
            "content": "Kevin James revives his role as the over confident and delusional Paul Blart, the \"strange misshapen super hero\" mall cop from New Jersey. The first few minutes of this film cleanses the events at the end of the last film. Blart goes to Las Vegas for a Mall Cop convention, something a joke within itself as was his speech glorifying the position as life's aspiration. Nothing like making fun of the blue collar service sector.In Vegas, there is a subplot of art thieves (Neal McDonough) and Blart being put down by hotel security. There is a display of high tech low impact weapons that are also part of the demeaning of the profession. It isn't hard to figure out the outcome even at the age of five. When Blart's daughter (Raini Rodriguez) is kidnapped, Blart doesn't exactly go into Liam Neeson mode, but something closer to a combination of Inspector Clouseau and Jerome Lester Horwitz.If you have grown tired of hearing \"Best Day of My Life\" like 80's folk tired of \"Betty Davis Eyes\" you have been warned about the over used sound track.Guide: kid safe. A PG closer to G than PG-13",
            "review_date": "2018-01-25",
            "lang": "en"
        },
        {
            "review_title": "Til Death Do Us Blart (🖥, 😎)",
            "content": "This movie is my cross to bear, my dark sacrement, the Sword of Damocles that hangs over me ever year. After over seven viewings of this movie it has become like a well known friend, but it is *not* a good movie. It is insipid, mean spirited and uninspired. It is not worth watching for its own merit",
            "review_date": "2021-01-18",
            "lang": "en"
        },
        {
            "review_title": "Awful Movie",
            "content": "Hey, I am not going to lie. This movie is terrible. I did not laugh for a second in the whole movie. The movie is unfunny and no novel idea. If you are looking for good entertainment movie, then this movie is not the one. I watched the movie without seeing any reviews from IMDb or anywhere on the internet. That is a big mistake in my part. There is one good thing about the movie: the woman who played the role of the hotel manager is very beautiful. But she had very less role to play. Moreover, the chemistry of Paul Blart's daughter and the guy who played the role of the worker in the hotel does not go well.",
            "review_date": "2015-06-25",
            "lang": "en"
        },
        {
            "review_title": "A fat guy humiliates himself a lot. That's it.",
            "content": "6 years, both in the movie and in real life, after his heroic rescue of his mall, Paul Blart heads to Las Vegas to attend a security officers' convention but when a group of art thieves break in, a rehash of the first movie ensues. The first one was a terrible comedy, since it wasn't funny, but it was a good action movie and thanks to that it was perfectly OK, but it didn't need a sequel. Here, Paul Blart just does the same stuff, except not even the action is fun this time. So, what is Paul Blart Mall Cop 2? It's just a fat guy repeatedly suffering misfortune and making a fool out of himself. Is this meant to be funny? Yes he's annoying and yes he's played by Kevin James (Say what you will about Adam Sandler but Kevin James is worse) but he's a human being and to see him just suffer misfortune after misfortune makes the film more depressing than funny. In general, the experience of watching this is more painful than getting shot repeatedly in the face with a paint-ball gun.Boring, unfunny characters, an unexpectedly mean spirited tone, terrible direction, a rock bottom script which is lazy, immature and stupid. In short, this what you'd expect from a Happy Madison Productions movie. It's cringe-worthy. Do the people behind this film really believe this funny? There is a good scene where Paul Blart makes a speech at the conference as a last minute replacement and is really well received by everyone. That's a good moment and genuinely makes you smile. Before long, he's back to being an idiot. A good 5 minutes of the movie involve Kevin James having this fight with a wild bird. Is that meant to make me laugh? All in all, this is just another terrible comedy from Happy Madison Productions, which are still going even though critics and (some) audiences hate all of their movies. It's not as offensively bad as Grown Ups 2 (But then again, what is?) and it's not the worst movie of 2015 (That would be Mortdecai) but it's still a total belly flop on nearly every level.2/10",
            "review_date": "2016-01-30",
            "lang": "en"
        },
        {
            "review_title": "0/10",
            "content": "Think of the worst movie you've ever seen – a movie that didn't make you laugh, didn't make you cry, didn't move you or change you in any way besides giving you the desperate urge to flee the theater. Think of a movie that was a massive waste of your time and money. Hold that title in your mind. \"Paul Blart: Mall Cop 2\" is worse than that. This may sound like hyperbole or piling on. As of this writing, \"Paul Blart: Mall Cop 2\" is at zero percent on Rotten Tomatoes. (Mind you, Sony didn't screen it for critics before opening day, which is never a show of confidence, so the reviews are still trickling in.) But truly, there is not a single redeeming moment in director Andy Fickman's film. A general flatness and lethargy permeates these reheated proceedings. The jokes never land. The slapstick seems strained. The characters are one-dimensional. And the vague attempts at heart at the end don't feel earned. This is essentially the same movie as the inexplicably successful original \"Paul Blart: Mall Cop,\" which made over $183 million worldwide in 2009. Only this time, Kevin James is even more unlikable as the title character. It seemed impossible when the first film came out that this endearing everyman could play a character that stripped him of all his best on-screen qualities. Back then, Paul Blart was just needy, clueless and annoying, as he smugly patrolled a New Jersey mall on his Segway. In the sequel, he's all of those things but he's also bitter, rude and condescending, which makes him even more repulsive. In theory, though, we're supposed to root for Paul as he takes a much-needed trip to Las Vegas for a security guard convention. In the proud tradition of so many recent Happy Madison productions—\"Just Go With It\" (Hawaii), \"Jack and Jill\" (cruise ship) \"Blended\" (Africa) —\"Paul Blart: Mall Cop 2\" is a vacation disguised as a movie shoot. It's also an extended infomercial for the Wynn Las Vegas hotel and resort. (Steve Wynn himself makes an awkward, wordless cameo at the conclusion.) Paul is in need of a pick-me-up after a string of devastating losses, which are played for crass laughs. First, his love interest from the first film leaves him out of nowhere after just six days of marriage. But worse is the fate that befalls his sweet, dear mother (Shirley Knight), who dies when a milk truck runs over her in front of her house. (This is not a spoiler, folks—it happens in the first few minutes. It's also supposed to be funny for some reason.) All Paul has left is his darling teenage daughter, Maya (Raini Rodriguez), of whom he's more psychotically overprotective than ever. So naturally, she can't tell her dad the good news that she got into UCLA. She has to withhold that information to provide the film with a forced source of tension. Maya also has to come with Paul to Las Vegas, where he's an uninspired cliché of the tacky tourist with his loud shirts, tight shorts and cheap ways. But he carries himself with the swagger of a high roller when he gets the wrongheaded notion that he's the convention's keynote speaker. This includes talking down to the hotel's beautiful and polished general manager (Daniella Alonso), which makes her fall in love with him, naturally. Just as baffling is the quasi-romantic connection that occurs between Maya and one of the hotel's valet parking attendants (David Henrie), who seems to have all day to hang around with her, take her for drinks poolside and invite her to a party in a swanky suite. Now I'm just nitpicking. There are much bigger problems here. The central premise of \"Paul Blart: Mall Cop 2\" is that Paul inadvertently thwarts a major heist of Wynn's famous art collection. The mastermind is the cool and crisply dressed Vincent (Neal McDonough, playing a generic bad guy, again), who has infiltrated the hotel's own security staff to pull off the crime. Paul throws himself into the action, literally, which results in a series of lame goofs, pratfalls and sight gags. These include a fight with an angry peacock (whom he totally provokes, by the way) and an overlong appearance in the Cirque Du Soleil show \"Le Reve.\" In the process, he also must save Maya, who somehow managed to discover the scheme within the vast square footage of the Wynn hotel and fell into the villains' hands. For some reason, James likes this character, which must mean that he has zero recognition of his strengths as an actor at this point. He also co-wrote the script again with his longtime writing partner, Nick Bakay. Hopefully, they'll both realize that Paul Blart has collided face- first with every object imaginable by now, and we can all call it a d",
            "review_date": "2015-04-30",
            "lang": "en"
        },
        {
            "review_title": "Adam Sandler Money Grab",
            "content": "This movie is absolutely what you would expect out of any Adam Sandler movie, excluding the fact that it is extremely unfunny. Most of the jokes are complete garbage and the main plot in the movie is rushed into your face without any real explanation. Throughout the entire movie I laughed probably a record of 1-3 times. I would not recommend this movie to anyone with a sensible amount of intelligence. Not only does this movie is absolute garbage, the script and acting is terrible. At best I could watch this movie again if i was held at gun point because that best describes the consistent dribble which is visible in this movie. I can say that this movie is not as bad as Grown Ups 2 but it is far from good, my rating for this is harsh because this movie does not deserve another sequel for the love of God.",
            "review_date": "2015-04-16",
            "lang": "en"
        },
        {
            "review_title": "Misunderstood Masterpiece",
            "content": "Packed with non-stop physical hilarity, Paul Blart Mall Cop 2 had an entire audience erupting with laughter on opening night at the Propsect Pavilion theater in Brooklyn. Reminiscent of early Sandler humor, this worthy sequel impresses, with expertly crafted jokes delivered by a very funny Kevin James. Amongst a group of talented actors, Rani Rodriguez stands out from the pack, delivering a breakthrough performance as Blart's daughter in the film. Snobs should not be reviewing this movie against other movies, as in this movie, Kevin James takes mall security and elevates it to an art form. Don't let the haters throw shade on a great time at the movies!",
            "review_date": "2015-04-19",
            "lang": "en"
        },
        {
            "review_title": "First time since Tootsie I've seen an audience give a clapping ovation.",
            "content": "Light and funny this movie is pure and unabashed entertainment - my kids and everyone else in the theater belly laughed throughout. The movie contains no embarrassing or awkward content or innuendo, just lots of great and happy slapstick from the comedic genius of Kevin James. The plot is simple and straight forward; good guys vs bad guys. The minor bits of light violence are gratuitous and kid friendly in the manner of Wile E Coyote. Great good fun - bring your kids and laugh your head off. Better yet, let the grandparents take them and tell you about it after wards. The plot as you've probably already read is the Kevin James character being rewarded with a vacation to Vegas for his exemplary work as a Mall security guard. He brings his teen-aged daughter along for the ride and their hotel is targeted by the bad guys stealing art works from the hotel. The daughter and her newly found love interest get caught up in the heist and Blart comes to the rescue.",
            "review_date": "2015-04-25",
            "lang": "en"
        },
        {
            "review_title": "Paul Bart Mall Cop 2:Still Sucks",
            "content": "No Idea why people love it but this movie is much worst than Grown ups 2 or maybe just like Grown Ups 2.The jokes are forced out and so damn stupid.The trailer looks good I gave it a chance but I was terribly wrong the movie didn't do anything much to make me laugh it is a pain to watch it.They try too hard to make the audience laugh but it didn't work but there's some jokes that make me chuckle but nope it still hate this movie.The movie is forgettable and horrifically bad.I think it's time to stop making this kind of movie it's dumb and it's also tiresome.This movie is sadly the same as the first one nothing new to but it's just a rehash of the first film so If there is another movie or a sequel to this I'd better wait for it to be aired on television cause my money is not worth it.",
            "review_date": "2015-05-09",
            "lang": "en"
        },
        {
            "review_title": "Holy Mary",
            "content": "Good Lord, what was that? I rate 3 stars and that is being generous.",
            "review_date": "2019-11-28",
            "lang": "en"
        },
        {
            "review_title": "I spent $3 on this movie and I hate it",
            "content": "This man Paul blart acts like an actual sexual offender and I can't believe I watched it.",
            "review_date": "2019-09-22",
            "lang": "en"
        },
        {
            "review_title": "Still managed to fall short of my very low expectations...",
            "content": "Today's theaters are constantly filled with terrible stupid films that have no business being made. Paul Blart: Mall Cop 2 was no exception. Yes, the movie knew it was stupid, but it was not nearly as good as the original Mall Cop which was barely passable to begin with. Even with Kevin James' slapstick comedy routine, Paul Blart: Mall Cop 2 will surely be a comedy quickly forgotten. The biggest problem I had with this movie is they advertised it as some sort of \"epic\" hotel heist where Paul Blart is the only one who can stop them. In reality, that story lasts for about twenty or thirty minutes. The rest is filled with hit and miss inspirational speeches about how mall cop's are the unsung heroes of the world. Nothing flowed properly in the movie. There was no climax scene in the film whatsoever. It was simply one giant mess. I do think Kevin James is funny, but he only seems to be funny with Adam Sandler. When I thought about it, the only films he has done where people actually laughed are when he shared the screen with Adam Sandler. Kevin James still tried his best, but not even Will Ferrell could have saved this movie from complete disaster. The rest of the acting was nothing special along with practically every other facet of the movie. If you want to see a decent comedy, watch one of Netflix's recommendations because there are no good comedies out right now. I do not recommend you see Paul Blart: Mall Cop 2 in theaters or on DVD. For more of my reviews, go to my website at reviewsbywest.com",
            "review_date": "2015-05-18",
            "lang": "en"
        },
        {
            "review_title": "worse than The Room",
            "content": "The headline explains it all.\n A lot of his most toxic traits are presented as good or charming and i fear for all young children who watch this. I can only hope they weren't influenced by this.\nAlso the movie isn't funny.\nPlease don't watch. Please. I beg of you.",
            "review_date": "2019-09-22",
            "lang": "en"
        },
        {
            "review_title": "PLS WATCH IT SYNCHRONIZED TO DARK SIDE OF THE MOON!!",
            "content": "Once in a lifetime experience check out the right sync on the internet put the movie on mute and enjoy. Your life will step up a level, I promise.",
            "review_date": "2021-04-23",
            "lang": "en"
        },
        {
            "review_title": "Always bet on Blart......",
            "content": "Paul Blart is back after 6 years of upholding and protecting the public citizens of his local mall in West Orange, NJ. His wife of 6 days leaves him and he loses his Mom unexpectedly, then Paul receives a letter that invites him and his daughter out to Las Vegas for a security convention for the elite mall cops. But it's not too long before he is pulled into action to save his kidnapped daughter from art thieves at the Wynn Hotel and resort........If you like to see an obese comedian falling over and acting like a general moron, then you have found movie heaven. But be warned Kevin James is no John Candy. As amiable as he was on TV, his transition to leading man in a comedy has failed in many attempts.Sandler now knows this, so aside from casting him as support in his own movies, Sandler has realised that time is running out for James, so makes a quick cash-in on a movie that was unexplainably successful.........and not very good to say the least.As you'd expect, the film doesn't have one funny scene, the script is poor, narrative inconsistent, and the random bonkers characters that grace many a Happy Madison movie are missing.But, and it's a really huge but, (he he) the relationship between James and his daughter saves this from being the poorest sequel ever made, and there is quite a good joke involving a Mall Cop wearing a barbers cape.Otherwise as poor as you'd expect.",
            "review_date": "2015-07-05",
            "lang": "en"
        },
        {
            "review_title": "Not bad",
            "content": "I honestly have no idea why people hate this movie so much. It is not exceptional, but it was okay. It had some actually pretty funny moments where the whole audience started laughing(mostly teens and adults). It's an enjoyable movie that you can just turn your brain off, and watch. This will definitely be one of my guilty pleasures. And if you hate it, it is pretty short, about an hour and 30 minutes. If you liked the first one, you will like this. There is a couple scenes with some bad CGI, but it's not like your kids are going to notice it or anything.I am going to buy this on blu ray as soon as it comes out, just to say that I own Paul Blart: Mall Cop 2 on blu ray.",
            "review_date": "2015-04-18",
            "lang": "en"
        },
        {
            "review_title": "Pretty Good",
            "content": "If you liked the first one, you should like this one. I personally liked the bad guys a little more in the first one, and I think Paul Blart is slightly conceited at the start of this one. I also found it kind of annoying they divorced blart and the chick from the first one considering that was a big part of the first one. But Its got the action, and the comedy mix again. I've been a fan of Kevin James ever since King of queens, I find his humor really funny, some people may not. It may not be Oscar worthy material, but Overall if you go in expecting the same type of movie as the first you will be happy with the outcome.",
            "review_date": "2015-05-09",
            "lang": "en"
        },
        {
            "review_title": "Great for all ages.",
            "content": "Paul Blart: Mall Cop 2 is a majestically magnificent master piece, it is my 580th movie that i Tried / Finished but it ended up in one of my top 3. The game is colossal & amazingly excellent in every perspective. World Design : \nGame world is colossal & gorgeous, excellently designed with exclusive & extensive details such as fallen trees are regrown just like in real life, burned or cut down portions of forests, Dead whale on a shore & various type of fish under water are just very few such examples. \nIt is a Living breathing world monsters will also attack other animals, wolves will hunt rabbits & dears. During cloudy weather you will be able to see clouds moving in the sky & shooting stars at night. \nGame have excellently implemented dynamic weather cycle, day and night cycle as you will see a dramatic difference between day and night life. Visuals : \nGraphically game is stunning and even more gorgeous after the latest patch. Animations are top class and facial animations are impressive. Narrative : \nStory is impressive and easy to understand, no matter how many or all the side quests you play; you still wont get lost. Game offers the opportunity to enjoy company of beautiful characters & decent humor. \nChoosing dialogues is one of the best part of the game & Dialogue options are one of the best with various types of choices with provides an enjoyable experience. Unique Features : \nPaul Blart: Mall Cop 2 have some unique features that you wont find any where else such as Paul Blart beard physics. Other examples are :- On Skellige : Gedyneith (Name Of Place) there is A House Under A tree when you visit that place for the 1st time you will see a dude plowing in soil but when you go there later you will see plants. You will see many changes in dandelions inn & main hall in Kaer Trolde castle throughout the game. Combat : \nCombat is enjoyable, addictive, tactical and superb both ways offensive & defensive. AI is intelligent & will use various defensive measures. Despite high level enemies you still can defeat them with tactics & patience. \nOther than basic close combat and ranged weapon, there are bombs & sign abilities (Basically Magic). You can use your ability points on skills but will choose wisely b/z you cant acquire them all as it is an RPG With choices & consequences, But you can reset them with potion. Other activities : \nBeside side quests there are witcher contracts and treasure hunting, you can also participate in horse racing, boxing & playing cards. The card game is also very fun & extremely addictive. Replayability : \nI doubt that some one will play this game once as of the colossal dialogue choices. The game felt vastly different while selecting different dialogues through second game play. I finished it twice and i am gone buy Complete addition & play it all over again.",
            "review_date": "2018-07-25",
            "lang": "en"
        },
        {
            "review_title": "Worse than the first...",
            "content": "\"Paul Blart: Mall Cop 2\" is a Comedy - Action movie and the sequel of \"Paul Blart: Mall Cop\", in which we watch Paul Blart trying to do what he knows best while on vacation with his teenage daughter.After watching the first movie I was sure that there won't be a sequel but I was surprised that actually happened. I believe that it was not a good idea and after watching it I admit that it was a completely waste of time. The direction which was made by Andy Fickman was below average and he did not succeed on creating at least the same feeling as the first movie. In addition to this, the interpretation of Kevin James who played for one more time as Paul Blart was not as good as in the first movie and I think it was a result of the plot. Lastly, I have to say that \"Paul Blart: Mall Cop 2\" is not the best comedy movie and not even a comedy movie to spend your time with, therefore I do not recommend it to anyone.",
            "review_date": "2021-12-30",
            "lang": "en"
        },
        {
            "review_title": "It's growing on me",
            "content": "I saw \"Paul Blart: Mart Cop 2\" in the theater (AMC Westbury, NY). I liked it then but I was a little disappointed. I'm such a fan of the original movie that I had my expectations too high. I enjoy it more now then I did then. It is an uneven movie but more of it works than doesn't. Kevin James and company deliver quite a few laugh and a bunch of goodwill. I'll keep watching \"Paul Blart: Mall Cop 2\" but I won't watch it as much as I watch the original. Honorable mention: a dreamy Daniella Alonso.",
            "review_date": "2020-06-12",
            "lang": "en"
        },
        {
            "review_title": "Low on laughs and comedy",
            "content": "Paul Blart: Mall Cop 2 is the sequel to the highly successful film released in 2009. It is well obvious that the main reason as to why this film was given a sequel was due to the success of the original film. Many wonder as to why it took as long as it did (6 years). Had this film came out roughly 2 or 3 years after the original, perhaps this sequel would have generated more input and been more successful. Within the film, Paul Blart: Mall Cop 2 is a relatively simple plot and storyline. This time instead of Paul Blart being a security guard on duty for his local mall, he has been invited to Las Vegas, and plays officer in one of their wonderful hotels, with mainly the running around occurring in their casino. For starters, this film lacks the depth and genuine comedy of the original (although the original was not great or too funny, it had several laughs). This sequel is quite dull and time pasts quite quickly with predictable and reused jokes. The jokes are the same rehash of \"fay guy jokes\" with Kevin James making a fool of himself, seen falling down, hiding behind objects, and a scene where he fights with a large CGI bird. Neal McDonough is the typical villain and he plays his role well, as it is something he has done throughout his career.Overall, this sequel was not needed, though it still made over $107 million worldwide (more than it's budget back) but did not make as much as the original (which was obvious). A positive about the film is the scenery of the hotel and the overall landscape. Certainly just a one time watch, if even at that.",
            "review_date": "2017-03-28",
            "lang": "en"
        },
        {
            "review_title": "Destination Las Vegas!",
            "content": "One of the worst week for me as most of the of films I've seen were not up to any good. Okay, fine, the first part was decent. I thought a little refresher, somewhat funny too, so on such scenario, anticipating a sequel is common, but this is not what I wanted. After seeing this, I come to realise that the sequel was a bad idea. Seems funny, but no impact. In fact a little boring to see the same old comedy tricks again. Especially mocking a fat man is too offensive at the present era. So the hashtag on body shaming would go viral on social media.They did not get a decent story. Even the film characters, including the villains were too old fashioned. Even this film had made in the 90s, might have not received well too. The concept of going vacation-come-convention, we had seen this before, are not we! Yeah, Paul after his short marriage and losing mother, he and his daughter heads to Las Vegas. Being watchful father and meeting his old friends, the adventure begins, when some criminal activity is going on behind the conference. His plan to save his daughter, as well as thwart the crime are the remaining focus of the film.I felt for a character like Paul Blart, casting Raini Rodriguez as his daughter was a little too much intentional. Yeah, the film was full of television guys every corner. Its not just direction, or performance failed, it was the writing. This kind of comedies is now considered ancient, that's why Rowan Atkinson stopped doing his routine comedies. But now it's certain that there won't be a third. If you had seen the first and not sure about this, believe me, you won't miss anything. Instead, I would suggest you to re-watch the original. That ain't a masterpiece, though a much better one.3/10",
            "review_date": "2017-10-04",
            "lang": "en"
        },
        {
            "review_title": "A Disappointing Sequel",
            "content": "The original Paul Blart is great and there ain't no debate. It was a movie for all ages, and delivered countless thrills. Paul Blart: Mall Cop 2 on the other hand was not as memorable. Then again, the first film was lightning in a bottle and it would have taken a miracle to recreate that magic. The sequel lacks the memorable action sequences of the first film. The most noteworthy action beat in the movie is when Paul Blart expertly punches an elderly woman in the stomach. The worst part is it was not even a fair fight. If the old lady was aware of the attack i'm sure she would have held her own, especially if she had access to kryptonite. The movie is also disappointing when it comes to the supporting cast. Justin Russo from Wizards of Waverly Place appears in the film and he doesn't even perform any magic to aid Paul Blart on his quest. Overall though, the movie is not that bad. What holds it all together is that it still carries the same inspirational message as the first film. With a killer moustache, a little confidence, and a high-powered segway, you too can take out a building full of armed criminals. #AlwaysBetOnBlart",
            "review_date": "2017-06-30",
            "lang": "en"
        },
        {
            "review_title": "Luckily, Everything Is Digital, So They Didn't Waste Celluloid.",
            "content": "Aren't comedies supposed to be funny? I mean, isn't that the purpose? You go to a comedy movie, and you are supposed to enjoy a few good laughs. Not once did I have that moment as I sat through Paul Blart: Mall Cop. And the theater was the quietest I've ever experienced. For the majority of the film, the audience was stone face silent. It was a painful silence...until a woman giggled at something. Then she buried her face. \"Oh God! Everyone is looking at me,\" she said.Paul Blart goes to Las Vegas for a trade convention. But he can't leave his job behind, so he keeps imagining these scenarios. But in the end, he stumbles upon the dream heist. And all his delusions come true.Okay, at what point did these jerks think that releasing this movie in the world where Trayvon Martin gets shot for walking to the store is okay? From the scenario that they write, Paul Blart doesn't need a pat on the back. He needs help. These lousy filmmakers try to sell this anti-gun message. But they think it's okay to highlight a security officer with an over-active imagination? Really, really bad.",
            "review_date": "2015-05-09",
            "lang": "en"
        },
        {
            "review_title": "Harmless, enjoyable fun.",
            "content": "Quite a bit of bile about this film, and I can't understand why. I enjoyed it far more than the first one, and felt uplifted after watching it. It's a real feel good movie, with no swearing or overt sexual scenes, it's a breath of fresh air for an American comedy. If you want to settle down with the family and not worry that they're going to see something you'd really rather they didn't, then you can watch this safe in the knowledge the most extreme thing in this is a bit of cartoon type violence. There are some real laughs to be had, and Kevin James is his normal lovable self.",
            "review_date": "2015-08-02",
            "lang": "en"
        },
        {
            "review_title": "It's not funny - it's just not.",
            "content": "I am not as angry with Paul Blart: Mall Cop 2 as I have reason to be. The movie is too lethargic and bland to earn any sort of rage; the closest I come to anger is that while I was watching the movie I had an intense desire to be anywhere else – a feeling I haven't had since Gods Not Dead a year ago. My anger for this movie is possibly quelled by the fact that Hot Tub Time Machine 2 is still fresh in my mind, a comedy that contained a joke that brought up mental imagery of The Oklahoma City Bombing. Paul Blart 2 is merely boring and uninteresting.Paul Blart: Mall Cop 2 is a colossal waste of time. It is 94 minutes of watching an otherwise engaging comedian flop around on the floor and make a fool of himself. What it illustrates is that Kevin James is at his best away from Adam Sandler's crew. Sandler's Happy Madison Productions is responsible for this chunk of indifference and also the two Grown Ups movies, and most of the movies that make up James' filmography. They illustrate the low points of his career. Away from HMP, James is a funny likable guy in his stand up and on his TV show and in movies like Hitch.Here Kevin James is a requisite tool, playing a character who is an annoying bongo hunk of flopsweat who is persistently under the mistaken assumption that what he's doing is clever. Paul Blart's signature attribute is that he makes faces and gestures that suggest that he thinks he's being agile and intuitive while in reality he's just a dumpy loser who spends his life embarrassing himself by falling over things and making colossal miscalculations. The problem is that you don't laugh at his antics; you feel sorry for him because of his misfortunes in life and groan impatiently while waiting for him to move to the next obvious slapstick gag.Let's examine one gag in particular. Paul meets a man outside a Vegas hotel who is renting Segways. Since Paul uses this particular item on a regular basis on his job, he fancies himself an expert. He wants to show off but the vendor tells him that he needs to see a valid driver's license first. Paul scoffs. The man is irritated and insists again that he needs a valid driver's license before he can let Paul try it out. Paul goes ahead, doing stunts and showing off while we see the face of the poor vendor who becomes irritated by Paul's stunt show.What is frustrating is that we agree with the vendor. He's a guy doing his job and this idiot is putting his job in jeopardy. The vendor is never set up as an and angry malaprop, but as a normal guy doing what he should be doing. For this, we don't like what Paul is going. That pushes us away from him, and the scene works against the character.There are at least a dozen scenes like this in Paul Blart Mall Cop 2, up to and including a running gag in which he provokes a fight with a peacock. This happens three or four times in this movie, and every time I saw the peacock, I winced because I knew that the movie was recreating a epic fight between Peter and the giant chicken on \"Family Guy.\" It's wastes time, and it isn't funny.The plot finds Blart traveling to Las Vegas after his wife (Jayma Mays) divorces him for no apparent reason after only six days, and then his mother (Shirley Knight) is run over and killed by a milk truck – that's suppose to be funny, and so are the scenes of Paul Blart crying over it. One the cusp of sending his daughter Maya (Raini Rodriguez) off to college, the two travel to Las Vegas to attend a convention of security guards, and run headlong into a heist of precious works of art.That's it. That's all you need to know. The rest of the movie is watching Paul Blart make a fool of himself. He makes a miscalculation, and usually ends up flying across the room for his troubles. Why? Cause he's fat, and the people who made this movie are under the mistaken assumption that fat people in and of themselves are funny when they fall down.The movie isn't funny. There are no laughs here. Normally I blame the writers and not the actors, but here I have to because Kevin James himself is one of the writers. He wrote himself into a corner. The problem is, you don't laugh at Paul Blart, you feel sorry for him. It's deadly to a comedy, as Roger Ebert once asserted, when you feel sorry for the character. It's painful to watch him embarrass himself, fall on the ground, slide across the floor, nearly get hit by a car or, fighting that peacock, and one endless scene in which he ends up on stage during a performance of Cirque du Soleil's \"La Reve.\" The character isn't funny, he's pathetic. Watching him is a dreary experience.",
            "review_date": "2015-07-22",
            "lang": "en"
        },
        {
            "review_title": "Funny, Entertaining, great movie all round",
            "content": "An overall really funny film,even if it isn't as good as the first.A great story throughout which adds to the many moments that made me laugh.A brilliant film and a must watch.",
            "review_date": "2019-11-24",
            "lang": "en"
        },
        {
            "review_title": "Saved My Life",
            "content": "I was a self deprecating fool, and then it happened... my life was changed in an instant... I came in contact with my lord and savior PAUL BLART. His Holiness actions have bettered my life through teachings of love and self discipline. I have changed my ways thanks to that man with a moderate to severe food addiction. I wait patiently as he embarks on a new chapter in his life where I can merely watch from a distant as the creation of the third installment to the Mall Cop franchise. Right now i can only speculate the coming tales of rigorous action and devote intent on keeping public areas safe in this time of fear and hate. He is a shining example of human courage and masculinity. I cannot wait to see what ensues in this fictional alternate universe.-Godspeed, Officer BlartWith Great esteem, HAO",
            "review_date": "2016-02-17",
            "lang": "en"
        },
        {
            "review_title": "Uncomfortable Humor",
            "content": "There was something very uncomfortably embarrassing about the attempts at humor, similar to the feeling, as an example, you would get if a stand-up comedian came to a grade school and told bar jokes. Which was compounded by all the scenes of a self-centered, almost narcissistic, Paul Blart behavior towards others and even his daughter. Either not aware, or minimizing his daughters attempts at college and acceptance letter dates. Additionally, as an example of film for money I don't know which promoted themselves more, Blart or all the product and resort scene placements in the movie. For most of the film the story went nowhere but heading toward what was a predictable, right from the beginning, ending of redemption by foiling a pretty stupid heist (a heist routine used so often in film it deserves cliché status).",
            "review_date": "2015-07-28",
            "lang": "en"
        },
        {
            "review_title": "IMDb doesn't have the capacity to leave a zero",
            "content": "There is really no simpler way to say that this film is awful. In every possible way this is an appalling movie - badly written, conceived, staged, acted. Normally, with these types of movies, I can always say: 'but it's not made for me, it's made for children and should be viewed via that context...' but I watched it with my children and they also found it to be a hateful, empty experience and we all decided to switch it off around 3/4 of the way through.So, just to help you out here: watch anything else but this. Films that are better than this: Jingle All the Way / George of the Jungle 2 / Chihuahua 2. I feel sorry for the people working on this movie as they all did it for the paycheck, because there is nothing good, original or funny in this movie. Watch re-runs of quiz shows or something, but don't watch this.",
            "review_date": "2015-07-14",
            "lang": "en"
        },
        {
            "review_title": "I love this movie but my friend made fun of me for it",
            "content": "I watched this with a friend and we bouth laughed and enjoyed it but he called me gay behind my back the next day :((",
            "review_date": "2018-02-11",
            "lang": "en"
        },
        {
            "review_title": "Kevin James is the next Messiah",
            "content": "The main joke of everything in this movie may be described in the following short list. Kevin James is fat, Kevin James is lonely, Kevin James is out of touch, or any combinations of those atrocities. Here's the main problem, Adam \"lucifer\" Sandler's company, Happy Madison has tried to turn Kevin James into a poor man that is looked down upon by others. This has been his plan all along, because Kevin James is supposed to be the next messiah. If we keep letting Mr. Sandler destroy Kevin James' image we will have no messiah to lead us in our war efforts Against the next plan to destroy the world by Satan. So don't be fooled, Kevin James is a holy man and Adam Sandler is trying to convert us to in to followers of Satan.",
            "review_date": "2017-03-31",
            "lang": "en"
        },
        {
            "review_title": "The silence was deafenting for this one...",
            "content": "I won't deny that I found the first film to be mildly entertaining. It wasn't a groundbreaking comedy but there were a couple moments I found funny and it came out during a time where I still found Kevin James very entertaining—I loved his stand up and \"The King of Queens\" was a very entertaining show. This sequel, however, was just messy and I only laughed (and it barely registered as a laugh) one time.The story doesn't venture far from the essence of the first film (and that's expected) but the story and plot are so lazily thrown together that it actually feels like there's a competition between that and the jokes on which element could be lazier. The film is basically a thrown together story with elements that are either established and altered or established and ignored later or established and poorly developed only so there can be a place for Kevin James to thrown in some equally poorly created comedy. If it wasn't bad enough that all the scenes have a slew of jokes that fall flat constantly, the film overly relies on a single gag and that gag is Kevin James falling down. That was the film's go-to joke and it made for a one and a half hour long comedy so tedious that it felt like it was three hours long.The only part I liked was the character of Maya. Her storyline that involved telling Paul that she was accepted into a good school was interesting and her desire to get out and be an adult and not have her father hovering over her was some great development for the character. Additionally, Raini Rodriguez proves to be the only actor that is actually giving a good performance. Aside from this, the rest of the film was just a complete wash for me and really hard to sit through.",
            "review_date": "2015-08-08",
            "lang": "en"
        },
        {
            "review_title": "Movie is so bad I'd I've it a negative rating if I could.",
            "content": "This movie was so uncomfortably bad I will never watch it again. My group of friends and I went into the movie expecting a corny movie that we could laugh at but what we saw, ruined my humor and views of Kevin James. The movie bombarded the audience with line after line of fat and \"fake cop\" jokes that it made me want to vomit yet it still made people chuckle. The text was so unoriginal and cliché that you could predict what was about to be done or said making the movie uninteresting and not funny when it tried to be. If you didn't know any big name actors, you'd think that this production was composed by a high school student writing a last-minute essay for English class. The plot is rushed and at some points, I couldn't even figure out if there was a plot. The \"romance\" between Blart and some woman is unbelievably unrealistic and the producers try to salvage and few jokes from that but just made me even more uninterested in the movie. I managed to sit through the movie but in the end, it made me sick that something with a big-name actor like Kevin James even exists and is even referred to as a comedy.",
            "review_date": "2015-04-17",
            "lang": "en"
        },
        {
            "review_title": "Leaden piece of fluff",
            "content": "High on any list of \"movies for which no one was demanding a sequel\" would be \"Paul Blart: Mall Cop,\" an unfunny flick that inexplicably went on to be a major box office hit in 2009. Yet, here, by unpopular demand, comes \"Paul Blart: Mall Cop 2\" - a movie that takes place at a mall in only the most tangential sense, it should be pointed out - and it makes the original look like \"Airplane\" in comparison.The script by James and Nick Bakay feels as if it were written on the set in between takes. The joke or sight-gag that works seems like nothing more than a lucky spin on a roulette wheel, so infrequent is the occurrence.The follow-up pretty much replicates the plot of the first movie, as the segway-riding Bart bungles his way into foiling an art heist at a Las Vegas hotel/casino, where Blart is attending a security officers convention with his daughter, Maya.Indeed, the sole bright spot is Raini Rodriguez as Blart's carbon- copy but levelheaded daughter, an actress with charm and likability to spare (David Henrie also isn't bad as her youthful love interest). The same cannot be said for Neal McDonough, Daniella Alonso and Nicholas Turturro, fine performers all who, I'm sure, would appreciate having this cinematic turkey expunged from their resumes.",
            "review_date": "2016-02-03",
            "lang": "en"
        },
        {
            "review_title": "So many fake reviews",
            "content": "I have nothing against the lead role in this movie as a person, but I really feel sorry for him, I can't imagine a person on this planet who would want his face on the cover for this trash of a movie.I would give him another chance in another movie in the future, as lead role, but just because of all the fake reviews by Adams Sandlers lackeys, I'm never gonna watch another movies with these people again ever.Now, back to this movie. There are so many unlikely, and I mean 0% chance in the world relations going on here that its honestly depressing. Its like an (you name it)-awareness movie.I watched about half of this movie before I turned it off and trashed it, this was right after I prayed for the lead roles future in acting after the random scene with the bird. After that I must say I was extremely surprised to see that the movies was only half done. How you could pack more incoherent crap into this is beyond me.After you watch a movie good movie you're usually left with some sort of emotion or food for thought after its over. The movie it self, mixed with the obvious and shear amount of fake reviews on IMDb makes me feel sorry for America. Get a grip guys, you are really starting to slip across the pond. This movie would have had 1 star had all the fake reviews been weeded out.Oh, and how about that stereotypical black woman? Jesus.",
            "review_date": "2015-06-29",
            "lang": "en"
        },
        {
            "review_title": "Get a sense of humour!",
            "content": "It's a simple humour and just plain fun! There's not enough of this silly humour and wish there was more nowadays. It's an easy story and is a relaxing and entertaining movie!! Some people are just too critical.",
            "review_date": "2022-04-09",
            "lang": "en"
        },
        {
            "review_title": "The Best Movie Kevin James Has Starred In Yet",
            "content": "The only movie with Kevin James in it that I can recall liking better than Paul \"Blart: Mall Cop 2\" was \"Hotel Transylvania\", but this is the best starring role James has been in. Considering the fact that this movie has a 4.4/10 average on IMDb, 7% on Rotten Tomatoes, and a thumbs down on Roger Ebert's site, I was quite believably expecting this to be even worse than the first one, which is one of the best examples of Kevin James' un-clever, un-funny acting. Zookeeper was probably his worst performance ever, and I would not be surprised to see its title listed as a synonym of stupid in a thesaurus. Here Comes the Boom is perhaps the best-made movie he has ever been in, just not as entertaining to me as Mall Cop 2. Please don't even get me started on his old sitcom, The King of Queens. I'll just say that I would rather watch Zookeeper twice in one day than a single episode of King of Queens, and I'll leave it at that.So, before I watched Mall Cop 2, I was understandably prepared to despise it, especially considering how much I disliked the first one, and the fact that the majority of people like the first better than it. This movie blew my expectations out of the water. The acting's bad, there are too many Disney channel actors, the plot is contrived, the whole idea is childish, and the characterization is the most pitiful point of the movie, even worse than the first I daresay. But it actually succeeded in it's one goal: trying to be funny. That is Kevin James' biggest failure: trying to make comedies, when he is one of the least funny people I have ever observed. But this movie at least lives up to its genre, and although even the funniest part only gets a silent chuckle out of you, and Paul Blart's insane character is as annoying as it tries to be funny, you can forget about the poorly-made parts, the cheesy dialogue, the bad scripting, and try to enjoy it. That's about the only way to enjoy it.My Official Score: 58.5/100",
            "review_date": "2015-09-14",
            "lang": "en"
        },
        {
            "review_title": "Surprisingly a lot better than the original, and that was a surprise too.",
            "content": "The Paul Blart movies are the kinds of movies you don't want to admit have any redeeming qualities, but they do. Nobody who sees a movie like this should be expecting a Marx Brothers masterpiece or something on the scale of \"It's a Mad, Mad, Mad, Mad World,\" \"Network,\" \"National Lampoon's Animal House,\" or \"The Blues Brothers,\" but the way many critics have been talking about this movie, you'd think they just saw an idiotic Tom Green crap-flick.Six years after his triumphant battle against the Santa's Elves Mall Robbers at West Orange Mall that brought him considerable fame, Paul Blart finds his life has shot back down into the toilet. His new wife, Amy was grossed out by the idea of having sex with him on his honeymoon, and divorced him six days after the wedding. I realize Jayma Mays was too involved with the making of \"Glee,\" but the second movie made her character look like a selfish bitch. The next traumatic event was the death of his mom, who was hit by a milk truck, and the movie does acknowledge the fact that the use of milk trucks are few and far between these days. Nevertheless, there are people who collect them, and I've driven along the New Jersey Turnpike, and saw parts of New Jersey that look like they still use milk trucks. The Oranges are not one of those places.On the positive side, Paul has been invited to a convention of security guards at the Wynn Hotel and Casino in Las Vegas, and Maya has been accepted for a scholarship at UCLA. However due to her father's string of bad luck, she decides to hide her acceptance letter from him. At the hotel, Maya falls head over heels for a valet driver/concierge named Lane, played by David Henrie. His feelings for her are mutual and he doesn't seem to mind the fact that she's short, pudgy and overweight like her father. I would've loved to see their relationship go a lot further. It wouldn't have to be hardcore pornographic, or anything like that. Just something suggestive and titillating. Because after Raini's heartbreaking performance in the Austin & Ally episode \"Beauties & Bullies,\" she deserves some happiness. Maya seems determined to spend her time in Vegas living life to the fullest, like society tells teenagers they should do, while simultaneously throwing massive obstacles that prevent them from doing so.When she stumbles on the sinister plot of Vincent Sofel (Neal McDonough) a high roller who's working on a sophisticated art theft, she tries and fails to avoid being kidnapped, all while Blart is filling in to make a keynote speech about her calling to \"help someone today.\" And when Lane tries to look for her, he gets taken too. Paul finds out what's happening when she finally gets him on the phone, but it's too late, and it's Blart to the rescue once again. And like in the first movie, despite his weight, hypoglycemia, and overall clumsiness, he defeats the henchmen one by one, the majority of which are posing as security guards at the hotel, including some who are genuine.The confinement of these kids could've been used as an opportunity to get them closer together, but instead they use it to try to plot their escape. Though they fail, along the way they find out a little something about the man who kidnapped them that Maya takes full advantage of towards the end. Later on, the same bad guy overhears a conversation between the would be lovers and tries to use it against her dad after he defeated many of his guards and he offers to swap the art for his daughter.One of the crooked guards reminds me a lot of the late Warner Brothers animator Chuck Jones for some reason. The movie also tries to give false hints about two other guards that may be involved in the robbery, when in reality one of them wants to be involved with him, and the other jealously believes he's trying to take her away from him.The movie contains some of the same gags and slapstick humor as the first. Paul inadvertently harms a creature who couldn't fight back (the dog on the street in the first one, and an old lady in the second one), gets in a fight with someone, while another person just watches (the lady in the Victoria Secret's store in the first, and the exotic crane in the second), defeating villainous female sidekicks by squashing them and not doing anything nasty to them, and helps out a little kid (the girl who can't get a shopping bag in the first one, and the lost little boy in the second). Fortunately, it doesn't show a scene where Blart tries to jam out on stage with Mini-KISS, like some trailers have suggested. What it does have is a scene where the other guards help Paul zip-line between Wynn's two casinos. The scene may include trick photography, stunt work, and/or CGI, but it's still scary as hell, even after the first time. I'm not going to lie to you people though. The primary reasons I saw this were for Raini Rodriguez, and my memories of the antics of the first movie, which at this point can't be done without Kevin James. I wouldn't bet on a third movie, but this is good enough for me.",
            "review_date": "2015-07-25",
            "lang": "en"
        },
        {
            "review_title": "Plawl Blop Mail Coop 7 Review",
            "content": "Hello, I would like to bring up a srs topic, dat Kevin James should become the president of the United States! He could play that in a movie! I hope he doz! Anyway, Plal Blart Mall Cop 7 is the greatest piece of cinematic art I've seen since the beautiful film \"Jack and Jill.\" These films showcase the masterful talents behind Happy Madison Productions, who've made the greatest movies throughout the 21st century! Adam Sandler is a comic genius, however I didn't like his films \"Billy Madison\" and \"Happy Gilmore\" :(I think all of the \"jokes\" and horribly boring plot line worked together to make one of the greatest classic films of all time!",
            "review_date": "2015-08-13",
            "lang": "en"
        },
        {
            "review_title": "The Vidiot Reviews...",
            "content": "Paul Blart: Mall Cop 2The one thing mall cops can't protect their employer from is the public's lack of interest in shopping malls.Fortunately, the rent-a-cop in this comedy is headed to a less depressing place.Still reeling from the death of his mother and the disintegration of his marriage, Paul's (Kevin James) ecstatic to receive an invitation to the security guard convention in Vegas. With his daughter (Raini Rodriguez) in tow, Paul parades around Sin City under the assumption that he is the key note speaker.Threatening Paul's imagined accolades is a sophisticated thief (Neal McDonough) who plans to pilfer the priceless paintings from the hotel where he's staying.The superfluous sequel to the inane original, Paul Bart 2 doesn't expand much beyond James' waistline, which, by the way, is integral to the fat-guy pratfalls that dominate the insipid script. Besides, the best way to protect original artwork is with exploding dye-packs. Red Lightvidiotreviews.blogspot.ca",
            "review_date": "2015-07-06",
            "lang": "en"
        },
        {
            "review_title": "A bottomless pit of terrible",
            "content": "Paul blart 2 is an experiment in horrible acting. Kevin James is a known quantity of tacky \"fat man in a little jacket\" (also in quotations) \"comedy\", but his daughter Maya played by Raini Rodriguez is an abomination. She's as terrible and talentless as her little brother via modern family fame. She delivers all of her copy and pasted dialogue with the entuasium of eating a 3 day old ham sandwich. How she got work in Hollywood outside of a seven eleven highlights how terrible this series is to the core.It's amazing there was a sequel or that this is now techniqually a series. It's one joke. Two movies based on one joke that was NEVER even funny. Overweight mall cop on a Segway.they just keep kicking the fur off the dead horse. Again and again it's not funny. I'm worried at this rate, if they make a third film, it will be so oppositely funny, that it may make it funny. Having a credit on this film must be more embarrassing than unemployment.The worst part is, I don't think it's as bad as the first one. Maybe it's that lack of skateboarding super crooks or the fact that the first film is one of the worst movies of all time. But a 2/10 is still twice as good as I rated the first one",
            "review_date": "2015-06-28",
            "lang": "en"
        },
        {
            "review_title": "Hilarious!",
            "content": "I know I am really late on reviewing this title but I just made an account on IMDb and HAD to review this movie. When this movie was coming out I had and I mean HAD to see this and I will be honest with you I had high expectations for this movie and at first it seemed like the movie let me down and then all of the sudden I just couldn't stop laughing. Perfect casting, perfect acting, and perfect plot. The first movie got put to shame after this movie came out, the first movie was a lot duller (but that's for another review) I am hoping they make a third movie out of this and make it more funny than this, if that's even possible. All in all if somehow you haven't seen this movie yet I HIGHLY suggest renting/buying it RIGHT NOW!",
            "review_date": "2016-07-18",
            "lang": "en"
        },
        {
            "review_title": "It's no where near the first movie (like no sequel usually is),, the plot here is a bit loose but doesn't mean i didn't enjoy a bunch of funny scenes they had.",
            "content": "So Paul Blart is back again after almost six years and honest to god those years weren't enough to make the movie at least as half as the fun we've seen in the first movie,, the problem is the plot doesn't really seem strong enough yet to make a movie about it and also the script felt a bit shattered in some scenes but over all that bits of failure to be fair there were more than a handful of scenes where i kinda laughed in in some i had a giggle ,, mostly those scenes when \"Paul\" trample on something and fall down accidentally or hit a clean glass door ,, or got hit by a horse when trying to act sexy :D :D so it was somehow enjoyable despite the fact that the story lost its charm a bit, i mean its like the hangover the 3rd movie like we got used to the story and the action now needed upping a little !!As for the cast,, Kevin James is still ingeniously funny his script didn't give him much justice part from these silly yet hilarious things he does in the movie ,, as for the others they were fine .. the movie was all focused on Paul Blart so you kinda see him in every minute .. but also the fight scene where Paul friends fight like a pros in a stupid way .. that was funny..So overall,, yeah its not that strong first movie we've seen six years ago ,, but i surely enjoyed and i'm not regretting it for a second Watching Kevin James again as Paul Blart. And Honestly, the reviews here are a bit unjust to give it a 1/10 !! oh that's cold :P",
            "review_date": "2015-07-06",
            "lang": "en"
        },
        {
            "review_title": "embarrassing attempt at being funny",
            "content": "This movie was one of the worst we've seen since 'the day the earth stood still' and my top nomination for a razzie. The movie itself was bad - lousy acting, Scenes that were supposed to be funny are so embarrassing is makes my toes curl. It had a few funny scenes, but not enough to keep the movie going, and the characters in the movie lacked depth or flair to lighten it up. Some scenes are in there for no apparent reason and add nothing to the story. Other scenes lack creativity and logic. And the actors accompanying Kevin James lack any depth. I liked Kevin James in the 1st Paul Blart movie, but this is not a performance he can be proud of.",
            "review_date": "2015-07-01",
            "lang": "en"
        },
        {
            "review_title": "is a comedy, and works",
            "content": "If u take this kind of movie serious, thats wrong, is a comedy aimed at the kind of old comedies that were slaptick and dumb, but with a plot.Ive seen alot of weekends this movie and never gets boring.is a comedy, is funny, i dont get why some people take it sooo serious.",
            "review_date": "2021-10-14",
            "lang": "en"
        },
        {
            "review_title": "its good",
            "content": "(only if you like that kind of humour)if you wanna see something serious see an other movie, its classic Blart",
            "review_date": "2021-01-01",
            "lang": "en"
        },
        {
            "review_title": "The Trailer is Better Than the Movie",
            "content": "After the trailer, and the first Paul Blart movie being very funny... I expected much more than what was delivered. Anxious attempts at humor was all I saw, with the funniest scenes all being in the trailer.Boring to sit through, although some children may enjoy it. At least this looks to guarantee we won't have a Paul Blart 3 coming out at anytime in the near future.The strained attempts at humor probably won't hurt Kevin James future, as most people will forget this movie quickly enough. Don't waste your time on this one, just watch the trailer again instead.",
            "review_date": "2015-08-28",
            "lang": "en"
        },
        {
            "review_title": "They Didn't Get it Right the Second Time",
            "content": "I had the incredible misfortune of paying to see \"Paul Blart: Mall Cop\". I would not make the mistake of paying to see PBMC2 and I didn't; but I still feel cheated. I didn't think the first one was funny and I know that sequels are usually worse, yet I decided against my better judgment to watch it anyway.The problem with PBMC2 is that it was uncomfortably unfunny. Paul Blart was like that comedian who's trying very hard yet no one is laughing. Much like Stacey Dash's appearance on the Oscar's the other night: cringe worthy.Paul Blart is still an oblivious fake cop with an inflated opinion of security guards. This time he's taking his shenanigans to Las Vegas. There he meets up with other security guards from around the country who are equally out of shape and braggadocios.Kevin James does his typical physical humor accompanied by his exaggerated speech and facial expressions. Just about every joke falls flat and misses the mark. The comedy is the only reason you'd bother to watch the movie because it offers nothing as an action movie or any other type of movie. This is what I get for viewing another Happy Madison production.",
            "review_date": "2016-03-01",
            "lang": "en"
        },
        {
            "review_title": "LOVED IT!! SOOO GOOD!",
            "content": "My husband kept asking me what was so funny as I watched this (he was playing video games as I watched this movie on my laptop with headphones beside him). I just couldn't stop full out laughing. A clean and funny movie! I replayed some of the funny parts for him and even my husband laughed, who doesn't like corny things, and couldn't help but shake his head and chuckle. Almost didn't watch it because of all the bad reviews but then I read a few positive ones and I decided to give it a try. If you like corny or \"dad jokes\" this will be enjoyable! Go into realizing it's a corn ball movie and choose to see the hilarity in the extreme goofy. Recommending this one to friends and family after I finish writing this review!",
            "review_date": "2019-06-04",
            "lang": "en"
        },
        {
            "review_title": "Not horrible, not very funny, still like, OK.",
            "content": "I like Kevin James. I always liked The King of Queens, so I also watch most movies with him in them. I can't really say that his movies are gold, but they are mostly, you know, easily watched entertainment that won't stick with you for long.I saw Paul Blart Mall Cop when it came out, and I thought it was alright, nothing too special, but not horrible either.Now the sequel is here. And it's pretty much the same thing, but it is a little worse than the first one.Most of the jokes are really kid friendly. Not all of them work very well. I did chuckle a couple of times, though. (I rarely laugh from movies, so a chuckle or two isn't that bad) The problem is that a lot of the jokes just aren't very funny. I still like Kevin James's acting, I think he has pretty good comedic timing. The direction is a bit lazy.At times the quality of the jokes and gags are almost like a bad spoof- movie, I generally don't hate spoof-movies, but if they are bad, they can be real bad. And unfortunately this movie is like part comedy, part spoof. (although not spoofing anything in particular)I get why this was bashed by the critics, it is that type of movie, but I didn't find it to be horrible. It was easy entertainment, and I definitely wasn't bored, I just didn't laugh much. It has a message, it's a good message, but not very creative.It is rated PG, and I think kids would probably enjoy it.",
            "review_date": "2015-06-29",
            "lang": "en"
        },
        {
            "review_title": "A Fun Comedy",
            "content": "I don't understand negative reviews of this one. It's a very fun comedy with a nice little plot twist. I quite enjoyed watching it. No it's not the greatest comedy but it's still funny.Give this one a try if you want sometimes light hearted and simply fun.5/10.",
            "review_date": "2021-08-29",
            "lang": "en"
        },
        {
            "review_title": "So Silly!",
            "content": "The sequel to Paul Blart: Mall Cop, 'Paul Blart: Mall Cop 2' is an entirely silly sequel, that is aimed for the kids & the kids at heart. Strictly serving over-the-top humour, this recent box-office surprise hit, will only appeal to those who are willing to say yes too sheer silliness.'Paul Blart: Mall Cop 2' Synopsis: After six years of keeping our malls safe, Paul Blart has earned a well-deserved vacation. He heads to Vegas with his teenage daughter before she heads off to college. But safety never takes a holiday and when duty calls, Blart answers.I must admit, I didn't hate 'Paul Blart: Mall Cop 2'. No, I wasn't overjoyed by this bloated sequel, but then again, I didn't except a comedic milestone from this one. I did laugh at times & Kevin James's spirited performance as the Mall Cop, won me over. There are many flaws in this film, but its all good if you are only looking for some dumb laughs.",
            "review_date": "2015-06-28",
            "lang": "en"
        },
        {
            "review_title": "It's bad sitcom style comedy, but it's not that bad!",
            "content": "'PAUL BLART: MALL COP 2': Two and a Half Stars (Out of Five)Sequel to the hit 2009 action comedy flick 'PAUL BLART: MALL COP'. Both films star Kevin James; as a security guard who's far too serious about his job, but still manages to find adventure. In this film he takes on viscous art thieves. James also co-wrote the movie (with Nick Backay) and co-produced it (with his buddy Adam Sandler). It was directed by Andy Fickman and costars Neal McDonough, Daniella Alonso, Raini Rodriguez, David Henrie, D.B. Woodside and Nicholas Turturro. Both films were huge hits at the Box Office, but got horrible reviews from critics. I haven't seen the first movie, but I can definitely say that this sequel isn't good enough to be a big hit, or bad enough to get such dismal reviews; it's just mediocre comedy.The film takes places six years after the events of the first movie; Paul Blart (James) is struggling to get over his wife (Jayma Mays) leaving him, after just six days of marriage, and the sudden death of his mother (Shirley Knight), in a tragic accident involving a milk truck. He finds happiness by continuing to obsess over his mall security job, and spending lots of time with his loving daughter, Maya (Rodriguez). That happiness is threatened, when Maya finds out she was accepted to UCLA, and might have to move to Los Angeles. She doesn't tell her father this news though, in fear that it will break him. Paul is thrilled to find out he's been invited to the security officers' convention, in Las Vegas, and Maya goes with him to the event. Things take a turn for the worse though, when Paul discovers dangerous art thieves are attempting to steal priceless works of art, from the hotel they're staying at, and threatening the safety of his family. The movie is pretty silly but it does have humorous moments. James is decent in the lead, but his script could have used a few more rewrites. It's bad sitcom style comedy, but it's not that bad. I don't regret watching it and I actually found it mildly amusing. I still wouldn't want to see a third one though; or the first one for the first time.Watch our movie review show 'MOVIE TALK' at: https://youtu.be/5zwAFiaOqq4",
            "review_date": "2015-08-07",
            "lang": "en"
        },
        {
            "review_title": "Okay",
            "content": "This movie is good more like an okay I laughed but not like the first part.",
            "review_date": "2021-02-27",
            "lang": "en"
        },
        {
            "review_title": "Bad movie... just... bad",
            "content": "This movie was bad. I saw it because of the McElroy Brothers Podcast: Till Death Do Us Blart. That podcast exists because this movie is bad. I have now seen the movie, and i too thought it was bad. This movie is bad, and someone should feel bad.The characters in the movie were bad, and the main characters were bad. Except Maya, who was not bad - but still seemed bad because the rest of the movie, \"story\" and characters were all so bad.This movie is a commercialIf there was ever any talent near it, the talent lacked any semblance of effort.Any and all things in the movie were lazy, half-arsed, stupid or worse.I remember Kevin James in King of Queens as something more than this. Funnier. But after having seen this movie-length commercial, i'm terrified of ever going back to that series.",
            "review_date": "2016-12-03",
            "lang": "en"
        },
        {
            "review_title": "This wasn't as bad as I expected but it's not good and should not have been made. Kevin James is much better than this movie.",
            "content": "\"I think I'm finally being recognized for getting the mall of of that jam.\" Paul Blart's (James) life is starting to fall apart. He lost his wife and mother but things perk up when he is invited to a security guard conference in Las Vegas. He is the same ol' Blart and when his daughter is in trouble he steps up and does what he does best. I thought the first movie was OK and I really like Kevin James, but this is a movie I was not looking forward to at all. To me Kevin James is very funny and he doesn't need to keep relying on the \"I'm fat\" gimmick to get laughs. He falls back on that one a little too much in this movie and it gets old. The movie is nothing but a rehash of jokes from the first one but with most of the comedy missing. I do have to admit that this wasn't as bad as I expected but it's not good and a sequel that should not have been made. Kevin James is much better than this movie. Overall, kids may like this, but the movie is far to childish for adults. Kevin James needs to get a better agent. I give this a C.",
            "review_date": "2015-07-13",
            "lang": "en"
        },
        {
            "review_title": "the bestest movie ever made ever.",
            "content": "Paul Blart Mall Cop 2 is honestly one of the best films ever made, up there with Birdemic shock and terror and cars 2 This masterpiece has something for everyone, it has comedy, action, drama, romance, horror and an extremely well done, totally original story and all its jokes are super smartly written, especially where he says he is independent but is scared of being alone or something like that.",
            "review_date": "2017-04-08",
            "lang": "en"
        },
        {
            "review_title": "Edge of your seat comedy!",
            "content": "After waiting for 2 days in front of my theater, I finally got a ticket to the 2015 blockbuster \"Paul Blart, Mall Cop II.\" I love Kevin James and he delivers the absolute best performance of his life. This movie speaks volumes of the Hollywood comedy of yesteryear. I sat in the theater with my bucket of butter and when the movie started I started to quiver in my seat, ready for action. I can't tell you about the movie but surely there should be a Paul Blart III. I am a Paul Blart fanatic and wish people would stop watching Star Wars because 2015 is now complete in my life thanks to Paul Blart Mall Cop II. I need to see Paul Blart Mall Cop III in theaters soon.",
            "review_date": "2015-04-18",
            "lang": "en"
        },
        {
            "review_title": "Absolutely horrible",
            "content": "The first movie had some redeeming moments, but was hardly stellar comedy. In this edition, the reading of the lines was wooden and unbelievable. I tried to get past the bad acting, but to compound this with a grade school level plot was too much.The idea that there is a rivalry between the head of security and the mall cops had no foundation and just appeared. The presentation was flat.The plot was transparently thin and poorly delivered. In comedies, there is supposed to be laughs. The only time I even chuckled was at the end of the movie. I am not sure whether it was relief there was no more, or because the sight gag was funny. In either event, if I could rate it 0, I would. Unfortunately a 1 is just too high.",
            "review_date": "2015-04-27",
            "lang": "en"
        },
        {
            "review_title": "Paul Blart Casino Cop? This did not work.",
            "content": "Okay, I may have laughed a couple of times but that's it! Not only was the first movie better made, it was better overall, even plot wise! While still not the best comedy, it was original, more funny, and made slightly more sense! This piece of garbage didn't even have a mall in it except in one sector of the hotel/casino and it was barely utilized! There were so many flaws and mistakes in this movie that it was hard to not notice, and the ending was just atrocious with his CGI body flying across the street! Blart was much more unlikeable for most of the movie and idc how strong anyone is, no man his size is going to hold onto a zip line suspended 60 stories over Vegas for more than 2 seconds! This movie annoyed me and made me want to turn it off more than it entertained me! Call me a film snob but idc, I know I am one!",
            "review_date": "2022-10-10",
            "lang": "en"
        },
        {
            "review_title": "Great during social interactions. Gets bogged down by action sequences.",
            "content": "When the characters interact, this movie is so cute, funny, and charming. When you watch this, you start to realize just how effective simplicity is. Too many writers think that if they pad their stories with extreme, vile, and perverted nonsense...they'll get better feedback from their audiences. It's not true. You just need to be genuine, self-deprecating, kind of dorky, and loving...like this movie.It's only near the end, where the action sequences begin, that the movie gets dragged down. It goes on a bit too long, and it kind of insults intelligence at times. But by the end, you forgive it because of the good.Like others have said. This movie is really nice family viewing. It balances the needs of parents and kids perfectly. Cannot tell you how long it's been since we even watched bothered with Hollywood movies. Thanks Kevin James!",
            "review_date": "2015-07-26",
            "lang": "en"
        },
        {
            "review_title": "No evolution whatsoever, just doing the same thing over and over",
            "content": "I'm really getting tired of seeing Adam Sandler's wife in literally every Sandler/James movie and I'm tired of all of them featuring hapless loser men who get pushed around and I guess for the betas that's humor.The cast is solid, the premise has potential to be funny, the relationship between the main character and his daughter had potential to bring meaning and wholesomeness to it all, but everything's wasted.Dramatic moments and generic lazy slapstick humor are mixed together badly, the whole thing is a disappointing mess.",
            "review_date": "2021-11-15",
            "lang": "en"
        },
        {
            "review_title": "Embarrassing To Watch",
            "content": "Paul Blart, Mall Cop (Kevin James) is invited to a Security Trade Show in Las Vegas, NV. He somehow interrupts Vincent Sofei's (Neal McDonough) plans to steal artwork from the Wynn Hotel.I cannot believe Adults actually put this movie out. Everything was overdone and not funny by Kevin James who cannot act. This is actually embarrassing to watch as we see James as Paul Blart go out of control trying to be funny and failing every second. Maybe the instruction he received was something like this: No matter what the scene, be sure you go ballistic and make a big fool of yourself. And that would make the most sense. Or did he do this on his own? Hmmm\u0085\u0085His new shtick is to fall down, flail around and twist his body to somehow right himself to get ready to face the bad guys. He does this way too often throughout the movie. What is funny about that? A Chris Farley he is not. Again, simply embarrassing. To be fair the rest of the cast performed well. Also to be fair James as Paul Blart did give a very good keynote speech to the Security Trade Show attendees. Is drama in his future? Hmmm\u0085..Probably not.(If this was so bad, why did you watch it?) Remember the promo that showed Blart slapping a horse's rear end and the horse kicking him across the street? That was well done and very funny and I thought the movie would be better and show some humor along the way. Didn't happen. By the way, that scene was one of the very last in the movie. The promos did it to me again. I will never learn. (2/10)Violence: Yes. Sex: No. Nudity: No. Language: No.",
            "review_date": "2015-07-20",
            "lang": "en"
        },
        {
            "review_title": "this is one movie to miss in your life",
            "content": "its not the worst movie I have seen in my life, but it nearly is, comedy its not, very few comedy scenes ,I thought it would never be over, who wrote this crap, poor acting ability by all actors, they just say the lines, main actor is just not funny,who said fat guys are funny they should have added more laugh tracks in so we would know when to laugh, if there's one movie to miss in your life,this is it it rates in my top worst movies of all time mall guard goes to conventionit looks like wyanns casino paid for placement in the movie I wonder was that a good thing the staff were rude and inept and security was bad",
            "review_date": "2015-05-10",
            "lang": "en"
        },
        {
            "review_title": "Second greatest film of all time!",
            "content": "Paul blart:mall cop was good and a classic,but Paul blart:mall cop 2 was a greater film than the original! There should be more movies like this! Kevin James was the best actor ever,and he is a true American! Raini Rodriguez was beautiful as maya blart,Paul blart's daughter! The other security guards in this movie were almost as great as Paul blart,especially Saul gundermutt! Daniella Alonso was stunning in this film as well! The plot was great because the writing was hilarious! You've got to see this film! Hopefully Kevin James will make Paul blart:mall cop 3!",
            "review_date": "2017-03-28",
            "lang": "en"
        },
        {
            "review_title": "Best Movie Ever!",
            "content": "You can throw every other movie out the window because compared to this they all stink! Paul Blart Mall Cop 2 is a beautifully written, beautifully performed masterpiece and will forever go down in history as the greatest cinematic blockbuster of all time!",
            "review_date": "2019-07-15",
            "lang": "en"
        },
        {
            "review_title": "Paul Blart, the best of the 2010's",
            "content": "Paul Blart: Mall cop (The original movie) was better. But this movie was not far away to be as good as that one. I can see that Kevin James and all other cast put there soul in this movie. Hope to see a Paul Blart: Mall cop 3.",
            "review_date": "2020-04-20",
            "lang": "en"
        },
        {
            "review_title": "Amusing and uplifting",
            "content": "Not bad at all. Depends on your expectations. It's not a master work. But if you expect a 1/10 rate comedy movie, you'll be surprised and then Paul Blart won't deceive you.",
            "review_date": "2020-01-26",
            "lang": "en"
        },
        {
            "review_title": "A movie even Paul Blart would hate",
            "content": "I realize this film is targeted at distracted children and adults with IQs matching their mental age, but this is plain obnoxious on every level. The reason the first film failed was the audience was never quite sure if Blart is obliviously hapless or intentionally a grade-A a-hole. This movie leaves no doubt the answer to that question.Zero stars.",
            "review_date": "2021-09-24",
            "lang": "en"
        },
        {
            "review_title": "The Quintessential Movie of Modern Times",
            "content": "I say : \"Etu Shadowman!\" To imitate art is life. This is less a movie and more a symphony of genius and couture. A high five to film noire and lasting homage to neo impressionist grind house fanatalism. When we look upon greatness, we shudder with such effervescent knowing that our intellect is not match for PB2.",
            "review_date": "2021-11-29",
            "lang": "en"
        },
        {
            "review_title": "Even better than the first.",
            "content": "Loved the first movie they definitely topped the first one.laughed from start to finish.",
            "review_date": "2020-05-19",
            "lang": "en"
        },
        {
            "review_title": "You get exactly what you got from the first.",
            "content": "Expect more of the same light, inoffensive antics in Kevin James' second outing as the buffoonish security guard. Paul Blart: Mall Cop 2's supposed to be fun-filled entertainment for the whole family. In respects, it is, depending on what you're looking for. The plot's very straightforward, the acting incredibly goofy. Its intentions are to be as flippant as possible. Blart's a lovable character, just not overly funny. He's as real a character as you're ever going to get. His short-term wife leaves him, his grand-mother befalls an unfortunate accident... life has taken a downward turn. So off to Vegas he goes with his daughter (Rodriguez). Duty calls when a heist takes place at the casino they're staying at. To some this will be comedy gold, to others a complete waste of time. Mall Cop 2, just like the first, relies too much on Kevin James' clumsiness. It's not as funny the 17th time round.",
            "review_date": "2015-07-28",
            "lang": "en"
        },
        {
            "review_title": "Spent $10 to see a fat guy fall into things. Bravo.",
            "content": "The Paul Blart movies are in no means a comedic gem. With that being said, I'm gonna make this as short as possible. In less than 5 minutes into the movie I realized that I should have watched the film 'Home' instead. This is the most perfect example for the term 'cash grab'. Everything about it was just so cringe-worthyNot only was the movie stupid and included very little humor, but the movie also lacked any kind of motivation to make it a decent film. The film was just making fun of Kevin James' weight. To top it off, we had to watch a D-list actress in Raini Rodriguez. Her acting was terrible and the script for everyone was so bad. Her relationship with the worker seemed force and unrealistic making it hard to watch.As I'm in a rush, that's all I have to say. Both Mall Cop's were badly written and I do not recommend the movie by any means necessary.",
            "review_date": "2015-04-20",
            "lang": "en"
        },
        {
            "review_title": "Better than Police Academy 4",
            "content": "You know how some sequels are considered better than the original? Terminator 2, Aliens, Road Warrior, and, of course, Police Academy 4: Citizens on Patrol.Well, in my book (Blartmania, coming early 2021 from Viking Press) you can add Paul Blart 2 to that list. PB2(as the fans, aka, Blartheads, call it) takes all the elements from PB1 and amps them up 11. (That's a reference to a movie that's not nearly as funny as either PB 1 or PB2, btw)PB2 has it all: a David Lynch-inspired scene featuring a piano player and a peacock, an old lady getting punched in the stomach, the Fabulous Thunderbirds \"Wrap It Up\", and an avant-garde stage show that makes \"Goddess\" from \"Showgirls\" look like \"A Private Dance\", also from \"Showgirls\".Throw in vibrating forks, a KISS tribute band composed of little people (yeah, a KISS tribute band made up of little people. Bet you wish you had though of that, don't you, Mr. Failed Comedy Writer?) and Adam Sandler's wife and what do you have?Only the best sequel ever made.",
            "review_date": "2020-11-15",
            "lang": "en"
        },
        {
            "review_title": "The worst film I have seen in 40 years of life",
            "content": "Only one other film we have watched came close to being this bad.. Angel dog... shudder!This was order of magnitudes worse. Every minute is unfunny, painful and embarrassing. I felt bad for the actors having to play this out.There is 1 laugh.. it's at the very end as the credits roll up but we are talking mildly amusing facebook clip type funny..I can't understand how a bunch of adults agreed to spend money promoting this.. I would have written it off and hoped no one ever found it.The plot is obvious the sort of thing you would expect in a bad episode of some Disney 20 minute kids show. Every character jars and makes you cringe. The humour is base level at every point and most evolved around poking fun at fat people. The whole case is 50% fat people and 50% skinny people and nothing in between.",
            "review_date": "2016-02-11",
            "lang": "en"
        },
        {
            "review_title": "The cinematic equivalent of 9/11.",
            "content": "Please. Drinking a bathtub full of bleach is quicker. The actors in this movie couldn't act, if they were at gunpoint. I cried for 30 minutes in my car afterward. Honestly the biggest piece of garbage that was ever allowed into theatres. I have seen Troll 2, Rubber and Birdemic: Shock And Terror. I love those movies. Those movies were funny-bad. This movie is not funny-bad. This movie makes me sick. More plot holes than the ozone. Jokes in this movie are shoved down your esophagus and they don't take. Kevin James should retire and maybe go into hiding after daring to make a sequel to the \"shining gem\" that was the original Mall Cop. Please. Don't. Watch. Maybe with Samuel Jackson or Mathew McConaughey it could've been good. You might as well have casted Adam Sandler as Paul Blart. Rip in pieces brain cells.",
            "review_date": "2015-05-21",
            "lang": "en"
        },
        {
            "review_title": "What is this?",
            "content": "Where oh where do I begin with this piece of trite? Let's start with the romantic subplot. This subplot is as forced and shoehorned in as a TV episode trying to teach a moral, but the moral is just there for the last 2 minutes of the episode. Paul Blart's \"love interest\" this time is a woman named Divina and she already has a boyfriend, so they portray her as emotionally conflicted? WHAT?! That brings us to the characters. Oh boy, the characters. Let's talk about the character of Paul Blart. In the first movie, I enjoyed him as a sympathetic character who ended up in the right place at the wrong time, and he had to singlehandedly save his mall, and he got the girl, but in this one, he is just stupid, clumsy, lame, and a bit of a jerk to his daughter. He's also a little self-centered. His daughter is the sympathetic character here, as her father is just way too overprotective of her.Now, on to the villains. The character of Vincent is actually one of the only two characters in the movie I actually enjoyed watching in this piece of crap movie. I like his plan about stealing artwork from the hotel he and his goons are staying at and replacing them with priceless fakes. For a comedy, I didn't laugh out loud for any scene except maybe one or two. The only one I truly laughed out loud to is the scene where Paul Blart is on the Segway and he gets hit by the car and then he says, \"Heh, still got it.\" For a comedy movie, that is just a terrible sin to commit to being so unfunny and lame. Oh, one of the most UN-funny scenes to me was a scene in which Paul Blart fights/wrestles with an exotic bird as this pianist keeps playing throughout the whole \"fight.\"OMG, the way Paul Blart actually defeats the villains was incredibly lame. He gets all these quote unquote \"nonlethal security weapons\" such as a beanbag cannon, and a gun that shoots knockout gas, idk, at this \"security cop convention\", yeah, like those exist\u0085 Although to be fair, I did enjoy the design of the segway Paul Blart gets near the end of the movie, but it's only on screen for like, 5 minutes so it's nothing but a wasted device. Such a shame.All in all, I absolutely HATED this movie with a passion. I can't believe I listened to the trailers in believing this movie was good! I do not recommend this movie to ANYONE. This movie, unlike the first one, is not to m=be taken as a guilty pleasure movie, and this movie isn't a \"so bad it's good, it's so bad it's bad\" And also, who was asking for this movie? Again, DO NOT see this movie.",
            "review_date": "2015-10-13",
            "lang": "en"
        },
        {
            "review_title": "Not a single new joke or punchline.",
            "content": "After watching this movie, the first thing that came to my mind is «old». Every joke and every punchline has been used before a million time. And you will see them coming a long time before they are delivered. The acting was very bad, except by a couple of the actors. The story is even worse. After about half the movie you will know everything that will happen the in rest of the movie. And I am nice when I say that you need to watch half of the movie to know the rest of it.I really like Kevin James as an actor, but in this movie it seems like he is not even trying to be funny. I got the feeling that he know this is not funny, but that it is easy money in creating a sequel.",
            "review_date": "2015-08-23",
            "lang": "en"
        },
        {
            "review_title": "Super security II.",
            "content": "Paul Blart is attending a security converence in Las Vegas. Deja vu again, this time a group of criminals try to rob the Las Vegas hotel he's staying in for some priceless art.",
            "review_date": "2022-01-13",
            "lang": "en"
        },
        {
            "review_title": "Yeesh.",
            "content": "Like the first movie it got better in the second half of the movie.Except this one was way harder to watch.The funniest scenes are the most unessacary. Like the bird fight oneThis movie was very boring at times but it was also sorta funny at times too.This movie makes me appreciate the simplicity of the first movieThis movie was trying to be home alone two but ended up being home alone three\nThese movies really do feel like home alone with a overweight copAlso we get like no mall cop stuff until like an hour into the movie.The soundtrack wasn't good because I don't remember a single song they had in the movie. If any.They basicly ditched the entire cast of the first movie except for 2 charactersAnd the story isn't creative at all. They just go to Vegas for some speech and Paul's daughter gets aceepted to college.Speaking of the college storyline i didn't really like it. Plus I feel like this movie would be exactly the same if they didn't add that plotline inThere's a lot more nit pics I have, but I don't want this video to be too long so we won't get into too muchLet's just say this movie was a pretty big downgrade from the first movieBut I will rate this movie a not so solid 5/10 really the only positive I had with this movie was it was pretty funny if not funnier than the first to me.Overall it was just a very bland and boring sequel I do not recommend this movie at all. I hope there not making a mall cop 3 because they should have made a MALL COP 2.",
            "review_date": "2022-09-27",
            "lang": "en"
        },
        {
            "review_title": "Somewhat OK.",
            "content": "OK, I liked of the first Paul Blart movie. It was a cute story with a humour that was family-friendly, somewhat cheesy but nonetheless, harmless fun. Maybe thats why I had higher expectations for this sequel. But when you use jokes from the previous movie, you're left feeling robbed. Did they seriously think we weren't going to notice? Literally the only thing that changed was the setting, which instead of a mall its a hotel/casino.With that said, it does not totally blow. Some funny bits here and there, cheesy jokes, and action scenes. Conclusion: Don't expect to be moved by this film, expect to chuckle once in a while, and spend 94 minutes watching an typical plot unfold.",
            "review_date": "2015-07-26",
            "lang": "en"
        },
        {
            "review_title": "RUINED the first movie!",
            "content": "WARNING! This review contains spoilers!Never before has a movie managed to infuriate me that much only one minute into watching it. The beginning of the film literally ruined the ending of the first film, which I actually didn't think was that bad.SPOILER ALERT! If you're a big fan of the first film, you will NOT like what you are about to read. So if you enjoyed the first film, just pretend that the second film never happened and stop reading. Otherwise, continue reading.The girl that Paul Blart ended up with at the end of the first movie? She ended up divorcing him after a week. Yup! The girl that he worked so hard to win over in the first film, one of the feel-good moments of the first film, is now entirely pointless! But Blart's misery doesn't end there. His mother is also hit and killed by a milk truck.So Paul Blart ends up divorced from the girl he won over after only one week, AND he lost his mother. And keep in mind that this was only about a minute or so into the movie! The moment the milk truck hit his mother, I wanted to get up form my seat and leave the theater. I was that frustrated. But I told myself to stick out the entire movie to the end.And I regret it...it was almost completely unfunny and predictable. You could easily tell who the main villain of the film was the moment you saw him. You could tell that he was going to use the safety weapons at the conference the moment you saw him checking it out. And you knew that his daughter was going to end up caught by the main villain. Plus the guy his daughter was spending time with ended up being an incompetent waste of a character.I also felt that the ending was anticlimactic. Oh, and the Hispanic woman that comes up every now and then that slowly falls for him over time? That plot was also complete waste of time because she didn't end up with him in the end. Instead, he ends up alone after sending his daughter to college at the end of the movie. He hits on a female police officer and gets kicked by her horse to end the film.So to summarize all of that up in a nutshell, Blart ended up miserable, and the film was a predictable and, in my opinion, completely pointless. This movie should NEVER have existed, and I would never recommend it to anyone.",
            "review_date": "2015-08-28",
            "lang": "en"
        },
        {
            "review_title": "Meh",
            "content": "I really liked the first Paul Blart movie but this one is just not up to par. I am a huge Kevin James fan but he goes too far with the character in this one and he is a bit of an idiot, although he does calm down and becomes more bearable as it goes on. It's still a relatively good movie to watch and Paul's daughter makes the movie! The story itself is pretty good and fits well with the whole Paul Blart theme. Some good acting from Raini Rodriguez and Neal McDonough throughout making the movie a lot more enjoyable. A couple of really touching moments in the movie and Kevin James does a good job at making it heartfelt. All in all it's worth a watch but it's not one of my favourites.",
            "review_date": "2015-09-14",
            "lang": "en"
        },
        {
            "review_title": "I liked the part where his mother got ran over",
            "content": "I liked the part where his mother got ran over. Anything that was negative and happened to Paul Blart was funny. Him getting divorced, nearly drowning, etc. He was also funny as he was terrible at doing anything. Paul Blart: Mall Cop 2 may be the best sequel to ever come out in the history of man. Fin.",
            "review_date": "2022-04-27",
            "lang": "en"
        },
        {
            "review_title": "Funny and Great Sequel",
            "content": "This movie was a great sequel in so many ways, I love the way that they updated us on the characters and they showed how there personalities changed and developed from the first movie. The writers really perfected Paul Blart's personality in this movie it showed how he was a little bit dumb most of the time but he was confident and I appreciated Kevin James acting choice. As great as the movie was the directors really needed to change a couple of things. I have nothing against overweight people and especially kids and I do know that some guys(or girls) are into overweight spouses but I find that it is an extremely risky and stupid choice for making Lane(a good looking male) falling in love with Maya(an overweight extremely childish looking girl). In my opinion the action/comedy portion of the film started to late and it was a big change from the first movie which in my opinion was a way better film started almost near the beginning. Otherwise, for a family movie I was extremely impressed on how they made me laugh(almost at tears) without any inappropriate language. I would've rated the movie a 10 out of 10 if they improved on the actor choice and where the action/comedy started.",
            "review_date": "2015-07-09",
            "lang": "en"
        },
        {
            "review_title": "Hardcore Happy Madison fan but this was just sad.",
            "content": "I'm in a minority that actually enjoys most of, if not all of the movies Adam Sandler and his friends make. I even like Jack & Jill. But this? Insultingly bad for everyone involved. The first movie was really nice and funny and this just completely shat on Blarts whole character in a really just unnecessarily cruel way if that makes sense. The jokes fall flat and the plot is just really bad. The original was charming in a lot of ways and has lots of redeeming qualities even if you don't like their movies but this was just a sad movie to watch.",
            "review_date": "2021-09-16",
            "lang": "en"
        }
    ]
}