{
  "title": "Akira",
  "rating": 8.6,
  "release_date": "1989-12-25",
  "summary": "Based on Katsuhiro Otomo's 2,000 page manga, Akira begins on July 16, 1988, when what was believed to be an atomic bomb was dropped on Tokyo, completely destroying the city and marking the beginning of WWIII.",
  "critic_reviews": [
    "Adapted by Katsuhiro Otomo from his sprawling, post-apocalyptic cyberpunk tale of government conspiracies, street gangs, and psychic powers that can save or destroy the world, it's still an all-time classic, and has never looked better.",
    "Conceived on an unprecedented scale in ambition and technique, Otomo’s rich visuals and awe-inspiring action depict a post-apocalyptic dystopia where the threat of feral biker gangs is dwarfed by the rise of an uncontrollable psychic.",
    "A landmark production that can be watched with equal satisfaction as a metaphorical psychodrama or as a sheer visual spectacular.",
    "It’s a towering achievement of imagination and the detail of each frame is a miracle of film artistry.",
    "A remarkable technical achievement in every respect, from the imaginative and detailed design of tomorrow to the booming Dolby effects on the soundtrack, pic’s only drawback is the slight stiffness in the drawing of human movement.",
    "As befits a distillation of 1,318 pages of the story so far, Akira the film is teeming with incident and detail.",
    "Akira is substance, and should be considered of the same weight as the works of creators like Disney, Spielberg, and Kurosawa.",
    "Akira’s strangeness is very startling and sometimes bewildering. But there is a thanatonic rapture to its vision of a whole world ending and being reborn as something else.",
    "One of the few unanimously acclaimed classics of Japanese animation.",
    "Violent as it is on the surface, Akira is tranquil at its core. The story's sanest characters plead for the wise use of mankind's frightening new powers, lending the whole film the feeling of a cautionary tale.",
    "The most expensive animated feature ever made in Japan (over 1 billion yen) and it's easily the most impressive, as well.",
    "Some kind of fever-dream masterpiece, easily the most breathtaking and kinetic anime ever made and one of the most eloquent films about atomic afterclap.",
    "The powerful movement of the movie is exhilarating, but it's all action with little characterization or plot. There is a moral here about mankind's lust for power, but it never clearly emerges from the spectacle of destruction and violence. Ultimately, AKIRA is really all about the animation.",
    "Grade-school violence freaks may find a few kicks here, but even they may have trouble coping with this ugly movie’s ending about eight separate times."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This ia very awesome movie. It is my second favorite anime movie; right behind Appleseed 2004.",
      "review_date": "2005-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Though it may not have the saame scope as the manga, the film AKIRA is still head and shoulders above any other animated film ever. Using some 160,000 animation cels, AKIRA is brought to life by highly detailed, fluid animation. This backed Though it may not have the saame scope as the manga, the film AKIRA is still head and shoulders above any other animated film ever. Using some 160,000 animation cels, AKIRA is brought to life by highly detailed, fluid animation. This backed by a phenomenal plotline with nearly a dozen themes ranging from juvenile deliquence to the birth of the universe, AKIRA is not a film you will soon forget. Many aspects of the film, such as the outraged youth, which may be commonplace in modern film, were prototyped in AKIRA. No AKIRA, no Matrix, it's that important. AKIRA is one of the few animes that will appeal to non-anime fans, even anime haters because of it's exceptional quality. Even despite it's age, it still is one of the best looking animated films ever, and the story is easier to understand thanks to the new 2001 dub. Regardless of your personal taste, AKIRA is a film nobody should miss, it's that good.",
      "review_date": "2006-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When one learns about English Lit, you read Shakespeare. To learn about physics, you learn about Newton. It's not that they were the first do do something, it was they way that they did what they did that made it important. Akira is When one learns about English Lit, you read Shakespeare. To learn about physics, you learn about Newton. It's not that they were the first do do something, it was they way that they did what they did that made it important. Akira is that sort of touchstone for Japanese animation. ",
      "review_date": "2003-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Akira is possibly the greatest animated movie of all time. It's a spectacular science fiction epic of inscrutable proportions. There are a lot of metaphors floating around in Akira and part of the fun is fathoming out the deeper meanings ofAkira is possibly the greatest animated movie of all time. It's a spectacular science fiction epic of inscrutable proportions. There are a lot of metaphors floating around in Akira and part of the fun is fathoming out the deeper meanings of everything. Or you could just sit back and enjoy the breathtaking animation or the intensely cool action scenes. Either way, Akira is a must see.",
      "review_date": "2013-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you do not like anime I promise you will like it after watching this movie. Most epic anime movie out there so far and I hope the rumors of making it a live action film are true.\r~The Main Critic",
      "review_date": "2012-11-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It may not be your average violent movie, but Akira is the epidemy of Japanese animation. Not only it was the first anime to receive an R-rated version, but it shows how good an anime needs a lot of gore, a lot of bloodshed, and a lot of sexIt may not be your average violent movie, but Akira is the epidemy of Japanese animation. Not only it was the first anime to receive an R-rated version, but it shows how good an anime needs a lot of gore, a lot of bloodshed, and a lot of sex (or hentai/fanservice for that matter). I remembered watching Akira on the Sci-Fi Channel when they showed anime movies just the same as Cartoon Network did. But after almost 25 years, I could still think of movies that inspired the movie. From The Matrix to Johnny Mnemonic, and video games like Final Fantasy VII and Metal Slug, it shows no matter what it takes place in a virtual world of drugs, war crimes, and corruption, every time when there's an action scene, you can even pause and use slow motion on the explosions and mayhem. I think Adult Swim could be thinking on airing the movie on Toonami because when I heard the news that the block is coming to Adult Swim's Saturday (Sunday) anime block, fans and tweets are asking the same thing \"when is Toonami coming back on TV?\" It was no April Fool's joke and so they did. I hope Adult Swim could air this movie as soon as possible, TV-MA style! But bar none, Akira is a classic example of why we still and always love anime. Akira is one of the best anime movies before Ghost in the Shell and Ranma 1/2.",
      "review_date": "2012-05-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Every detail is brilliant; the music, the art, the story, everything is beautiful. As with all anime, the English dub is appalling, but watched in the original Japanese, this epic sci-fi saga should indeed be regarded as one of the best filmsEvery detail is brilliant; the music, the art, the story, everything is beautiful. As with all anime, the English dub is appalling, but watched in the original Japanese, this epic sci-fi saga should indeed be regarded as one of the best films of all time.",
      "review_date": "2012-04-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As good as or better than Miyazaki's films. The animation is great, but not as good as other anime films( partly because its somewhat old). Amazing story with one of the best endings to a film I've seen. Watch it.",
      "review_date": "2013-02-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Katsuhiro Otomo co-wrote the screenplay of Akira and directed this 1988 adaptation of his much-loved 1980s-era manga (comic book); it was a huge production that paid off enormously. When it arrived in America, it became a cult classic andKatsuhiro Otomo co-wrote the screenplay of Akira and directed this 1988 adaptation of his much-loved 1980s-era manga (comic book); it was a huge production that paid off enormously. When it arrived in America, it became a cult classic and introduced Western audiences to anime (Japanese animation), a genre that remains popular to this day. Akira is extraordinarily dense and enormously complicated, and things like story and characters tend to go out the window in favor of cosmic ideas and mysteries, bizarre imagery, and astounding levels of violence. It takes full advantage of the animated medium with its sheer imagination and intensity. Indeed, to attempt these same images in a live-action setting would have been far too expensive and disturbing. Time has not yet dulled the sheer impact of the work, though, and the level of detail, movement, and fluidity is still highly impressive. It's still essential viewing for anyone interested in the genre.",
      "review_date": "2013-12-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Don't judge my review just because I may like anime; I'm not too fond of the idea there are some good ones out there, but that asides the point, this movie is awesome. I do love these type of stories, a dystopian like future, and this one ofDon't judge my review just because I may like anime; I'm not too fond of the idea there are some good ones out there, but that asides the point, this movie is awesome. I do love these type of stories, a dystopian like future, and this one of my favorite visions. Usually when a person thinks about the future, they think of a Jetson like future most of the time, but this offers a dark not entirely advanced society. Of course this is a vision of Japan, maybe U.S and other countries may have more advanced technology, though that's highly unlikely. The characters in this story are fitting and unique, most of them at least. Only the main two I have the same are the main focus, and the rest aren't entirely important. With talk about story and characters, I may avoiding the main features that make this film famous, the animation. This is the first; that I can think of, anime movies that try to make the characters mouth match the words that the actors are saying. It does it well, but it also is a downfall because the English dub looks ridiculous because the characters clearly don't look like they are saying what they are saying. That aside the animation is simply great, although the argument is that the animation is somewhat dated, and I can agree with that. That said though, I say that it compliments the story more with its gritty like style. My last bit of praise is the soundtrack, my god this some of the best music I have heard from film, it's my absolute favorite score from any film. It builds up tensions, adds suspense, creates an atmosphere, and just make everything better. With all this praise there are some problems within this picture. There is some/ a lot of content missing from the original manga, and that can be a bit irritating at times knowing how great it was, but not everything could be stuffed into this 2 hour long film. Take note that this film was in motion even though the manga wasn't complete, so maybe the didn't know about the last chapter which happened to have the best parts in it, or maybe some of the best parts that would be great to see in film. Now it's about time to wrap this up, I think this is one of Japan's best films; not the best in fact maybe not even in a top 10, and I think this should be watched by anyone who wants to go into animation or just want to watch a variety of good films.",
      "review_date": "2013-05-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I Hate Anime...\r Being an Art student so many of my friends have lost out certain grades and criteria because of it, Now granted when i was a kid i enjoyed Pokemon and Dragonball Z, but growing up i became aware of it's goofy-ness, it'sI Hate Anime...\r Being an Art student so many of my friends have lost out certain grades and criteria because of it, Now granted when i was a kid i enjoyed Pokemon and Dragonball Z, but growing up i became aware of it's goofy-ness, it's repetitive drawing style and overall unprovocative storylines.\r Now comes Akira, A Manga that apparently matured the way of storytelling the way Alan Moore did with Comics.\r Surprisingly though, many who can sit through this 2 hour adaptation of a 1000 page Manga, can luckily look forward to being treated like adults, as well as surprisingly VERY detailed anime (consisting of more than 160,000 cells of animation!).\r Featuring a Neon Lit Tokyo as stunning as the look of \"Blade Runner\" this film is literally Eye Candy, every explosion looks detailed, every street corner has immense depth, every croweded place just looks decent.\r The Story, though i will not say anything about it features everything you want to see in a Futuristic City, Crazy Vehicles, Militarized areas, Psychic powers. Throw that all in with the absolute most bastard Kid ever and all around you have something that can be proud to be called \"Influential\".\r Final Verdict: It's not for everyone believe me when i say that, but those who can sit through it all may be pleasently surprised.",
      "review_date": "2013-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Outstanding film. The best anime, still, that I have ever seen. Had the good fortune of seeing it on the big screen, back in the day, upon its theatrical release.",
      "review_date": "2014-01-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I had seen Akira a number of times a few years back, and watching it again just two days I can't tell you how enthralled I was watching it. The animation is beautiful and very detailed with a wide range of colours that are extraordinary toI had seen Akira a number of times a few years back, and watching it again just two days I can't tell you how enthralled I was watching it. The animation is beautiful and very detailed with a wide range of colours that are extraordinary to watch, and the score was phenomenal, it stirred many emotions inside of me. Just like the storytelling that was thrilling, shocking and heart-breaking did, likewise with the use of sound, the silence was even more haunting and intense than those scenes with sound, the excellent dialogue, characters that are developed so well(for a character-driven film you'd expect that, the main characters' conflict is especially well done) that you do root for them and a message that I highly appreciate and don't feel it's over-didactic. All in all, amazing, a real landmark for not only anime but also animation in general. 10/10 Bethany Cox",
      "review_date": "2022-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In 1988 there were three Japanese animated films that left a permanent mark on the genre: Grave of the Fireflies, My Neighbor Totoro and Akira, inspired by the homonymous manga. The graphics and the story that applies to the cyberpunk currentIn 1988 there were three Japanese animated films that left a permanent mark on the genre: Grave of the Fireflies, My Neighbor Totoro and Akira, inspired by the homonymous manga. The graphics and the story that applies to the cyberpunk current of science fiction never cease to be impressive, especially because of the hospital sequence. On warning: it is not for children. An ideal complement would be a Black Sabbath OST.",
      "review_date": "2022-04-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I enjoyed the fact that the movie started really violent and never slowed down, it actually increased the violence every chance it had which is something pretty unique as a story telling tool since there are barely any moments of calm justI enjoyed the fact that the movie started really violent and never slowed down, it actually increased the violence every chance it had which is something pretty unique as a story telling tool since there are barely any moments of calm just increasing violence. The animation is superb even by today's standards and some of the action is pretty great but for me personally the story is the weakest thing about this movie and the way it was presented  was very broken and not that well connected. It is fine if you just wanna unwind and watch some animated violence but if you are looking for something deeper and more interesting I would suggest checking somewhere else.",
      "review_date": "2022-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is an animated action sci-fi film. It may be an animated film but its definitely not for younger viewers, due to the violence and strong language present. I liked the sudden flashbacks which took me by surprise and the way they were animated made it quite engrossing for me. There are a variety of characters, mostly rebellious adolescents and I think it'd be fairly difficult to not feel the confusion and anger they feel. Themes present include youth gangs, greed, nuclear science, political corruption and supernatural abilities.The animation is 2D and fairly basic in style, although during some of the more bloody scenes you may be glad of this. It is an example of manga animation, given that its tone is somewhat dark and it is, more obviously, a Japanese animated film.I thought it isn't, to me anyway, as visually pleasing to watch as some other styles of animation - I suppose it looked perhaps a little bland but then again this is very much a gritty film and not a Disney type family watch. I thought it seemed quite gritty and urban, unsurprisingly given the plot. To me it seemed pretty realistic, in terms of the depiction of a slightly run down city, with disaffected youth among it. Plot pace wise, at first I thought it was really quite fast paced but the main storyline did take a while to come to fruition, it could be said. I didn't think it was either overly bland or boring at any particular time though, so it could definitely be worse. There's something spooky and unsettling about the way certain plot developments are shown visually, via the more bland, dated animation style present. Perhaps rather than using the term bland to describe the animation style visually, but instead perhaps bare would be more appropriate. Its no especially bad thing overall I think.The music present is quite spooky in tone and adds to the general feeling of mystery and alienation which is present. There isn't really any obvious chart based music (not with vocals anyway) played during the film, just the ocassional piece of eastern sounding instrumentals and the like.Some aspects of the plot I felt were a bit too far fetched and I struggled to entirely follow all the intricacies, although I mostly enjoyed watching it regardless. Its a relatively easy watch overall.Cast wise, of course its all voice performances, with it being an animated film. Voices are provied by Mitsuo Iwata as Kaneda, Nozomu Sasaki as Tetsuo and Mami Koyama as Kei, plus Takeshi Kusao as Kai. I did like that the voices sounded particularly honest and realistic to me.Content wise, as mentioned earlier the film contains some strong language and violence, including relatively bloody violence (although it is an animated film, it does show various facial and other body injuries in some amount of detail and may seem gory and upsetting/frightening to younger viewers). The film also contains some mild sex references and very brief partial nudity, plus the flashback scenes could also be frightening to younger viewers, that and certainly the climax to the finale of the film, which contains some gross out visuals (think large masses of skin spouting out here, there and everywhere). The film is rated 15 due to this content.I felt this film did relatively well at creating a spooky, gritty and mysterious feel for the most part and it features some good characterisations. It won't appeal to all and it isn't the best ever example of animation I suppose but for what it is, I felt it was a relatively decent film, although it isn't one that I can imagine myself wanting to watch again. I also felt that, at the end, there had been unanswered questions, which frustrated me a bit.To summarise, for me, it was ok - good in some respects, ok in others and not so good in a few but thats about it. I suppose I probably would recommend it, if you were looking for a good, gritty animated film for teenagers. It features relatively decent characterisation, an interesting, if not a bit far fetched and partially (in my humble opinion) barmy plot and a decent use of music/sound. However, it didn't seem to be a particularly memorable film, its a bit dark and depressing and some of the plot aspects seemed a bit far fetched, so for me I'd say its pretty middle of the road, although others may enjoy it more. If this really appeals to you, then its probably worth seeing but if your not sure then it may be better to look elsewhere.",
      "review_date": "2021-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Masterpiece! Should have been at least 20min longer. That's how well built out the setting is.",
      "review_date": "2022-07-08",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 33,
  "genres": [
    "Action",
    "Sci-Fi",
    "Drama",
    "Mystery",
    "Thriller",
    "Fantasy",
    "Animation"
  ]
}