{
    "title": "Do the Right Thing",
    "rating": 8.2,
    "release_date": "1989-06-30",
    "genre": [
        "Drama",
        "Comedy"
    ],
    "summary": "Set on the hottest day of the summer, the film examines various personal, social and economic issues through the eyes of an ensemble of neighborhood characters on a Bedford Stuyvesant block in Brooklyn.",
    "critic_reviews": [
        "One of Lee's great successes with this film is that he is able to present every character, regardless of race, gender, or age, with three-dimensionality and a degree of sympathy. No one is demonized or lionized. No one individual is blamed or exonerated for the events which transpire. Each individual with significant screen time is shown to have good and bad qualities, and we come to understand what motivates them, even if we do not agree with them.",
        "Lee offers no reassurance, no uplift, no call for all races to join hands and spout liberal platitudes. What he does offer is a devastating portrait of black America pushed to the limit, with the outcome still to be written. There’s only one way to do the wrong thing about Do the Right Thing: that would be to ignore it.",
        "Lee deftly follows the actions of two dozen people on what turns out to be one of the longest, hottest, most memorable and maybe most tragic days of their lives. And he does it without so much as a single lugubrious or extraneous moment.",
        "Lee creates a remarkably even-handed and nuanced portrait of the way that violence can flare, and how bigotry can build to something much worse",
        "Effortlessly moving from comedy to serious social comment, eliciting excellent performances from a large and perfectly selected cast, and making superb use of music both to create mood and comment on the action, Lee contrives to see both sides of each conflict without falling prey to simplistic sentimentality.",
        "Sal is not ready for a new political world, whose dawn Lee sketches out here, in which it is not enough simply to refrain from making overtly racist gestures: omission or erasure is equally insulting.",
        "It comes closer to reflecting the current state of race relations in America than any other movie of our time.",
        "There's no doubt about the film's sheer power and taut originality.",
        "With its ingenious camera style, keenly dramatic music score, and brash yet indomitable humor, Do the Right Thing is the richest and most thought-provoking portrait of underclass experience that Hollywood has ever given us.",
        "It is a subtle and humane entertainment with a refreshingly serious view of the world.",
        "A movie made by filmmaker working in sync with his times -- an exciting, disturbing, provocative film.",
        "Any way you  judge it, Thing reaffirms Lee's position as a filmmaker with audacity, courage and ideas.",
        "In the final analysis, the best thing one can say for Lee is that he takes risks, like all true artists. For unlike most of today's film makers, he's not afraid to really challenge a movie audience to do some serious thinking.",
        "Lee has forged a work of art in the classic sense -- art that delights and instructs.",
        "Combines a forceful statement on race relations with solid entertainment values.",
        "This is a powerful and persuasive look at an ethnic community and what makes it tick.",
        "As before, Lee's acute observation distils humour from accuracy rather than caricature but his growth as a filmmaker is impressive.",
        "Lee is nimble-witted, and he’s always on the offensive; he stays in your face until you’re too exhausted to resist. You have to watch your reactions closely or he’ll speed right past you, get you to nod assent to an argument you haven’t fully realized he was making. Most American movies just want to knock you senseless immediately and get it over with; Do the Right Thing tries to wear you down, and its strategies are fascinating."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Loud but empty, caricatures of all races, obnoxious characters specially the main lead. I can't believe this dumb movie gets so much praise. Just watch it for yourself so we can stop calling this good. It's a psyop.",
            "review_date": "2019-08-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This invigorating and thought provoking tale beautifully discusses an issue that has plauged America since its creation, race. Overall, this remains as Spike Lee's best film to date, along with When the Levees Broke, a touching This invigorating and thought provoking tale beautifully discusses an issue that has plauged America since its creation, race. Overall, this remains as Spike Lee's best film to date, along with When the Levees Broke, a touching documentary that bleeds of realism about how the survivors dealt with Hurricane Katrina, and Malcolm X, a fascinating biopic. John Turturro (who would later co-star in another good movie He Got Game) and Danny Aiello were convincingly brilliant in their roles, and Radio Rahim was another good character central to the theme of the movie. Also loved their soundtrack, headlined by Public Enemy, who is one of the best hip-hop groups of all-time. Overall a gripping story that deals with race relations in the heart of the city.",
            "review_date": "2007-03-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Racial relations in films leave much room for sugarcoating and biased views of one or more people on the cast and crew, but thankfully, Spike Lee is too smart to take sides or choose whose battle to support. In Do the Right Thing, he showsRacial relations in films leave much room for sugarcoating and biased views of one or more people on the cast and crew, but thankfully, Spike Lee is too smart to take sides or choose whose battle to support. In Do the Right Thing, he shows how racial relations have hurt one specific street block in Brooklyn. The result soars past any expectations one has going into it.\r The film plays like an anthology, featuring people that resemble real people, and who pack in realistic flaws. It takes place on a brutally hot day in the neighborhood, with the temperature in the late nineties to early hundreds. The film's center is a pizzeria on the street, called Sal's Famous, which is run by an Italian father and his two sons. The father is Sal Frangione (Aiello) who has been on the block for over twenty years, and his sons Pino (Turturro) who refers to coming to work like \"Planet of the Apes,\" and Vito (Edson) who is accepting of the blacks.\r They're the only white people we see throughout the whole film and yet, despite some of their comments, we can sympathize with them in a way. All they want to do is run a business, but odd complications plague their day. The only black character employed at the pizzeria is slacker Mookie (played by Spike Lee himself). Mookie is a gentle and sweet kid, but seems to develop a distracting fondness for anything but his work.\r Other people around down are simple, frequently drunk \"Da Mayor\" (Davis), Mother Sister (Dee), who observes the neighborhood through her window, Radio Raheem (Nunn), who blasts his music at deafening level on his boombox, which annoys many, Buggin' Out (Esposito), a geeky man who wants to see some black people on the wall of Sal's Famous, and Sonny (Park), a Korean grocery store owner across the street from Sal.\r Not a lot of films can perfect the idea of \"all characters, no plot,\" but Do the Right Thing is effortlessly convincing. The film also excels in being extremely original and stylistic in the sense that the heat from the day itself seems to be creeping out on screen. All the characters are soaked in sweat and the cinematography is so bright and loaded with primary colors that it comes off as infectious and unique. Even the air looks to be seamy and murky. Every detail is included, and nothing is overlooked.\r Finally, there's the climax, one of the best, and most involved I have yet to see. It's unexpected, well-choreographed, and never misses a beat. It doesn't seem cartoony, as much as it seems realistic and well done. I wish I could go into greater detail, but it needs to be seen to be believed. Also, one of the characters does an act you wouldn't think that insights one of the major plot points. I think it's safe to say, he didn't do the right thing.\r Do the Right Thing isn't only provocative, but it avoids cliches and doesn't give us the same \"racism is bad\" lecture. It's too original and intelligent for that. Lee has introduced us to likable characters that we continue to adore as the film goes on, and despite the heavy climax, we still at least respect. You're left contemplating what the right thing is/was and how would you go about doing it.\r Starring: Danny Aiello, Ossie Davis, Spike Lee, Giancarlo Esposito, John Turturro, Ruby Dee, Steve Park, Bill Nunn, Richard Edson, Rosie Perez, Martin Lawrence, and Samuel L. Jackson. Directed by: Spike Lee.",
            "review_date": "2013-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Bottom line: With Do the Right Thing, Spike Lee is able to start a conversation about race in America, pointedly and brilliantly.\r In Do the Right Thing, we watch an urban New York neighborhood during a heat-wave. Racial tensions smolderBottom line: With Do the Right Thing, Spike Lee is able to start a conversation about race in America, pointedly and brilliantly.\r In Do the Right Thing, we watch an urban New York neighborhood during a heat-wave. Racial tensions smolder before erupting into violence. It is one of those movies that’s difficult to summarize; there are numerous characters whose plot lines intertwine but the core of the movie looks at the larger issue of racism. We have the Italian American, Sal (Aiello), who has owned the neighborhood pizza shop for twenty-five years. On one wall, he has a “Wall of Fame” which features photos of Italian-Americans. He refuses to put up any African or African-American photos. His son is a racist. We have the patron, a militant black power character, who vows to boycott Sal’s until there are Africans represented on the wall. Meanwhile, we have the brutal, white police officers. We have the Chinese owners of a local grocery store. We have the Hispanic community. We have Radio Raheem (Nunn) who blares Public Enemy on his boombox.\r Spike Lee is able to present the complexity of this issue, and this film-world, with coherence and harmony. This is what makes Do the Right Thing so good. The important part about this movie is that there is no one completely at fault. It may not sound like much, I mean, we have antiheroes all the time, right? Here though, the purpose is to spark a dialog about race in America. The movie closes with two quotes. The first is a warning from Martin Luther King Jr. about the dangers of violence. I thought, “Alright, I get it. All of the destruction in the movie could’ve been avoided by choosing peace.” Then comes a statement by Malcom X saying that while he doesn’t condone violence, violence might be necessary in self-defense and he does condone self-defense. Even in conclusion this movie presents more than one perspective.\r In Do the Right Thing, the message is as ambiguous as the film’s title. What is the “right thing?” Of course, we all want to do that but how do we know what it is? Even if we do know the right thing, it’s a lot easier said than done.\r Aside from a story perspective, Spike Lee fully uses the medium of film. It is a very hot summer day so he shows three old men sitting in lawn chairs partially covered by an umbrella. They sit in front of a fire-engine red brick wall. The color in and of itself makes the audience feel the warmth of that summer day. It reminded me of a Rothko painting.\rIn other situations, Lee uses a wide-angle lens pushed close up to the actors who speak directly into the camera. It is an uncomfortable angle to watch and listen to someone scream at you. That’s the point. Our proximity to the characters removes any chance we have of escaping the situation. It’s as if the film is telling us that we have to address these issues.\r I just finished listening to an audio version of Steven Pressfield’s The War of Art. It is about tackling the resistance that is preventing you from doing what you truly dream. At one point, he explains that in writing this book, his own demons of resistance fought him. He said to himself, “I am a fiction writer. Shouldn’t I, instead of writing a nonfiction book like this, cloak the same message in metaphor? I could write a story about a soldier’s trials and tribulations as he undertakes a mission.” Do the Right Thing is like The War of Art in the sense that it is not a message hidden in a film, it a direct message in and of itself. Spike Lee uses jump cuts help develop this idea.\r A jump cut is where the camera moves slightly between two shots. It moves in such a way that you can tell there was a cut. I have a bunch of jump cuts in my review videos, if you want to see an example. Up until around the 1960’s, cut jumps were considered more a mistake than anything. They are jarring and make you aware of the camera so it breaks some level of immersion. So, by using a couple jump cuts, Lee is able to address the audience and the audience’s interaction with the film. That is, we aren’t going to get too caught up in the plot that we lose sight of the fact that this is a movie with a message. Do the Right Thing is a cinematic representation of a speech or an editorial; it not only tells you but it shows you.\r I’ve mentioned this before, I’m sure, but I’ll say it again. A good movie might tell you, a bad movie will probably tell you again, but a great movie will show you. Do the Right Thing is a great movie that I highly recommend. I’m only sorry it’s taken me so long to see it.",
            "review_date": "2015-08-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Horrible movie. Sure, it raises a good point about how race relations turns into tragedy, but at the end, it just makes you hate everyone in the movie and wish for it to end. Ultimately, the only tragedy is how bad the movie wound up being.Horrible movie. Sure, it raises a good point about how race relations turns into tragedy, but at the end, it just makes you hate everyone in the movie and wish for it to end. Ultimately, the only tragedy is how bad the movie wound up being. In addition, even before the \"tragic\" ending, it was beyond boring and I almost shut it off, but wanted to see how it would end. Boy was I disappointed.",
            "review_date": "2013-12-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was forced to watch this movie for a school assignment. I was excited to see it because of the reviews that it had. To say the least I was totally disappointed. I thought it was poorly written and directed. Worse yet the theme of the movie I was forced to watch this movie for a school assignment. I was excited to see it because of the reviews that it had. To say the least I was totally disappointed. I thought it was poorly written and directed. Worse yet the theme of the movie only encourages the rift between races.",
            "review_date": "2007-09-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Cinematogrpahy =good Acting= good/ok Story= ok/not very interesting technical= ok symbolism= overwhelming/confussin location= meh any other aspect i forgot= meh didn't catch my eye = in total i am a 16 year old girl and i would say i am Cinematogrpahy =good Acting= good/ok Story= ok/not very interesting technical= ok symbolism= overwhelming/confussin location= meh any other aspect i forgot= meh didn't catch my eye = in total i am a 16 year old girl and i would say i am a beginer \"big film buff\" and after a while it just lost me.....i got bored...kept wondering what time it was.....their is so many aspects he could have done to made it appealing to all audiences not saying i want big car explosions and multi-million dollar actors acting.....it's just i wasn't born in the time of Martin Luther King jr's activitism why not make so that future audiences can go \"wow he is so right let's go do somehting about it\" although it's not as much a problem as it used to be....but you know what i mean!!! i say we give spike a round of appaulse for trying!!!",
            "review_date": "2006-02-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best.",
            "review_date": "2005-09-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In Do the Right Thing, Spike Lee has painted an astonishingly honest and human depiction of racial prejudice and ignorance. Lee presents us with a multitude of complex characters from a wide spectrum of racial and cultural backgrounds andIn Do the Right Thing, Spike Lee has painted an astonishingly honest and human depiction of racial prejudice and ignorance. Lee presents us with a multitude of complex characters from a wide spectrum of racial and cultural backgrounds and portrays their involvement and experiences with race issues on an very personal level.\rThe ending in particular was extremely though provoking - we're given no answers to the issues dealt with in the film, and this is in no way a mistake on the director's part, but a deliberate calculation that heightens the effectiveness of the film. The cast is brilliant, especially John Turturro,  Giancalro Esposito and Lee himself. Do The Right Thing is a timeless masterpiece with timeless messages and a provocative insight into race relations.",
            "review_date": "2012-07-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie!!! But, wtf is up with the Sal part? So he blames him for radio? This  was terrible in the end. Still good movie, I give it a 7. This was a great movie but it seems like African America must get even in order for things to beGreat movie!!! But, wtf is up with the Sal part? So he blames him for radio? This  was terrible in the end. Still good movie, I give it a 7. This was a great movie but it seems like African America must get even in order for things to be right. Well, this was in the past so I might no understand but I'm glad things have changed.",
            "review_date": "2014-01-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When i watched this movie i saw what a stylistic achievement it is. Spike Lee was 32 when he made it, assured, confident, in the full joy of his power. He takes this story, which sounds like grim social realism, and tells it with music,When i watched this movie i saw what a stylistic achievement it is. Spike Lee was 32 when he made it, assured, confident, in the full joy of his power. He takes this story, which sounds like grim social realism, and tells it with music, humor, color and exuberant invention. A lot of it is just plain fun.\r Do The Right Thing is an extremely powerful, important and also fun movie that needs to be seen.",
            "review_date": "2016-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What a hectic film!I knew that Spike Lee has one of the most unique and idiosyncratic styles of directing ever from what I've read and seen about him. I got a glimpse of this when I saw BlacKkKlansman; but it left a lot to be desired, and IWhat a hectic film!I knew that Spike Lee has one of the most unique and idiosyncratic styles of directing ever from what I've read and seen about him. I got a glimpse of this when I saw BlacKkKlansman; but it left a lot to be desired, and I was thirsty for more. Having just seen his masterwork, I can say that I'm completely enraged, and that's completely fulfilling and satisfying, to be honest!(8.5/10)",
            "review_date": "2019-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is a fantastic look at what race relations are like in areas where there is diversity and heavy interaction. It's real and it's right on the mark.",
            "review_date": "2007-03-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I loved this film and felt that it was right up there with Malcolm X and the 25th Hour as one of his best films to date, if not the best.",
            "review_date": "2007-03-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Several missteps aside, Spike Lee has been one of our most challenging filmmakers since his debut feature, She's Gotta Have It. After that and the hit-and-miss School Daze, he stunned even his most adamant naysayers with Do the Right Several missteps aside, Spike Lee has been one of our most challenging filmmakers since his debut feature, She's Gotta Have It. After that and the hit-and-miss School Daze, he stunned even his most adamant naysayers with Do the Right Thing. This remarkable, staggering achievement has not yet received even half the respect and recognition that it deserves. Despite viewers' polarized reactions to the film's controversial climax, one would be remiss to dismiss this picture as anything but brilliant. Revolutionary in its scope, yet delightfully small in scale, DTRT takes audiences through one day in the life of the Bedford-Stuyvesant neighborhood. Using this intersection as a microcosm for racial relations in modern America, Lee expertly addresses the multitude of idiosyncrasies and contradictions that both strengthen and weaken our national culture simultaneously. Don't let the profanity and blaring rap music scare you. This is a must-see picture, and a damn funny comedy to boot. An American Classic!",
            "review_date": "2005-12-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was great and it talks a lot about racial profiling.",
            "review_date": "2006-10-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of Spike Lees's excellent movies. The cast is outstanding and the story line is great. This film is a favorite of mines.",
            "review_date": "2006-05-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is great movie simply because everything is so grey. It will have you considering who is right or wrong for days after you see it for the first time. It really forces you to examine a difficult situation and decide for yourself who you This is great movie simply because everything is so grey. It will have you considering who is right or wrong for days after you see it for the first time. It really forces you to examine a difficult situation and decide for yourself who you think made the right decisions.",
            "review_date": "2006-08-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the most brilliantly made movies of our time. Balances the fine line between entertainment and art masterfully. THE definitive movie about race relations. This movie must be watched by all, as it is still relevant in the world today. One of the most brilliantly made movies of our time. Balances the fine line between entertainment and art masterfully. THE definitive movie about race relations. This movie must be watched by all, as it is still relevant in the world today. And to viewers like Kaity M., go watch any of the crap Hollywood spews out on a regular basis. Im guessing this movie went straight over your head. It's not supposed to be an inspirational movie that makes you want to do something about racial activism. It's supposed to be about portraying race relations between those that wish to not understand each other, and act on stereotypical views that one holds in deep within themselves.",
            "review_date": "2007-03-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A masterpiece depicting the ambiguities of social and racial inequality, but filmed beautifully and realistically. Its message resonates very strongly even 20 years after the film's release - a testament to how incisive the issues expertlyA masterpiece depicting the ambiguities of social and racial inequality, but filmed beautifully and realistically. Its message resonates very strongly even 20 years after the film's release - a testament to how incisive the issues expertly relayed by Lee remain. Do The Right Thing is a fundamentally abrasive film, and thus it would be unreasonable to expect that everyone who watches it appreciates the purpose, but overall that is a key reason why it is so good. A true classic.",
            "review_date": "2010-11-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I didn't understand the first hour and a half of Do The Right Thing, but things get serious and cleared up in a heartbeat. This controversial film is about no matter how well we know each other, there is still racial tension living rightI didn't understand the first hour and a half of Do The Right Thing, but things get serious and cleared up in a heartbeat. This controversial film is about no matter how well we know each other, there is still racial tension living right under the surface. All it takes is some pointless argument about a picture on the wall or a radio being played too loudly, for racism to rear it's ugly head on both sides. Then what happens? People are dead, businesses are ruined, and communities are rioting. Over what? The argument is but a mere spark, racism is the issue. Had the argument been between two black men, instead of a white man and a black man, things would have turned out much differently. That's the point of this film, very wisely and overlooked, Spike Lee is saying who cares what color the person is, step up and do the right thing in every situation. It's a message we should all take to heart.",
            "review_date": "2013-02-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the most poignant and pivotal American films I've ever seen.",
            "review_date": "2012-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Do The Right Thing\" is a refreshingly objective look at ignorance and intolerance on all sides of multi-cultural America, featuring great directorial work from Spike Lee and devoted performances from the likes of Danny Aiello, John Turturro,\"Do The Right Thing\" is a refreshingly objective look at ignorance and intolerance on all sides of multi-cultural America, featuring great directorial work from Spike Lee and devoted performances from the likes of Danny Aiello, John Turturro, Giancarlo Esposito, Bill Nunn, and even Lee himself.",
            "review_date": "2015-10-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This documentary shows dindu nuffins in their natural habitat. It also proposes that fighting is bad like you'd say to a group of 5 years old, but I guess dindus do count as 5 years old chimps",
            "review_date": "2015-08-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I always have had an issue with movies having stereotypes in them; Transformers 2 and anything with \"movie\" in it, and for some strange reason that made me want to watch this. It's kind of random, but I don't regret it. Do the right thing isI always have had an issue with movies having stereotypes in them; Transformers 2 and anything with \"movie\" in it, and for some strange reason that made me want to watch this. It's kind of random, but I don't regret it. Do the right thing is by far one of the greatest examples of racial tension ever; also I can't think of any other films that deal with it as well, and is also enjoyable to watch. I mean usually you have stories about racism and it's always preachy, but here it has an interesting story with interesting people. Of course like any good argument it addresses all points, like: the point of view from the victim, from the bigot, from other people of different races, and from everyday people. It shows that there's a limbo between the battle of good and evil. Speaking of that, radio guy; sorry I don't know his full name, is my favorite character. The fact that he has the reminiscence of Harry Powell from night of the hunter, but in a modern and positive look on it. Overall this is a great movie, and honestly there's nothing wrong with it; that I can see that is, so Definitely check it out when able to.",
            "review_date": "2013-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wake up! Wake up! Up you wake!\"I had this on my watch-list for quite a while now since I joined this site, because when it comes to movies labelled as classic are often the hardest for me to truly tackle, but with everything that's beenWake up! Wake up! Up you wake!\"I had this on my watch-list for quite a while now since I joined this site, because when it comes to movies labelled as classic are often the hardest for me to truly tackle, but with everything that's been going on recently, I thought the time is right to watch Spike Lee's masterpiece. I know logging this in isn't anything new with everyone else doing the same, but you also have to keep in mind the reasons why a movie that explores the struggles of American racism, police brutality, and racial stereotyping still hits close to our lives, especially 30 years after its release.The hottest day of the year in the neighborhood of Brooklyn - where heat, frustration, and tension quickly rises up to the surface in extreme temperatures, where the intensity is felt. A clash of cultures with African American, Latino, East Asian and Italian American that drives the story forward.I am honestly blown away by this movie.What I loved about 'Do the Right Thing' is how all the characters in the movie are not the most moral people and would commit questionable acts, which have sparked debates from audiences over the years. However, it is less about understanding them or finding redeemable qualities, but more to do with recognising their anger. The movie does not ask you to pick a side, but just to observer how both sides can be wrong sometimes. We are shown how everyone is talking negatively about the other race, so you should not always take it too seriously, and that you’re not always the victim. The only voice of reason in the whole movie is the character Da Mayor, played beautifully by the late Ossie Davis. He does what the title of the movie is saying, and yet no one takes any notices of him. The movie displays different viewpoints from variety of voices.There’s a great scene where one person of each race group talks **** about the other race in a racist statement. Spike Lee intentional filmed the scene to identify how racism in different forms of colour are all equal. Lee shot every racial statement in the scene identical from the other ones. The message becomes loud and clear, which is that if you’re a racist, you’re a racist, no matter what colour skin you are.Still, racial themes aside, there is still some humorous scenes that made me chuckle. The conversations between characters were both funny and yet intriguing to listen, which was apparently improvised by some of the actors. I said this once and I will say it again, I like it when the director lets actors work freely on set.The performances from everyone were all excellent and all the characters are defined through the actor’s portrayal, which makes every single one of them memorable.Danny Aiello is brilliant as the sweaty and tough Sal, who works hard at his business at the Pizzeria. Sal is respectful to everyone if you do not push his buttons. Even Spike Lee who is not only the director, writer, and producer of the movie, but also stars in the movie as well. Lee is a solid actor and adds a lot of depth to his character through his performance. His character Mookie is a young and tired looking delivery man who works for Sal’s pizzeria.The character Radio Raheem played by Bill Nunn is the most interesting character in the movie. His character gives the audience a clear perspective of his frustration for us to identify. This is best examined when he shows Mookie (Spike Lee) his new rings and tells him the story of \"Love and Hate\", because we as people are constantly battling both negative and positive sides of ourselves.Giancarlo Esposito who plays Buggin Out, a lively character who causes the most trouble in the movie, and attempts to start a boycott on Sal’s pizza parlor after realising there’s no African-Americans on Sal wall of frame, despite coming in three times a day until he finally notices. I love the satire of an African-American walking into an Italian pizza place asking why there's no Malcolm X pictures. I also didn’t recognise Esposito at first, because I couldn’t believe this is the same man who played the sinister villain in Breaking Bad. Terrific actor.The cinematography features a lot of bizarre perspectives and camera angles, which are used to great effect and shows us the characters point of view of the world. The colour palette of the movie is fantastic and gives the urban streets a vibrant feel. The opening credits is one of the best I've seen in a while and the best definition of attitude.I can see why people have labelled this as Spike Lee’s best work, and it deserves that title.Overall rating: The current situation of police brutality globally, not just in the US, still cries out for justice and change in the corrupt system. In 2020, you would think that things have changed for the better, but it seems that we still have a long way to go. The movie was not just a head of its time, but present of its time, and how it is still present with us today.",
            "review_date": "2020-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Do the Right Thing is [pun included] doing the right thing! Nothing can prepare its laughter when watching this classical movie and nothing can compare how funny it is to other movies.",
            "review_date": "2016-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Spike Lee's celebrated magnum opus, Do the Right Thing, is too interesting and too thought-provoking to be bad. It's also too muddled, confused, and hateful to be worthy of my praise.",
            "review_date": "2020-09-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Its characters combine to create a wonderful collage of the prototypical city streetscape, its language is consistently raw, and it takes a complicated view of race-related tensions.  Overall, it's an alluring and invigorating film in manyIts characters combine to create a wonderful collage of the prototypical city streetscape, its language is consistently raw, and it takes a complicated view of race-related tensions.  Overall, it's an alluring and invigorating film in many ways with a generous helping of humor and intelligence.",
            "review_date": "2019-06-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great for the themes but it has a lot of issues with the narrative and the development is very messy.I liked it but I really don't see the big deal with this one.",
            "review_date": "2019-05-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Do It If Spike Says So.Do The Right Thing\n\nLee's indie masterpiece that got him recognition and fame like never before, defines the very term \"situational comedy\" at its best. Building up one big climatic riot- for two whole hours- on whichDo It If Spike Says So.Do The Right ThingLee's indie masterpiece that got him recognition and fame like never before, defines the very term \"situational comedy\" at its best. Building up one big climatic riot- for two whole hours- on which the entire film hinges upon is brimmed with series of hilarious political humor that tickles you throughout the course. Basically, what Spike Lee; the writer-director, has to do and does is create a mundane environment in the street where each character- no matter how much small- factors in on this huge controversial event. And he does it with such flamboyant command over the film, that you are left in awe of its sheer practicality.Take the sweet flirty relationship between De Mayor (Ossie Davis) and Mother Sister (Ruby Dee), for instance, their trajectory on how their bittersweet equation evolves into an affectionate sentimental moment is enough to carve out the meat of the or the leap of the imagination it shows of Lee's. The other tiny sequences holds up grudges like fascism on admiring the love for celebrities or an invasion of a third party in an ongoing cold war or fighting for the rights to listen and express the views.These are the provoking notions that charges them and us to reach a cathartic climax. As much as brilliant Lee is off camera, his onscreen investment often comes off as misdirected, since he fails to obliviate his authority off screen. Nevertheless, from support like John Turturro as a hot head Pino and Samuel L. Jackson as a sharp narrator named- or claimed- Love Daddy on a local radio, he is in safe hands. Personally, Danny Aiello as Sal and often the senior among this group, steals the show for me with his brilliant frustrated performance that is ready to burst out any second. Do The Right Thing tosses an unbiased coin, fair and honest in its words, it doesn't ask questions but answers them.",
            "review_date": "2019-02-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm pretty sure I forgot to breathe during some parts of Spike Lee's 'Do The Right Thing'. Not only because the way it penetrates the mind and soul of any sensible viewer, but also because I felt ashamed by the approach I took to this movie.I'm pretty sure I forgot to breathe during some parts of Spike Lee's 'Do The Right Thing'. Not only because the way it penetrates the mind and soul of any sensible viewer, but also because I felt ashamed by the approach I took to this movie. With a stunning Public Enemy soundtrack, I expected this film to be a Black Power Movement propaganda. Was I wrong!It is 1989, a 32 year-old black man decides to make a film about race and discrimination. His approach, though, is as impersonal as it gets. He fills a Brooklyn Street during a single steaming hot summer day with every single racial representation of American immigrants. There is a Korean grocery store and an American-Italian Pizzeria, ran by the father Sal (Danny Aiello) and his two reluctant sons Vito (Richard Edson) and Pino (John Turturro) all set in a neighborhood dominated by African-Americans and even Latinos. There are no heroes and no villains among them.The plot is far from your average structure. It manages to deconstruct and implode upon itself in a slow and procedural manner like few films achieve. By keeping the location small, Lee succeeds in presenting us all the characters in a great, great level of detail, unraveling the hatred and subconscious cultural manners and views that are in every one of us through slow and wise writing and directing. Lee often lets these characters express themselves in a unique approach which I have never seen in any other film. Often they would be filmed from the front, and in a brilliantly executed subtle transition they would talk about themselves and their beliefs as if the entire film would decompose and it was just you and them. It is this technique alone, which allow the very essence of their personality to be revealed.There is a scene, in which Lee lets nearly every character spew racial slurs, almost signaling that through this hot day something waits to happen! And it does. It all builds up after Buggin' Out (Giancarlo Esposito) claims that among the Italian heroes there should be pictures of some 'black folks' on Sal's Pizzeria, to which Sal disagrees. From this rather banal issue, Spike Lee created a sprawl of hatred which ends in tragedy. But, it is not the issue which fuels the hatred, but it is the self-loathed delivery of their characters, each of them believing their truth to be the truth. The only exception is Da Mayor (Ossie Davis); an old man filled with regrets, wondering around the streets like a preacher of sorts. But, in the end, he is the only man which transcends race and eludes true love to all the characters, even though most of them despise him.In the end, Spike Lee's 'Do The Right Thing' is more than just the racial infighting that has been present since the dawn of man. It is also about the real and harsh acceptance of the fact that given the smallest catalyst, man will engage in chaos and violence, and also how important leaders are, from Martin Luther King Jr. and Malcolm X to the humble so-called Mayor.",
            "review_date": "2018-05-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's a good movie but way overrated.Slow in the first hour. There are some highlights and nice character development, but I feel like they could have made it easier for the audience to understand the point, especially a foreign audience suchIt's a good movie but way overrated.Slow in the first hour. There are some highlights and nice character development, but I feel like they could have made it easier for the audience to understand the point, especially a foreign audience such as myself.",
            "review_date": "2019-08-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Despite some slowly-paced-moments, the movie is an entertaining and conscientious masterpiece at the same time. At the beginning, you get to visit the African American community in Howard Beach, with all its bizarre inhabitants: you may thinkDespite some slowly-paced-moments, the movie is an entertaining and conscientious masterpiece at the same time. At the beginning, you get to visit the African American community in Howard Beach, with all its bizarre inhabitants: you may think that the movie is just the depiction of an African American community, but then, in its second half, you cannot avoid being invested by a strong sense of bitterness, left not by the prejudice of some Italian American family, but instead by the cruelty of the authorities, who look back with a defiant tone to those who they should protect. \"Fight the Power\" is the perfect soundtrack for a movie that does not want to promote riots against white people nor some racial fight: Spike Lee successfully raise awareness dealing with power abuse by police and other institutions, showing that violence perpetuated against black people has become something on police daily agenda, thanks to a very good cast and accurate references to real events.",
            "review_date": "2020-06-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A good hangout movie with some fun and flawed characters who are all in a **** situation, very well done with a sobering ending.",
            "review_date": "2023-01-22",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 55
}