{
  "title": "Kiki's Delivery Service",
  "rating": 8.5,
  "release_date": "1989-07-29",
  "summary": "A young witch, on her mandatory year of independent life, finds fitting into a new community difficult while she supports herself by running an air courier service.",
  "critic_reviews": [
    "As a story about how hard it is to make your own way in the world, Kiki’s Delivery Service is truthful and scalpel-sharp. That it manages all this while remaining consistently funny, optimistic and exciting – even for little ones – is a mark of Miyazaki’s genius.",
    "It’s a sweet, small story that deals comfortably in big emotions when required, whilst also taking time to speculate on the nature of art and the difficulties of navigating adolescence. One of the greatest triumphs of Miyazaki’s movie, however, is how well-defined each of its characters truly are.",
    "Deliberately eschewing the fast pace, strenuous action, frenzied special effects and wall-to-wall songs of the standard Disney animated feature, the film allows the audience to get to know the character of Kiki and feel the emotional highs and lows she undergoes in the course of her year in training.",
    "Kiki's slow pace and light-on-conflict plot may surprise kids used to American animation, but it's difficult not to be won over by the film's endearing characters and beautiful animation, as well as a storyline that stresses the values of independence and friendship.",
    "Much of Kiki’s charm comes from Miyazaki’s understated approach to the material. Instead of grabbing the viewer by the lapels and insisting everyone’s having a great time, Miyazaki leads the audience into the story with unobtrusive grace.",
    "The characters are gently and warmly rendered, and a climactic action sequence involving an unmoored dirigible hints at the stately grandiosity of Miyazaki's masterpiece Howl's Moving Castle.",
    "At its core, Kiki's Delivery Service is about the conflict between becoming your own, independent person and relying on the support and comfort of others. Not every child who watches it will get that message, but like so many other Miyazaki's films, it strikes a chord deep down. And that's not the kind of thing you ever grow out of.",
    "A terrific alternative to the diabetic's nightmare that is most of Disney's output, Kiki's Delivery Service takes pride of place in Miyazaki's exceptional body of work.",
    "This sunny 1989 fantasy by master animator Hayao Miyazaki broaches the issue of female sexuality more boldly than any Western children’s movie would dare.",
    "Overall, thoroughly delightful tale is stronger on character and texture than on plot, with Miyazaki’s masterful use of quiet spaces and expansive moods (especially in flying segs) offering a fresh contrast to hyped-up Yank toons.",
    "Kiki presents a world of fantasy in such a genteel, unforced manner that it only seems ordinary and mundane. As such, it feels like a touchstone for all of Miyazaki’s later, even greater works of cartoon storytelling art.",
    "A conventional but delightful tale of self-discovery and heroism from Mr. Miyazaki, it feels like Disney one moment, Truffaut the next.",
    "It’s a film my kids still enjoy, although it’s a bit lightweight as Miyazaki’s works go."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "A coming-of-age story about a teenage witch who sets out from her little countryside village to earn a living in the city. As she helps out with several chores using her magical broom-flying abilities, she one day decides to start running herA coming-of-age story about a teenage witch who sets out from her little countryside village to earn a living in the city. As she helps out with several chores using her magical broom-flying abilities, she one day decides to start running her own mail delivery service using her witch powers (which seem to be limited only to flying her broom and giving her cat the ability to talk, curiously enough). From there, we see her meeting new people and customers - some helpful and some rather curt with her - which has an impact on her development as she tries to balance work and life as a normal girl. The main weakness of this movie lies in its short length, in my opinion. Running at only 100 minutes, the action and character development feels rushed, which is compounded by the fact that there are many characters that Kiki comes across, and have little time to develop further along with her. As such, they felt like accessories to develop or contrast with Kiki's own character and little else besides that.Even the ending seems to come abruptly, with the credits scene rushing to tell what happens to the characters after the climactic point in the story.Besides those gripes, the animation is great and has aged well since 1989. Kiki's mannerisms are endearing and the idyllic life of this fantasy European port city can be felt during those scenes where Kiki is flying on her broom.The protagonist Kiki, upon which the movie's storytelling is centered on, is a character who is easily relatable due to her plain looks, but the real qualities that define her are her excellent work ethic and refined etiquette/manners... A unique message that is not very often told in today's movie characters. That said, Kiki's Delivery Service is a very nice feel-good piece of animation if the short duration of the movie is not an issue for you, because for me it still felt like I was at some introduction chapter to a larger series as far as character development goes. Still, I would highly recommend this movie to the younger audience out there for its positive message, and adults can easily find a great hour & a half with this one too.",
      "review_date": "2018-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very good film both the original Japanese version and English dub which is rare now days .",
      "review_date": "2020-07-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of most endearing, lovable characters of SG; the one that sew the seed of Harry Potter. An amusing story about growing up and making a place out of home. A mandatory for anime hard-core lovers.",
      "review_date": "2019-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Probably the best one out of all Studio Ghibli's town themed movies, very charming main protagonist and suprisingly deep plot",
      "review_date": "2020-03-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nInnocence, coming of age and magic collide as Studio Ghibli's Kiki's Delivery Service appears on the screen. Full of hope, charisma and positivity that is for kids and adults alike, the film does captivate its audiences. The musical score was amazing, and the animation is a marvel. However, the film suffers on editing and how coherent it tells the story and the plot. There were some scenes that certain things were heavily implied but was not clearly show which is enough to throw a film buff worth his/ her salt off of the flow of the plot. But all in all, this is definitely an unforgettable film that will probably last throughout the ages.",
      "review_date": "2020-02-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPerhaps I am not the intended audience for such a film. I understand it was made in 1989 and for kids and released to a wider audience in the late 90s. Though, I have enjoyed numerous Anime works by Studio Ghibli, I found this less than enthralling. For instance, I became bored by how many of the characters came off as two dimensional from Kiki herself to her cat to the boy chasing her to the pregnant woman that offers her a room in the oceanside town. There is also the exagerrated expressions and over-the-top interactions I find distracting - perhaps for children, this is not so off-putting. And I will admit, what annoyed me the most and took me out of the film was how wreckless the character was. Every time Kiki rode her broom, I felt for her cat hanging on for dear life. It reminded me of those scenes in American films where one character has no thought or concern for others while racing around at the end of the film to rescue someone or something. Whether in a car or running, this trope annoys me to no end and I would describe Kiki as a pure idiot on her broom (for an audience of kids, this is a dangerous thing to not acknowledge or at least rectify). This narcistic element ruined the film for me. Yes, it was established early on she was a novice while flying her broom. And yes, she is from a small village. When she enters the town, of course, she causes havoc by nearly colliding into a bus and causing several accidents. Cue the kids laughing at this some twenty years ago. Today, this made me roll my eyes. Moreover, with her first delivery, she manages to screw it up mainly because she has not learned to master her flying. I would never hire a person like this but this film is basically all about ideals and wish fulfillment and was made for an audience (of kids) who can easily identify with this character. She is a freelancer in the town of her dreams, meeting wonderful, wholesome people. Kiki is less a character and more a child's wish fulfilmment. On the one hand this is harmless and again, I understand, I am not the intended audience. Yet I found this film infantile. And while classics should stand the test of time, I feel the reason this film has re-emerged has more to do with the Zeitgeist of the gig economy. Viewers who first saw Kiki twenty years ago as children will probably return to it with the hopes of before. Yet Kiki is not a character that has depth. Instead of evolving as a person, her story is rather bland and predictable. When she loses her ability to fly, this might have translated to an audience of children as about losing confidence or magic. Today, for those viewers watching it for the first time time or returning to it, this might well reflect back on an audience of Millenials who suffer burnout each year. And I feel for the modern audiences of today. The modern economy is horrendous and people stand alone. This film is eye candy for the soul that longs for that world of generous strangers and supportive friendships. Again, an infantile view of life. Though the fantastical elements were unique and I admired this alternative world, I felt this film was less character-driven with organic human interactions and more about being a form of consolation. And again, coming back to Kiki, girl please learn how to fly that broom.",
      "review_date": "2020-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Typically weird and wonderful Japanese animation, mostly weird though, very weird.",
      "review_date": "2019-04-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Flipje, you suck! This movie looks great! If you hate this movie, you suck.",
      "review_date": "2021-02-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Kiki's Delivery Service may not be as imaginative as Miyazaki's top movies, but its service to the same sweet slice of life story-telling and flush energetic heroine may deliver fans everything their looking for while providing more of theKiki's Delivery Service may not be as imaginative as Miyazaki's top movies, but its service to the same sweet slice of life story-telling and flush energetic heroine may deliver fans everything their looking for while providing more of the usual visual craft.",
      "review_date": "2022-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Let's start with the good. The background is beautiful. Characters are warn and unique, a joy to watch. (how this movie even managed a 3 from me)Character art and music is serviceable. But the plot is utter trash. Every point of the plotLet's start with the good. The background is beautiful. Characters are warn and unique, a joy to watch. (how this movie even managed a 3 from me)Character art and music is serviceable. But the plot is utter trash. Every point of the plot both big and small is either nonsensical, contrived, or somehow both at the same time! (and a large amount of it is nonsense) Often the way a plot is contrived is getting Kiki to act inexplicably stupid, but it's contrived in many other very obvious ways too. I struggle to find any plot point of any significance at all of this that even is a little OKSo watch it for the beauty and warm characters and if you can turn off your brain (which I was not able to do) you can enjoy this. Kids can be better at this than adults so maybe show it to little kids. For others, the horrible practically nonexistent it's so bad plot will make them feel like they are losing brain cells. If I were to give all examples of plot issues, I'd basically also be \"spoiling\" the movie from beginning to end, not that such should matter to someone who doesn't give a **** about plot and a movie that doesn't have one.I forced myself to watch the entire movie because I am a big fan of many other Studio Ghibli movies and wanted to give a complete review. Like if the plot started working at any point at all in the movie... It never did. Please don't down-vote my review just because you enjoyed this movie.",
      "review_date": "2021-04-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Although charming and exciting, the whole story was not that captivating. But it's good.",
      "review_date": "2020-12-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Witches have never been so likable and relatable! And witchcraft has never been so mundane!Slightly bogged down by occasionally going into some familiar territory (especially in its third act), Miyazaki's most light-hearted film is anWitches have never been so likable and relatable! And witchcraft has never been so mundane!Slightly bogged down by occasionally going into some familiar territory (especially in its third act), Miyazaki's most light-hearted film is an otherwise fascinating, delightful, funny and charming fairy-tale that effortlessly teaches a variety of valuable lessons such as self-discovering, self-acceptance, self-reliance and self-understanding like no other film did.(8/10)",
      "review_date": "2019-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A young witch is forced to abandon her parent's house to seek an independent life in another, far away city. While she faces many perils along the journey to become a fully functional witch, whose task is to help people and study alchemy, sheA young witch is forced to abandon her parent's house to seek an independent life in another, far away city. While she faces many perils along the journey to become a fully functional witch, whose task is to help people and study alchemy, she also makes a few friends who enrich her life and help her along the way.A very good and wholesome movie.",
      "review_date": "2021-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A magnificent movie about growing up and finding your independence that resonates with me more than any live action movie about the same subject matter.",
      "review_date": "2020-10-19",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 28,
  "genres": [
    "Adventure",
    "Drama",
    "Fantasy",
    "Animation",
    "Family"
  ]
}