{
  "title": "Mississippi Burning",
  "rating": 8.5,
  "release_date": "1989-01-27",
  "summary": "A fictionalized version of the murders of three civil rights activists on June 21, 1964 in Mississippi. The FBI comes in to solve the case and succeeds only after using unethical and illegal means. (MGM)",
  "critic_reviews": [
    "Apart from its pure entertainment value - this is the best American crime movie in years - it is an important statement about a time and a condition that should not be forgotten. The Academy loves to honor prestigious movies in which long-ago crimes are rectified in far-away places. Here is a nominee with the ink still wet on its pages.",
    "Mississippi Burning speeds down the complicated, painful path of civil rights in search of a good thriller.  Surprisingly, it finds it",
    "Parker, a director of breadth, not depth, never supplies the big answers, but he does powerfully depict the climate of the Confederacy in the \"Freedom Summer\" of 1964.",
    "For those who know such places, Mr. Parker, who is English, evokes the texture, the gritty, fly-specked Southernness, the brooding sense of small-town menace, the racial hatred, with considerable accuracy.",
    "Though its credibility is undermined by a fanciful ending, Mississippi Burning captures much of the truth in its telling of the impact of a 1964 FBI probe into the murders of three civil rights workers.",
    "With remarkable performances, aggressive direction and a cracking pace, this is superb cinema, even if the historical accuracy leaves much to be desired.",
    "Mississippi Burning is visually splendid.  Director Parker and his crew have created a film that is unquestionably watchable. As a history lesson, however, it's laughable.",
    "The glorification of the FBI, the obfuscation about Jim Crow laws, and the absurd melodramatics may all have been well-intentioned, but the understanding about the past and the present of racism that emerges is depressingly thin."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Although based on real events, the filmmakers go to great lengths to make it clear that this is a work of fiction. As such it works very well; it is a very powerful drama that puts the fight for civil rights to the fore. I must say I found itAlthough based on real events, the filmmakers go to great lengths to make it clear that this is a work of fiction. As such it works very well; it is a very powerful drama that puts the fight for civil rights to the fore. I must say I found it quite thought provoking, very well made and really well shot. The performances were all excellent with (for me), Gene Hackman standing out; although I thought Willem Dafoe was very good and Brad Dourif was excellent as the loathsome Deputy Pell. I also have to mention a couple of small roles; it was nice to see both Stephen Tobolowsky as Clayton Townley and R. Lee Ermey as Mayor Tilman; I know they didn’t have an awful lot to do, but they were both quality. Over all, an interesting drama that kept me interested all the way through  a definite ‘must’ for any cinephile.\r SteelMonster’s verdict: HIGHLY RECOMMENDED\r My score: 8.7/10.",
      "review_date": "2013-07-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is a classic. It is truly gripping with the detectives playing two sensational performances. In particular, the violent scene at the barbers shop is excellent. The film also plays with all the emotions and sometimes is painful toThis film is a classic. It is truly gripping with the detectives playing two sensational performances. In particular, the violent scene at the barbers shop is excellent. The film also plays with all the emotions and sometimes is painful to watch as we witness the cruelty and suffering caused by the KKK in Mississippi.",
      "review_date": "2013-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Comprised mostly of racial abuse and interrogations, this portrayal of a certain historical event is flawed because it is all jumbled together, thinly veiled as a historical masterpiece. The difficulty of using these racial themes within filmComprised mostly of racial abuse and interrogations, this portrayal of a certain historical event is flawed because it is all jumbled together, thinly veiled as a historical masterpiece. The difficulty of using these racial themes within film is the accuracy that it is shown in order to be of certain historical value. It is one thing that you use an event from history and go slightly off track to improve it, it is another thing that you take an event from history and change it around into a complete mess that disrupts the perhaps flawless construction of history. Of course, this film is of little entertainment value, not because of the violent, horrific aspects, but because of the intensity. It wasn't all doom and gloom in the 1960's, but I suppose you could expect that from something titled 'Mississippi Burning'. At least the ending provided something a little more cheerful, despite the fact many people had been killed in the process.",
      "review_date": "2012-07-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The director makes it a point to say that this is a fiction, despite being based on a real-life event, and I couldn't agree more. It's so annoyingly over dramatized that it fails to keep you even remotely interested in it. And often times,The director makes it a point to say that this is a fiction, despite being based on a real-life event, and I couldn't agree more. It's so annoyingly over dramatized that it fails to keep you even remotely interested in it. And often times, The story is dropped in order to show off some weak action scene, I just don't get it. And what's even more insulting is that the 3 murdered men, who this film is based on, are barely mentioned at all in this film. Now that is insulting.",
      "review_date": "2018-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fantastic, satisfying take on the conflict meeting the Civil Rights Movement in the south. It is certainly hard to watch at some points; this film does not hold back, and it illustrates the irrational hatred against black Americans in aA fantastic, satisfying take on the conflict meeting the Civil Rights Movement in the south. It is certainly hard to watch at some points; this film does not hold back, and it illustrates the irrational hatred against black Americans in a disturbing (but accurate) manner, to the point where the viewer feels as helpless as the innocent victims. The dynamic between Dafoe and Hackman's characters is genius, and surprisingly, there are many funny moments throughout the film to lighten the mood. Admittedly the film gets a bit slow in the middle, but it's all worth it to see the Klansmen get their comeuppance in the end. All in all, this is a compelling film, with a strong message that all americans should keep in mind today.",
      "review_date": "2017-08-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "essentially husky and cunningly crispy..Mississippi Burning\n\nMississippi Burning is a character driven political thriller about FBI investigation that creates havoc as they start taking matters in hand after racism increases like a fireessentially husky and cunningly crispy..Mississippi BurningMississippi Burning is a character driven political thriller about FBI investigation that creates havoc as they start taking matters in hand after racism increases like a fire catching forest in a town. Depicting such a delicate concept, the feature is surprisingly bold and obviously poignant with some indelible gut wrenching visuals. And the makers in here, respects both the sides of the political aspects and walks on a fair and clear line. Contrary to what premise promises or suggests, there is a lot more in here to explore than mere investigation procedure and no matter how rudimentary it may be, its metaphorical and satirical tone keeps the audience tangled in its pathos bubble. The background score may not be up front factoring the most, but it certainly has amazing cinematography and fine editing. \"The buddy cop\" chemistry should actually be like such and it defines it with such subtle panache that leaves long gasping of air whenever they are on screen. As mentioned, the performance is revelation in here where both the lead cast going head to head is one of the primary reason why stakes communicate fluently. Hackman has genuinely invested all his chips in with Dafoe supporting him thoroughly and McDormand proving once again why she is one of the finest actress we have. Gerolmo's exquisite script is justified by Parker's execution skills where he leaves no barrs while conveying the message. The inner politics brewed within the period depicted (the tables turning half way through the tale is not only unexpected but utterly pleasing to encounter too), Hackman and Dafoe sharing wisdom through funny bits and their performance that binds it all, are the high points of the feature. Mississippi Burning is more than the genre could title it for, as it is essentially husky and cunningly crispy for the entire majestic two hours.",
      "review_date": "2018-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good script Good casting and good acting but it seems all had been thrown in a big pot and released.",
      "review_date": "2020-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fictionalised telling based on a true life crime, this is one powerful movie.Hackman and Defoe are fantastic as the two FBI agents.One of the best movies of 1989.",
      "review_date": "2021-01-18",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 17,
  "genres": [
    "Drama",
    "Mystery",
    "Thriller",
    "Crime"
  ]
}