{
  "title": "When Harry Met Sally...",
  "rating": 8.3,
  "release_date": "1989-07-12",
  "summary": "Will sex ruin a perfect relationship between a man and a woman? That's what Harry (Crystal) and Sally (Ryan) debate during their travels from Chicago to New York. 11 years and 2,000 miles later, they're still no closer to finding the answer. And they've never ventured past their friendship to discover the love that's right in front of them.Will sex ruin a perfect relationship between a man and a woman? That's what Harry (Crystal) and Sally (Ryan) debate during their travels from Chicago to New York. 11 years and 2,000 miles later, they're still no closer to finding the answer. And they've never ventured past their friendship to discover the love that's right in front of them. Will these two best friends ever accept that they're meant for each other... or will they continue to deny the attraction that's existed since the first moment When Harry Met Sally? (MGM)… Expand",
  "critic_reviews": [
    "A ravishing, romantic lark brimming over with style, intelligence and flashing wit.",
    "It's a movie that walks on air.",
    "Together, Crystal and Ryan really click. Even though their characters are polar opposites (or perhaps because of it), their interaction has a charm and warmth that most motion picture pairings lack.",
    "The joy comes not from the will-they-won't-they romance between the two leads, but from the sharply written humour from the pen of writer Nora Ephron.",
    "What makes it special, apart from the Ephron screenplay, is the chemistry between Crystal and Ryan.",
    "The comedy is warm and witty and wafer-thin, as easy on the palate as a raspberry sorbet on a summer afternoon.",
    "Very slickly and glibly put together, with a sharp eye for yuppie decor and accoutrements; even Woody's habitual, fanciful vision of an all-white New York is respected.",
    "The plot may seem anything but fresh (and the borrowings from Woody Allen certainly are stale), but director Rob Reiner has a killer instinct for setting up jokes and punchlines.",
    "Rob Reiner directs with deftness and sincerity, making the material seem more engaging than it is, at least until the plot machanics begin to unwind and the film starts to seem shapeless.",
    "Like the sitcom version of a Woody Allen film, full of amusing lines and scenes, all infused with an uncomfortable sense of deja vu."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I'm probably one of the sappiest guys I know. Maybe even abnormally so. It is probably because I grew up with primarily my mother. As a result, I fall for the romantic comedy. I would like to think I like the more intellectually stimulatingI'm probably one of the sappiest guys I know. Maybe even abnormally so. It is probably because I grew up with primarily my mother. As a result, I fall for the romantic comedy. I would like to think I like the more intellectually stimulating ones, but most people would probably say I'm fooling myself. I can't stand Pretty Woman, or any other Julia Roberts romantic comedy. Nor can I tolerate pure fluff. Again, maybe I'm naive, but I tend to like the romantic movies that do a little more than the normal romantic fluff.When Harry Met Sally redefined (or defined, depending on to whom you talk) the romantic comedy. The dialogue, memorable quotes, flawless acting and directing, as well as the sparkling chemistry between two unlikely actors, When Harry Met Sally is a near-perfect story of two opposites who, over time, grow to realize just how compatible they really are. It's a hopeful friends-to-lovers progression that never seems forced. Rob Reiner adapts Nora Ephron's script and edits it to flawless execution. At no point does the connection seem unnatural. The audience is carried end-to-end and experiences the same maturity through Harry and Sally's relationship, recognizing the imperfections of each character and recognizing elements of each's life in their own lives. When Harry Met Sally set the standard and has been copied poorly by many wanna-bes, but it is the original and worth the time if you have never seen it.",
      "review_date": "2010-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When Harry Met Sally is one of those great romance films that has passed the test of time, and is surprisingly now mentioned in the same breaths as Casablanca, Gone With The Wind, Before Sunrise, and Brief Encounter. One of Rob Reiner andWhen Harry Met Sally is one of those great romance films that has passed the test of time, and is surprisingly now mentioned in the same breaths as Casablanca, Gone With The Wind, Before Sunrise, and Brief Encounter. One of Rob Reiner and Nora Ephron's finest works, When Harry Met Sally finds it's strength in just how ordinary the circumstances and characters are. It's very easy to relate to both Harry and Sally, and Billy Crystal and Meg Ryan's memorable performances make this even easier. While the film strays from it's philosophical debate of \"can men and women ever be just friends?\" and into a happy ending, it is a better movie for it. Fans of love stories need to watch When Harry Met Sally.",
      "review_date": "2019-02-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There is no scientific or logical explanation for falling in love, but there is one for what makes this film special: the story of a love that has germinated, albeit slowly, over the years. Not to forget the performances of Ryan and Crystal.",
      "review_date": "2022-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great performances. A film that will stand the test of time. Funny no matter how different the future is because it speaks to the very nature of a man and a woman but with humor. A must see for anyone.",
      "review_date": "2017-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved this movie. It's a great dissection of why men and women are the way they are. It's got a clever screenplay by Nora Ephron and great direction by Rob Reiner. Meg Ryan and Billy Crystal was a fantastic paring. I would have to say thatLoved this movie. It's a great dissection of why men and women are the way they are. It's got a clever screenplay by Nora Ephron and great direction by Rob Reiner. Meg Ryan and Billy Crystal was a fantastic paring. I would have to say that it's one of the best romantic comedies of all time. In a genre which often produces stale movies this one breaks the mold.",
      "review_date": "2015-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best romantic comedies of it's era. Meg Ryan and Billy Crystal make a surprisingly engaging film pair. The supporting cast is great. Superbly written and directed. The restaurant \"orgasm\" scene has to be one of the funniest One of the best romantic comedies of it's era. Meg Ryan and Billy Crystal make a surprisingly engaging film pair. The supporting cast is great. Superbly written and directed. The restaurant \"orgasm\" scene has to be one of the funniest scenes ever filmed.",
      "review_date": "2009-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "To any of my friends who've heard me rave about this movie since it came out....it's my all time favourite. Not only am I a helpless romantic, but I love the humour especially. Crystal was hilarious and Ryan was beyond cute and To any of my friends who've heard me rave about this movie since it came out....it's my all time favourite. Not only am I a helpless romantic, but I love the humour especially. Crystal was hilarious and Ryan was beyond cute and attractive. It's the only movie in my life I went and saw at the theatre 10x, taking a new friend each time as I wanted them to enjoy it (plus, there just wasn't much else on at the theatre I wanted to go to instead). Anyways, here it is 15 years later and I own it on DVD (go figure). Enjoy it. Laugh. Bask in it....and I think it has the best closing lines (Crystal to Ryan on New Year's) in the history of movies.",
      "review_date": "2006-02-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best Romantic Comedy I have ever seen.",
      "review_date": "2007-05-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really, really good, a very wonderful movie... better than the overrated Lost in Translation",
      "review_date": "2009-07-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Come on, who hasn't watched this film at least 10 times and smiled about 50 times throughout. A classic.",
      "review_date": "2005-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The element of surprise is the key factor that makes Harry (Billy Crystal) meeting Sally (Meg Ryan) so spot on, I for one was lead to believe that these two were going to start the film as best friends, but we see various situations where theThe element of surprise is the key factor that makes Harry (Billy Crystal) meeting Sally (Meg Ryan) so spot on, I for one was lead to believe that these two were going to start the film as best friends, but we see various situations where the two run into each other over the course of twelve years, they live their lives with typical progression of occupation, dating and marriage, and perhaps more so now, divorce. But yet their paths continue to cross to the point where they do indeed become each others shoulder to cry on, which by way of default stirs feelings that set the whole random occurrences into motion. Harry is a fast-talking and confident in his successful career role, while Sally also leads quite a mirrored life to Harry, yet their personalities and attitudes are entirely different.\rThey begin a friendship which tests boundaries and openness from the beginning, and many of the funnier moments of the film come from the various explanations of conversations they had when they last met, but how differently the two remember them. Billy Crystal's comic timing is impeccable, he delivers his lines with ease and promise, showing his skill of handling complex dialogue but still managing to make every word count to something funny. He plays a m,an who has the answers to life and its imperfections, yet doesn't know much as well, the whole aspect of the film challenges friendship and sexual tension, while Meg Ryan plays a character who shows an exterior confidence but also has the soft centre of a human being who wants to be held and loved like anyone else. She has a strong likeable personality that works well with her good looks, easily matching the witty delivery of Crystal, with a few of her very own memorable scenes that continue to print the film into many minds.\rWe have a strong supporting cast in the form of Carrie Fisher and Bruno Kirby, who play the respective friends of Harry and Sally, these two play pivotal roles in the cause and effect routine of dating and taking it to the next level, the opposite of the two lead characters situation. But like what many others have said, it can feel in many aspects like a sitcom being told in various flashbacks, it sometimes loses its cool when it skips five years ahead or so, more time could have been spent developing these characters as individual entities rather than the two of them facing similar situations.\rThat aside, this is a strong and likeable romantic film that has witty characters and unorthodox moments, the leads share great chemistry and will never fail to be there for some laughs.",
      "review_date": "2013-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When legends of comedy are discussed, Rob Reiner's name does not often make an appearance. Yet, the man has so many hits, it is disgusting. This Is Spinal Tap, The Princess Bride, and The American President are comical riots. I often watchWhen legends of comedy are discussed, Rob Reiner's name does not often make an appearance. Yet, the man has so many hits, it is disgusting. This Is Spinal Tap, The Princess Bride, and The American President are comical riots. I often watch comedies and, in the spirit of hating fun, do not find them very funny. There are very few comedies that actually hit the right notes for me and leave me gasping for air. When Harry Met Sally joins those other Reiner films (aside from The Princess Bride, which was pretty good, but not nearly as funny) in making me laugh consistently from beginning to end. With charismatic turns from Billy Crystal and Meg Ryan, the film is oozing with chemistry, joy, and commentary on relationships. Even better, it casts aside Hollywood romance cliches in favor of a realistic approach to love and inter-sex non-sexual relationships.Pairing together Harry (Billy Crystal) and Sally (Meg Ryan), the film actually takes a while to put them together. Yet, while the romance begins to take root, the pair's comedic chemistry is natural and easy to watch. With a manic, depressive, and neurotic style of comedy, Billy Crystal drops top-notch lines like they were nothing. Comedy just rolls off his tongue like butter on a pan. Alongside him is the far more stoic and proper Ryan who plays Crystal's comedic foil. Yet, make no mistake, she can be funny as well and really goes toe-to-toe with Crystal from the very beginning. Yet, what really helps to make the film funnier is the writing from Nora Ephron. With quotable lines coming from every direction, the comedic writing here is stellar with a tremendous understanding of the skills of the leads and playing to those strengths. The material Crystal and Ryan are given is within the realm of their comedic talent and charisma, allowing for free flowing joy and comedy.The film's other major strength in the writing is its relationship. Resisting the temptation to throw its originally mismatched leads together, it builds up authentically. Putting them together as friends who avoid sex to ruin the friendship and then finally give in to temptation, but resist is brilliant and real. Though a classic Hollywood romantic comedy film, it does not deliver a cliche and over dramatic pay-off. Instead, it feels real. Harry and Sally could be real people who have finally pulled their heads out of their asses and saw the sky for the first time. They resist the love they feel to not lose a friend and, when they finally give in, it is clear they are a match for one another. Yet, through fear and trepidation towards losing this great friend, they still remain skeptical. For many, this is a fact of life and to see it so brilliantly portrayed on screen shows the real triumph of this film.One of the main reasons why I loved When Harry Met Sally though is simply the pure, unbridled joy of watching this film. It is an easy watch, but yet a great exploration of romance and friendship. It pairs two incredibly likable leads together, puts together realistically, and does not rush anything between them. Sprinkling in real life stories of love and marriage only adds to the magic of the film. Rob Reiner knows comedy and it is really shown in this film, even though he rarely gets the credit he deserves as being a top-notch director when working with great material (mainly because his output since the late 1990s has been garbage). Here, he crafts an eminently likable film that blends romantic comedy cliches (two lovers who hate each other first being a common trope) and then adds layers of realism to the equation that largely subvert the cliches to the point that Billy Crystal running through New York to find Meg Ryan feels authentic and real. Rather than absurd, it is a bombastic, romantic, and magical gesture that encapsulates the power of love and the crazy things it can make people do. Classics always have a lot to live up to, but When Harry Met Sally exceeds all expectations with impeccable comedy, comedic frequency, writing, and romance.",
      "review_date": "2017-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Thanks to some blisteringly honest humor from Nora Ephron and Rob Reiner and a keen sense of warmth between Crystal and Ryan,\"When Harry Met Sally\" rightfully earns its spot atop the list of cinema's most iconic romantic comedies.",
      "review_date": "2014-08-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best Romantic Comedy I have ever seen. Director Rob Reiner has a killer instinct for setting up jokes and punchlines, and is vastly aided by the performances and chemistry of Crystal and Ryan, as well as crisp supporting work from CarrieBest Romantic Comedy I have ever seen. Director Rob Reiner has a killer instinct for setting up jokes and punchlines, and is vastly aided by the performances and chemistry of Crystal and Ryan, as well as crisp supporting work from Carrie Fisher and Bruno Kirby and I can seriously say that is one of the greatest films of all time.",
      "review_date": "2013-10-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought this movie was absolutely wonderful.  Somehow I'd never seen it before, even though I'm a big fan of chick flicks and I love Meg Ryan in things like You've got Mail and Kate and Leopold.  Anyway, I'm glad I finally got around toI thought this movie was absolutely wonderful.  Somehow I'd never seen it before, even though I'm a big fan of chick flicks and I love Meg Ryan in things like You've got Mail and Kate and Leopold.  Anyway, I'm glad I finally got around to watching it.  The unusual chemistry between Meg Ryan and Billy Crystal is so much fun--rather than the overly flirtatious or sexual chemistry you get between so many romantic leads, Ryan and Crystal fall into this friendly antagonism that makes their friendship so good and so believable, so that the idea of their building a romantic relationship over top of it just feels so natural.  Their banter is amazing--I get the sense that Ryan's character is every bit as smart as Crystal's, but Crystal has her beat in verbal gymnastics, which makes it so much fun when she does things to outsmart him, like the fake orgasm she performs in the deli.  A really clever and charming movie that I'll definitely be watching again and again.",
      "review_date": "2015-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pretty shallow piece filled with conservative ideals. The critics' ratings and the IMDB ratings are just, and I'm not sure why the user rating here is so high.",
      "review_date": "2018-09-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "a sophisticated love track..When Harry Met Sally..\n\nWhen Harry Met Sally is a character driven romantic drama about two platonic friends who struggles to see the affection for each other. The chemistry is decent enough to charm their waya sophisticated love track..When Harry Met Sally..When Harry Met Sally is a character driven romantic drama about two platonic friends who struggles to see the affection for each other. The chemistry is decent enough to charm their way out, but fortunately it doesn't need to since its writing is the protagonist in itself. The flirty talk, hilarious topics and references, makes the pragmatic conversations thoroughly entertaining and electrifying. Addition to that, Crystal's comic timing and Ryan's support to him, blends in aptly. The structure of the feature is newer and fresh that is respected equally as much as the characters have been. The little nuances like fiddling with the props around the scene and a brief love track narrated by various couple in an interview is just pure delight. Reiner's world is brimmed with such sweet innuendos that makes it utterly pleasing with a big smile on the face that stays with the audience long after the curtain drops. The background score is a bit disappointing along with the sound department although the cinematography (like the phone call between Harry and Sally) play a vital role in storytelling and has fine editing. It is shot with bright and light colors spread across the whole screen that is appealing for the viewers from the first frame. As mentioned earlier, the performance is decent if not anything extraordinary especially by the lead cast Crystal and Ryan. Reiner's execution is unfortunately chalky around the edges but with a sincere heart at the center of it, it sails off the shore safely. Smart and funny conversation, simple and sensible track and, a safer perspective are the high points of the feature. When Harry Met Sally is a sophisticated love track on context of its subjective procedure that even respects the space of audience.",
      "review_date": "2018-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I like this film for its laidback tone and some of the dialogue is quite good - somewhat thought provoking. It was, I imagine, quite contemporary when it came out in 1989. If watching a couple flirt over a fair amount of time is your thing,I like this film for its laidback tone and some of the dialogue is quite good - somewhat thought provoking. It was, I imagine, quite contemporary when it came out in 1989. If watching a couple flirt over a fair amount of time is your thing, then this is for you, I'd say. Its maybe a bit subtle and slow which may bore some but it does have a certain charm about it which I liked nevertheless.",
      "review_date": "2021-11-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best Romantic comedy ever! My favorite movie of all time. Don't understand why this isn't a must see.",
      "review_date": "2020-11-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a good romcom with great dialogues, moments that will make you laugh and actors that just fit right into the characters they play!The movie was such a good time, and it's completely worth watching these days!!!",
      "review_date": "2021-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best comedies of the 1980's.A brilliant observational comedy on relationships, and to put it simply, the difference between men and women.",
      "review_date": "2021-01-25",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 31,
  "genres": [
    "Drama",
    "Comedy",
    "Romance"
  ]
}