{
  "title": "Fantasia",
  "rating": 8.3,
  "release_date": "1940-11-13",
  "genre": [
    "Fantasy",
    "Music",
    "Animation",
    "Family"
  ],
  "summary": "A collection of animated interpretations of great works of Western classical music.",
  "critic_reviews": [
    "A masterpiece of the art of animation. The concept and some of the episodes are tainted with kitsch, but there's no other animated film with its scope and ambition—it is, in Otis Ferguson's words, “one of the strange and beautiful things that have happened in the world.”",
    "Throughout Fantasia, Disney pushes the edges of the envelope.",
    "Fantasia is simply terrific—as terrific as anything that has ever happened on a screen.",
    "It is icon, uplift, art of the future, nostalgia, psychedelic journey, Americana, technological triumph, classic.",
    "The most ambitious animated feature ever to come out of the Disney studios, Fantasia integrates famous works of classical music with wildly uneven but extraordinarily imaginative visuals that run the gamut from dancing hippos to the purely abstract. It's like a feature-length compilation of elaborate Silly Symphonies",
    "This is a bold work that seeks to educate its young audience about classical music. But it is also playful and delightfully imaginative.",
    "Envisioned as a musical symphony come to life, Fantasia is a bizarre, almost trippy experience rich with hypnotic visuals, dazzling animation and beautiful music.",
    "Though Disney's toddling cannot keep pace with the giant strides of Ludwig van Beethoven, Fantasia as a whole leaves its audience gasping. Critics may deplore Disney's lapses of taste, but he trips, Mickey-like, into an art form that immortals from Aeschylus to Richard Wagner have always dreamed of.",
    "Fantasia best can be described as a successful experiment to life the relationship from the plane of popular, mass entertainment to the higher strata of appeal to lovers of classical music.",
    "Fantasia is mashed potatoes and gravy but there's more than a hint of beluga there too.",
    "It’s unquestionably among Disney’s masterpieces.",
    "Disney's attempts at the visual illustration of Beethoven and Co - a dubious exercise anyway - produce Klassical Kitsch of the highest degree. Awesomely embarrassing; but some great sequences for all that, and certainly not to be missed.",
    "This is a very patchy affair - while some of the animated pieces work, others come across as downright insane."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Well after the Disney classics of Snow White and Pinocchio it seems Walt had to do something really special. I mean REALLY special! Walt Disney had made a landmark of animation to Musical animated feature with no dialogue. How fascinating isWell after the Disney classics of Snow White and Pinocchio it seems Walt had to do something really special. I mean REALLY special! Walt Disney had made a landmark of animation to Musical animated feature with no dialogue. How fascinating is that?The musical themes are:Toccata and Fugue in D MinorNutcracker SuiteThe Sorcerer's Apprentice (starring Mickey Mouse)The Rite of SpringThe intermission of Meet the SoundtrackThe Pastoral SymphonyDance of the HoursNight on Bald Mountainand finally Ave MariaThat's all the classical musicals there is. I have only seen the opening number of Toccata and Fugue in D Minor, The Sorcerer's Apprentice, The Rite of Sping which is scary and the beautiful musical theme Ave Maria. Years ago I've watched The Rite of Spring and when I got older my friend Sam Hudson told me that it is a box office disappointment. I didn't know that it is a box office disappointment when I watch this movie because Sam told me that because of the World War II. Aside from that, this Disney classic is a critical acclaim. The music in this is beautiful just the two Disney classics, it is a achivement of all of us.",
      "review_date": "2019-04-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Fantasia\" takes Disney to the next level. This is another passion piece, you can feel that the animators working on it put a lot of their soul to accompany the brilliant musical score. The short stories work within themselves and close\"Fantasia\" takes Disney to the next level. This is another passion piece, you can feel that the animators working on it put a lot of their soul to accompany the brilliant musical score. The short stories work within themselves and close themselves off rather perfectly. With what I can only describe as visual insanity, \"Fantasia\" strives to be more than what the medium of animation can offer. It truly stretches it to it's limit, which is impressive for the time of release.This is a movie for everyone with a little spark of imagination living in them, for people who love the abstract and bizarre, for people who find themselves lost in fantasy when listening to music. This is collectively the imagination of not only the animators, but the orchestra at work. It is as impressive from the beginning until the very end. Marvelous.",
      "review_date": "2019-03-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The problem is with Fantasia is that you either love it or hate it. The incorporation of classical music with some beautifully done animations is stunning, to say the least.",
      "review_date": "2019-03-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What can you say about a movie that combines classical music favorites with excellent animation. This should be the number 1 movie in the Disney line-up as it shows what's possible and opened the doorway for experimentation in animatedWhat can you say about a movie that combines classical music favorites with excellent animation. This should be the number 1 movie in the Disney line-up as it shows what's possible and opened the doorway for experimentation in animated features. Pinnochio is farther up on the list, and I love that, but this is by far my favorite and has been since I was a kid.",
      "review_date": "2019-03-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantasia is a very good musical film but is less than the sum of it's parts.",
      "review_date": "2019-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Music Galore!Fantasia is definitely music to my ears with that classic Disney feel.",
      "review_date": "2019-12-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantasia. Musical fairy tale. On the street 1940, and Walt Disney made an insanely beautiful and musically beautiful masterpiece. The picture is over 80 years old, and it is amazing with technical capabilities. The main feature of thisFantasia. Musical fairy tale. On the street 1940, and Walt Disney made an insanely beautiful and musically beautiful masterpiece. The picture is over 80 years old, and it is amazing with technical capabilities. The main feature of this cartoon is that you can listen and not look, and also on the contrary watch and not listen, but it is best to combine of course. The stunning and already classic works of Johann Sebastian Bach, Pyotr Ilyich Tchaikovsky, Ludwig Van Beethoven and the rest of the great composers of that time fit in this seemingly children's cartoon. The first full -length appearance of Mickey Mouse will also be a pleasant surprise.",
      "review_date": "2023-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mediums Analyzed And Triumphed Over.Fantasia\n\nDisney's culmination of the Western classical music, iterated with a metaphorical animated episode is an eye popping delight and a brain scratching concept to thrive upon. As a series of variousMediums Analyzed And Triumphed Over.FantasiaDisney's culmination of the Western classical music, iterated with a metaphorical animated episode is an eye popping delight and a brain scratching concept to thrive upon. As a series of various episodes, that it leaps to, from one symphony to another, it usually grows off putting as there is no flow or a mutual aspect as a lose thread for the audience to hold on to, but not this time, not in here. Among multiple musical acts, the first two focusing on tiny little aspects of the nature that is explored with an awe-struck beauty depicted with suave animation and bright heart pleasing colors is a testament to the fragility and ingenious minds.And among such animations too, the makers have managed to tell a tale depicting the mundane life of each being contributing equally and thoroughly to the nature itself. Misusing the power achieved or stolen temporarily, Mickey Mouse is on run, salivating to use the magic for his best, finds himself on a self created conflict, circling the arc of a complete tale narrated within few minutes. Personally, the Dance Of The Hours, is something that felt over thought out and naturally didn't buy into it, on the other hand, The Rite Of Spring balances the tone with stunning visuals and fluently depicting the transaction over the time.The climatic tale featuring the night and day concept through an exhilarating metaphor, ends this film on the highest note possible. Aforementioned, as much as rich the film is visually, the music is jaggedly on mark that elevates the momentum of the chapter discreetly and as a whole. As usually these Disney movies contains, the tale has a range to adore its younger audience and push the mature one, the balance is soothing to encounter. Fantasia is one of the finest classics of Disney that is equally competent to the ears as it is illuminating to our eyes.",
      "review_date": "2019-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "okay another bomb another alright movie my favorites  made it into a mini golf coarse in Disney world except one which made a cameo   they are toccata and fugue the nutcracker suite the sorcerers apprentice not the rite of spring thats badokay another bomb another alright movie my favorites  made it into a mini golf coarse in Disney world except one which made a cameo   they are toccata and fugue the nutcracker suite the sorcerers apprentice not the rite of spring thats bad the pastroil simony dace of the hours and last and the one that made a cameo in the passtroil simony night on bald mountain a pretty good movie",
      "review_date": "2018-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Truly a great classic! Something for everyone! I perfectly portrays Disney's effort to make the imagination and creative mind, come to life!",
      "review_date": "2019-10-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is not a movie...It's a moving work of art. Fantasia is often considered to be one of the greatest animated films of all time, and I totally agree. In fact, I consider it to be the greatest animated movie ever made. The reason is simple:This is not a movie...It's a moving work of art. Fantasia is often considered to be one of the greatest animated films of all time, and I totally agree. In fact, I consider it to be the greatest animated movie ever made. The reason is simple: It pushes animation as a form of art to its absolute limits. This movie shows how far can animation go to tell stories alongside wondeful music and interesting visuals. This is not a movie, it's an experience. It's a visual delight from beggining to end. I think this is a movie hard to imitate in terms of quality, and whoever tries to do the same thing, would be seen as a simple imitator. I can't believe the amount of effort shown in the animation: Every detail, every frame, every shot, shows that tons of effort was put to bring this pieces of art to life. My only issue is that the Master of Ceremony who presents every segment basically spoils the whole thing. Like, I think it would've been better to give an introduction and then explain a little bit, not to tell the whole thing. But that's literally the only flaw this movie has, because the rest of it...It's just perfect.If I could give it an 11, I would. I wish I could live long enough to see a cinematic experience superior to this.",
      "review_date": "2019-09-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantasia is my personal icon for classical music and serves as also as famed 20th century conductor Leopold Stokowski being my personal idol for conducting music! Fantasia forever remains a timeless addition to my library of digitallyFantasia is my personal icon for classical music and serves as also as famed 20th century conductor Leopold Stokowski being my personal idol for conducting music! Fantasia forever remains a timeless addition to my library of digitally purchased streaming content!!!",
      "review_date": "2020-09-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Truly a work of art. With its fantastic animation, unforgettable music, memorable characters and greatly told story all making this film an absolute must watch.",
      "review_date": "2020-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's a classic, and it already was when I first watched it as a child. It's just sad that most kids these days won't get to see it or want to see it.",
      "review_date": "2022-11-02",
      "source": "metacritic"
    }
  ],
  "num_reviews": 27
}