{
    "rating": 8.5,
    "release_date": "2002-12-06",
    "num_reviews": 290,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "Nicolas Cage is Charlie Kaufman, a confused L.A. screenwriter overwhelmed by feelings of inadequacy, sexual frustration, self-loathing, and by the screenwriting ambitions of his freeloading twin brother Donald (Nicolas Cage). While struggling to adapt \"The Orchid Thief,\" by Susan Orlean (Meryl Streep), Kaufman's life spins from pathetic to bizarre. The lives of Kaufman, Orlean's book, become strangely intertwined as each one's search for passion collides with the others'.",
    "reviews": [
        {
            "content": "Value and entertainment, surprise and delight. Layered, clever and funny . The whole way through. I never knew I was a Niclas Cage fan!",
            "review_date": "2023-02-15",
            "source": "rt"
        },
        {
            "content": "Nicolas Cage's best performance and Spike Jonze's best movie\n\nThis movie was based on the life of Charlie Kaufman, an esteemed director of spectacular and sublime films. Itself is an art-film which starts with inner monologues and vignettes, and then drives itself through surreal portions, while keeping the plot together. The performance by Nicolas Cage is remarkable, and truly heart-felt, exhilarating, and refreshing. Meryl Streep is heartwarming, as well. The ideas which drive this film make a point of sinking into the audience's mind with an outstanding soundtrack and delicate touches of dialogue and monologues which purvey the fragility of the main character's dilemma in his mid-life.",
            "review_date": "2022-12-31",
            "source": "rt"
        },
        {
            "content": "Startlingly original and superbly acted.  This movie is a real think-piece at times and the acting of Cage, Streep and Cooper is outstanding.  I would place this movie in my top 25 favorites of all time.",
            "review_date": "2022-12-03",
            "source": "rt"
        },
        {
            "content": "Nothing happens, everything happens. It's the story of the story and it keeps you stuck on the screen.",
            "review_date": "2022-11-29",
            "source": "rt"
        },
        {
            "content": "The best acting performances from Chris Cooper and Meryl Streep! With the best casting ever done in a movie! And the best movie screenplay ever adapted!",
            "review_date": "2022-11-25",
            "source": "rt"
        },
        {
            "content": "I don't see how any thinking person could find fault in this film. Every character is unlikeable and undesirable. Yet still, the artistry of it, the truth, the constantly mirrored self referentiality, they all make this film art for thought, rather than for aesthetic.",
            "review_date": "2022-10-16",
            "source": "rt"
        },
        {
            "content": "Journalist Susan Orlean wrote \"The Orchid Thief\", a non-fiction book published in 1998 that tells the tale of John Laroche.  Laroche is a horticulturist who had been arrested for poaching orchids in a protected Florida State Preserve.  Orlean become intrigued by Laroche's passion over these unique and exquisite flowers.  Later, film maker and screenwriter Charlie Kaufman would endeavor to adapt Orlean's book into a film, and it was this undertaking that ultimately led to his 2003 film, Adaptation.\n\nKaufman's Adaptation tells the tale of Charlie Kaufman (Nicolas Cage), a screenwriter hired to adapt a book called \"The Orchid Thief\", written by journalist Susan Orlean (Meryl Streep), into a screenplay.  The book explores Susan's journey of learning about horticulturist John Laroche (Chris Cooper), his passion of orchids and her exploration of what passion means.  \n\nI'm going to say it right up front, this film is bonkers… but in all the best ways possible.  It's genius meta cinema, and the acting is superb.  Cage soars playing both the self-loathing, self-doubting, sexually frustrated screenwriter Charlie Kaufman as well as Charlie's identical twin brother Donald.  Donald is a lighter character who doesn't take himself as seriously, and who is embarking on a career to be a screenwriter as well.  The many scenes between these two characters are wonderfully filled with Donald's joy and innocence being played off of Charlie's irritation and pessimism.  \n\nCharlie is experiencing writer's block as he tries to find the right angle to adapt Orlean's book.  Meanwhile, through flashbacks, we experience Susan Orlean as she meets the enigmatic John Laroche, and begins to see life through his unique perspective.  It isn't until the final arc of the film that the stories of all four central characters become intertwined.  At this point the film decides to go all-in with being off the wall!  I was mesmerized as the story's conclusion unfolded.  The experience was very similar to when I watched the Oscar winning picture, Parasite, and I found my self thinking, \"WTF is happening right now!!\"  This film was a seductively fresh and satisfying experience.  An admirable blend of storytelling and acting.  Bravo to all involved!",
            "review_date": "2022-10-13",
            "source": "rt"
        },
        {
            "content": "A movie so meta that when I think about it my brain itches",
            "review_date": "2022-09-11",
            "source": "rt"
        },
        {
            "content": "Meta. Pretty mind-blowing I think it requires a rewatch. Such a deep and funny and weird and mind expanding and at times cringe but funny... good stuff. Never seen any other movie like it",
            "review_date": "2022-08-19",
            "source": "rt"
        },
        {
            "content": "Spike Jonze directed Adaptation and Charlie Kaufman wrote it. The result of this collaboration screams self-indulgence and pretentiousness. The movie features strong performances from its excellent cast, but it is so annoying in its overly strange plot scenarios that were particularly infuriating in its chaotic second half. It's a disorganized, pointless mess of a film.",
            "review_date": "2022-07-07",
            "source": "rt"
        },
        {
            "content": "A slightly more enjoyable idea from writer charlie kaufman, who shows you can have fun breaking the rules of conventional writing....i just wish i had slightly more fun watching it.",
            "review_date": "2022-06-12",
            "source": "rt"
        },
        {
            "content": "A hilarious and indulgent look into artistic ego and writer's block.",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "Hi, guys.  I'm the mom/teacher that has altruistically come here to tell you, that honestly I'm not thrilled with some of these reviews you're not saying anything about the film, other than a sort of very cookie cutter description of the film that I could easily extract from Wikipedia. I'd like a more in-depth personalized review from some of you, now some of these reviews have been very helpful to read and have given me a greater appreciation for the film. That's all for now… thanks. BTW this movie is: melancholy for millennials, great job Charlie Kauffman. In the form of its earnest character Donald Kauffman played by the brilliant Yuri Orlov. I could undisputedly relate to his insecurities and existential dread and fear of abandonment and of the unknown etc. Where's Roger Ebert when you need him I genuinely miss that guy his reviews were actually helpful unlike the pretentious Pauline Kael.",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "As would be expected from a collaboration between director Spike Jonze and writer Charlie Kaufman, Adaptation keeps the viewer on their toes from beginning to end.  Nicholas Cage plays Kaufman, a screenwriter with writer's block desperately trying to put a unique but seemingly impossible spin on Susan Orlean's (Meryl Streep) The Orchid Thief, the true story of eccentric horticulturist John Laroche (Chris Cooper) and his theft of rare orchids from the Everglades.  A plot that seems incomprehensible in writing comes to life on the screen, a complex web of past and present, fact and fiction, and comedy and drama.  It's a joy to watch thanks to the ingenious script, strong performances (especially from Cooper), and its engaging characters.",
            "review_date": "2022-03-09",
            "source": "rt"
        },
        {
            "content": "This was the second time I watched this movies and I enjoyed it more this time than 10 years ago. Great characters and acting. Meryl Streep is amazing.",
            "review_date": "2022-01-07",
            "source": "rt"
        },
        {
            "content": "A stunning example of meta cinema. Kaufman himself being played by Mr.Cage could not have been better cast. The commentary on the writing process when adapting a book into a film worked so well given the ending indulging in the same cookie cutter sell-able action it was critiquing at the start. One of Kaufman's all time best.",
            "review_date": "2021-12-08",
            "source": "rt"
        },
        {
            "content": "Nicolas Cage's best role by far. One of the funniest and greatest, inventive and brills film ever made,",
            "review_date": "2021-11-08",
            "source": "rt"
        },
        {
            "content": "5/5.  A screenwriter's movie.  Well-acted, creative, and absolutely brilliant.",
            "review_date": "2021-10-27",
            "source": "rt"
        },
        {
            "content": "Only Charlie Kaufman could have written this. One can only sit back and shake one's head at a master and his dazzling bag of tricks.",
            "review_date": "2021-10-15",
            "source": "rt"
        },
        {
            "content": "You will never view a more original film. Adaptation is so mind-bogglingly, overwhelmingly creative its difficult to believe a film studio ever gave it the green light. Whether you like it or not is probably a matter of personal taste - but it's also by turns suspenseful and wickedly funny.",
            "review_date": "2021-10-04",
            "source": "rt"
        },
        {
            "content": "\"You are what you love, not what loves you.\" \nGod. This movie is very complex and I could see someone who is very impatient thinking this movie is uninteresting, but it is the complete opposite to us movie buffs. Cage's (Kaufman's) relationship with his twin brother is the relationship that really stood out to me in this movie. Knowing that Kaufman does not have a twin brother in real life makes it even more impressive that he could display the bond through his screenwriting so perfectly. The other relationship, between Streep and Cooper cohesively unfolds at the same time and adds more emotion to the story. The climax is unexpected and orchestrated well. The fact that Kaufman made a film about something that seems to be autobiographical but isn't really, is super creative and he deserves props as a screenwriter.",
            "review_date": "2021-08-06",
            "source": "rt"
        },
        {
            "content": "Adaptation is about as self-referential as a film can get. Cage plays the real-life writer of the film, Kaufman, but also his fictional twin brother. Full marks for creativity. At every turn, Kaufman includes the sort of self-critique and authentic voiceover giving insight into the creative process of screenwriting. This can become exhausting at times, but by design. A film about someone making a film about someone writing a book about an orchid thief could hardly be simple. Streep and Cooper also received acclaim and Cooper the Oscar for their involvements. Both roles provide plenty of opportunity for kookiness and unique events, although I did find their detached side of the story less interesting than Cage's superb work in the main roles. Tilda Swinton is really a superb actor. I wish that she could have had more to do. The same goes to some degree for Maggie Gyllenhaal, too. Cara Seymour's brief turn showcases her versatility in quite a departure from American Psycho. Adaptation is far from light viewing by any stretch of the imagination, but it succeeds to do a degree of self-awareness dodging any major over-indulgences or narcissism on Kaufman's part.",
            "review_date": "2021-07-28",
            "source": "rt"
        },
        {
            "content": "Clever, funny, and well executed. Charlie Kaufman doesn't disappoint.",
            "review_date": "2021-07-19",
            "source": "rt"
        },
        {
            "content": "\"Mom called it 'psychologically taut'.\"\n\nKaufman's meta exploration of filmmaking could very easily have been totally insufferable, reveling for a time in the noble suffering of (Nicholas Cage's fictionalized take on) the screenwriter's tortured intellectualism. But instead the writer delivers a great twist to his narrative, infusing it with unpredictability and charm that keeps you genuinely wondering about what will happen next while giving a bit of a satirical look in on the screenwriting process. Cage gives a great dual performance that takes advantage of his range without simply letting his manic side run wild, while Cooper and Streep deliver excellent characters with depth, nuance, and development.\n\nA darkly comic and original film that touches on a surprising range of themes without coming off as insincere, and is totally stacked with talent in the supporting cast. (4/5)",
            "review_date": "2021-06-30",
            "source": "rt"
        },
        {
            "content": "My favorite movie, I very much enjoy meta humor.",
            "review_date": "2021-06-23",
            "source": "rt"
        },
        {
            "content": "I had to give this one a lot of thought. Wasn't sure if I really liked it or not because it's a very bizarre movie. I was struggling between giving it a 3.5 or a 4, but stuck with a 4 in the end for several reasons. First, I actually find it genius to make a movie about a character who's one of the actual writers for the movie itself, and his struggle to write a book-adapted screenplay, and that screenplay is the actual movie the viewer is watching. Everything happening in the movie is what the character is actively writing in his script. Brilliant stuff really.\n\nI definitely enjoyed this way more than Being John Malkovich. Sometimes Charlie's low self-esteem and anxiety was cringe, yet Nicolas Cage still managed to give an excellent performance as did everyone else. It's got funny moments, sad moments, and sobering moments. All in all, I wouldn't mind revisiting this later on.",
            "review_date": "2021-06-19",
            "source": "rt"
        },
        {
            "content": "A masterpiece in every sense. It doesn't get much more meta than this. Kaufman's writing intricacies compliment the subject matter with Adaptation better than any of his other films. Cage does an amazing performance playing twins of rather drastic personas and it's arguably Streep's best role to date. Simply put, one of the best movies ever.",
            "review_date": "2021-04-05",
            "source": "rt"
        },
        {
            "content": "Adaptation features Nicholas Cage in dual roles.  Charles is 30ish, an established screenwriter who is overweight, balding, and painfully shy.  His twin brother Donald shares the same physical characteristic but is charismatic and a little dimwitted.  Cage is good in both roles.  As a writer, he struggles to adapt a popular novel into a screenplay.  This film explores the painful nature of the problem.  Meryl Streep is the book's author and is pretty good.  Rob Livingston has a small part as Charles' agent and is excellent.  There are some dark moments, but many more amusing ones.  The entertaining and creative nature of the writing really made this film.",
            "review_date": "2021-03-22",
            "source": "rt"
        },
        {
            "content": "Spike Jonze has incorporated pretty much all genres into this somewhat different film. Adaptation. contains both comedic and dramatic moments, followed by suspenseful scenes in some scenes that give off a thriller vibe. The main plot is quite simple. Screenwriter Charlie Kaufman is asked to adapt a best-selling novel about plants for the big screen. This seemingly impossible task leaves Charlie in despair, who is also struggling with heartbreak and unexpected headwinds from his twin brother Donald. The two of them, of all people, then set off together on a search for clues to finally make Charlie's screenplay film-worthy.\n\nBesides its interesting plot, the film shines in the performances of its cast. Nicolas Cage is called upon twice in the leading role, playing the twins Charlie and Donald Kaufman. His storyline initially plays out separately from the second major storyline in the film before they collide at the end. In both scenarios, Cage carries the film and gives one of his career-best performances. One always feels for his complex character. Cage's very transparent performance also means there is never any real confusion as to which of the two brothers he is. Meryl Streep and Chris Cooper are also terrific in the supporting roles of journalist Susan Orlean and plant breeder John Laroche, who gives her the idea for the book. Streep, in her role, despite her seemingly perfect life, is searching for a meaning in life, which she finds in Cooper's character's passion for plants during the course of her research. Cooper plays the somewhat down-and-out and slightly eccentric John, who finds a point of reference in Susan's finding after a tragic stroke of fate. The two build a fascinating chemistry with each other that is very exciting to follow, given the differences in their characters. The actors all rightly picked up Oscar nominations for their performances, with Cooper winning Best Supporting Actor for his authentic portrayal of a \"hillbilly\" written off in society.\n\nAs a film, Adaptation. has not received the same acclaim as its stars. This may be because the constant genre changes mean that it is not always clear what exactly the film is trying to say. It is also mainly the actors who bring us closer to the story, making it easier to follow. Actually, Adaptation. tells all kinds of stories. Failure, self-searching and above all passion in various forms. A big component is the plant, which is shown again and again and serves as a symbol of the film. After all, it is precisely this that brings the characters directly together and comprises the main plot. Adaptation. is a film that can hardly be broken down. This is probably due to Jonze's intention to give viewers room for interpretation. In any case, you have to concentrate well on this film to be on board with it.",
            "review_date": "2021-02-16",
            "source": "rt"
        },
        {
            "content": "Is a master class on scriptwriting.",
            "review_date": "2021-01-16",
            "source": "rt"
        },
        {
            "content": "i really loved Being John Malkovich so i thought i'd give this one a try; even though i very much dislike Nick Cage. i just can't take him. he's awful. & there's TWO of him in this film. i do really appreciate what this movie is doing/does & the weirdness factor was there... i either had too high of expectations for it when i started or it just wasn't my cup of tea. it was just okay for me.",
            "review_date": "2021-01-15",
            "source": "rt"
        },
        {
            "content": "Oh my! This is a film that I'd have happily walked out of the cinema half way through watching. Grim and incoherent!",
            "review_date": "2021-01-03",
            "source": "rt"
        },
        {
            "content": "Another beautifully quirky, masterful pairing of Jonze and Kaufman, only this time guiding an amazing dual performance from Cage. It's an honest depiction of the neurosis behind writing and trying to adapt material. This is the kind of film that truly inspires creativity.",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "Adapted is something similar to a satire about what some screenwriters believe is the complexity in a story. This is done through an interesting narrative, a story in which we do not find a relationship between one thing and another, but which is fascinating.",
            "review_date": "2020-10-30",
            "source": "rt"
        },
        {
            "content": "I often find when a film is recommended to me by many, or even if I am emphatically urged by a few, it can take me awhile to watch, I think primarily because the build up, more times than not, lends to disappoint due to the higher expectations. Adaptation has been hyped to me for so long and friends are generally shocked when I say I have never seen it, yet this film was still able to surpass all my expectations, providing an immersive and engaging experience that I will likely be unpacking for many days to come. Waiting to watch this until I too am approaching middle age definitely improved my reception as I found the characters, humor, and inner dialogue infinitely more relatable than I would have ten years ago. I won't be surprised if I find myself watching this one again soon.",
            "review_date": "2020-10-27",
            "source": "rt"
        },
        {
            "content": "Who wouldn't want to see two Nicholas Cage's in one film? Who wouldn't want to see Nicholas Cage's twin brother? Both Cages can only challenge spite and solemnness with  [Meryl] Streep's sting of sincerely insincere timbre and [Chris] Cooper's fetching fibre.",
            "review_date": "2020-10-18",
            "source": "rt"
        },
        {
            "content": "Great film. I think the unwary viewer could enhance the experience by first reading Susan Orleans' New Yorker article \"Orchid Fever,\" or even her book based on that article, \" The Orchid Thief.\"\n\nHow screenwriter Charlie Kaufman got the job to adapt the nonfiction tale into a screenplay is beyond me, but this film is the spectacular result.",
            "review_date": "2020-10-03",
            "source": "rt"
        },
        {
            "content": "If Being John Malkovich introduced us to the creative ideas of Charlie Kaufman and took us (fictionally) into the mind of John Malkovich the actor then Adaptation takes us into the mind of Charlie Kaufman himself. Of course, this is still only fiction and much poetic and artistic license is taken but Kaufman turns the tables onto himself this time and the results are just as creative and enjoyable. He even creates a fictional brother in Donald Kaufman (which the Academy even nominated as a joint writer when the Best Screenplay Oscar was announced). Kaufman is simply a master at creating a story where art imitates life imitating art. It's so cleverly done and effortlessly blurs the lines between fact and fiction such is it's astute and clever construction. Director Spike Jonze, once again, seems to be on the same wave length of Kaufman's ingenuity and the performances are fantastic. Chris Cooper won the Best Supporting Actor award but, in a dual role as Charlie and Donald, this is arguably the best work that Nicolas Cage has ever delivered. Another mind-bending treat from Kaufman.",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "This movie is so repulsive and so great on so many levels. At first I was going to say the movie had a bi-polar complex, but that is not true. It has highs and lows within seconds of each other. It has no idea where it is going. But Charlie states that a number of times. Unfortunately, or maybe fortunately, I do not see life as such a chaotic mess as is described in this movie. Then if someone does have a life like this do I want to know about it? Brian Cox's response to Charlies question in class expresses my sentiment exactly at that point in the movie. I felt like reaching through the screen and slapping the writer of this movie and Nicolas Cage on the backside of the head. \nThough at this point I also had a vision that was quite unexpected. Meryl Streep is such an unappealing female. Her public views intensify how unattractive she is also. I suppose she fits the repulsivness of the movie... BUT. I was absolutely shocked to see her in an attractive female form in many of her scenes. She came across sexy and very flexible, hmmm. How? Somehow she expresses femininity. That was a shocker. but then she lets out ...\nThen there is Nicolas Cage's portrayal of his character. I know writers and none of them are as repulsive as that. In fact, some of the female writers are downright sexy and none are as unattractive as the movie portrays.\nWe are a voyeur in these peoples lives. The wonderful part of this movie, when it is present, it presents the wonderful nature of people. Unfortunately, every good moment is mixed in with the repulsive. Its like a mixed bag of nuts with too many of the nuts you do not like.",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "A very well-written and unique comedy-drama about the fictionalized true story of writer Charlie Kaufman's struggles of adapting The Orchid Thief with its smart and witty dialogue, odd sense of humor, affecting drama, great direction by Spike Jonze, and great performances from Nicolas Cage, Meryl Streep and Chris Cooper. Possibly my favorite from Kaufman's work.",
            "review_date": "2020-09-06",
            "source": "rt"
        },
        {
            "content": "how much of it is real? What's the fictional part? And where is the line between fiction and reality? I'm sure those are the questions most of the audience made, \nbut for me the question is: did Kaufman write the screenplay he wanted to write? Or does the movie work because he didn't?",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "A self-conscious comedy drama metafilm about the difficulties of the screenwriting process, that's multilayered, funny, insightful, thoughtful, inventive and complex, and features excellent performances, a stylish direction and a poignant script.",
            "review_date": "2020-08-23",
            "source": "rt"
        },
        {
            "content": "I came away with the idea that The Orchid Thief must be what screenwriters consider an unfilmmable book. The best solution Kaufman could come up with was to make his screenplay about his writing process and it definitely works.",
            "review_date": "2020-07-30",
            "source": "rt"
        },
        {
            "content": "Original yes. But a masterpiece no",
            "review_date": "2020-07-29",
            "source": "rt"
        },
        {
            "content": "I'm reacting the way the world does to movies about making movies about making movies. I mean come on, Charlie Kaufman, some of us have work in the morning, damn.\n\nFinal rating:★★½ - Not quite for me, but I definitely get the appeal.",
            "review_date": "2020-07-26",
            "source": "rt"
        },
        {
            "content": "I forgot just how great this movie is.  A truly great and entertaining, artful movie that can be enjoyed by many different types of people.  I don't throw around praise and good ratings lightly, but this really is one of the more genius movies you will ever see because it keeps your attention where every other movie doesn't. \n\n4 1/2 of 5",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "The performances are strong but the story is all over the place and far too odd.",
            "review_date": "2020-06-30",
            "source": "rt"
        },
        {
            "content": "Hilariously meta comedy dizzyingly original creative process for adapting a book you don't know how to adapt with a tongue-in-cheek third act. Not SUPER rewatchable, but when you're this good, casting Nicolas Cage as yourself as yourself... I mean, that's a 10 right there on the insane-o-meter. 10/10.",
            "review_date": "2020-05-31",
            "source": "rt"
        },
        {
            "content": "The irony of this film is that I would recommend it to any exploring filmmaker, writer or any lover of film itself. It's a rule book on breaking rules. \nIt's a perfect film about writing, about brothers, about eschewing expectations, about rules and relationships and about adaptation itself.\nI used to think it was a bit ugly and a bit visually plain, but watching it back, I was wrong; it effortlessly frames its story in a harmonious and subtly creative way in Spike Jonze's typically understated quality. \nUndoubtedly one of the most unique films ever made and still one of Cage's best performances, and not only that, but one of the best acted and edited films where an actor plays opposite himself with not even one hint of dodgy camera work or stilted acting or pacing, it's really something. \nIt's a hilarious and informative and engagaing film that manages to make a superb story around source material that is arguably unfilmmable. But Kaufman knows that all stories about anything, are about someone more than some thing, from Orleans' book about both LaRoche and herself, or Adaptation, about Kaufman himself. Charlie the man has found his connection between himself and the Orleans the woman and as such he has found the human story and brought it out into what has turned out to be a unique and perfect adaptation.",
            "review_date": "2020-02-10",
            "source": "rt"
        },
        {
            "content": "never felt this way b4",
            "review_date": "2020-02-02",
            "source": "rt"
        },
        {
            "content": "Another Nic Cage classic. Charlie Kaufman kills.\nDude is hired to adapt a book and the result is basically this movie.",
            "review_date": "2020-01-09",
            "source": "rt"
        },
        {
            "content": "The writing process is difficult to portray on screen or to describe to an audience but this film is all about the torture of being a screenwriter with writer's block and what this can inspire. There is a meta quality to the film as it was inspired by screenwriter Charlie Kaufman's own writer's block and he chooses to insert himself as a character into the film and take real life figures and tell a completely false story about them. The audacity of the film should be applauded but the fact that the film takes so many risks and actually sticks the landing is thrilling as it should inspire many screenwriters to write more imaginative films that remain personal and true to their own experience.\n\nConstantly nervous screenwriter Charlie Kaufman, Nicolas Cage, is facing writer's block as he attempts to adapt \"The Orchid Thief\" written by Susan Orlean, into a film. He sexually fantasizes about the author but is too shy to romantically pursue her or producer Valerie Thomas, Tilda Swinton, while his twin brother Donald, Nicolas Cage, is ignorant but blissfully happy as he writes screenplays for formulaic action thrillers. Meanwhile the real life Orleans falls in love with orchid stealer John Laroche, Chris Cooper, and the two begin taking drugs and having intense sexual relations. Kaufman's finds success in inserting himself and his brother as characters into the screenplay but he begins to investigate Orlean and when he discovers her romance with Laroche the couple are quick to attack him. He finds catharsis through completing the screenplay and is free to pursue relationships and reconcile with the idea that while his brother does not produce high art he is emotionally fulfilled. Donald and Laroche die and Orlean is arrested but Kaufman walks away having learnt about life and as a better screenwriter.\n\nBeautifully the film connects it's two plot lines at the beginning of the third act as we witness the way in which Orlean's forbidden attraction to a wild man has turned her crazy while all of the clichés that Kaufman had scoffed at are put to use in the chase scene at the end of the film. This is such a delightfully nutty scene because we do not expected the buttoned down, passionless New York author to lose herself so completely to a hedonistic lifestyle. We witness her taking drugs and having a late night conversation with Laroche in which she lets personal details slip out but she still retains the façade of a city sophisticate. The passages of the film in which we hear Streep reading aloud her character's writings as she finds enthusiasm and zeal for something real for the first time in her life. Her love for the unlikely Laroche is connected to this of course because he is the one who has brought her into his crazy world and so the final act is both unexpected and completely understandable.\n\nFortunately this is one of those self referential Hollywood films that is not relentlessly self pitying like Stardust Memories (1980) but able to poke fun at the trope of the self serious writer facing a lack of creativity. We are invited to see the flaws in Kaufman in a way that does not feel cruel but self aware as we can laugh with Kaufman as this meta version of him complains about the fakeness of modern films but is desperately unhappy writing supposedly ‘deep' movies. He does get his happy ending but it comes at a great cost and he and the audience are genuinely traumatized by Donald's untimely death. Through his brother Kaufman has gained so much and with his loss he realizes that he needs to take on his brother's best qualities so that he can live his life as a joyful man and a good writer.\n\nCage, Streep and Cooper are essential to all this as they have a vitality about them that makes them thrilling to watch and all three seem to be having a great deal of fun. Streep in particular takes on an unusually batty woman and brings her to life as she begins the film like her character in The Hours (2002) and is then scarily convincing as a woman gone wild. Cage is a fantastic actor and while I could see Tom Hanks taking on this dual role I believe that Cage injects a certain level of manic intensity to the performance that suits the wackiness of the film. Cooper was the only one of the three to earn an Academy Award and he deserved it as he made his character much more than the stereotypical hick that he could have been and we grow fond of him as his vulnerability is slowly drawn out.",
            "review_date": "2019-12-25",
            "source": "rt"
        },
        {
            "content": "Layers of meta like dreams in Inception. Could go tit-for-tat in a meta-off with Synecdoche, New York. Okay enough of that. I love this movie and think it might be Nic Cage's best. The opening monologue is ASMR for the self-loathing. It hits all the senses and everyone is good in it. A must-watch.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "Adaptation is a good film primarily because of the genius of its writer Charlie Kaufman. I won't say much as it would entail spoiling the plot but this is a weird film and one I presume psychologists would love. The movie comes across as chaotic, which I'm sure is intentional. With the multiple storylines, there's too much going on, and this damages Adaptation's structure. Jonze does his best to bring a kind of order to the proceedings, but there are times when things get away from him. And there are instances when the movie comes across as being a little too clever. Regardless of whether you appreciate the movie or not, it's likely to stay with you. An hour after seeing Adaptation, I was still wondering exactly what the hell I had seen and whether I liked it or not. For fans of Charlie Kaufman and the bizarre worlds he creates Adaptation is soothing, for others- well, it really depends.",
            "review_date": "2019-10-23",
            "source": "rt"
        },
        {
            "content": "It's funny because what Charlie thinks about sometimes, everyone definitely has gone through in there life. It's relatable in that sense. I find it interesting learning about the ghost orchid and the passion that the toothless guy has for his flowers. I can definitely relate to his dreamy situations that he has with other girls that he meets in life. \n\nIt's crazy how things got so real once the toothless dude started talking about the accident he had with his mom and wife in the car. The way Charlie kind of spirals out of control and keeps relentlessly doubting himself reminds of the whole tortured genius theme. \n\nWhat's interesting to see is that the more Charlie learns about the relationship between Susan, John, the book, his screenplay and life, the more he gets in tune with not only writing but also life. We all need some sort of inspiration and most times the best types of inspiration are from somebody. in this case Mr. McKee. \n\n\"You are what you love, not what loves you\". That's dope. I loved watching the bond and relationship between Charlie and his brother Donald unfold, especially towards the end. It's beautiful to see how Charlie adapted the lighter and happier side of his brother. \n\nI think most people like to say that Nicholas Cage is crazy or he's just overacting - I think he's brilliant with his acting. He definitely proves it here. There's some pretty deep layers to take away from this movie that I have yet to unravel. There's a lot of metaphors and symbolism in the movie. \n\nThe movie was brilliant! I always love it when a movie can surprise me with how good it is. I will be watching it again so I can dissect it some more.",
            "review_date": "2019-08-07",
            "source": "rt"
        },
        {
            "content": "I don't know what to say about this movie. I also don't know how to put it in a review and writing. With such a unique premise, \"Adaptation\" is brilliantly a great movie that tells about writer's block in an unconventionally way. It's like a confusion that's whether this is real or fiction. Obviously, you are watching this film while. The acting especially Streep and Cage are so phenomenal especially Cage as two characters. So, how do you close this? It might sound like this: \"Adaptation\" is a recommended movie.",
            "review_date": "2019-06-13",
            "source": "rt"
        },
        {
            "content": "An inventive, unconventional film.",
            "review_date": "2019-02-27",
            "source": "rt"
        },
        {
            "content": "Highly entertaining!",
            "review_date": "2019-02-23",
            "source": "rt"
        },
        {
            "content": "Unique and unbelievably original - like everything from the mind of Charlie Kaufman.  This film is not for viewers who like to watch things on auto-pilot.  Funny & thought-provoking, Adaptation is an unpredictable wild ride of epic proportions.  Stellar performances by Meryl Streep and Chris Cooper take the film to another level.",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "A movie about turning a book into a movie.  Clever, witty, with a great cast.",
            "review_date": "2019-01-31",
            "source": "rt"
        },
        {
            "content": "Superb screenplay writing by the great Kaufman. Also one of the finest performances by Nicolas Cage. Brilliant originality. Anyone remotely interested in ever being a writer will be in for a treat watching this awesome film.",
            "review_date": "2019-01-15",
            "source": "rt"
        },
        {
            "content": "Another classically written movie by Charlie Kaufman, Where there is poison there is passion, where there is passion there are clones.. Where there is poison there is elixir, where there is elixir there is love...",
            "review_date": "2019-01-11",
            "source": "rt"
        },
        {
            "content": "From the first scene of the movie I knew I stumbled upon something special with this one. This is by far one of Cage's best roles and Charlie Kaufman really wrote a masterpiece with this one. The script is so smart, while also funny, It just doesn't disappoint one second. The movie predicts it's own actions half of the time and also breaks it's own rules and creates a fast-paced mind-blowing experience that has led me to come back several times to it already even though the first time I saw it was only about a year ago. This is just great and you should watch it, that's all I can say about it.",
            "review_date": "2018-09-24",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 7.5\n\nAudaz, inteligente, introspectiva, valiente y profunda.",
            "review_date": "2018-09-06",
            "source": "rt"
        },
        {
            "content": "Spike Jonze's projection of a screenwriter's mind resulted as a thoughtfully entertaining perspective, with some amount of inspiration, as a cinematic behind-the-scenes look that mixes in well-performed dueling dual psychology in approaching a source material. (A-)\n\n(Full review TBD)",
            "review_date": "2018-08-05",
            "source": "rt"
        },
        {
            "content": "Adaptation starts out as an entertaining metafilm but eventually unwinds into a gimmicky mess.",
            "review_date": "2018-04-29",
            "source": "rt"
        },
        {
            "content": "Overrated.  Don't waste your time.",
            "review_date": "2018-03-29",
            "source": "rt"
        },
        {
            "content": "i'm a walking cliche..\n\nAdaptation\n\nThe eerie perspective, bold plotline and a potential premise are the high points of this feature which unfortunately is supervised without any care and hence fades off into just a mere blurred out idea in this overlong feature. Spike Jonze seems a bit distracted from the main track and hence leads it into a boring ride that may have an interesting climax but the journey is certainly not worth it. The performance objective is completely satisfactory in here for Nicolas Cage and Meryl Streep both are putting all their chips in and delivers what is essential. Adaptation might be something plausible on terms of art and craft but when it comes to blend all it in and offer intriguing and gripping tale along with entertainment to the audience, it fails on all levels.",
            "review_date": "2018-03-16",
            "source": "rt"
        },
        {
            "content": "Slow moving. predictable",
            "review_date": "2018-03-10",
            "source": "rt"
        },
        {
            "content": "didn't really get it. a bit strange",
            "review_date": "2018-02-28",
            "source": "rt"
        },
        {
            "content": "Cooper & Streep are great",
            "review_date": "2018-02-10",
            "source": "rt"
        },
        {
            "content": "The Kaufmans deliver an endlessly clever script that's handled surprisingly well by Jonze. Nicolas Cage delivers not one, but two brilliant performances in this movie. It's funny, intelligent, relatable, original and nearly flawless.",
            "review_date": "2018-02-04",
            "source": "rt"
        },
        {
            "content": "Adaptation's first 55 minutes are a funny and quirky, if a bit cliche, light hearted drama where Nicolas Cage kills it as both Charles and Donald Kaufman. But once that 55 minute mark pasts, it turns into a fucking mess that asks you to suspend disbelief more than a 90s pro wrestling special would. And I don't give a crap what the hidden meanings or real life parallels or symbolisms are supposed to be. Frankly that could've been done a lot better too.",
            "review_date": "2017-12-30",
            "source": "rt"
        },
        {
            "content": "Worth a rewatch or two to discover the nod and the wink from one of the best screenwriters (and his brother) ever.",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "super boring and terrible. useless. i watched the second half on 2.0 speed or else i was going to quit (1 viewing)",
            "review_date": "2017-11-28",
            "source": "rt"
        },
        {
            "content": "I had heard of it but never saw it.  Oops!  Nick Cage is perfect for the role/s.  It is definitely Nick Cage doing his thing.  Maybe it evens out some of his less than stellar performances but this one is good.  The story is very well written.  Consider it a Must See.",
            "review_date": "2017-10-24",
            "source": "rt"
        },
        {
            "content": "While you may have trouble with this film upon first viewing, if you have not seen \"Being John Malkovich,\" or don't know the history of the production as a movie option of \"the Orchid Thief,\" do yourself a favor and familiarize yourself with both. Knowing that additional material makes this film even more amazing than it already is. The soundtrack is phenomenal. The only problem with the film is that it is such tour de force that it cannot hope to sustain itself anymore than a hurricane can continue forever anywhere but Jupiter.",
            "review_date": "2017-10-21",
            "source": "rt"
        },
        {
            "content": "In a movie about adaptation, I found irony in the fact that the story was awful.\n\nA self loathing screen writer mixes the adaptation of a book about a flower thief with his self loathing, jealous, constantly masterbating life. The only way to describe the pace of the movie is agonizing. Solid character acting from Nicholas Cage, Meryl Streep and Chris Cooper saved the movie from a \"worst of all time\" category.",
            "review_date": "2017-10-12",
            "source": "rt"
        },
        {
            "content": "Cozy fun provocative story that you can drink Chai Tea while watching & nuzzle up with Meryl Streep & Nic Cage characters cuz Chris Cooper will keep ya on edge for sure but the neurotic Cage character although a frenetic mess, he has a certain warmth oozing from him",
            "review_date": "2017-09-03",
            "source": "rt"
        },
        {
            "content": "A somewhat difficult film to grasp when you add the non-fiction reality of Cage's role and his relatable performance.",
            "review_date": "2017-09-02",
            "source": "rt"
        },
        {
            "content": "Brilliant. Charlie Kaufman hilariously describes his own account of writer's block in a deep and emotional way. Well-acted by Nicholas Cage playing the lonely, desperate Charlie at the same time playing his confident two brother. The third act was brilliantly done, a smart move from writer Charlie Kaufman. I suggest this movie to everyone, especially screenwriters.",
            "review_date": "2017-08-31",
            "source": "rt"
        },
        {
            "content": "This film was boring as hell with Nic Cage as weird as ever.",
            "review_date": "2017-08-30",
            "source": "rt"
        },
        {
            "content": "I didn't love all the stuff from Meryl Streep's storyline, but Nicolas Cage's storyline was great, excellent! Outstanding performance from Nicolas Cage, playing two roles! Lots of great cameos! Kind of funny at times. If the Meryl Streep storyline hadn't been interrupting Nicolas Cage's, I would have laughed at his more, because the brothers were hilarious! I can't really recommend this, because you'll keep getting interrupted when you're super interested!",
            "review_date": "2017-08-21",
            "source": "rt"
        },
        {
            "content": "It has one of the greatest screenplays of all time, and a delicate performance by Nicholas Cage, with a fantastic study of a writer's psyche.",
            "review_date": "2017-08-19",
            "source": "rt"
        },
        {
            "content": "Adaptation is the most personal film Charlie Kaufman has wrote. I would've never thought Nicholas could portray Kaufman's madness amazingly until now. It's hard to separate what is true and what is fiction in the film since it's based on Charlie's experience on adapting the book, so I had to do some research on it. I didn't enjoy the last act because it goes into a total predictable Hollywood thriller, but you can tell Charlie was mocking the films Hollywood executives love The movie even slowly starts to transform into a generic Hollywood film after we're introduced to Donald's screenplay. Adaptation is Kaufman's worst work, but it's still a masterpiece of a film.",
            "review_date": "2017-08-13",
            "source": "rt"
        },
        {
            "content": "Unparalleled chemistry between Cage and Cage as the twins in a film straight from the head of the king of originality, Charlie Kaufman.",
            "review_date": "2017-08-06",
            "source": "rt"
        },
        {
            "content": "Few directors in the industry today have the ability to convey cinematographically the scripts of Charlie Kaufman, Spike Jonze is one of them. \"Adaptation\" is a film that surprises by its narrative supported by good performances and a technique aligned to the script. Telling a story that is adapting as the book progresses, the script is confusing to the viewer at first glance, but reaches a great brilliance if the viewer of a second chance for the work, the script tells a story of an antisocial screenwriter Who is unable to see his qualities and practice social interactions because of this, his twin brother that the only thing he knows is to find these qualities in his brother and has a filter in his vision that inhibits him from proceeding unless it is in his brother's footsteps , A successful journalist who ends up discovering that she does not live life to the full, and a man full of random passions that makes the journalist question his sense of love, life and society, are four very interesting characters, different and at the same time Is completed in a drama where one is based on the other to tell his story. The man of various passions, John Laroche (Chris Cooper), he really discovers a passion and a sense in life, and this inspires journalist Susan Orlean (Meryl Streep) to write a book about him, which in turn inspires The rhetorician Charlie Kaufman (Nicolas Cage) to write a screenplay for this book, which for his time inspires Donald (Nicolas Cage) to become a brother-inspired screenwriter. Each one lives his story, and each one has its problems, but from the moment a character disengages from the social bubble and discovers a passion generates an excess of discomfort and curiosity in the characters, the film deals in its principle on the lie, The band of Laroche revolves around an orchid, not because of its beauty, but rather to extract drugs from it, Kaufman makes a mess and proves that all the characters without exception are completely lost in their sense of life, and even Who finds it, is a lie, because the passion of Laroche, is a lie. Kaufmann still jokes about making a concept art film and not appealing to sex, guns and explosions, but ends up appealing to sex, guns and explosions, because he discovers that life is not as boring as he imagined, things happen, unexpected paths are Traces, people die, life changes, and include sex, weapons and explosions was part of life, carrying, was part of his script. Kaufman takes the film as Stephen King, a whole narrative and made bow, characters are fully developed, and when the element of supernatural appears, it really frightens, as it is not what we were expecting, in the scripts of Kaufman, when the madness arrives, She picks us up completely and leaves us bewildered, this is yummy and it happens this long several times. Technically the film is good, it has a soundtrack that mixes common pop sound, has a clear photograph, Spike Jonze is much more contained in this film, and does the basics without trying a lot, but does what it has to do, it is difficult to guide the Acts of the film or talk about the rhythm of it, because it gains pace and loses, wins and loses .... Nicolas Cage is fine and Meryl Streep also, nothing of great performances, although I think that Chris Cooper steals the scenes always that shows. \"Adaptation\" is Spike Jonze's second film, where he lets the rhetorician's work stand out over his direction - of course, he has adapted a wacky script with extraordinary competence - nor does the rhythm problems spoil the film at all, The film has a perfect message and can be taken a million interpretations of it, unfortunately many will misinterpret the third act, and take away the seriousness of the long classifying it as any crazy comedy, this is sad, it could be different, but it is a Great movie and deserves to be seen and reviewed.",
            "review_date": "2017-07-07",
            "source": "rt"
        },
        {
            "content": "Subverting the rules for creating a roadmap, is often the very path of affirmation of such rules. For in the end everything is just a process of adaptation.\n\nThe kaleidoscope of metalanguage presented in the film, are presented and used with mastery, either at the beginning of \"Adaptation\" which is linked to the term \"Being John Malkovich\", both directed by the distinguished Spike Jonze. Still on metalanguage, which is about an adaptation of a book to a cinematographic script, which is created simultaneously with the film itself, ie a film about itself, as a joyfully self-referential exercise of self-deconstruction. But it is also, more profoundly, a film about its own non-existence - a narrative that confronts both the impossibility and the desperate need to tell stories provokes our expectations of coherence, plausibility and fidelity to the reality lived.\n\nThere are variety of games presented in the film are dominated by the restlessness of knowing what is real what imaginary, what in fact thinks Charlie Kaufman, movie roter and what in fact thinks or thought Susan Orlean, when writing the book \"The Orchid Thief \"that inspired the film. What script rules are actually followed, ignored, and subverted? And that in the film are presented and worked through the figure of the writing twins Charlie Kaufman / Donald Kaufman (Nicolas Cage) and scriptwriter Robert McKee (Brian Cox).\n\nSo well adapted to this story are the actors, who in addition to acting are guides who invite us and lead us to organize the fragmentary data of the film. If in the figure of the twins writers we have two sides of the same man, and that in \"Adaptation\" is referenced like the opposites of the same figure of a policeman and a bandit, where both are complementary. If the script uses these two men to present the diversity of the same man, we have in Susan Orlean (Meryl Streep) the perfect adaptation of the divergences that fit in a single person, of how human and fragile and volatile and how the process Of adaptation of a person is not necessarily followed by completely philosophical or psychological questions, are in the measure, impulses of an immediate action. The character Susan surprises with her abrupt change in the end and unpredictability of her attitudes, though consistent, without script or construction failures.\n\nThe use of the pace in \"Adaptation\" is undoubtedly an important and necessary point to tell this story, Jonze with his experience in clips and series for MTV, was able to absorb the freshness of a stormy pace that assists in the complexity of moments lived by Charlie and Susan or in moments of lull and mockery of Donald's life as well as in the great final Match Point, a frenetic, accelerated jab of actions and images, but which unfortunately comes out too much, unnecessary, in trying to present solutions that lead to an outcome.\n\nAt first, Charlie's overly self-conscious and pseudo-intellectual crises are fun as we recognize the same tendencies in ourselves. So we also feel his yearning when he is so touched by a book that it looks like it could be the catalyst to kick him out of his narcissistic lifestyle. That is, until Kaufman reveals his great epiphany - that even after enlightenment, life is still cheap and dirty. What is not true or absolute lie, but turn into two hours of a film, where director and screenwriter apparently dialogues with each other and the public is the passive stance to accompany their discussions.",
            "review_date": "2017-06-16",
            "source": "rt"
        },
        {
            "content": "Interesting concept, poorly and self-indulgently executed.",
            "review_date": "2017-05-17",
            "source": "rt"
        },
        {
            "content": "Levels and levels and levels of meta. And then some more levels.",
            "review_date": "2017-05-06",
            "source": "rt"
        },
        {
            "content": "Adaptation is a great movie, is a great way of telling how Charlie Kaufman became himself, it always makes you think about what's real and what isn't real, and it has such a smart script",
            "review_date": "2017-04-20",
            "source": "rt"
        },
        {
            "content": "Quite interesting but never astonishing.\nSPOILER ALERT:\nThe main character laughs at the idea of using the multiple personality disorder motive or the serial killer motive in a screenplay because it is overused. Well, the movie itself uses the motive of a writer having a hard time producing his work and in the end writing about his struggles instead. Isn't this idea also a bit overused?",
            "review_date": "2017-03-29",
            "source": "rt"
        },
        {
            "content": "Had to watch it twice to fully appreciate it, like most of Kaufman's brilliant films. One of the greatest film writers of our time, period.",
            "review_date": "2017-03-04",
            "source": "rt"
        },
        {
            "content": "Spliced compartmentalisation.",
            "review_date": "2017-02-21",
            "source": "rt"
        },
        {
            "content": "It offers an odd premise that may not be suitable for every kind of audience, but an incredibly smart script, an original idea and the always admirable direction of Spike Jonze makes for a delightfully weird ride, along one of Nicolas Cage's best performances in years.",
            "review_date": "2017-01-29",
            "source": "rt"
        },
        {
            "content": "Brilliantly clever!  The recursive plot is a treat.",
            "review_date": "2017-01-28",
            "source": "rt"
        },
        {
            "content": "Loved it!  Loved the characters, loved the whole idea!  Adapt and change, adapt and change.....",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "Outstanding acting from Cage and Streep, a great plot with a fantastic and thrilling ending.",
            "review_date": "2017-01-06",
            "source": "rt"
        },
        {
            "content": "This was weird. Didn't liked it at all",
            "review_date": "2016-12-23",
            "source": "rt"
        },
        {
            "content": "Sure, it's clever--but there's not much more than that to warrant a viewing. The third act drags, the acting feels off, the characters are one-dimensional,  and the film looks like crap. You can argue that's all intentional--but why suffer just so a writer can feel smart?",
            "review_date": "2016-11-29",
            "source": "rt"
        },
        {
            "content": "Very good movie with an excellent plot with great acting by Nicolas Cage.",
            "review_date": "2016-11-19",
            "source": "rt"
        },
        {
            "content": "Delightful and exciting. I won't properly judge this film until I've seen it a dozen times. Which I intend to do.",
            "review_date": "2016-10-25",
            "source": "rt"
        },
        {
            "content": "This movie is tons of fun for just how meta it is. I love the way Charlie Kaufman's mind works. While it's not his best, and I think I like it a little less than other Kaufman fans seem to, it's still very very good and well worth watching.",
            "review_date": "2016-10-10",
            "source": "rt"
        },
        {
            "content": "Exceeding his previous hit \"Being John Malkovich\", Spike Jonze's \"Adaptation\" is another successful genre blend with an equally strange screenplay and a superb trio of performances.",
            "review_date": "2016-08-22",
            "source": "rt"
        },
        {
            "content": "One of my top 10 favorite movies of all time.",
            "review_date": "2016-07-17",
            "source": "rt"
        },
        {
            "content": "I went in thinking this was going to be one of those movies where an author writes things and the things they write come true. Like Simon, the chalk drawing boy but shedding hair into a typewriter. You have to forgive me, but the blurb printed on the back of the movie's case is very misleading in that respect. It's not about an omniscient author, it's nothing but a very long thought piece on nebbishism. It's almost comedic in some spots. The first third starts off and stays very boring, and then it suddenly dawns on you that the movie is either going to end abruptly or it's going to go on for a very long time. You almost feel a second wind coming on, as your brain fires up trying to figure out and predict how exactly the author expects to save this sinking ship of boredom in an interesting way. The author does not manage to do so. The film just gets cheaper and cheaper as the ship sails further out into the harbor. It comes across as overdeveloped and yet completely unfulfilled. It tries to say profound things but chokes on a glass of its own piss. You start off feeling like maybe you've finally got the actor Nicholas Cage figured out -- maybe there is some method to his choices of what to act in, and maybe there is some tow line that drags all those movies safely back to harbor -- but by the end of the film you're just wondering why the movie was even made to begin with. 3/5",
            "review_date": "2016-07-08",
            "source": "rt"
        },
        {
            "content": "Non avendo idee riguardo la sua stessa sceneggiatura Charlie Kaufman ci regala un film che descrive il suo tormento con una sincerità fuori dal comune. La storia di questo film è qualcosa di estremamente innovativo e usa un espediente narrativo che personalmente non avevo mai visto in nessun film. I personaggi sono interessanti e ben sviluppati, il film in generale è molto divertente e provocatorio e penso che la sceneggiatura sia una delle migliori che io abbia mai visto. Di sicuro uno dei film più particolari del ventunesimo secolo (finora) che merita di essere visto da tutti gli appassionati di cinema.",
            "review_date": "2016-05-31",
            "source": "rt"
        },
        {
            "content": "At one point during his career, Charlie Kaufman attempted to adapt the novel The Orchid Thief to no avail, largely thanks to writer's block. Adaptation follows an exaggerated attempt of Charlie Kaufman attempting to adapt the novel The Orchid Thief to no avail, largely thanks to writer's block. The film, if you haven't guessed by now, is impressively meta, and that results in a very unique product, to say the least. There's two halves to this story: the half dealing with Charlie and his brother Donald (a fictional character created for the film) is the kind of intellectual material you expect from Kaufman, but the other half dealing with Susan Orlean (author of The Orchid Thief) and Jon Laroche (\"the orchid thief\") is strangely lacking in emotion or any compelling elements, really. This results in a product that feels weirdly inconsistent, not to mention lacking focus. Nicolas Cage is astounding in a dual role as both Charlie and Donald, and really proves his acting potential. Same goes for Chris Cooper, who does well with the material he's given in the aforementioned lesser half of the film. Meryl Streep, on the other hand, is mostly emotionless; it's hard to tell if this is Streep's performance or the character herself, but it's just lacking in a way that you don't expect from someone like Streep. For all of its faults, Adaptation is a special little film, and is definitely worth watching.",
            "review_date": "2016-04-30",
            "source": "rt"
        },
        {
            "content": "Remarkable film-making and realistic performances.",
            "review_date": "2016-04-30",
            "source": "rt"
        },
        {
            "content": "Adaption. (2002) ????\nWow. I mean wow!       Best. Movie. Ever. Okay maybe not, but it's still pretty good . . . if you thought BEING JOHN MALKOVICH was original (and it was) wait and see what other amazingly inventive goodies the widely imaginative Spike Jonze has up his sleeve. Try to understand this: a strange but brilliant screenwriter tries to devise a screenplay based on a book about flowers. But you'll have to watch it you really understand it. Cage, playing two roles, is simply superb, and the screenplay has an unbelievably complicated (but fascinating) subtlety about it (watching it feels like the movie knows you're watching it, and shows off its genius, almost with ease). Best of all: It's not cynical! Chris Cooper won Supporting Actor Oscar, but where's Cage's award?",
            "review_date": "2016-04-30",
            "source": "rt"
        },
        {
            "content": "This unusual comedy-drama is both strange and quirky in the way that it presents itself as a film, involving a clever screenplay with two interwoven parallel stories. Once I adjusted my mind and clicked into the film, it was interesting and offered a few golden moments where the characters were speaking to themselves and divulging their inner vulnerabilities and secrets. But unfortunately this wasn't sustained and the last section of the film saw a marked change in plot and momentum, resulting in B grade film plot points verging on the improbable and the ridiculous. 1001",
            "review_date": "2016-04-22",
            "source": "rt"
        },
        {
            "content": "one of my favorites!",
            "review_date": "2016-04-03",
            "source": "rt"
        },
        {
            "content": "I imagine it's the best movie about screenwriting ever written. Nicolas Cage plays screenwriting twins. One of them has writer;s block and talks about what the script shouldn't be. He's left with nothing. Don't miss the scene when the voice over betrays the aciton on the screen. We believe what we see over what we hear.",
            "review_date": "2016-02-13",
            "source": "rt"
        },
        {
            "content": "I'm conflicted about Adaptation. On one hand, I can appreciate how it portrays the creative process and the meta storytelling aspect of the film. On the other hand, it's pretty pretentious and unrelatable at times. Nicholas Cage does a good job, though. His performance is oddly mesmerizing. Nevertheless, I don't think I'll be watching this movie again.",
            "review_date": "2016-01-16",
            "source": "rt"
        },
        {
            "content": "Utterly wonderful film",
            "review_date": "2016-01-10",
            "source": "rt"
        },
        {
            "content": "Within the first two minutes, I thought to myself, \"This. Is. Brilliant.\" If Aaron Sorkin is a writer who makes you use your ears from start to finish, Charlie Kaufman makes you use both your eyes and ears, stimulating your senses visually and aurally. Great performances all around (Nicolas Cage is terrific), great visual style, and it's both hilarious and thought-provoking. Adaptation is a great film.",
            "review_date": "2016-01-03",
            "source": "rt"
        },
        {
            "content": "Such an irony to say that this film is so original.",
            "review_date": "2015-12-12",
            "source": "rt"
        },
        {
            "content": "saw it when it came out, in theater.  As i recall i found it very confusing.  And the writer in the movie supposedly wrote the movie Being John Malkovich, which IS a real movie?",
            "review_date": "2015-12-07",
            "source": "rt"
        },
        {
            "content": "Being a satire of boring cliché thrillers, this movie is just as boring.",
            "review_date": "2015-11-12",
            "source": "rt"
        },
        {
            "content": "The scrip in this movie is probably one of the best of all time.",
            "review_date": "2015-11-02",
            "source": "rt"
        },
        {
            "content": "Amazing! it's really thought provoking and off course Oscars material! I watched it last night and am still thinking about the scenes, and the layers of Charlie Kaufman, Meryl Streep is a goddess as usual, and this is a fine work of the writers and the director. highly recommended.",
            "review_date": "2015-08-28",
            "source": "rt"
        },
        {
            "content": "Amazingly weird. \nIt will lose you and then find you. \nMaybe.\nIt takes incredible focus and talent to maintain a nuanced character in this kind of craziness, but Streep of all ppl does it!\nI still like Being John Malkovich WAY better, \nbut this is decently interesting, and a bit too subtle in its humor\n\n3.5 out of 5",
            "review_date": "2015-08-15",
            "source": "rt"
        },
        {
            "content": "Not my sort of film. Meditative but repetitive and difficult it meanders along to a final act shootout that doesn't really seem to fit. Nice to see Nic Cage actually performing though.",
            "review_date": "2015-08-12",
            "source": "rt"
        },
        {
            "content": "2015-08-09 not THAT funny but very very good",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "Charlie Kaufman triumphs once again with his original screenplay that contains laughs, emotional turns and a whole lot of irony. The film serves as further proof that Nicolas Cage, given the right director and script, is capable of giving truly remarkable performances. And once you've got all that, there is still more to the film to unlock as the multiple layers unravel into a marvelous piece of metacinema.",
            "review_date": "2015-08-06",
            "source": "rt"
        },
        {
            "content": "Near Perfect. Brilliantly written/acted and hilariously original. \nThis deserves a second watch sometime.",
            "review_date": "2015-08-01",
            "source": "rt"
        },
        {
            "content": "Original, passionate, and emotional. \"Adaptation\" is smartly and thematically powerful.",
            "review_date": "2015-07-22",
            "source": "rt"
        },
        {
            "content": "Excellent, thought-proving movie, and hilarious throughout - especially when it's poking fun at itself",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "Ten out of five stars",
            "review_date": "2015-07-07",
            "source": "rt"
        },
        {
            "content": "Adaptation is a perfect movie there no doubt about it. The acting is phenomenal,the writing is flawless and the direction is top notch. Nicolas cage is brilliant here he gave the best performance of his career. Chris copper and Meryl Streep were also great. Overall Adaptation is a beautiful,brilliant,bizarre and unique masterpiece that I implore you to see.    Grade A+",
            "review_date": "2015-06-19",
            "source": "rt"
        },
        {
            "content": "Multiple story lines just done so well.The acting is king here but the script is it's queen.",
            "review_date": "2015-06-14",
            "source": "rt"
        },
        {
            "content": "Outstanding by the main cast, especially when it comes to Chris Cooper and Nicolas Cage.  Both of them delivered real performances that actually almost feels like they're playing the real character.  \"Adaptation\" is a great character, driven story that dives into the minds of screenwriters and writers in struggling to write a perfect story.  Too bad the ending was random and out of place from everything else that made the story engaging to watch.",
            "review_date": "2015-05-30",
            "source": "rt"
        },
        {
            "content": "A truly unique and exceptional film filled with twists, turns and unexpected surprises. While all of the actors are outstanding, it is Meryl Streep who really shines.",
            "review_date": "2015-05-21",
            "source": "rt"
        },
        {
            "content": "It's completely nuts, but completely original.  Also well acted and entertaining until the end very end.  Adaptation is the kind of of movie that could come from the mind of Charlie Kaufmann and the talent of Spike Jonxe.",
            "review_date": "2015-05-17",
            "source": "rt"
        },
        {
            "content": "randomly started watching on TV....glad I did....one of the best movies I've seen",
            "review_date": "2015-04-18",
            "source": "rt"
        },
        {
            "content": "Nicolas Cage proves why he's one of America's finest living actors. After seeing him snooze through so many brainless action flicks, it's refreshing reminders like this that help us remember just what a monumental talent he is. We can't overlook the others in the cast, but this is Cage's show because he's portraying the guy who's writing the movie about the book that you're watching right now. Confused? Luckily, this is the kind of avant-garde film that seems to have been made for everybody who appreciates great cinema. I love this film. Long live Nic Cage!",
            "review_date": "2015-04-02",
            "source": "rt"
        },
        {
            "content": "Nearly a 5 star film. Almost as perfect as you can come to making a classic film.",
            "review_date": "2015-03-27",
            "source": "rt"
        },
        {
            "content": "Sublime and very special, another great turn by Cage.",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "Adaptation is a truly insightful, honest and dazzlingly creative film. Charlie Kauffman strips away all previous notions anyone holds about screenwriting and the result is an intimate portrait of his life, insecurities, dreams, and fears in a touching, and at times, seriously funny way. On top of the beautiful writing and directing, Nicolas Cage in particular delivers possibly the performance of his career, elegantly harnessing the two almost polar opposite personalities of Charlie and Donald. But technique aside, Adaptation is a seriously heartfelt and moving examination of everything from life on a universal scale to the individual person. Though Kauffman's plight and general outlook on life begin quite bleak, the film grows and evolves to allow tiny beautiful moments, most of them between Nicolas cage......and Nicolas Cage.",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "AThe lines of film making and reality are blurred again in Charlie Kaufman's excellent screenplay.Jonze does an amazing job of crafting the normally skinny, hyperactive Nicolas Cage into a depressive, overweight introvert. http://www.moviemuse.net/directors-spike-jonze/",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "Adding (several) new twists on screenwriting, Adaptation carries out its trippy plots with aplomb though it may be more clever and  creative than it is actually entertaining.",
            "review_date": "2015-02-05",
            "source": "rt"
        },
        {
            "content": "It's just so meta and amazing. Layers, good acting, and a great tie-in to boot.",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "Parts are genius, some not quite as much. From the director of \"Being John Malkovich\". Interesting with Nicholas Cage playing twins...",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "Interesting movie, fine acting and pretty good screenplay that plays with an audience and with a main character alike.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "Yes, yes yes.  So close to being a total masterpiece.  A wonderfuly philosophical delve into the struggles of the self loathing artist/writer and so much more!",
            "review_date": "2015-01-02",
            "source": "rt"
        },
        {
            "content": "If people thought that Nicolas Cage is a terrible actor, then they should see Adaptation as he's amazing in this. Charlie Kaufman knows how to write an original movie, while it does seem to be dangerous to write himself in it, but it really works and it never seem to be self-indulgent. The chemistry between Charlie Kaufman and his brother may seem to be rude at first, but really works as it makes it more realistic and more real. The acting is really great, it's funny, and it has a great pace of not being too fast while not being too slow. It's interesting, and it really does seem that Charlie Kaufman was struggling about writing a movie out of the book that doesn't seem movie material. Adaptation is another great movie from Spike Jonze and Charlie Kaufman after making Being John Malkovich and it seems to make a career from both of them.",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "One of my all time favorite movies.",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "Donald Kaufman: \"What's on your mind monkey butt?.\" \nCharlie Kaufman: \"Nothing, like always\".\n\nThe story is about a screenwriter and his brother try to work to gether to fulfill at least one good story. Their ordintary lives twist and turn into something that no one can even believe.\n\nAdaptation is one of those movies that just blow my mind with it's clever writing and it's weirdly but wonderful character's. Spike Jonze knows how to tell a story, make my jaw drop and knows when to surprise me with it's twist and turns. We all like to make fun of Nicolas Cage's rage moment's and I have to admit I'm one of them who takes the mick of of him, but after seeing this movie and the film Joe that came out early this year; I came say that Cage is more than a screaming over the top actor, his actually a fantastic actor and in this movie his pure brilliant. Meryl Streep and Chris Cooper did a good job in this film as always as they are both great actors.\n\nMy only problem with the film was Meryl Streep's character, now before you flip your shit at me, let me explain why I didn't enjoy her character. She wasn't all that interesting to be honest and she kind of slowed the movie down for me. She was good in the movie, but her character could have been taken out and I wouldn't even care.    \n\nBut the one important thing that I want to say and it may not be a big deal for most people but to me this movie told the perfect message and that is \"Writing a story or a writing a script is hard.\" For every screenwriter out there can look at this and say \"Yes that's me right they, trying to get a great idea out there, but how can I put it into words to make the great idea into a even more brilliant idea\". \n\nI tried to write a story once called Mark Rider: The Wanted Fugitive and I had a lots of ideas for that story, perfect and so brilliant ideas that I couldn't get it into words, and that got me mad, until I saw this movie and I saw Nicolas Cage's character (Charlie Kaufman) and that character was having the same problem that I had, and I could see myself as him in this movie. \n\nOverall Adaptation is a well written movie that sinks it's warm and smart message into you, that you really do feel like your in the movie yourself.",
            "review_date": "2014-10-20",
            "source": "rt"
        },
        {
            "content": "This film is a delight for higher-functioning minds. It tickles your brain as the protagonist builds and alters the script for the film you are watching, and you can see those changes unfolding. One of Nick Cage's best performances, and filled with other great performances as well.",
            "review_date": "2014-10-14",
            "source": "rt"
        },
        {
            "content": "An amazing movie with phenomenal writing, acting, pacing. The movie gets you invested really well into our characters. And extra points following around *TWO* Nicolas Cages TWO!!! He does a great job here. Adaptation is a movie I'd recommend to everybody",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "The most exciting thing in \"Adaptation.\" is the way the film evolves parallel with the fictional Kaufman's script. It starts vaguely, follows its protagonist into desperate uncreativeness and ends with a weird, dramatic twist, similar to Donald's extravagant horror scripts. The real Kaufman proves his excellent storytelling abilities that, along with Jonze's decent direction, create something refreshingly unconventional and rewarding.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "Funny, original and profound, Adaptation makes for a wonderfully intriguing ride with near-perfect performances from Cage and Streep.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "Pretty decent. Cooper steals the show. It's an interesting story, keeps you on the edge, and there's lots of cringy moments that suck in the viewer.",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "A movie about making a movie about making a movie about a book... SO META... Not only that, but Cage plays the protagonist and his brother at the same time. A bizarre but believable plot, with a super-awkward main character.",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "If ever a film deserved the title of pretentious this one would be it!",
            "review_date": "2014-09-07",
            "source": "rt"
        },
        {
            "content": "It has a great concept, and it works until the last act in which it completely took me out of the film.",
            "review_date": "2014-08-19",
            "source": "rt"
        },
        {
            "content": "A totally unique and endlessly creative film featuring some of the best work that Nicolas Cage and Meryl Streep have ever done. Not to mention the unforgettable turn by Chris Cooper. Jonze and Kaufmans' film is not to be missed! Part adaptation of \"The Orchid Thief\" with an even stronger emphasis on artistic creativity and the gifts of imagination. Brilliant film.",
            "review_date": "2014-08-14",
            "source": "rt"
        },
        {
            "content": "One of the best....movies....ever!!  Acting-top notch (Nicolas cage?  Really?  Yes, really!)  factory and script, close to genius",
            "review_date": "2014-08-09",
            "source": "rt"
        },
        {
            "content": "It's one of those films that one needs to see twice to fully appreciate it. I'll watch it again. Cage's performance in brilliant, playing both identical twins who are quite different characters!",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "Reading part of the book made me love the movie even more. I love how Charlie Kaufman has Nicolas Cage as himself and shows his feelings toward the book and how everyone else involved with it felt as well. A very expertly crafted film that I feel will remain as one of the best underrated films of all time.",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "You're not really sure where it's going at first but it's interesting enough that you stick with it and it totally pays off.",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "The most original and brilliant film I've ever seen. Absolute artistry.",
            "review_date": "2014-07-08",
            "source": "rt"
        },
        {
            "content": "I don't really like Spike Jonze's direction, but Charlie Kaufman's script and the lead trio make Adaptation as bizarrely good as it is.",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "Brilliantly neurotic yet achingly human, Charlie Kaufman's multi-layered and strikingly original screenplay is a sublime meta-fiction masterpiece.",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "Palimpsestos, intercalaciones, hipertextos, cintas de Moebius, referentes ocultos, excelentes actuaciones... ¿que más se le puede pedir a una película?  Spike Jonze es un niño que nos invita a jugar en su mundo y logra dejarnos estupefactos con su trabajo posterior a la obra maestra  \"Being John Malkovich\".",
            "review_date": "2014-06-18",
            "source": "rt"
        },
        {
            "content": "Unbelievable. Adaptation thrives within it's own milieu which is so very malleable as if it's own fabric were being weaved and simultaneously crafted into a strange, wonderful, large sweater.",
            "review_date": "2014-06-18",
            "source": "rt"
        },
        {
            "content": "Nicolas Cage makes Hollywood hairdo history in this spellbinding study of screenwriting process and creative psychology. Spike Jonze's tender direction helps blur the boundaries between fiction and reality, emotion and psychosis, but it's Charlie Kaufman's semi-autobiographical screenplay that distorts the film into a meta-masterwork of colossal complexity. Cerebral, intelligent filmmaking at its very finest. Kaufman is too clever for his own good.",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "It's great until the ending, which succumbs to the plot devices it initially seems to be mocking. But other than that, the movie provides great insight into the mind of a writer trying to maintain his integrity in a world full of conformist writers.",
            "review_date": "2014-06-12",
            "source": "rt"
        },
        {
            "content": "Brillant. Vraiment. Original et très bien exécuté. Adaptation apporte un regard intelligent sur l'écriture, sans laisser de cases vides.",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "Adaptation, just like my last review of Seven Psychopaths, references itself and is so ironic that it pulls it off. The movie is about a screenwriter who is having a hard time adapting a book into a movie, yet the actual screenwriter of this movie, Adaptation, wrote the movie about this subject. Cage plays a lonely, asocial screenwriter perfectly, and yet at the same time plays his social, flirtatious twin brother: sometimes in the same scene! It takes true acting talent to do that. \n\nAdaptation takes a banal subject- orchids- and turns it into an original piece of indie magic with a couple of unforeseen and unconventional twist near the end. It's more than a movie about a movie- it's a movie about failing to write a movie: if that makes sense.",
            "review_date": "2014-06-05",
            "source": "rt"
        },
        {
            "content": "A brilliant drama, with a comedic edge, largely this is due to an exceptional performance from Nicolas Cage and a strong script from Kaufman. A perfect encapsulation of what it is to be a screenplay writer. Some issues in the final 20 minutes, however mostly very strong.",
            "review_date": "2014-06-03",
            "source": "rt"
        },
        {
            "content": "Stunningly bizarre, Adaptation dazzles audiences with its weird and wonderful script, and breathes by the stunning performance from Nicolas Cage.",
            "review_date": "2014-06-02",
            "source": "rt"
        },
        {
            "content": "A fun, fresh, creative take on the screenwriting business.",
            "review_date": "2014-05-28",
            "source": "rt"
        },
        {
            "content": "Odd, innovative & captivating. Great cast & a fantastically written script that makes you think. Altogether wonderful.",
            "review_date": "2014-05-28",
            "source": "rt"
        },
        {
            "content": "One of Nic Cage's best",
            "review_date": "2014-05-23",
            "source": "rt"
        },
        {
            "content": "I've never written a screenplay, but I can only imagine the challenge Charlie Kaufman faced when trying to adapt a screenplay out of a book about flowers. However it takes a truly twisted mind to write a screenplay about yourself writing a screenplay adapted from said book. Is that mind-bending enough for you? Well, what if I told you he also included an imaginary twin brother so that the character of Charlie could actual converse with other aspects of his own personality? It's all so meta that I can't help getting wrapped up in this insane story. I loved how, each time Charlie in the film would receive an insight or suggestion for his story you'd find it in the film. He is told never to use voice-over, and then suddenly the voice-over track disappears for a long period of time. He's told you must find a way to add excitement in the end, and we find ourselves in a cat-and-mouse chase with lives threatened. Every cliche finds its way into Adaptation, yet because it is about someone who hates those cliches and would like to avoid them, it becomes comical when he finds they are the only way to escape his case of writer's block.\n\nNicolas Cage is not an actor I like very much, but here he is brilliantly neurotic as the lead. He pulls off both aspects of Kaufman's personality (Charlie and Don) with a nice contrast between the 2. I have some self-esteem issues myself, so seeing his struggles living life with all that fear and lack of confidence was quite compelling. Meryl Streep was typical Meryl. She tells a lot of the story with her eyes because you can read longing, desperation, and joy all with a single expression from her. Susan Orlean might not like what her character did in this film, but she'd be hard-pressed to complain about having a master like Meryl Streep in the role. And then there's Chris Cooper, who is playing the over-the-top John Laroche. Perhaps part of the credit needs to go to the writing for giving him such an amazingly off-the-wall character to play, but still he did a great job of it. Laroche seems so obsessed it almost appears to be bordering on insanity, yet somehow despite his craziness and his less-than-appealing appearance, Chris Cooper manages to show a heart inside. It sounds crazy, but you can kind of see how someone might fall for him, because he has the passion that the other characters in the story are so desperately seeking.\n\nI think where I was less impressed with Adaptation was in the middle. There seemed a long section where not much was happening, which I think was supposed to reflect the frustration Charlie was experiencing when the story wasn't coming to him. Yet there are points where I get bored with the mundane aspects of Charlie's life. Particularly disappointing are most of the scenes that seem to be inserted to reference Charlie's non-existent love life. I didn't find the love interest Amelia to be an engaging character, and I never had a proper frame of reference to know exactly what the status was of their relationship and how I was supposed to feel when it broke down. I had similar problems when we spent scenes in the office of Charlie's agent, they just felt irrelevant. Again I imagine all this can be explained away if you look at it from the aspect of the real life Charlie just describing what was going on in his real life when trying to make his adaptation, but there reaches a point where that excuse wears thin. Yes, I know adapting a story about flowers is going to have low points, but you've set up this interesting premise where the flower has become insignificant compared to the stories of the 3 people, so let's spend more time actually building up those 3 characters. Still, Adaptation is a singular film in it's audacious method of creating a script when it seems utterly impossible. I doubt I'll be watching it frequently in the future, but it's definitely a high-quality film with an outrageous concept I must applaud.",
            "review_date": "2014-05-23",
            "source": "rt"
        },
        {
            "content": "Awesome movie. I was a Nic Cage fan before this movie but only from ridiculousness. Possibly in the same way that the Internet loves him. At no point did I think he was capable of doing two separate characters but he sure showed me. It's probably a top 20 if not top 30 movie for me.",
            "review_date": "2014-05-20",
            "source": "rt"
        },
        {
            "content": "The specific movie has been directed in 2002. It was nominated for 4 oscars, won one and has been in my wish list for years, since i am a big cinefile and always try to watch all sorts of films no matter how obscure or diverse. Around the 45th minute of this movie i started feeling very drunk and dizzy, as if i had drunk 2 bottles of vodka straight (with no ice). I immediately got up from my couch, pressed pause and tried extremely hard to pull myself together from all the gibberish i had watched in this movie. After a short conversation i had with myself, i felt that i must have been stupid for not being able to grasp the hidden meaning of this movie so i urged myself to press play again and push forward. Well, after watching another half hour i reached the following conclusions:\nIf you want to earn Masters degree in masturbation and discover alternative ways of making your spicing up your wAnking experience them Nicholas Cage can act as your mentor, since he jacked off for more than 10 times in this movie. \nMy second and equally important conclusion is that this is one of the most tiring, pointless and meaningless movies i have ever watched in my entire life. \nI want to beg my Creator to forgive for wasting two hours of my life by watching this movie and not doing something more productive like feeding pidgeons in the park. The next time i go for a confession this will be my number one sin. \nI really tried giving this movie zero stars but damn flixter won't let me.",
            "review_date": "2014-05-19",
            "source": "rt"
        },
        {
            "content": "Another wildly brilliant and creative directorial effort by Spike Jonze, but even more surprisingly impressive is the screenwritng of Charlie Kaufman (returning here from Being John Malkovich and interestingly enough the screenwriter of another film I loved greatly in Eternal Sunshine of the Spotless Mind), whose one part semi-autobiographical, another part creatively ingenious fictional work has to rank as his most witty, ambitious and in a way most personal work to date.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "\"Adaptation\" is an original and crafty film that basically presents \"a story about a story being told\" in its own personalized and multi-layered presentation. This film raises thought-provoking themes on the writing process, distortion of the truth, and human desire that can really engage viewers.",
            "review_date": "2014-05-14",
            "source": "rt"
        },
        {
            "content": "This is a really clever idea ... and it's well-executed.  I don't think it's the blinding work of genius that it's often portrayed as.  I think it feels quite a bit like what it is ... Kaufman's attempt to get out of writing an adaptation of \"The Orchid Thief\".  That it's an extraordinarily clever attempt to get out of a predicament doesn't quite disguise the fact that there's very little beneath it's surface ruminations on the writing process.",
            "review_date": "2014-04-19",
            "source": "rt"
        },
        {
            "content": "After watching \"Her\" I look for another films directed by Spike Jonze. I found this interesting film from 1999. Nicolas Cage perfect in his role as twin brothers.",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "Why is it just me who finds Spike Jonze's movies so irritating?  Just like Christopher Nolan, the scripts try too hard to be clever.",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "The thing about movies like Adaptation is, put simply, they don't make sense. And not in the way that people complain about films like Donnie Darko or Blade Runner being nonsensical-- those films have messages that they convey, and it's up to the audience to pick up on them or not. The difference is that Adaptation throws everything and the kitchen sink into the film in one massive hail-Mary pass to the audience, hoping desperately that they'll find something of value in it. In the end, people often do, and films like these go on to receive critical acclaim. But that doesn't change the fact that Adaptation, although complicated, is nothing more than an overcalculated and micro-managed mess of a film that strives for some depth but ultimately is too caught up in its own cleverness to probe any deeper than its shallow themes.\r\n\r\nAdaptation stars Nicolas Cage as twin brothers Charlie and Donald Kaufman, both of whom are screenwriters (with very different ideas about the concept of their occupation). As always, Cage is able to make even the most inconsequential throwaway lines of dialogue entertaining in only the way Cage can. Still, seeing Cage argue with himself does not change one simple fact: This film was written by Charlie Kaufman. I cannot fathom the breadth of delusional egotism that it must have taken for Kaufman to write this film. How is this even a thing? He paints himself as a pathetic and self-loathing character, but I don't buy for a second that a guy this depressed and dissatisfied with himself would write a screenplay for a movie starring him (not to mention his imaginary twin brother). It's supposed to be witty and original, but it just comes off as awkward. Really, really awkward. It's like watching a reality TV show in which people confess the most intimate secrets about their lives. Not only should they not be telling us these things, but most importantly, we don't really care. And that's a concept that seems to have eluded the creators of this film at every step of its inception.\r\n\r\nIn the film, Kaufman (the real one) is attempting to adapt the 1998 book The Orchid Thief into a screenplay. This is not nearly the strangest part of this premise, as Meryl Streep plays the author of the book, Susan Orlean, and turns out to be an orchid drug-addicted adulterer who tries to kill Kaufman. What was the point of this, you ask? Well, it's supposedly a satire on the concept of \"adaptation,\" drawing parallels between the orchids adapting to their environments and the adaptation of a novel into a screenplay. How very clever. But that's the wrong question. What we SHOULD be asking is \"Why did Orlean agree to this?\" Seriously, this is a reputation-ruining kind of thing. Clearly it didn't destroy her public image completely, but I personally would not sign off on a film in which I was revealed to be a drug-addicted sex fiend who kills people. Well... maybe if Nic Cage signed on. I'm getting sidetracked. The point is, none of the people in this movie deserve to have a film made about them, and especially not one like this.\r\n\r\nWhat angers me most about Adaptation is the wasted potential. The film is extremely strong at times, mostly due to the magnetic screen presence of the artist known as Cage. Seeing Nic Cage argue with himself is literally one of the greatest things ever put to screen, right up there with Nic Cage getting tortured by bees and Nic Cage stealing the Declaration of Independence. So how did a movie with Spike Jonze directing, Nic Cage starring in two roles, and a capable screenwriter fail so miserably? Well, at the end of the day, it can be summed up in the paraphrased words of Jeff Goldblum: They were so concerned with whether or not they COULD do it, they never thought about whether or not they SHOULD do it. And the answer is, they shouldn't have. This movie is a fun enough waste of two hours, but at the end of the day, its message about the world of screenwriting and adaptation is just too heavy-handed to put up with. It's far more concerned with being clever and original than actually answering the myriad of questions it raises. And for that, the audience is worse off, because they will exit the film confused and deeply dissatisfied. It's a good thing that this movie will make you think. But don't think for a second that it's any good.\r\n\r\nFinal Score for Adaptation: 5/10 stars. This film has some great qualities, but they are all too often bogged down in silly, self-referential crap and a frustratingly simplistic message. Okay, we get it. Adaptation has two meanings. Aren't you clever. But this could have been accomplished in a far shorter film, especially in one that's not so blatantly self-serving. I mean, my God, they show the set of Being John Malkovich in this movie. What the fuck? As always, I'm all for trying new and interesting things in filmmaking... but man, this missed the mark. Fortunately, its spectacular failures are far more entertaining than many film's successes, which I suppose counts for something. The way the film segues from a serious film about people into a generic Hollywood thriller (paralleling the two scripts the brothers are writing) is almost as clever as it wants to be. But altogether, this is not a movie you should seek out... especially if you haven't seen Being John Malkovich.",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "What a mindblowing movie !",
            "review_date": "2014-04-04",
            "source": "rt"
        },
        {
            "content": "It's truly such a brilliant movie to experience, with possibly one of the most unique concepts you can ever see.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-04-03",
            "source": "rt"
        },
        {
            "content": "What may (sadly) be Nicolas Cage's last Oscar nominated role, an amazing meta-fictional presentation of a writer's struggle with both writing and living.  A haunting portrayal of disappointment and struggling in life.",
            "review_date": "2014-03-28",
            "source": "rt"
        },
        {
            "content": "Boring is about all I even feel like saying about this vastly overrated mess.",
            "review_date": "2014-03-16",
            "source": "rt"
        },
        {
            "content": "I did not like the main character, Charlie Kaufman and his identical twin, Donald (Nicolas Cage).  Charlie is a writer with writer's block.  He is also very anxious and otherwise neurotic.  These kinds of characters, as a lead character, are tough to root for; or even to watch.  They are easier to take in secondary, supporting roles.  In small doses, they aren't so irritating or distracting.  The main character reminded me of the one Cage played in LEAVING LAS VEGAS.\n\nThe story was convoluted.  We have Meryl Streep and Chris Cooper in supporting parts.  It is always satisfying to watch them work.  The story had some unusual twists and turns.  It was not fully engrossing because of the unsavory main character, Charlie Kaufman.  Nick Cage seems to gravitate to these types of roles.  They and he, are not my cup-of-tea.  In the future, I'm going to try to avoid Nick Cage movies.\n\nThere is some fine acting.  The story is kind of involving.  But, I would not recommend this movie.  If, for some reason, you enjoy twitchy, nervous types of characters; you might like this film.\n\nI wish I had not spent the time to watch it.",
            "review_date": "2014-03-15",
            "source": "rt"
        },
        {
            "content": "Adaptation is one of the most intelligent and original films I've ever seen. Charlie Kaufman did a fantastic job with the script and it makes the audience think; this is something that not a lot of films do. All the acting is great especially by Nicolas Cage who convincingly portrays two people. I really liked the main character, Charlie, who is someone we can relate to. This is a film that leaves a lasting impact not only because it's so unique, but because of how emotionally powerful it is.",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "an original, honest, romantic, funny portrayal of a writer's block that's emotionally captivating",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "â??Life seemed to be filled with things that were just like the ghost orchid â?? wonderful to imagine and easy to fall in love with but a little fantastic, fleeting and out of reach.â??",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "Funny, strange, superbly acted, and brilliantly scripted, Adaptation is a modern masterpiece that is very original and creative. The Pianist was a great movie, but this movie should've won Best Picture. Amazing performance from Nicolas Cage, brilliant direction, and plenty of thought-provoking themes, Adaptation proves to be yet another Jonze-Kaufman masterpiece.",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "horrible pic didn't like at all",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "This movie's all kinds of fucked up. Loved it though.",
            "review_date": "2014-02-19",
            "source": "rt"
        },
        {
            "content": "Definitely in my top 5 films.",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "What a spectacular piece of storytelling. Hilarious, yet tragic...",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "Very clever - one's watching the film the character's trying to write.",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "Truly an underrated movie",
            "review_date": "2014-02-13",
            "source": "rt"
        },
        {
            "content": "One of those few films that actually make you go, \"wow\".",
            "review_date": "2014-02-07",
            "source": "rt"
        },
        {
            "content": "Spike Jonze is now my favorite director.",
            "review_date": "2014-01-31",
            "source": "rt"
        },
        {
            "content": "Ambitious in the best of ways.",
            "review_date": "2014-01-20",
            "source": "rt"
        },
        {
            "content": "\"You are what you love & not what loves you\"",
            "review_date": "2014-01-18",
            "source": "rt"
        },
        {
            "content": "Rather slow starting out, but picks up towards the end. Didn't like it as much as Being John Malkovitch,  Also, I didn't think it was as great as the critics seemed to think, but worth a watch.",
            "review_date": "2014-01-13",
            "source": "rt"
        },
        {
            "content": "I LOVE this movie! I can totally relate to Nicholas Cage's character; and the story is so original. Spike Jonze's directing and the Kaufman brother's screenplay combine to create this amazing film. Adaptation is one of the best and most surprising movies I have ever seen.",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "Near masterpiece by promising director Spike Jonze. Cage gives an incredible performance (or performances).",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "Adaptation (2002) is weird, but good weird. Before viewing this film, it's important to know that the plot is self-referential. Screenwriter Charlie Kaufman wrote himself as the film's protagonist and antagonist. Knowing this will help you understand the film's underlying gag which is it's a movie about a screenwriter with writer's block writing a movie about a screenwriter with writer's block.",
            "review_date": "2014-01-10",
            "source": "rt"
        },
        {
            "content": "The topsy-turvy journey that is Adaptation showcases both one of Cage's most convincing and outstanding performances as well a humorous but insightful chain of events.",
            "review_date": "2014-01-09",
            "source": "rt"
        },
        {
            "content": "It's almost painful to know that there will never be another film that's so incredibly original as this one. Nicolas Cage's performance is one of the best I've seen, simply because he is so believable in both of his roles. The characters are so refreshingly rich and unique, and the story telling is absolutely fantastic. I really love this film.",
            "review_date": "2014-01-09",
            "source": "rt"
        },
        {
            "content": "A genre bending cerebral adventure with some of the most subtle yet profound metaphors on life and philosophy seen in contemporary film.  Admittedly falling apart at the seams, yet rescuing itself at nearly every turn. This double helix of a mind trip may not be for everyone, but if you are hooked in the first act and can bypass Nicolas Cage's empty film roles, this is a must for filmies, writers, and admirers of modern day fairy tales.\n\nSee also: Being John Malcovich, Zelig, Brazil",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "Quite a hard film to fathom but so brilliantly written and shot it will really make a huge impact on you as a viewer. The cast is one again brilliant.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "This is what happen when a fuckin genius got a writer's block, then got the script directed by my favorite director.",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Beautifully made, engaging with a nicely intertwined concept of writing a movie while its being played. \nVery genuine characters who fit smoothly into the story. Each of them is so true to their character and have a lasting presence in their world.  I loved the portrayal of each of them and it was a real treat to watch. Chris cooper's character, Laroche, the orchid thief himself is just pure genius. One of the most lasting characters I've ever watched. Every scene that this guy is in is fascinating, in a way almost like he shouldn't even be there. Especially (spoilers) the portrayal of his anguish when he has no choice but to be the man and point the gun at charlie.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "Adaptation marks another brilliant addition to screenwriter: Charlie Kaufman, director: Spike Jonze, and actor: Nicolas Cage's legendary filmographies.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "Kaufman's enjoyably personal, self-referential, and thought-provoking screenplay elevates Adaptation above some slow moments and tonal inconsistencies",
            "review_date": "2013-12-22",
            "source": "rt"
        },
        {
            "content": "We get a great script, and possibly Cage's last great performance.",
            "review_date": "2013-12-20",
            "source": "rt"
        },
        {
            "content": "Self-referential humour is not often attempted in a film, but it has been raped (in a good way) by Charlie Kaufman. Understated performances, such as Meryl Streep's mild mannered, but surprising authour. It also have Nicholas Cage a rare opportunity to shine on the silver screen in this very well done duel role.",
            "review_date": "2013-12-17",
            "source": "rt"
        },
        {
            "content": "Loved this movie. It's about orchids, and it's not, it's funny, it's intelligent, and it has Nicolas Cage in it. And Nicolas Cage. I usually am not a big fan of him, but he's really good in this one.",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "85%\nSaw this on 15/12/2013\nA movie could have flaws, plot holes and cow be dragging, but if it ends right, if you could wow the audience, they you struck it, this is something that a character in this film say about films inn general. It's quite true for sure. Adaptation is a story about many writers, one played by Meryl Streep and two by Nicholas Cage. Nic Cage's acting is fine in this film and although the ending of the film might not 'wow' most of the people, it's just good enough. This film has got a heart in it and it's definitely multi-layered and would definitely confuse you if you are that attentive.",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "Quite honestly one of the most unique films I've ever seen, and a brilliant piece by writer Charlie Kaufman.",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "A very original and interesting film. It took me a long time to finally get to watching this, but I really liked the whole idea it brings up. The film is about a real life writer writing a screenplay for a movie that he can't get a hold of, but it's really about a film that's about making a screen play with real people in a fictional setting. Confusing enough for ya? Nicolas Cage does really well here and there is a good supporting cast including Chris Cooper and Meryl Streep. Highly recommend checking this one out especially if you like Spike Jonze previous film \"Being John Malcovich.\"",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "Everybody goes through adaptation or change there is no escaping it. A powerful film with an important message marked with outstanding performances. Nicolas Cage's last great performance.",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "A master piece. Nothing else to soy about it. It is just... Genius!",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "t will confound some and inspire others to riff endlessly on its mysteries.",
            "review_date": "2013-11-22",
            "source": "rt"
        },
        {
            "content": "\"Adaptation\" es una magnífica y sumamente original historia del guionista que la adaptó, plasmando su identificable forma de ser y su lenta pero poderosa trama cuyo tercer acto es tan impactante como satisfactorio.",
            "review_date": "2013-11-21",
            "source": "rt"
        },
        {
            "content": "\"You are what you love, not what loves you.\"",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "Completely watchable and a very different movie experience. Not sure if I would class it as comedy. Excellent.",
            "review_date": "2013-11-16",
            "source": "rt"
        },
        {
            "content": "Another impressively singular movie from Kaufman. Psychologically taut.",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "The ending was unexpected, I thought it was genius!",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "Probably Nic Cage's best movie, and he has done some pretty good ones. Also some pretty bad ones, but that shouldn't detract from how good this is.",
            "review_date": "2013-11-13",
            "source": "rt"
        },
        {
            "content": "I am stunned by this movie. It is both a hilarious comedy and, having watched his 4 most acclaimed movies (Synecdoche, Being John Malkovich, Eternal Sunshine of the Spotless Mind), I consider this his finest human drama as well. He has a superb sense of humor which is backed by Jonze's visionary skill as a director. Everything is told to use simply and through oscar-worthy acting (I would have given the Oscar to Cage had he not have won already; Cooper is godlike and Streep is great as always). This movie, as an aspiring writer myself, taught me a lot about writing and showed perfectly the lifestyle of writing. It's also unique and energetic and makes you think (not in the bad way; we want to know what's going on).",
            "review_date": "2013-11-12",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant from a creative and writing standpoints, Adaptation runs circles around its viewer and constantly has them guess what will happen next, even though they're never right.",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "''You are what you love, not what loves you. That's what I decided a long time ago.''\n\nWhen I started watching this I had no idea what it was about or who was in it or anything. I must say I was pleasantly surprised. Adaptation is a genuine mix of everything that makes a great movie. Nicolas Cage stunned me for the first time! Loved it.",
            "review_date": "2013-11-06",
            "source": "rt"
        },
        {
            "content": "Unique and odd.  A strange journey worth taking.",
            "review_date": "2013-10-22",
            "source": "rt"
        },
        {
            "content": "Nic Cage actually kills it in this one",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "This movie is very weird and I had to get use to how the movie was! But I felt like I knew the main character so yeah I was very relatable with him! But I don't get the why the 5 stars? It wasn't that good!",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "A highly original, thought provoking comedy-drama from the incredible mind of Charlie Kauffman, bursting with excellent lead performances and a wonderfully unique script.",
            "review_date": "2013-09-07",
            "source": "rt"
        },
        {
            "content": "Definitely one of my favourite Nicolas Cage movies! Spike Jonze is absolutely brilliant in directing and Charlie Kaufman always writes a brilliant script.",
            "review_date": "2013-09-07",
            "source": "rt"
        },
        {
            "content": "I can't believe it took me so long to see this gem.  Chris Cooper's oscar is well deserved and Cage is great.",
            "review_date": "2013-09-05",
            "source": "rt"
        },
        {
            "content": "Amazingly imaginative and some absorbing performances by the main cast.",
            "review_date": "2013-09-04",
            "source": "rt"
        },
        {
            "content": "Defiantly not what I was expecting, overall amazing acting and storyline I didn't see the comedy aspect though",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "The most mind bending movie I have ever seen. Genius.",
            "review_date": "2013-08-27",
            "source": "rt"
        },
        {
            "content": "A loose sequel to \"Being John Makovich\", it's the sad story of the life of that film's tortured but brilliant screenwriter as he struggles to work on the next project that handed to him that's based on a book about rare flower poachers in Florida. Meanwhile, his twin brother, despite his stupidity, writes his first script that Hollywood finds brilliant as it oozes with repulsive formula cliche. Nicolas Cage is brilliant playing off himself in his role of the twin brothers.",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "This is probably some of the most brilliant and original writing that I've ever seen in a movie. I didn't enjoy it as much as Kaufman and Jonze's other collaboration, Being John Malkovich. The actors did a very good job in this film.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "Genious and silly at the same time. Nicks best performance since Leaving Las Vegas. Strange but cool story telling. Makes you want to snort some orchid powdwe!",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "\"Adaptation\" is one of the most original movies ever made. It follows Hollywood screenwriter Charlie Kaufman played by Nicholas Cage and his twin brother Donald who is also played by Nicholas Cage. Charlie is adapting Susan Orleans' novel the Orchid Thief. A movie that has an actor playing two roles, and main story is about making a movie about flowers. Already that sounds like this could be a mess of a film. Adaption isn't though. Nicholas Cage's performance is the best of his career and couldn't be replicated by anyone else. The twin brothers have vastly different personas and aren't annoying at all. The performances in this movie are all superb. You feel the struggle that Charlie goes through to make this movie as he wants this movie to be something original and unique. He doesn't want the generic car chases, or fights. Adaptation is one of those movies that gets better with more viewings, and a movie that I revisit almost every month.",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "This is another movie that surprised me by being a much better love story than it probably deserved to be.  Oddly enough, Eternal Sunshine of the Spotless Mind seems more vulnerable and honest in its raw emotion, but Adaptation is no slouch either. In any case, it gives us fat Nicolas Cage and a semi-toothless Chris Cooper, so on that level everyone wins.",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "really creative. this movie was supported by the cast, screenplay, design, and  story-line. The way of movie gives a value of The Orchid was elegant.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "My Favorite Film Is 1941's Citizen Kane.",
            "review_date": "2013-07-26",
            "source": "rt"
        },
        {
            "content": "Such a great movie that is so well done and very unique.\nCharlie Kaufman and Donald Kaufman created a beautiful story about wanting to thrive in life.\nPlus, Spike Jonze did a great job directing this flick.\nNicolas Cage delivers one of the smartest performances I've seen in awhile.\nIt's genuinely a great great GREAT film.",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "SO WEIRD...so tragic...so sublime, in the end. No matter how bizarr, it remains somehow relatable, and engaged me in unexpected ways. Nicolas Cage gives a simply fantastic performance, in this tautly directed and brilliantly penned masterwork.",
            "review_date": "2013-07-12",
            "source": "rt"
        },
        {
            "content": "A close to perfect film about 4 main characters and they're struggle for happiness. It's amazing how the film plays out at the end, truly one of the best screenplays ever written. Also, the cinematography is wonderfully simple, it allows the characters and screenplay to tell the story rather than the camera. Nicolas Cage is a definite show stealer as he plays both Charlie and Donald Kaufman perfectly.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "Bizarre, original, f***ed up. Perhaps too f***ed up, but still, Adaptation is a mindbender that benefits greatly from the creative geniuses of Spike Jonze and Charlie Kaufman.",
            "review_date": "2013-06-29",
            "source": "rt"
        },
        {
            "content": "So apparently Nicolas Cage can act, and can also be in a movie that's actually really good. You learn new things everyday in the land of cinema.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "This was weird. Very strange and ambitious, but almost dull in a sense. Spike Jonze writes this with dark humor and quirkiness yet I didn't feel the same deep involvement as ETERNAL SUNSHINE OF THE SPOTLESS MIND or HER. Nicolas Cage is great as two completely different, yet neurotic twins. Meryl Streep is fine as Susan Orlean, but I felt like her Oscar nomination was better suited for The Hours. Chris Cooper is good, but not deserving of an Oscar.",
            "review_date": "2013-06-19",
            "source": "rt"
        },
        {
            "content": "One of the most original, brilliant, and intricate films ever made. Cage has never been better. Streep is great as always.  Chris Cooper hands in a tremendous character performance.  One of a kind movie that remains great on multiple watches.",
            "review_date": "2013-06-14",
            "source": "rt"
        },
        {
            "content": "5 stars rage cage, where in the world do you go after a movie like this? Stop doing action movies!",
            "review_date": "2013-06-06",
            "source": "rt"
        },
        {
            "content": "There is no film that could compare to Adaptation. It's greatly moves you, as an earthquake.",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "Bold and original.  It blurs the line between reality and fiction and makes us rethink what movies are and what they could be.  It gives us a glimpse into Kaufman's life and then gives us a caustic, unreal ending.  It offers no real redemption for Charlie, (we get the sense that after 2/3rds of the way in nothing is real anymore) but I found it refreshing because it mocks unreal Hollywood happy-endings with good humor and intelligence.  A weird and wonderful movie.",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "This is a very clever movie. It's origional, funny, unpredictable and a great performance by Nicolas Cage.",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "Kaufman is smart, different and creative. But most of all, he's brave.",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "This is definitely Kaufmans one to see.",
            "review_date": "2013-05-03",
            "source": "rt"
        },
        {
            "content": "really good but made me cry",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "hate to admit it, but excellent performance by Nicolas Cage.",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Few recent movies convey so forcefully how people can feel shut out by their own lack of passion...how they search for anything to end emptiness.  An original mind-bender at times hilarious and at times cringe worthy, for two-thirds of its running time Adaptation is almost perfect, but there's still no third act.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "This one will never get old.",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "so good it just makes me cry.",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "Very well written movie with a great cast. Nicolas Cage, Meryl Streep, and Chris Cooper  all give Oscar worthy performances.  It could get a little boring if you don't like plants and you think plants are boring, but it's a terrific film, that deserved all the accolades it deserved. Great film. My grade=88%(B+)",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "It was amazing...despite my mixed feelings about the ending.",
            "review_date": "2013-04-26",
            "source": "rt"
        },
        {
            "content": "Starts out amazing, brilliant writing and acting. Is it just me though, or does it feel like it peters out towards the end. The opening monologue is the best thing about the movie.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "How very refreshing -- a Nic Cage movie that isn't completely awful or laughingly terrible. On the contrary, Cage is the brightest star of the film. \n\nCage clearly exhibits the brilliance of playing multiple characters. Adaptation should serve as a reminder to those who have tried this but failed miserably, such as Adam Sandler (playing his own sister) and Eddie Murphy (playing anyone from his own grandma to his 7th cousin twice removed)\n\nAdaptation brings a wit and uniqueness to the big screen that is encouraged from the recycled and cliche-driven atmosphere that has flooded Hollywood. \n\nThoroughly enjoyable supporting performances from Chris Cooper and Meryl Streep just add to the experience.",
            "review_date": "2013-04-22",
            "source": "rt"
        },
        {
            "content": "many people enjoyed this movie so i watched it again. however, i don't feel the same way as others. i can't adapt it. LOL but i can see Nicolas Cage did a lot of work for it to perform two different characters.",
            "review_date": "2013-04-17",
            "source": "rt"
        },
        {
            "content": "If you think a movie cant get more original than Being John Malkovich, watch Adaptation. Your doubts or whatever you want to call them, will disappear. The sudden unexpected turn which this movie takes before the climax will somewhat shock you.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "It's third act may be rather polarizing, but as an overall film, \"Adaptation.\" is stil a beautifully written meta-drama with utterly priceless performances from Nicolas Cage and Chris Cooper.",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "A LITTLE OUT THERE, BUT I LIKED IT.",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "Just recently saw this movie, I was blown away...GREAT MOVIE!!!",
            "review_date": "2013-04-07",
            "source": "rt"
        },
        {
            "content": "An incredibly well written, directed, and acted film that will make your head spin with brilliance",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "Two storylines seem to begin at different points of time. The first begins on the set of \"Being John Malkovich\" for which twins Charlie and Donald Kaufman (both played by Nicolas Cage, to whom I originally thought was schizophrenic and talking to himself) want to work their way up in the movie industry (Cage was not in the film \"Being John Malkovich by the way). Charlie, the in-content twin, is assigned with a script related to a film called \"The Orchid Thief\" (has been made into a film by the way), but lacks the inspiration to complete it.  The other story focuses on a novel writer (Meryl Streep), who becomes intensely fascinated by an orchid thief (Chris Cooper), who has serious personal problems (not to mention his addiction to larceny). Charlie then stumbles onto the novel writer's book and wants to meet her, in order to become inspired for his play. Takes a little while to get used to, but the film works, as the characters are deep, thoughtful, and compelling. Has a surprisingly violent and tragic ending that leaves all the characters permanently damaged. The performances by Cage, Streep, and Cooper are highly memorable. Not as good (or random) as \"Being John Malkovich,\" but still very good nonetheless.",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "Good story. Good cast. Its gotta be hard to play 2 roles. He pulls it off",
            "review_date": "2013-04-04",
            "source": "rt"
        },
        {
            "content": "\"Adaptation\" is one of the most original movies ever made. It follows Hollywood screenwriter Charlie Kaufman played by Nicholas Cage and his twin brother Donald who is also played by Nicholas Cage. Charlie is adapting Susan Orleans' novel the Orchid Thief. A movie that has an actor playing two roles, and main story is about making a movie about flowers. Already that sounds like this could be a mess of a film. Adaption isn't though. Nicholas Cage's performance is the best of his career and couldn't be replicated by anyone else. The twin brothers have vastly different personas and aren't annoying at all. The performances in this movie are all superb. You feel the struggle that Charlie goes through to make this movie as he wants this movie to be something original and unique. He doesn't want the generic car chases, or fights. Adaptation is one of those movies that gets better with more viewings, and a movie that I revisit almost every month.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "interesting story, funny spots",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Film perfection. Bubbly, intelligent, unique and a message to convey. The best bit about it is that it's self parody, self aware, gripping and smart! The idea is just so staggeringly unique and it's just the perfect setup for a film. The film does not fall flat.\n\nThe acting was good by Nicolas Cage; seeing as how he played two people. I did not like Streep or Coopers characters at all. I know what the film was saying and I know what the film was trying to represent them as, even so, I did not like them at all. Academy award nomination for Streep? Must have been a slow year. \n\nIt's indescribably good at what it is. Things said in the film are things told not what to do and then they do it, but unintentionally. This is such a good film. It really is.",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "A self-referential rumination on life and the movies.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "Truly a one-of-a-kind film, \"Adaptation' is an incredibly funny, often touching, and surprisingly action-packed sophomore effort from director Spike Jones. A near-masterpiece.",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "was interesting enough",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "Fantastically original. Nic Cage actually delivers a solid performance as his own twin, but I think Chris Cooper is my favorite part of this film.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Thanks to a great turn by Nic Cage along with a fine concept help make this a unique and worthy movie. My only issue involves a good potion of the run-time devoted to mostly fluff and waffle emitting from the secondary story that takes away from the central concept. Worth a look, but could have been better.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "A great film going inside of a writers mindset even if it's derange. Nic Cage knows what Nic Cage does best and he was perfect for the role. I love the little meta moments that happens throughout the film especially during the screenwriting seminar scene.",
            "review_date": "2013-03-19",
            "source": "rt"
        },
        {
            "content": "B-R-I-L-L-I-A-N-T, how can I possibly write anything here after seeing that movie?  I can't do anything with words.  Charlie Kaffman should have to proofread everything that Holywood makes.",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "Nicholas Cage in something good and weird",
            "review_date": "2013-03-04",
            "source": "rt"
        }
    ]
}