{
    "rating": 8.8,
    "release_date": "2002-03-15",
    "num_reviews": 170,
    "genres": [
        "Spanish"
    ],
    "summary": "The lives of Julio and Tenoch, like those of 17-year old boys everywhere, are ruled by raging hormones, intense friendships, and a headlong rush into adulthood. Over the course of a summer, the two best friends, while living out a carefree cross-country escapade with a gorgeous older woman, also find connection with each other, themselves and the world around them.",
    "reviews": [
        {
            "content": "An intimate portrait and love letter everyday life and the environment of México. Through the lens of a vocal diary, the journey of the coming of age for these characters let's you experience the true face and beauty of the country.",
            "review_date": "2023-04-05",
            "source": "rt"
        },
        {
            "content": "Absolutely meaningless.  Come-of-age camouflage for promiscuity.  I guess all that two boys need is someone's mother as the best physical education teacher in life.  One must gather that she was teaching everything that she wasn't and hadn't experienced during her own adult life—or maybe reflective of it.",
            "review_date": "2023-03-18",
            "source": "rt"
        },
        {
            "content": "The best international movie ever made!",
            "review_date": "2022-11-25",
            "source": "rt"
        },
        {
            "content": "Admittedly, I saw the high review scores and had some expectations which were not met.. not fair I know.  I did have trouble reading the English captions fast enough to enjoy the visuals as I very visually oriented.  As someone that was not enthralled by Roma, or Gravity I am thinking I don't connect with Cuarón movies.",
            "review_date": "2022-11-21",
            "source": "rt"
        },
        {
            "content": "1.\tEL COMENTARIO SOCIAL: En muchos puntos, la película hace comentarios sobre la situación del país y la actitud de los políticos y los ricos hacia las supuestas soluciones.\n\nVemos lo derruido de las casas de la clase media y el decaimiento de la estructura en otras partes menos centrales del país.\n\nNos muestran también que las zonas más rurales están constantemente luchando para sobrevivir, apoyándose en la comunidad y tradiciones. Pero también viven acosados por agentes del estado y proyectos de urbanización o turismo que afectan sus vidas de forma negativa.\n\nEsta actitud de los ricos y políticos es una de Negligencia, una falta de cuidado hacia la gente pobre. No necesariamente basada en una malicia, sino simplemente fallas en el cumplimiento de una obligación.\n\nLa familia de Tenoch es interesante en este aspecto. Su padre evidentemente es un ladrón de bienes públicos, a pesar de su supuesto nacionalismo.\n\n2.\t LOS DESNUDOS DE LOS MEXICANOS: Los desnudos en estas películas son de los más interesantes que he visto. Están claramente muy sexualizados, toda la película lo está, pero lo que me parece interesante es que es desnudez sin pretensiones. La cámara no embellece los cuerpos de los actores con muchos artificios más allá de censurar con distancia o no mostrando ciertas cosas.\n\nPero los cuerpos se ver reales y naturales. El sexo en si también se ve muy realista. Es agradable, no tienen esa aura extrema que muchos desnudos en otras películas tienden a tener. Creo que eso nos ayuda a ver los temas detrás del sexo más claramente.\n\n3.\tEL SEXO: En esta película el sexo y la tensión sexual están por todos lados. El sexo que Tenoch y Julio tienen con sus novias y con Luisa es sexo de joven inexperto. Hay una desesperación y nerviosismo que no estaría allí si tuviesen mas experiencia sexual, a pesar de lo mucho que hablan de sus hazañas.\nParece ser un tema el hecho de que ambos acaban rápido con luisa, indicando que ambos están en el mismo nivel de inexperiencia, lo cual es entendible.\nEl acto sexual que muestra mas pasión, intensidad e intimidad sin ese elemento de desesperación y apuro es el que ocurre entre Julio y Tenoch hacia el final y lo que rompe su relación luego de su reconciliación.\nEl engaño con sus novias no termino con su amistad, pero el sexo entre ellos si. Eso me indica que ellos experimentaron por primera vez un verdadero reto a su identidad. Ya no era un juego, ahora es algo que no lograron controlar y esa confrontación los asustó. No estaban listo para esa revelación.\n4.\tSON O NO SON?: Es absolutamente posible interpretar la relación entre Julio y Tenoch como una en la que entre ellos hubo siempre una atracción sexual que culmino esa noche. La película hace muchos comentarios e insinuaciones y hasta sea la respuesta correcta a esta pregunta, sin embargo, yo digo que es mas interesante considerar que lo que ocurrió esa noche fue mas una expresión de un amor mas platonico y a una intensa intimidad mezclada con la intoxicación de los dos.\nEso nos permitiría hablar de las diferencias entre ser homosexual y tener una experiencia sexual con un hombre  y como se requiere de cierta madurez para diferenciar estas cosas.",
            "review_date": "2022-07-10",
            "source": "rt"
        },
        {
            "content": "A road movie with depth, nuance and creative use of narration that is still nowhere near the level of Iñárritu's Amores Perrros. I'd been looking forward to seeing this ever since I watched that movie as I'd been so impressed with it that I assumed the breakthrough movies of each of the Three Amigos would be roughly just as good; I was wrong. While certainly not terrible (I liked the narration, some of the jokes and the ending) I felt they wasted a lot of time and momentum giving both boys full-length meltdowns and then letting their anger dissipate; I would have preferred an outcome where one of them lets it boils over and kills the other. The girl being un-sympathetic and allergic to their conflict didn't make for good viewing either. This is my second Cuaron movie and the second I've been unimpressed with... I think I'm gonna have to watch Gravity or Roma in order to appreciate him the way everyone else seems to.",
            "review_date": "2022-07-01",
            "source": "rt"
        },
        {
            "content": "Ernest Tilley (Danny DeVito) and ‘BB' Babowsky (Richard Dreyfus) are aluminum siding salesmen for rival companies.  After a minor traffic accident between the two, they find themselves enmeshed in grievances and revenge, forever altering their lives.  Barry Levinson's Tin Men has all of the trademarks of a Levinson film.  The plot is thin, but the depth of the characters more than compensates for any shortcomings.  As well, the dialogue is fantastic throughout, similar in nature to Levinson's Diner, where mundane conversations become fascinating.  And it's set in Baltimore.  While it isn't filled with belly laughs, there's enough gentle humor to keep things light.  It's not up there with some of Levinson's best works, but it's still worth a watch.",
            "review_date": "2022-06-17",
            "source": "rt"
        },
        {
            "content": "a masterpiece from Alfonso Cuaron",
            "review_date": "2022-05-13",
            "source": "rt"
        },
        {
            "content": "Y tu Mamá También directed by Alfonso Cuáron is a movie about the influence of society in friendship and sexuality.\n\nCuáron's work here is remarkable and deserving of a lot more credit. This is a very complex study about human behaviour and the influence of politics in your everyday life. It's a beautiful and tragic story of friendship and sexual discovery.\n\nThe storytelling is simple and raw and that's what makes everything look so real and relatable. The use of one shots, the simple dialogues, the naughty conversations, the raw sex scenes, the chemistry between Julio and Tenoch, the sexy shots of Luisa, the recurrent use of voice over narrations and the beautiful landscapes of México all combined made one of the most touching movies I've seen.\n\nY tu Mamá También explores the concepts of reality and identity like no other movie does. It's a beautiful coming of age road trip movie that has a very important social comment attached to it. It makes the audience question and interpert every scene, and the beauty of it is that everyone is going to have their own analysis according to their own reality.\n\nThe third act is absolutely heart breaking, sexy, alluring and pure.\n\n''𝙇𝙖 𝙫𝙞𝙙𝙖 é𝙨 𝙘𝙤𝙢𝙤 𝙡𝙖 𝙚𝙨𝙥𝙪𝙢𝙖... 𝙥𝙤𝙧 𝙚𝙨𝙤 𝙝𝙖𝙨 𝙦𝙪𝙚 𝙙𝙖𝙧𝙨𝙚 𝙘𝙤𝙢𝙤 𝙚𝙡 𝙢𝙖𝙧.''",
            "review_date": "2021-12-12",
            "source": "rt"
        },
        {
            "content": "This was a funny, open-minded movie, which manages to be very mature about some quite immature characters.",
            "review_date": "2021-11-01",
            "source": "rt"
        },
        {
            "content": "And your mother too's lenght is around one hour and forty minutes, but its sexy humor and cleverness, alongside three admirable central performances ](specially Maribel Verdú) stays with the viewer forever.",
            "review_date": "2021-09-30",
            "source": "rt"
        },
        {
            "content": "Rarely does a film manage to not merely hold the viewer's attention but also to actively be entertaining from beginning to end.",
            "review_date": "2021-08-12",
            "source": "rt"
        },
        {
            "content": "A road movie, a study in infidelity, a commentary on modern México & class, a life view in values. Utterly entertaining, life affirming & heartbreaking.",
            "review_date": "2021-08-02",
            "source": "rt"
        },
        {
            "content": "I really liked this one!  They show everything!!!  I wish she was my mother!  I wish my mother wanted me....",
            "review_date": "2021-05-08",
            "source": "rt"
        },
        {
            "content": "I love this movie (Maribel is my distant 5th cousin so she can make me drool and you can't say I'm perverse ).  The boys are idiotic so even in other countries kids are morons.  It is a coming of age flick with 2 friends and ones cousin by marriage who is pretty but not smart like her professor husband who cheats on her & belittling to her.  She goes off on a spree with the 2 boys.",
            "review_date": "2021-01-26",
            "source": "rt"
        },
        {
            "content": "The final narration pulled the film together so that it all made sense. It is a really sexy film and  superbly made, felt very authentic.",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "Jacking off with your bro on diving boards at the country club pool that your father owns, just normal Mexican teenager things. \n\nSimultaneously an incredibly convincing coming-of-age story and one of the most interesting and beautiful depictions of Mexico that you'll ever see, filled with the variety and color that you might expect from a tourism board but a great authenticity as well. The long-take construction and almost improvisational quality to the dialogue really make the film what it is, and the three leads all fill out their respective roles very convincingly. The exploration of sexuality loses a bit of its universality with how tightly it is paired with the commentaries on the peculiaraities (both good and bad) of Mexican culture at the time, but it also is a major contributor to the film's distinct identity, features that would turn up again in Cuarón's Roma. The narrator is also a great touch, appearing intermittently and causing the entire world to fade out in order to provide omnipotent commentary that concludes the narratives of characters ranging from protagonists to pigs with equal certainty and occasionally unnecessary levels of detail. (5/5)",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "A classic.  If you haven't seen it, drop everything and watch.  I've seen it many times, and notice something new with each viewing.",
            "review_date": "2020-12-28",
            "source": "rt"
        },
        {
            "content": "Peak mexican film, will never be topped",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "Cuaron creates one of the more emotionally and aesthetically pleasing bildungsroman style narratives I have seen in awhile. Cuaron is so adept at creating this feeling of \"realness\" in his films that at times I forget these are actors and that this isn't a documentary. The three leads pull off devastatingly authentic performances and the trust they showed in each other and their director was evident in many of these unforgettable scenes.",
            "review_date": "2020-11-29",
            "source": "rt"
        },
        {
            "content": "Amazing storytelling  begins in youth and ends in the shocking reality of life and death; superp performances all around",
            "review_date": "2020-10-27",
            "source": "rt"
        },
        {
            "content": "The more I watch Cuaron, the more I appreciate him. This is the story of two boys, going on a roadtrip with an older woman. At first blush, it seems like a rauchy teen movie - hijinks, pranks, and sex. Instead, at a deeper level, it's about how society sucks the life out of these vibrant beings - literally with the older woman. I love Cuaron's cinematography in the film, with oners that aren't showy, but that just feel very natural.",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "Two young boys who are immature to the ways of the entitled sex in which they are participating, get the lessons of their lives on a road trip with an older woman.",
            "review_date": "2020-07-01",
            "source": "rt"
        },
        {
            "content": "This movie was just an excuse for two teenage kids to have sex with an older woman. Obviously I'm joking but that's really what the movie is about. The ending, \"they will never speak again\" honestly saved this movie in my opinion. Great set-up, but the delivery was questionable, and it was weird to have to constantly watch these two teenagers have sex and then suddenly have an epiphany about life????? Weird and a little laughable. Not a masterpiece by any means; people are only giving it positive reviews because they don't want to seem like a prude. I'm not a prude by any means and this movie was just bad. The \"homoerotic\" tension that was apparently supposed to be present from the beginning was NEVER there, which I'm fine with had it not been for the kiss near the end which was supposed to convey they always were attracted to each other. Since when??? Just plain bad.",
            "review_date": "2020-05-08",
            "source": "rt"
        },
        {
            "content": "This movie was an experience. It follows the raw journey of 3 people as they travel across Mexico. This film was so personal we can feel every emotion they had, from happiness to rage to the sexual desires. The cinematography and directing are amazing.",
            "review_date": "2020-02-24",
            "source": "rt"
        },
        {
            "content": "A smart, witty, and surprising movie. Also sexy.",
            "review_date": "2020-02-13",
            "source": "rt"
        },
        {
            "content": "Worth the watch.  While the overall movie is campy, the deeper story will keep you hooked.  If you have the mental capacity to get invested in the movie, the ending will stick with you for the rest of your life!",
            "review_date": "2019-12-18",
            "source": "rt"
        },
        {
            "content": "Great coming to age story of two rich boys who go on a trip with a soon-to-be divorcee wife. Loved the cinematography and storytelling. Director took lots of time to give backstory to all characters.\n\nThough I want to give this a higher rating, I have to admit that it did not resonate with me as much as I wanted. Maybe I couldn't relate to some of the characters. Maybe I found some scenes forced. Maybe the film didn't age well. Either way, I'll have to give it a 3.5.\n\n3.5/5. Wanted to give it 4 or 4.5 out of 5, but its missing an extra \"umph\" for me.",
            "review_date": "2019-11-06",
            "source": "rt"
        },
        {
            "content": "Reviewed 6.16.19  An unabashed and titillating script by Alfonso Cuaron and his brother, which was nominated for best original screenplay, provides a shameless peak at adolescent male sexuality.  But it's a head fake, as they adeptly address mortality, the power of past relationships, and our desire to live out our fantasies even if they are deceiving us.   \n\nJulio (Gael Garcia Bernal, in an early breakout role) and Tenoch (Diego Luna, already a star back home) are horny young men that are completely preoccupied with sex, and partying their way to it.  Their infantilism can indeed be grating at times, but often hilarious too.  Enter Luisa (Maribel Verdu), who is married to Tenoch's cousin, and at a pivotal moment in her 28-year old life.  Verdu is absolutely spot on, as a woman who married the wrong man, and is left wondering what could have been.  Her beauty, and the stimulating subject matter, may have led a less talented actor to come off as a one-dimensional sex goddess.  But Verdu imbues her character with emotional depth, hard-earned maturity and a wisdom beyond her years, which doesn't become completely apparent till the memorable reveal in the final scene.   \n\nTo the puritan eye, it'll be viewed as blasphemous.  They're loss.  Those less staid will revel in it's sexual freedom and honesty. Team Cuaron pulls of their own menage-a-trois with a deeply human script, shot in a gritty documentary style, and performed in a refreshingly improvised manner.  It continually morphs from funny to sexy to dramatic, never once seeming unnatural. No wonder that Cuaron was then offered the third installment of the Harry Potter series, with Oscar gold in his future.  Garcia-Bernal was launched to international stardom, while Verdu has received the most Goya nominations of any actor in history.  \n\nAll of this on an art-house budget.  It's on every list of the best Mexican movies ever made.  And it's an all-time classic road movie.  For the free-spirited, it's a road to self-discovery. ",
            "review_date": "2019-06-21",
            "source": "rt"
        },
        {
            "content": "It shows the scene of the rich and the poor, combining with history as a background. The technique to narrate between scenes makes it special. It is good.",
            "review_date": "2019-05-05",
            "source": "rt"
        },
        {
            "content": "Even though the indecent length really affected the film as purposelessly irrelevant that could have been better as subtle so the overall meaning in corrupted innocence, as it narratively serve to express, can be retained, Alfonso Cuaron's brief, dissecting tour guide around his homeland's customs through nice handheld cinematography for unique shots and the humorous dynamic between the main duo while it lasted makes this an acceptable though cringingly mixed view. (B)",
            "review_date": "2019-04-27",
            "source": "rt"
        },
        {
            "content": "Hitchhiking On Demand.\n\nY Tu Mama Tambien\n\nCuaron's language is so smart that it is practically silly. His quest for the philosophical challenges that life and death pins down in a moment, comes involuntarily. His vision so pure in its reach that he is basically crafting himself on screen, there is a version of him, a piece of him residing on the screen that ignites the forest fire. The conversations between these more than three dimensional characters doesn't seem scripted at all. There is no cinematic arc or an antic in here, maybe that's his home run. His words are simple, easy and adaptive, he starts of smooth and takes everything for granted, all a tomfoolery and yet perfectly balanced on the concept it explores.\n\nHe uses his frame wisely, like when Luisa played by Maribel Verd confronts her husband on a phone, in the background Julio (Gael Garcia Bernal) and Tenoch (Diego Luna) are goofing around. Declining to compromise the writing in order to shift the tone into serious hard facts, the co-writer and director, Alfonso Cuaron wisely chooses to pour it all on the narrator, which steals some of the best moments of the film like when it describes a history of the location or the future trajectory of the characters, it helps him project the intensity of that current moment.\n\nAforementioned, the cast has done an amazing work especially all the long one take shots where there is a lot of content to cover up and is done effortlessly. The Cuaron brothers that wrote this script together has beautifully painted the equation of the brotherhood with a hint of silliness of a young teenage mentality that we all can resonate with easily. Y Tu Mama Tambien works only for its rigid nature of not surrendering itself to the corrupt cinematic aspects, it grows less and less cinema-alike and feels more and more cinematic.",
            "review_date": "2019-02-21",
            "source": "rt"
        },
        {
            "content": "Directed by Alfonso CuarÃ³n, Y Tu MamÃ¡ Tambien is one of those films that perpetually lingers in your head years after watching it - it's crude, it's sentimental, it's political, it's methodological. But most of all, it's a coming of age about two teenage boys and their older lady companion as they embark on a road trip along the Mexican coast that changes all of their lives.\n\nRead full review: jane-han.com/filmblog/2018/5/31/film-review-y-tu-mam-tambin-2001",
            "review_date": "2019-01-04",
            "source": "rt"
        },
        {
            "content": "The critic consensus is pretty much what I thought of the movie.",
            "review_date": "2018-12-15",
            "source": "rt"
        },
        {
            "content": "11/17/2018\nAlfonso Cuaron's most popular film still has me checking it out after I've seen it more than a couple of times. The story of two teenagers luring a woman to an imaginary getaway had them literally exposing a few secrets, with a little \"surprise\" towards the end. A waaay younger Gael Garcia Bernal topbills as one of the two main casts.",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "a funny, sexy and emotionally fulfilling movie.",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "Sexy movie that is well above the average road trip film.",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "A beautiful, sexy, and well-written film that will stay with you.",
            "review_date": "2018-10-23",
            "source": "rt"
        },
        {
            "content": "When our privileged protagonists hit the road, we get to see that the film is more than just about their sexual desires.",
            "review_date": "2018-07-07",
            "source": "rt"
        },
        {
            "content": "This movie represises with loyalty love problems, it has a great cast, and a simple story, but is that simplicity what makes that it portrayed so well the real life of some teens and a betrayed wild woman.",
            "review_date": "2018-04-27",
            "source": "rt"
        },
        {
            "content": "a sex-fuelled and comedic road trip movie that doesn't hold back on nudity (admirable as many films try and soften this) but with subtle political allegories and explorations of class in modern-day mexico. an enjoyable and almost heartbreaking film that takes you on a journey.",
            "review_date": "2018-03-08",
            "source": "rt"
        },
        {
            "content": "(5.5 out of 6)\nWhen we see cant stop being young, rich, good looking, upper class and enjoy to have drugs, drinks & sex we keep going. When we see that we can't stop looking at other sexy women we keep going. When we see we can't stop being of help to those we enjoy talking to we keep going. When we see we can't stop talking about sex or get someone out of our mind keep going. When we see alot along the way but can't stop to see it indepth we keep going. When we see we can't stop to being stopped when road blocks are along the way we pass on by and keep going. When we don't see other people in need and what is around us that needs to be talked about we can't stop we keep going. When we don't see other things when our car doesn't start we stop, and can't keep going. When we don't see such hospitality and gratuity is meant for the young to stop and remember such kindness to take our time while we keep going. When we don't see we can't stop calling or trying to get a hold of others we keep going. When we see we can't stop feeling a certain way it keeps going on inside us that we let it build and let out when we can't control our urges. When what we don't see and what we refuse to see we push away, when we can't stop and just keep going our high. When we see we can't stop having fun and playing around we keep going. When what we don't see we see when what we unearth deep withing that we keep going on, stops us. When we see friendships are beginning to stop and hard to keep going on, we push it away. When we see what keeps us going and what we can't stop to give it to both when we see what others see they want that we can't come between. When we see what is fair is fair that keeps us going that we can't stop some friendships. When we don't see what stops us or prevents us from keep going it's hormones that we keep pushing down. When we don't see there is much more to life then our own feelings and urges we don't see what's around us in need of help that prevents the people and country from going when we don't stop to see whats the matter. When we see that we can't stop and want to keep going when facing such realities is harder to see then others. When we see others like us like the open ocean that enjoy keep going on such free life's that they can't stop what makes them feel good. When we see we one day will have to stop and no longer keep going on such wild lifestyles we dread those days and enjoy the days we are as wild as pigs. When others wish to see something's longer and wish life kept going and didn't have to stop some are stopped and lucky ones go longer. When we see how others prefer their ways when they can't stop enjoying it to keep going when that's what they prefer. When we see something's need to stop and start that we leave behind something's and keep going forward with our lives. When we see what keeps us going are wrongs others have followed to follow in other wrongs that we can't stop to deal with our feelings or actions in what we have done. When we see we can't stop being open about everything to the thoughts and feelings we keep deep within, we keep going as it's the high we prefer when it's honest, embracing, and free. When we see we naturally keep going when we are open to the thought and dwell in the moment and music that we can't stop this happy feeling when it's unreal and liberating. When we see something's need to stop when we reached our destination of pure unimaginable awkwardness when we no longer can keep going living such ways to go our separate ways. When we see something's stop us & prevent us from going on we begin a new journey to adulthood that we can't stop and must keep going. When we see that fate tells us to keep going on and not stop being friends to meet again to only fight fate and depart seperate ways. When what we don't see we hear that some moments end when what made such moments happen die and it all stops and unable to keep going. When we see why others live such moments when life is short and they no longer can keep going and life needs to stop to have nothing stopping us when life intends for us to be free.",
            "review_date": "2017-10-26",
            "source": "rt"
        },
        {
            "content": "The sense of realism in this film is overwhelming. Alfonoso Cuarón's best film to date and certainly one of the best of all time in Spanish language.",
            "review_date": "2017-07-18",
            "source": "rt"
        },
        {
            "content": "Holy teenage screwing, Senor Batman!",
            "review_date": "2017-07-10",
            "source": "rt"
        },
        {
            "content": "decent film about 2 teenage boys on a road trip to the beach.  they take along an older women who gets it on with both of them. subtitles are a bit of a pain tho",
            "review_date": "2017-07-06",
            "source": "rt"
        },
        {
            "content": "Sometimes the best things in life aren't free, and the movie shows us in every way possible. It breaks the tradition of road movies as much as it does the bro code between our two road tripping buddies. Cuarón chose to film in a way that contrasts between the stark realities of the real world and the once in a lifetime journey our main characters take. Yet each of them have their time at the wheel, both literally and figuratively. What is results in is a ride with twists and turns and leaves them breathless at what they've experienced and all they have left is a photograph of them at the worst moment. Even then, it's a footnote left in an ever-changing world we live in. That's what the movie goes for, and ultimately what it succeeds in delivering.",
            "review_date": "2017-04-22",
            "source": "rt"
        },
        {
            "content": "Mexico City.  Two friends Tenoch and Julio have just seen their girlfriends head off to Europe for a vacation.  They meet beautiful, vivacious Luisa, the wife of Tenoch's cousin Jano, at a wedding and go out of their way to impress her.  Part of their spiel involves saying that they are heading to a fantastic, secluded beach.  Luisa has a falling out with Jano and asks if she can accompany them.  They naturally agree but there's one problem: the beach doesn't exist...\n\nInteresting and entertaining comedy-drama from director Alfonso Cuarón, who would go on to direct Gravity.  Funny yet emotional and gritty.  Covers growing up and learning about life in a fun yet thought-provoking way.  Emotional ending.",
            "review_date": "2017-04-10",
            "source": "rt"
        },
        {
            "content": "O.K.  I admit I forgot she had been to the doctor which added some weight to the story and it was an interesting portrait of young men.  It was also soft? Core porn.",
            "review_date": "2017-04-03",
            "source": "rt"
        },
        {
            "content": "What seems to be a teen sex comedy in concept proves to be something deeper and more authentic in effect.  Director Alfonso Cuarón somehow captures the raw sexual desire of teenage boys and situates it in a real context, showing how the boys' naïveté and inexperience leads to learning and growth when allowed the opportunity from an older woman.  Of course, that last phrase reads like pure fantasy and the film certainly courts implausibility when Maribel Verdú calls to accept the offer to drive to a remote and hidden beach with Gael García Bernal and Diego Luna.  But her motives are eventually revealed and things make sense - her relationship has fallen apart and she seeks escape (or that is what we infer).  Beyond the sexual level and the relationship level, the film also operates on a third level - as a comparison of the middle/upper class lives of the three main characters and the abject poverty of the people in the Mexican countryside that they pass through on their journey (replete with roaming police and military).  The camerawork, hand-held or travelling shots, filmed on location lends added authenticity.  And as with many a coming-of-age tale, there is a wistful quality here, particularly enhanced by the authorial narration that punctuates several scenes and the coda looking back on events. Ultimately, the film pushes boundaries in a satisfying way - but it is definitely NSFW or for those who might shy away from frankness (in word and deed).",
            "review_date": "2017-03-28",
            "source": "rt"
        },
        {
            "content": "It's kind of creepy how the camera sneakily comes out of nowhere into the room where Tenoch and his girl are making love. It's weird because the scene is so intimate and it feels like us, the viewer, are intruding. Like we shouldn't be there in the same room as them. And seeing the juxtaposition of the different relationships that Tenoch and his friend Julio have with their girls was interesting. I love the silent narrations and how we get a more in depth glimpse into the backstories of some of the characters that are a part of Julio and Tenoch's lives. You can say Tenoch comes from an upper class upbringing, he's overprivileged. While Julio comes from a lower class, under privileged upbringing where he hasn't seen his father since he was a child. \n\nI love Gael Garcia Bernal. He's so effortlessly funny. Like he doesn't even have to try, he can just be himself, and it's fucking great! That old lady that was dancing in the back of the restaurant had me laughing so hard. Lmao! That was so random, I wasn't expecting that. \n\nIt definitely has its moments of genuine comedy, especially when Tenoch and Julio are together. Political and also societal and historical, in subtle ways. It is a coming of age road trip movie that shows love for the country of Mexico. The thing about the movie is that the tone or look is kind of gloomy or dreary. I think the weather during the shooting days were not that great. One thing I've always noticed about Cuaron's films is that, at times, throughout several scenes, there's this feeling of chaos that's almost ready to explode. Another thing I admire that Alfonso captures within his movies is the real world that always seems to seep its way into the characters world. Such as the police checkpoints, the patrol trucks, the toll they had to pay to the girl (queen) in order to pass. It's these little things that remind the viewer that the real world still exists and will continue to move on even through fiction. The movie hits a little too hard and real for my taste. Especially with that ending, with Luisa dying of cancer and how she knew she had it all along. I mean I guess it is kind of beautiful that she decided to live her last days doing whatever she wanted and enjoying life. The Making of documentary is amazing to watch and is probably the best supplement for the movie. Overall, I thought it was a great film about reaching maturity and enjoying life. I'd watch it again but idk if I'd but it on blu ray. \n\n\n\nThis movie is so many things than just a Comedy Drama. It's a political movie, it's a movie about Mexican culture, it's a look inside fragile lives, it's a lot of things. The landscape shots of the country side of Mexico are incredibly beautiful.\n\nWhat was so compelling about this movie was the commentary on different things that we're going on and about the characters themselves. Almost like uncovering little secrets about these vulnerable and sensitive characters. I thought this was so genius the way it was done. This is a movie that deserves to be rewatched. \n\nOverall, this was a completely amazing film that rocked me to my core.",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "a mood boosting movie",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "Sexy, divertida y emocionante. Una road movie que muestra todo eso que alguna vez quisimos hacer: Escapar de una vida monótona para darnos simplemente un respiro. \n\nLo más interesante de la película es ese narrador que espía la vida de todos y que sabe las cosas que suceden, sucedieron y sucederán en el futuro. Lo anterior funciona para hacernos saber qué fue de todas esas personas con las que se toparon estos tres jóvenes sin tener que hacer una película de cada uno de ellos.\n\nEsta película es lo más cercano a mis sueños salvajes que tenía de chavo. Véanla.",
            "review_date": "2017-02-26",
            "source": "rt"
        },
        {
            "content": "A strange and inspiring coming of age.",
            "review_date": "2017-02-07",
            "source": "rt"
        },
        {
            "content": "a shocking twist at end, but the movie has merits, and soul, and conveys, life is fragile.",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "Sexy, intense and heartfelt - Y Tu Mama Tambien is a well-acted road trip that adds up to Alfonso Cuarón's brilliant filmography.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "This is the worst movie.",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "Sophisticated and funny, well acted and shot, even though structured on a familiar pattern. Dialogues are riveting and fresh, as though improvised. And of course sexy.",
            "review_date": "2016-12-15",
            "source": "rt"
        },
        {
            "content": "Not entirely sure about the purpose of this film but Y Tu Mama Tambien is an erotic coming of age drama about 2 boys and an older woman on a road trip, where they learn about some harsh truths and come to accept themselves. It is highly and graphically sexual, which is not really for my taste. I don't think this depicts the real Mexico but is a different cultural experience.",
            "review_date": "2016-10-28",
            "source": "rt"
        },
        {
            "content": "A road movie for teenagers perhaps, at least for most pasts of the movie. But then it gets incredibly saddening as the story comes to the end.",
            "review_date": "2016-08-28",
            "source": "rt"
        },
        {
            "content": "A couple of teenage boys invite an older woman on a trip to a secret beach they claim to know about, and are totally unprepared when she unexpectedly accepts the offer.  We know that she's accepted their offer because she found out her husband is cheating on her, but there seems to be more going on.  A joyous, ribald road movie with quite a bit of explicit dialogue and a bit of explicit sex disguises a film with a bit more on its mind.  Ana seems to be challenging the two boys to grow up a bit and be more honest with each other, and to kind of earn the right to be with her.  Even that doesn't quite work out as too much honestly threatens to destroy their friendship.  This is the kind of film that I don't think can be made within the confines of the MPAA rating system.",
            "review_date": "2016-08-15",
            "source": "rt"
        },
        {
            "content": "This Mexican drama revolves around a road trip with a difference - sexual talk, explorations, and experiences are at the forefront. Although I understood the basic premise, and there are some unforgettable scenes, somehow it didn't all come together and the ending seemed a little contrived. Really it all seemed a bit pointless. Still, there is enough humour and energy here to keep the viewer's interest. 1001",
            "review_date": "2016-08-01",
            "source": "rt"
        },
        {
            "content": "On the surface this film is about an erotic road trip. However, the underlying themes and various camera angles present the film in a different way. The themes of tragedy, death, social class, obliviousness, and political issues are what makes this film astounding and separates it from being a film just about two horny teenage boys trying to sleep with an older woman. The acting, various camera angles, setting, and story are glorious.",
            "review_date": "2016-07-13",
            "source": "rt"
        },
        {
            "content": "Alfonso Cuarón nos trae un viaje de auto-descubrimiento y metáforas visuales con está película, La película tiene una historia que contar, de una manera qué se queda en tú cabeza, con varios mensajes sobre el crecimiento y la sexualidad, es una película Mexicana qué merece ser vista.",
            "review_date": "2016-07-02",
            "source": "rt"
        },
        {
            "content": "Crying out for happiness, sexual satisfaction for some; love for others. Puffed-up with sexual tensions between the characters, building and leading to seductive erotic sequences. Underneath this stagecraft, it accounts for substantial deeper theme, which is fully revealed at the end and that is where the beauty of the movie lies. The movie doesn't expresses the subject directly, but the powerful look vocalize it all.",
            "review_date": "2016-06-08",
            "source": "rt"
        },
        {
            "content": "Y Tu Mamá También is too annoying and too explicit at times and its ending is definitely unrealistic and overly predictable, but it is overall a good and very memorable Cuaron movie filled with realistic characters, an interesting tone to it and some fine scenery. It is a problematic, but still quite a good Mexican film that succeeds as a solid road movie.",
            "review_date": "2016-06-06",
            "source": "rt"
        },
        {
            "content": "One of the greatest films ever made. This is not just a road trip movie about sex and promiscuity. This is much more than that. To see this film is to see life; with all of its regrets, sorrow, happiness,poverty, and everything that is relevant to itself. Of course, if one is ignorant of the world around them, this film would't seem any special. But, believe me, my friend, this is truly a masterpiece.",
            "review_date": "2016-04-21",
            "source": "rt"
        },
        {
            "content": "4.1/5\n\nA very enticing and thoughful film that knows its ideas and treats its style and rythm with care, slowly developing its characters and all of its different but equally mesmerizing layers.",
            "review_date": "2016-03-25",
            "source": "rt"
        },
        {
            "content": "After watching this film I immediately moved it to the top of my all time favorites list. A good film needs to do a lot of things well, but for me most importantly it is how the movie makes me feel. Is it thought provoking, does it bring up old memories of my own life and do I get absolutely lost in the films story. I check every box when it comes to this story. At times it feels Nirvana's classic hit \" Smells Like Teen Spirit\" it reminds me of when I was young and would run the streets with my best friends. I didn't have a care in the world, I had great friends and through the seasons some have come and gone. This film captures that feeling, it speaks to friendship, love, loss, sex, adventure and maturity into adulthood. That change in life is always there and I've found as an adult you can never get that care free feeling back. Even some of our best friends will grow distant, which is fine. Our life is always revolving and bringing in new people and experiences. But for all the in between times we will have \" Y Tu Mama Tambien\" to remind us of people and things that have come before.... In my life, I've loved them all. \n(The Beatles- In My Life)",
            "review_date": "2016-03-21",
            "source": "rt"
        },
        {
            "content": "There's something oddly gripping about Cuaron's film- the sex? Or the intelligence hidden behind the beauty?",
            "review_date": "2016-03-18",
            "source": "rt"
        },
        {
            "content": "\"Y Tu Mamá También\" is a tried and true coming-of-age drama with the raw and compelling indie feel.",
            "review_date": "2016-02-14",
            "source": "rt"
        },
        {
            "content": "Road movie that is compelling because it of its unusual setting (Mexico) and cast (two adolescents/youths and an older married woman). Also, the telling is unique in its use of voice-over narration which relates what has happened and what will happen, often about events unrelated to the present, and unconnected to the main characters. Also, the camerawork is very daring - panning to another part of the scene. There is one difficult continuous five-minute take that required all three actors to perform rapid-fire right on cue (the drinking/dancing sequence at Chuy's during their last night together). \nEvery aspect of the film is done magnificently. I guess I found the two \"boys\" just irritating at times, but they were no doubt realistic depictions of careless youth. The adult voice-over provided the maturity that was lacking on-screen. (I thought it may have belonged to one of the boys looking back on the escapade from his middle years, but it wasn't).\nI wished the ending were different but then it would have been a different movie!",
            "review_date": "2016-02-11",
            "source": "rt"
        },
        {
            "content": "Y Tu Mama Tambien is an intellectual, sexy road movie that attempts many things at once (social classes, politics, humor, emotion, sexuality) and it does them all perfectly.",
            "review_date": "2016-02-05",
            "source": "rt"
        },
        {
            "content": "A sexy coming-of-age road movie with some excellent cinematography.",
            "review_date": "2016-01-13",
            "source": "rt"
        },
        {
            "content": "Predating Academy Award winner Alfonso Cuaron for all his English-language work, Y Tu Mama Tambien sounded like a promising chance to see the creator working at his roots.\n\nY Tu Mama Tambien opens with the traditional Alfonso Cuaron technique of using a single long shot, immediately signifying the man's eye for style and his desire to challenge the cast to do everything they can in a single take. What's interesting about this shot is that the first thing it shows is a raw depiction of sexuality with no desire to disguise anything in the frame. In that sense, Y Tu Mama Tambien immediately foreshadows what it will promise viewers in terms of style and narrative. \nSince the film ends up being a road trip movie its importance very heavily lies in the experiences of the characters while the narrative just happens naturally without the most clear sense of where it is always going. And as well as that, Y Tu Mama Tambien has a story which is important for the context of 1999 contemporary Mexico. Since the story is not actually about all that much and more a road trip where the characters discover the land and themselves, the real-world political context of the story is important in viewers recognizing the meaning of everything that is going on. Since I'm not personally familiar with the political and economic state of 1999 Mexico, the only thing I can gather from Y Tu Mama Tambien is from the experiences of the characters and the omniscient narration supporting it. The naturally occuring narrative feels genuine since there isn't any forced dramatization but rather a lot of realistic dialogue and organic development in the situations, but it also means that things are not always the most entertaining due to a rather slow pace.\nStill, there is no denying the beauty in the simplicity of the material. The screenplay offers a lot of insightful dialogue into the minds of the characters and puts them into situations which are of edgy subject matter. The way that Alfonso Cuaron puts a handle on all this is brilliant considering the type of material he is working with. Notorious for its depiction of drug use and sexuality, Y Tu Mama Tambien does not throw it in the face of viewers but lets it occur as part of a naturally developing narrative. As a result, the sexual nature of the film feels as natural as it should without the social stigma that is frequently thrown around it. The shock factor once associated with the film is no longer as strong as it once was which means that perhaps some of the dramatic power is no longer as prominent, but regardless of all that the intelligence of the material is the kind to hold up for generations.\nOn a small budget, Alfonso Cuaron has no problems stretching what he can into a feature of style. For one thing, his iconic visual style is an intrinsic element to Y Tu Mama Tambien as the cinematography is typically brilliant in Emmanuel Lubezki's use of long shots. These shots do not move around all that much. They shift focus once in a while and shake a tiny bit to convey the reality of the situation, but the main thing they do it force the actors to accomplish extensive feats of script memory. As a result, the conversations play out for extensive periods on end while the scenery in the background captures its own sense of style. The landscape is simultaneously beautiful and empty. The world in the film is full of vibrant scenery whether it be natural life or dilapidated buildings, and yet at the same time this conveys a notion of dead land. While Alfonso Cuaron is able to find art in the world, he contrasts it with a colour scheme that is very bleak and monochromatic. There is a surprising balance between life and death that comes from this, and it simply adds to the brilliance of the film.\nAnd since the script and cinematography really set the actors up with high-profile material, a skilful array of actors is just what Y Tu Mama Tambien needs and acquires.\nGael Garcia Bernal delivers a powerful performance. The talented actor has worked with an array of skilful directors in his time whom have challenged him in ways such as Pedro Almodovar. Alfonso Cuaron puts the actor in a role where he has to face confronting material, appear naked and act for extensive periods of time without editing. Without a moment where he steps out of character, Gael Garcia Bernal maintains a tenacious grip on his role. He channels the emotional edge of Julio Zapata into every inch of him, maintaining the spirit of the character inside and out. Whenever he isn't talking, Gael Garcia Bernal's physical movements of the character speak his emotional state easily. The energy and charm of the young actor boasts fearless talent in the star, so Y Tu Mama Tambien proudly boasts some of his finest works.\nDiego Luna captures a similar charm. With a restrained sophisticated demeanour contrasted by the directionless nature of a troubled youth, Diego Luna is able to embrace a free spirit to his character. Yet he is also fearless in approaching the drama within the material. Taking it all head on, Diego Luna passionately charges all his focus into pushing the material to the limit. Sharing an intense chemistry with everyone around him and particularly Gael Garcia Bernal, Diego Luna is able to establish a strong ground within Y Tu Mama Tambien and consistently remains an engaging presence whenever he graces the screen.\nMaribel Verdu also makes a powerful presence. Sharing an equally intense chemistry with both Gael Garcia Bernal and Diego Luna, Maribel Verdu captures the attention of audiences with her natural charms and is able to turn her dramatic flair on and off whenever the scene requires different levels of intensity. She goes from a friendly presence one second to a raw source of melodrama the next, and she never goes overboard with it but rather always channels the ideal level of energy into the scene. She delivers a striking effect whenever she has to shout, and that is when her performance climaxes in rich tension. Maribel Verdu is a rich addition the the powerful array of acting in Y Tu Mama Tambien.\n\nSo though Y Tu Mama Tambien relies on its audience's knowledge of historical context as well as a slow pace, Alfonso Cuaron's raw talent as a director ensures that he handles the edgy subject matter with extensive style and without fear.",
            "review_date": "2015-12-09",
            "source": "rt"
        },
        {
            "content": "Like basically all \"world cinema,\" Y Tu Mama Tambien is a coming-of-age sexual adventure. It also contrasts Mexico's privileged urban elites with the country's penniless rural laborers. Very well acted and directed, it's one of the best movies to come out of Mexico.",
            "review_date": "2015-11-15",
            "source": "rt"
        },
        {
            "content": "Five stars for the energy alone. The script's terrific, the natural acting is appealing, Lubezki is responsible for the film's gritty look. But it's the energy that makes it special. Children of Men remains my favorite Cuaron but this one is close.",
            "review_date": "2015-10-22",
            "source": "rt"
        },
        {
            "content": "It hit me a few years ago that the \"forever\" ideal of summer would eventually have to cease.  Lazy afternoons, eternal pineapple cherry popsicles, dreadfully sun-soaked bouts yard work, and a barrage of yes, oh yes, movies, would someday disappear, if not decrease dramatically in stature.  I think the realization came to a head my freshman year of high school, when I began to understand that sometime around eleventh or twelfth grade (it turned out to be twelfth), the usual stress-free days of sunny appreciation would be eschewed by adult responsibility, and that there would come a summer where innocence would be overtaken by a jaded, cripplingly mature mindset.  Now that high school is behind me, I've discovered that such a transition only generally happens in the movies, or to the people so severely immature that reality ends up unexpectedly snapping their playfulness after a period of harsh self-reflection. \n\t2001's \"Y Tu Mamá También\", now one of the most famous road movies of all-time, contains members of the latter camp, portrayed by brothers-from-other-mothers Gael Garcia Bernal and Diego Luna.  Their reality comes in the form of Maribel Verdú, a sexy Spanish wife who meets the friends at a wedding and spontaneously hits the road with them after discovering her husband's indiscretions.  The trip, said to be headed in the direction of Heaven's Mouth Beach (a destination the pair made up in a desperate attempt to impress their older female counterpart), is lined in endless sex talks and kept secret existential crises - but what begins as an endearingly vulgar tirade of exchanges turns sour when Verdú's Luisa decides to hook up with one of the friends, and when the pals reveal to one another that they've slept with each other's girlfriends on more than one occasion.\n\tFor most, \"Y Tu Mamá También\" is an emotionally revealing film, one in which inexhaustible harangue is a masquerade for the insecurities of its characters, deep and moving.  I'm not so convinced.  The dialogue has a this is how people talk impenetrability to it, and the frankness of the sexual scenes is refreshing in its ability to keep things largely uncinematic.  It's a relative case of two irresponsible teens coming-of-age, all thanks to an in-crisis woman's decision to join in on their road trip and teach them about the sexual vulnerabilities, the hard truths, of life.  It's bright, surprisingly melancholy entertainment rough in all the right spots - I'm just not so sure it's the masterpiece everyone says it is, in part to the insufferably obnoxious behavior of its characters and because its terrific, more tender moments, don't happen as much as they should.  (The ending, however, unexpectedly bleak and unsentimental, makes up for the eye rolls that abound during its first act.)  Alfonso Cuarón's direction is so unforced we have a feeling that the things that occur during its 106 minutes are sure to have happened in the real world.  Verdú is a sexy but believably susceptible ball of fire that easily could have become the idyllic femme figure if not for the grounded nature of the film.\n\t\"Y Tu Mamá También\" is frolicsome until it ceases to be so wonderfully manic,  and it's that final snap that makes it better than the majority of coming-of-age films.  It sees its immature characters from a heavenly distance that shakes its head in a knowingness that things cannot be kept so vulgar, so sex obsessed, forever.  It can be wise when it wants to be - I just wish it spent less time beating around the bush and prolonged its bouts of aching truths.",
            "review_date": "2015-09-23",
            "source": "rt"
        },
        {
            "content": "Nobody makes movies like Y Tu Mama Tambien anymore, not even its director Alfonso Cuaron himself. Although I adore his Children of Men and Harry Potter and the Prisoner of Azkaban, I wish he could go back to his indie roots, and make movies like this again. Y Tu Mama Tambien is a road movie with brain. Kudos to Cuaron for his sensitive direction, Emmanuel Lubezki's beautiful cinematography, and the electrifying performances by the three leads. It pulls punches you don't see very often in road movies. It's a small but significant achievement.",
            "review_date": "2015-09-17",
            "source": "rt"
        },
        {
            "content": "This movie was just weird. It started off as maybe a sexy movie but then got depressing and went too far at the end. The main two teenagers are very immature and annoying. I predicted luisa was dying before they even said which was too cliche for me. The movie just went were i wasn't expecting near the end and i thought it was unnecessary. I also thought the random narration could've been more relevant like the much of the movie it was aimless. I did like the cinematography because it very much reminded me of my trip to Mexico but thats mostly it.",
            "review_date": "2015-09-13",
            "source": "rt"
        },
        {
            "content": "Quite possibly the greatest foreign film of all time.\n\nA+",
            "review_date": "2015-08-25",
            "source": "rt"
        },
        {
            "content": "Stars Gael Bernal and Diego Luna are best friends in real life, and it shows over the course of this beautifully shot road movie that broke Mexican box office records. As two friends who convince the attractive wife of a relative to journey with them to a beach called 'Heaven's Mouth' - which, unfortunately, doesn't exist - the two are all Heaven's mouth pompous stories of their escapades. Their cocksure machismo is intriguing to watch, knowing underneath that their complete lack of experience is about to appear through the cracks, bouncing off the gorgeous and more mature Verdu. With all the natural performances, uncensored content and unbroken camera shots writer/director Alfonso Cuaron go to build his successful career off of, Y Tu Mama Tambian is highly oversexed, sometimes uncomfortably so, and is a grown-up coming-of-age tale whose take on what it is to be a man will stay with you for a good long while.",
            "review_date": "2015-08-23",
            "source": "rt"
        },
        {
            "content": "Alfonso Cuarón's film is framed as if a \"documentary\" which features a distant and dis-engaged narrator. It is an effective device. As we \"meet\" the 3 leading characters of the story, we are allowed to make \"judgements\" about each one. I stress the word \"judgement\" because that is what we do. It is as if Cuaron gives his audience permission to allow us to wedge each three \"characters\" into our own sense of stereotyping and passive viewpoints. \n\nAs the movie progresses, the idea of documentary gives sway to leaving the audience as \"flies on the walls.\" Our pre-conceived ideas of each character proves incorrect. These characters do not fit into cultures' restrictively simple \"labels.\" \n\nThanks to the skills of Maribel Verdú, Diego Luna and most especially Gael Garcia -- these characters very quickly become \"people\" filled with challenges and very real worries and concerns. \n\nThe \"older\" woman is not really that much older than her male friends. She is barely a decade older. But as a woman and as an adult who has had a bit more experience, she is more forgiving of her friend's limitations. It doesn't mean she understands them. \n\nJulio and Tenoch have been raised in very different ways and within very contrasting social classes. It has not prevented a deep friendship, but as they grow older each is painfully aware of their own \"judgements\" and \"prejudices.\"\n\nWhat seems like a simple road trip and coming of age story is far more complex. At the time the film was released, Cuaron's use of explicit sex went far beyond the range of the American R-rating. It was hit with the often damaging and unfair \"NC-17\" label. For younger people this film became an infamously erotic, bold and graphic look at sexuality. \n\nIt would be unfair to not allow the film its eroticism. It is erotic. It is also a very intelligent examination of sexuality from both the limited perspectives of two only recently \"legally\" recognized young adult males as well as an adult female perspective. Sexuality is at the core of this beautiful film. \n\nThe road trip is not simple. It is filled with glimpses into The Mexican culture which is simultaneously beautiful, confused and horrifically economically corrupt tension. In addition, this \"little\" road trip reveals itself to be a realistic and troubling exploration of male bonding. When that bonding dips it's toes into the deep waters of sexuality -- this friendship can never return to it's innocent fun and love. It is severed. It is damaged beyond repair. \n\nAnd our leading female character is dealing with life's most challenging and horrifying realities. Beyond lonely, Luisa is trying desperately to find solace in a world that has refused it. These two kind young men represent a youth she has almost forgotten. And while she tries to help guide these two boys into a smarter sexual understanding she also pushes them too fast and too far. She is unable to notice this because of an internal horror that she keep hidden. Not because she is afraid to share it --- but because she is too afraid to allow herself to view it. \n\n\"Y Tu Mama También\" presents itself as a sexy coming of age movie that is actually a profound and tragically sad reality that comes with adulthood. Underneath that already complex achievement lies a societal-political of a Mexico that is about to explode onto other cultures and countries that I don't I was even aware of at the the time. More than just an \"important\" work, this is stunning adult film that no one will want to miss.",
            "review_date": "2015-07-29",
            "source": "rt"
        },
        {
            "content": "I went into this movie like I went into Nymphomaniac Vol. I. And I was not dissapointed. It's a really well made movie with great acting and likeable characters. The movie's story is nothing special, but the way the characters act and the narration that's constant in the movie, makes this movie so much better than the other ones who tried doing something like this, but have failed. The movie's tone shifts pretty quickly from fun/funny to sad/depressing. You could be laughing one minute and feeling sad the next. The narration really adds to the mood of the movie, because it explains some things and tells us the future/past of someone. The ending is especially depressing. The acting in the movie is great! All three main actors do their job very well and their characters seem very vivid and real. All in all, a great 'road-trip' movie with great acting and a plot that can make you sad just as much as it can make you laugh. I would recommend seeing this movie.",
            "review_date": "2015-07-24",
            "source": "rt"
        },
        {
            "content": "Y Tu Mamá También has all the standard aspects of a great coming-of-age film, including the emotional impact and brutal honesty, and deep themes of friendship, relationships, and life in itself, making it a must-see entry in the subgenre.",
            "review_date": "2015-07-16",
            "source": "rt"
        },
        {
            "content": "Better story than in regular porno movie, but this is still just a porno movie!",
            "review_date": "2015-06-05",
            "source": "rt"
        },
        {
            "content": "Maribel Verdu has big tits so you know how it works.",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "One of very few Mexican films I've seen leaves me wanting to search out a few more. This is an indie style comedy about two kids who fancy themselves as casanovas and manage to persuade a timid spanish beauty to take a road trip to a made up beach paradise with them. Their overconfidence is soon torn to shreds as the power balance quickly changes. This is a nicely made film with a bit of bongo for both the lads and lasses.",
            "review_date": "2015-05-21",
            "source": "rt"
        },
        {
            "content": "A film that seems to seek out the weakest link in the audience and destroy them, then move on to the strongest and challenge them - And Your Mother Also provokes until the startling finalé and devastates its audience. The film challenges our ideals on love and is packaged just right that it isn't tasteless and is primarily for adults. Whilst its serious, the film is intimidatingly fun and seductive too.",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "A beautiful film that draws you into it's intoxicating world with humor and spot on performances. Maribel Verdu as Luisa is the very definition of radiant and the two boys are great as her sometimes idiotic companions. The movie is quietly tinged with melancholy and it's not till the final shot that everything comes into heartbreaking focus. Kudos to the script as well, which it alternately funny, sexy, and insightful. And that cinematography is fucking gorgeous!!",
            "review_date": "2015-03-16",
            "source": "rt"
        },
        {
            "content": "Y Tu Mama Tambien is a deep exploration of human relationships, for the good and the bad. Sometimes fun, sometimes painful, it's a dramatic story about three people on a journey to nowhere and everywhere.",
            "review_date": "2015-02-27",
            "source": "rt"
        },
        {
            "content": "Y Tu Mama Tambien? (With Your Mother Too!) is a weird cocktail of genres that are impossible to mix. It is a coming-of-age and erotic road trip with deep political undertones. Hats Off to Cuaron brothers (Alfonso & Carlos) for mixing seemingly distant genres like road trip and erotica & coming-of-age and politics.\n\nFilm was the highest grossing Mexican film of 2001 when it was released and earned unanimous praise for 3 leads - Maribel Verdu (Luisia), Gael Garcia Bernel (Julio) & Diego Luna (Tenoch). But what really is brilliant in the film is Emmanuel Lubezki's fluid cinematography with ample of long uncut shots specially the \"Climatic Dinner Table Scene\" and Alfonso's innovative use of third person voice over for moving the narrative.\n\nIf you love films that have road trips, are coming-of-age, has political undertones and are filled with raunchy scenes do watch this brilliant little gem.",
            "review_date": "2015-02-21",
            "source": "rt"
        },
        {
            "content": "It grew on me as it went on, but I still had a bit of trouble getting past the utter self-centeredness of the two main characters.",
            "review_date": "2015-02-14",
            "source": "rt"
        },
        {
            "content": "Horny adolescent buddies, somehow manages to exploit the last bit of life from the beautiful  \"Luisa\". As for their unpure personalities the characters dont score more than medium. The underlying political essence and the breathtaking Mexican landscapes helps pulling towards something worth seeing. Verdu giving a strong and willingly performance.",
            "review_date": "2015-01-22",
            "source": "rt"
        },
        {
            "content": "Full review in Spanish: http://cinemexxicano.tumblr.com/archive",
            "review_date": "2014-12-26",
            "source": "rt"
        },
        {
            "content": "I cannot describe how much i hate this movie. It is bad and then it gets much worse.  Awful movie.",
            "review_date": "2014-12-18",
            "source": "rt"
        },
        {
            "content": "The way Alfonso Cuaron shifts from a Children's novel adaptation (A Little Princess) to a classic novel adaptation (Great Expectations) to an adult road-trip movie is really fascinating. 'Y Tu Mama Tambien' is one of my favourite road-trip movies, but to call it just a road-trip movie would really be an understatement; not only is it a thrilling journey of sexual exploration, but also a nuanced exploration of some of the most pressing socio-economic issues of our time. The narrator gives us interesting character histories, and intriguing but haunting societal insights which make the story quite gripping, and makes Mexico a character as well. Other than that, as critic Roger Ebert says, 'it (the movie) is about the fragility of life and the finality of death.' And the film is funny as hell; its humour is quite well-placed. It takes the genre of teen sex-comedy to completely new heights.\n\nClass-division really plays an important role in establishing relationships; even in the best of friendships, there's always a deep-seated impact it has. No matter how close we are to someone, we always keep a few things secret. A free-spirited road-trip cum sexual adventure boils down to a night where true feelings and pinions come out in the open; things are never the same after that.\n\nThe three lead actors, Gael Garcia Bernal, Maribel Verdu and Diego Luna, are really talented, and given riveting performances. Other than the three characters and Mexico, we invisibly become a part of their journey and their lives. The cinematography is spectacular, and captures Mexico with such elegance. The one-shot scene towards the end, in the bar, which starts with conversation and ends with a dance, is quite a remarkable sequence. The passionate kiss which comes after this scene is sensual and memorable.\n\nThe film is quite observant, doesn't compromise anywhere with its storytelling, and doesn't take any moralistic stance on any aspect; that's what makes the film so gripping and compelling.",
            "review_date": "2014-11-12",
            "source": "rt"
        },
        {
            "content": "I loved the movie.  Great road movie.  It's dramatic and funny. A real joy to watch.",
            "review_date": "2014-11-11",
            "source": "rt"
        },
        {
            "content": "refreshingly fresh coming of age story from Mexico..",
            "review_date": "2014-11-06",
            "source": "rt"
        },
        {
            "content": "A movie about no big deal",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Alfonso Cuaron and Emmanuel Lubezki at their best. This is why Americans would benefit from learning a second or third language. If you want to see the best films of all time  you'll need to read subtitles for more than half of them.",
            "review_date": "2014-09-16",
            "source": "rt"
        },
        {
            "content": "Sexually charged and sexily charging from funny pillow talk into a serious think piece, the promiscuous, provocative, and pulse-pounding Y Tu Mama Tambien proves WAY more than just your average sex romp. With the players perpetually in and out of every possible state of undress, you wouldn't expect there to be a message sprawling out between the sheets...but you'd be dead wrong. Sure, there's a narrator bullet pointing the characters' taciturn lives and loves, but it's your own reflective inner voice that truly provides the throughline here, instigated and aroused by titillating bed hopping that points up our own inhibitions and desires. \n\nIn this subtitled, Spanish, R-rated drama, two Mexican teenage boys (Bernal, Luna) and an attractive older woman (Maribel Verdu) embark on a road trip and learn a thing or two about life, friendship, sex, and each other. \n\nOf course, none of this would ever play out to such an engaging degree without a very brave and electric cast. Gael Garcia Bernal, Diego Luna, and Maribel Verdu rightly went onto careers beyond this very memorable film (The Bourne Ultimatum, Milk, and Pans Labyrinth, respectively). Here, they exposed everything to filmgoers in performances that are more than pure exhibitionismtheyre raw nerves, emotional and stinging. It's easy to see why director Alfonso Cuaron went on to fare so well with Harry Potter and the Prisoner of Azkaban. Whether his characters are dealing with threesomes or wizardry, he handles the ignorant bliss of youth with great truth, laughs, and style. Even at their sweatiest, Mamas gleefully juvenile leads learn a lot about identity. \n\nBottom line: Tie This Momma Down",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "After 14 years, this film is still a vital, potent and quietly devastating study of life and friendship. It has only managed to get better with time. A movie influenced both by the \"road trip\" genre and La Nouvelle Vague, it somehow manages to be completely original and fresh. Brilliant filmmaking.",
            "review_date": "2014-08-20",
            "source": "rt"
        },
        {
            "content": "If somebody had told me in 2001 that Alfonso Cuarón would go on to make Gravity twelve years later, I would have laughed out loud. Y Tu Mamá También is a fast-paced road movie depicting sexual desire and naivety of adolescence. At the same time, it knows when to slow down and hush some of its madness, with the sole purpose of  regaining it a couple of minutes later.",
            "review_date": "2014-08-14",
            "source": "rt"
        },
        {
            "content": "This is the kind of film that brings both joy and thought to the audience. This is the kind of film that needs, and deserves, to be watched with care, and re-watched for a second thought. At first glance, this is a film in the form of a  simple \"road movie\", in which the two coming-of-age boys discover the real meaning of life, and sex, with a mature and sorrowful woman with a colourful background of people, places, activities representing the essence of Mexico. But the film is much, much more than that - as beautiful and diverse the Mexican landscape and life is in the background, as cheerful and carefree the boys (and partly the woman) seem to be, the film hides under those layers a sincere and caring depiction of a Mexico in transition, where conflicts and tensions are everywhere (mostly between the upper class and the poor, I guess), and also the confusion and loss of the coming-up-age boys at the real gate of their \"adult\" life, a life that is not only about sex but also about finding the true meaning of \"living\", about the eternal parallel existence of both smiles and tears - just as the \"reflected shot\" of one side the boys cheerfully playing table football and the other side Luisa tearfully saying \"adios\" to her husband. As such, the seemingly nonsense quest looking for the \"Heaven's Mouth\" is actually a struggling search for \"real life\" of the two boys guided by the heart-breathtakingly beautiful Luisa Cortes, whose beauty is actually the best symbol for \"life\". Perfectly complementing the moving story is the superb cinematography that is full of ingenious single shots (a signature of Alfonso Cuaron and his close collaborator Emmanuel Lubezki, which was later pushed to another level in \"Children of Men\") and, more importantly, many wide-angle takes that capture the raw and exotic beauty of Mexico at its finest.  Still, the thing about this film that will stay for a long time in the audience's mind, in my opinion, is its story about the young and conflicting Mexico, as well as the two boys that might have been lost forever, just as their beautiful but empty look, without Luisa - the woman of their life, literally.",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "Uncompromisingly raw.  Uncompromisingly beautiful.   This is one of the best films of its decade.  Cuaron and his cast manage to capture a story that feels like it's evolving before our eyes.  Uncompromisingly honest.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "A story about sex that eventually leads to broken friendship? I watched the whole movie, and I though to myself \"eh, I have better things to do than to watch this cheap Mexican movie.\"",
            "review_date": "2014-07-11",
            "source": "rt"
        },
        {
            "content": "A lot of sex but not much substance. Worth a watch but found it very overrated.",
            "review_date": "2014-07-05",
            "source": "rt"
        },
        {
            "content": "Cuaron creates characters and situations that feel real, directing his fantastic actors in a naturalistic way, to create a provocative and moving slice-of-life road movie",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "Una pieza naturalista en todo el sentido de la palabra. Aunque a simple vista se pinta como un trabajo pornográfico, el objetivo es mirar más allá de lo expuesto. A la hora de la verdad hay que dejarse llevar por el entorno que rodea a los personajes, que exuda vida, patria y problemática; y por los acertados incisos del narrador, el cual, a parte de contextualizar, le da un toque casi literario a la película. \n\nUna travesía donde los personajes se desnudan poco a poco y en la marcha; y aquí no lo digo literalmente.",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "Me encanto! Y Tu Mama Tambien is definitive proof of how much of a genius Alfonso Cuaron is behind the camera; some of the shots were so refreshing in their approach which added some much needed realism to the film. It's also incredibly sexy, hilarious-to-boot and has of my all-time-favourite foreign scripts. The entire cast are just fabulous. Amor! Amor! Amor!",
            "review_date": "2014-06-12",
            "source": "rt"
        },
        {
            "content": "My Favorite Film Is 1941's Citizen Kane.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "With strong performances from Maribel Verdu, Gael GarcÃ­a Bernal, and Diego Luna, Y Tu MamÃ¡ TambiÃ (C)n is a smart, funny, and sexy road film from director Alfonso CuarÃ³n!",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "One of the sexiest coming of age/road trip films I've ever seen.  English subtitles were in yellow and sometimes were drowned out by the background. Not a bad flick, definitely would love to visit the beaches in Mexico.",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "It's basically softcore with a bit more plot, and slightly better characters. I didn't feel particularly attached to either of the male leads, but somehow the final scene brought it all together.",
            "review_date": "2014-05-28",
            "source": "rt"
        },
        {
            "content": "Estamos frente a una de las mejores películas latinas de todos los tiempos.",
            "review_date": "2014-05-24",
            "source": "rt"
        },
        {
            "content": "I think this movie was just plane Horrible",
            "review_date": "2014-04-23",
            "source": "rt"
        },
        {
            "content": "Alfonso Cuarón at his best.",
            "review_date": "2014-04-14",
            "source": "rt"
        },
        {
            "content": "A film to think about. Cuaron's Y Tu Mama Tambien is exceptionally well made and has some high-rate performances.",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "One of the best, if not THE best road movie I've ever seen. Follows two teenage boys and a woman as they journey to a beach by the name of 'heavens mouth'. It really gives an insight into Mexican life and culture, as well as showing specific character relationships (some if which are probably seen as pretty shocking in Mexico) very well. On top of this, it's got some ballsy and strong performances by all three actors and is very cleverly directed. An amusing yet sad story, definitely worth watching this mixture of great talent from the whole production.",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "a really good road trip flick where they certainly learn about themselves,each other,and life.It was also pretty funny and had some deep messages.",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "Energetic & funny, but still deeply emotional, Cuaron directs this with such sympathy, letting his characters have their much needed time during their time of maximum confusion. The voice-over is a little clunky but the camera work from Emmanuel Lubezki is just mesmerizing.",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "sex. just dirty grinding sex...",
            "review_date": "2014-02-14",
            "source": "rt"
        },
        {
            "content": "Alfonso Cuarón directed and co-wrote this sexy art-house hit from Mexico. The funny and moving coming-of-age story centers on two immature teens who get an education in love when they take a sexy road trip with a liberated, unhappily married woman (Maribel Verdu).",
            "review_date": "2014-02-13",
            "source": "rt"
        },
        {
            "content": "A seductive and exotic movie that has underlining ideas which are great. Also the narrative was pretty solid and interesting. But, the sound job and craziness was just bad. Also the ending wasn't satisfying.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "Too exotic for my full liking. Thought it was interesting .",
            "review_date": "2014-01-28",
            "source": "rt"
        },
        {
            "content": "Before he achieved widespread critical and commercial success with Children of Men, Gravity, and the one good Harry Potter movie, Alfonso Cuaron made a little-known Spanish-language drama called Y Tu Mama Tambien. And instead of the flashy special effects and high-concept stories that those other three films have to offer, this movie provides something completely different: An achingly poetic, beautifully acted, and expertly filmed character-driven drama at a time when it was needed the most. This movie has a lot to say, which is both a flaw and an asset. But at a time in film when CGI has all but taken over the medium at the expense of everything else, I'll gladly take it.\r\n\r\nY Tu Mama Tambien is a dark comedy about two stoner Mexican kids who go on a road trip with an attractive, astute, and intelligent older woman named Luisa. The whole film is eerily narrated by a matter-of-fact, straightforward man, making every scene feel formal and important (even if it's not). This is one film where voiceover does not detract from the story, as the narrator's dialogue sounds like a Wikipedia entry-- not taking sides, not giving analysis-- just stating the facts of what is happening, has happened, and will happen in the world the film creates. It also provides a surreal aspect to the bluntly realistic story, which is more than welcome.\r\n\r\nLet's just say this right now and get it over with: Yeah, there's a lot of sex in this movie. It's not quite a Spanish-language version of Blue is the Warmest Color, but it's still over-the-top and occasionally graphic. That will be the make-or-break point for some viewers, and I have to agree that a lot of the sex scenes were unnecessary. I'm fine with nudity, gore, sex, profanity, and spontaneous decapitations in films. All I ask is that they actually drive the plot. With this film, it was kind of half-and-half. Some of the sex scenes were important to the plot, but even the ones that were ended up going on way too long most of the time. But this isn't really a massive problem, because what really matters in this film is what the characters say while NOT on top of each other. Luisa is a truly tragic character, hit two ways by an unfaithful husband and by a final plot twist that I will have the decency not to spoil (it's cancer! Hahahaha!). With a life that far down the tubes, she throws everything away to embark on this odyssey with two people she hardly knows. It's like what Thelma and Louise should have been.\r\n\r\nThe two teenagers, however, are where I have a few problems. They're virtually identical, and their characters aren't quite as defined as they should have been. However, they're similar in the way that Cheech and Chong are-- sure, they're similar, but that's kind of the point. They're good friends, and that makes their banter hilarious and their fights heartbreaking. Still, a little more characterization would have been nice. Nevertheless, these three characters bounce off each other with Tarantino-level force, giving the film a powerful spring to it and filling every scene with well-written dialogue. And it's all set against a beautiful backdrop: Everyone thinks of Mexico as an impoverished shithole (it kind of is), but it really is a majestic impoverished shithole. And Cuaron films it in a way that makes even the most run-down shack of a building look beautiful. I honestly wish I could see the world as if this guy was filming it, because I can imagine that it would be a lot more fun.\r\n\r\nFinal Score for Y Tu Mama Tambien: 8/10 stars. There are some lines of dialogue that don't ring true (although that could be attributed to bad translation), a few missteps when it comes to the characters, and way too many uncomfortable shots of penises, but altogether this is an engaging and powerfully directed drama that both entertains and instills hope in its audience. I expected this film to be a true dark comedy, with Luisa manipulating the boys to her own ends and acting like an evil control freak. But really, the only villain in this film was the rotten world that its characters were thrown into. We need more movies like this, where a few people band together to find some meaning in an otherwise meaningless world. And what's possibly the most heartening (no offense Leo) aspect of this movie is that meaning can be found just in the fact that people look for it.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "this is a must-see. a coming-of-age film with heart, laughs, and some fairly groundbreaking edgy subtext. its as meaningful socially as it is culturally",
            "review_date": "2014-01-21",
            "source": "rt"
        },
        {
            "content": "Entertaining, explicit, sad, and intelligent, this spanish sex comedy is in equal parts funny and realistic, portraying enabled adolescence without role models.",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "This is an awesome coming of age movie but it's not for \"sensitive\" people.  It has nudity, explicit humor, and A LOT of bad words!!!  But the best part of the movie is that it is NEVER boring and some parts are shocking and hilarious.  The characters are great together and you almost feel like they are like some crazy friends you have or used to have.  Highly recommended!!!  I didn't give it a 5/5 because the ending felt rushed and it lacked a few details.",
            "review_date": "2014-01-17",
            "source": "rt"
        },
        {
            "content": "There is much to like in this film. First, it's sexy as hell. Second, it's a lot deeper than it seems. Mostly, I just love Cuaron's writing and directing, and Lubezki's brilliant cinematography!",
            "review_date": "2014-01-15",
            "source": "rt"
        },
        {
            "content": "This movie is okay but not worth all the hype it garnered.  It's most notorious for its relatively explicit depictions of sexuality, but in reality it wants to show the strange way that petty bourgeois concerns can happen parallel to and intersect with more dire issues regarding class struggle.  That's fine, but when it comes to that subject I feel like \"Paradise: Love\" is more compelling.",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Since its original 2001 release, the word classic has been tossed around a lot in discussing Y Tu Mamá También, but it's a sentiment I don't think it has ever quite earned. It's solid, no doubt, an above average coming-of-age meets road trip film. However, I would argue it continues to hold such a high standing because it was on the forefront of the modern Mexican cinema revolution that Alfonso Cuarón helped spearhead, along with his close friends Guillermo del Toro and Alejandro González Iñárritu, and somewhat gets a pass for its faults because of this.\n\nY Tu Mamá También was the definite turning point in Cuarón's career. He had had only middling success in the Hollywood system up to that point, so he returned to his roots, wanting to create something more independent and in the spirit of a film school project. As a result, there's a boyish energy and go-for-broke livelihood within it that is infectious, and he carried over that creative flow into his big budget studio work that would follow, resulting in the best Harry Potter film and the two modern masterpieces Children of Men and Gravity. For example, you can sense the wheels already turning in his head about pursuing longer takes so the camera can exude more of an unbroken, fly on the wall perception, which he briefly experiments with for the first time here.\n\nThe main thing holding Y Tu Mamá También back, however, is how sex obsessed it is. It kind of reminds me of something like Judd Apatow's style with how the two main characters constantly bag on each other, minus the pop culture references of course, and ultimately that's what hinders it from being able to transcend the genre. There's a serious streak running throughout the film as well, acutely punctuated by the offhanded narration, which then builds to a very sobering and surprisingly contemplative conclusion. It even touches on topics like social class, poverty and the political revolution that was happening in Mexico in 1999, context which an American movie likely would have excluded or buried further in the background.\n\nIn short, it tries to have its feet in both worlds, and I wished it had spent more time ruminating on young adulthood and the challenge of dealing with all those outside influences than two horny dudes having a sexual awakening or whatever. It's obviously trying for something a little bit different than the norm, so it is wildly successful in that regard, but a greater variety would have gone a long way towards earning a classic tag from my perspective. For me, Y Tu Mamá También will always be remembered best as Alfonso Cuarón starting to come of age into his own personal mastery of the filmmaking language, which he has steadily built upon and more memorably eclipsed in his work since.",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "Cuarón once again proves that he is much, much smarter than you with this mature and genuine film that succeeds on so many levels.",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "DISCLAIMER Before I begin this review let it be known I was unaware of the English translation of the Mexican title.\n\nWell I looked at the filmography of the Mexican director of the new release Gravity and stumbled upon this.\nLovefilm. Bingo.\n\nThe film is a Mexican 2001 film about the exploits of 2 sex mad pre university teenagers.\nTheir Mexican girlfriends go off on a tour of Europe so they use their time 'alone' to befreind an older woman (who I thought resembled Sandra Bullock) and take her on a slow road trip to a beach.\nThe film descends into several sexual scenes and explores the emotions of jealousy, discovery, and other set pieces to graphic to explain to a Flixster audience. \nThe film has elements of the British sexual comedy Rita, Sue and Bob Too. The film is not a comedy however and the ending is sad.   \nI understand that Mexican cinema is quite graphic but in no way pornographic.  I will certainly have zero Gravity thoughts when I see Gravity. You wont find a thought provoking film like this at your local Odeon. Very arthouse intellectual this.\nAs an aside just shows how poor Mexico is and why we MUST proceed with HS2 in the UK!",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "If you get squeamish about sex scenes, you'll want to pass this one by.  It's kind of trashy and there's a narration that becomes more intrusive than insightful.  Oh, well, it delivered what it promised, but it's not as good as most are saying it is.",
            "review_date": "2013-10-14",
            "source": "rt"
        },
        {
            "content": "Smart and well written and perfectly balanced. This is a great example of \"don't judge a movie by its cover\" - underneath it's seemingly scandalous premise is a beating heart, a message, an exploration of the human condition.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "A complex cocktail of sexuality, 'Y Tu Mama Tambien' on the surface tells a coming-of-age story, but there is a deeper layer that makes an interesting commentary on Mexico that I could not quite grasp on the first viewing. This is a masterfully executed film; the sort that will seem deeper and richer every time you return to it.",
            "review_date": "2013-10-01",
            "source": "rt"
        },
        {
            "content": "The ending gave a very good conclusion to this whole sex-saga-teenage that become the movie's theme. Y Tu Mama Tambien explore the transition between two boys, from child to adult, and a not-so-innocent house wife, who gave the the boys a road trip they will never forget. If you like symbolism, coming-age type of movie, then this one is for you.\n\n8/10.",
            "review_date": "2013-09-28",
            "source": "rt"
        },
        {
            "content": "Sexy movie that at times left me confused (emotionally) how I felt about certain things. Otherwise its a worthy road trip flick.",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "I just love Alfonso Cuarón. This movie not only reminded me why I love cinema but why I love México as well.",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "Emotivo e imperdible road-movie sobre charolastras,amistad y autoencuentro.La pelicula que catapulto a Cuaron,Garcia Bernal y Diego Luna.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "Its in the story that makes this film so great. You can see the techniques that Cuarón has mastered in his later works being developed. Its great to see that he wasnt afraid to do what he wanted from the start.",
            "review_date": "2013-08-19",
            "source": "rt"
        },
        {
            "content": "Best. Road movie. Ever.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "I've stopped questioning the weirdness of foreign movies because they all seem to have some level of craziness. This was pretty impressive and had very good and casual conversational dialogue. It seemed fairly genuine, which is something you don't see all too often. Also, I have to say, the last scene where they made out, what the fuck.",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "Everyone should see this movie at least once.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "finally caught this \"modern classic' if you will, its a far cry from the sci fi/adventure films cuaron has been making lately, but its still good, i really liked the interaction between the woman and the 2 kids, i def empathized with being enamored with an older beautiful woman, it also captures well lots of little details of how young guys act together, (tho i never did the type of things that they did, like jerking off next to each other into a pool) overall a solid road trip movie about people from 2 different view points learning about each other",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "Initially, I loved it and thought it was brilliant- but in retrospect I really loved it and could easily/happily watch it again. It's an incredible experience, everything is perfect about it... Minus the strange sex scene...",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "Not just a Mexican version of The Inbetweeners......LOL!",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "My favorite mexican film",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "Absolute crap. People who like this garbage should be ashamed of themselves.",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "Boring as hell, honestly I don't see the point of the story, nothing exciting ever happens!",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "Now here's a clever, yet sexy movie.",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "thise is a great movie its one of Mexicos modern best cinema    the storie is great.",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "Walks somewhere between drama and high-production erotica but good enough.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "Erotic, funny and genuinely moving, Y Tu Mama Tambien ( or \"And Your Mother Too\") is a one of a kind coming of age import film that deals with sex, politics, infidelity, life and death all in a frank manner and never misses a beat.",
            "review_date": "2013-07-16",
            "source": "rt"
        },
        {
            "content": "He'd done exceptional work before, but Y TU MAMA TAMBIEN was the first sign of what Alfonso Cuaron was really capable of. Blending the sex comedy, coming of age tale, and social commentary into a seamless whole, it's both precise and resonant, compassionate towards its characters and dispassionate in its worldview. Its frank sexuality is revelatory, but never dominant - the focus is always on the individuals and the bonds beyond the menage a trios. The boys turn in great work, but Maribel Verdu's presence hangs over the film like a ghost. And always, there are wider stories between the three, caught in the change of their country.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "Jedan od najboljih. Mojih.",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "Sexualmente inteligente , Cuarón nos da una pizca de como hacer un guion.",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "There are two themes interwoven by this coming-of-age road trip picture: The fates of its three main characters and the state of modern Mexico. Picaresque and funny, it's a Mexican \"Huckleberry Finn\" with sex substituting for violence and an old car for a raft.\n\nJulio and Tenoch are in a club--Astral Cowboys they call themselves--as offbeat as anything devised by Tom Sawyer. They are 17 years old with all the mischief, shallowness, and prurience this often entails. Their girlfriends leave for Italy, and they prepare to spend a summer marking time, preparing for a future that will gel in a few years. Tenoch's wealthy father is urging him to study economics when the charismatic boy would prefer literature; Julio's more working class mother would probably be happy to see him gainfully employed.\n\nTheir bumming around includes weed-smoking, group sex, parties, dips in a country club pool (where they masturbate on the diving boards in a scene that recalls Fellini's \"Amacord\"), horseplay, and conversation. Things change at a more upscale party attended by the president of Mexico where they meet a 28 year old women whose marriage is crumbling.\n\nShe enjoys their clumsy come-ons and agrees to join them on a trip to a beautiful beach--Heaven's Mouth--which they made up as a sort of in-joke sexual pun. The boys don't believe she'll actually call them, but she does. In order to borrow his sister's car, Tenoch is forced to wade through a left-wing political parade, introducing the theme of turbulent Mexico into a film that had previously remained in the insular world of male adolescence.\n\nOnce the trio is on the road--to a beach that doesn't exist--Mexico goes by like a fever dream: beautiful, colorful, hurt, empty. Poverty and police presence on rural roads wake the boys up to a reality different from their own.\n\nThe adult male omniscient narrator/voiceover is more omniscient than most: He sees the past and the future, speaking like the voice of God about the land and people before us in the film, telling secrets, telling the real story and counterpointing quite nicely the shallow exuberance of the boys in the car. When he speaks, all else falls silent.\n\nSo we learn about accidents that took place on a curve in the road or a proud fisherman becoming a sad janitor.\n\nSeeing Mexico as it really is is part of the boy's coming of age, but so is sexual discovery. They take their turn at clumsy sex with Luisa and wind up jealous with each other. Learning they sampled each other's girlfriends on at least one occasion brings the whole thing to a boil, and Julio and Tenoch argue with Latin bombast. Luisa has a theory that the boys have sexual tension between them, the kind insinuated by their morning skinny-dip in a leaf-cluttered pool lensed beautifully by director Cuaron with turquoise shimmer and unaffected nudity.\n\nThe boys and Luisa have secrets that the film's ending will reveal (but I will not). Luisa cements her break-up with her husband across the road trip in melancholy telephone conversations often juxtaposed with the boys' carefree mirth. In one scene she's balling on the phone while they enjoy a vigorous game of fooz ball. Her sadness is deepened by something else, her secret, one only hinted at near the top of the film.\n\nI really must remark that though the film's trio of main characters are listless and lost and that the peasant life it shows is charming but bleak, there are moments of robust joy and sensuality in \"Y Tu Mama Tambien.\" The night scene on the beach that leads to a tequila-fueled menage begins with a dance to a gorgeous ballad picked randomly on a jukebox.\n\nThe element of randomness operates with the film's ending too, which isn't pat or neat or sunny but rings true to life and the deep/shallow bonds adolesents forge, formative but fleeting.",
            "review_date": "2013-05-26",
            "source": "rt"
        },
        {
            "content": "More than just a movie about people bangin' one another.",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "The characters and situations -- although obviously heightened and fictional -- feel extremely real as if this all truly happened.  Great performances and beautiful filmmaking by Alfonso Cuaron.",
            "review_date": "2013-04-17",
            "source": "rt"
        },
        {
            "content": "Schizoid road trip movie about two unattractive, spoiled narcissistic teenaged boys, Julio & Tenoch, with zero responsibilities or consciences, and Luisa, a disillusioned wife, who go on a road trip to the beach. Julio & Tenoch are completely unappealing as characters, and the actors portraying them are not especially attractive either. The sex scenes although explicit (not a plus for me), are not very steamy. Selfishness really isn't very appealing when all is said & done, and honestly, I was hoping someone in the film would horsewhip those boys!  As uninteresting as is the basic story, the film comes across as schizoid because it attempts to provide commentary, sometimes through outright narration, at other times it is woven into the background scenery more subtly, but this attempt to provide a philosophical or political subtext distances us even further from caring about the characters. Worse still, the commentary doesn't seem to go anywhere. Much of it doesn't seem to have any point, ie. do we really care that we are told there was a fatal car accident on some part of the road which the protagonists drive across on their trip? The opening voiceovers  lead us to assume a level of depth in character development which simply never materializes, as if the film-makers tried to paste some other agenda on top of a simple sex & pot saga. It was a waste of an evening, and left me with a nasty taste in my mouth.",
            "review_date": "2013-04-16",
            "source": "rt"
        },
        {
            "content": "Es buena y ya es un clÃ¡sico",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "I love this. . . .don't watch it with your parents. . . .it's not that kind of movie.",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "The detail in this film is so in depth, the whole film as a broad tells a major tale of two people. As well as telling the major tales in a summary of everybody and everything the two encounter. This picture has an interesting message on the choices people make and how they deal with them in the future.",
            "review_date": "2013-03-20",
            "source": "rt"
        },
        {
            "content": "Although not for the squeamish this arthouse mexican film from the now regarded Alfonso Cuaron is so many things at once--road trip, travelogue, meditation on differing class and government, sexuality, its limitations and gender \"norms\" rolled into one. The main component of this film that will deter many is the over abundance of sex and sexual material on camera. But when one looks past this Y tu Mama Tambien (and your mother too--a joke by bernal's character) this is one of the most daring and rewarding films of 2001. First time viewing: 9/10",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "i love the realism, seemingly simple story this movie tells. I say \"seemingly\" because I feel this film in fact peels the layers of preconceived notions of what's important in life. To coin a phrase, there's more to this movie than meets the eye. And with flesh and skin galore, there is indeed a lot that meets the eye. However, none of the explicit scenes are gratuitous - they all fit into the narrative and what this film is about and what it says. The three main leads (Maribel verdu (Luisa), Gael Garcia Bernal (Julio) and Diego Luna (Tenoch)) are all brilliant. Through Luisa's character, you get a perspective of what really matters as we go through life.",
            "review_date": "2013-02-25",
            "source": "rt"
        },
        {
            "content": "Rather unsympathetic characters and an indifferent story.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "Another example of a film with strong character development...",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "Let's be honest we all remember this movie for the filth! Other than that a smooth sailing cool road trip flick.",
            "review_date": "2013-01-23",
            "source": "rt"
        }
    ]
}