{
    "rating": 1.8,
    "release_date": "2002-08-30",
    "num_reviews": 330,
    "genres": [
        "Horror",
        "Mystery&thriller"
    ],
    "summary": "When four bodies are discovered among the industrial decay and urban grime of New York City, brash young detective Mike Reilly (Stephen Dorff) teams with ambitious Department of Health researcher Terry Huston (Natascha McElhone) to uncover the cause behind their violent and inexplicable deaths. The only common factor shared by the victims? Each died exactly 48 hours after logging on to feardot.com.",
    "reviews": [
        {
            "content": "Tbh, im kinda neutral to the movie, its okay in my opinion, but if you guys hate this film, please always respect my opinion, and ill always handle yalls back :-)",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Confusing horror movie that didn't really satisfy.",
            "review_date": "2023-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's going to be a mess if you chop disorderly with imprecision onto what's been given or done. This aimlessly creates an incoherent style dampening the expected/envisioned results the formula structured. There's a beneficial style the film tries to tackle but failed in a cheesy matter when nonsensically turned out messy by squandering the prepared ingredients but realized too late amid the climax delivering a satisfying payoff plus decent ambiguity. If the title and marketed plot draws you in promising a potential horrific thriller, best to learn now is to be very observant of the dated briefly peeked style behind an obviously-diverted title. If tempted, you'll find a better coded site than the glitchy, buffering void. (C-)",
            "review_date": "2022-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "William Malone can produce a nightmare-fueled monster. That monster is FearDotCom. The story doesn't make much sense nor does much else. However what can be said is that the style is persistent, strong and one of the main characters of the film. Try watching it just for the atmosphere and you may not be completely disappointed.",
            "review_date": "2022-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Massively underrated movie with an original, albeit heavily Late 90s/Early 2000s plot.\n\nIt reminds me a lot of Japanese Horror with an indiscriminately vengeful ghost and a psychotic killer: it was clever, refreshing, and interesting. Issues with the writing come from Josephine Coyle and Moshe Diamant, people who seem not very familiar with writing and supernatural horror. This movie definitely needed more exploration into the nature of the ghost's revenge BUT it is good fun.",
            "review_date": "2022-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FearDotCom is slow all through the film with a loosely woven plot line that ends with both sides of good and evil losing. It attempts to mimic The Ring and fails miserably at it.",
            "review_date": "2022-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loud, Obnoxious and Foul but the style was so fucking cool!",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First off, FearDotCom is just full of blown-out style. And whilst the films style surpasses most others, it lacks in everything else. When I say lacks... I mean it lacks BAD.",
            "review_date": "2021-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the story was all over the place, I couldn't hate this movie. The premise was something I never seen before. I liked the gore, visual style, and the ok acting. I see why it's hated, but I liked it anyway",
            "review_date": "2021-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the worst movies i have ever seen, it is horrible and not at all scary.",
            "review_date": "2020-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zero stars, 1 billion percent\nI watched it 4 times in one day, then watched twice a few days later\nStill couldn't fully understand what the hell was going on\nI have this movie on VHS. I got it on DVD to see if a better quality would do it justice. Nah. Boring, trash, horrible.",
            "review_date": "2020-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful terror movie >:((    Great comedy :))",
            "review_date": "2020-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far too interested in making scares than a coherent plot... and the scares don't work anyway.",
            "review_date": "2020-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A confusing mess of a movie avoided this pile of garbage but this is a good sleeping pill also the actual website is feardotcom.com stupid.",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It sucked! Because the website that kills people is a most stupidest idea for a 2002 movie! And it's the worst movie of 2002! And it has a lot of jumpscares! 😱😱😱😱😱😱😱😱😱😱😱😱",
            "review_date": "2020-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Friends have told is wasn't such a thrill to see.",
            "review_date": "2019-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the gritty New York streets, four bodies have turned up in mysterious circumstances. Self-assertive detective, Mike Reilly, and department of health researcher, Terry Huston, team up to uncover the bizarre causes of the deaths which have left New York police baffled. Whilst digging deep in the victims past, it is revealed all have died within 48 hours after viewing a site called FearDotCom. With a sadistic serial killer also on the loose, the detectives are in a race against time to discover who or what is killing the people of New York City.\nWhen I heard William Malone had directed FearDotCom I was expecting a gripping psychological scare, especially after the success of his remake of House On Haunted Hill.  However, I ended up with gasps of boredom and annoyance as this film had such potential. Even after the success of Blair Witch Project, I can appreciate found footage films in the early noughties were relatively new, but it felt like this was an inconsistent version of The Ring, which was out the same year.",
            "review_date": "2018-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OMG. So bad its almost good. ALMOST. Not quite there. Please either be inebriated or stoned watching this. It's the only way to appreciate it fully.\n\nLazy script, and story and all over plot, but with a feint thread of coherence. Very feint. Entertaining, but only in a lesson of every cliché of a 'ghost story' that probably shouldn't make it to film.",
            "review_date": "2018-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is not to be taken seriously. Its \"so bad its good\" horror at its best and I enjoyed it for that.",
            "review_date": "2018-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, I liked it; most didn't, but everyone has movies thAt others DON'T agree with. This is most likely one of them. A good scare AND one that legit made me feel CREEped out.",
            "review_date": "2018-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just do not take it seriously for crying out loud. Watch it like a comedy. Or at least watch it more than often.",
            "review_date": "2018-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fear dot com is a really good Horror film.",
            "review_date": "2017-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's  the most worst horror film I ever see",
            "review_date": "2017-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Supremely stupid in premise and execution. Could easily be repackaged as a comedy with minimal effort.",
            "review_date": "2017-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fear dot com is not scary at all, its mindless, and it doesn't have anything to offer in the horror genre. This is consider one the worst horror film of all time!",
            "review_date": "2016-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a horrible movie with a terrible script, bad acting, and overall horrible characters. Yet, I've grown a guilty pleasure with this movie in some strange way as I am almost becoming a fan for this movie similar with Troll 2, one of the greatest worst movies ever made. I will say in any William Malone movie, the visuals are indeed creative and even at some points can have chills run through my spine especially with the cockroaches in the film. Yuck! Overall, this is a bad movie, but a movie that I've grown an odd attraction to...",
            "review_date": "2016-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "quite ok but nothing too intersting",
            "review_date": "2016-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "feardotcom is a film i had no expectations yet it failed to reach even those. The film dvd looked to be scary from the cover but it wasnt, it was excrutiatingly boring with unmemorable characters for even horror movie standards not at all worth a watch.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feardotcom completely destroys all the potential of it's intriguing premise with slack placing/plotting, seizure inducing visuals and desperate pitiful scare attempts. (it thinks white volleyballs are frightening to us.)",
            "review_date": "2015-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it better when it was called The Ring....",
            "review_date": "2015-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most underrated movie i know",
            "review_date": "2015-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ridiculous horror film about the ghost of a dead girl haunting a torture porn website. Yep, there are vengeful spirits on them interwebs.",
            "review_date": "2015-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do you like to watch?  Do you want to see more?\n\nMike is a detective in New York City that is investigating a string of murders that all appear to have been executed by the same serial killer.  As he investigates the murders, he discovers all of the victims logged onto a strange website that seems to be connected to an old case of his somehow.  When Mike logs into the website, he puts his own life at risk.  Can Mike survive the site and solve the murder cases?\n\n\"You're going to kill me, aren't you?\"\n\"Of course.\"\n\nWilliam Malone, director of House on Haunted Hill, Parasomnia, Creature, Scared to Death, Weird World, and episodes of the television series Tales from the Crypt, Freddy's Nightmares, Sleepwalkers, and Masters of Horror, delivers Feardotcom.  The storyline for this picture is very mediocre but contains some decent gore and murder scenes.  The acting is below par, even for the horror genre, and the cast contains Stephen Dorff, Udo Kier, Nigel Terry, Jeffrey Combs, and Stephen Rea. \n\n\"The death of one is a tragedy.  The death of millions is a statistic.\"\n\nI grabbed this movie off HBOGO when I was in the mood for a horror film.  I remember seeing this in college and thinking it was terrible, it's still pretty bad.  There are some worthwhile kill scenes; but other than that, this doesn't have much going for it.  I recommend skipping this.\n\n\"Time to play.  Time for us to become one.\"\n\nGrade: C-",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alot of people have commented on this films use of cinematography. My thoughts are this: The film makers used near total darkness to cover up the fact that this film is quite possibly one of the worst movies EVER made. I would have gotten more entertainment in this \"Dark\" filming style by turning off my TV and staring at the blank screen.",
            "review_date": "2014-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I barley got threw this movie it was so terrible. (I would have turned it off it was so bad. However, I watched it with my daughter and she wanted to watch it)",
            "review_date": "2014-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually impressive but not a well told story. A remix of some genre memes that have been better done before. The cast is pretty impressive but none seem to be performing up to their usual standard. All-in-all rather disappointing yet still somewhat impressive to see.",
            "review_date": "2014-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent movie. The story isn't 100% original, almost feeling like a modern-day Videodrome meets The Ring, the film still brings some of its own interesting ideas. The major problem with this film is poor script and bad performances from the cast, excel for maybe Rhea. But the film's visuals and visual style are dark, disturbing, and intriguing, helping make this bad film an ok one.",
            "review_date": "2014-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah it's not scary in any sense of the word. The script is horrendous, the direction is unmotivated and disconnected, and the editing is choppy at times, but the visuals in this film, whether it be the lighting or the composition or the production design, are really cool.",
            "review_date": "2014-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can we all please go back and re watch this? I hope some day we can all come to terms with what this movie is.......Good?\n\nNo not in the slightest, this movie astonished and perplexed me to no end though. It's hardly original, but the final product is undeniable unique. I haven't been captivated, entertained and wholly engrossed in a movie this much for quite some time. \n\nAnd it's not even as simple as \"so bad it's good\"....this film's over the top slick style transcends average film making in a way few movies do. It's plot is pure gibberish, so nonsensical that it feels complex and exhilarating. Nothing ever adds up, nothing even outs, and that's where the creepiness and the mystery stem from. All of this is anchored in by the ridiculous over-direction, turning this into a horror epic of massive scope and proportions. \n\nIt's like the filmmakers had a final product in mind, but tried building it with all the wrong parts, and way too many of them, yet still managed to violently beat and force it into some extravagantly distorted image of their original design.\n\nI'm calling cult classic on this one, someday. So why don't you get ahead of the curve, go give this one a re watch. It's far from a waste of time.",
            "review_date": "2014-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A serial killer tortures his victims online and as a result curses those who dare to enter its domain. The plot is an incomprehensible mess with only the look of the film being its single highlight. A major disappointment from director Malone whose remake of 'House on Haunted Hill' was a visual masterpiece.",
            "review_date": "2014-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What on earth did I just watch? I had such high hopes after reading the blurb thinking I was about to watch a gritty psychological thriller only to be very disappointed with a weak ghosty film. The actors could only work with what they had and did relatively well in the circumstances. The last half hour had some alright effects. On the whole this was an appalling film and note to director - ending a film hugging a cat only worked on homeward bound.....",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so full of fuck! It's a cinema student's homework assignment! honestly actors STOP taking seroquel and other barbiturate drugs before filming. BE MORE PROFESSIONAL acting believe it or not is a profession.... a job... \n\nAnyways synopsis: people are dying within 48 hours of each other, as a serial killer surgeon films it. One of the victims wills herself into the guro (goretastic, computerize archive that is the internet), to punish voyeristic viewers of fear.com (a site that she created). Two heroes have 48 hours to \"find her\".",
            "review_date": "2014-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cheap horror film, nothing very memorable here, a good cast but a film completely forgettable, un-innovative and really not scary at all. when the title says FearDotcom and you watch something so random, you realize quickly something to lost along the way...the director maybe? or the script writer?",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whichever reviewers gave this a positive review should have their column canceled.",
            "review_date": "2013-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Id like to compare this movie to Halloween 3: Season of the Witch; H3 Had a promising concept lacking in substance - Feardotcom was very much the same. the acting was very satisfactory and numerous elements promised chills but the plot is missing vital pieces of information that which ruins the experience.",
            "review_date": "2013-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tedious, confusing and cliche ridden horror that gets a star and a half for looking stylish and having decent effects. The kind of film that could put you off horror movies forever.",
            "review_date": "2013-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far from worst.  For a horror flick, it's not bad.",
            "review_date": "2013-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3% is somewhat harsh. It isn't anything special, but I have certainly seen a lot worse. Worth watching if you like your horror Flix.",
            "review_date": "2013-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "let it be know. i worked for the people who made this piece of crap...i was not consulted on it being made, and if i were i would have punched the producer right in the face and said \"you should be flogged for your stupidity!\"",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring. Doesn't keep you interested. The idea of the story of a website that you enter and 48 hours you're dead was good. It was just badly done. Too many cochroches crawling to the woman and coming out of her mouth. Gross! I do like the imaginary of the  girl with the white hair and white dress with the white ball. The girl revenge at the end was the only tiny i do mean tiny bright in the end.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This flick has, in a way, lots of similarity with The Ring, in that both movies deal with people watching a haunted piece of media, out of their own morbid curiosity, and dying under mysterious circumstances after a period of time.\n\nUnlike The Ring, this movie really sucked. At first it seemed interesting, the concept was actually good, there were people dying from being exposed to a \"murder porn\" website, however the plot constantly gained more absurdities until it just collapsed. In the end we were left with a boring old ghost story and hallucinations based on the characters' worst fears.\n\nIf you ask me, I'd like this film if it threw away most of the supernatural elements and concentrated more on the concept of people using the anonymity of the internet to feed their morbid curiosities. To my luck, a movie was made on this subject, titled Untraceable, so if you too are interested check it out.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just no. I have no idea how this managed to be made, someone must have been blowing someone at Warner Bros for this mistake of a film to happen. Hang some string through the DVD hole and stick it on a cane in your garden to scare the birds away from your strawberries in the summer... that's as scary as this DVD gets.",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A friend of mine said it would be better with Peter Falk playing Columbo as the main character. I completely agree. The movie extra sucks now that he doesn't...",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "argh if u like the ring u will love this!!",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I seen this when i was 10 and i wasnt scared.pathetic huh?",
            "review_date": "2012-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Standard film, mediocre, nothing further, worth one watch or two.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visaully stunning crap film has a plot that was just TOO earily close ot \"The Ring\" but not eery enough or well done.   Horrible acting bog down the already crappy story line, and even pretty visuals can't make this movie worth watching.  Stephen Dorff (HOTTIE) does fairly well, but you wonder what drives him to such terrible movie roles?",
            "review_date": "2012-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of a cheesy horror film.",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a shame. A great concept that was executed terribly. At times it was just way too dark but not dark enough for the \"pitch black i-don't-know-whats-lurking-there\" fear.",
            "review_date": "2012-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best part is that the website that is haunted is feardotcom.com.",
            "review_date": "2012-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was alright not the best not even close",
            "review_date": "2012-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When are they going to stop making horror films that don't make sense.I really can't stand movies like this it is terribly acted and written,but it is also full of these ideas and moments that are intended on making the viewers say \"yeah what if that really happen?\".The problem is that they are something that a grad schooler would think up and they are not insightful why so ever.So for this horrible horror flick I gave this film a D.",
            "review_date": "2012-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best horror film made. I was scared by the end though.",
            "review_date": "2012-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Screwed up movie but ok for a thriller or what have you",
            "review_date": "2012-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "didnt scare me. bored me if anythign",
            "review_date": "2012-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could have been great, but it wasn't.",
            "review_date": "2012-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very creepy... go to a website and that's a wrap... no thanx... too much like the ring...",
            "review_date": "2012-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poor in scares and high in stupidness, Feardotcom did nothing with its promising premise.",
            "review_date": "2012-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inexplicably dark in every scene. Corny dialogue. McElhone barely tries to cover her accent. The plot is a mess that fails to make any sort of sense. Way, way too many close-ups. In short, Fear Dot Com is unwatchable garbage.",
            "review_date": "2012-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Detective Mike Reilly (Stephen Dorff) is haunted by a case he could never solve - a series of murders conducted by a killer known as The Doctor (Stephen Rea).  Meanwhile, a new string of murders and bizarre deaths are occurring, and Mike brings in Department of Health Terry Houston (Natascha McElhone) to find out what's behind these deaths.\n\nThey uncover a website hosted seemingly by the spirit of a woman who kills anyone who watches the site in 48 hours.  She has ties to The Doctor, and now Mike and Terry have 48 hours to find The Doctor and the woman before their time runs out.\n\nHmm...someone who watches something dies in 48 hours by a supernatural being.  Sounds familiar?  Think \"The Ring.\"  Although that didn't come out until years later, the source material, \"Ringu,\" existed in Japan since the late 90s.  Although it doesn't blatantly copy it, there's more than one connection to the film.  I've been told that this is one of the worst films ever made, and I have to agree with it.  Not only is the storyline completely stupid, but most of the film takes place in some of the darkest areas around, so it's difficult to see what's happening (if you cared), and the ending was a jumbled mess - just like the rest of the film.",
            "review_date": "2012-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't ever watch this.",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not one of the best horror flicks....but the basic storyline could have been a LOT scarier had it been done better!!",
            "review_date": "2012-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid. Had potential.",
            "review_date": "2012-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A horror film that showed promise early on with its premise and set-up, but it goes on way too long and the few creepy moments are negated by the rambling and boring police procedural plot.  The film also never seems to really decide what it wants to be: does it want to be a slasher/serial killer film or does it want to be a supernatural horror film?  Caught somewhere between Silence of the Lambs and Pulse, fear dot com ultimately feels more tedious than terrifying.",
            "review_date": "2012-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The idea is a nightmare waiting to happen, the film is a bedtime story.",
            "review_date": "2012-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Makes me yearn to use colloquial phrases like 'sucks big time' and 'piece of crap,' but, alas, I cannot bring myself to do so except with quotation marks.",
            "review_date": "2012-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible acting, not scary, stupid movie. Also, the website featured is \"www.feardotcom.com\". WTF",
            "review_date": "2012-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant idea shot to shit by a terrible script and no direction. One of the worst films I've seen",
            "review_date": "2012-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "haha this one got horrible critic ratings... it's actually not THAT bad. i have it on dvd. do i watch it? no, hardly never. but i'm not going to say that i didn't like it at one point of time in my life.",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i actually liked this.",
            "review_date": "2012-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie wasnt all that bad!",
            "review_date": "2012-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a mess! Not the kind of horror flick I would recommend on any level!",
            "review_date": "2012-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't waste your time on this garbage.",
            "review_date": "2012-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sure this movie has its flaws (a terrible leading lady, a plot alil too similar to Ringu, Kairo, Stir of Echoes and Videodrome) but don't let that stop you from enjoying this visual feast of a movie. This is a kind of horror that gets its recognition decades after the fact (lucky the 10anniversary is upon us)",
            "review_date": "2012-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good horror movie.  this movie is actually scary.  so much so that i couldn't watch it home alone without the lights on.",
            "review_date": "2012-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the story and the action to this movie! It was sexy in a disturbingly creepy sort of way!",
            "review_date": "2011-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "creepy couldnt finish",
            "review_date": "2011-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The problem with feardotcom is not that it's bad - there are a lot of movies out there that sucks even more balls that this one, but most of them at least have a simple story, even if most of the times it's full of plot holes and incoherences. This one, however, manages to combine so much problems revolving around the story that the whole thing is even harder to understand than the ending of Tim Burton's planet of the apes, with a complicated, incomprehensible story that runs in all directions and loses itself in its own complexity of pure non-sense.\n\nIf only the movie just had a crappy story and managed to excel or even be slightly good at one point, it would be worth watching, even for a good laugh, but no, the film is both incredibly stupid and incredibly boring. If you are looking for one of those movies that you are supposed to take seriously but are much better when watched as unintentional comedy, skip this one because you will only find here a terrifyingly bad The Ring ripoff that doesn't even manage to make you laugh out of its stupidity.",
            "review_date": "2011-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh so very bad but I couldn't stop watching.",
            "review_date": "2011-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as it could have been",
            "review_date": "2011-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think that the movie is bad, the only thing is that the script is so original and imaginative, but not so well executed.I only gonna say that i love this movie.",
            "review_date": "2011-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad film but it never really went anywhere.",
            "review_date": "2011-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very scary\\twisted horror flick about a killer website with very good scares\\scenes.",
            "review_date": "2011-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a pendejete and a waste of time... :/",
            "review_date": "2011-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was without a doubt one of the worst films ever made! I only watched it because I adore Michael Sarrazin. Thankfully HIS part was well acted and short lived. Sadly this film hit theaters on my birthday!",
            "review_date": "2011-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some images are cool in this but othewise it is total shit.",
            "review_date": "2011-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was terrible.",
            "review_date": "2011-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fear Dot Com has often been dismissed as one of the worst horror films to be seen. Well I can say with that it's a fact that there are far worst films the Horror genre has produced over the years. Obviously the main reason that this film is dismissed so easily is that it shares similar plot lines to The Ring (which came out the same year, the American remake that is). Getting back to this film, I thought it was enjoyable enough to kill time and it was entertaining. However like everyone else, I thought the plot and acting was pretty thin. But as a popcorn horror film, this film works.  Obviously not the best film, but with putting into focus all the other horror films that have come out in recent times, Fear Dot Com doesn't deserve all the flack it has received. The ideas presented in the film have been used before, but still the concept seems interesting. I personally think that the idea of dying in seven days has many angles to a good story. With The Ring it was a video cassette with Fear Dot Com, it's a website.  Both films are good and very entertaining in my book. I wouldn't call Fear Dot Com great, but I would call it a pleasant time waster, which is what it is. This film is way better than a lot of trash in horror nowadays, most notably My Soul To Take. Fear Dot Com is the type of that you have to shut your brain off to enjoy. Mindless entertainment.",
            "review_date": "2011-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is truly the worst movie ever made",
            "review_date": "2011-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tale of a snuff web site with a supernatural twist. Has a feel similiar to the Ring, but nowhere near as good. A rainy days only movie.",
            "review_date": "2011-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is a bit underrated in my eyes. i find it alot better than the ring for one, and the combination of torture film mixed in with a ghost story to be a bit more original than most. the performances were a bit mediocre, if that. the one that was semi decent was Natascha McElhone. the thing thats the biggest flaw in this film is the direction, the freakin lighting was annoying i know that they were striving for horror tones and such but, there were moments i literally couldnt see a damn thing. i have to say the story what actually happened was good its the direction and choice of actors that truly ruined the film.",
            "review_date": "2011-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Huge waste of Stephen Dorff and Stephen Rea. This was much better when it was an episode of \"Millennium.\"",
            "review_date": "2011-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the greatest horror film out there, but it is laughably naive in places. Worth the watch, at least once.",
            "review_date": "2011-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like your scary movies with a side of boobs, this movie was made just for you. I'm sure fans of the Hostel series would enjoy this. It did have a pretty solid storyline though. No mistakes accounted for. I liked it, but not enough. It barely held my attention and wasn't a bit scary.",
            "review_date": "2010-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, whats next 'the Ring' you say? Oh, boy! I love that movie... Wait... This isn't 'the Ring' at all. Or at least it doesn't want you to know it is. This film is a shameful knock off of 'the Ring' and if you try to say \"But Trevor! 'Fear Dot Com' came out a year before 'the Ring'!\" I will direct you to the film 'Ringu' which is the original Japanese version of 'the Ring' circa 1998, and you will feel stupid for ever defending this turd of a film.",
            "review_date": "2010-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wowza this sucked.  I should have known when I rented it in 2003 and couldn't finish it but something drew me back in.",
            "review_date": "2010-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is just sick. Not worth seeing, at all.",
            "review_date": "2010-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trippy-ass movie. Great the first time, but couldn't sit through it the second. Ended up fast-fowarding to the crazy end scenes.",
            "review_date": "2010-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie sucks the storyline was boring, not even scary only got scared once, the acting was terrible, the character development was dull as overrall this movie is a load of shit",
            "review_date": "2010-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sounded kinda cool when I heard about it, but fails in its execution.  What the movie fails to inform you of in most plot summaries is the fact that the website in question is somehow run partly by a supernatural force.  Is the film as stupid as it sounds? YES! As it runs its course, this film fails epically (which is really unfortunate, because it was pretty cool for the first few minutes).  In the end, FearDotCom ends up being a terrible mashup of One Missed Call and Untraceable, with a little bit of The Ring thrown in there for suck value.",
            "review_date": "2010-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As ridiculous as it is implausible, Feardotcom finds stupidity at the bottom of a barrel, dredges it out, and forces it down your throat. This is the biggest 'The Ring' rip-off you are ever likely to see. And I will never get that hour and a half of my life back.",
            "review_date": "2010-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A scandalously bad 'Ringu' rip-off. Everyone involved in making this movie is under suspicion of doing their best to be at their worst.",
            "review_date": "2010-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"It's time for revenge!\" (October 10, 2010)",
            "review_date": "2010-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is dumb ass hell, but I liked it. It is over the top and ridiculous, but I feel it did start the torture porn genre. And for that its worth a watch. I liked it. It was fun and entertaining. Another guilty pleasure for horror fans.",
            "review_date": "2010-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should be re-named ShitDotCom.",
            "review_date": "2010-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a piece of crap.",
            "review_date": "2010-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very very boring and crap",
            "review_date": "2010-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genuinely unpleaasant working of a Millennium plot with some surrealistic touches.",
            "review_date": "2010-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad, but not good, either. Stephen Dorf should have taken his shirt off.",
            "review_date": "2010-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh the special effects were good... but the plot, characters, storyline, sequence of events, dialog, villain, and just about everything else left something to be desired to say the very least. A terribly made movie, only go see it if you are digging at the very bottom of the barrel.",
            "review_date": "2010-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good idea....Aweful result. It stinks...And guys in the truck....guess what...It doesn't get scarier just because it's darker. Was the lightning crew on vacation or what? Ridiculous...Like in the scene when what's-his-name looks at the clock and says \"it's noon\"...I guessed midnight....lights out for sure....overall....didn't make the grade",
            "review_date": "2010-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching this was painful.",
            "review_date": "2010-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not bad, but nothing spectacularly different from what I have seen before",
            "review_date": "2010-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "considering the cover of the movie, the description, and the pictures on the back of the video would make it seem like itd be very effective at delivering scares, this was really disappointing. the idea of this movie is good, but is a lot like the plot of the ring. so if youve seen the ring, you would likely be disappointed. not comparatively judging, it is a decent movie, but it is nothing compared to movies like Untraceable (same-ish concept) and The Ring.",
            "review_date": "2010-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Painfully acted and horribly inept, this film is itself torture. We're treated to a scareless horror film that fails on all fronts. The villain appears to be trying to channel Jame Gumb and Hannibal Lecter at once. The two different horrors becoming intertwined seemed very haphazard as well. As is standard, if I sat through the whole thing it gets at least 10%.",
            "review_date": "2010-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fear dot come has an interesting premise, but the plot is very jumbled and its not at all scary. i like the idea behind the film but the bad acting and terrible dialogue makes it somewhat laughable. the effects are terribly done and it doesn't provide any thrills or scares throughout. like i said i liked its storyline and idea, but it was executed poorly.",
            "review_date": "2010-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It isn't really good but not that bad nearly everybody says sure it's a Similar Story to Ringu but is scary and entertaining",
            "review_date": "2010-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A serial killer is showing his killings online.",
            "review_date": "2010-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A serial killer is showing his killings online.",
            "review_date": "2010-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If u sleep alone, dun watch this",
            "review_date": "2010-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Detective stumbles upon a string of deaths somehow connected to a scary website fueled by a vengeful spirit that, upon viewing, kills you within a 48 hour time limit. Sound familiar? It should. It's basically the Ring, but with better imagery.\r\n\r\n*Stephen Dorff's acting is terrible but the others pick up the pace for him.\r\n\r\nIt wasn't great. It wasn't mindblowingly terrifying. All in all it was alright. I think I give it an 80 because it combines torture porn with anonymous voyeurism, both of which scare the Jesus out of me.",
            "review_date": "2010-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent Movie,if it was possible it would get 200% rateing.",
            "review_date": "2010-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "thought this movie was good at first the graphics are cool but the idea becomes old as newer horrer thrillers come out. I dont know it was mediocre",
            "review_date": "2010-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director William Malone did House On Haunted Hill (1999) remake which was good. But this was not even a movie. Thats how bad it is.",
            "review_date": "2010-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly couldn't care less that it was considered \"unoriginal\", it doesn't mean that is can suck almost 100%. The acting was terrible, the way that the movie was trying make itself creepy just bored me to tears, and i never want to see another piece of crap like this again! The only decent part of the whole thing was some of the special effects that they used, but the rest sucked major big....",
            "review_date": "2010-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I personally enjoyed this film a lot, but I will say that though it can be a lot better, the visuals and the images were wonderful. The story needed expansion and some better use of details, which seemed slipshod but I personally liked this a lot.",
            "review_date": "2010-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an american response (homage? copy? ripoff?) to all the j-horror movies...naah i'll stick to ringu and saw!",
            "review_date": "2010-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hahahah, yeeeeah, that was fun. *blank face*",
            "review_date": "2010-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"wanna see a really killer website?\" a creepy horror film  se7en meets the silence of the lambs meets in the internet (the next generation) fear dot com tells the story of a website named of course fear dot com  which anyone goes online in the next 48 hours the viewer will be dead/murdered/killed then which the film starts out with a civillian is out on the subway train station waiting I think possibly for a ride then he sees a little girl near the subway tracks he has fear of death which then he tries to rescue then he finds out that she wasnt real then he gets ran over by the oncoming subway train then after that the camera shows a dead body of a young woman in a bathtub which later even though the police dont think that its a disease which they claim it is but the website titled fear dot com the same title as the film then after german young man is sent to the town's jail and then he dies which mostly then after that there were more killings suicide,and even especially toture then after that we all find out what the website does which that part I do not want to spoil feardotcom is not a bad film at all even that is what a lot of people claim to be but fear dot com has great death scenes great but disturbing gore scenes and a very strange ending fear dot com is a great horror film highly recommended for any horror fan and a great horror hidden gem  film's box office: when the film first opened august 30th 2002 it opened at #5 because of the mel gibson and M. night shaymaylan's box office hit signs highly recommended for any horror fan a great film must see for the horror fan inside.\r\nFEAR DOT COM\r\nstarring:stephen dorff (felon blade and the gate) natasha mcelhone (solaris and ronin) stephen rea (interview with the vampire) udo kier (python and andy warhol's flesh for frankenstein) amelia curtis  jeffrey combs (re-animator the frightener's bride of re-animator house on haunted hill (1999) return to house on haunted hill and beyond re-animator) nigel terry gesin cukrowski and michael sarrazin.\r\nfilm's rating: R for strong bloody violence throughout language disturbing and grisly images including toture  and graphic nudity\r\ndirected by:william malone (house on haunted hill (1999) creature and writter of universal soldier the return and supernova)\r\nrelease date:august 30th 2002\r\ngenre:horror mystery crime and suspense.",
            "review_date": "2010-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just another bad horror movie that does not make much sense.",
            "review_date": "2010-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bad bad bad movie. not even the eye candy that is stephen dorff could save it!",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unflushable turd. These people in this movie are glad they are dying because they are in such a crummy movie.",
            "review_date": "2009-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a brilliant movie!",
            "review_date": "2009-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Creative for its time... with some definite scary moments.",
            "review_date": "2009-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie for the laughs it brought on a snowy night at Berks. But in reality, it is a garbage movie.",
            "review_date": "2009-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far, the most boring horror i've ever seen. This shouldn't even be counted as horror movie",
            "review_date": "2009-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mostly just bad overall. Not much surprise or anything really scary during the entire movie. I love horror movies but it just seems that more of this stuff keeps coming out, and we keep spending money to watch them only to wish we hadn't.",
            "review_date": "2009-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "could have been better",
            "review_date": "2009-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is usually very underappreciated and honestly its not a bad movie its actually very entertaining and trust me ive seen some shitty movies",
            "review_date": "2009-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really horrible movie\r\nThis is just so fuckin bad",
            "review_date": "2009-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a weird movie. Though the movie Untraceable really reminded me of this.",
            "review_date": "2009-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "apperently with few fans i have to say that i kind of liked the movie...",
            "review_date": "2009-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a huge horror buff for so many years, I thought I had seen it all: every breed of monster and maniac imaginable, homicidal semi trucks, and even a killer washing machine. So when I heard about a movie about a website that kills people via a brain hemorrhage exactly 48 hours after they view it, I was glad to hear that finally something fresh was coming to theaters. \r\n\r\nAfter coughing up my $8 on opening night at one of Detroit\u0092s largest theaters, like a kid at Christmas I gleefully made my way to my theater where I was greeted with my first omen of doom: a total of 5 people in a screening room that seats 600. Apparently, we were the only ones that had not heard how vile this movie is.\r\n\r\nThis movie was such a waste: of Dorff\u0092s and Rea\u0092s talents, of moviegoers\u0092 money, and of some of really cool shots and cinematography. Director William Malone (\"House on Haunted Hill\") once again tries to distract the viewer with stunning visuals from the fact that the movie has little logic and no substance. \r\n\r\nThe acting was pathetic. Dorff was so stale that he could have been replaced with a piece of cardboard, and McElhone\u0092s British accent came and went throughout the picture. The only good performance came from the wonderful Stephen Rea, who has been in over 50 films. In all fairness, it is hard to act when the script is garbage, and the dialogue is ridiculous.\r\n\r\nIn conclusion, there are no redeeming qualities for anyone to ever see this film. Ever. Fear Dot Com is sure to crash servers at box offices everywhere.",
            "review_date": "2009-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Feardotcom\" fits into the latter category of failed efforts,though I would say it transcends the examples I cited (which really isn't saying much),if only because it sits comfortably in the insulated sewer of horror-genre conventions and clichés that provide a suitable reprieve from the stabs at social commentary.Also,had almost exactly the same story as in \"The ring\".The only difference is in which way the victims get exposed.In \"The ring\" it was via a movie-sequence and here it's by a site on the internet.\r\n\r\nWhile the film has one of the horror genre's most creative stylists at the helm and major-studio support,\"Feardotcom\" quickly becomes an absurd, narratively rickety slog through tonal inconsistency.It's true that the script really is not the greatest material available,but come on,really,how can a director can expect us to be scared by a scene in wich Dorff tries frantically to close a elevator door because a bouncing ball is coming fast towards.\r\n\r\nFeardotCom could have been better as it fails to mix the real life internet angle with the supernatural part of the story that well.The film was far too predictable.Everything about it was very predictable,I guessed who was going to die,when they were going to die and (almost) exactly how they were going to die.The plot is so lacking a central focus point,a driver if you will,that at times it is as disjointed as some of the butchered bodies on display.Those strands that do exist are very loose and don't really hang convincingly well together.The end result is that there is no real tension to speak of - certainly no fear.While I did think that the main idea of the website was good,it went nowhere of merit.\r\n\r\nThis film really tried to convice me that energy from computers was what was causing all of this mayhem.That the Internet has a soul that 'travels through the wires', killing off people 48 hours after visiting a website.Maybe if the script was written better maybe they could've sold me on this far-fetched theory.But that didn't happen,which is one of the main reasons why this film is bad.The dialogue is horrid and the acting is wooden.Stephen Rea is the best.He seems to be having a good time and his Alistair Pratt is a villain I truly hated.\r\n\r\nIt's in these moments when he comments on the internet and tortures a beautiful,leather bound victim that the movie is both as interesting as it's going to get and as intolerably sadistic as I've seen from any movie in a long time.Malone inflates this stuff up to hyperbolic extremes.The movie isn't actually scary as it is just manipulative.We sit there nervous and uneasy not because we're scared,but because we don't want to see an innocent women get gutted alive.Stephen Dorff manages to come off not that bad,but Natascha McElhone was nice.\r\n\r\nThe visuals  have really nothing to do with anything that happens in this film.It's not some deep,emotional burden that uses symbolic structures and astounding breakdowns to amplify the viewer's attention span and make them think. This is a thriller with a ghost story.It has no symbolic substance meaning that if you really wish to see how miraculous this film is you have to watch this film in such a fashion that you will be able to absorb the films good qualities,on mute.\r\n\r\nIn general this movie is bad,because it does not correctly handle this scenario and also appears to be much influenced by the movie \"The ring\" and \"Ringu\".\r\n\r\nHere are the figures and what they mean for me when I do the rating. \r\n\r\n100%:Masterful \r\n90%:Incredible \r\n80%:Impressive \r\n70%:Good \r\n60%:Decent \r\n50%:Mediocre \r\n40%:Poor \r\n30%:Bad \r\n20%:Terrible \r\n10%:Abysmal \r\n0%:Worthless",
            "review_date": "2009-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "effective imagery. natascha mcelhone should play a cop/investigator in more. she's good at it!",
            "review_date": "2009-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waste of time and money.",
            "review_date": "2009-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "boring as heck, actually i don't even give it a star, i give it a triangle",
            "review_date": "2009-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I checked out the site.  I'm still alive.   Zzzzz, wait, someone's at the door BRB",
            "review_date": "2009-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could of been sooo much more. But decide to go the route of the Ring, but with more of a sense of Hostel put in with it.",
            "review_date": "2009-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "scary..not too scary but decent. kinda made me laugh at times",
            "review_date": "2009-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even Stephen Dorff couldn't make it good. Just bad.",
            "review_date": "2009-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "all i remember about fear dot com is that it sucked and there were cockroaches.",
            "review_date": "2009-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How do you have a movie where people die based on their fears, and still come up with shitty death scenes?",
            "review_date": "2009-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A boring, incoherent mess. Tries to be Ring-like but fails, plus it's not scary at all. I stopped caring about a half hour in. The cast isn't the best either.... Don't get me wrong I've always liked Dorff, but he seems to be better as a bad guy (see Blade). Anyways, there is NO point to see this movie unless you wanna bore the shit out of yourself.",
            "review_date": "2009-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I blame the screenplay for making this film very, very bad. I did enjoy some of the incoherent crap that was coming out of the film because it made the direction stand out. The actors weren't good, they were plain bad. Now not everything in this film was a total lost. I did mention the direction. The images were pretty disturbing to look at and even made the film slightly watchable because of THAT alone. The music heightened the tension, even when there wasn't any and it created a sense of dread. At times I felt like I was watching someone's nightmare come to life. I think the best way to view this film is by not paying, I REPEAT, NOT PAYING any attention to the dialogue because none of it makes sense. Just watch the images.",
            "review_date": "2009-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not really what I had expected...and fairly boring.",
            "review_date": "2009-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An awful mess that doesn't connect on any level. fear dot com is about as fun as the blue screen of death on my laptop.",
            "review_date": "2009-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The script here is very bad, and it basicallyl steals directly from both The Ring and Saw.  It is really just a mess of horror cliches put together into an hour and a half movie.  Don't waste your time.",
            "review_date": "2009-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the fact that i saw this when i was twelve probably made it a lot more frightening. still, the fact that a fear of roaches drove someone to death is kind of scary.\n\nthough it would be scarier if the roaches actually did the killing.",
            "review_date": "2009-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot was promising but overall I felt dissapointed. It's very predictable. Also I felt it went over the top with action in order to make a scene cooler, while the final effect was rather tasteless.",
            "review_date": "2009-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fear Dot Com had the potential to be a very good and worthwhile horror film. It's basic plotline is interesting, with a serial killer posting his kills on the internet, and the more subscribers the site gets the more he kills. It could delve into audience's love of voyeurism and the rise and dependence on reality television and internet in our lives. Instead, we get a crappy silly rehash of The Ring, with the cursed videotape being replaced with a cursed website. Heck, they even see a creepy little girl right before they die! Plus, the way the film was shot was so dark and dingy that I struggled to even make out what was on the screen. So yeah, this film is kind of a waste of time. Very unoriginal and not particularly scary or jumpy or creepy. And the website in it is called Feardotcom. com, not Fear.com, which seems kind of silly to me. I don't know why. In conclusion, this film is rubbish!",
            "review_date": "2009-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hai....\nad me in my friendster account...\ngcute_baby18@yahoo.com\n\nhope ull add me...\n\ndis s my cell no.\n09074775348",
            "review_date": "2009-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pros and Cons of the movie: \nPros: It ended.\nCons: It existed in the first place.\n\nIt's like a really bad version of Saw meeting a really bad version of the Ring... And then make it even worse.",
            "review_date": "2009-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In watching this film, I was very much reminded of another...The Ring !!\nDifference being, The Ring was better and FAR superior.\n\nSimilarities in that it's a tale of a vengeful spirit, who uses contemporary means (namely a website) by which to communicate and exact revenge.\n\nFear Dot Com has the same gritty, dark feel but with badly cast characters.\nThe actors themselves, while decent in other films, just do not pull it off here with some cringe-worthy performances.\n\nNot a film I'd recommend !!",
            "review_date": "2009-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i rili didn't understand this movie...",
            "review_date": "2009-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a pile of crap.",
            "review_date": "2009-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More like...lame dot com. Can I get a hell yes?",
            "review_date": "2009-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical horror flick.",
            "review_date": "2009-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a creepy movie. The idea of the story seems to always be scarier than the actual movie itself...but it's something to add to the horror fan collection.",
            "review_date": "2009-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Promising plot but execution just fell flat. There was no air of mystery or suspense. The two leads didn't have chemistry either and worse, character development was poor. This is one of those horror flicks that you can watch before going to bed because it's so boring you'd be so sleepy after watching it, that is, if you even reach the end of it.",
            "review_date": "2009-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sensational movie, gruesome mystery. Great acting, creepy music and lots of blood what else do you require from a 'B' Grade horror flick which surpassed my expectations",
            "review_date": "2009-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible. They seem to churn out these \"shock\" thriller / horrors thinking we'll buy the \"clever\" plot line and in-your-face imagery. There's nothing shocking, clever or in-your-face about this film. Avoid!",
            "review_date": "2009-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ridiculously lame and blatant ripoff of Ringu.  And I wish stupid movies wouldn't pretentiously leave themselves open for sequels.",
            "review_date": "2009-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In accordance with American ideal of a horror we get a psycho, mutilated bodies, cockroaches and all that spiced up by sexual abuse. As if these were the only available means to scare people.",
            "review_date": "2009-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was alright, nothing spectacular though",
            "review_date": "2009-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupidest.  Also, not scary.",
            "review_date": "2009-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film was 'the ring' only you watch it on-line. the similarities were way to close to miss from the look on the face when they die to finding her in water. if you ignor that then it was an okay movie.",
            "review_date": "2009-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[img]http://horrorfilms.weebly.com/uploads/7/5/4/6/754609/1892159.jpg[/img]\n[left][size=2][color=#567ee6]Rating - MA15+ for High Level Violence\n\nTagline - [/color][/size][size=2][color=#567ee6][i]Wanna See A Killer Website?.\nENTER If You Dare.\nIt's The Last Site You'll Ever See[/i]\n\nWebsite -[/color] [/size][url=\"http://www.feardotcom.com/\"][size=2][color=#0000ff][u]www.feardotcom.com[/u][/color][/size][/url]\n\n[size=2][color=#567ee6]Australian Gross - $110,389\n\nInvestigating the violent and inexplicable death of four men in New York, Detective Mike Reilly (Stephen Dorff from BLADE) has discovered that the victims have one thing in common \u0096 exactly 48 hours before they died, they each logged onto a website called feardotcom. Now, the only way to solve the mystery is to go there himself\u0085 and find the answers before he becomes the next victim.\n\nStupid. The film was so stupid and boring, and combine it makes a shit movie. A lead role, was really bad acted, the plot was stupid, and the ending was really predictable. The film had a really dark feel abut it, which is usually good, but the whole idea of a site knowing everything about you is just plain stupid. What i mean is that how can a site kill you withing 48 hours if it doesn't tell you what it want's. Several times during the movie i just wanted to turn the TV off at how boring it was.\n\nThe plot was really confusing, but did have some nice visual effects, in what the ghosts looked like. Apart from being confusing they're were loads of visable plot holes, and the script should've really be read over several more times before beiung greenlit.\n\nThe acting was average, but one actress Natascha McElhone was appauling. She only used one expression the whole film, and her voice was the same, even when she was supposed to be scared out of her mind.\n\nOverall \"Fear Dot Com\" is boring, confusing and wasn't worth the $40,000,000 budget. My rating is 2/5[/color][/size][/left]",
            "review_date": "2009-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bad incomprehensible ring.",
            "review_date": "2009-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a better version of untraceable",
            "review_date": "2009-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can only remember Stephen Dorff being in this movie and nothing else.",
            "review_date": "2009-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the words of my Blockbuster days, it fear dot sucked and someone should have told me before I fear dot rented it.",
            "review_date": "2009-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Complete rip-off of Ringu, and unlike The Ring, give no credit for the story.  And it was bad.",
            "review_date": "2009-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i only watched this movie because stephen dorff is a totally hot. it's not that great of a movie. enjoyed how graphic it is!",
            "review_date": "2009-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously glad I saw this in the drive in with some friends because we were able to make fun of the film the whole time while people couldn't hear us.  It was, well, just like most of the \"dot comers\", good idea, horrible execution.",
            "review_date": "2009-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some decent SFX aside - this is still one of the worst films i have seen in any genre - let alone 'horror' films which i can take or leave anyway. The concept is far from original, with poorly explained back-story and plotting - and it's badly executed with some of the worst acting i have seen outside of independent film (particularly Natascha McElhone) - thankfully it is short and i will never have to sit through it again.",
            "review_date": "2009-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it better the FIRST time I saw it...when it was called, 'The Ring.' Then the second time, when it was called' Pulse.'",
            "review_date": "2009-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dumb as hell a website that after you visit it you die immediately.  ok story but not executed well!",
            "review_date": "2008-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AWFUL!!! Are they serious? an internet website that kills people? seriously? wow.Awful Plot.Awful acting.Avoid this.This movie needs a warning sticker on it.",
            "review_date": "2008-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i wish i was one of em........... :D just kidding\r\nit rocks",
            "review_date": "2008-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's ok... not too special.",
            "review_date": "2008-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not good. Didnt find it scary at all, and the effects at the end were terrible.",
            "review_date": "2008-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jeffrey Combs, get outta this movie!",
            "review_date": "2008-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The one thing utterly scarry about this movie is its sheer mediocrity. That was bland and unoriginal to a point that is vastly unbearable to tasteful viewers.",
            "review_date": "2008-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "seeems sio intersing my favorite type of movies r hooroor",
            "review_date": "2008-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite of its formulaic & cliche, this was a decent drama, at the very least.",
            "review_date": "2008-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story.  Similar to Hostel.  Same kind of story except this one is about internet.  Acting not the best i've seen but Ok",
            "review_date": "2008-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So. Dumb.\n\nHurts. My. Brain.",
            "review_date": "2008-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was so bad I couldn't finish watching it",
            "review_date": "2008-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its okay i suposeeee... goes on a bit about nothing though and its crap how its about a website about gay stupid death :S",
            "review_date": "2008-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a good movie, kinda sucked huge, acting was terrible and i think its one of the worst horror films i have seen in a long time..not scary just stupid.",
            "review_date": "2008-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst films I have seen in a few years.  Natascha McElhone's acting in this movie is so terrible it makes it difficult to watch.  This is definitely a movie you can skip seeing.",
            "review_date": "2008-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WORST MOVER OF ALL TIME. Makes Plan 9 look like an oscar winner.",
            "review_date": "2008-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its really scary!!!!",
            "review_date": "2008-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is stupid.",
            "review_date": "2008-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i did think that it could have been abit better set out as i got a bit confuzzed  around the middel of the film",
            "review_date": "2008-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best acting out there, but a pretty freeky movie.",
            "review_date": "2008-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was just an incredibly lousy film.",
            "review_date": "2008-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a bad sign when your favorite part of a movie is the title. I had more fun telling people \"I'm watching FearDotCom...heard of it? FearDotCom? Interested? No? Maybe later...FearDotCom...keep it in mind.\"\r\nWretched film...utterly unintriguing...nothing about it sustains any interest except the title.",
            "review_date": "2008-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hate horror movies. Don't know why I go through that self-torture once in a while. *ugh*",
            "review_date": "2008-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is sick to think what actually exists on the internet. Besides that, a forgettable thriller with a few odd trembles.",
            "review_date": "2008-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I made it through approximately 15 minutes of this movie before wanting to jump out of the window...",
            "review_date": "2008-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i saw part of it on tv, but it was wack 2 me",
            "review_date": "2008-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i loved this movie, its not a movie that stands out, but once youve watched its really something. um..i watched it in year6 so, im forgetting stuff...",
            "review_date": "2008-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one 2 watch v ace film",
            "review_date": "2008-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretty much an internet knockoff of the ring. it was pretty disturbing. kinda fell on it's face from the climax to the end however.",
            "review_date": "2008-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall I was disappointed wit the film. It had an interesting, if not great concept to work from, but failed to build any sort of substance and comes off just looking like a long music video with gore.",
            "review_date": "2008-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's lots to admire in Feardotcom. Sadly, likeable characters, an involving story, and scares are not it. What kept me watching was the fantastic visual style that director William Malone brings to the table. Rarely is there a film so stylish shown in theatres these days. The rain soaked locations evoke serious tension and dread, even when the script doesn't deserve it.\r\n\r\nMalone, who faired much better with his genuinely nightmarish remake of William Castle's gimmicky House on Haunted Hill, deserves better. I hope to see Malone's fantastic style brought to a script that is actually halfway decent.\r\n\r\nAll things considered, you can do worse than a night with Feardotcom. The pace is pretty quick, it has a few creepy moments and Malone's stylish images will help you get through it easier.",
            "review_date": "2008-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this si good!!!....and scary, it'll make you have nightmares...\r\nor me at least!! LolSzZ",
            "review_date": "2008-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i loved it but u have to watch it without interruptions",
            "review_date": "2008-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OMG this movie is awesome!  I loved it",
            "review_date": "2008-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this ages ago, dont think i was too impressed",
            "review_date": "2008-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know me...Long live horror.",
            "review_date": "2008-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, I agree it wasn't the best, but just so everyone knows...this movie came out a few months BEFORE The Ring so it's pretty much impossible that they took the idea from The Ring.",
            "review_date": "2008-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't remember much about this movie, except for that it ended.",
            "review_date": "2008-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hey i got an idea, lets take the idea from the ring, but instead of a video the victims will watch a website called fear dot com. Yeah that's original.",
            "review_date": "2008-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie sucked. the idea behind it sucked. the story line? guess what - yep it sucked, the acting? yeah it was ok, special effects where pretty good in places though, \nI still like this movie because for all its faults its perfect late night horror trash.",
            "review_date": "2008-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie put me to sleep. It was boring. The only thing I liked about this movie is that they used the song Sonne by Rammstein in it. GERMAN MUSIC FTW!!",
            "review_date": "2008-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gruesome, sick, vile, cruel, depraved and revolting - also muddled, confusing and incomprehensible - more disturbing than 'Hostel' but nowhere near as scary and lacks a single genuine scare.",
            "review_date": "2008-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ooh, the Internet can kill, just like a cursed video, or a cursed phone, or a cursed TV, or many a hairdryer. So not scary nor is it fun at all.",
            "review_date": "2008-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This came out the same time as the Ring and although there were some subtle differences, they seamed pretty damn similar.  Log in 2 days later you die.  vs the ring - Watch a movie 2 days later you die... hmmmm I wonder...  The great part was the 2 movies came to the theater on the same day so it was completely obvious.",
            "review_date": "2008-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stupid really...i almost fell asleep...it was seriously another attempt at copying the ring...weird is all i can say...",
            "review_date": "2008-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stupid and boring!!!!!!!",
            "review_date": "2008-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "kinda a rip off of the ring",
            "review_date": "2008-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so sad and disgusting at parts. People who haven't seen it...DON'T WATCH IT!",
            "review_date": "2008-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid,and one of the worst horror movies ever made.Its a bad version of the Ring,but on the Internet instead of a tape.BAD",
            "review_date": "2008-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Think the Ring but its a killer website. Some freaky images and an overall killer visual style don't overshadow the bad qualities of the script and the acting.",
            "review_date": "2008-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrible movie. It took me four sittings to get through the whole thing.\n\nI gave it two stars because of Natascha McElhone, then I took one away because of Stephen Dorff.",
            "review_date": "2008-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "again, a very slow going movie. not too bad. kinda a toss up between \"the ring\" and \"untraceable\" i guess...",
            "review_date": "2008-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, saw it for Stephen Dorff.",
            "review_date": "2008-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A all time scary film scard the shit out off me when i saw this film a top film",
            "review_date": "2008-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like horror films and don't always expect them to be great, but good enough for a scare. But this was a sham. Yeah it seemed alright and a little intriguing at first, but there were certain parts of the plot that needed some cleaning up. There were some many ends left untied and way too many assumptions needed to be made by the audience.",
            "review_date": "2008-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was horrific, absoloutely shocking...forget about giving my money back, just give me back the 2 hours of my life I wasted on this film!",
            "review_date": "2008-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the worst horror movie I've ever seen. Not so bad you're laughing at it the whole time, but it's def annoying and done very amateurishly. The script is awful, \"she always had that thing with her (ball). willful child wouldn't give it up. It was until she discovered boys, that she finally left it behind.\" Come on no one plays with a ball until they are thirteen and how that ball is supposed to scare me has yet to be seen. Actually how any part of that movie is scary is yet to be seen. It rips off a bunch of horror movies like final destination and is very cliche. The acting, editing, plot, and directing are all bad. I like the part were a girl comes up from under a bar table-wth? Basically like the thriller untraceable, but shittier and remove a trace of believability and rationality. I was actually watching the clock most of the time because it was that boring, the only decent part is some scary imaging but it's beaten over the head with a bloody stick. The main actress looks like Dr. Quinn Med Woman. How did this get advertised so much?",
            "review_date": "2008-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dis movie iz nasty but also scary",
            "review_date": "2008-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some bits looked pretty cool and the cast was alright but what the hell was going on??? it didnt make much sense or explain anything but i dont think i really care. the ring or untraceable are much better!",
            "review_date": "2008-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More depressing than scary or much of a mystery. It's similar to The Ring in that once you go there or do that, you're doomed.",
            "review_date": "2008-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I COULDNT GET INTO IT-I OWN IT",
            "review_date": "2008-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "gave me nightmares! totally loved it! the idea was amazing!",
            "review_date": "2008-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid and shitty with a dash of fucking retarded.",
            "review_date": "2008-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this this afternoon and thought it was a bit poo. Its got a half decent cast, but the trouble is I've seen this film done loads better twice before.\r\n\r\nIts a little japanese film called Ringu by Hideo Nakata. Replace the video tape with an internet site and add a touch of \"you will die in 48 hours unless you solve the mystery of my death\" plot and its pretty much the same film. \r\n\r\nThe difference? In this once you still have a perfectly good pair of pants at the end.",
            "review_date": "2008-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "was not what i expected (scary movie)",
            "review_date": "2008-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I only watched this due to the fact it is horror and that Stephen Dorff is in it, it is poo.",
            "review_date": "2008-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the original of a recycled & overused idea. back in the day though, it was pretty cool",
            "review_date": "2008-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "creepy couldnt finish",
            "review_date": "2008-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a weird movie...",
            "review_date": "2008-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "meh..not the best acting i've seen",
            "review_date": "2008-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very stupid plot concept with really bad acting. Don't ever see this film.",
            "review_date": "2008-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A poorly constructed, goofy supernatural thriller.",
            "review_date": "2008-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is why I never watch horror movies.",
            "review_date": "2008-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie it is one of the best horror movie that I have watch for a while",
            "review_date": "2008-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An above average horror flick, with essances of the Ring, and a uk tv film which the name escapes me. Good effects, scary the first time but not one to be watched over and again, as it losss its' touch after the first go.",
            "review_date": "2008-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really really scary!!!!!!!!!!!!!!",
            "review_date": "2008-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A shit movie...you'd think it was made in the early 90s...but it was made just 6 years ago.",
            "review_date": "2008-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jeffrey Combs' least dignified paycheck yet.",
            "review_date": "2008-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the atmosphere in this one, and Stephen Rea's psychotic performance could easily have been mistaken for that of Kevin Spacey in fine deathly form.  The only problem about the film is this, what the hell is going on in it?????",
            "review_date": "2008-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An okay movie, very like The Ring and Saw.",
            "review_date": "2008-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A complete mess that drags on for way too long with an almost unintelligible plot line, and it is extremely difficult to sit through.",
            "review_date": "2008-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just too cheap and cheesy to be worth anything...a cheap attempt at showing how the internet has become a portal for violence in the last decade or so.",
            "review_date": "2008-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the lousiest horror films ever created, complete with idiocy, predictability, and outlandish scenes. Torture porn is the worst type of horror film.",
            "review_date": "2008-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen some crappy stuff.  Perhaps I have wasted my life.",
            "review_date": "2008-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, what a pretty crappy movie. I expected more out of William Malone, who really made a decent remake in House on Haunted Hill, but his overabundance of Gothicism mixed with modern day web browsing kidnapping/murder mystery is a real stinker. It's fun to see villian Stephen Rea be deliciously mad on film, and watching Stephen Dorff as the hero wasn't too much of a pain. I was sad to watch Jeffrey Combs really overact his way through this movie (something I'm not use to from such a fun actor), and Udo Kier is completely wasted in this film, which has become a common trend nowadays, and always with him (this film, Blade, End of Days, Halloween remake; enough screen presence in all of these to equal probably 5 minutes). Anyways, I rambled. This movie isn't that good.",
            "review_date": "2008-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "weird,unusual.not bad.",
            "review_date": "2008-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I usually do my best to finish the movies I watch no matter how awful they are because of the obvious reasons but this one forced me to make an exception. I only watched about half of it and had enough. I didn't hate it, I doubt it would have been the worst movie I've ever seen or even the worst in the genre but after spending an hour watching the film it became rather obvious it wouldn't make my night any more thrilling, it wouldn't entertain me or it wouldn't contribute anything at all to my life so I just gave up. The acting ranged from bad to mediocre, the directing was quite poor (surprisingly enough it reminded me of the b horror tv-shows which seems to be what the director has been doing before the movie) and the plot seemed rather stupid and I fear it would have gone even worse towards the end (which was one of the main reasons why I got the idea to actually stop watching). I could come up with a couple of mildly positive things but I won't mention them here because I encourage everyone to not watch this. It's simply not worth the effort. I'm sure there's another movie you haven't watched even though you've been meaning to do so for a while already... watch that.",
            "review_date": "2008-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i actually liked this.",
            "review_date": "2008-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not an absolutely terrible horror movie, but certainly just sub-par. The thing that does frustrate me though is that everyone complains that this movie was just a knock-off of The Ring, when in reality, Fear Dot Com was released slightly before The Ring, so that's not true. It had some creepy vibes throughout the movie, but overall I thought it was slow and fairly uninteresting. I suppose it was just good enough to make me want to finish it.",
            "review_date": "2008-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well I've seen better. Nothing special. Trying to be something better.",
            "review_date": "2008-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OMG! What a bizzard movie. Was I supposed to be stoned so this would be a good effect on?",
            "review_date": "2008-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cant remember if i made it all the way through this one.",
            "review_date": "2008-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tis okay, but it's EXACTLY!! the same as the Ring, but not as good and far too slow moving, which is kind of funny, because you only get 48 hours to live, not 7 Days",
            "review_date": "2008-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie had it's hits and misses. Now these types of movies are now popping up all over the place.  The Internet is used as the main sotry of what's going on.  Some weird force is doing something with the internet.  Now some of the visuals were rather intriesting but however that is really the only thing saving this movie.  The plot which at first sounds great just doesnt work for this one.",
            "review_date": "2008-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I've ever seen.",
            "review_date": "2008-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well I didn't hate it as much as the other reviews do, but it really is a muddle of a movie.  Part japanese supernatural horror/trad murder mystery/sick voyueristic gorefest, it didnt know what it was really was.  When it boiled down to it it worked best as a supernatural horror but ended up as a cop chase the bad guy movie, the direction might of been a bit lame but will give a mark for the general style and intention of the movie and how it was shot(although it was a tad too dark it was quite stylish..which is a lot more than other movies of this kind have!)... ultimately the story was a let-down and was a wasted opportunity which is a shame.",
            "review_date": "2008-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tried so hard to be The Ring but failed in almost all areas. This was bad. Stay well away.",
            "review_date": "2008-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rip off of The Ring with a website taking the place of a video tape. Mediocre acting, everyone's just in it for the pay check, story that needs a couple more rewrites, and some glaring logic holes. However the look of the film is great (much better then the story deserves) and Stephen Rea's serial killer, well one  note, manages to be farely entertaining (alright the scene where he abducts the girl in the theater with Rammsteins \"Sonne\" playing in the backround was fucking awsome), and the ending was pretty cool, unfortunatly you have to wade through to much crap to get to it.",
            "review_date": "2008-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most intolerably awful films, ever. Period.",
            "review_date": "2008-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bad...  Just flat out bad.",
            "review_date": "2008-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the absolute worst movie I have ever seen.  Ever!",
            "review_date": "2008-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this ages ago and want to see it again coz I kwon I liked this movie but forgot what happeneds in it .",
            "review_date": "2008-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not very good, but had some creepy things.",
            "review_date": "2008-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst film made in recent memory. Nothing makes sense, and not in the cool way. The Acting is enough to make any one cry out WHY? the story is a bastard version of the ring. It is too dark, badly edited badly directed horribly written. If that one cousin no one has any love for was a movie, this would be it. Fear.com should have never been made. Give me a remaking of an old Twilight Zone episode. Hell give me another movie with Paris Hilton before making this P.O.S",
            "review_date": "2008-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was horrible, and some things didn't match up.",
            "review_date": "2008-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As bad as horror films come, with the added slice slow motion running death.",
            "review_date": "2008-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wierd film, i'll give you that. But I don't think i'd recommend it as a good horror film. I have seen worse films than this, atleast this film had an okay story line and decent ending.",
            "review_date": "2008-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Attempt could have been longer with more character development.",
            "review_date": "2008-03-02",
            "source": "rt",
            "lang": "en"
        }
    ]
}