{
    "rating": 8.6,
    "release_date": "2002-01-25",
    "num_reviews": 170,
    "genres": [
        "Drama"
    ],
    "summary": "\"I Am Sam\" is the compelling story of Sam Dawson (Sean Penn), a mentally-challenged father raising his daughter Lucy (Dakota Fanning) with the help of a unique group of friends. As Lucy turns seven and begins to intellectually surpass her father, their close bond is threatened when their unconventional living arrangement comes to the attention of a social worker who wants Lucy placed in foster care.",
    "reviews": [
        {
            "content": "An inspiring movie questions about the key of fostering child. I was very moved when I watched the movie in my younger years.",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie! It may me cry multiple times throughout the film, especially the court room scenes. Very heartfelt and I loved the chemistry between the characters!",
            "review_date": "2023-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an amazing movie.  It really pulls on the heartstring, to see that love transcends all gender, intelligence and ethnicity.  At the end of the day, the unconditional love of a simple parent may sometimes outweigh the false affection shown by wealthy/influential parents.  It's truly an inspiring and touching movie to watch.",
            "review_date": "2023-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was exceptional.",
            "review_date": "2023-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The soundtrack itself was a masterpiece. Plus amazing performance from strong casts which includes a young Dakota Fanning. One of my favorite drama of all time",
            "review_date": "2023-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In short, the film has all the ingredients to make a good movie, but succumbs to an esoteric plot.",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After watching this movie I thought to my self, as you can see from the critics and audiences reviews, (from the year 2001 in comparison to current years 2019-2022) this movie and the delicacy of the issues surrounding intellectually disabled individuals was before its time.  Powerful and emotional, painful and thought provoking, Sean Penn and Michelle Pfeiffer brought you to understand how the bridge between us as people can be built with love. The intellectually disabled needs a voice to represent them in critical times in this modern day society.",
            "review_date": "2022-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my favourite movie of all time",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a sad, poignant and thought provoking watch. Seann Penn gives a great performance as the titular character. I imagine a film such as this will have brought a lot of controversy at the time it came out, due to the actor not having a related mental/emotional disability as portrayed in the film but I did feel the sensitive subject areas covered were treated with respect. I thought this was quite a memorable film, although it is a bit hard to watch at times, again due to the films themes. It also features a nice soundtrack, with most of the songs performed having been written by John Lennon and Paul McCartney and are sung by Sarah McLachlan, Sheryl Crow etc. This film is well worth a watch for the depiction of how vulnerable people are treated in modern American society and highlights compassion at times (which isn't to say everything goes perfectly, certainly not), if nothing else, so I would definitely recommend it, even though having some tissues to hand may be an idea if your prone to crying when watching emotional films!.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sean Penn should've won an Oscar for this performance",
            "review_date": "2022-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful triumphant film about a disabled man with a big heart.",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't stop crying from beginning to end.. so beautiful",
            "review_date": "2022-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so many emotions incredible storyline and actors",
            "review_date": "2022-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a great movie it's really touching how proud he was of that little girl and how dedicated he was trying to do everything right and have patience a little girl was how she helped him take care of her the right way I thought it was an awesome movie",
            "review_date": "2021-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pfeiffer saves this movie from its pathetic pretense ",
            "review_date": "2021-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sean Penn and Hannah Dakota Fanning maybe the most gifted actor of his generation !",
            "review_date": "2021-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over a challenging script, Dakota Fanning's breakthrough and Sean Pean's phenomenally undignified performance emitting sympathetic discomfort while sharing a dynamic with Michelle Pfeiffer's professional warmth, this melodrama deserves a fair rating of decent acceptance despite going basic straight through a complicated topic that was seemingly tamed with cheesiness for easy resolves. (B)",
            "review_date": "2021-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lucy and Sam best father daughter \"never gonna give up on you \" love ever made on screen felt so real !! I hope everyone gets a chance to watch this .",
            "review_date": "2021-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'I am Sam' is one of my favorites drama movies for a long time. It is a beautiful story about a father who has a disability 'Sam' ( Sean Penn ) and his smart and kind daughter 'Lucy' ( Dakota Fanning ), even he is a disability but he always finds a way to support his daughter as much as he can that show the love between father and daughter. By the way, this story is not only about the love between father and daughter and also friendship too.\nActors and Actresses in this movie have the best performance, not even main actors like Sean Penn and Dakota Fanning but Michelle Pfeiffer who act as a lawyer has a good performance and also the supporting roles. All the characters have a story behind it that makes their roles are more depth so this movie is more emotional.\nThe soundtracks of this movie also one of the best parts of this movie. This movie uses a lot of songs from 'The Beatles' such as Golden Slumbers, Revolution, Let it be, Two of Us, Across the Universe, I'm looking through you, You've got to hide your love away, Don't let me down, and more. And some scenes of this movie are also inspired by The Beatles like the scenes that Sam and his friends walk across the road is like The Abbey Road Album Cover.\nI would recommend this movie to everyone who wants to watch a good movie or finding the best drama movie because I could say that I love this movie like mood and tone are the best also the performance of actors and soundtracks. So I would rate this movie 10/10.",
            "review_date": "2021-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A neurotypical actor playing the role of a mentally handicapped character will always be offensive. No exceptions.",
            "review_date": "2021-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming drama that was an eye opener for me to see one of Dakota Fanning's film debuts. Sean Penn surprisingly can act retarded and his efforts in portraying that is undoubtedly observable. The story does have uncomfortable scenes, but can be understood with the story of how it was difficult to live with this mental disability. Michelle Pfeiffer was outstanding and I felt that it was her who brought some life from this film. This is one film I will remember in the long term.",
            "review_date": "2021-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Film tries way too hard to be sweet and endearing. \nA painful experience from start to finish.",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe the movie over simplify the complex issue, but Dakota Fanning and Sean Penn's terrific acting saved the movie...\nThe Beatles songs, presented by other acclaimed artist, also add a pleasant details to the movie. 7 out of 10.",
            "review_date": "2020-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching. Over simplified yes, but the stunning Michelle Pfeifer (most beautiful actress) and the combination of Beatles music bump up the level. Penn is awesome, and Fanning is a bit over-her-age. Overall, very nice and touching. Love Pfeifer's performance.",
            "review_date": "2020-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweet, heartfelt and especially well acted.",
            "review_date": "2020-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful movie, tear jerker and the best acting from all.",
            "review_date": "2020-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie and the pulls on all the strings of the heart",
            "review_date": "2020-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know it's manipulative, but love rocks it all, this movie is all about pure love, and how it  conquers .",
            "review_date": "2020-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why in the the U.K. have to be politically correct. This movie seems to sum it up. I don't care or want to to watch movies like this.",
            "review_date": "2019-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great!! reminds me of classic cartoons",
            "review_date": "2019-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't finish it, not very good..",
            "review_date": "2019-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to cry when i watchibg this film",
            "review_date": "2019-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, it is sentimental, and yes, there are times that it got cheesy, but I Am Sam is lifted up by its cast led by a miraculous Sean Penn and an underrated Michelle Pfeiffer. Dakota Fanning breaks out as an up and coming star, so it is worth seeing",
            "review_date": "2019-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beloved, maybe. Good, NO! Though all the actors involved really do try their best, and it has a great soundtrack to match its atmosphere. We got a film that is literally covered in complete schmaltz. All the emotion seemed forced and devoid of pure passion. The story is very unreliable, unethical, and completely incorrect on actual circumstance. We also have very poor and inaccurate representation of individuals with special needs on top of this weak script. If you still love it after reading this review, see it again, and you'll start to notice all the flaws that come with non-thoughtful film making.  ",
            "review_date": "2019-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sean Penn's Acting is phenomenal.His acting makes it a worthwhile watch.",
            "review_date": "2019-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember the 1st time seeing this movie.. it still makes me cry",
            "review_date": "2019-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Curses can be turned into blessings is a lesson many people learn from this movie. \"Daddy, did God mean for you to be like this, or was it an accident?\" Lucy often questioned why her and her father's relationship was different than others. Not because she believed it was a negative thing, but rather, her curious seven year old mind brought her to question it. I Am Sam is about a father who was left to raise his daughter on his own after he slept with a homeless woman who explained, \"I only wanted a place to sleep.\" Sam, Lucy's father played by Sean Penn, works at Starbucks bussing tables and raises his daughter Lucy, played by Dakota Fanning, with the help of his four friends, kind neighbor and community, yet there are people who doubt his ability to fulfill the needs of a child. Due to this idea that he is not mentally capable of raising a child, it creates a negative connotation towards Child Services as they take her away from Sam on her 7th birthday. The relationship that Sam and his lawyer Rita, played by Michelle Pfeiffer, share was not expected, yet it was very interesting to watch grow. At times they compared the lives of each other in which each of them faced different struggles. It really brings the viewer into perspective of our reality in this world. Everyone faces different hardships, some more than others. When first meeting Sam, Rita asked, \"I just don't know what to call you: retarded, mentally retarded, mentally handicapped, mentally disabled, intellectually handicapped, intellectually disabled, developmentally-disabled?\" In which Sam replied, \"You can call me Sam.\" This movie portrays the prejudice that people with mental disabilities face, regardless of their ability to function. Watching a family forcefully separates due to permanent circumstances is very difficult for many viewers to watch.  Because her father has a mental capacity similar to her own, there are limitations which affect their day to day lives. Unfortunately, because Sam has special needs, he faces many obstacles in attempt to raise his daughter, but according to Lucy, \"all you need is love.\" Although this is extremely true, you do need other necessities as well and because of Sam's restricting mentality, others were worried for Lucy's future. Seeing Sam and his extraordinary group of friends care for Lucy reminds me that asking for help should not be looked down upon. Because of their unconditional love and support for Sam and Lucy, they were always willing to give a helping hand, even if it included pitching in their last dime for Lucy's new shoes. This movie continuously tugs on my heart by each second and will most likely bring a tear to everyone who is watching. It is emotional, heart warming, and brings a smile to my face every time I watch it. This movie shows us that each person in this world needs love, and along with that all other things are possible. It touches on the idea of patience, persistence, and kindness from every single character. This movie is one that will teach you more than one lesson and leave you with a very soft heart.",
            "review_date": "2019-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a piece of offensive, heartless, blunt, sad, and traumatizing shit! It traumatized me when I saw it in High School, and it still offends me as an actual person with Autism. This movie is very poorly acted, paced, etc! It's like the people who made this movie was making fun of people with disabilities, and that is NOT OKAY! I may have seen it once, but I hope never to watch it again! I would destroy every copy of that movie if i wanted to!",
            "review_date": "2019-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best inspiring movie ever made!",
            "review_date": "2019-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have never been more uncomfortable watching a film. This is a disgusting portrayal of mental disability and feels like a joke. This makes my skin crawl.",
            "review_date": "2018-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely love this movie,",
            "review_date": "2018-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a better plot, I Am Sam might work, but it glosses over reality on so many occasions that it's hard to take seriously. Despite the high-profile nature of the cast, I had the feeling that I was watching one of those made-for-TV weepers that show up with alarming regularity on cable TV's Lifetime Network. From the supposedly heart-wrenching drama of the separation of father and daughter to the courtroom scenes, this is pure soap opera. The director is clearly relying upon audiences being swept away on a tide of emotion so overwhelming that concerns about the intelligence and logic of the movie become irrelevant. Unfortunately, I Am Sam doesn't possess anything close to the degree of power necessary for that to happen.",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great show to watch, it reflects a dad's love for their child no matter how life goes.",
            "review_date": "2018-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "claiming the title of being an actor..\n\nI Am Sam\n\nI Am Sam is a plot driven family drama about a mentally handicapped father whose daughter is considered to be taken into a foster home. \n\nArmed with such potential and considerably explored by the filmmakers in many ways, it offers expectations with such huge cast. As much as honest and pathos its ideology is, the methods that it adapts to draw in the emotions out from the viewers is pure manipulation. \n\nThe plot track wanders in without any whatsoever connection or logic and visits pointless places for more than two hours. As it ages on screen, there is neither sincerity, mannerism and maturity in script to breed any aspects of the feature appropriately. \n\nThe screenplay is so naive and inedible that viewers cringe on seat as the makers attempt to attain a closure of their self-created destructive bubble. The primary reason why it doesn't work is its futile constant knack for drawing out a chuckle and its shallow script that it surfs through the entire feature. \n\nPenn's riveting performance is genuinely moving, to a point where it carries off the entire tale on merit and makes it worth surviving for the viewers. As much as brilliant Penn is, Pfeiffer couldn't be more distracted whilst Fanning shows some promising skills. The background score is pointless with immature camera work and daft and questionable cinematography. \n\nThe screenwriter and director Nelson not only possess sloppy writing skills with incoherent forcibly imputed sequences but also lacks execution skills which is demoted by its confused camera work. Penn is the only high point of the feature as it elevates the momentum as much as he can. \n\nI Am Sam is Penn claiming the title of being an actor, and it aches to encounter such a talent go waste by on something so fatuous.",
            "review_date": "2018-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In retrospect its extremely offensive to portray the differently abled in such a way.  Obviously it was not the movie's intention to be insensitive but at the same time they should have had the foresight to know that this would be perceived as manipulative and vastly crass to attempt a portrayal of the life of a differently abled man.  On a purely film level its not horrible; the shot composition flowed well, the pacing was adequate, and the Beatles cover soundtrack was refreshing; however where this movie fails is the story and dialogue's insensitive conclusion of the struggles of mentally challenged persons.  In a way it's good that this sub genre of drama died out with I Am Sam because the subject matter has been deemed very inappropriate to comment on in such a manner.",
            "review_date": "2018-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have mixed feelings on this movie. I was ok with Penn’s acting but the story got really boring about 70% of the way through. Could have been much better. Pfiefer overacted in this too. ",
            "review_date": "2018-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We should give credit to Sean Penn's performance.",
            "review_date": "2018-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing performance from Sean Penn, this is a must see for all film fans.",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Utter overacting and excruciating direction this film is truly oversimplifying autism and is a dirty speck in Sean Penn\u0092s career",
            "review_date": "2017-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"You were fartin' in a bathtub, laughin' your ass off.\"",
            "review_date": "2017-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartbreaking but beautiful",
            "review_date": "2017-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful story where all the main characters experience growth and change in some way.  I Am Sam is filled with honesty, reality, raw emotion, and what's important in a family.  A  must see if you're looking for a great film and story.",
            "review_date": "2017-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extraordinary acting by both Penn and Pfeiffer.  With heartfelt giggles, its a tear jerker for sure, but the dramatic performances are very well done. When Pfeiffer breaks down and shows her humility as a business stricken lawyer, we see that we're all not so different on the inside from those with special needs. We all have our struggles to deal with. A great massage well played, which makes the audience's user score far more relevant than the critics.",
            "review_date": "2017-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outside of Sean Penn's performance,this is a manipulative film that tries to make you cry but fails.",
            "review_date": "2017-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought that this was a very heartfelt movie. Dakota Fanning was so damn cute and Sean Penn and all of his friends with intellectual disabilities sold their roles to me. The scene where they bought her the shoes was both whimsical and so touching! I loved all of the movie references and of course stories about The Beatles too. And shout out to The Rocky Horror Picture Show for the Sweet Tranvestite reference.\n\nNowadays, the events in this movie are unlikely to take effect due to all of the government programs available to help those who not only are living in poverty but also have some sort of intellectual disabilities. Not to mention the fact that the courts do tend to strongly favor a child going back to their biological parents rather than a foster home even when the situation is much worse than what the film shows. \n\nThe parts that really hit home for me were when Lucy told her dad that he \"wasn't like other daddy's\", or when she was pretending to not be able to read the harder words to not her her daddy's feelings, or when the court tried to explain to Sam that he would have limited and monitored visitations with his daughter, and lastly, when Sam told Randy that he wanted to tell her a secret. The secret, of course, being that he couldn't raise Lucy on his own and thought that the red in Lucy's painting was of Randy. The emotions displayed in these scenes... were wait for it.... OSCAR WORTHY! And I damn near cried.\n\nLucy: \"I don't want to read it if you can't.\" \nSam: \"It makes me happy when you're reading.\"\n\nA very beautiful movie with a great message: All you need is love! With the lack of quality dads in this world, a lot of people would be lucky to have someone like Sam. Somebody that loves their child with their entire being and makes their little angel into their whole world. It's a typical Hollywood drama so you'll love it or you'll hate it. But can we all agree that Dakota Fanning was one of the most precious little girls ever?! She's so adorable!",
            "review_date": "2017-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "O.K. - only ow many mentally handicapped stories to we need?  The little girl was very good.  Good acting all around, but story a bit trite.",
            "review_date": "2017-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my top 5 movies of ALL time.  Excellent acting, as proven in small part by the fact that this was the first movie I ever saw Sean Penn in, and I still have a hard time believing all the subsequent characters he has played!  :-D Michelle Pfeiffer, Dakota Fanning and Dianne Wiest all do a SUPERB job of acting. It was not intended to be a treatise of the entire complex issue involved in this whole arena; it's just one story presenting (beautifully and realisticly) a side of this issue that most of us would never get to see. One cannot help but see people and life differently after watching this absolutely EXCELLENT movie!!!!!",
            "review_date": "2017-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite movie",
            "review_date": "2016-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if you give love to a person when is growing up ,is very difficult to become a bad people! Pfeiffer is beautiful!!!",
            "review_date": "2016-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cried within 15 mins of this film.",
            "review_date": "2016-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An important subject marred by a silly, overlong screenplay.",
            "review_date": "2016-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sean penn's performance and his chemistry with Fanning gets 4 stars fro, me. The film as a whole gets 2 and half stars. It's horribly edited, irritating score (except when the scenes get emotional, those parts were decent) some unbelievable characters, and, a plot that is WAY too dragged out.",
            "review_date": "2016-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it does have some honestly good intentions, the film is overlong and simplifyed to the point of manipulation, while suffering one huge logical mistake. The generelly good acting can't save this film.",
            "review_date": "2016-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very touching regardless of treacle.",
            "review_date": "2016-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching movie that had me in tears. This type of movie feels like everyone will lose and I'm glad that didn't really happen. But at the same time, it's a bit idealistic. Love the soundtrack though.",
            "review_date": "2016-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Am Sam is a decent film. It is about a mentally handicapped man who fights for custody of his 7-year-old daughter. Sean Penn, Michelle Pfeiffer, and Dakota give good performances. The script is a little slow in places. Jessie Nelson did an alright job directing this movie. I liked this motion picture because of the drama.",
            "review_date": "2016-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first movie that made me cry",
            "review_date": "2015-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that means we'll but Sean Penn. Never go full retard",
            "review_date": "2015-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best drama iv ever seen only one to ever make me cry other critics most likely dont understand how painful the circumstances in this movie actually are only thing i didn't like was how they never showed him in court for the final outcome",
            "review_date": "2015-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. The story was quite confusing at some points, but the whole \"pacage\" was good!",
            "review_date": "2015-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very manipulative...... but is it a bad thing? Ehhh I'm not sure where I stand on this one. Is it good or is it bad. Is it overplayed or just right? Hmmmm. If you are a fan of tear jerkers then check it out its not horrible there was some effort put into this.",
            "review_date": "2015-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a good film, one of Penn's best.",
            "review_date": "2015-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost all the credit goes to Penn and Fanning, this film will grow on you.",
            "review_date": "2015-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overly melodramatic tripe.",
            "review_date": "2015-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite superb performances all around.",
            "review_date": "2015-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film......Sean Penn was outstanding this film ia completely underrated.",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! Can't believe I missed watching it in 2001. Now I gotta see Vikram's version.",
            "review_date": "2015-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performance from Sean Penn but this is the kind of film who want to make you cry necessarily without prior warning. 5.5/10",
            "review_date": "2015-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my least favorite films ever, I Am Sam is a flood of cloying sentiment and reeks of Oscar desperation.",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not one to review movies of this type, and typically find myself bored with them.  But this is a amazing movie.  Sean Penn delivers his best performance, and the other actors do great as well.  The cinematography is good, and so is the script.  It's so sad, powerful, well done, and simply great.  Sean Penns best movie",
            "review_date": "2015-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fails at every level at being uplifting and inspirational. If anything, it patronizes the disabled. Sean Penn is an embarrassment here. He is not any bit convincing as a disabled man. This is a great story, squandered by Hollywood phoniness.",
            "review_date": "2015-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outside of Sean Penns fantastic display of acting,  I felt like the subject matter was forced into a long movie. I think they pounded the issue into the ground more than they should of.  What was a great showcase for Penn was over casted by a convulted plot.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "87%\nWatched this on 13/11/14\nSean Penn provides his career best performance and you cannot see a better way in which an autistic character can be portrayed on cinema. Michelle Pfeiffer also provides an excellent work and Dakota Fanning is adorable. The film is well directed, but at times it(the script) seems unrealistic. You can make a film about such a sensitive issue and cover it all up in melodrama and you can provide an ending that one might believe to be most realistic, but isn't it what most films do? wouldn't that be a cliche? But unfortunately the critics do not understand it and most of them isn't even convinced of Penn's acting. It is easy to criticize because people who have nothing to do can do it easily, but the real pain is always there in the making of it. This movie has an ending that we all want to see and it presents that in a most realistic way that the script is capable of providing.",
            "review_date": "2014-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching story that makes Sean Penn more of a brilliant actor.",
            "review_date": "2014-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite its mixed reviews, since I Am Sam is often attributed to featuring a painfully realistic performance of a mentally retarded person, I had to get a glimpse of it.\n\nI Am Sam is a film which is bound to be controversial. It deals with the subject matter of someone with a developmental disability in the position of being an adoptive father at the centre of a custody dispute. It is clearly a massive ploy for sentimentality. The film seems largely to be some kind of attempt at Oscar-bait which only worked thanks to Sean Penn's performance. In the rest of it, there is an abundance of sentimentality which really just overwhelms the entire film and its best intentions.\nThe characters in I Am Sam all end up being archetypes. The protagonist is a mentally challenged father whose mother was a homeless woman who left her child with him, his daughter is the adopted child of a mentally disabled man, his lawyer is a cold hearted woman taking on a case pro-bono for once while dealing with being a mother and the wife in a poor marriage, his neighbour is a kind elderly woman with agoraphobia , his opposition is a woman whose son suffered from a drug overdose and a lawyer who has to reluctantly live with his mother in law, and one of his supporters is a woman who was raised by a mother with the intelligence of a 9 year old. The stereotypically sentimental characters just keep on coming with no end in sight. This becomes pretty ridiculous pretty fast, and the way that the story handles the subject matter ends up too problematic. It oversimplifies the basis of issues relating to mental disabilities and custody laws solely so that it can come off as a film which holds the message \"A mentally disabled person is no different from another person.\" While the emphasis behind protagonist Samuel Johnson \"Sam\" Dawson being a great person and a capable father are true, it overlooks just how complicated the entire case is. I Am Sam ends up seeming like a film that is aimed at children as it plays it safe with so much of its edgy subject matter. It may be good for children to see it and understand that mentally handicapped people really are people too just like you and me, but in terms of how it depicts the legal system, it is just not right. The film gets really predictable really fast and is so packed with subplots and other characters that it just all piles up on itself.\nThe pacing of the film is all a big rush. So many plot dynamics are crammed to fit into the first 30 minutes of the film that by the point of it being a quarter through, we've already seen Samuel Johnson \"Sam\" Dawson pick up Lucy Diamond Dawson after she is born, father her until age 7 and then lose custody of her. It pushes through so many plot dynamics at such rapid pace that it becomes more overwhelming than it already is. It doesn't add much to the atmosphere which is already experiencing problems due to trouble establishing the right mood.\nI Am Sam is a film which clearly intends to be very melodramatic and very sentimental at the same time. But the central problem is the fact that the atmosphere ends up being a bit too light for its own good half the time and really depressing the other half. The mood is truly bipolar because it is too light some times and then very heavy the next without much consistency. There are consistently problems with the soundtrack since the drama in the film is unable to develop on its own and must be pushed along by a lot of lighthearted or depressing songs.\nJessie Nelson's directional style is really amateur, and that is the source of a lot of problems. Her script is poor and she cannot do anything with it but try desperately to make viewers cry. Those who do not get sucked into the cheap tearjerking elements of the story will much more likely simply sit in front of the screen fazed by the lack of proper thought put into the story. Not to mention the fact that visually the entire film is rather stiff due to shaky cinematography that suggests the film is in the style of a mockumentary. The editing is also poor. There is one moment where Sean Penn delivers multiple monologues in the courtroom and the editing just keeps cutting to different angles of his face for some reason. All it does is stun viewers and distract them from the narrative. I just cannot figure out a good reason for it being there. It's hard to figure out why so much of I Am Sam is all in the one film, and the viewer has to sit through it for 134 minutes to experience the entire movie. It really is just a movie in poor form, and it even has pretty obvious product placements which would point out where a lot of the financing came from.\nThe only element of I Am Sam which is really justifiable to recommend to anyone is the stellar efforts of the cast, in particular the leading performance of Sean Penn.\nThe performance of Sean Penn is truly a powerful one. Despite the fact that his effort is surrounded by an overly sentimental script and plot dynamics which fail to really get into depth about the character outside of the repetitive references to The Beatles, Sean Penn really does a fine job conveying the developmental disability in the role with painful accuracy. It is very easy to sympathise with Sean Penn because he is truly a talented actor when it comes to playing the character both as the human being he is, the mentally disabled person and the father. He puts many dimensions into the part without ever transcending the realistic limitations of a human being with a serious developmental disorder. His performance is incredibly realistic with his inabilities being emphasized yet not making up most of the elements of the character. Sean Penn's performance is alarmingly accurate with his tone of voice, line delivery and physical movements all being strongly characteristic of a mentally troubled human being. His performance anchors the film really well and gives it a sense of heart, even if the rest of the film smothers his performance beneath inexperience far from his standard of talent.\nMichelle Pfeiffer is also a powerful character. Although her character also incurs an excess of melodramatic repetition in the story, as the story progresses she is given material which is slightly more flexible and she gradually puts stronger emotional spirit into the part. She has a really hard exterior in I Am Sam which gradually breaks down more and more as viewers get a sight of what she is feeling. Her chemistry with Sean Penn is consistently strong as well, so it is good to see Michelle Pfeiffer active again as an actress after a brief period of inactivity.\n\nDakota Fanning's screen time is really too minimal because her performance in I Am Sam is deserving of serious praise. As she has proved many times, Dakota Fanning has the ability to command the screen whenever she is on it and do it in a manner which is really convincing, and that is important in a film as artificial as I Am Sam. Dakota Fanning is full of youthful charisma and natural charm in her part where she shares some powerful moments with Sean Penn, and she shows a lot of sophisticated acting talent for a girl her age. Dakota Fanning delivers a wonderful supporting effort in I Am Sam.\n\nBut despite the power of the cast led by Sean Penn's excellent portrayal, I Am Sam is overly sentimental in handling its subject matter with misguided direction and a heavily stereotypical script which degrades the serious nature of the film's subject matter.",
            "review_date": "2014-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the horror of full retard dad movie.",
            "review_date": "2014-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Penn disappears into his character along with Pfeiffer. The problem is the audience always sees Sam as a mentally unstable man with not much more to the character. When you see a film like Forrest Gump, the fact that Forrest is mentally unstable disappears after the first five minutes and you see all the other aspects to the character that make him seem unique and special. This wasn't something I saw in \"I am Sam.\"",
            "review_date": "2014-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Dakota Fanning and Sean Penn. But gosh.. this movie seems like it never ends.",
            "review_date": "2014-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have watched this movie at least 10 times, and every time I have cried. But, i will watch it a thousand more times.",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films out there! A magnificent film, had me in tears almost the whole time. Outstanding performances from Sean Penn, Dakota Fanning & Michelle Pfeiffer.",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Am Sam is a film that is brilliantly acted with a very nice touch,but the story nearly falls apart due to an unrealistic plot and bloated running time of over two hours",
            "review_date": "2014-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We all loved Sean Penn's performance in \"I am Sam\" but you can't make a good side and a bad side when the bad one is a better choice.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This could be a movie family treat, especially with the father-daughter relationship :-) Can't help but cried over this way back my sophomore year in college :-)",
            "review_date": "2014-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "yes yes yes yes yes I want to see it",
            "review_date": "2014-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like sean penn, but I have to be honest, he cant play a retarded guy. He can play a gay guy pretty good though.",
            "review_date": "2014-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, i agree with critics now. \n\nwww.harianfilm.com",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Am Sam might be one of the most pretentious, manipulative, and insultingly simple films of the 21st century.",
            "review_date": "2014-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A special film that spreads the good vibes of kindness.",
            "review_date": "2014-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this movie in a Ethics class when I was around 13 years old and thought it was a very deep and moving film that generated a debate among my class mate which is always good.",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a cute, sweet, and adorable film of a man trying to prove that despite his disability and shortcomings he can indeed care for his little girl despite the naysayers who believe that he will fail",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "39%\nSean Penn: \"Look guys, I played a mentally ill person! Give me my Oscar, please?\"\nBut to be fair, he's good in it.",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may just be overly sappy, but Sean Penn is phenomenal and does a job that many couldn't do any better then what he delivers.",
            "review_date": "2014-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely touching! Sean Penn is extra ordinary!",
            "review_date": "2013-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sean Penn, you have changed.",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were times when the autistic lead displays more clarity in thought than the irrelevantly dragged plot..",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've always liked this movie",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I still don't know why critics are hating this classic drama. I thought I Am Sam is one of Sean Penn's greatest movies and his performance is amazing. Nobody can't top that honor. If this movie have been nominated for an Oscar, then how come these jokers (that means Critics) starts to bash the movie in the first place? I mean, the film is not that bad. It features a great performance by Penn, a young Dakota Fanning, and Michelle Pfeiffer, the story looks heartbreaking and emotionally charming, I believe it's one of the best movies in the past decade.",
            "review_date": "2013-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The customer's always right.\" Yes, and the customer thought this movie sucked.",
            "review_date": "2013-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Something to warm the hearts of audiences but ultimately this feels contrived. Penn appears to be apeing rather than becoming mentally disabled. At its worst, it actually causes us to alienate his character and hope that he doesn't end up with the kid after all.",
            "review_date": "2013-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite it's honest lead performances, it's plot it's not as compelling as them.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "yap its good. Dakota Fanning is a talented actress",
            "review_date": "2013-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best most touching movies. The only thing I can say could improve is the camera work could be less shaky. The only reason why it didnt win awards is because,\"YOU NEVER GO FULL RETARD!\" Anybody get the quote?!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still adore this movie...Sean Penn at his best!",
            "review_date": "2013-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many people quote Robert Downey Jr. in Tropic Thunder and criticize Sean Penn's over-portrayal of the mentally disabled. However, Sean Penn's endearing performance, as well as Dakota Fanning's sharp portrayal, is the only focal point of the entire film. The plot is horrible for wasting Sean Penn's efforts, for we all deeply believe that he should not be taking care of his daughter with his messes. But later he is suddenly able to earn a big fortune to ensure a high quality of life, not to mention the forcible happy ending which Laura Dern is suddenly willing to give up and the court is not persisting anymore. The transitions are totally unreasonable. The artificial sympathy fails to come into effect and put viewers in dismay instead.",
            "review_date": "2013-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie so much and don't quite understand why it has such negative reviews. The only reason I didn't give it 5 stars is because you can't really root for Sam because it would be better for the girl to live with other people who can look after her. But I still bawled like a baby in this movie, which doesn't happen very often.",
            "review_date": "2013-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Magnificent performance by Sean Penn!",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "and i want to tell to every one gave this movie low score to stop watching any real drama movie",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sean Penn is marvelous.\nPeople say this movie is terrible, but I think it's perfectly executed.\nIs it simple? Yes, but what matters is the journey that takes place.\nThis film is excellent.\nGreat writing, directing AND acting.\nShouldn't be compared to other flicks with leading characters that have a mental disability, because it's genuinely a great movie.",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boosting with great acting from Penn, Pfeiffer and Fanning, plus, the way it manages its intentions through the flow of the story will surely give you tears...",
            "review_date": "2013-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often overwhelming with bloated emotions, I am Sam is tough to sit through despite its efforts in doing just about anything to get viewers to be sympathetic for the well-performed Sean Penn.",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I realised how good an actor Sean Penn is! Loved this movie.",
            "review_date": "2013-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I knew going into this that I was going to come out in tears. This movie pulls at your every last emotion. Sean Penn is fantastic, portraying Sam as the loving father that he is, despite his disabilities. A wonderful story about love and it's power.",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Sean Penn's best movie performances.",
            "review_date": "2013-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I appreciate the film's message with my whole heart: Parenting is hard no matter how intelligent you are, and it takes a strong heart and open arms to raise up a child (but it takes faith in a God greater than this earth to truly raise one right, in my opinion). However, this is a film that wallows in sentiment more than a little bit.\n\nThe color palette for the film is odd and unorthodox to a fault, and tends to muddle the experience for me, just a bit.\n\nThat being said, the combination of efforts from the director and the stellar cast on an acting front is nothing short of a marvel. Sean Penn gives one of his most transformative performances, Michelle Pfeiffer does a magnificent job expressing subtle emotions in an otherwise not-so-subtle role, and the wonderously talented Dakota Fanning gives a fantastic little performance, and manages to stand toe-to-toe with the heavyweight acting prowess of Sean Penn.\n\nOverall, this is a performance-driven film that seems to be striving for something more; it all just felt a little bit condescending sometimes. I know this is a favorite of many people, and I truly applaud the effort from the makers of this film, because this is very treacherous territory, but it just wasn't for me. Great performances though! Some of my favorite performances in fact.",
            "review_date": "2013-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very touching with love at it's core, a natural father and daughter story. The tension between Sam and the outside world is pressed upon the audience rising the emotional level. The passing of Sam's mental capacity by Lucy's knowledge is hard to watch and a purposeful over reach to have viewers feel connected. Sloppy when it's meant to be cute, except in the case of the importance of honesty. Heartwarming but again overreaching. Sean Penn clearly did his research and is obedient in staying in character and seeming handicap. Eventually Penn's and Pheifer's characters bloom together, but her relationship with her son might be too much for the dramatic aspect. Wiest's character should have been either strongly portrayed or lef out completely, not just briefly-dramatically involved. Ending was too prolonged and should have been swift rather than sketched around to end up jumping to a fairy tail hault of a conclusion.",
            "review_date": "2013-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This no doubt WILL take an emotional toll on you. It is terribly underrated and Sean penn should have won another Oscar for his role as Sam. Michelle Pfeiffer also did a fantastic job! If you want a real tear jerker movie I Am Sam is the movie to watch!",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"That's a wonderful choice\" -sam",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sean Penn should have won the Oscar for this performance",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie, great story",
            "review_date": "2013-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why so much don rated wen it is undeniably powerful ?",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dangit! I cry every time I see this movie. ridunkulously good. Sean Penn is the man.",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never go full retard.  Fine performance by Penn.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've never cried so much, during a movie, in my life. It will be hard to match.",
            "review_date": "2013-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this fim so much!!It's so sad & sweet, & I havent even seen the ending but I love it anyway.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really sad, but Sean Penn played the role so well",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "to me, it's a tearful movie..\neven retarded know how to love.",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good thing he never went full retard. \"you never go full retard!\"",
            "review_date": "2013-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are some films which can be seen again and again. In my book . this one is right there at the top.Sean Penn  plays Sam, a single father with  developmental disability trying to bring up his daughter Lucy( a young Dakota Fanning). Sam's life begins to go under when Lucy turns 7 and the state wants to put her into foster care.Sam approaches a high-powered lawyer, Rita Harrison (Michelle Pieiffer), has earned  a reputation as cold and unfeeling. Sam obviously cannot afford her fees and Rita tries to brush him off.But Sam is persistent and Rits begins to feel for him, finally accepting his case as bro bono , to the shock of her associates. Watch this for the touching story it is and for Sean Penn\"s brilliant portrayal as a   developmentally disabled adult . And yes, this is the movie that inspired Main Aisa Hi Hoon but the quality is worlds apart.",
            "review_date": "2013-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cried through the whole movie! loved it soo much!",
            "review_date": "2013-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it !! made me cry.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely, very sad and amazing movie has a somewhat confusing story but will make you cry like a child! :D",
            "review_date": "2013-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of the saddest movies ever made. Superb preformaces and an incredibly compelling story.",
            "review_date": "2013-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a good sad movie.",
            "review_date": "2013-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very sweet! Refreshingly different role for Penn.",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "...undeniably fun but this is nothing but a pretentious piece of cinema.",
            "review_date": "2013-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only does the manipulative I Am Sam oversimplify a complex issue, it drowns it in treacle.",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film goes to show you that often critics lose their humanity and writhe in puddles of their own egotistical nonsense.  This is a great film with a brilliant performance by Sean Penn (who broke the rules and went full retard).  I wouldn't put it up there with Rain Man, but this is still a great film.  Michelle Pfeiffer wishes every film she was in was like this, and Dakota Fanning is cute enough to get away with playing the same role she played in every film she did as a child: the little girl who's too smart for her own good.",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful and touching film",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loving fathers don't come cheap, you have to fight for them. amazing story of a father and daughter team broken up by so called professionals in an effort to give the child opportunity as she grows beyond the capacity of intellect the father can provide. well done.",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an incredibly emotional movie that might have been the most amazing performance Sean Penn ever gave in his career.  He plays a mentally handicapped man named Sam.  He has a daughter played by Dakota Fanning when she was little named Lucy after the song \"Lucy In The Sky with Diamonds.\"  The mother of the child runs away leaving Sam to raise Lucy by himself.  He makes a living by working at Starbucks for $8.00 an hour.  He has the intellectual capacity of a 7 year old, and they are worried that he won't be able to take care of her when she turns 8, because she will be smarter then him at that age.  When an incident goes down at Lucy's 7th birthday party, Sam gets arrested.  He is released but has to go to court to see if he is eligible to take care of his daughter.  Which creates a lot of emotion.  It gets tough to watch at times, because it is sad.  You get a wide range of emotions actually.  You feel all emotions pretty much.  There is a lot of warmth, but there is so much heartbreak.  There are about two different scenes where you may shed a tear.  I wont tell you them though.",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow what a great movie lol",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hi, Sam. I am Skyler. And I hate your stupid use of Beatles songs done by NOT the Beatles. Go die.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cute but not my cup of tea",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very heart warming movie, even the unfortunates can have the biggest hearts.",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very touching movie.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        }
    ]
}