{
    "rating": 8.1,
    "release_date": "2002-01-25",
    "num_reviews": 310,
    "genres": [
        "Sci-fi",
        "Anime"
    ],
    "summary": "Visually stunning Japanese anime interpretation of Fritz Lang's classic film, also based on Osamu Tezuka's outstanding 1945 illustrations. A Japanese detective and his young nephew go on the trail of a dangerous scientist, who they discover has created the beautiful Tima, destined to control humanity's future.",
    "reviews": [
        {
            "content": "The worst sci-fi anime PG-13 flick ever, LOL!!!!!!!!!!!!!!!!!",
            "review_date": "2022-04-09",
            "source": "rt"
        },
        {
            "content": "I generally don't like cartoon/animated movies, but this was real good. Good plot. Interesting the cartoon technique they used. Never saw the real old version of this movie. Can only judge by this. Reminded me a bit of I, Robot. except the robots here are all on the good side for the most part.",
            "review_date": "2021-07-10",
            "source": "rt"
        },
        {
            "content": "Smooth animation and vibrant colors, but I'll stick with Akira and Alita.",
            "review_date": "2021-03-02",
            "source": "rt"
        },
        {
            "content": "Metropolis is one of the most spectacular animated films ever made. Nothing short of a visual and technological masterpiece, the film seems to have been unjustly forgotten since its release, however, overshadowed by Studio Ghibli's Spirited Away, which was released the year after. Loosely based on an early manga created by the legendary Osamu Tezuka (best known for creating Astro Boy and Kimba the White Lion), the film is a fascinating story that balances many complex and thought-provoking themes, such as political corruption, class struggle, the dangers of fascism, the relationship between man and technology, and, perhaps most importantly, the question of what exactly makes one \"human?\" The animation is some of the finest ever seen in an animated film. The fluidity of the characters' movement puts the best of Ghibli's work to shame, and at times rivals even Disney. At the same time the film makes heavy use of computer graphics, which haven't quite aged as well as the 2D animation, but were groundbreaking at the time. However, the film's visuals are precisely why it falls just short of \"great movie\" territory. The visuals too often overshadow the plot, and the character relationships and plot elements simply aren't developed enough to make quite the emotional impact the creators had undoubtedly hoped for, particularly at the film's climax. That being said, Metropolis is a tragically overlooked film that is a must-see for any lover of animated cinema.",
            "review_date": "2020-11-08",
            "source": "rt"
        },
        {
            "content": "While confusing in the beginning, if you pay attention and last through the full experience, Metropolis culminates into one of the best and most emotional stories I've seen in any animated film. You'll be treated to a wonderfully drawn world that feels alive every step of the way, with old-timey music that is unlike any other film in it's genre. Astute viewers will understand more than just the plot, however. Indeed, Metropolis delivers a powerful and deeply thought out message commenting on the human nature, and what we consider to be worth calling human, or indeed, if that is even a question one should ask. It provokes thought about segregation that is happening even in today's society, where this is thought to have been eliminated long ago. Metropolis is an incredible achievement for animated film, and film in general. This is one movie that, if you call yourself a fan of the genre it belongs to, you have no choice but to see it.",
            "review_date": "2020-11-01",
            "source": "rt"
        },
        {
            "content": "Although very rough in character designs, Metropolis otherwise features fantastic animation, especially when it comes to stupendous architecture, an interesting color palette and it is overall quite polished. The old-fashioned score is also wonderful, and the film has great direction and dialogue. However, the emotional connection is non-existent, the characters are just solid, and the story is far from memorable and never as thematically complex as the original 1927 classic upon which this one is only loosely based on.",
            "review_date": "2020-06-18",
            "source": "rt"
        },
        {
            "content": "Overall plot was interesting and the story was mostly well-focused. The only thing I guess would be more character development from some characters, especially Tima. So there were times where I always felt they could do more scenes in terms of backstories for certain characters, as it's a movie, so I need to know them better. Ending felt hanging in the clouds sometimes, which is another thing that deducted my rating a bit.",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "A masterpiece of animation. A true hidden gem.",
            "review_date": "2020-04-05",
            "source": "rt"
        },
        {
            "content": "Superb adaptation of Osama Tezuka's classic graphic novel in that it takes liberties from the original story, making it a true cinematic experience while staying true to the spirit.  The vocal cast is superb across the board while the filmmakers deliver one of the best animated movies in recent years.  Director, Rintaro, and writer Katshuhiro Otomo expertly adapt Tezuka's novel, keeping the themes but making changes needed to condense it into a 2 hours movie (something Otomo brilliantly did with his own \"Akira\").  Some characters are even added, despite fitting in perfectly (Rock is a notable example).  The story remains the same, using robots and humans as a nice metaphor for bigotry, showing robots acting more humane than humans even in the worse times.  The animation is brilliant as well, with a seamless mix of CGI background and hand drawn cells.   Overall, one of the best animated movies in years and a true tribute to Tezuka's classic graphic novel.",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "METROPOLIS is one of those anime films that literally sucks you right into the story. You immediately feel like you're a part of the world, connecting with the character's emotions, and brilliant screenplay from Katsuhiro Otomo (AKIRA).",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "One of the most visually appealing animated films I have ever seen.\n\nDisclaimer: I did not see Fritz Lang's original film or read the manga. So that may affect my review.\n\nMetropolis is a compelling story that mirrors the biblical tale of the Tower of Babel. Man's ambition leads to its own (near) demise. The story also revolves around the class struggle between the middle (people) and working-class (robots). As the story progresses, the audience explores the city with the main characters. And like the city itself, the story is layered with lots of deeper meaning. The mood is full of awe and child-like throughout.\n\nWith all the storytelling, there are the visuals. And this film takes its time to show incredible shots of the city. There are details in every person, movement, and action. Not to mention the Art Deco heavy design of the buildings which hark back to 1920's vision of the future. This is a film that MUST be seen in full HD+ to be appreciated.\n\nThe music also takes a nice twist on other films of the time. The producers make some interesting -- and well appreciated -- choices by adding NOLA-style jazz. There's something unique with the choice of music that adds even more enjoyment into the film.\n\nThis is a film that can be studied many times over and still yield new findings. There's a story of love, of class struggle, the rise (and fall) of fascist idealism, among many others. And the visuals and music alone make this a perfect film to visit and revisit time and time again.\n\n4.5 or 5/5. A well thought out film that leaves nothing to chance. A visual and cinematic masterpiece. Instant classic and must watch.",
            "review_date": "2019-09-26",
            "source": "rt"
        },
        {
            "content": "In order to appreciate the beauty of this film you need to watch it on the big screen, its animation and breathtaking. I loved it the first time I saw it, but it is not a movie you can re-watch. While the animation is beautiful, the style of the animation jars. This is a serious movie about serious topics, but the characters are drawn in a manner similar to astro boy. This is not surprising considering the producer, but on a 2nd watching its something you begin the notice. The lack of dialog is also an issue for the 2nd watching, although this is not an issue when you watch this for the first time. I class this as a must watch, but you may find you cannot come back to it for a 2nd viewing without spoiling your first impressions of the movie.",
            "review_date": "2019-08-02",
            "source": "rt"
        },
        {
            "content": "Gushing with iconic cartoony style and an old-fashioned (for better or worse) steam-punk story with an emotionally stinging finale, this anime holds its own in the history of the medium as an examination of humanity in a future context, as well as a love letter to sci-fi films of old.",
            "review_date": "2019-07-25",
            "source": "rt"
        },
        {
            "content": "The old school 1945 style gives this movie a great feel even though its kinda futuristic. And i actually felt a real connection to some of these characters. ",
            "review_date": "2019-07-12",
            "source": "rt"
        },
        {
            "content": "Fair anime, but bad voice dubbing and misused jazz music that doesn’t seem to fit the film in scenes where its used. I can see what they were going for, but it just doesn’t work. Great visuals though - loosely based on the great 1927 silent film",
            "review_date": "2018-03-25",
            "source": "rt"
        },
        {
            "content": "Filme interessante, me lembra Akira.",
            "review_date": "2018-03-20",
            "source": "rt"
        },
        {
            "content": "The movie was really really good, the animation in the entire two hours was amazing...but...that last part, they used a poor excuse for that damn ending. There's a lot of wrong things in those last 20 minutes. \nI stoped to understand why she got crazy for no damn reason and It was because of the bullet, but still, the fact of her taking the choice to be a gun it's dumb, even if she didn't had feelings for those minutes It makes no sense that the most logic choice was \"destroy them\" since she was being blackmail with her human Friends! I don't know, maybe for some people the ending was good but to me that was an excuse for an exciting ending that no one really asked for.",
            "review_date": "2018-02-17",
            "source": "rt"
        },
        {
            "content": "Rintaro really teared the classic up, and through in a stupid remake! Transforming into a anime is a bad option, come on!",
            "review_date": "2017-08-03",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful underrated anime films I have ever watch.\nThis film needs to be more recognized.\nAnd I would support it!",
            "review_date": "2017-06-24",
            "source": "rt"
        },
        {
            "content": "interesting futuristic animated cartoon that leaves you with the idea that there will be sequel at the end.",
            "review_date": "2017-03-29",
            "source": "rt"
        },
        {
            "content": "Interesting mix of animation styles from early Disney through tin tin and shades of Ghibli. Great English score including songs by Ray Charles. The clashing styles can be distracting at time but I really enjoyed it.",
            "review_date": "2017-02-08",
            "source": "rt"
        },
        {
            "content": "Extremely overrated if you ask me. The art designs are so bad, and the cinematography is unbelievably confusing the whole time. It's not good.",
            "review_date": "2016-10-08",
            "source": "rt"
        },
        {
            "content": "One of the greatest animated films ever made.",
            "review_date": "2016-05-08",
            "source": "rt"
        },
        {
            "content": "Successfully pulling off impressive animation and mature themes, \"Metropolis\" combines stunning visuals with a politically charged allegory.",
            "review_date": "2016-05-07",
            "source": "rt"
        },
        {
            "content": "Me gustó, empieza muy bien pero decae. Muy buena música y muy buenos escenarios.",
            "review_date": "2016-02-18",
            "source": "rt"
        },
        {
            "content": "No será un filme tan redondo, pero, Metrópolis de Osamu Tezuka, resulta ser un festín visual espectacular, en la que tanto narrativamente como visual y sonoramente están impecables. y los personajes, no hay queja alguna, al menos en lo personal.\nUna de mis películas de animacion favoritas en general.",
            "review_date": "2016-02-13",
            "source": "rt"
        },
        {
            "content": "Just watched half of it for a class at UBC. Such a visually beautiful film!",
            "review_date": "2016-01-26",
            "source": "rt"
        },
        {
            "content": "one of my favorite animated films. Stylish and the music is phenomenal.",
            "review_date": "2015-12-03",
            "source": "rt"
        },
        {
            "content": "With an awesome art style, fluid animation, creative visuals, a terrific Jazz soundtrack and one of my favourite climaxes in any film ever, this is definitely an underrated gem!",
            "review_date": "2015-11-18",
            "source": "rt"
        },
        {
            "content": "This one of the most unique sci fi animated movies I have ever seen. It centers around the future in where it looks pretty much as where once pictured it. The story is pretty simple: Rule the future with a robotic girl who has no idea who she is. The characters are very interesting in my opinion. Especially the antagonist Rock and the main character Tima. This film reminded me of the consequences humanity can cause itself by inventing robots who look like humans because the biggest question I have asked myself and will keep asking is this: Can robots feel emotions and have feelings as we humans do? And why shouldn't they? Tima to me reminded me of David from the movie: Artificial Intelligence, and to me they both feel real even if they are both robots. But what I really admired about them is how they view the world surrounding them and ask us: What does it mean to be human? And why does society built something that they eventually regret? Robots in this case, because they go against them and question their purpose. I really loved this movie very much. It's masterpiece in the place of sci fi movies and it earned it! This movie is one I will treasure forever!",
            "review_date": "2015-11-03",
            "source": "rt"
        },
        {
            "content": "Releitura do clássico dos anos 30 conta a história de uma andróide perfeita que está prestes a mudar o mundo, mas que acaba se apaixonando por um garoto comum. A qualidade da animação é incrível, mas o roteiro deixa um pouco a desejar.",
            "review_date": "2015-10-02",
            "source": "rt"
        },
        {
            "content": "The animations and visuals are truly stunning. A level of detail I've never seen in any other animated movie. I really can't imagine the time and patience it had to take to make. Besides being a piece of art, I really didn't care that much about the story and its characters. If it wasn't for the eye-popping visuals, it wouldn't have kept hold of my interest through the whole movie.",
            "review_date": "2015-05-06",
            "source": "rt"
        },
        {
            "content": "This is a difficult film to judge, since it definitely delivered the symbolist, aesthetic, and authentic, look of the Osamu Tezuka-style (the futuristic Metropolis and the seemingly post-apocalyptic underground society were superbly drawn and deserve to be ranked among the best settings in anime), and succeeded in preserving the philosophical complexity of the story, which was actually perfected by Tezuka not in \"Metropolis\" but in his magnum opus \"Astro Boy\" (thank God it was not a Hollywood production, otherwise the human-robot story of this film would have been surely \"dumbed down\" to get more money from the American audience and more hatred from manga lovers. The characters and the relationship between them were also depicted with utmost affection from the film-makers, since their appearances, and feelings, were paid equal attention, which made them look real, and feel real (yes, even the robots!). Still, the film to me has an unfortunate sense of emotional detachment, which makes \"Metropolis\" a film to admire but not a film to feel, and to enjoy. Maybe this was due to the temporal constraint of animation in comparison with the lengthy freedom of manga, which led to the inadequate character development and emotion build-up before the abrupt climax in the end. The tempo of the film is also a little bit troublesome, with some very energetic action sequences alternated by slow yet emotional scenes (often submersed in a wonderful jazzy or old-school music environment) without a real smooth transition. This is the reason why the ending, in my opinion, did not give the audience the necessary feeling of sympathy and regretfulness (the deviation of the plot from Tezuka's manga to Fritz Lang's film maybe also another reason, since Katsuhiro Otomo often has issues with the script due to his sometime-too-strong authorship and creativity). Still, the ever-attached sense of admiration followed the audience throughout the film and this alone is enough a reason to watch, and re-watch, \"Metropolis\". If only \"Astro Boy\" were made by this same team instead of those crappy Hollywood studios...",
            "review_date": "2015-04-03",
            "source": "rt"
        },
        {
            "content": "Visually stunning and atmospheric, but the story is nothing special.",
            "review_date": "2014-10-06",
            "source": "rt"
        },
        {
            "content": "Technically impressive.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "One of the best examples of a perfect animation that isn't from Pixar or Ghibli, the film's surreal cyberpunk atmosphere alone is enough reason to watch. People saying that the direction of the plot is overdone forget that this is based off of a manga from 1945, of course it's overdone by now. Both the dubbed and subbed versions are equally great and the soundtrack is phenomenal. A must-see for any lover of animated or regular films.",
            "review_date": "2014-07-21",
            "source": "rt"
        },
        {
            "content": "An enjoyable anime that uses it's intricate and gorgeous visuals to suck the viewer into it's magnificent world of imagination and creativity. This is probably one of the best looking animes I've seen, third to maybe to Akira and Princess Mononoke.",
            "review_date": "2014-06-10",
            "source": "rt"
        },
        {
            "content": "Even though, storywise, it implodes after the second half, Metropolis is still superior to later Steamboy, and almost 15 years later its visual didn't age. In the end, it's style over substance, but great style.",
            "review_date": "2014-06-02",
            "source": "rt"
        },
        {
            "content": "I am so sorry it has taken me such a long time to post a review. In fact it has taken almost half a year since my last post, however I am planning on starting again with full force with at least one review each week. As a start to my upcoming Anime review marathon I started out with this amazing sci-fi classic Metropolis. \n\nThe Story: We meet our protagonists Kenichi and Detective Shunsaku Ban who are currently on a mission to hunt down a fellow named Laughton. Clues hint at his location in a futuristic city known as Metropolis. The city where humans are at the top of the food chain and robots are treated like slaves to fulfill societies addiction to materialism.  Politics, economy and culture are all tied together and formed by the mechanical industry. Little do Kenichi know that the professor they are after had created a humanoid named Tima with the sole purpose of destroying the world.\n\nAlthough it might sound cliche, it`s really not. I found myself enjoying the characters a lot actually. Some of them do stand out as one dimentional but thankfully that isn`t the case with Tima, Kenichi and Shunsaku which are the ones with most screen time. The villain is forgettable with few personality traits and little to no true intentions as to why he would like to destroy the world using Tima. The Plot in and of itselfe isn`t that interesting but rather the journey with the characters until the climax is what stayed with me. What I remember the most is actually the scenes with a lot of dialogue. Metropolis itselfe is an interesting concept which has been done before but never in this kind of setting. The world building in this film is incredible. I love how you are transported into this alternate future. This is in large thanks to the dialogue. You are presented with all the world building through cleverly written dialogue aswell as visuals that do tell a story on its own about Metropolis`s history. \n\nScreenplay is as stated quite solid. There were no stand out spectacular scenes but there were no awful ones either. My favourite moment has to be between Tima and Kenichi when they get to know each other.\n\nThe direction Rintaro went with is easily the best thing about this movie. Metropolis comes to life thanks to jaw dropping special effects. This is one of the most visually stunning animes I have seen so far. The colors flourish, the backgrounds sprawls with life thanks to a nice blend of CGI and hand drawn techniques. It`s in my opinion worth watching for the visuals alone. I also have to mention that the art style is very similar to Astro Boy. Don`t get thrown off at how they look, you will get used to the \"doll\" look and actually come to appriciate it in the end.\n\nSoundtrack was okey. Nothing really memorable here. I hope you don`t have anything against Jazz because this movie is filled to the brim with it.\n\nAll in all, I am quite glad I watched it and I have a feeling I will enjoy this movie even more the second time I watch it. I do recommend it relatively high.",
            "review_date": "2014-05-02",
            "source": "rt"
        },
        {
            "content": "Fast-moving Japanese anime.",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "Probably a movie that's only visually superior to the original, and also one of the best anime movies I've seen. Metropolis borrows subtly from the 1927 German film to create undiluted magnificence. With superb animation, some of the best visuals ever and a strong emotional development, this Japanese animated film is one in a million.\r\n\r\nMuch like The End of Evangelion, the visuals are the greatest achievement of the movie, but that doesn't mean the other aspects aren't remarkable. The animation is incredible: fluid, moving, carefully drawn and with its attention to high-detail: all elements feel alive. The music can get a little cheesy, but it's great music, even if I would rather use a complete orchestra than some rhythmical techno-babble music; but granted, there are some orchestral tracks, I just would prefer the whole soundtrack to be like that. I think this is one of those movies with an out-of-body experience. The most interesting things are in the background and not in the forth-ground as expected, and that's good, cause we like such stuff, and I noticed it only happens when the animated characters aren't there or aren't doing something important, great accomplishment there.\r\n\r\nWhile the 1927 original is superior, I have to admit this one beats it in the visuals. I mean, the original also has incredible visuals for 1927, but this also has incredible visuals even for today, and, well, color is color, and this one has it. Not exactly a remake, but still can top the 1927 German film. If there's a downside, it would be that the animation sometimes goes a little too slow, maybe because it wants to emphasize that what's happening is important and has to be dramatic, but it does reach a point where you have to think: \"can you...move it a little faster than that?\", but at least the slow animation is fluid and not merely 1 frame per 30 seconds. A movie that can become one of your best visual experiences.",
            "review_date": "2014-02-14",
            "source": "rt"
        },
        {
            "content": "Utterly beautiful! It reminds me of why I prefer hand drawn animation over CGI. You just cant get this kind of action and animation from CGI movies. A must see for any action, adventure, animation fans. I'd even recommend it to Studio Ghibli fans!",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "Probably one of the best anime films I've seen since Akira! Katsuhiro Otomo and Rintaro's collaborative efforts to create a unique adaptation of Osamu Tezuka's manga of the same name is beautifully animated and tells a very powerful story at the same time!",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "I remember watching this amazing film but apart from that nothing....i'll have to watch it again.",
            "review_date": "2014-01-14",
            "source": "rt"
        },
        {
            "content": "The destruction of Metropolis accompanied by 1920s music is something to behold. However the story is often incoherent, the characters flimsy, and the animation over acted. Still a good film, but I feel the direction could have been much better.",
            "review_date": "2013-12-10",
            "source": "rt"
        },
        {
            "content": "Style carefully cared but the plot is expectable and the dialogues cheesy.",
            "review_date": "2013-10-12",
            "source": "rt"
        },
        {
            "content": "Decent if you like anime but this is no Akira. I wasn't too keen on the visual style either.",
            "review_date": "2013-08-18",
            "source": "rt"
        },
        {
            "content": "I dare you to see it to the end and not be emotional. Good movie you shouldn't miss.",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "Even though I have problems at times, I still love this film.",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "Metropolis wows with its scenery and scale, but the characters, both in their drawn faces and plotted personalities, feel one dimensional and lack more than a single motive force and the simplest explanation for that drive. The plot remains simple as well, contrived to bring necessary characters into scenes that don't naturally host them. \n\nHowever insufficient the plot that drives it, Metropolis is worth watching for the beauty of the action playing in its scenes. From expansive views of the picturesque sun-lit city to the swinging dinginess of its underground, the stages of Metropolis dazzle any audience who'll follow the actors from one perspective to the next.",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "The song being played during the explosion was chosen very well! It's not a very explosion-like song, so it offsets the scene beautifully as well as getting Rock's message across. This has been an excellent movie!!",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Even though the storyline is nothing new, Metropolis is an eye-popping visual treat.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "One of the better reimaginings I have seen, especially of the anime variety.  Great characters, terrific design, and presented by James Cameron?  Sold!",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "The characters are delightful and the animation is full of life. A very impressive world.",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "I haven't reviewed this yet? Huh. Well, this is a fantastic and wonderful anime film that really helps one understand the meaning of being human. There are some pure moments of joy and sorrow to be found in this film. It's got heart and good, quality animation. Worthy.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Excellent movie, fantastic! If you like anime its defiantly a must watch!!!",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "This is one of the most visually and interesting anime films ever made. What really make's this movie really great, are the visuals.. A lot of people say the character model's were bad, but I thought they were good because I thought they were interesting.\"Metropolis\", is an amazing anime flick that's worth watching for anime fans or non-anime fans.",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "My favourte Japanese animated movie and arguably the best movie I have ever seen, yes it even tops Akira or Ghost In The Shell.\nIt's one big tribute to movies like Blade-Runner or Metropolis from 1927 without being a direct rip-off.\nIt has its own look and feel to it and Osamu Tezuka did an amazing job at making it his own.\n\nGreat animations and artstyle:\nI've read Osamu Tezuka's Astroboy back when I was a little boy and his artstyle and animations have been my favourite ever since.\nThe animations make the characters come to live and give them personality.\nBright, colorfull breathtaking scenery makes every scene look like a piece of living art.\n\nLoveable Characters:\nEach character has his or her own personality and a backstory that adds up to the overall feel of the characters.\n\nAmazing Music:\nSome amazing jazzy music that works really well, especially in one of the best animated scenes I have ever seen with Ray Charles - Can't Stop Loving you playing on the background as a finishing touch.\n\nAtmosphere:\nThe 1945-ish style of the manga is still intact and adds to the overall atmosphere the movie wants you to feel, a living and breathing world you want to live in and be part of.\n\nThis is one of those movies that is actually worth buying and watching every once a year, and it will have the same effect everytime as it had the first time you watched it.\n\nDefinitely the most underrated animated movie (I see barely anone talk about it online)\nI recommend this to anyone, no matter your age or taste.\nCheck out the manga too while you're at it, it still holds up despite its age.",
            "review_date": "2012-12-12",
            "source": "rt"
        },
        {
            "content": "vividly imaginative movie with a touch of brilliance",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "Metropolis (of no relation to the 1927 silent film besides a very similar setting) is a stylish, lavishly animated sci-fi masterpiece that contains richness and soul throughout.",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "Intriguing and then touching. Hard to say if it was heavy or light hearted. Certainly emotionally heavy but with the lighthearted look and feel of a lighter anime.",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "some parts of Metorporisu are visually great,but i couldn't get into this. the characters and story falls flat.",
            "review_date": "2012-10-23",
            "source": "rt"
        },
        {
            "content": "A beautifully made animated feature.",
            "review_date": "2012-09-22",
            "source": "rt"
        },
        {
            "content": "Two words: Ray Charles.",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "The story feels like it's straight out of a Japanese video game, but Metropolis is worth checking out for its unique and interesting animation,",
            "review_date": "2012-08-17",
            "source": "rt"
        },
        {
            "content": "simply stating that Metropolis is one of the greatest animated films of all time wouldn't be doing it any justice, it's so much more than that! At first glance one might not even assume that this came from Japan what with it's very western styled animation, and expect another kid friendly Disneyesque film,  but don't be fooled this is most definitely on par with works like Akira and Ghost in The Shell in terms of mature content. While stylistically not the best looking anime movie, it goes far beyond anything before it with animation that rivals it's Disney counter parts. Everything flows so organically with very few still frames used, something is always moving while on screen. On top of that you can only begin to appreciate the true genius in the animation when looking at the characters. While most anime movies suffer from a severe case of same face when not looking directly at a character, Metropolis went the extra mile and animated every bit of emotion into the characters faces. The entire world of Metropolis is equally ravishing with some of the most captivating cityscapes ever animated. What really brings the entire atmosphere that is Metropolis is the soundtrack. The Jazzy blues gives a certain sense of a classy futurist Noir Film. The story might come off as slow but it it moves well enough that you never find yourself not interested in the movie. Overall while most animated films only bring either a good story or great animation, Metropolis brings everything to the table making it a timeless classic of the anime Genre and by far one of the best animated films I've ever watched",
            "review_date": "2012-08-06",
            "source": "rt"
        },
        {
            "content": "This is a Brilliant film! magical! Love it to death",
            "review_date": "2012-07-30",
            "source": "rt"
        },
        {
            "content": "Fritz Langs plea for a worker /capitalist amnesty is successfully updated as a luminous cyber-punk tale of a robotic war of independence. The exploration of AI here is not exactly groundbreaking, but its got its synapses engaged in the right place - think Asimov and Deckard and you know what to expect.",
            "review_date": "2012-07-18",
            "source": "rt"
        },
        {
            "content": "Una de mis películas favoritas, en especial la secuencia final.",
            "review_date": "2012-07-14",
            "source": "rt"
        },
        {
            "content": "I didn't expect much of it before I saw it, but once I saw it - it blew me away! This one of the most interesting animation films I have ever seen. It's a sci-fi and a thriller. It's got a lot to do with politics and the future of the world. \r\n\r\nThe story is great, it's like nothing you've ever seen before. It's got very realistic themes and yet this is very fantasy like, with robots and god like advance technology. The characters are all so interesting and likeable. Each character played a great role in the story, because there wasn't really a villain in this. It's really about political conflicts. I think it's great that they were able to convey this in such an exciting way.\r\n\r\nThe animation was probably one of the best things about this movie. They animated this movie so beautifully! The visuals were fantastic! I loved the cinematography and some of the landscapes that the artist created were quite creative and looked fantastic. The design of some of the buildings in this were amazing. \r\n\r\nThis is a great Japanese animation film, and it's very intelligently done. There are very smart themes and characters, and the plot never ceases to amaze. There are fun and exciting moments - and we always want that in an animation film. A terrific film for everyone.",
            "review_date": "2012-06-02",
            "source": "rt"
        },
        {
            "content": "A great anime with a visually spectacular ending.",
            "review_date": "2012-05-30",
            "source": "rt"
        },
        {
            "content": "Loved the visuals, but the storyline and mood of the film could have used some work.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "It's such a massive animated film that didn't disappoint the sci-fi audience and animation buffs.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "A detective tracks a criminal inventor to a futuristic city that's just completed a groundbreaking scientific project dubbed the \"ziggurat\". The nephew of this detective befriends a robot girl created by the culprit, but he's unaware of how she plays into the corrupt power structure of the city's technological aspirations. Katsuhiro Ottomo's script loosely adapt's Osamu Tezuka's manga, but it also borrows elements from Fritz Lang's expressionistic silent film of the same name. The animation, shepherded by Rintaro, is intricately lovely despite its inability to smoothly blend CGI with cel drawings. Despite a few strong moments, the unremarkable story makes Metropolis into something that will only be able to captivate a die hard anime buff.",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "A visionary marvel, but it's lacking a depth in storytelling usually found in anime like this.",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "Awesome visual style, but 2/3 through it should already be over.",
            "review_date": "2012-04-12",
            "source": "rt"
        },
        {
            "content": "Yet another fantastic anime film and a \"film\" it is. An echo of the 1927 film, this takes place in a future where robots have become a threat to the mainstream populus. This has some common dystopic themes with other stories but is done in a fresh way. I continue to see how the Japaneese take their animated films seriously and attain to create profound art rather than just silly and vapid entertainment.",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "great story and animation",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "If you want to hear Ray Charles singing, \"I Can't Stop Loving You\" while a skyscarper is blowing up in the middle of a robot uprising, this movie is for you, I'd also recommend some psyche evaluation",
            "review_date": "2012-04-06",
            "source": "rt"
        },
        {
            "content": "Could be the equivalent of a Disney Classic, but designed for Eastern culture. However, more complex political and social issues abound making it suitable for a more mature audience.",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "http://www.youtube.com/watch?v=QP6A91qoFi0",
            "review_date": "2012-03-30",
            "source": "rt"
        },
        {
            "content": "Made me think more deeply about my first experience, just last week, with Fritz Lang's silent 20s  \"Metropolis\".  That film was fulfilling because of its boiling angst, hallucinatory images relating past human failings with those of our present, and true human relationships forged out of common struggle pitted against vanity and inability to relate, a hollow power.  This particular anime film does not fully develop the meek, unified human will yin to the vain, arrogant, self-descructive yang that made Lang's film work.  Because of that, while certainly not hollow, it's not fully realized.  This film was enjoyable; the final stand was beautifully demented, as unchecked pride plummeted toward its logical ends.  Something nice (and twisted) for a Sunday, late afternoon; but nothing terribly fantastic.",
            "review_date": "2012-03-11",
            "source": "rt"
        },
        {
            "content": "The man who Made Astro Boy has made yet another film. OH BOY. THIS ONE SUCKS. Metropolis is based off the manga based off the masterpiece 1926 film of the same name. Now you would think that if the film is based off a manga sereis it would at least stay true to the original. No... Nothing about this movie can save itself from its annoying, slow and scratchy story and characters. Frederer or \"Rock.\" is now a villian, The girl is to young, there was never a private detective or a robot sidekick, Frederer was like the detective in the film. The animation is one of the most acceptional parts of the film as it makes up for one of the best destruction sequences of all time. But thats not enough to stop the writers from putting every single moment in Metropolis in different spots. Metropolis fails.\n\n48/100 C-",
            "review_date": "2012-03-02",
            "source": "rt"
        },
        {
            "content": "It's one of my favourite movies ever. The art is jaw-dropping, the story is wonderful, and it has one of the most moving climaxes I've ever seen.",
            "review_date": "2012-03-02",
            "source": "rt"
        },
        {
            "content": "A wonderfully animated story. Classic sci fi.",
            "review_date": "2012-03-01",
            "source": "rt"
        },
        {
            "content": "brilliant. 'nuff said.",
            "review_date": "2012-02-26",
            "source": "rt"
        },
        {
            "content": "One of the best animated films ever made.",
            "review_date": "2012-02-25",
            "source": "rt"
        },
        {
            "content": "Kind of Akira-like atmosphere, most of the humor in the original Tesuka manga has been vanished from this version made by Otomo (Akira creator). What makes this film worth the while is the good choice in the soundtrack, although the animation is A grade quality.",
            "review_date": "2012-02-20",
            "source": "rt"
        },
        {
            "content": "Both in its visuals and narrative, as well as it's jazzy and classical music, Metropolis by Tezuka is just as engaging as Lang's original, even if Tezuka didn't do it as an adaptation at all (Tezuka himself even said he never saw the film - the idea came to him from a movie poster from Lang's Metropolis).\n It is absolutely epic and boasts detailed and fluid animation that even Heavy Metal and FLCL should be jealous of.",
            "review_date": "2012-02-15",
            "source": "rt"
        },
        {
            "content": "Tulips to the eye candy animation, turds to the slow plot.  I'm sure there's better anime out there, this one wasn't very good.  The soundtrack though, is nice.",
            "review_date": "2012-02-13",
            "source": "rt"
        },
        {
            "content": "It's surprisingly original, considering that the original manga was written in 1949. Kids films really don't get better than this.",
            "review_date": "2012-02-11",
            "source": "rt"
        },
        {
            "content": "\"I can't stop loving you, ive made up my mind.\"",
            "review_date": "2012-02-10",
            "source": "rt"
        },
        {
            "content": "Director Rintaro stubbornly refuses to progress a barely existing plot, expose motivations, make connections or build towards any kind of conclusion simply wasting your time for 108 minutes. While the visuals are of course great, with nothing remotely available to serve they also are totally fucking pointless (like this whole thoughtless movie). Anyone who is into the genre knows, that for what reason ever, anime does barely ever provide you with a tight narrative or even a solid plot, but let me tell you this movie is just off.",
            "review_date": "2012-01-14",
            "source": "rt"
        },
        {
            "content": "Classic from the All-star producers :D",
            "review_date": "2012-01-04",
            "source": "rt"
        },
        {
            "content": "I spent $4 on a special edition of this flick and want my money back. Anime flicks rarely get dumber and more pretentious than this. The environments are great, and the animation is decent, but hardly impressive, except for Tima's hair blowing while she stares epicly into the sky on... more occasions than necessary. The idea is interesting, but the story is focussed on all the wrong characters, and for it to be Tezuka it's surprisingly bland. The character Rock wins points for being the most annoying animated character ever. If you're looking for something stupid and fun that barely makes sense, go for Ninja Scroll or Blood: The Last Vampire. This one's stupid but not fun.",
            "review_date": "2012-01-01",
            "source": "rt"
        },
        {
            "content": "One of the best anime films ever made, beautiful animation, intriguing story line",
            "review_date": "2011-12-24",
            "source": "rt"
        },
        {
            "content": "An interesting remake of a classic. Unfortunately the warm and colorful animation gives way to a cold and mostly robotic retelling.",
            "review_date": "2011-12-13",
            "source": "rt"
        },
        {
            "content": "A perfect masterpiece!",
            "review_date": "2011-12-11",
            "source": "rt"
        },
        {
            "content": "The storyline and lip-syncing aren't as amazing as the CGI backgrounds and traditional animation blending. But Metropolis is still an enjoyable and above all emotional film for big anime fans and audiences with an open mind for beautiful yet depressing cartoons.",
            "review_date": "2011-11-22",
            "source": "rt"
        },
        {
            "content": "The animation and the computer graphics was interesting. The animation looked like it was created in the early 1980's. The story was interesting as well but it felt a little slow from time to time.",
            "review_date": "2011-11-21",
            "source": "rt"
        },
        {
            "content": "Clearly falls short of Fritz Lang's genius original, but still a good adaption, definitely worth it for any Anime fans, and maybe some of the more tolerable sci fi fans.",
            "review_date": "2011-11-02",
            "source": "rt"
        },
        {
            "content": "Didn't see the original film before watching so this one was a leap into something. Screenplay is amazing, Otomo-influences were clearly visible. I also enjoyed the style being drawn back to Lange's times... with adaptation of course. Story was OK, but once again it's worth waiting for the end.",
            "review_date": "2011-10-27",
            "source": "rt"
        },
        {
            "content": "Overlooked, stunning, and underrated.",
            "review_date": "2011-10-02",
            "source": "rt"
        },
        {
            "content": "As a movie adaptation of a Japanese comic book written over half a century earlier, it combines elements of old with the new. Picturesque and well-defined, it is sure to delight!",
            "review_date": "2011-09-10",
            "source": "rt"
        },
        {
            "content": "A story that might not be the most original or complex or appealing but Japanese storytellers know their craft and you enjoy their efforts, plus the visuals are good as usual.",
            "review_date": "2011-09-05",
            "source": "rt"
        },
        {
            "content": "Miyazaki and Oshii get all the fame and recognition, but I've always found Rintaro to be the most visually interesting of all the big anime directors, and he really outdoes himself with this stunning beautiful piece of retro-sci-fi. Rintaro teams with AKIRA director Katsuhiro Otomo do flesh out an interpretation of the great Osamu Tezuka's classic manga, which itself was a sort of re-imagining of Fritz Lang's famous silent film.  The result feels like an old Max Fleischer cartoon (the act deco designs of his SUPERMAN shorts with characters reminiscent of his POPEYE films, granted the fluidity is on par with early Disney, specifically SNOW WHITE).",
            "review_date": "2011-09-01",
            "source": "rt"
        },
        {
            "content": "very, very, good movie",
            "review_date": "2011-08-22",
            "source": "rt"
        },
        {
            "content": "great film, it was an great film but I'm not sure if I can watch the film again, it was a good film, it was directed by Rintaro and it starred Keiji Kobayashi and Yuka Imoto, it was good movie",
            "review_date": "2011-08-05",
            "source": "rt"
        },
        {
            "content": "The attentition to detailis amazing but the character designs were not for me. and plot holes. El atencion al detalle is increible pero el diseÃ±o de los carateres no era pa mi y hoyos en la historia",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "Cool, somewhat underrated sci-fi anime, with old school 40/50's era tropes and character design, plus a good dose of 'Blade Runner' mixed in. But for a short lull in the middle, it's consistently entertaining and delivers on a wonderfully emotional finale.\r\n\r\n--7.7/10--",
            "review_date": "2011-07-16",
            "source": "rt"
        },
        {
            "content": "A Great director like Rintaro with a story of Osamu Tezuka. Makes an an excellent,\nliving, perfect sci-fi anime to this day.",
            "review_date": "2011-07-13",
            "source": "rt"
        },
        {
            "content": "Somehow there still seems to be a fair amount of â~cringe-factorâ(TM) for many people when it comes to the prospect of Japanese animation (or, indeed, the medium of animation in general) for reasons which appear both unfair and rather irrational. The ultimate appeal of cinema lies within its ability to offer us profound, thrilling and rewarding experiences by triggering the imaginations and emotions of the viewer. Metropolis is a film which achieves this and so much more, but Iâ(TM)ll try not to bore you with geeky pro-anime propaganda, all I wish to say with this review is that if you want to take a gamble on something within the realm of animation, I canâ(TM)t recommend this film enough.\nSo, does this have anything to do with Fritz Langâ(TM)s 1927 masterpiece of the same name? Well, sort of, but not really. Some would no doubt argue its standing as a remake, but this can only be in the very loosest sense (it is in fact based on Osamu Tezuka's classic manga which was loosely based on the original film), managing to update and explore ideas of technology, evolution and questions surrounding what it truly means to be human. It is a highly affecting piece of film-making that is as spectacular as it is deeply thoughtful. Yet the ultimate strength Metropolis is conveyed through its profound emotional range which makes the film such a wonderfully rewarding experience. And seriously, itâ(TM)s worth seeing for the jaw-dropping visuals alone, the scope and detail of which are nothing short of incredible.\nAlright, this all may seem a tad over-zealous of me, and I wouldn't go as far as to say that Metropolis is a perfect film, but as far as cinematic experiences go, this is just about as good as it gets.",
            "review_date": "2011-06-29",
            "source": "rt"
        },
        {
            "content": "An engaging tale with little to complain about.",
            "review_date": "2011-06-23",
            "source": "rt"
        },
        {
            "content": "Ten years old this month, and Metropolis is still one of the greatest anime ever produced.  Based in Fritz Lang's 1927 Metropolis, Osamu Tezuka's manga and Katsuhiro Otomo's screenplay combine to do what anime does best; spin a story from both the mundane and fantastic the way no other medium can.  Metropolis' art and attention to detail are still unsurpassed despite ten years evolution in CGI, and the subtlety of every background, every change in tone and lighting, every facial expression is carefully crafted as a single facet of the polished whole. Yes, you'll see elements of other movies, other stories and real-world scenes in Metropolis' environment.. but that's what the best Japanese anime is: a whole greater than the sum of its parts.",
            "review_date": "2011-06-14",
            "source": "rt"
        },
        {
            "content": "One form of story telling that has, is, and always will be a test of true story telling talent will be animation. When one looks at it, animation will always be a less expensive, more breath-taking approach to films then any live action film can be. One of the best examples will have to come from Japan, their animation style known as anime. Already popular in the States, anime gives people a beyond detailed view into other worlds, creatures, and imaginations behind the people that created them that we can not help but be amazed at. Now, take anime and mix in elements from Fritz Lang's METROPOLIS, Ridley Scott's BLADE RUNNER, and Steven Spielberg's A.I. ARTIFICIAL INTELLIGENCE and what you get is a beautiful film with a plot that, while complex, is nothing that we have not already know. At the helm of directing is the ever wonderful Rintaro. Known for Astro Boy and Kimba The White Lion, Rintaro takes the story and tries to make it move to a certain pace and style. Style, he has that down. Pace, not so much. There are numerous times when the pacing is slow and you would wish it would hurry up. While this is something of a down fall, you have all of that beautiful animation that keeps your eyes glued to all of the 150,000 stills that are in the film and you tend to forget about the pacing. Due to this being a film that was drawn, I am going to have to replace acting with voice acting for this film. In case none of you know, voice acting is when an actor only submits there voice for the characters. In a way, this is more troublesome then acting because you have to think on how you would sound when things like being shot at, being attacked, or even falling would sound like. With me seeing the English audio track for the film, I must admit that it is one of the better films to have good English dub for. Mostly I love not the voices, but all of the additional sounds that litter inside of this film. You hear so many unexpected sounds that you would normally never hear in an animated film regardless if it is the sounds of birds chirping to far off clinging of metal. I have to give props to the people who worked on sound with this film for making it all seem so life life. Next we have the script. Like I have said before, there is nothing new here that was not already thought up of in other films and literature of the science fiction genre. But the one thing I will have to comment on is how well the complexity of the characters were. Going into this film knowing not to expect anything complex with the plot, I am pleased to find out how complex these drawn characters are. I will not say anything for fear of giving away some plot elements, but I will say that you might find yourself getting attached to these characters. Finally we have something that did take me by surprise: the score. Now, answer me this: when was the last time you heard an original Dixie Land/ Jazz score in a film? Well, this film's entire score is this fresh Jazz music that really gave the film a nice bonus while setting the tone for probably one of the greatest tributes to Stanley Kubrick's DR STRANGELOVE, OR: HOW I LEARNED TO STOP WORRYING AND LOVE THE BOMB. Overall, this is a beautiful film that might surprise some audiences if they watch it with no expectations. Just, do not think that this is a remake of Fritz Lang's masterpiece.",
            "review_date": "2011-06-11",
            "source": "rt"
        },
        {
            "content": "A moving and breathtakingly beautiful take on Fritz Lang's 1927 silent film. With a basis in Osamu Tezuka's Astroboy, and having been written by Katsuhiro Otomo, Metropolis is the collision of two of Japanese animations biggest names, and with fantastic results. This film succeeds in capturing, in the same way the original Metropolis did, the atmosphere of the monstrously efficient, leviathan city in which the film takes place. Wholeheartedly recommendable, especially if seen alongside the original Silent film, as well as Tezuka's Astroboy series.",
            "review_date": "2011-06-03",
            "source": "rt"
        },
        {
            "content": "since I first saw the poster back when I was 11 years-old I finally got the chance to see this visually magnificent manga flick\nnothing about this movie's plot is original, still, the look of the dystopian future will appeal to any casual viewer if not the hardcord anime fan\ncombining science and technology over nature is a very dangerous risk to take\nit also pays respect to the 1920's incarnation of a sophisticated modern society\nthe voice acting is good, too even if the English dubbing is a bit off\nit's very grim and dark for a kids movie but those aren't such big issues when the fantastic imagery takes hold\nit's amazingly animated and cool to look at to say the least",
            "review_date": "2011-05-08",
            "source": "rt"
        },
        {
            "content": "Its a piece of anime beauty. One of my favorites.",
            "review_date": "2011-05-03",
            "source": "rt"
        },
        {
            "content": "Metropolis is a story of how important emotions are and how they separate humans from everything else. The movie follows a young boy and his uncle (a private investigator). The story is set in the far future where humans and robots live together, unfortunately not in harmony. Many robots are forced underground and are terminated for entering unauthorized areas. They are more or less servants to humankind. The plot starts to unfold when the boy meets a robot named Tima and they get in all kinds of trouble. Never a dull moment when you've got a robot by your side.Even though the storyline is nothing new, Metropolis is an eye-popping visual treat.",
            "review_date": "2011-04-17",
            "source": "rt"
        },
        {
            "content": "This sci-fi animation based on Ozamu Tezuka's classic manga is visually incredible and has Katsuhiro's Otomo flare for great sci-fi and  adventure stories, with a lot of great scenes and amazing animation.",
            "review_date": "2011-03-26",
            "source": "rt"
        },
        {
            "content": "Japanese Manga-style robot flick which looks at rule by humans or robots.  Well done,  particularly the visuals and soundtrack",
            "review_date": "2011-03-23",
            "source": "rt"
        },
        {
            "content": "The art deco and details of the city is very nice. Reverting back to anime style of the early 90's is quite different from anime nowadays. However, do find this a bit dragging at times.",
            "review_date": "2011-03-12",
            "source": "rt"
        },
        {
            "content": "Not a big fan of Japanese animations, but this one's worth it, not only visually speaking, but also for the story.",
            "review_date": "2011-02-17",
            "source": "rt"
        },
        {
            "content": "The Ray Charles threw me for a bit but the movie is really, really good.",
            "review_date": "2011-01-29",
            "source": "rt"
        },
        {
            "content": "It is a very interesting story(read the synopsis). It's a title that i passed over but never watched. I got the chance as it was on tv and I really liked it. the style is interesting and the dub version was pretty good. If you have the chance to watch this sleeper you propably should. It reminds me a bit of the animatrix in a way.",
            "review_date": "2011-01-06",
            "source": "rt"
        },
        {
            "content": "Very interesting, stylized anime.... not sure if it is japanese or not, but I enjoyed it.",
            "review_date": "2011-01-05",
            "source": "rt"
        },
        {
            "content": "Have to rewatch in original language. But the dub is indeed worthy of near-masterpiece, even with the outdated choice of 1960s animation design for characters.\n\nThe Metropolis theme of class warfare progressing faster than morality is more relevant than ever! So a must-have for those who are paying attention to the Dickensian themes this is based off.\n\nEmotional impact is flawless in this. It focuses on the soon-to-be-asked questions; When is a machine on the same plane as a living creature? Should that machine have rights?\nShould such a machine have special rights beyond Human rights?\nIf so, why don't all Humans have basic Human Rights?\n\nThe handling of the emotional/romantic plot sorta conflicts with the political plot, the only flaw here.",
            "review_date": "2011-01-03",
            "source": "rt"
        },
        {
            "content": "Humans are inferior creatures confused by love and morality and ruled by emotions.\r\n\r\nA city known as Metropolis is plagued by increased crime, poverty, and a corrupt government.  The futuristic city employs robots to execute the majority of blue collar work.  A respected official within the city elects to create a super robot of sorts to eventually rule existence as we know it.  Can a local detective and his nephew thwart the plans of the evil official?\r\n\r\n\"They found his corpse...only the charred skeletal remains.\"\r\n\r\nRintaro, director of Final Fantasy: Legend of the Crystals, X, Neo Tokyo, Peacock King 1 & 2, Astro Boy, and Mighty Atom, delivers Metropolis.  The storyline for this picture is solid and wonderfully intricate.  The characters are developed well and the animation is first rate.  The story contains a nice array of villains and supporting characters.   \r\n\r\n\"I have a very unpleasant duty to perform.\"\r\n\r\nMetropolis is a movie my wife found and identified while channel surfing this morning.  We are both fans of the anime genre and we decided to give this film a shot.  I found this film entertaining and on par with Paprika.  The animation style was excellent, the characters were solid, and I loved the conclusion.  I recommend giving this film a shot if you are a fan of the anime genre.\r\n\r\n\"Pretty soon they won't even need humans anymore\r\n\r\nGrade: A",
            "review_date": "2011-01-02",
            "source": "rt"
        },
        {
            "content": "An impressive Anime with some extremely imaginative CGI-enhanced cyber-punk kinda backdrops and a cool jazzy score. This is contrasted with that peculiarly crude Japanese bug-eye cutesy character design and the usual anime trait of barely coherent long-winded sci-fi nonsense storyline creating a peculiarly uninvolving but visually impressive animation.",
            "review_date": "2010-12-28",
            "source": "rt"
        },
        {
            "content": "Ã uma pena que esta obra tÃ£o nova e tÃ£o cheia de vida seja ignorada e excluÃ­da pelo pÃºblico falso (que quer apenas saber de comÃ (C)dias cruas, violÃªncia explÃ­cita e cenas de sexo forÃ§adas), da qual os artistas se mataram por cincos anos ininterruptos. Metropolis Ã (C) um filme sem igual e irretocÃ¡vel, magnÃ­fico e corajoso.",
            "review_date": "2010-12-27",
            "source": "rt"
        },
        {
            "content": "One of the first anime films I saw and enjoyed. Fantastic animationa nd soundtrack with a pretty solid character set and cast.",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "interesting take on Fritz Lang's classic.  i feel like this film makes the marxist elements of the original more apparent.",
            "review_date": "2010-12-25",
            "source": "rt"
        },
        {
            "content": "Visually stunning. Not as thrilling as it could've been, but still good.",
            "review_date": "2010-12-24",
            "source": "rt"
        },
        {
            "content": "With an outstanding beginning and an ending that never fails to elicit tears even after multiple viewings, it's a lucky thing that the slow middle doesn't drag the entire movie down with it.",
            "review_date": "2010-12-23",
            "source": "rt"
        },
        {
            "content": "Thought this is identical to the classic, but not really. A bit complicity, it's certainly a movie with depth.",
            "review_date": "2010-12-22",
            "source": "rt"
        },
        {
            "content": "Some of the most imaginative animation that I've ever seen from a film. It truly is beautiful artwork, and though the version I saw was dubbed with English and didn't quite match up with the mouths of the characters, it didn't prevent this anime film from being a remarkable masterpiece. This animation stands on its own from the original 1920s film by Fritz Lang.",
            "review_date": "2010-12-21",
            "source": "rt"
        },
        {
            "content": "El director Rintaro nos entrega un hermoso y triste cuento basado en una historia de Katsuhiro Otomo (\"Akira\"), quien a su vez se inspiro en la pelicula \"Metropolis\" de Fritz Lang.  Tanto el aspecto formal de \"Metoroporisu\" como sus ideas son magistrales: una historia de amor, libertad y existencialismo empacada en unos dibujos magistrales y una direccion de arte que hay que ver para creer.  \"Metoroporisu\" es toda una joya de la animacion.",
            "review_date": "2010-12-07",
            "source": "rt"
        },
        {
            "content": "El director Rintaro nos entrega un hermoso y triste cuento basado en una historia de Katsuhiro Otomo (\"Akira\"), quien a su vez se inspiro en la pelicula \"Metropolis\" de Fritz Lang.  Tanto el aspecto formal de \"Metoroporisu\" como sus ideas son magistrales: una historia de amor, libertad y existencialismo empacada en unos dibujos magistrales y una direccion de arte que hay que ver para creer.  \"Metoroporisu\" es toda una joya de la animacion.",
            "review_date": "2010-12-07",
            "source": "rt"
        },
        {
            "content": "the anime remake of another masterpiece, this movie don't copy the story of the german movie but its good too\ngreat art and disign\nthe story is a mix of the matrix and other movies in the part of conflict of humans vs machines",
            "review_date": "2010-12-07",
            "source": "rt"
        },
        {
            "content": "Boring. With a trivial and childish plot, putting absolutely no attention to the details. Too bad that the movie is written by a master (Tezuka) and produced by another master and one of my favorites authors (Otomo).\n\nThe movie, which tries to drop us into a far-resembling atmosphere of original Lang masterpiece, is a strange crossing between an Akira and a Battle Angel Alita, sharing some stylistic traits of the two, but resulting more in a mess than else.\n\nThe plot is about feelings,",
            "review_date": "2010-12-05",
            "source": "rt"
        },
        {
            "content": "En depit de son titre, \"Metropolis\", manga du defunt Ozamu Tezuka publie en 1949, n'entretenait que peu de points communs avec le magnifique film de Fritz Lang.  Cinquante ans plus tard, l'Anime prend le contre-pied de Tezuka et opÃ¨re un certain rapprochement avec sa source d'inspiration, qui se traduit par une architecture urbaine fort inspiree par ce dernier, le choix d'un robot feminin et l'ajout d'une vision sociale (la rivalite entre travailleurs manuels et robots accuses de les priver de leur gagne-pain).  Sur le fond neanmoins, \"Metropolis\" reste une oeuvre originale mÃªme si elle reprend Ã  son compte l'eternelle antienne de l'animation japonaise, le rapport entre l'homme et la machine.  Au vu du contenu des Anime d'aujourd'hui, la reflexion sur le sujet semblera sans doute un brin naÃ¯ve aux yeux de beaucoup : on est effectivement Ã  mille lieues de la profondeur philosophique d'un \"Ghost in the shell\".  Au delÃ  des idees qu'il developpe en surface, \"Metropolis\" est avant tout un Anime traditionnel avec ses gentils et ses mechants caricaturaux, ses personnages secondaires rigolos et ses petits robots sympathiques.  RintarÃ³, elÃ¨ve de Tezuka, reproduit fidÃ¨lement le trait enfantin et rondouillard du maitre et confirme si besoin en etait l'orientation familiale de la chose.  S'il se montre trÃ¨s conventionnel dans son deroulement, \"Metropolis charme surtout par la richesse de son environnement graphique : cette megapole tentaculaire Ã  l'architecture mondialisante, steampunk dans l'Ã¢me et baignee de jazz et de blues, exerce un puissant pouvoir de fascination.",
            "review_date": "2010-11-27",
            "source": "rt"
        },
        {
            "content": "Its like a hot, quirky girl who can only carry a conversation about the social relevance of The Great Gatsby for ten seconds before she says \"haha... what?\"",
            "review_date": "2010-11-20",
            "source": "rt"
        },
        {
            "content": "quite entertaining plot.\nthe whole thing had a pretty cool design and some perspectives and moods reminded me of FF7.\nthe music was very fitting and fun and all around it just felt very well made and animated!\nnot a MUST SEE, but it's somewhere between entertaining and inspiring =)",
            "review_date": "2010-11-18",
            "source": "rt"
        },
        {
            "content": "Great movie, a must-see of anime movies",
            "review_date": "2010-11-10",
            "source": "rt"
        },
        {
            "content": "Pretty Good Sci-Fi Anime!!!!",
            "review_date": "2010-11-10",
            "source": "rt"
        },
        {
            "content": "An unusual animated adaptation of its source material, but a pretty gorgeous one that gets better with each viewing.  Tezuka's \"cartoony\" style is deftly contrasted with the darker subject matter, and the film's climax is among the most memorable scenes of any animated film.",
            "review_date": "2010-10-31",
            "source": "rt"
        },
        {
            "content": "It lacks any semblance of coherent storytelling, continuity, or logic, but it is nonetheless visually striking, and poetically ironic. However, it's nowhere near as inventive, pioneering, or masterful as the films on which it drew some very obvious inspiration.",
            "review_date": "2010-10-31",
            "source": "rt"
        },
        {
            "content": "Beautiful, touching, and well paced, this is definitely one of the best animated, let alone anime styled, films I've ever seen.",
            "review_date": "2010-10-22",
            "source": "rt"
        },
        {
            "content": "Metropolis is fantastic, one of the best animated movies ever.",
            "review_date": "2010-10-19",
            "source": "rt"
        },
        {
            "content": "Metropolis was absolutely enchanting!",
            "review_date": "2010-10-19",
            "source": "rt"
        },
        {
            "content": "The art direction and the Director's sense of humor and fun in the film make this a real treat to anyone watching.",
            "review_date": "2010-10-13",
            "source": "rt"
        },
        {
            "content": "Metropolis is Created by Osamu Tezuka, the creator of Astro Boy which already hyped me up for it.First of Metropolis is visually stunning.The manner in which this dystopian future created by the decadence of man is brought to life through animation is stunning.It has very deep story, the characters are all very well crafted. But with all that there's a downside it can drag and seem longer than need be.",
            "review_date": "2010-10-10",
            "source": "rt"
        },
        {
            "content": "Al final, todas las torres de Babel terminan siendo derribadas, porque solo representan la soberbia humana",
            "review_date": "2010-09-24",
            "source": "rt"
        },
        {
            "content": "I bought the DVD after watching the original 'Metropolis' by Fritz Lang DVD I found at the library.  I was enthralled and recommended it to my sister. She said she fell asleep! :) I can still hear Tima yelling 'Ken-Ichi' over and over. :)",
            "review_date": "2010-09-18",
            "source": "rt"
        },
        {
            "content": "Amazing... Enough said",
            "review_date": "2010-09-04",
            "source": "rt"
        },
        {
            "content": "I was able to watch this film in my youth. It had beautiful animation for its time and even now the animation of Metropolis is still astounding. \r\n\r\nThe film is filled with different plots. Friendship between two people. An amazingly advanced, beautiful and wealthy city that has a darkness to it. The conflict between the rise of artifial intelligence and mankind; where machines are more like slaves. A boy who desperately wants the acknowledgement of the man who adopted him. A machine in the form of a girl long dead, who is to sit on the ziggurat as a new god. All of these plots collide, to devastating effect. \r\n\r\nDespite being animation its a very adult film, almost about the story of an actual event. Metropolis all in all is a story that mirrors a variety of conflicts within our own 'current' society. This makes the film thought provoking and effective. As stated previously, it has great animation but may be too long for kids and maybe for some adults.I doubt its for everyone. But for those who are able to sit patiently and watch, what a wonderful film you'll see.",
            "review_date": "2010-08-22",
            "source": "rt"
        },
        {
            "content": "I wasn't much for the storyline, but the animation was amazing",
            "review_date": "2010-08-14",
            "source": "rt"
        },
        {
            "content": "Highly interesting and beautifully animated, Metropolis has got to be one of the most best anime movies ever",
            "review_date": "2010-08-13",
            "source": "rt"
        },
        {
            "content": "A wonder feast for the eyes visually as well as for the ears, even if the plot is a little over-used. This animated adaption of the manga strays far from Tezuka's original story, for those of us who know of it. Nonetheless, this is amazingly animated and a joy to sit through.",
            "review_date": "2010-08-11",
            "source": "rt"
        },
        {
            "content": "The characters are kinda dull and straightforward and their drawing style was a bit too kawaii for me. The story is an unimaginative cliche you've probabliy seen a zillion times elsewhere.  Aside from that it's a quite a good watch. The city landscape is staggering, soundtrack is really great and the animation is really impressive. Overall it's ok. Only ok.",
            "review_date": "2010-08-11",
            "source": "rt"
        },
        {
            "content": "The final scene with the soundtrack dissonance?  Beautiful.",
            "review_date": "2010-08-02",
            "source": "rt"
        },
        {
            "content": "Inspired partly by Fritz Lang's classic tale, this excellent anime is set in the future as young Kenichi rescues a girl from a laboratory fire in the sprawling city of Metropolis. Seemingly with amnesia, Kenichi tries to help Tima but both are unaware that she's a robot who's been built to eventually take control of the city by the Duke Red and used as a weapon against the people. His adopted son Rock isn't too pleased that an android is to be ruler so he takes it upon himself to find Tima and destroy her and all robots he comes across. \n\nThis is such a stunning animated movie. The detail and the vastness of the city of Metropolis is brilliantly captured on screen. And as for the music - that is something else. It's perfect for this movie and the use of Ray Charles' classic song I Can't Stop Loving You at a pivotal scene near the climax is genius. This movie also presents the viewer with a wonderful story-line exploring human emotions, a grand industrial view of the future and the dangers of the technology that comes with it, not to mention a superb ending that will not disappoint. Metropolis is one of the greatest anime movies you'll come across and should not be missed.",
            "review_date": "2010-07-31",
            "source": "rt"
        },
        {
            "content": "Inspired partly by Fritz Lang's classic tale, this excellent anime is set in the future as young Kenichi rescues a girl from a laboratory fire in the sprawling city of Metropolis. Seemingly with amnesia, Kenichi tries to help Tima but both are unaware that she's a robot who's been built to eventually take control of the city by the Duke Red and used as a weapon against the people. His adopted son Rock isn't too pleased that an android is to be ruler so he takes it upon himself to find Tima and destroy her and all robots he comes across.\n\nThis is such a stunning animated movie. The detail and the vastness of the city of Metropolis is brilliantly captured on screen. And as for the music - that is something else. It's perfect for this movie and the use of Ray Charles' classic song I Can't Stop Loving You at a pivotal scene near the climax is genius. This movie also presents the viewer with a wonderful story-line exploring human emotions, a grand industrial view of the future and the dangers of the technology that comes with it, not to mention a superb ending that will not disappoint. Metropolis is one of the greatest anime movies you'll come across and should not be missed.",
            "review_date": "2010-07-31",
            "source": "rt"
        },
        {
            "content": "What do you get when you get a manga written by created by the late Osamu Tezuka, renowned anime director Rintaro, and Akira creator Katsuhiro Otomo? Without a doubt you get the coolest...Chicago-New York-D.C-Robotic city EVER! Metropolis is a futuristic city-state where humans and robots uneasily coexist. While the robots are heavily segregated throughout the city's districts and are destroyed for straying from their designated areas, many impoverished humans complain that the robots leave them unemployed. This makes it uneasy for the robots, because they get destroyed by the unemployed humans out of anger, and they don't know why. The animation and plot are, at times, hit and miss but the characters and conflicts that they go through are a lot fun.",
            "review_date": "2010-07-17",
            "source": "rt"
        },
        {
            "content": "Great visuals and an interesting story! Its about the relationships between robots and humans in a future city on the verge of a revolution, and the struggle of a powerful robot with advanced artificial intelligence and a human-like appearance as she attempts to discover her true purpose.",
            "review_date": "2010-07-01",
            "source": "rt"
        },
        {
            "content": "The story is this movie was really good. The visual's in this movie were amazing and remind me of the one's in \"Titan A.E.\" and \"Treasure Planet\" I also found the villain, Rock, a great antagonist in the movie. If you're a fan of anime or someone looking for a great animated movie to watch, this is worth watching.\r\n\r\n5/5",
            "review_date": "2010-06-23",
            "source": "rt"
        },
        {
            "content": "\"Metropolis\" is a stunning visual triumph that beautifully portrays the impact of emotion in the utmost artistically innovative of ways.",
            "review_date": "2010-06-18",
            "source": "rt"
        },
        {
            "content": "Exceptionally beautiful, well crafted, just all-around lovely, this movie is an astounding piece of work, and I highly recommend it to any person interested in, well, something as endearing magnificent as this film. I may have not watched the 1927 German Silent Film version of this, but now I am strongly considering, even though the appear to be two completely separate beasts, one masterpiece inspiring another, per se.",
            "review_date": "2010-06-14",
            "source": "rt"
        },
        {
            "content": "A sort of different movie experience, but still a pretty good one. Overall Rating:67",
            "review_date": "2010-06-11",
            "source": "rt"
        },
        {
            "content": "just a little stylized for my taste.",
            "review_date": "2010-06-05",
            "source": "rt"
        },
        {
            "content": "While the background art is quite beautiful as well as the concept, the overtly cutesy stylization of the characters (which IMO doesnt mesh with the look and feel of the rest of the movie) on top of a bad English dubbing diminishes an interesting attempt.",
            "review_date": "2010-06-01",
            "source": "rt"
        },
        {
            "content": "Lovely anime! The climax of the movie has this wonderful 'I can't stop lovin' you' from Ray Charles. Also at other moments the choice of music is quite creative.",
            "review_date": "2010-05-27",
            "source": "rt"
        },
        {
            "content": "really amazing and powerful animation. Rintaro really did the mind boggling story or Metropolis justice with this masterpiece.",
            "review_date": "2010-05-24",
            "source": "rt"
        },
        {
            "content": "Disneyeva bajka o Metropolisu ispricana na japanski nacin. Prva polovica spora i uspavljujuca radi djecije radnje, nelosa animacija, dobar eksterijer, u drugom dijelu ipak uspije probuditi hipersenzibilno djete u vama pocevsi nevino sa ponekim efekticima (napokon) te postepeno pricon penetrira do sfere emocija. Mracan, tuzan. Sve u svemu i nije toliko lose aj, osim jebenog sound dreka. Ne zelin slusat cili film jebeni jazz, ne zelin da mi eksplozije i pucacine budu audioavangardno prikazane jazz skladbicama i ne zelin gledat kako se jebena zgrada 2 minute rastavlja na atome i pritom ne cut  BANG!POP!FLASH!BOOM!KABOOM!KSSSH! nego jebeni Charlesov - I Can't Stop Loving You.",
            "review_date": "2010-05-19",
            "source": "rt"
        },
        {
            "content": "A fascinating movie, worth watching at least once.",
            "review_date": "2010-05-18",
            "source": "rt"
        },
        {
            "content": "What a wonderful piece of animÃ©!",
            "review_date": "2010-05-11",
            "source": "rt"
        },
        {
            "content": "Esperaba algo mÃ¡s, creo que el animÃ© me gusta mÃ¡s en historias simples y fantÃ¡sticas, como ponyo, esta historia no me enganchÃ³ mucho! Es bastante tierna y surrealista, tiene muy buena animaciÃ³n, es bastante bÃ©lica y apocalÃ­ptica. Es recomendable, pero no esperes algo muy inocente!",
            "review_date": "2010-05-02",
            "source": "rt"
        },
        {
            "content": "A beautiful hybrid of the timeless classic and the original Astro Boy. A must see for any sci-fi fan.",
            "review_date": "2010-04-29",
            "source": "rt"
        },
        {
            "content": "Beautiful, detailed animation, and a good adaptation of the original Metropolis.",
            "review_date": "2010-04-27",
            "source": "rt"
        },
        {
            "content": "animation style is almost unbearable as far as I am concerned, but it is kind of like a japanese bladerunner and is a wonderful film.",
            "review_date": "2010-04-24",
            "source": "rt"
        },
        {
            "content": "a visual smorgasboard. plotwise, not so much",
            "review_date": "2010-04-22",
            "source": "rt"
        },
        {
            "content": "Emotionally gorgeous, I can't believe this movie's art is real nor can I believe a remade adaption of Metropolis could be this beautiful.",
            "review_date": "2010-04-07",
            "source": "rt"
        },
        {
            "content": "really cool. Probably my favorite sci fi anime so far.",
            "review_date": "2010-04-04",
            "source": "rt"
        },
        {
            "content": "I didn't really like the ending. I guess ending kind of killed the story, but that's just my opinion. I like how the story was made though. Human relationship to a robot. All that troubles he went through in the end... gosh that part really reminds me of Stairway to Heaven (Korean TV Drama)'s ending -_-;; Which I won't say since some of you guys didn't watch that drama. Well a little hint, the guy who was trying to give his eye to the girl part in Stairway to Heaven ì²êµ­ì ê³ë¹, not exact similar story, but the way he tried to save her part... and in the end... :(",
            "review_date": "2010-03-30",
            "source": "rt"
        },
        {
            "content": "A very, very good film.  Moves very well, great pacing to it.  Character development isn't so great.  The world of Metropolis was definitely well thought out, but could have used more attention.  Negative stuff out of the way: incredible presentation of the man vs. machine premise.  Fantastic story telling.  Definitely one of those films that was the start/inspiration for films like the Matrix, Ghost in the Shell and TV series like...well...Ghost in the Shell (:P), Chobits, and pretty much any other Cyberpunk series out there.  A must watch for anyone interested in filmmaking/storytelling/writing.",
            "review_date": "2010-03-26",
            "source": "rt"
        },
        {
            "content": "really good imagery, solid story. \n\nhot gin or hot whiskey?\n\nhot whiskey, and make it a double.",
            "review_date": "2010-03-26",
            "source": "rt"
        },
        {
            "content": "I really enjoyed watching this film only I wish I hadn't been busy doing something else at the same time. I'd like to watch it again so I can fully appreciate it in all its wonderous glory. I was also happy to see that it was a lot more different from Fritz Lang's film which is good as it means I can take them as seperate films instead of the original and the remake.",
            "review_date": "2010-03-21",
            "source": "rt"
        },
        {
            "content": "by far the best movie I have ever seen....... it is. perfect in every thing!!!!!!    the only reason that it may not have recieved an Oscar is because it is an anime ....",
            "review_date": "2010-03-21",
            "source": "rt"
        },
        {
            "content": "Fantastic film, beautifully animated and one hell of a finale too it.",
            "review_date": "2010-03-19",
            "source": "rt"
        },
        {
            "content": "More apocalyptic than the original film",
            "review_date": "2010-03-18",
            "source": "rt"
        },
        {
            "content": "Beautiful animation coupled with a spotty dub.",
            "review_date": "2010-03-18",
            "source": "rt"
        },
        {
            "content": "The robot Tima is truly an example of what its like to be child like even though you are not a child. In her case, its because she is not human.",
            "review_date": "2010-03-05",
            "source": "rt"
        },
        {
            "content": "well made anime in which machines seem more human then people. sometimes quite slow but never boring.",
            "review_date": "2010-03-04",
            "source": "rt"
        },
        {
            "content": "Interesting. I enjoyied the overall art Deco 1930's style and music of the film and characters, but the story was just okay.",
            "review_date": "2010-03-03",
            "source": "rt"
        },
        {
            "content": "A visual masterpiece for it's time, actually to an extent it still is great in today's standards. Pretty much a straight forward man vs Machine film. But considering the great Osamu Tezuka himself already had the concept long before the matrix terminator etc. it is a great film. However the movie was moving a little slow and the voice acting of the three principal characters were a little weak. But this was not a CG saturated film, it combines traditional cell animation and the still new at the time digital animation. A great example of CG being a tool not the actual story.",
            "review_date": "2010-02-19",
            "source": "rt"
        },
        {
            "content": "Decent. Not particularly spectacular though. Nice animation and effects.",
            "review_date": "2010-02-15",
            "source": "rt"
        },
        {
            "content": "dontget me wrong i love anime!!  butthis was a let down the ending stank im not sure if it was meant to be a remake fof frits langs 20's origional??.... everyone seems all over this but me i see through it .  why dont i like it?? imean some of the art and animation was quite good thats why i gave it some points but ....nahhhh.  have you noticed how most anime's have a sad or  low ending??  \r\n\r\nakira \r\nghost in the shell\r\nberserk \r\nevangelion \r\ncowboy beebop ......",
            "review_date": "2010-02-14",
            "source": "rt"
        },
        {
            "content": "Deserves to be part of the anime cannon alongside 'Akira' and 'Princess Mononoke' because it is a groundbreaking example of what can be done with the genre.",
            "review_date": "2010-02-02",
            "source": "rt"
        },
        {
            "content": "One of my favorite animated films. A multiple layered storyline beats anything Pixar has ever offered. Blend of hand drawn and computer animation is amongst the best. One of the great amine films",
            "review_date": "2010-01-26",
            "source": "rt"
        },
        {
            "content": "I love the look of this movie",
            "review_date": "2010-01-20",
            "source": "rt"
        },
        {
            "content": "A well realised world. Weird character design",
            "review_date": "2010-01-08",
            "source": "rt"
        },
        {
            "content": "one of my favourites",
            "review_date": "2010-01-07",
            "source": "rt"
        },
        {
            "content": "I liked this one a lot. Some people said the plot was confusing, seems pretty straight forward to me. The music is excellent, has a jazzy soundtrack compared to most anime. Definitely another great anime to check out.",
            "review_date": "2010-01-06",
            "source": "rt"
        },
        {
            "content": "Kind of a re-imagining of the 1927 silent German film of the same name, this Japanese Anime features mind-blowing animation and an awesome jazz soundtrack.",
            "review_date": "2009-12-29",
            "source": "rt"
        },
        {
            "content": "It was a good film, and it was an interesting mish-mash of Japanese animation and western influence. Although some of the characters faces annoyed me, I couldn't stop wanting it to be a live action film because of its soundtrack.",
            "review_date": "2009-12-27",
            "source": "rt"
        },
        {
            "content": "Without a doubt, Metropolis is a groundbreaking masterpiece and a classic in Anime. It will probably appeal more to children than adults but is still quite fun and exciting to watch, with plenty of action, loveable characters, and a interesting homage to the 1920s era.",
            "review_date": "2009-12-24",
            "source": "rt"
        },
        {
            "content": "Loved the soundtrack!!!",
            "review_date": "2009-12-07",
            "source": "rt"
        },
        {
            "content": "Quaint film in the classic anime style with pedestrian appeal. There are some great scenes but it is marred by Japanese minimalism. Vexille and Ghost in the Shell are far more entertaining. For fans of Akira and Astroboy.",
            "review_date": "2009-12-02",
            "source": "rt"
        },
        {
            "content": "It ha some beauty to it but it had some problems but the visual experience was really worth it with a nice jazzy score to add to it.",
            "review_date": "2009-11-16",
            "source": "rt"
        },
        {
            "content": "Almost entirely different from the silent film. Typical \"robots rebel against humans\" premise, but not a bad movie, nonetheless.",
            "review_date": "2009-11-15",
            "source": "rt"
        },
        {
            "content": "I didn't expect much of it before I saw it, but once I saw it - it blew me away! This one of the most interesting animation films I have ever seen. It's a sci-fi and a thriller. It's got a lot to do with politics and the future of the world. \r\n\r\nThe story is great, it's like nothing you've ever seen before. It's got very realistic themes and yet this is very fantasy like, with robots and god like advance technology. The characters are all so interesting and likeable. Each character played a great role in the story, because there wasn't really a villain in this. It's really about political conflicts. I think it's great that they were able to convey this in such an exciting way.\r\n\r\nThe animation was probably one of the best things about this movie. They animated this movie so beautifully! The visuals were fantastic! I loved the cinematography and some of the landscapes that the artist created were quite creative and looked fantastic. The design of some of the buildings in this were amazing. \r\n\r\nThis is a great Japanese animation film, and it's very intelligently done. There are very smart themes and characters, and the plot never ceases to amaze. There are fun and exciting moments - and we always want that in an animation film. A terrific film for everyone.",
            "review_date": "2009-11-14",
            "source": "rt"
        },
        {
            "content": "Bon baaah, vachement bien en fait !",
            "review_date": "2009-10-30",
            "source": "rt"
        },
        {
            "content": "everybody knows this movie is astounding, i don't need to review this. just watch it. but for fun, while watching it, replace the word robot with your favorite racial slur. it really helps your suspension of disbelief.",
            "review_date": "2009-10-11",
            "source": "rt"
        },
        {
            "content": "The first and most concise thing I have to say about this movie is that it is beautiful. At first I was taken aback by the decision to have \"old-style\" character drawings, but in the end it works perfectly.\r\n\r\nThe themes we get to explore here range from love in many of its forms (by far the main theme) to political plotting  to social-class struggle to robot rebellion to authoritarian power-concentration to narcissism... all that you expect from your good sci-fi. While I can concede that many aspects are not really mature (or seem childish) the whole package is so nicely made that you won't notice, nor care.\r\n\r\nAnd the climax! It's marvelous and overpowering, both visually and musically! Trust me, you just got to see it.",
            "review_date": "2009-10-09",
            "source": "rt"
        },
        {
            "content": "Very cheesy, takes a while to get going.",
            "review_date": "2009-10-03",
            "source": "rt"
        },
        {
            "content": "I like this film for its beautiful vision of the future and how it ties in with politics.",
            "review_date": "2009-09-13",
            "source": "rt"
        },
        {
            "content": "Very interesting movie. Its based on the 1927 silent film. However, by no means think that this is a remake. It take elements of the original, but its a whole new experience in and of itself.  It takes all of the art styles from the original and takes them in a new direction. The result is some of the greatest architectural eye-candy in animation history. The plot has some rather interesting social observations, but its nothing all THAT new, and its message is rather similar to the original movie. \nMy only complaint is the character designs. They are cartoony and blugy and lack the edge and finess that modern anime characters have. I couldn't shake the feeling that I was watching a Saturday morning cartoon at some points.",
            "review_date": "2009-09-11",
            "source": "rt"
        },
        {
            "content": "has just watched the Japanese anime Metropolis for the first time. Pretty empty story, ultimately lacked the guts to say anything proper, far too obsessed with being stylish to commit to anything substantial. So, pretty average Japanese pop culture, unfortunately - an average episode of a US scifi series or Doctor Who has a damn sight more depth. Absolutely BRILLIANT soundtrack, though - for which it gets a star!",
            "review_date": "2009-09-05",
            "source": "rt"
        },
        {
            "content": "Occasionally a movie is more than just momentary entertainment, a way to blow a few hours; sometimes a film reaches inside you and grips your soul, and leaves something there long after the credits roll. Metropolis is more than just a film. It's art. It's politics. It's philosophy. It's the essence of cinema. \r\n\r\nThere are images in this film that are frightening, images of immense power and fear. It's animated, but the Ziggurat is as solid and frightening as if it were really constructed of stone and steel. There are sequences in this film that are a living dance of light anad sound, of color and movement and music, that made me smile and sway and want to relive each one over and over. There are moments in this film that will break your heart. There is depth to the characters that few films, live action or animated, achieve. It asks the 'big' questions about loyalty, about humanity. And it asks more relevant questions about the segregation of society, no longer by social class, but by occupation. It presents a fantastical, beautiful future that is recognizable in our own world.\r\n\r\nImages from Metropolis will haunt your imagination, not in a bad way, but in the way that something so staggering cannot be kept from your consciousness for too long. This is, quite simply, the most beautiful film I have ever watched. It's a film I could watch without subtitles, just to experience, just to absorb. It's a film most people will not see. But they should.",
            "review_date": "2009-09-01",
            "source": "rt"
        },
        {
            "content": "Best use of a Ray Charles song in any movie other than \"Ray\".",
            "review_date": "2009-08-29",
            "source": "rt"
        },
        {
            "content": "An absolutely beautiful, if not somewhat transparent, parable about human ambition and the humanity of our own technology.  It deftly pays tribute to its predecessor (Fritz Lang's Metropolis) without being overbearing.  Entertaining and quite well-done with a fantastic score, Metropolis is a staple of Japanese animated film.",
            "review_date": "2009-08-23",
            "source": "rt"
        },
        {
            "content": "Rintaro, Katsuhiro Otomo & Osamu Tezuka is gonna be Awesome",
            "review_date": "2009-08-18",
            "source": "rt"
        },
        {
            "content": "not terrible, but not good either.",
            "review_date": "2009-08-12",
            "source": "rt"
        },
        {
            "content": "Absolutely beautiful. I love the soundtrack to this film, especially - and the artwork is simply stunning. Excellent story and concept. ^^",
            "review_date": "2009-08-01",
            "source": "rt"
        },
        {
            "content": "Visually stunning and a classic soundtrack of a bygone era in combination give this film a unique feel, ultra modern and stylishly old at the same time. Let down only marginally by weak characterisation.",
            "review_date": "2009-07-31",
            "source": "rt"
        },
        {
            "content": "The animation is great, but the story isn't.",
            "review_date": "2009-07-29",
            "source": "rt"
        },
        {
            "content": "An odd entity in itself, \"Metropolis\", or as is advertised \"Osamu Tezuka's Metropolis\", not only takes after the highly obvious source of Fritz Lang's 1927 blockbuster \"Metropolis\", but is touted as an adaptation of manga legend Osamu Tezuka's 1949 graphic novel \"Metropolis\". Once you get your head around all that, this is an extremely loose adaptation which takes far more of Lang's original than Tezuka did.\n\nOnce you wrap your head around all of this, Rintaro's film takes after Lang's design, but Katsuhiro Otomo's screenplay can be more easily described as a retooled \"AKIRA\". When you get past the politics of the city, which revolve around:\n-a fascist-like party known as the Malduks, lead by Duke Red, creating the ultimate weapon in a tower of power they call the Ziggurat\n-a President finding the perfect opportunity to seize Red and the Malduks for treason\n-a basement-level society of the poor who are tired of all the robots taking their jobs\n-plus the setup with detective Shunsaku visiting from Japan (he just happens to bring his young nephew Ken-ichi along) to investigate Dr. Laughton, a mad scientist who's accused of illegal activity with human organs...\n\n...and at its simplest level, \"Metropolis\" is about none of the above. There's plenty of theme to go around for everyone, but within its intricate universe (which suits perfectly the fluid, detailed animation that cost millions of dollars and five years of production), Otomo places three primary, young characters with equally poignant threads.\n\nFirst, we're introduced to the person who insists he's Duke Red's son: Rock, a sunglasses-donning badass who's almost too loyal to his \"father\" (Red's disdain of that association is no secret), as he's unafraid of shooting anyone who might bring him down... or get in his way. Without understanding the details, Rock is quick to murder Dr. Laughton for building super-android Tima, in what he believes is a conspiracy to have robots take over the Ziggurat. Never mind he's actually told that Duke Red himself ordered her built, or more importantly, that she's modeled after his dead daughter, and you have yourself a compelling and even sympathetic villain.\n\nShunsaku is left to investigate the laboratory, which is currently exploding, and Ken-ichi goes inside with him. Shunsaku discovers Dr. Laughton in his dying breaths, and Ken-ichi discovers the newly-awoken Tima before they both fall down to the waste level of Metropolis.\n\nWhile Shunsaku's search for his nephew is in vain, Ken-ichi winds up safe and sound as he gets to know Tima in the city's slums. Without knowing she's a robot, Ken-ichi teaches her to write and talk, although she has as much a problem activating some emotional circuitry (read: attachment to Ken-ichi) as she does spontaneously glowing wherever sunlight leaks in. It's easy for this developing romance to bring reminders of a certain Hayao Miyazaki masterpiece, \"Castle in the Sky\"; it's just as innocuous and Ken-ichi blushes at the remotest sign that Tima likes him.\n\nThose familiar with Japanese animation will notice a strange difference: contrary to the norm, Ken-ichi, Tima and Rock are voiced by nonprofessional actors all around 20. The underwhelming English dub sticks to the familiar convention of having Ken-ichi voiced by an actress, but I'd stick to the Japanese, which on the DVD is supported by an excellent DTS surround mix which pumps Toshiyuki Honda's excellent jazz-fueled score even more than it does the already-loud explosions.\n\nFinally, Ken-ichi and Tima bump into the leader of an underground revolution, Atlas (if you decided to ignore my advice and watch the English dub: yes, he's voiced by Aladdin). If we rewind, however...\n\nOtomo's screenplay is the kind more films should be modeled after. Although \"Metropolis\" is incredibly convoluted and has more than enough theme to make anyone happy, it's not difficult to focus on the main narrative of Ken-ichi and leave the rest to repeat viewings since the side characters never appear long enough to drag the pacing down (Rintaro stretches out many more shots of the city's majesty than he ever does subplots).\n\nHe also keeps the stakes high, and although the robot designs are mainly of Tezuka's retro, cutesy kind, Ken-ichi loses friends almost as soon as he makes them. This sort of danger and immediacy was something gravely missing from a certain recent balloon film.\n\nI did mention the musical score, which revolves mostly around instrumentations of a single but highly memorable theme (we get the main saxophone-driven version first, but also soft piano, banjo, and of course the pop version which still retains the jazzy flavor). You're bound to remember more than anything its seemingly bizarre usage of Ray Charles' \"I Can't Stop Loving You\". Those who start watching from this point may see some unintended humor; those who see it from the beginning will find it initially weird but it only amplifies the film's power.\n\nAlthough it packs quite the emotional punch, rather than driving you away from the film for a couple months, \"Osamu Tezuka's Metropolis\" is such a joy to watch that you'll want to see it again right away. Critically acclaimed with a very successful limited release, it's since been left out of many discussions regarding recent animated film, due to the popularity of Studio Ghibli and Pixar's creations (which is deserved). \"Metropolis\" will likely not be seen in many best-of-the-decade lists; expect it in mine.",
            "review_date": "2009-07-27",
            "source": "rt"
        },
        {
            "content": "RATING (0 to ****): ****\r\n\r\nAn odd entity in itself, \"Metropolis\", or as is advertised \"Osamu Tezuka's Metropolis\", not only takes after the highly obvious source of Fritz Lang's 1927 blockbuster \"Metropolis\", but is touted as an adaptation of manga legend Osamu Tezuka's 1949 graphic novel \"Metropolis\". Once you get your head around all that, this is an extremely loose adaptation which takes far more of Lang's original than Tezuka did.\r\n\r\nOnce you wrap your head around all of this, Rintaro's film takes after Lang's design, but Katsuhiro Otomo's screenplay can be more easily described as a retooled \"AKIRA\". When you get past the politics of the city, which revolve around:\r\n-a fascist-like party known as the Malduks, lead by Duke Red, creating the ultimate weapon in a tower of power they call the Ziggurat\r\n-a President finding the perfect opportunity to seize Red and the Malduks for treason\r\n-a basement-level society of the poor who are tired of all the robots taking their jobs\r\n-plus the setup with detective Shunsaku visiting from Japan (he just happens to bring his young nephew Ken-ichi along) to investigate Dr. Laughton, a mad scientist who's accused of illegal activity with human organs...\r\n\r\n...and at its simplest level, \"Metropolis\" is about none of the above. There's plenty of theme to go around for everyone, but within its intricate universe (which suits perfectly the fluid, detailed animation that cost millions of dollars and five years of production), Otomo places three primary, young characters with equally poignant threads.\r\n\r\nFirst, we're introduced to the person who insists he's Duke Red's son: Rock, a sunglasses-donning badass who's almost too loyal to his \"father\" (Red's disdain of that association is no secret), as he's unafraid of shooting anyone who might bring him down... or get in his way. Without understanding the details, Rock is quick to murder Dr. Laughton for building super-android Tima, in what he believes is a conspiracy to have robots take over the Ziggurat. Never mind he's actually told that Duke Red himself ordered her built, or more importantly, that she's modeled after his dead daughter, and you have yourself a compelling and even sympathetic villain.\r\n\r\nShunsaku is left to investigate the laboratory, which is currently exploding, and Ken-ichi goes inside with him. Shunsaku discovers Dr. Laughton in his dying breaths, and Ken-ichi discovers the newly-awoken Tima before they both fall down to the waste level of Metropolis.\r\n\r\nWhile Shunsaku's search for his nephew is in vain, Ken-ichi winds up safe and sound as he gets to know Tima in the city's slums. Without knowing she's a robot, Ken-ichi teaches her to write and talk, although she has as much a problem activating some emotional circuitry (read: attachment to Ken-ichi) as she does spontaneously glowing wherever sunlight leaks in. It's easy for this developing romance to bring reminders of a certain Hayao Miyazaki masterpiece, \"Castle in the Sky\"; it's just as innocuous and Ken-ichi blushes at the remotest sign that Tima likes him.\r\n\r\nThose familiar with Japanese animation will notice a strange difference: contrary to the norm, Ken-ichi, Tima and Rock are voiced by nonprofessional actors all around 20. The underwhelming English dub sticks to the familiar convention of having Ken-ichi voiced by an actress, but I'd stick to the Japanese, which on the DVD is supported by an excellent DTS surround mix which pumps Toshiyuki Honda's excellent jazz-fueled score even more than it does the already-loud explosions.\r\n\r\nFinally, Ken-ichi and Tima bump into the leader of an underground revolution, Atlas (if you decided to ignore my advice and watch the English dub: yes, he's voiced by Aladdin). If we rewind, however...\r\n\r\nOtomo's screenplay is the kind more films should be modeled after. Although \"Metropolis\" is incredibly convoluted and has more than enough theme to make anyone happy, it's not difficult to focus on the main narrative of Ken-ichi and leave the rest to repeat viewings since the side characters never appear long enough to drag the pacing down (Rintaro stretches out many more shots of the city's majesty than he ever does subplots).\r\n\r\nHe also keeps the stakes high, and although the robot designs are mainly of Tezuka's retro, cutesy kind, Ken-ichi loses friends almost as soon as he makes them. This sort of danger and immediacy was something gravely missing from a certain recent balloon film.\r\n\r\nI did mention the musical score, which revolves mostly around instrumentations of a single but highly memorable theme (we get the main saxophone-driven version first, but also soft piano, banjo, and of course the pop version which still retains the jazzy flavor). You're bound to remember more than anything its seemingly bizarre usage of Ray Charles' \"I Can't Stop Loving You\". Those who start watching from this point may see some unintended humor; those who see it from the beginning will find it initially weird but it only amplifies the film's power.\r\n\r\nAlthough it packs quite the emotional punch, rather than driving you away from the film for a couple months, \"Osamu Tezuka's Metropolis\" is such a joy to watch that you'll want to see it again right away. Critically acclaimed with a very successful limited release, it's since been left out of many discussions regarding recent animated film, due to the popularity of Studio Ghibli and Pixar's creations (which is deserved). \"Metropolis\" will likely not be seen in many best-of-the-decade lists; expect it in mine.\r\n\r\n\r\nMPAA: PG-13 (violence and images of destruction)\r\nRuntime: 1 hour, 48 minutes (103 minutes of \"real movie\")",
            "review_date": "2009-07-27",
            "source": "rt"
        },
        {
            "content": "Probably the best animated movie I have ever seen, this film can not be pulled off as a live action, the way it's in this film of course. Metropolis reflects on society about control selfish nostalgia etc and forcing things upon people. One of the characters has really foggy motives in this but it doesn't take away from this film.",
            "review_date": "2009-07-26",
            "source": "rt"
        },
        {
            "content": "Decent ani-sci-fi story with an emphasis on music, which is used to great effect in the film's various sequences.",
            "review_date": "2009-07-23",
            "source": "rt"
        },
        {
            "content": "Just because it looks nice and has a fun soundtrack, doesn't mean it's a good movie.\r\n\r\nThe story was choppy, characters often disappeared for long stretches of time and they often didn't behave as one would expect them to in those situations. \r\nIt was great to have an \"all-knowing\" robot to tell us what everything was and why it was all happening (even though most of the time he wasn't needed).\r\n\r\nGreat Jazz score, but that scene at the end, when everything was blowing up to the tune of \"I Can't Stop Loving You\" by Ray Charles... http://www.youtube.com/watch?v=sYi7ErwpuGg ...weird.",
            "review_date": "2009-07-18",
            "source": "rt"
        },
        {
            "content": "political thriller and sci-fi all in one. started off a little slow and ended a bit cheesy, but all so imaginative on a grand scale. usually i find animation none too compelling yet found myself rooting for kenichi. it may not be saying much when i say this is the best animated japanese feature i have seen (because i haven't seen many) but despite that it's certainly attractive to an adult audience and worth a look. do not be mistaken by the common misconception that all animation is for kids",
            "review_date": "2009-07-18",
            "source": "rt"
        },
        {
            "content": "Osamu Tezuka is a legend in the world of manga and this adaptation of his work is a fitting tribute. Great effects, awesome music and a great story.",
            "review_date": "2009-07-09",
            "source": "rt"
        },
        {
            "content": "A whole lot of really nice design work and musical scoring helped this lift itself from semi-traditional anime fair. Why does every anime film involve people falling in love just because, robots, magical power. I dont know. It was alright. I did fall asleep 3 times while trying to watch it though.",
            "review_date": "2009-07-08",
            "source": "rt"
        },
        {
            "content": "Some amazing animation, especially the cityscape in the beginning. The story was a promising take on the 1920's movie, but they fudged the ending.",
            "review_date": "2009-07-05",
            "source": "rt"
        },
        {
            "content": "hermosa. cada cuadro. cada escenografía. esto es cine de arte. metropolis crea una tradición de perfección animada.",
            "review_date": "2009-07-03",
            "source": "rt"
        },
        {
            "content": "I was only 9 when I saw this....aaaaaaahh!!!!",
            "review_date": "2009-06-28",
            "source": "rt"
        },
        {
            "content": "This movie is sad, depressing and not worth your time or money. The story sucks, but the designs, action scenes and voice acting are pretty good as well as Kenichi and Tima who have a romantic relationship - Tima dies at the end by the way, which is the main reason why this movie sucks. 6/10.",
            "review_date": "2009-06-25",
            "source": "rt"
        },
        {
            "content": "how i cried watching this!",
            "review_date": "2009-06-25",
            "source": "rt"
        },
        {
            "content": "Very cool remake... It makes me cry at the end. Very effective soundtrack.",
            "review_date": "2009-06-24",
            "source": "rt"
        },
        {
            "content": "Interesting, though it can be a little bland. Some characters seem pointless.",
            "review_date": "2009-06-22",
            "source": "rt"
        },
        {
            "content": "Beautiful to look at, fascinating story. There were some major pacing problems at the end, and it's definitely heartwrenching.",
            "review_date": "2009-06-20",
            "source": "rt"
        },
        {
            "content": "I'm really surprised this got such high reviews.  It was a very boring storyline.  The visuals were okay.",
            "review_date": "2009-06-14",
            "source": "rt"
        },
        {
            "content": "This modern anime film's animation style -- a fusion of CGI and hand-drawn techniques -- is stunningly gorgeous and groundbreaking, automatically making this worth the price of admission.  It's all too bad that its unoriginal sci-fi story is far less captivating.",
            "review_date": "2009-06-03",
            "source": "rt"
        },
        {
            "content": "It was interesting, but lacked clarity.  The character that I felt the most for was Albert II (Fifi) who is not even a main character.  The CGI and the drawn animation were not coherent.",
            "review_date": "2009-05-31",
            "source": "rt"
        },
        {
            "content": "Pretentiousness and mismatched production qualities ruin what could have been a great animated film. I watched the English dubbed version, which also ruined the experience due to too much weak voice acting and poor translation/script editing, (I don't think the translator(s) script editors ever talked to each other,) which resulted in every character talking in the same annoying way. \n\nThere are wonderfully done backgrounds and the coloring is great overall. There is an interesting mesh of modern anime style characters with characters which appeal to the classic pre-disney style as well. Unfortunately, my high hopes to be entertained were dashed by the horrible cheap animation which is contained in most of the non-key scenes. It would have been wicked cool to see them not only have a mesh of character designs but animation styles to fit with the characters: have the pop-eye looking detective move around like a pop-eye cartoon. Instead, the pop-eye looking detective moves around the screen like any other modern day anime character -- they all do. I guess Rintaro or whoever was in charge of animation, did not understand that cartoon characters ought to be designed around the way you want them to move. Did they just copy the style from stills, or what?  The other problem is one which plagues most animation and that is the weak Korean sweatshop animation which cheapens all the scenes which could have looked awesome, (the great angles, backgrounds, etc.) \n\nThe soundtrack was almost flawless; great jazz tracks mixed in well with the gothic/gotham designs. And then, in the climax they threw in a gospel/R&B Ray Charles song which made me noxious. They should have gotten someone to do a cover of that song to make it fit better, and then choreographed the animation to it. Instead, we have an awesome song and an awesome animated segment, (I think this scene was animated by the Japanese animators,) but they hardly fit together. Did they just throw in the song at the last moment?\n\nStory was just another studio rehash of classic plots, especially scifi/robot plots, which if everything else in the movie was flawless, then I would probably say this movie is going to be a timeless classic. Instead, the plot / story just contributed to my boredom.",
            "review_date": "2009-05-26",
            "source": "rt"
        },
        {
            "content": "really  good remake (or re-imaging) of Fritz Lang's Marxist classic expressionist film, which is probably the most significant science fiction film ever made as it defined the genre and it's philosophy. this anime is very well stylized, the traditional style of drawing seen in in-house manga films is absent as they've opted for a more disney-fied look which fits well for with the future circa-1950s stylization of the film. the biggest thing that lets this film down is it's allegiance to anime as a genre rather than science fiction, if Rintaro had acknowledged Lang's influence as well as the influence of more contemporary sci-fi (blade runner, solaris, ghost in the shell) in this film it's philosophy could have been stronger where as it stands, the boy-meets-girl drivel-line is prevalent in this beautifully animated world (the mix of CGI and hand draw animation is great in the film's climax). i would have liked more focus on the revolution and character's like Rock and the robotic detective (sorry can't remember his name) and their place in metropolis. some great ideas in here but it's played safe and unfortunately misses the point",
            "review_date": "2009-05-22",
            "source": "rt"
        },
        {
            "content": "I loved the unique blending of 50s style character models with more contemporary backgrounds, however some of the CGI didn't mesh well. The soundtrack was right on too.",
            "review_date": "2009-05-21",
            "source": "rt"
        },
        {
            "content": "love this japanese movie, even if it belongs to astroboys creator osamu, the colors and expressions are great and the music goes so well with the story!! the story pretty much teaches a lesson!!",
            "review_date": "2009-05-16",
            "source": "rt"
        },
        {
            "content": "fabulous! then, at the end I thought \"Are We Really Human?\"...",
            "review_date": "2009-05-11",
            "source": "rt"
        },
        {
            "content": "That movie really really really impressed me because of its well done, beautiful, amazing, precised, astonishing drawings. The whole design of the city in different zones is really breath-taking, especially its mix of art deco and futuristic architecture.. On the other hand I less appreciated the story, the ending shoul've been a bit longer... It was a nice hommage of Fritz Lang's Metropolis into an Animé though, because of the theme of the infinite sky-scrapers, the robots which represent the workers, Tema who replaces Maria the \"pure-at-heart\" teacher. It also had some impressive cinematic, and the jazzy music throughout the film is really enjoyable. This film has such poetry, we almost want to penetrate into their world...\nThis film needs to be watched.",
            "review_date": "2009-05-07",
            "source": "rt"
        },
        {
            "content": "Metropolis-great steam punk inspired visuals. Although some of the character designs were a bit too cartoonish for my tastes. The story is very similar to Blade Runner and Fritz Lang's original Metropolis with elements of Tezuma's own Astro Boy. Rintaro changed the original manga to actually resemble the original Metropolis to an even greater extent. But this anime film, comes off with too many buttons and perhaps not enough loops, there are so many storylines, each intersecting but not long enough for the audience to care.\r\n \r\n8.1",
            "review_date": "2009-05-07",
            "source": "rt"
        },
        {
            "content": "amazing film! a must see!",
            "review_date": "2009-05-04",
            "source": "rt"
        },
        {
            "content": "A wonderful sci-fi epic set in a rich, involving environment. The ending will make you cry, and kindle a love for Ray Charles within you. Do watch.",
            "review_date": "2009-04-30",
            "source": "rt"
        },
        {
            "content": "Pelicula muy irregular. Hay partes entretenidas y otras muchas no tanto llegando a hacerse muy larga, ideas buenas e ideas muy vistas, buena animacion pero solo a ratos, decorados muy trabajados, vistosos e interesantes, y otros muy simples... Lo que si que no me ha pegado nada con el resto de la pelicula es la banda sonora y el estilo con que han sido dibujados todos los personajes humanos.",
            "review_date": "2009-04-29",
            "source": "rt"
        },
        {
            "content": "THE COLORS! The sheer beauty of the best Japanese anime never ceases to amaze me. Just the day after watching the superlative Nausicaa of the Valley of the Wind, I see this visual wonder. It cleverly integrates traditional hand-drawn animation with computer-generated images to great effect. The visual style is an interesting mash-up, combining elements from much previous anime and other mediums. Many of the characters strongly resemble similar characters from the classic Astro Boy, while other more realistic ones come from the era of Akira. The film, which draws inspiration in its setting from Fritz Lang's silent classic Metropolis, cleverly uses editing techniques from the silent film era in a few key moments. The story is compelling enough, and fairly easy to understand. It is scored throughout with old American jazz music, which makes for an interesting juxtaposition. The climactic scene involving a building blowing up is set to Ray Charles' \"I Can't Stop Loving You,\" a move that recalls the end of Kubrick's Dr. Strangelove. It doesn't quite endear itself to me the way Nausicaa and Porco Rosso did, but I have the highest respect for the beautiful artistry on display here.",
            "review_date": "2009-04-22",
            "source": "rt"
        },
        {
            "content": "I really love the story, the characters, and the twist.  Though sad, I wanna see it again and again.",
            "review_date": "2009-04-22",
            "source": "rt"
        },
        {
            "content": "would be a decent anime, but the music and stylized animation make it great. really worth the watching.",
            "review_date": "2009-04-14",
            "source": "rt"
        },
        {
            "content": "http://cineptimoarte.blogspot.mx/",
            "review_date": "2009-04-08",
            "source": "rt"
        },
        {
            "content": "One of the best anime films. The mixture of robots and dixie music is one of the most surreal ideas I've ever seen",
            "review_date": "2009-03-29",
            "source": "rt"
        },
        {
            "content": "Despite some cool animation I found this boring and a bit pretentious.  I'd rather watch the original or, better yet, Blade Runner.",
            "review_date": "2009-03-18",
            "source": "rt"
        },
        {
            "content": "This film represents my foray into Japanese anime. It is a wonderful film although many will find it long. Afavorite theme of many movie directors including the late Stanley Kubrick was humankinds relationship to technology: specifically robots. Read the synopsis and watch the film. There are some interesting allegorical criticisms of humankinds society that stand out...that may in fact parallel human society. basic conflict? Man vs Machine. But don't be fooled by the simple outline of the premise.",
            "review_date": "2009-03-15",
            "source": "rt"
        },
        {
            "content": "decent movie with a very odd choice of music",
            "review_date": "2009-03-09",
            "source": "rt"
        },
        {
            "content": "too all over the place for me",
            "review_date": "2009-03-06",
            "source": "rt"
        },
        {
            "content": "Interesting animation style, but not really great looking until the very end of the film. There's a lot of stylization taken from Fritz Lang's film, but the story is very cliche and uninteresting whereas Lang's wasn't. Perhaps it's because robots acted as surrogates in this film for the humans exploited in Lang's film, but there just wasn't any heart to this movie. I wouldn't recommend it unless you enjoy the beauty of destruction which can be seen in the last few minutes of the film. (And, if you do, you should watch \"Laputa: Castle in the Sky\" instead because it's a much, much better film with somewhat similar visuals at the end.)",
            "review_date": "2009-03-05",
            "source": "rt"
        },
        {
            "content": "Really slow, but really interesting. Definitely picks up when you figure out what's going on.",
            "review_date": "2009-03-04",
            "source": "rt"
        },
        {
            "content": "some parts of Metorporisu are visually great,but i couldn't get into this. the characters and story falls flat.",
            "review_date": "2009-03-02",
            "source": "rt"
        },
        {
            "content": "Great visuals, intriguing story and an 'everything AND the kitchen sink' ending.",
            "review_date": "2009-03-01",
            "source": "rt"
        },
        {
            "content": "The real attraction to this futuristic sci-fi drama Anime is the animation.  A blending of modern computer techniques and traditional cel, METROPOLIS offers breathtaking backgrounds and displays an imaginative view of a dystopian future in which robots and humans are at conflict.  The character designs seem somewhat cartoonish in comparison to the settings, but this is in keeping with the artistic style of Osamu Tezuka, who penned this tale of a confused superhuman robot with an unescapable destiny.  However, while METROPOLIS (directed by Rintaro and scripted by Katsuhiro Otomo of AKIRA fame) succeeds as a technical triumph, its complex, slowgoing storyline may be another matter.  It touches on a series of cautionary issues but somehow doesn't manage to pull them all together.  The final scene, in particular, is more confusing than satisfying.  For animation buffs, though, METROPOLIS is certainly worth a look.  Also noteworthy is the soundtrack:  the jazzy, toe-tapping score sets the tone perfectly, and the inclusion of \"I Can't Stop Loving You\" over the apocalyptic finale is an odd but intriguing touch.  The English version is competently done, with solid performances from everyone involved.  Of particular note is Scott Weinger, best known as Disney's Aladdin, who has a brief cameo as a young revolutionist.",
            "review_date": "2009-03-01",
            "source": "rt"
        },
        {
            "content": "Beautifully animated. Story's not that inspired tho.",
            "review_date": "2009-02-28",
            "source": "rt"
        },
        {
            "content": "Visually spectacular, but that's all.",
            "review_date": "2009-02-22",
            "source": "rt"
        },
        {
            "content": "[url=\"http://en.wikipedia.org/wiki/Katsuhiro_Otomo\"][u][color=#0000ff]Katsuhiro Otomo[/color][/u][/url] + Osamu Tezuka + Rintaro = Perfeito",
            "review_date": "2009-02-20",
            "source": "rt"
        },
        {
            "content": "Really beautiful, even despite the astroboy-modelled characters. An interesting interpretation of Lang's art deco dream, with a modern update to the question of \"what is human\"?",
            "review_date": "2009-02-18",
            "source": "rt"
        },
        {
            "content": "crisp animation......\nonly if Tezuka was alive",
            "review_date": "2009-02-15",
            "source": "rt"
        },
        {
            "content": "my favorite anime, and the most beautiful destruction scene i've ever seen.",
            "review_date": "2009-02-15",
            "source": "rt"
        },
        {
            "content": "Katsuhiro Otomo as usual makes the best anime films",
            "review_date": "2009-02-14",
            "source": "rt"
        },
        {
            "content": "Mass Destruction and Ray Charles. 'Nuff Said.",
            "review_date": "2009-02-11",
            "source": "rt"
        },
        {
            "content": "edgy, dark, violent, brilliant.",
            "review_date": "2009-02-11",
            "source": "rt"
        },
        {
            "content": "my #1 favorite Animaton of all time.",
            "review_date": "2009-02-10",
            "source": "rt"
        },
        {
            "content": "An Anime remake of the first ever Sci-Fi movie of all time...  beautiful animation but still a remake.",
            "review_date": "2009-02-05",
            "source": "rt"
        },
        {
            "content": "I love this movie. Osamu Tezuka and Katsuhiro Otomo are 2 of my favorites in the business, so it was a natural winner for me. The animation alone is way epic, and Osamu Tezuka is great for creating neat little worlds. All of the robots are very unique and this movie has a great blend of both futuristic robotic things and also sort of a steampunkish type feel, I also like the feel of a 1920s type setting in the midst of these robots and mechanisms. The old timey music brings it all together as well. You might be disappointed if you're not into robots as much as me and are expecting similarities to the Fritz Lang film, but if you see it, see it for the visuals alone. Also an interesting note, when Osamu Tezuka wrote the manga for this, he had never seen the original Metropolis, he was just inspired by the poster to create something totally awesome. Pretty cool eh?",
            "review_date": "2009-02-05",
            "source": "rt"
        },
        {
            "content": "Lives up to the hype.",
            "review_date": "2009-02-05",
            "source": "rt"
        },
        {
            "content": "This unique anime interpretation of the 1920's classic Metropolis flounders in comparison to the original, but strongly stands on its own as a piece of beautiful cinema",
            "review_date": "2009-02-02",
            "source": "rt"
        },
        {
            "content": "I didn't really like the wierd 20's music throughout and wasn't too impressed with the animation. The plot was ok, so was the movie, but it was very impressive.",
            "review_date": "2009-01-16",
            "source": "rt"
        },
        {
            "content": "\"FIIIFIIII!!!!!\"\r\n\r\n.....son of a bitch.\r\n\r\nSo I saw it when I was eleven one wintery Chicago Night. Now if I was a little bit older I might've had the good wisdom of perhaps waiting it out a little longer outside in the cold. Then I could've just told everyone that I had EXPERIENCED a true Metropolis, not the strange and more often than not limp noodle anime extravaganza that is METROPOLIS. \r\nOKay, first things first, when you're eleven, you have some semblance of rudimentary consciensnous. It's either this or that or maybe or ah-hah. This doesn't make much sense but bear with me.\r\n\r\nMetropolis was based off a manga by Osamu Tezuka, who is turn, was inspired by a poster of the German silent film by Fritz Lang of the same name. I of course knew none of this at the time and instead I was swept up in the film's opening minutes as an upbeat, dixieland jazz score kicks off the film and we see a glittering tower lit by golden fireworks and spotlights.\r\nImpressive to say the least and very iconic. THe characters were also like something i might've doodled on the wall at school, with their bright eyes and smiling simple faces like something out of a Winsor McCay Little Nemo comic. Actually, that's the main problem. You have this literally schizophrenic style that doesn't mesh well at all.\r\nYou get the feeling that during the development, the screeenwriter, Katsuhiro Otomo (of AKIRA fame) sorta lost track of his thoughts and decided to make it more apocalyptic and crazy. But Mr. Otomo and Rintaro! I was just starting to enjoy that fun dixieland jazz and the festive atmosphere! What's up with the absurdly dark orchestral score interupting the film and the nonsensical philosophical inquiries about GOD, humans, death, and everything else but the kitchen sink?\r\nHmmmm...I might've been eleven but I knew something was amiss. Now? This is bullshit. You can have your FIFI and TIMA this and KENICHI that and all that other nonsense.\r\nEVerytime I look at this film, I am reminded over and over again by its obsession of the nature of itself. It is a very vain movie. Instead of, say, a colorful exploration of a majestic city in a streamline land of oppurtunity and what could've a great chance to perfectly meld the sensibilities of Eastern and Western animation in a story tailor made for such an occasion, we get annoying moments of self importance, random juxapositions involving naked little robot girls, cute robot sidekicks, nuclear explosions set to Ray CHarles I CAN'T STOP LOVING YOU, and all that jazz. \r\nWHat? What is this? I can't belive my eyes and so on and so on.\r\nThere is one particular scene that really grates my nerve endings in what is one of the most narcissistic display where TIMA the robot girl just starts staring at the sky as a shaft of sunlight shines on her. Her perfect blonde hair starts wavering for no apparent reason and a dove lands on her shoulder, its wing perfectly spread out making her look like an angel. Just when it could've get any worse, the people walkign in the street state that she looks like an angel. GRRRRRRRR.\r\nYou may be wondering just what this film is about though. Surely there is somethign redeeming in the storytelling. Isn't this what it's all about?\r\nIT goes a little something like this: Once upon a time, there was a Metropolis and a man named DUKE RED is apparently KING OF METROPOLIS but not really. Actually, he runs it through a puppet government and with a league of gestappo-like soldiers called the Marduk. Anyway, Duke Red wants to rule the world like any good dictator and so he builds the ZIGGURAT, a giant tower with the capabilities to control the sun apparently so I guess he really is GOD at this point. But apparently that's not good enough for him. Even after winning the war (This plot point is dropped almost entirely) he needs something else: his daughter. But she's dead. Oops. Cue mad scientist dude and Duke Red decides he will make a super robot in the image of his daughter and she will operate the tower from her chair at the top. \r\nSOunds good right? Well, Duke Red's lead point man, Rock (who is loyal to his 'father' Duke Red, but still wants to destroy his 'daughter'? What? This is never explained also)\r\nkills the mad scientist and attempts to destory the creation. Then a detective and his nephew who are ALSO investigating the mad scientist come just in time to see the robot escape, albeit with amnesia and totally INNOCENT with a capital I and Rock hunting down them down. This all culminates in a giant apocaplyptic display of destruction as TIMA, the robot girl, turns against mankind as she feels cheated but Kenichi, the nephew, is really thick and thinks he can save her. You see how that goes.\r\n\r\nIn any case, the film suffers from...well, everything. Excpet the score. And you realyl wished they would jsut stick to one theme and not go all over the place. EVen TEzuka, the creator of the manga thought it to be not really remarkable or anything. If he was still alive I'd like to think he would've appreciate the film. But that's just wishful thinking.",
            "review_date": "2009-01-10",
            "source": "rt"
        },
        {
            "content": "Really weird - there were times when I liked it and others when I hated it, but overall I wasn't bored.",
            "review_date": "2009-01-04",
            "source": "rt"
        },
        {
            "content": "The story can be a bit broad at times but It's beautiful to look at and as with all anime, there's always one or two scenes that will stay with you forever.",
            "review_date": "2008-12-24",
            "source": "rt"
        },
        {
            "content": "A visual masterpiece that says a lot about the boundary between humanity and techhnology.",
            "review_date": "2008-12-23",
            "source": "rt"
        },
        {
            "content": "This is not a remake of the classic 1927 Fritz Lang sci-fi epic.  This is, in fact, based on a manga based on the movie poster.  Really.  Osamu Tezuka, the author of the original manga, had never seen Lang's version.  He wrote [i]Metoroporisu[/i] without really knowing what [i]Metropolis[/i] was about.  To be fair, while I've read a lot about it, I've never seen [i]Metropolis[/i], either, so we won't be doing a compare/contrast today.  In some ways, however, I think it's better to review this one from a blank slate.  [i]Metoroporisu[/i] must stand on its own or it does not stand at all.\r\n\r\nMetropolis, or whatever you choose to call it, is ostensibly ruled over by a mayor (whose voice actor I cannot identify on IMDB).  In practice, however, it is under the control of Duke Red (Tarô Ishida) and his gang, the Marduks.  His adopted son, Rock (Kouki Okada), leads them against occasional random attacks on the robots that serve the city.  Red Duke is also, however, commissioning a robot named Tima (Yuka Imoto) from a shady character named Dr. Laughton (Junpei Takiguchi).  Tima is so perfect that she looks human.  In fact, she fools young Kenichi (Kei Kobayashi), a nephew of Ban Syunsaku (Kousei Tomita), who has come to Metropolis from Japan in pursuit of that unsavoury doctor, who is wanted for crimes involving organs that they (perhaps blessedly) do not go into to much detail over.  Tima and Kenichi are on the run from Rock, and Syunsaku is searching for Kenichi, and Duke Red would really like to know where Tima is.  Dr. Laughton is dead.\r\n\r\nIt's a very complicated plot, obviously.  However, each piece of it blends seamlessly into the next, so that I, for one, was never confused as to what was happening at any point.  I could even understand almost everyone's motivations.  (I have trouble getting into world conquest.)  I also found myself touched by the love between Tima and Kenichi, especially knowing as you must that it is somehow doomed.  The Ziggurat which towers over the city, while not really ziggurat-shaped, is clearly a stairway to intended godhood to Duke Red, and one begins to fear what it might mean for Tima.\r\n\r\nIt's also beautiful.  I'm not really fond of how the people are drawn, particularly, except for Tima and Rock.  Duke Red looks frankly laughable.  However, I do think it's striking despite that.  The end sequences in particular are effective.  I do kind of wonder how any of the major characters could have possibly survived, but that's a small price to pay for the rest of the story--and I have been accused of having a hard time suspending my disbelief!  There is just the slightest hint of the unrest that must be boiling under the surface of such an unpleasant society.  In short, the whole thing is striking, not just the visuals.  I don't know if the German one is better, though I have heard that it is.  What I can say for sure is that this one is very good, and one leaves it with great sympathy for Kenichi.\r\n\r\nThere are people who say they do not like anime.  I think these people have seen very little, if any, of it.  We've covered a fair amount here, both in English and in Japanese, and there are a great number of differences between this and, say, [i]The Cat Returns[/i] or [i]Porco Rosso[/i].  I think most people who say they don't like anime are thinking exclusively of things like [i]Pokemon[/i] or tentacle porn, and there is so much out there that isn't either.  There is so much to anime that stirs the emotions, that instills a sense of wonder.  I'm not saying that this is necessarily the best anime for either of those, but it's sure better than [i]Dragon Ball Z[/i].",
            "review_date": "2008-12-14",
            "source": "rt"
        },
        {
            "content": "Should have just stuck with the original film.  If it ain't broken...",
            "review_date": "2008-12-14",
            "source": "rt"
        },
        {
            "content": "Revolutionary- it will change the way you think!",
            "review_date": "2008-12-12",
            "source": "rt"
        },
        {
            "content": "Dobry klimat steam punku, swietna muza, szczegolnie \"I can't stop loving you...\".",
            "review_date": "2008-12-02",
            "source": "rt"
        },
        {
            "content": "Good story, but I absolutely hated the visual style of the characters.",
            "review_date": "2008-11-24",
            "source": "rt"
        },
        {
            "content": "mmmmmmmmmmmmmmmmmm\nno go to bed instead",
            "review_date": "2008-11-09",
            "source": "rt"
        },
        {
            "content": "Love this movie. Loved it since the first time I saw it. My guilty pleasure, you could say. Not much for character development or story, really, but when your watching an anime movie, does that really matter? The visuals are great and the score is really good, really setting the scene.",
            "review_date": "2008-11-08",
            "source": "rt"
        },
        {
            "content": "This is a Brilliant film! magical! Love it to death",
            "review_date": "2008-11-06",
            "source": "rt"
        },
        {
            "content": "Probably the BEST ANIME I have ever seen.  Beloved part of my movie collection.  Fritz Lang would be very proud to see his concept in this form.  Must see.",
            "review_date": "2008-11-03",
            "source": "rt"
        },
        {
            "content": "Well I have never seen the original Metropolis from the 20's so i don't really have anything to compare this to except for Astroboy, which this movie's plot and graphical style strongly resemble. I guess i enjoyed it, however, by the end I was quite bored. The choppy story line had a good heart, but it really wasn't executed very well. Parts of the animation were excellent, other parts were terrible, I'm not a big fan of 50-60s style Japanese cartoon drawing to begin with. The ending was kinda ehhh, good its over? I wasn't moved or anything of the sort, and it was way to long. There are so many movies about Man Vs Machine and Humanity Vs Technology this one really didn't have much to set it apart. I'm not a big fan of Astroboy, but i do enjoy it more then this film so stick with the classics and not pseudo remakes.",
            "review_date": "2008-10-21",
            "source": "rt"
        },
        {
            "content": "I think normal anime fans like this, but osamu tezuka fans LOVE it",
            "review_date": "2008-10-20",
            "source": "rt"
        },
        {
            "content": "Good film, strange animation. A nice watch, but not a keeper.",
            "review_date": "2008-10-16",
            "source": "rt"
        },
        {
            "content": "An interesting if cliched anime peppered with moments of great beauty. The animation isn't as flawless as some but the story and characters do make up for it.",
            "review_date": "2008-10-13",
            "source": "rt"
        },
        {
            "content": "Lovely soundtrack and atmosphere.",
            "review_date": "2008-10-11",
            "source": "rt"
        },
        {
            "content": "Metropolis is sometimes engaging, the keyword here being 'sometimes'. The visuals (especially the backgrounds) are frequently stunning, the action scenes are slick, and the climax is rousing. But, okay, most movies can say that. They all have their ups and downs. The problem with Metropolis is that it isn't constantly engaging. The overblown character designs, music, and meandering plot mean that it is, much of the time, a film you want to snooze through.\n\nThe screenwriter also did Akira, which might be why Metropolis seems frequently to be a younger, gentler sibling of that movie. If nothing else, see it for the eye-popping Mad House animation. The static shots are nothing special, but in motion, Metropolis will dizzy you.",
            "review_date": "2008-10-07",
            "source": "rt"
        },
        {
            "content": "breathtaking animation, very unique style and sensibility.",
            "review_date": "2008-09-12",
            "source": "rt"
        },
        {
            "content": "Speciaal filmpje. Kuifje-achtige personages in schilderachtige film-noir taferelen afgewisseld met futuristische 3D animaties. De Jazzy soundtrack maakt het helemaal af. Het verhaal is gebaseerd op een comic en staat toe om zelf betekenis te geven aan bepaalde scÃ¨nes.\r\n\r\nVisueel erg knap en vaak verbluffend. Inhoudelijk is hij OK, maar geen meesterwerk.",
            "review_date": "2008-09-05",
            "source": "rt"
        },
        {
            "content": "Beautiful animation.",
            "review_date": "2008-08-31",
            "source": "rt"
        },
        {
            "content": "great story and animation",
            "review_date": "2008-08-27",
            "source": "rt"
        },
        {
            "content": "I found this anime to be very boring and I had to watch it in 3 sittings just to get through it without falling asleep. I liked the idea of the movie...but honestly did you really have to remake a classic Film from the 1920's? and butcher it as well....",
            "review_date": "2008-08-27",
            "source": "rt"
        },
        {
            "content": "shocking dont believe they made a 20's classic lol no on should have ever touched that well apart from Queen",
            "review_date": "2008-08-26",
            "source": "rt"
        },
        {
            "content": "Ä°lk defa izlememe raÄmen sanki daha Ã¶nce izlemiÅim gibi geldi... biÅeylere benzettim ama benzettiÄim Åeyin ne olduÄunu Ã§Ä±karamadÄ±m...",
            "review_date": "2008-08-25",
            "source": "rt"
        }
    ]
}