{
    "rating": 8.0,
    "release_date": "2002-06-21",
    "num_reviews": 530,
    "genres": [
        "Sci-fi",
        "Mystery&thriller",
        "Action"
    ],
    "summary": "Based on a story by famed science fiction writer Philip K. Dick, \"Minority Report\" is an action-detective thriller set in Washington D.C. in 2054, where police utilize a psychic technology to arrest and convict murderers before they commit their crime. Tom Cruise plays the head of this Precrime unit and is himself accused of the future murder of a man he hasn't even met.",
    "reviews": [
        {
            "content": "Im Jahr 2054 liegt die Mordrate in Washington D.C bei null. Grund dafür sind die sogenannten Precogs. Diese können in die Zukunft sehen und die Polizei kann dadurch Morde verhindern die passieren würde. Der Chief John Anderton (Tom Cruise) wird selber verdächtig einen Mord durchzuführen und wird dabei von Detective Danny Witwer (Colin Farell) gejagt. Er will herausfinden, ob die Precogs sich irren können und möchte verhindern das er den Mord begeht.\nWas mir nicht gefählt ist das Bild in einigen Stellen. Die ersten halbe Stunde ca und zwischen durch auch mal wieder ist das Bild sehr hell und der Hintergrund auch und das sieht nicht schön aus. Es gibt einige Effekte die nicht gut gealtert sind. Es gibt einige Szen die in anderen Medien auch Verwendung finden. In Detroit Become Human ist die Art wie der drogensüchtige Detective Beweise sammelt ähnlich, genauso wie der Charakter John Anderton. Die Szene, wo John blind ist finde ich sehr gut gemacht da sie auch realistisch gemacht wurde.Der Film setzt seinen Humor gut ein und es ist nicht zu viel davon Vorhanden das es nervt oder unpassend wirkt. Ich finde den Film gut, aber es gibt bessere Filme im Science-Fiction Genre.\n\n8,5/10",
            "review_date": "2023-03-27",
            "source": "rt"
        },
        {
            "content": "Another great film from Spielberg",
            "review_date": "2023-02-06",
            "source": "rt"
        },
        {
            "content": "Absolutely horrible movie. Anyone who likes this needs their head examined.",
            "review_date": "2023-01-27",
            "source": "rt"
        },
        {
            "content": "I like Tom Cruise's films.\nHe is a good actor. This film is eccellent!!!",
            "review_date": "2023-01-23",
            "source": "rt"
        },
        {
            "content": "Excellent concept. Excellent movie. Excellent story. Watch it!",
            "review_date": "2023-01-16",
            "source": "rt"
        },
        {
            "content": "Is there a free will or is future deterministic? is the key question Spielberg is asking in this fast-paced thriller. The movie is looking at this philosophical question by examining the near-future pre-crime department, where the character of Tom Cruise has to make a choice whether to kill or break a prediction. \n\nPros - an interesting concept, combined with some data privacy aspects raised in the movie, which are however only teased but not fully explored. Fast-paced and action-packed.\n\nCons - lots and lots of CGI that in some places did not age well. But even disregarding CGI, the movie does not provide a viewer with an opportunity to come to their own conclusion on the key question, and quite inelegantly resolves it in the finale.\n\nThe characters seem one-dimensional and generic, with one or two straightforward motivation and lacking complexity.\n\nAll in all, a good movie to watch but would not come back to it.",
            "review_date": "2023-01-09",
            "source": "rt"
        },
        {
            "content": "This is one of the better sci-fi movies I have seen in a long time. Tom Cruise is so good in this role, Colin Farrell is as good and the supporting cast is great. Steven Spielberg is back with his long takes, cinematography and beautiful camerawork, there was one long shot with the spiders, that was like, WOWWW how do you shoot that, or the last scene, the camera goes through a window and a lot more, so impressive for 2002. Whats as impressive, are the VFX for 2002, they really hold up and create a perfect world building. The story is so interesting in my opinion, I never thought about a system that could prevent murder. Overall this is like the ultimate sci-fi movie, it has it all and it confirms that Steven Spielberg is a movie making legend!",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "An underrated masterpiece",
            "review_date": "2022-12-30",
            "source": "rt"
        },
        {
            "content": "Poses really good moral and ethical dilemmas about being able to predict whether someone will commit a crime.",
            "review_date": "2022-12-21",
            "source": "rt"
        },
        {
            "content": "\"Minority Report\" takes a unique and original idea and turns it into one of the most well-developed stories in cinema, with enough action and plot twists to keep it satisfyingly thrilling.",
            "review_date": "2022-12-18",
            "source": "rt"
        },
        {
            "content": "Terrific blend of sci-fi, suspense and action. Amazing storyline and tremendous twist at the end.",
            "review_date": "2022-12-14",
            "source": "rt"
        },
        {
            "content": "Really cool new idea in its time. Great acting ",
            "review_date": "2022-12-12",
            "source": "rt"
        },
        {
            "content": "Great movie and narrative",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "I have watched this movie about 3 times and it has captured my attention every time. Although the CGI has not aged well, the scenes end rather quickly for it to become a headache. Some unnecessary scenes could've been cut from the movie. The finale was satisfying in conclusion. Overall a fun film that takes you for a ride.",
            "review_date": "2022-11-15",
            "source": "rt"
        },
        {
            "content": "Thought provoking and thrilling blockbuster, pondering on questions of free will vs. determination. Dense visual atmosphere (although I am not a fan of the bleach bypass choice) and a worthy what-could-it-look-like design. It cannot be stated often enough, that the imagination of certain futurley aspects by scifi-authors, in this case P. K. Dick, is unrivalled in applicability and vision.",
            "review_date": "2022-10-09",
            "source": "rt"
        },
        {
            "content": "The action and the plot were nice and special! Not a minute in the movie is unnecessary.",
            "review_date": "2022-09-25",
            "source": "rt"
        },
        {
            "content": "Filme interessante e com uma premissa incrível, mas superestimado. Tecnicamente está em lugar comum, nem parece ter sido dirigido por Spielberg. O que salta aos olhos é a atmosfera futurista, e os dispositivos e apetrechos curiosos e surpreendentes que a narrativa nos apresenta. O roteiro é bem amarrado e gostei bastante do dilema temporal: será que somos mesmo capazes de mudar o nosso futuro predestinado? Apesar disso, devemos colocar em prática a boa e velha suspensão de descrença, porque acreditar que mães viciadas em drogas pesadas geraram crianças com poderes psíquicos e previsores do futuro, é difícil de comprar, e nos distancia demais do plot principal e da obra como um todo.",
            "review_date": "2022-09-23",
            "source": "rt"
        },
        {
            "content": "Ciekawa koncepcja, fajne postacie, naprawdę niezłe zwroty akcji. Bardzo dobrze się ogląda",
            "review_date": "2022-09-14",
            "source": "rt"
        },
        {
            "content": "Fantastic!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-09-10",
            "source": "rt"
        },
        {
            "content": "Interesting story. Far fetched storyline.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "The sci-fi drama Minority Report is unusual and thought-provoking. It raises some really intriguing issues regarding free will vs. fate. But in my opinion, Steven Spielberg made this movie a touch too gritty for viewers to actually enjoy it. And the uncomfortable moments detract a little bit from the imaginative plot and strong acting. I really enjoy this movie, but I wish I enjoyed it more.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "Really close to 4.5/5.",
            "review_date": "2022-07-26",
            "source": "rt"
        },
        {
            "content": "In my opinion, Minority Report is one of the best films of the last decade. Steven Spielberg at that time briefly retired from family, light films and made some really gloomy and very intense films, to which Minority Report belongs.\n\nThe film was shot by the director in a definitely cold style, but the interest in what is happening on the screen does not decrease one degree! A short story by Philip K. Dick found its worthy form in a full-length movie. The action begins to rapidly fly forward from the very first frame. And those episodes where there are no chases and shootings are full of tension and drama in the performance of brilliant actors.\n\nWithout a doubt, Minority Report is one of the best films in Tom Cruise's biography. The actor managed to combine drama and action in his role, the character is fully revealed with its advantages and disadvantages, and he really wants to empathize.\n\nOther roles are also filled with excellent actors. Max von Sydow played the classic role of senior mentor and part-time evil genius, which he did flawlessly. Colin Farrell evoked ambivalent feelings - at first you feel hostility towards him (due to a conflict with the positive hero of Tom Cruise), and closer to the final you openly worry about him and sympathize. Samantha Morton also performed well as a seer. The actress gave herself completely to her character and realistically showed the seer's behavior in the terrible conditions of the crime prevention system.\n\nThe dissenting opinion looks at one breath right up to the finale. A captivating plot, excellent acting and directing, brilliant special effects from the ILM studio will justify all your hopes for this fantastic thriller!\n\nIn Minority Report, Tom Cruise's character says: Everybody run away! But where do we run from Spielberg and Cruise? See Special Opinion. You won't regret it at all!",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "While the effects don't hold up that well, the fun and creativity sure does.",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "One of my favorite sci-fi films. Tom Cruise and Steven Spielberg's first film together is a marvelous exercise on everything the over-used genre can be--thrilling, visually astonishing, with well-written characters and, like the best sci-fi films, it is a film with ideas that can start discussion",
            "review_date": "2022-07-10",
            "source": "rt"
        },
        {
            "content": "Steven Speilberg, Tom Cruise, Neal McDonahugh, Max von Sydow, and Collin Farrell adapt Philip K Dick’s prescient short story In the distant future of 2054 we have the ability to detect any crime before it's ever committed called PreCrime It's a perfect system and the calculations are so precise it's never wrong Arrests are revolutionized by the ‘halo’ device, placed around a pre-criminal’s head to subdue them and eventually become part of their cell But criminals are not placed in the prisons we might expect They are put into what looks like a chemically induced coma and left in pods stored in the ground, akin to coffins Their face is obstructed by their halo, replacing their identity and humanity with a looped vision of their crime Virtually murder is erased from society Until Cruise's Jon Anderton is accused of a crime he didn't actually commit with a man he's never met He's officially on the run until he can prove he innocence Did he really do it or is the system rigged? The title of the film actually refers to the sliver of of doubt in a supposed system that's meant to be reliable Doubts are unacceptable within such clinical perfection, and a minority report will be destroyed to remove evidence of fallibility If the nation knew, the whole system would collapse Yet it’s a system built on lies “The nation,” aptly described at one point as the “land of the blind,” is viewed as a homogenous mass of unsuspecting victims who must be protected from themselves with authoritarianism, no matter their own humanity Lives then become numbers, and zero murder is treated as an absolute good without consideration of the means to reach that end Even Speilberg says the best science fiction stories have the most dire warnings about civilization and the future It's true the internet is watching us now If they want to, they can see what sites you visit…The scary thing is, we’ll lose our right to privacy An ad will appear in the air around us, talking directly to us hence sponsors and advertising for VPN to avoid phishing etc. Data collection is an open secret, denied emphatically by the NSA for years leading up to the Snowden revelations, and even since In terms of predicting authoritarian tech the moviemakers nail some things down pretty well such as our touchscreen tech like motion capture and virtual reality, facial recognition, drones, and our system of incarceration For example manipulation of augmented reality environments is becoming more common, as Guangzhou City has used something called a ‘Digital Twin,’ which operates as an exact virtual copy of the city Many police departments in the US also use VR for training purposes, creating and exploring various hypothetical scenarios for their officers Being held prisoner without due process in a machine that disregards human rights like this accurately predicted the horrors of Guantanamo Bay; it was notorious for its unrestrained torture and unchecked detention of innocent prisoners US President Barack Obama pledged to close the camp once he entered office, yet failed to do so Trump signed an executive order to keep it open indefinitely, and current President Joe Biden’s review only brought the number of detainees down to 38 While there is still official intent to shut Guantanamo down, its persistence over two decades marks it as a symbol of institutionalised pre-determinism of guilt resembling the film here Also scans are not only used for criminal investigation, as retinal identification allows for transport payment and micro-tailored marketing The filmmakers make this future look lighter and softer despite the harsh job PreCrime still has to engage in, the score by John Williams is intense if at times odd, Cruise works brilliantly as per usual, the future tech is really inventive, and many of our predictions living in the future are spot-on Sure this didn't need to be 2 and a half hours but it is slick looking, very dystopian, and quite accurate of our real world in terms of crime, technology, and the pros and cons of enacting Justice It's true every living creature has one thing in common; its own survival especially when it comes to having genes predetermining future actions that'll make them good or bad Guilt is now frequently pre-determined based on individual profiles, unfettered access to our lives is facilitated by enhanced surveillance, and punishment is enacted without hesitation It's true our technological form of justice has met and even surpassed the authoritarian surveillance of its dystopia Sci-fi is an apt mode to explore the future, but the future is coming perpetually quicker It’s already gone by the time our predictions can be expressed 'Minority Report' is a bold ambitious entry by this talented director and Cruise as a man doubting a reliable system he once believed in isn't so pristine or top of the line Big themes matched solely by its endless influence on both film and real-world technology",
            "review_date": "2022-07-05",
            "source": "rt"
        },
        {
            "content": "The worst 02 hours: and 24 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-06-22",
            "source": "rt"
        },
        {
            "content": "Steven Speilberg, Tom Cruise, Neal McDonahugh, Max von Sydow, and Collin Farrell adapt Philip K Dick's prescient short story\nIn the distant future of 2054 we have the ability to detect any crime before it's ever committed called PreCrime \nIt's a perfect system and the calculations are so precise it's never wrong \nArrests are revolutionized by the ‘halo' device, placed around a pre-criminal's head to subdue them and eventually become part of their cell\nBut criminals are not placed in the prisons we might expect\nThey are put into what looks like a chemically induced coma and left in pods stored in the ground, akin to coffins\nTheir face is obstructed by their halo, replacing their identity and humanity with a looped vision of their crime \nVirtually murder is erased from society \nUntil Cruise's Jon Anderton is accused of a crime he didn't actually commit with a man he's never met \nHe's officially on the run until he can prove he innocence \nDid he really do it or is the system rigged?\nThe title of the film actually refers to the sliver of of doubt in a supposed system that's meant to be reliable \nDoubts are unacceptable within such clinical perfection, and a minority report will be destroyed to remove evidence of fallibility\nIf the nation knew, the whole system would collapse\nYet it's a system built on lies\n\"The nation,\" aptly described at one point as the \"land of the blind,\" is viewed as a homogenous mass of unsuspecting victims who must be protected from themselves with authoritarianism, no matter their own humanity\nLives then become numbers, and zero murder is treated as an absolute good without consideration of the means to reach that end \nEven Speilberg says the best science fiction stories have the most dire warnings about civilization and the future \nIt's true the internet is watching us now\nIf they want to, they can see what sites you visit…The scary thing is, we'll lose our right to privacy \nAn ad will appear in the air around us, talking directly to us hence sponsors and advertising for VPN to avoid phishing etc. \nData collection is an open secret, denied emphatically by the NSA for years leading up to the Snowden revelations, and even since \nIn terms of predicting authoritarian tech the moviemakers nail some things down pretty well such as our touchscreen tech like motion capture and virtual reality, facial recognition, drones, and our system of incarceration \nFor example manipulation of augmented reality environments is becoming more common, as Guangzhou City has used something called a ‘Digital Twin,' which operates as an exact virtual copy of the city\nMany police departments in the US also use VR for training purposes, creating and exploring various hypothetical scenarios for their officers \nBeing held prisoner without due process in a machine that disregards human rights like this accurately predicted the horrors of Guantanamo Bay; it was notorious for its unrestrained torture and unchecked detention of innocent prisoners \nUS President Barack Obama pledged to close the camp once he entered office, yet failed to do so\nTrump signed an executive order to keep it open indefinitely, and current President Joe Biden's review only brought the number of detainees down to 38\nWhile there is still official intent to shut Guantanamo down, its persistence over two decades marks it as a symbol of institutionalised pre-determinism of guilt resembling the film here \nAlso scans are not only used for criminal investigation, as retinal identification allows for transport payment and micro-tailored marketing \nThe filmmakers make this future look lighter and softer despite the harsh job PreCrime still has to engage in, the score by John Williams is intense if at times odd, Cruise works brilliantly as per usual, the future tech is really inventive, and many of our predictions living in the future are spot-on\nSure this didn't need to be 2 and a half hours but it is slick looking, very dystopian, and quite accurate of our real world in terms of crime, technology, and the pros and cons of enacting Justice \nIt's true every living creature has one thing in common; its own survival especially when it comes to having genes predetermining future actions that'll make them good or bad \nGuilt is now frequently pre-determined based on individual profiles, unfettered access to our lives is facilitated by enhanced surveillance, and punishment is enacted without hesitation \nIt's true our technological form of justice has met and even surpassed the authoritarian surveillance of its dystopia \nSci-fi is an apt mode to explore the future, but the future is coming perpetually quicker\nIt's already gone by the time our predictions can be expressed\n'Minority Report' is a bold ambitious entry by this talented director and Cruise as a man doubting a reliable system he once believed in isn't so pristine or top of the line \nBig themes matched solely by its endless influence on both film and real-world technology",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "Tom Cruise gave a great acting performance and also the movie is fast and very far from boring",
            "review_date": "2022-06-14",
            "source": "rt"
        },
        {
            "content": "Minority Report is a unique, thought-provoking sci-fi drama. It presents very interesting questions about fate vs. free will. However, I feel like Steven Spielberg made this film a little too grimy for audiences to truly enjoy it. And the off-putting moments are a bit of a distraction from the creative story and solid performances. I like this movie a lot, but I wish I liked it more.",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "Espectacular! Great plot, great casting and great ambience.",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "Spielberg can be such a blessing and a curse at the same time for a movie.  I feel like \"Minority Report\" succeeds despite his tendencies.  I have a theory that Spielberg intentionally hires actors who give quirky performances in an attempt to make the movie memorable, but it just ends up being distracting to an otherwise really good movie.   Also, ILM, totally blew it here.  The backgrounds look incredible, but any time the movie focuses in an a CGI element, it looks so bad that it takes me out of the experience.  I give it a B, next time you're in the mood for a movie, this one won't disappoint.",
            "review_date": "2022-03-05",
            "source": "rt"
        },
        {
            "content": "Really it's a good movie,\nOctober 2021",
            "review_date": "2022-02-17",
            "source": "rt"
        },
        {
            "content": "Even though it's dated, the special effects are awesome and the story by Phillip K. Dick is very imaginative, so I give this movie *4 and 1/2* stars!!!!",
            "review_date": "2022-02-09",
            "source": "rt"
        },
        {
            "content": "Maybe 4 stars is too low, I dunno. This is an excellent sci-fi action film, and it's one of the too-few cyberpunk films we have at all. It has very little competition, but it's still really well done.",
            "review_date": "2022-01-18",
            "source": "rt"
        },
        {
            "content": "Film visionnaire et captivant sur la reconnaissance faciale, la prévention criminelle... dans un monde futuriste. Tient en haleine.",
            "review_date": "2021-12-31",
            "source": "rt"
        },
        {
            "content": "It's not often that movies make you think, thrill you, and chill you all in the span of two and a half hours. Philip K. Dick's stories always have something interesting behind them and Spielberg adds his amazing creative vision to give the near future a new meaning. What if we could stop murders before they happen? And what if this system can be abused? What if we had ads targeted specifically at us? Wait.",
            "review_date": "2021-12-30",
            "source": "rt"
        },
        {
            "content": "This movie is just about 20 years old and still holds up from all aspects. Still looks great, has an amazing script and grabbed my attention the whole time even though I had already seen it. Amazing.",
            "review_date": "2021-12-17",
            "source": "rt"
        },
        {
            "content": "4/5.  The CGI hasn't aged well and there is one sequence that doesn't fit with the rest of the movie, but the rest of the film is awesome with an interesting story, deep themes, and a great performance from Tom Cruise.",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "I didn't like this movie.  It's dark and twisted, without the benefit of being clever.",
            "review_date": "2021-11-07",
            "source": "rt"
        },
        {
            "content": "Great future looking dystopia.  You must pay attention.  Morton takes on some weird roles after she voiced Ruby in the kids show \"Max and Ruby\"",
            "review_date": "2021-10-30",
            "source": "rt"
        },
        {
            "content": "The story of this film is truly fascinating! Each moment makes you ponder and question, and it becomes more suspenseful as it continues. The visual effects are great for the time, and all of the characters add better analysis to the story.",
            "review_date": "2021-10-21",
            "source": "rt"
        },
        {
            "content": "On the short list of my all-time favorite movies, Minority Report is the rare film that has everything: breathtaking action and suspense, philosophical and ethical dilemmas, real emotion and well-placed plot twists. In fact, it has so much going on that it might have gone off the rails in lesser hands; but Spielberg's veteran direction shapes it into a masterpiece.",
            "review_date": "2021-09-16",
            "source": "rt"
        },
        {
            "content": "This movie is so innovative, fast-paced, and thought-provoking, I regularly show it to my Film Studies students to help them discuss its important themes, such as determinism vs. free will. This is a must-see that shows incredible character growth in John Anterdon, the protagonist, as he explores the flaws of Precrime through his own murder setup. This film will leave you shocked and at the edge of your seat! Don't miss it.",
            "review_date": "2021-08-31",
            "source": "rt"
        },
        {
            "content": "Tom Cruise is a top officer in the pre-crime division in the year 2054.  Stopping crimes before they happen thanks to the three pre cognitives that see the future.  He finds himself on the run when they predict he will murder someone, and sets out to clear his name.   From a story by Phillip K Dick, Steven Spielberg directs this interesting and fun sci-fi flick.  Costarring Colin Farrell, Samantha Morton and Max Von Sydow.",
            "review_date": "2021-08-25",
            "source": "rt"
        },
        {
            "content": "Great film. Hard to predict what happens next.",
            "review_date": "2021-08-22",
            "source": "rt"
        },
        {
            "content": "I consider myself to be relatively tolerant of many things in movies. I can handle quite a bit, but there was something about this one that really did make me quite uncomfortable. I think it was my inner voice crying out that no matter what would happen in the future, it was unethical to punish someone for a crime they hadn't committed. And I stand by that still. While some believe that fate exist, there is nothing set in stone and you can change your fate. In fact, we do that with every choice we make in life. There is a lot that can trigger people here, a lot that triggered me even. The movie has a subplot where Anderton (Cruise) is desperately searching for whoever kidnapped his son and we are to believe that the son was murdered. I'm a bit embarrassed to say that now the scene that made me the most uncomfortable had to do with a simple surgery. I've watched House but there's one thing I can't handle when it comes to surgery and that's eyes. Weird but I was not quite prepared for a graphic eye removal surgery of the main character.\n\nWith all that said, let me make it clear that this is an incredible thriller. It was made by the legendary Stephen Spielberg and is based on a story by Philip K. Dick who also brought us sci-fi classics like Blade Runner. The characters are each developed and interesting. The visuals are absolutely stunning, everything seems to just be perfect and I can't in my right mind not recommend this movie. There is a lot of content that might make viewers uncomfortable but if you go in knowing that I don't think it would affect as much. The movie reminded me a little bit of (one of my favorite movies of all time) 1998's \"Pleasantville\". This perfect world where no one gets hurt. But in creating that perfect world, you take away people's ability to live. Of course, this is much darker than Pleasantville but it ties a lot in with the same philosophies of it. \"Minority Report\" is a fantastic movie, absolutely!",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "Great movie very stylish like Blade Runner, also written by Phillip K. Dick",
            "review_date": "2021-07-17",
            "source": "rt"
        },
        {
            "content": "A very good work of science fiction, with a great narrative and that raises a dilemma, that it if \"is right to arrest someone who is going to commit a crime before the person commits it?\". A problem that I found ingenious and in itself would already arouse my interest. Which becomes even bigger with the presence of Tom Cruise and the direction of Steven Spielberg, who, after watching the film, justify the expectation. One of the points I noticed is the \"plausible\" future created, which makes the work even better, in my opinion. In short, one of my favorite science fiction movies.",
            "review_date": "2021-07-07",
            "source": "rt"
        },
        {
            "content": "This is only high concept to people who think using scientific jargon to explain what is essentially religious ideology makes something \"smart\" or \"thought provoking\". This movie is full of emotional manipulation in place of true emotional connection, so much so that they use the Disney trope of killing of a kid/spouse/parent in order to garner sympathy for characters that are usually written to be shallow and, especially with Tom Cruise in the role, overly confident and brash. Steer clear of this movie of Fast & Furious movies make you cringe. If you enjoy Fast & Furious, you're probably one of those people that call this \"smart\" because you don't understand any of the words. Don't worry, neither does Tom Cruise.",
            "review_date": "2021-06-23",
            "source": "rt"
        },
        {
            "content": "Minority Report is an exciting sci-fi thriller/film noir. The effects and some of the future elements haven't aged well. I found the scenes where Tom Cruise got encapsulated in a self-driving car and eluding capture in a high-speed chase, jumping from car tops on a vertical highway too reminiscent of the droid factory sequence and flying car chase in Attack of the Clones (which came out a month earlier in 2002). These scenes in both films felt sterile and cartoonish, and made me think nothing was really at stake, so I got bored. Special effects in old films, though sometimes unconvincing, had a charm that audiences today still appreciate, but CGI special effects don't seem to age as well.\n\nSome sci-fi elements were prescient, particularly in the details, like the especially invasive targeted ads and people readily giving up their civil rights in the name of safety. Other things, less so, such as people still reading newspapers and the ubiquitous presence of mainstream media, and COPS still being on the air. Sci-fi movies tend to overshoot on technology, and miss social trends, but get enough details right to seem prophetic.\n\nAs a pot-boiler, Minority Report is fast-paced and intriguing enough its other miscalculations can be easily overlooked as you get engrossed in the movie and the 145-minute runtime speed by.",
            "review_date": "2021-06-22",
            "source": "rt"
        },
        {
            "content": "Some of this projected technology is just hard to watch now and the way it was futuristically shot doesn't exactly hold up.",
            "review_date": "2021-06-01",
            "source": "rt"
        },
        {
            "content": "There's an interesting premise, though it requires some suspense of realism. I can live with that but it's all just done pretty ridiculously. A lot of over-the-top dialogue. And why is the lighting so awful in just about every scene? It seems intentional but if there's a good reason for it, it's lost on me.",
            "review_date": "2021-05-29",
            "source": "rt"
        },
        {
            "content": "Ok, Incredible plot, incredible world building. A completely immersive story that leaves you guessing at every turn. This movie really made me think. Also made me literally physically gag multiple times. Ummm... hands down some of the grosses scenes ever thought of for a movie. DO NOT EAT WHILE YOU WATCH. Good watch tho.",
            "review_date": "2021-05-24",
            "source": "rt"
        },
        {
            "content": "Great movie, will always be a classic. Special effects might not hold up the best, but the base is solid. 89/100",
            "review_date": "2021-04-09",
            "source": "rt"
        },
        {
            "content": "A well written action packed science fiction movie with an incredible performance by Tom Cruise.",
            "review_date": "2021-03-05",
            "source": "rt"
        },
        {
            "content": "Such a griping and thrilling sci fi crime thriller!",
            "review_date": "2021-02-27",
            "source": "rt"
        },
        {
            "content": "I was getting into it when I realized something. Perhaps I missed the explanation, but if they just lock up the precriminals until past the time they were supposed to commit their crimes, all is well and there's no movie. They could then let them out with a warning that if they're convicted of a precrime again, they'll be locked up for a punitive amount of time. I was really enjoying it until I ruined it for myself.",
            "review_date": "2021-02-18",
            "source": "rt"
        },
        {
            "content": "This gripping sci-fi action film brings questions concerning criminal justice, societal interests and free will to the fore, and leaves one pondering over the answers long after the credits have begun to roll. While the plot seems needlessly complicated at times, it's not difficult to look past this and appreciate the complexity of the film's characters and the ambiguity of its message.",
            "review_date": "2021-02-13",
            "source": "rt"
        },
        {
            "content": "Clever, genius, and original. \"Minority Report\" is full of twist and turns, fully realized characters, great pacing, tense moments and thought provoking dialogue. Sure, most of the action sequences are cheesy and the color pallet is pretty bland, but both are minor nitpicks and shouldn't ruin your experience with the movie. All in all, this is a fantastic film and both Tom Cruise and Steven Spielberg deserve a round of applause for this masterpiece.",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "Still a great film to watch even to this day! Watching it again makes you wonder is this the kind of future that all of us are going to live in?",
            "review_date": "2021-02-02",
            "source": "rt"
        },
        {
            "content": "(Rest assured, this review has no spoilers) Minority Report is a great movie and a must-see for any sci-fi fans. One of Spielberg's most underrated works and good acting from Tom Cruise. The themes of predetermination, prevention of crime, and the role of the media are very multilayered, as is to be expected from an adaptation of a Philip K. Dick book. Spielberg invokes the ideas of tech noir well as his protagonist explores the idea of predestined crime and authoritarianism as we explore a postmodern society in the search of the Minority Report. One of my favorite scenes is when the main character goes to a memory hacker, who can not only create new memories for people but can also extract buried ones. Of course, the film has some issues, seeing as the pace of the book was not created for film; however, Spielberg more than makes do by transitioning the pace to that of an action movie while still keeping the philosophical complexities of the book.",
            "review_date": "2021-01-22",
            "source": "rt"
        },
        {
            "content": "A cool and creative sci-fi action film with great acting from Tom Cruise and great directing from Stephen Spielberg.",
            "review_date": "2021-01-14",
            "source": "rt"
        },
        {
            "content": "A great sci-fi thriller in which Tom Cruise plays a cop who heads up a unit that fights \"PreCrime\"; crimes that have yet to occur but are foretold by a trio of technologically enhanced clairvoyants. \nThe movie has some nice effects and plenty of futuristic technology and Cruise goes full-throttle at all the many action and chase sequences.\nDirected by Steven Spielberg with his characteristic energy and flair, this is a proper, throw things at the screen, blow the budget, action spectacular but has an interesting plot to go with it, based as it is on a Philip K Dick story.\nSamantha Morton plays a pivotal role as one of the psychics and, as is typical of her, gives a very convincing performance while Max von Sydow is his usual, watchable self as the political boss of the whole operation.\nMinority Report is a good, old fashioned block buster that is still a thrilling and enjoyable way to pass a couple of hours.",
            "review_date": "2021-01-06",
            "source": "rt"
        },
        {
            "content": "Well done, sir. But what else would you expect from one of the masters of the genre but a taut, engrossing, consistently winning action thriller? Spielberg's Minority Report is a impressive in all aspects of filmmaking- the screenplay by Cohen & Frank; the casting of Cruise, Morton, McDonough, Farrell, and the legend that is Max Von Sydow; top notch production values. \nBut the direction by Spielberg is so stellar. The tone appropriate for a futuristic sci-fi action thriller is set from the first scene, and we are held within the compelling bounds of this world of 'Pre-Crime' policing. We have the science of the 'Pre-cogs', the hyper-sensitive beings who see heinous crimes before they happened, but also holding the 'reports' of those crimes, even horrific murders, in what seem to be quite fragile psyches. \nThe wonderful Samantha Morton is Agatha, the key and most 'sensitive' of the Pre-cogs. Her fear and her cries to \"Run!\" feel almost palpable.\nVon Sydow is equal parts cool, detached, sinister, but also believable as a 'creator' of this game-changing form of crime detecting.\nThen there's Cruise- for all his portrayals of the ultimate 'good guy', as the All-American 'hero', the early cheese-ball roles, Cruise is remarkable in these roles. His ability to pull-off the earnest, indefatigable soldier of sorts along with his impressive physical capacity make him ideal for this role as it does for the Mission Impossible movies. Great flick- 4.1 stars",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "One of Tom Cruise best movies. Great action/ thriller movie.",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "A solid contribution to the canon of cyberpunk sci-fi, Minority Report plays out a strong core narrative with some sloppy details that reek of having been adapted and condensed from a fiction text.  While the special effects and acting performance from Cruise leave much to be desired, the philosophical questions posed by the film's dystopia are engaging enough to be worth watching at least once.",
            "review_date": "2020-11-25",
            "source": "rt"
        },
        {
            "content": "Great story but there's something lacking in that usual Speilberg magic and I can't quite tell what it is. Watch it anyway though as the ideas posed are fantastic and thought-provoking, very probably because of Philip K. Dick's plot. Maybe that's it - it possibly doesn't have Speilberg's normally brilliant flow.",
            "review_date": "2020-11-23",
            "source": "rt"
        },
        {
            "content": "very philsophic and intriguing\ngood movie",
            "review_date": "2020-11-18",
            "source": "rt"
        },
        {
            "content": "It's visually impeccable as it is narratively minimum, but it's a well-rounded picture",
            "review_date": "2020-10-24",
            "source": "rt"
        },
        {
            "content": "Rivets in parable & [Tom] Cruise's pants make for a great, innocent, but epic dystopia of oddities, kindling enigmas and Samantha Morton's heartrending acts. Even in its PG-13 sense, it manifests a fine line between our reality in blinding daylight and spirited blue.",
            "review_date": "2020-10-22",
            "source": "rt"
        },
        {
            "content": "A thoughtful, imaginative, intriguing, fast-paced, visceral and exciting sci-fi crime thriller that delightfully mixes stylish visuals, high-octane action and an ambitious premise that fulfills its promise, turning into a great collaboration between Steven Spielberg and Tom Cruise.",
            "review_date": "2020-09-10",
            "source": "rt"
        },
        {
            "content": "I thought this was an awesome Sci-Fi film. One of Tom Cruise's best films.",
            "review_date": "2020-09-05",
            "source": "rt"
        },
        {
            "content": "Well, the plot feels too weird and long, the best thing of the movie is it's soundtrack.",
            "review_date": "2020-09-03",
            "source": "rt"
        },
        {
            "content": "Os fins justificam os meios?\n\nA obra de Steven só não beira a perfeição por conta de um certo tipo de indecisão no que se propõe a ser.\n\nAo iniciar do longa, acreditei estar vendo algo mais pé no chão; reflexivo. E a fotografia inevitavelmente me lembrou Blade Runner, principalmente por conta do uso das luzes. Já mais pra metade do filme, um aspecto mais aventuresco tinha vindo a tona, nem que fosse em poucas cenas. Alguns momentos cômicas quase me afastaram do filme, principalmente a cena de ação desnecessária que há. Felizmente, o filme não se entrega completamente e volta a focar na narrativa, mesmo que aquela atmosfera inicial não exista mais.\n\nEu gostei bastante dos personagens. O drama do protagonista me pegou, mesmo não havendo um grande enfoque nisso. Sua personalidade e ideais são bem representados. O mesmo acontece com o personagem de Colin Farrel, que traz contrapontos interessantes e serve perfeitamente de \"Red Herring\", dando um alicerce muito grande ao plot twist. O diretor Lamar Burgess também é bem desenvolvido, indo muito além do personagem \"mal por natureza\".\n\nA construção do universo é ok. Não há um verdadeiro enfoque nisso, senão o apelo ao visual - pra 2002, até que chama atenção. A fotografia é muito boa, de forma geral. O suspense carregado funciona bem, nos deixando com interrogações na cabeça boa parte do filme.\n\nPor mais que haja um certo tipo de indecisão no que se diz respeito ao proposito do filme - ao menos, isso que me pareceu; nada disso chega a atrapalhar minha experiencia, que contou com momentos emocionantes e de surpresa considerável. Recomendado!",
            "review_date": "2020-08-25",
            "source": "rt"
        },
        {
            "content": "In April 2054, Washington, DC's prototype PreCrime police department stops murderers before they act, reducing the murder rate to zero percent. Murders are predicted using specialized mutated humans, called \"Precogs\", who \"previsualize\" crimes by receiving visions of the future. Would-be murderers are imprisoned in a benevolent virtual reality. The federal government is on the verge of adopting the controversial program nationwide. Since the disappearance of his son Sean, PreCrime Captain John Anderton (Tom Cruise) has separated from his wife Lara (Kathryn Morris) and became a drug addict. While United States Department of Justice agent Danny Witwer (Colin Farrell) is auditing the program, the Precogs generate a new prediction, stating Anderton will murder a man he does not know named Leo Crow in 36 hours. Anderton flees the area as Witwer begins a manhunt. Anderton seeks the advice of Dr. Iris Hineman (Lois Smith), the creator of PreCrime technology. She reveals that sometimes one of the Precogs, usually Agatha (Samantha Morton), has a different vision than the other two; a \"minority report\" of a possible alternate future. This has been kept a secret as it would damage the system's credibility. Anderton resolves to recover the minority report to prove his innocence...\n\nRotten Tomatoes critical consensus is, \"Thought-provoking and visceral, Steven Spielberg successfully combines high concept ideas and high octane action in this fast and febrile sci-fi thriller.\" The website listed it among the best reviewed films of 2002. Some reviewers felt that Spielberg did not adequately tackle the issues he raised. The movie has inspired much discussion and analysis, the scope of which has been compared to the continuing analysis of Blade Runner. This discussion has advanced past the realm of standard film criticism. Slovenian philosopher Slavoj Žižek fashioned a criticism of the Cheney Doctrine by comparing its preemptive strike methodology to that of the film's PreCrime system. Richard Corliss of Time said it's \"Spielberg's sharpest, brawniest, most bustling entertainment since Raiders of the Lost Ark\". Mike Clark of USA Today felt it succeeded due to a \"breathless 140-minute pace with a no-flab script packed with all kinds of surprises.\" Lisa Schwarzbaum of Entertainment Weekly praised the film's visuals,and Todd McCarthy of Variety complimented the cast's performances. Film scholar Warren Buckland recommended the film, but felt that the comedic elements—aside from Stormare's lines—detracted from the plot and undermined the film's credibility. Andrew Sarris of the New York Observer gave the film a negative review in which he described the script as full of plot holes, the car chases as silly, and criticized the mixture of futuristic environments with \"defiantly retro costuming\". The complexity of the storyline was also a source of criticism for Kenneth Turan of the Los Angeles Times, who considered the plot \"too intricate and difficult to follow\". Both Rosenbaum and Hoberman belittled the titular minority report as a \"red herring\". More positive reviews have seen it similarly, but referred to it as a \"MacGuffin\".\n\nSteven Spielberg´s adaption of Philip K. Dick´s novel is visually stunning for being made in 2001/2002, thrilling and suspenseful with a great storyline. The film combines elements of tech noir, whodunit, thriller and science fiction genres, as well as a traditional chase film, as the main protagonist is accused of a crime he has not committed and becomes a fugitive. \"Minority Report\" was one of the best-reviewed films of 2002 and was nominated for several awards. It received an Academy Award nomination for Best Sound Editing, and eleven Saturn Award nominations, including Best Actor, Best Supporting Actor, and Saturn Award for Best Music, winning Best Science Fiction Film, Best Direction, Best Writing, and Best Supporting Actress. The film earned over $358 million worldwide against an overall budget of $142 million (including advertising). Over four million DVDs were sold in its first few months of home release. The most commonly criticized element of the film is its ending. The film has a more traditional \"happy ending\" which contradicts the tone of the rest of the picture. This has led to speculation that this ending is the product of John's imagination, caused by hallucinations from his forced coma after he is incarcerated. As one observer mused, \"The conclusion of Minority Report strikes me as a joke Spielberg played on his detractors—an act of perfectly measured deviltry.\"",
            "review_date": "2020-08-18",
            "source": "rt"
        },
        {
            "content": "Another great scoff flick based on a novel by the great Philip K. Dick, with great special effects that are a visual treat, directed by Spielberg and fast furious action in the excellent script, plus good performances by all. Watch for the great short performance of the wonderful Lois Smith--she was always a treat! Max von Sydow, who unfortunately passed away in March of this year, gives another stellar performance, too.",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "One of my favorite Tom Cruise movies. A lot of action all they way through.",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "what a mess of storyline. This is a waste of talent.",
            "review_date": "2020-07-21",
            "source": "rt"
        },
        {
            "content": "One of the best Steven Spielberg's movies after the Indiana Jones Trilogy.  It is a mind-blowing sci-fi, crime drama.  It is also one of the best movies that Tom Cruise has starred in, since Top Gun, and the Mission Impossible series.  Highly recommended!!",
            "review_date": "2020-07-20",
            "source": "rt"
        },
        {
            "content": "The story and idea are strong, but it doesn't justify it's length. There's a lot to like here, but not one I'll be craving to re-watch anytime soon.",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "Recently rewatched this movie after not having seen it in over a decade. It's crazy how much of a story can be missed when you are just a kid. Having multiple antagonists each with their own way of throwing the protagonist off track and having it just come down to one of them is excellent. The movie does a great job of showing fate vs free will. I think this is a great sci-fi movie for anyone who likes anything from Philip K. Dick.",
            "review_date": "2020-07-13",
            "source": "rt"
        },
        {
            "content": "I almost always enjoy every science fiction movie I watch and Minority Report was no exception. It was thrilling to see a concept like psychic preknowledge used in crime prevention. When Lamar killed himself instead of John like the precogs predicted, it suggests that we all have a choice even if our futures seem determined. Unlike some movies, the ending was simple and not up to the viewer to pick apart. We know for a fact that PreCrime is over, John is back with his wife, they're going to have a kid, and the three precogs are going to live good lives. It's satisfying to see a good ending like this and it wraps up the movie well.",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "Minority Report really engaged me. The mystery surrounding Tom's character being accused of a murder and he's trying to prove that he's innocent. It kinda asks a moral question too about arresting someone for a crime even though the crime hadn't happened yet. Can you do that? But I was never bored watching this. It kept my attention and I had a lot of fun with this movie",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "It has some great ideas but doesn't always know what to do with them.",
            "review_date": "2020-07-01",
            "source": "rt"
        },
        {
            "content": "Visually arresting, and still feels quite contemporary with its 2054 future technology almost here today not least the emphasis on AI and the Internet of Things.\n\nHowever, the film falters slightly with its narrative, and exactly how precrime and the pre-cogs came into being, and how it all hangs together. The script explaining all this in the first act fell hurried, as if the writers were making it up as they went along and didn't want the viewer to think about it too much.\n\nThe other stumbling block was the last 10-15 minutes, where Spielberg once again quite literally loses the plot and goes for a safe conclusion - exactly the same kind of conservatism (small 'c') that ruined his \"War of the Worlds\"\n\nCruise is okay here, but it felt like it was just another Mission Impossible scenario for him. But the talented Max Von Sydow was totally wasted, with a character so one dimensional and a dialogue so creaking that it was clear he did it for the money.\n\nToo many plot holes, too much technobabble, and a lame ending spoilt what could have been a great film.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "Better than I expected. Though I probably should have had fairly high expectations with Steven Spielberg directing a Philip K. Dick adaptation. Good movie.",
            "review_date": "2020-06-26",
            "source": "rt"
        },
        {
            "content": "This movie was amazing and way ahead of its time. I was very impressed. Tom Cruise had an incredible performance. The story was unique and captivating. Very thought provoking. All the future tech displayed in this movie is still impressive today in 2020 even to a seasoned Sci-Fi fan. A must see film, one of the best Sci-Fi movies out there.",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "Technically the best sci fi movie that Tom cruise has done",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "If you want a sci-fi murder mystery with a whole lot of exposition about how the future works, a whole lot of talking exposition explaining the murders and a whole lot of smart characters who do a whole lot of stupid things, then this is the right movie for you. \n\nOMG how can you combine Cruise and Speilberg, and end up with a movie that's soooo long and soooo boring?\n\nIt's one thing for one character to make one random mistake -- but when they ALL make PERFECT mistakes for the story to proceed as needed... it really becomes annoying. Take the main plot: a character is told that he's going to go somewhere and kill a certain someone... he evades capture and what does he do? He sets out to find this certain someone (that he's never met) and a location (he's never been to). WHY? Wouldn't a rational human being simply leave the city and avoid everything that looks like the prediction until the predicted time has passed?  But then we wouldn't have a long complicated movie.\n\nTo make matters worse, not only is the plot so overly complicated, the look at what the future will look like in 50 years is so unimaginative and boring. At least Back to the Future tried to be inventive. In this film, we still have GAP clothes, only they know your size when you show up. Big deal. The Internet already does that.\n\nThere are much better movies to watch if you like sci-fi. You don't have to be a pre-cog to predict that if you watch this, you'll be disappointed. If you want a good Cruise sci-fi, check out Edge of Tomorrow.",
            "review_date": "2020-06-17",
            "source": "rt"
        },
        {
            "content": "Fun popcorn sci-fi thriller. I'd say this movie is very mid-tier for both Spielberg and Cruise, it doesn't amount to anything too memorable. But for an early 2000's action/sci-fi flick it amounts to a good time",
            "review_date": "2020-06-03",
            "source": "rt"
        },
        {
            "content": "This movie was awesome. It had an incredibly unique idea that was so much fun to watch unfold. Plenty of twists and turns. A perfect sci-fi movie.",
            "review_date": "2020-05-27",
            "source": "rt"
        },
        {
            "content": "A must-watch for any fan of sci-fi movies thanks to Tom Cruise's performance and Steven Spielberg's directing",
            "review_date": "2020-05-26",
            "source": "rt"
        },
        {
            "content": "This is very odd sci fi movie and it use to be a lot better then I remembered. Its worth watching at least once.",
            "review_date": "2020-05-18",
            "source": "rt"
        },
        {
            "content": "Basically everything you want from this kind of sci-fi blockbuster. Tom Cruise is good as the lead, there's a lot of action, and a plot that features some really intriguing twists. It is a bit too long but that's not a major problem.",
            "review_date": "2020-05-12",
            "source": "rt"
        },
        {
            "content": "My wife and I disliked this film so intensely that we both agree to stop watching after twenty minutes",
            "review_date": "2020-05-08",
            "source": "rt"
        },
        {
            "content": "It's good! Long, but worth your time.",
            "review_date": "2020-05-06",
            "source": "rt"
        },
        {
            "content": "A mindf*ck whodunit sci-fi noir that actually ends up pretty good.\n\nMinority Report is a movie based around the age-old question of destiny & fate vs free will. It has everything one could want in a sci-fi thriller: a solid plot with twists, great world-building, and satisfying violence. There's no way one could predict the end of this movie.\n\nAnd did I mention Tom Cruise stars this movie?\n\nThough the movie is fun, I found the ending leaving a bit to be desired.\n\n3/5. Enjoyable but not groundbreaking.",
            "review_date": "2020-05-02",
            "source": "rt"
        },
        {
            "content": "I think I watched it a little bit too late. Doesn’t play as well in 2020 as it would’ve a decade ago but still a good story with some unexpected twists. ",
            "review_date": "2020-04-30",
            "source": "rt"
        },
        {
            "content": "Balancing between human story and crime thriller, Steven Spielberg's \"The Minority Report\" is a fascinating look into the future where the government has the ability to stop crimes before they occur. With Tom Cruise's terrific performance and Spielberg's ability to weave characters and CGI seamlessly, this thought-provoking whodunit is another brilliant showcase of their talents.",
            "review_date": "2020-04-30",
            "source": "rt"
        },
        {
            "content": "I was on board until \"sick sticks\" after that the movie just couldn't keep it together.  Most of the characters were all just cheap one dimensional cut outs.  When the second act began the story just got super convoluted and hard to follow, and the \"twist\" at the end I saw a mile away.  Honestly I don't understand why people like this movie so much, it's jam packed with story and thin plot threads, there is nothing super special in this film that you can't get from another sci-fi films.",
            "review_date": "2020-04-24",
            "source": "rt"
        },
        {
            "content": "Entertaining sci-fi / action movie if a bit predictable in plot.",
            "review_date": "2020-04-22",
            "source": "rt"
        },
        {
            "content": "Spielberg's Minority Report is a smart film with great visuals. The title is a little bothersome and the film itself is long but that doesn't take away the excellent storytelling that is offered.",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "هل تمتع الإنسان بتبصر وحاسة فوق العادة كمعرفة الجريمة قبل وقوعها يمكن ان يجعل حياته أفضل؟",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "Probably my favorite Tom Cruise movie! It had such an original plot and a great story line! Definitely a bit sci-fi-ish, but really well done!",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "Really good story, then are the rest even Morton",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "interesting story and plot. lacking a bit when it comes to the action. when one cop can  outrun all the rest when they have technology to see crimes in the future its kinda hard to believe.",
            "review_date": "2020-04-13",
            "source": "rt"
        },
        {
            "content": "The premise takes some logical leaps to provoke thought on the role of intent, the nature of crime, and the evolving police state, but while it can't help but feel less than fleshed out in its philosophical commentaries, it remains one of the more engaging and interesting science fiction films (and action films) of the early 2000s. However, it is probably a bit bloated on the runtime, and shaving off 20 minutes (particularly from the films far more sluggish ending) would improve the film substantially. (4/5)",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "Almost perfect. A few tiny holes poking through. ",
            "review_date": "2020-04-09",
            "source": "rt"
        },
        {
            "content": "It's a solid science fiction movie all around. It asks questions and entertains at the same time. What more can you ask for? Tom Cruise is great also in this movie.",
            "review_date": "2020-04-09",
            "source": "rt"
        },
        {
            "content": "Way ahead of its time. Great movie worth the watch. Maybe someday this can become a reality. ",
            "review_date": "2020-04-05",
            "source": "rt"
        },
        {
            "content": "A May that manages to provoke the audience's mind with deep philosophical levels while remaining light on it's feet with standard action and thrills.",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "Surprisingly dark, Minority Report is a twisty and twisted thriller elevated by a strong performance from Tom Cruise.",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "In this love letter in between of what's been interpreted and what's to become, amid losing battery life, Spielberg tackled the dystopian genre's thematic tropes very well while being a faithful recognition to Phillip K. Dick's literature from \"Blade Runner\" in a more loosely imaginative update that lines up debatable ambiguity and high-paced adrenaline through unseen obstacles – probably becoming Tom Cruise's most challenging course his beneficial performance always tend to manage. (B+)",
            "review_date": "2020-02-27",
            "source": "rt"
        },
        {
            "content": "An ultimately stupid story, totally irrelevant in every aspect",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Too much fiction, and not enough science, really. Too much Tom Cruise for that matter, really. \"Minority Report\" indeed!",
            "review_date": "2020-02-08",
            "source": "rt"
        },
        {
            "content": "\"Don't dream it, be-e it.\" - Rocky Horror",
            "review_date": "2020-02-06",
            "source": "rt"
        },
        {
            "content": "Minority Report is easily one of the greatest sci-fi movies ever!",
            "review_date": "2020-02-05",
            "source": "rt"
        },
        {
            "content": "I found Minority Report to be a very interesting concept with a powerful message about the future, but it was far too convoluted and strange to really enjoy it. Though, I’m probably biased, because films of this nature (futuristic, technology driven) aren’t my cup of tea",
            "review_date": "2020-02-03",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg's adaptation of Philip K. Dick's short story is a smart, exciting combination of hard science fiction and action thriller.  Think Ridley Scott's original Blade Runner with more of an emotional connection; Minority Report is Spielberg's best work since the turn of the millennium.",
            "review_date": "2020-01-22",
            "source": "rt"
        },
        {
            "content": "Such a unique premise, and finally a movie that does not waste such a good premise.   Tom Cruise in one of his better roles, and Spielberg brings his A game.",
            "review_date": "2020-01-09",
            "source": "rt"
        },
        {
            "content": "Minority Report is an awesome Tom Cruise movie. It has a very clever story, Great action and a Fabulous cast.",
            "review_date": "2019-12-29",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg and Tom Cruise is a wonderful combo",
            "review_date": "2019-12-10",
            "source": "rt"
        },
        {
            "content": "Hence, Minority Report feels like the first headline you read in the morning newspaper. It's a good feeling.\n\nMinority Report\n\nSpielberg felt in a rush, to me. Maybe he was following Cruise. It is not the first time one of his films has been a victim of this phenomenon and it won't be the last if it will be dealt like this. The director Steven Spielberg occasionally does dip into the entertainment pool to expand his filmography. And as always we have left the screen satisfied and amazed at the spectacle that he puts enormous effort into. Those details pay off just like it does here. And while I am satisfied with the product, never for a second it convinced me that this is coming straight from Spielberg's vision. Don't get me wrong, there are few details added in the film regarding the futuristic materially rich world and the style and efficiency it comes with. But something doesn't add up. While the ambition is big, the reasoning felt short to me. For instance, I can understand the incompetence of the film to fully craft a nail biting chase sequence involving jet packs. But what I had issues with are cereal boxes that are animated. Sort of like, from the magical world of JK Rowling. These pictures animate and they endorse themselves perfectly. Just like the film does of Spielberg's sci-fi workshop. The emotional storage is empty, this time. In that sequence itself, Tom Cruise mourning over his son and the memories that he revisits feels misplaced and poorly choreographed. Yes, it could be argued that he is a stress eater and what not. But it then, doesn't communicate with us properly like it should have. The film in such ways repeatedly undermines what could have been heavy emotional moments. What we are left with is a highly paced entertaining action packed thriller which keeps changing the priorities and the headlines.",
            "review_date": "2019-11-24",
            "source": "rt"
        },
        {
            "content": "Secondo film in un anno per Spielberg che propone un'opera di fantascienza esagerata e caotica. Il film presenta i tipichi cliché dei primi anni duemila: colonna sonora generica e convenzionale, un effetto cromatico eccentrico e incoerente ed una storia semplicemente troppo ambiziosa. Il risultato è un film banale e disordinato che non riuscirò a ricordare per più di una settimana.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg is a genius, master filmmaker and as such Minority Report should be stated as a blockbuster fantastic film, not totally unexpected to be so good. Those in the mood for the action and adrenaline rush of a typical summer blockbuster will find something to their taste here. Yet there are richer rewards for viewers who are willing to engage their brains. Anyone who wants to think through the mysteries and paradoxes presented herein will discover a multi-course cinematic buffet that can keep the gray matter occupied for days to come. Action fans have plenty to engage their attention. Minority Report features its share of shoot-outs, fights, and chase scenes, some of which are quite spectacular. As for the special effects- they are very good and serve the ingenuity of the script, not the other way around. This is a marvelous film that should be watched by fans and non-fans of sci-fi alike.",
            "review_date": "2019-10-22",
            "source": "rt"
        },
        {
            "content": "My favorite film of all time! I’ve been waiting for a movie like this and although the ending could of used some work it was awesome!!!!",
            "review_date": "2019-10-18",
            "source": "rt"
        },
        {
            "content": "A very good sci-fi film. The writing is smart. Tom Cruise gives a very good performance as John Anderton. It is a little long but you don't really notice it, due to it not having any dull scenes.",
            "review_date": "2019-09-22",
            "source": "rt"
        },
        {
            "content": "Sadly, I was very disappointed by this movie. Minority Report is a Spielberg/Cruise collaboration that I've had my eye on for quite some time now due to the intriguing premise and my love for the Sci-Fi genre. But, by the midpoint of the film, I couldn't shake a deep feeling of dissatisfaction. Yes, there are aspects I liked, but the shortcomings(from my point of view) bogged down the experience considerably.\n\nLet's point out what I liked: Tom Cruise. Say what you want about him, the guy is the epitome of a superstar, and I personally enjoy watching a lot of his movies. He's one of the few saving graces in here. The others being the story obviously, some of the visuals, and the last half hour. The unraveling of the antagonists conspiracy was slickly and satisfyingly unfolded in a flow-chart fashion. I enjoyed that as well.\n\nNow onto my reservations. First being the lighting. Why they decided to make 80% of the movie look like it was filmed on the surface of the sun is beyond me. I get that it takes place in the future, and perhaps this choice was made to further convey that fact, but jeez, talk about an eyesore. The camera angles were solid at least. Then there's the frequent, out-of-place, bizarre humor which feels like an antithesis to what the premise SHOULD feel like. I don't want gags like an elderly man dropping a deuce, or perverted elderly women occurring within a movie about the futuristic ability to prevent murders before they occur. It just doesn't mesh well and causes the film to feel tonally inconsistent. When it comes to the action, meh, it's passable, but nothing special. There's also the issue of length. Did this really need to be 2 and a half hours?\n\nNow this gripe is the main contributor to what warrants a rewatch: that being the storytelling. The basic premise is easy to follow, but somewhere from the 2nd to final act it devolves into an overly-intricate mess. There's nothing wrong with intricacy mind you, as there's many movies I love that have that nature. But there comes a point where if it's overdone, things will spiral out of control and, not only leave viewers un-engaged, but also bored and disinterested in trying to put the pieces together. Because of this, I will be revisiting the film later on. Because perhaps a rewatch will clarify many plot beats for me.\n\nAs of right now however, Minority Report left a bad taste in my mouth. There are parts I liked, and many parts I didn't like. It felt like Mission: Impossible(with it's confusing plot) meets Next(with predicting the future, although this is light-years better). Many consider this to be one of Spielberg's most underrated works, but it doesn't take a rocket scientist to see why it holds no candle compared to his pre-2000's masterworks.",
            "review_date": "2019-08-25",
            "source": "rt"
        },
        {
            "content": "In Pre-Crime, there is no perfection. There are a defect and glitch. Everybody in this movie has \"disabilities\" both John and Pre-Cog. Yet, there will never be a world without criminals. If a crime doesn't exist, then automatically, there will never be morality. We don't even need to listen to the criminal. Because we never know what reason they do it. Just like Pre-Crime, doesn't provide a biased perspective for the criminal. It's just sad but I don't fully support the bad side. \"Minority Report\" really reminds me how great science fiction was, a fun movie, an entertaining movie, a complex movie but it's really worth it.",
            "review_date": "2019-08-10",
            "source": "rt"
        },
        {
            "content": "It starts off as a cat and mouse mystery thriller. But it slows down and gets lost, confused, and weird. Plus the movie is ugly and downbeat. What happened?",
            "review_date": "2019-08-02",
            "source": "rt"
        },
        {
            "content": "Excellent sci-fi noir ",
            "review_date": "2019-07-23",
            "source": "rt"
        },
        {
            "content": "Enjoyable Cruise sci-fi flick - I don't think he makes bad ones - with typical running and action scenes.  There are some technology and ethics issues it brings up, and does it in an enjoyable action flick sort of way similar to the Sixth Day.\nLike Sixth Day, some of its predictions are interesting, but the film is starting to show its age.  Some of the computer hardware and CGI doesn't look as good as it did when the movie was released, and please - who goes to MALLS?",
            "review_date": "2019-07-22",
            "source": "rt"
        },
        {
            "content": "Rewatched recently...so effing stupid. ",
            "review_date": "2019-07-19",
            "source": "rt"
        },
        {
            "content": "While the ending's a bit too happy for this type of movie, succumbing to Spielbergian whimsy, Minority Report's visuals, thought-provoking themes and thrilling plot elevated by a stellar performance from Tom Cruise and his co-stars make this sci-fi thriller's position as one of the best movies of 2002 a well-deserved one.",
            "review_date": "2019-07-17",
            "source": "rt"
        },
        {
            "content": "Stimulatingly interesting",
            "review_date": "2019-07-16",
            "source": "rt"
        },
        {
            "content": "Great suspenseful sci fi thriller\n",
            "review_date": "2019-07-06",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg's Minority Report is another thriller that showcases his film making talents. It has a great story that gets you invested quickly. A reliable amount of sci-fi elements and action. Along with a nice script and strong directing. Although it does take some strange and dumpy directions with the plot, it still manages to get to its destination just fine. Clearly, early 2000s enjoyment.",
            "review_date": "2019-04-28",
            "source": "rt"
        },
        {
            "content": "Quite an interesting concept, this movie is slightly above average with a nice plot but evetually nothing particularly special.",
            "review_date": "2019-04-07",
            "source": "rt"
        },
        {
            "content": "Boasting a clever concept, a charismatic actor and enthralling action set pieces, MINORITY REPORT is an excellent sci-fi crime thriller.",
            "review_date": "2019-03-08",
            "source": "rt"
        },
        {
            "content": "My favorite movie with Tom Cruise in it. Is there any movie that sucks that Tom is in? That guy is intense and I love his acting skill.\n\nHe might be the best male actor of all time in my opinion.\n\nVery tense scenes without any let down. Marvelous intrigue, a must watch.",
            "review_date": "2019-02-25",
            "source": "rt"
        },
        {
            "content": "Absolute rubbish had to switch off, might have been good in it's day.",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "The best sci-fi movie ever made!",
            "review_date": "2019-02-02",
            "source": "rt"
        },
        {
            "content": "Old school TC. Predestined murders",
            "review_date": "2019-01-04",
            "source": "rt"
        },
        {
            "content": "Minority Report is a film by a man at the top of his game. This is an amazing sci-fi action adventure philosophical film which will whet anyone's appetite. This is the magic of cinema. In the wake of the disappointment of A.I., Minority Report arrives in theaters representing a much-needed tonic for Spielberg. However, this is not just a \"rebound\" picture; it's an achievement - arguably the best escapist entertainment the director has produced in two decades. Minority Report rivals some of Spielberg's top adventure/science fiction epics, such as Close Encounters and Raiders of the Lost Ark. What's more, it affirms that, even in the 2000s, movies do not have to be brain-dead to be exciting. When the season is over, Minority Report will more than likely stand out as the best picture to grace multiplex screens during the Summer of 2002.",
            "review_date": "2019-01-03",
            "source": "rt"
        },
        {
            "content": "While on the whole it is alright, the little things here and there bog it down.",
            "review_date": "2018-12-29",
            "source": "rt"
        },
        {
            "content": "good story, good scoff.",
            "review_date": "2018-10-16",
            "source": "rt"
        },
        {
            "content": "Minority Report takes place in 2054 and concerns a group of police force which are equipped with the capability to foresee a crime about to happen with the help of three mutated humans called \"precogs\". Unfortunately for John Anderton (Tom Cruise) as he sets up to work on the next crime about to happen he is horrified to see that the offender is he himself. What follows is a cat and mouse hunt which involves his entire corporation and then some. The visual effects are amazing, and the tone of the film is finely balanced between dreary, rainy grey and futuristic blue. Cruise and Colin Farrell star. Great movie. (A great addition to the science fiction cannon).",
            "review_date": "2018-09-17",
            "source": "rt"
        },
        {
            "content": "A very well-crafted film that was a creative masterpiece, the plot was extremely well made and almost surprising as you see it unfold, however, the twist did seem a bit expected and predictable as the movie went on. In the first 10 minutes of the film the general setting and technological advancements have been introduced, along with a new inspector (Whitwer) who will be playing a big role in the film. Along with that the general idea of pre-crime has been addressed and introduced very nicely. There was a motif of eyes and seeing and there were many subtle references which just make the movie very enjoyable.",
            "review_date": "2018-08-30",
            "source": "rt"
        },
        {
            "content": "Spielberg creates an intense sci-fi thriller that manages to rein in its philosophical ideas from dominating the show while also utilizing them to propel the action.",
            "review_date": "2018-08-21",
            "source": "rt"
        },
        {
            "content": "The first real action movie that Spielberg has done and it is a triumph. Never would I have paired Tom Cruise with Spielberg, but they make a great team. The charisma of Cruise combined with the storytelling of Spielberg is perfect. This detective action film bring everything to the table that one might want in the genre. Action, suspense, and a mystery all rolled into 2 and a half hours. I love the idea of, is it a crime if it has not happened yet? It brings forth a lot of fun conversations and thoughts. This film does just that. Tom Cruise playing a broken man who has lost his son and his wife. This leads him to becoming one of the top agents in pre-crime to help prevent future children of being killed. The system gets turned on him and he must go on the run and clear his name. ",
            "review_date": "2018-08-13",
            "source": "rt"
        },
        {
            "content": "Minority Report is a stylish neo- noir science fiction from Steven Spielberg destined to become a classic of the future. Taking place in 2054 it concerns a group of police force which are equipped with the capability to foresee a crime about to happen with the help of three mutated humans called \"precogs\". Unfortunately for John Anderton (Tom Cruise) as he sets up to work on the next crime about to happen he is horrified to see that the offender is he himself. What follows is a cat and mouse hunt which involves his entire corporation and then some. The visual effects are amazing, and the tone of the film is finely balanced between dreary, rainy grey and futuristic blue. Cruise and Colin Farrell star. Great movie. (A neo-noir sci-fi which is a rarity).",
            "review_date": "2018-08-06",
            "source": "rt"
        },
        {
            "content": "Intelligent movie with a fantastic twist.",
            "review_date": "2018-08-04",
            "source": "rt"
        },
        {
            "content": "A good and surprisingly solid movie, even with the little source material it was based on.",
            "review_date": "2018-08-02",
            "source": "rt"
        },
        {
            "content": "This movie is totally ridiculous. I love it. Nothing makes sense, but that is good. The action sequences are shit, but that is exactly right. The people are weird, but this feels just right.",
            "review_date": "2018-07-24",
            "source": "rt"
        },
        {
            "content": "Minority Report is a stylish neo- noir science fiction from Steven Spielberg destined to become a classic of the future. Taking place in 2054 it concerns a group of police force which are equipped with the capability to foresee a crime about to happen with the help of three mutated humans called \"precogs\". Unfortunately for John Anderton (Tom Cruise) as he sets up to work on the next crime about to happen he is horrified to see that the offender is he himself. What follows is a cat and mouse hunt which involves his entire corporation and then some. The visual effects are amazing, and the tone of the film is finely balanced between dreary, rainy grey and futuristic blue. Cruise and Colin Farrell star. Great movie.",
            "review_date": "2018-07-24",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg predicts the future way back in 2002!\n\nSpielberg's direction is peerless as usual with beautiful shots, thrilling action, and groundbreaking ideas. The science fiction elements are pretty clever and forward thinking in Minority Report. This is a movie that blends Spielberg's usual theme of fatherhood with the ethics of law enforcement. Spielberg forces the audience to contend with the futuristic concept of pre-crime: arresting people before they intend to commit a crime. It's a fascinating concept executed in fantastic fashion by Spielberg's high tech machinery and fresh ideas.\n\nTom Cruise is the star of the show with his highly thoughtful approach to police work. We get to see Cruise take on parenthood, arrests, comedy, investigation, and action sequences alike. He is very compelling as the lead.\n\nFurthermore, I enjoyed Colin Farrell and Max von Sydow's supporting performances a great deal. Their play their official positions with a stern authority. I think the acting in Minority Report is quite underrated. Even Samantha Morton plays the astonished precognitive Agatha with a curious fear that is always believable. Lastly, Peter Stormare delivers a hilarious cameo role with a fervent madness.\n\nOn the other hand, a few of the smaller roles all feel too campy and simplistic against the excellent main cast. You see odd characters popping up here and there that do not really fit the hyper serious tone of Minority Report.\n\nAdditionally, the run time feels perhaps a half hour too long. You are always engaged in the story until Cruise is offset by some of the weirder side characters who feel like time wasters. Minority Report is approximately 2 and a half hours long, but it feels like 3 hours due to too many extraneous chase scenes and eccentric supporting figures.\n\nOverall, Minority Report is very intriguing with its mystery and investigation. Tom Cruise and Colin Farrell shine. The writing is quite realistic and the futuristic advancements are grounded. Some of the special effects look dated and it is bloated, but Minority Report is a great film.",
            "review_date": "2018-07-04",
            "source": "rt"
        },
        {
            "content": "A Spectacular and intelligent sci-fi movie",
            "review_date": "2018-04-23",
            "source": "rt"
        },
        {
            "content": "Intense and riveting with eye boggling effects, Tom Cruise's performance stands out among the other equally terrific acting.",
            "review_date": "2018-04-18",
            "source": "rt"
        },
        {
            "content": "Great action movie, and what makes it scary is the fact that i could see this world being our future.",
            "review_date": "2018-02-12",
            "source": "rt"
        },
        {
            "content": "one of those ground breaking sci-fi movies, good effects",
            "review_date": "2018-02-10",
            "source": "rt"
        },
        {
            "content": "A very thought-provoking and complex sci-fi action thriller with intense action sequences and compelling questions about freedom of choice.",
            "review_date": "2018-02-09",
            "source": "rt"
        },
        {
            "content": "Finally a clever film with Tom Cruise. There are not many of them. For me he will alway be the cocky guy mixing cocktails, but once in a while he ends up to do some good movie, and this is one of them. A very clever story. To watch!",
            "review_date": "2018-01-29",
            "source": "rt"
        },
        {
            "content": "Great performances, Perfect visual style and appealing suspense were just good enough to save this movie from disaster. Cheesy action scenes, several plot holes and a few characters/dialogues that make little to no sense at all. This movie draws from the pre cognition/\"tempering with the future\" trope but offer no explanation to how it works, being really shallow on the subject. With a little more effort, this could have been a masterpiece.",
            "review_date": "2018-01-15",
            "source": "rt"
        },
        {
            "content": "Great movie with a very unique storyline.  Tom Cruise shines as the lead with a remarkable performance.",
            "review_date": "2018-01-10",
            "source": "rt"
        },
        {
            "content": "One of my top 10 sci fi films. The story is so good, screen writing and directing is superb and this is by far the best Tom Cruise film...Don't hate me Top Gun fans but this is a Must See for any true sci fi fans out there!",
            "review_date": "2018-01-01",
            "source": "rt"
        },
        {
            "content": "This is a really, really suspenseful and tense film. The action is great, the cinematography is great and the plot is awesome.The VFX are fantastic for 2002. Definitely one of the best Spielberg films.",
            "review_date": "2017-12-31",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 7.0\n\nUna poderosa historia que llama a la reflexión, con memorables personajes y una producción tan propia de Steven Spielberg.",
            "review_date": "2017-12-19",
            "source": "rt"
        },
        {
            "content": "A good neo-noir science fiction film... !!!",
            "review_date": "2017-12-10",
            "source": "rt"
        },
        {
            "content": "Very exciting for the first hour and a half, but a weak finish knocked down the film a couple of notches to B+ from what could have been an A\nThe ending should have been rewritten. Too bad.",
            "review_date": "2017-10-16",
            "source": "rt"
        },
        {
            "content": "Based upon Phillip K. Dick's short story, Minority Report combines Steven Spielberg's already singular signature in science-fiction, along Tom Cruise appealing presence and a great casting, all in favor for a highly imaginative, smartly written and visually gorgeous sci-fi, and one of the director's best works from the early 2000's.",
            "review_date": "2017-09-03",
            "source": "rt"
        },
        {
            "content": "Minority Report is very well directed by Steven Spielberg and Tom Cruise does a great job playing a futuristic pre-crime stopper! The story is good and is well written. The special and visual effects are spectacular and make the movie great for the time it's set in. This sci-fi thriller is exciting throughout and will always leave you wondering what's next. The movie gives you a real thrill and is fun to watch!",
            "review_date": "2017-08-26",
            "source": "rt"
        },
        {
            "content": "An old movie but it doesn't seem out of date at all.",
            "review_date": "2017-08-10",
            "source": "rt"
        },
        {
            "content": "I never get bored by this film even if I've seen it so many times. The plot is thrilling until the end, and what I really appreciate are expecially all of the ironic cuts inserted by the director Spielberg, giving the scenes a particular nice touch even in what appear to be difficoult or tense situations.",
            "review_date": "2017-07-06",
            "source": "rt"
        },
        {
            "content": "Minority Report is a package of science fiction, crime and neo-noir which brings a classical style to a futuristic tale.",
            "review_date": "2017-07-03",
            "source": "rt"
        },
        {
            "content": "A mediocre flick...you won't miss anything if you don't seek it..",
            "review_date": "2017-06-09",
            "source": "rt"
        },
        {
            "content": "Tom Cruise and Steven Spielberg were both great choises to feature in one of the best futuristic sci-fis of the 21st Century. Even though it has some weird moments and the chemistry between Cruise and his wife not always works, \"MInority Report\" is a suspensul, trigging and interesting study of tecnology, crime and the human nature.",
            "review_date": "2017-06-09",
            "source": "rt"
        },
        {
            "content": "Great film, clever and relevant central idea. Maybe a bit long but worth the effort.",
            "review_date": "2017-06-05",
            "source": "rt"
        },
        {
            "content": "A sometimes overlooked futuristic noir-thriller from Speilberg which is based on the short story by Phillip K Dick. A detective who works for an agency where murders are prevented before they are commited is himself, framed and must prove his innocence. Great plot, cast, direction and viewed today in this rapidly evolving techno-world, it's only the more prescient. For me it's up there with some of the most thought-provoking science fiction movies.",
            "review_date": "2017-05-17",
            "source": "rt"
        },
        {
            "content": "It's good but a lot of annoying, bad filming...its kinda of an interesting mess with a fairly good script, Tom's looks are a main focus as his face is focused on a lot...he can pull off a leading man in action, almost up to par with Harrison Ford. Speildberg did an ok job, lots of innovatíon, very unique points. But others too absurd and staged as if it was unnatural and fake as plastic, to the point its annoying and unpleasant. It captivates your attention and you do want to know the outcome along with its handsome hero, Tom.",
            "review_date": "2017-05-07",
            "source": "rt"
        },
        {
            "content": "With a strong, impressive, idea-driven plot and intense action, Minority Report is both a mature exercise in storytelling, and a very entertaining action movie.",
            "review_date": "2017-04-08",
            "source": "rt"
        },
        {
            "content": "MINORITY REPORT was overall pretty good. Some parts were brutal or confusing, but it was a really good idea. Really good.",
            "review_date": "2017-03-13",
            "source": "rt"
        },
        {
            "content": "Interesting thriller!",
            "review_date": "2017-03-03",
            "source": "rt"
        },
        {
            "content": "Brilliant, this film is proof of Spielberg's greatness if you ever need some.",
            "review_date": "2017-03-02",
            "source": "rt"
        },
        {
            "content": "A sometimes overlooked futuristic noir-thriller from Speilberg which is based on the short story by Phillip K Dick. A detective who works for an agency where murders are prevented before they are commited is himself, framed and must prove his innocence. Great plot, cast, direction and viewed today in this rapidly evolving techno-world, it's only the more prescient. For me it's up there with some of the most thought-provoking science fiction movies.",
            "review_date": "2017-02-04",
            "source": "rt"
        },
        {
            "content": "Minority Report is an action-packed futuristic sci fi thriller directed by Steven Spielberg and starring Tom Cruise.\n\nIt's set in a futuristic 2054, with a lot of futuristic technology, some of which is already here. We already have thermal scanners and the early stages of biometric scanners.\n\nOne of the prime themes in Minority Report is precognition. Three Precogs are kept floating in a little pool in a state of sleep, milked for their nightmares of actual murders. An enterprising guy contrived to use the Precogs, like animals, and the PreCrime Unit was created. PreCrime detection has brought the murder rate in Washington DC to about 0, a phenomenal success. \n\nNow, someone from the Attorney General's office is looking into it, with the possibility of expanding the system nationwide, which I don't see how would work since the PreCogs can only sense murders in a 200 mile radius, right? And there are only 3 of them, so in order to expand it nationwide, you'd need to create more PreCogs by giving more pregnant women the drugs that caused it, which we find out is fatal for nearly all children born this way. Dilemmas which they don't really get into in this.\n\nDetective John Anderton, whose own son was murdered before the PreCrime system went into effect, works relentlessly as a member of the PreCrime Team to stop murders before they happen. When this supposedly failproof murder detection system says that Anderton himself is going to commit a murder, Anderton goes on the run and tries to figure out what is going on and why. He is in a race against time and a race against getting caught. It doesn't help that almost everywhere he goes, scanning technologies identify him.\n\nWith all the action and suspense, it's easy to overlook multiple characters who seemed to be strangely odd, possibly sexually deviant. For example, the guy who takes care of the PreCogs. He seems to especially like Agatha. And the surgeon and his naughty nurse who change out Anderton's eyes? Wow.",
            "review_date": "2017-01-05",
            "source": "rt"
        },
        {
            "content": "A empty sci fi movie. Finally completed it after many attempts. 7 stars is an over-rating, mostly for the attempt at a complex story.",
            "review_date": "2017-01-02",
            "source": "rt"
        },
        {
            "content": "If it wasn't so long, it would have been a 4.  There was a lot of cool action and some interesting ideas.  I enjoyed it but any movie at that length can never hold my attention.",
            "review_date": "2016-12-28",
            "source": "rt"
        },
        {
            "content": "Excellent from beginning to end!",
            "review_date": "2016-12-08",
            "source": "rt"
        },
        {
            "content": "A great twisted score fiction film.",
            "review_date": "2016-12-05",
            "source": "rt"
        },
        {
            "content": "Really good movie for anybody into future movies. There is one scene where they spend to much time on action. It's slow in some scenes but is still pretty good.",
            "review_date": "2016-10-28",
            "source": "rt"
        },
        {
            "content": "\"Minority Report\" is the 2002 thriller sci-fi film directed by Steven Spielberg (\"Close Encounters of the Third Kind\") and written by Scott Frank and Jon Cohen, it is loosely based on the 1956 short story written by Philip K. Dick. The film is set in the year 2054, in Washington D.C. D.C's PreCrime police stops crimes before they happen, reducing the murder rate to zero. They are able to predict the felonies throughout the \"Precogs\", modified humans capable of having visions of future crimes. At PreCrime, the Precogs reveal a prediction saying that the chief of PreCrime's police, John Anderton (Tom Cruise), is going to murder an unknown man. John flees the building and goes on a mission to find answers regarding the crime he will supposedly commit, all while running from Precrime's police.\n\n As we live and see all of this recycling in Hollywood, where studios just do the same superhero movie one after the other, and great Sci-fi thrillers are either forgot due to its little advertisement or simply overshadowed by the bigger studio names like Marvel and DC or it's own remakes, it is refreshing to see such an original fun piece (which was a success), that still feels great even after a second watch. Someone who watches lots of films can tell you how hard it is to find films like \"Minority Report\", a movie with a plot so original and done so well, so goddamn well, that gives you hope... It reminded much of 2012's \"Looper\", a similar sensation popped up, but a think I was the happiest with \"Looper\", because it was 2012, you know... so that means that even tough these truly original (Sci-fi or not) type of films only come up from time to time it is nice to know that they will probably keep on coming, and hopefully at a faster rate.\n\nAside from its originality, probably the best thing about this film is its production, it's a beautiful film, great scenery, awesome special effects and CGI that still hold up and is not overused. The film's script is smart and even funny at times, with no cliches and some great scenes and dialogue. The film's shots and camera work too are great, doing amazing short single-shot sequences that enhance the film's action, along with great fighting scenes that thrill. But, tough great, the film is not flawless, if there is one complaint it would be Spielberg's humongous overuse of white freaking light. Holy fu**, I'm am not kidding, the use of white in this film is unbelievable, it is SO distracting, I do not understand what was the purpose, I don't know, I  really don't. But yeah, this is probably the biggest problem, it can be really distracting, but the movies exciting plot will probably make you forget about it. Another small disappointment for me was John William's score, it was not bad, I thick, because I couldn't pretty much hear it, it wasn't too noticeable, an odd thing to say to about a John Williams score.\n\nThe film's acting is also great with Tom Cruise playing another one of his \"Ethan Hunt\" type of characters, but... this one is quite different. John, Cruise's character, is \"Ethan Huntish\" in a way that he is an awesome fighter that knows all these skills and stuff, but he is a very broken character. There has happened lots of different tragedies in John's life, and that has changed him, all of this give's much more depth to a character that could've easily be just a lazy crafted movie spy, but filmmakers create a very good relatable character that is very much well developed. Cruise's performance is great, as said, the character is really relatable and the movie's hero, cruise's undatable charm and great acting chops help to create a great lead man to this fine film. Besides Cruise, there is a number of character, tough most of em' appear only for some few scenes. Colin Farrel is ok as the sneaky cop that wants to bring PreCrime down and John with it. Also beside Cruise is Samantha Morton, the talented actress does fine, unfortunately only appearing too little and only in the films final act. Amongst other names are Max von Sydow, Neal McDonough, and Kathryn Morris, all giving fine performances.\n\nIn the end \"Minority Report\" is a fun, smart, entertaining, weel-directed and well-acted film that, as said, gives us hope for a future with more original high budget sci-fi dramas that honor the genre. 4/5.",
            "review_date": "2016-10-21",
            "source": "rt"
        },
        {
            "content": "A movie Donald Trump believes is true and should not be in the sci-fi section.  Donald Trump thinks he too can prevent crimes of thought beforehand by lone-wolves.  Donal Trump is delusional.  You don't have to be.",
            "review_date": "2016-09-19",
            "source": "rt"
        },
        {
            "content": "Really great premise, not surprising coming from the mind that brought us Blade Runner, but to have this premise in the hands of the mastermind Steven Spielberg was a good choice. There isn't really a dull moment in the whole film, some slow parts sure but not useless, there are some great character development moments as well as some great action sequences. For a 2002 movie, this has some great special effects as well.",
            "review_date": "2016-09-08",
            "source": "rt"
        },
        {
            "content": "One of the best sci-fi movie ever. Minority Report is 3 movies compiled in one, an action/sci-fi/thriller. One of the smartest blockbusters I've ever seen watched.",
            "review_date": "2016-08-15",
            "source": "rt"
        },
        {
            "content": "Minority Report is a movie directed by Stephen Spielberg and stars Tom Cruise, if you weren't already interested, this movie is amazing. This film showcases another great movie based off of a Phillip K Dick novel and is the best one since Blade Runner. This also shows Tom Cruise's best performace until Collateral two years later. Spielberg did incredible work with this movie and in 2002, was his best movie since Saving Private Ryan. Solid Awesometacular.",
            "review_date": "2016-08-14",
            "source": "rt"
        },
        {
            "content": "A brilliant scifi idea which is presented well at the beginning of the film but as it goes on it starts to become a dragging film which lasts too long.",
            "review_date": "2016-08-12",
            "source": "rt"
        },
        {
            "content": "Minority Report is directed by Steven Spielberg, and it stars Tom Cruise, Colin Farrell, Samantha Morton, and Max Von Sydow in a cyberpunk action mystery adaptation of The Minority Report by Philip K. Dick about the Chief of PreCrime, which is  a department where the police goes to get the criminals from actually doing something bad in the future based on 3 psychics, and when it showed the chief's vision of when he murders someone, John Anderton (Tom Cruise) runs away from PreCrime and he tries to prove his innocence as he doesn't know the person that he is going to kill in a day or 2. I was pretty excited to see this again as I've seen this and liked it, but it had been years ago, and I wanted to go back to this. So after going to rent it and see it, Minority Report is one of the most inventive films that I've seen from Steven Spielberg's career. Tom Cruise did a fantastic job in this that I think it's one of his best performance. The special effects look amazing to this day, and it brings the world they created some life to it, even some of the effects that they created are actually used as actual things in the recent times. The writing by Scott Frank and Jon Cohen is very well written that brought in a lot of thought provoking moments. The action scenes are a lot of fun to watch, and the characters are very three-dimensional, especially since the main hero isn't perfect as he has done stuff that are not good. I know people have a problem with the ending being inconsistent to the overall film, and I'll admit it does look and feel different from the film, I was honestly fine with it, and some theories on it, made it seem that it was intended to be that way to be faithful to the adaptation that people might not realize. Minority Report is a fantastic film that it is one of Steven Spielberg's best films.",
            "review_date": "2016-08-05",
            "source": "rt"
        },
        {
            "content": "Wow - amazing production and story though felt like it should have ended unhappily.  Could a pre-crime unit stop random acts of terrorism we see today? That might be the only way.",
            "review_date": "2016-07-29",
            "source": "rt"
        },
        {
            "content": "A fantastic and intense sci-fi thriller",
            "review_date": "2016-07-23",
            "source": "rt"
        },
        {
            "content": "The best-case scenario marriage of good screenwriting, direction, special effects, pacing, and - yes, Mr. Cruise - acting.",
            "review_date": "2016-07-17",
            "source": "rt"
        },
        {
            "content": "The story is interesting at the beginning but turns into a simple chase movie. It is hard to follow the dialogue which is important because many important story arcs are revealed through dialogue. The acting is standard acting for this type of movie. Overall it's a good chase movie.",
            "review_date": "2016-07-15",
            "source": "rt"
        },
        {
            "content": "Although intense and smart, Minority Report ultimately looks kinda cheap.",
            "review_date": "2016-07-10",
            "source": "rt"
        },
        {
            "content": "Yes another Spielberg masterpiece",
            "review_date": "2016-07-05",
            "source": "rt"
        },
        {
            "content": "Tom cruise is a great actor but the plot to this movie is a little strange",
            "review_date": "2016-06-17",
            "source": "rt"
        },
        {
            "content": "Never lacking suspense and always suprising",
            "review_date": "2016-05-31",
            "source": "rt"
        },
        {
            "content": "Meh. Maybe it just doesn't hold up anymore, but I found Minority Report to be just meh. Some of the CGI and action sequences are dreadfully bad. The story is interesting but somewhat confusing and I can think of a few plot holes. Cruise gives a typical Cruise performance. All in all, I wasn't blown away by this.",
            "review_date": "2016-05-11",
            "source": "rt"
        },
        {
            "content": "One of the most complex and mind ending plots I have seen. A great film with decent action and effects that still hold up well today. More films today should be like this.",
            "review_date": "2016-05-09",
            "source": "rt"
        },
        {
            "content": "\"Minority Report\" marks another peak in the career of both director Steven Spielberg and actor Tom Cruise.",
            "review_date": "2016-04-27",
            "source": "rt"
        },
        {
            "content": "idk I was really anxious to seeing it after years, but it didn't pass the test of time. It definitely is worth watching just won't be anything wonderful.",
            "review_date": "2016-04-14",
            "source": "rt"
        },
        {
            "content": "the most pretentious and predictable movie i've ever seen\nand whoever wrote that score deserves a nail in their head",
            "review_date": "2016-04-13",
            "source": "rt"
        },
        {
            "content": "Visually deigned to be impressive, in 2016 it's rubbish almost laughable. The story is weak, predictable and boring. acting is average, Remove the special effects and you got nothing left.",
            "review_date": "2016-04-08",
            "source": "rt"
        },
        {
            "content": "Thought provoking and incredibly complex, Minority Report is a great movie lead by a great performance by Tom Cruise",
            "review_date": "2016-03-28",
            "source": "rt"
        },
        {
            "content": "Minority Report is a movie with a good story, great action scenes and is a great thriller movie. Despite all of that, it does get slow once in awhile.",
            "review_date": "2016-03-28",
            "source": "rt"
        },
        {
            "content": "Painfully underrated.",
            "review_date": "2016-03-23",
            "source": "rt"
        },
        {
            "content": "The film did well overall, but it is not as smart and as promising as many have claimed it to be.",
            "review_date": "2016-03-18",
            "source": "rt"
        },
        {
            "content": "Minority Report is a bit too long and can at times seem inconsistent in its pacing. That being said, Tom Cruise delivers as always, and a strong supporting cast help to make this Spielberg Sci-Fi worth taking a look at.",
            "review_date": "2016-03-11",
            "source": "rt"
        },
        {
            "content": "Gave it 55 minutes, but it turned into more shoot-em-up car-chase James Bondish nonsense. Next.",
            "review_date": "2016-03-10",
            "source": "rt"
        },
        {
            "content": "Although I imagine the book could be better, Steven Spielberg' s Minority Report with Tom Cruise as the main character actually works so well. I have to say I am never a big fan of Tom Cruise but this deserves to be one of his personal best works. There are so many layers of this movie one can peel off and to think over all the moral issues brought up in the story.\n\nIt then reminds me of Blade Runner.",
            "review_date": "2016-03-06",
            "source": "rt"
        },
        {
            "content": "A fantastic Spielberg film that blends original ideas from the future with real life problems. I think over time this could be seen as one of the greats as it is well acted, brilliantly directed with enough twists and turns to blow anyone's mind. I would put this in Spielberg's top 10 best films.",
            "review_date": "2016-02-23",
            "source": "rt"
        },
        {
            "content": "Minority Report is definitely one of Spielberg's best with very thought provoking scenes, thrilling sequences and having sci-fi elements that are ahead of its time.",
            "review_date": "2016-02-13",
            "source": "rt"
        },
        {
            "content": "Tom Cruise tem boa atuação e corre nesse ótimo thriller, com boa direção de Steven Spielberg.",
            "review_date": "2016-02-11",
            "source": "rt"
        },
        {
            "content": "Easily one of Steven Spielbergs best works, in my eyes an absolute masterpiece.",
            "review_date": "2016-02-05",
            "source": "rt"
        },
        {
            "content": "Great film that can be enjoyed over and over again.   A couple action sequences get a bit corny, but that is a very small brown spot on an otherwise shiny apple.",
            "review_date": "2016-01-31",
            "source": "rt"
        },
        {
            "content": "Excellent, thought provoking, and exhilarating.",
            "review_date": "2016-01-16",
            "source": "rt"
        },
        {
            "content": "A slightly over-acted spectacle that challenges its audience to deliver thrills and fittingly epic action sequences with Tom Cruise at the helm.",
            "review_date": "2015-11-27",
            "source": "rt"
        },
        {
            "content": "The advance technology where force of people who could foresee the future of crime and succeed in stopping it happen, this resulting in preventing the crime rate and dropping the case files to the drastic low level making city free from dark crimes, whether such wonderful imagination would become practically possible in reality or not but the story with such an amazing concept would rock the screen and defiantly has all the potentiality of giving a good sci-fi thrills.\n\n2002 release ''Minority Report'' is a sci-fi masterpiece that narrates a story set in a near future surrounding around the character John Anderton where he is supposed to tackle various hurdles to get himself clean which leads to unravel the bitter dirty truth of some higher conspiracy, a movie with such a sophisticated plot would have just ruined if it wasn't handled perfectly, but when the master director Steven Spielberg is a person behind the work then anyone could expect the well crafted and beautifully presented movie in front of you, his directorial mastery is seen as the movie builds up and could see beauty in every bit of frame, when a perfect syncing actor joins this team then there is a miracle happening, Tom Cruise is made for John Anderton's character.\n\nBeautiful camera work, precise editing and stunning VFX with those typical Hollywood sci-fi background tracks it serves as the best presentation by the best team.",
            "review_date": "2015-11-18",
            "source": "rt"
        },
        {
            "content": "A good and interesting Spielberg film, with good lighting on stage and organization. It is advisable.",
            "review_date": "2015-11-14",
            "source": "rt"
        },
        {
            "content": "Immensely mind-bending plot.",
            "review_date": "2015-11-13",
            "source": "rt"
        },
        {
            "content": "A great sci-fi flick directed by arguably the most influential director in our generation.Great, fast pacing, wonderfully acted by Tom Cruise, and A-Class action sequences. I wished this movie had more suspense and was disappointed that the were less action scenes going towards the end of the movie, since this movie seemed marketed as a sci-fi action film. But still a must watch for any movie goers today.",
            "review_date": "2015-11-11",
            "source": "rt"
        },
        {
            "content": "Minority Report is a very exciting movie filled with amazing action, great visuals, awesome acting from a great cast and an interesting plot line. The only issue I have with this movie is the title.\nNevertheless \"Minority Report\" is a fun action movie and I give it a 8.5/10/",
            "review_date": "2015-11-04",
            "source": "rt"
        },
        {
            "content": "A superb film packed with exceptional, pulse-pounding action, great performances and a gripping screenplay. The writing is excellent and very original, the characters are well realised and the tension never lets up for too long. An amazing action film like no other, unforgettable, mesmerizing and most of all, the world that is created is very realistic, which is a great factor seeing as it's set in the future and could easily have been contrived. A perfectly constructed and acted action movie- absolutely gets an A* from me.",
            "review_date": "2015-10-25",
            "source": "rt"
        },
        {
            "content": "Visually stunning, well-acted, well made, and action-packed, Minority Report is an unforgettable and underrated sci-fi movie and is one of Spielberg's best films.",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "Spielberg showing that he can do it all. This is a great sci-fi action film. It is actually Spielberg's most underrated film. It has good acting, great characters, a great plot, and a very thought provoking underlying message. The visual effects still look great today.",
            "review_date": "2015-10-15",
            "source": "rt"
        },
        {
            "content": "Minority Report is constantly impressive on it's action setpieces, while still managing to catch viewers attention with it's intriguing concept. With Tom Cruise's performance and Steven Spielbergs direction being as great as can be expected, this is a Sci-Fi crime thriller unlike any other.",
            "review_date": "2015-10-14",
            "source": "rt"
        },
        {
            "content": "Fun sci fi movie, shades of David Lynch, set in a future where PreCogs can see murders before they can take place, and cops can arrest them beforehand! A cop gets the murder nod though, the cop doesnt know who this guy is that he's supposed to kill. Fun and inspired, (If not a tad bit long).",
            "review_date": "2015-10-13",
            "source": "rt"
        },
        {
            "content": "Perhaps somewhat problematic in certain areas, but overall very thought-provoking, well-acted, beautifully crafted film by legendary filmmaker Steven Spielberg.",
            "review_date": "2015-09-30",
            "source": "rt"
        },
        {
            "content": "Even as it winds down,\"Minority Report\" is never without intelligent, original, and involving ideas.",
            "review_date": "2015-09-09",
            "source": "rt"
        },
        {
            "content": "A little clunky, OK a lot clunky but still just enough of merit to keep you on side.  Spielberg never quite has the conviction to go full dystopian nightmare though and in staying safe at times this feels more like a standard Cruiser action vehicle than an intelligent SciFi and as a result you don't find yourself exploring any of the emotional depths.  Morton is really good though.",
            "review_date": "2015-08-31",
            "source": "rt"
        },
        {
            "content": "Oh my gosh! This is one Steven Spielberg’s best movies here, not to mention one of Tom Cruise’s. The movie’s Asthetic seems to be inspired by other Sci-fi movies such Blade Runner, and The Matrix. Also the story about the Pre Crime Project is very intriguing and makes for a good story for Mr. Cruise’s Main Character Policeman, to be involved in. ",
            "review_date": "2015-08-20",
            "source": "rt"
        },
        {
            "content": "More violent than I remembered, but made much more sense the second time through.  not as much like person of interest like I remembered.  I'm excited to see the TV series this fall!",
            "review_date": "2015-08-12",
            "source": "rt"
        },
        {
            "content": "Well, this is one damn great movie! From the moment the first scene starts I felt hooked. The way the movie looks is really amazing. It's got this greyish filter and for a science fiction movie, it fits in perfectly!  The effects are awesome, the movie looks great even by today's standards. The story is very intriguing. It reminded me a lot of Looper, I guess that's where Looper writers got the idea from. There are some really interesting plot twists along the way, some you never see coming. The characters are interesting and some are quite likeable. I don't think there's any character who was annoying or just badly written throughout the entire movie. The acting is great. Tom Cruise is great as John Anderton, even though I am not a big fan of him and some of his movies. All in all, a very interesting movie with great acting, a brilliant story and a really beautiful feel to it. I would deffinetely recommend seeing this movie!",
            "review_date": "2015-07-20",
            "source": "rt"
        },
        {
            "content": "classic sci-fi movie. great story, lots of cool scenes. very creative and innovative. some really cool action scenes. but what stands out above the rest are 1) the premise and the way it was executed and 2) the story. very clever. (about 4 viewings)",
            "review_date": "2015-07-02",
            "source": "rt"
        },
        {
            "content": "Well conceived and fast paced thriller.....good but should have been great.",
            "review_date": "2015-06-26",
            "source": "rt"
        },
        {
            "content": "Cruise is great, but the action is too sparse, the film is filtered through a disengaging palette, and the idea feels stale today.",
            "review_date": "2015-06-23",
            "source": "rt"
        },
        {
            "content": "What if at its best!",
            "review_date": "2015-06-18",
            "source": "rt"
        },
        {
            "content": "A smart, stylish, and thought-provoking neo-noir Sci-Fi thriller brilliantly directed by the one and only Steven Spielberg. The masterclass filmmaker combines brisk action and intelligence, and spices them all up with layers and layers of murder mystery. The result is one of the most inventive and entertaining sci-fi thrillers of the millennium. Minority Report is full of visceral thrills, ideas and creativity that you won't be able to resist. Really good fun.",
            "review_date": "2015-06-15",
            "source": "rt"
        },
        {
            "content": "Something's missing.",
            "review_date": "2015-06-13",
            "source": "rt"
        },
        {
            "content": "5.7/10 — \"Mediocre\"/\"Passable\"",
            "review_date": "2015-06-10",
            "source": "rt"
        },
        {
            "content": "Exactly what you expect from a Spielberg film. Beautiful, complex, and just in all, very close to perfect. Spielberg has created one of the best science fiction films since his very own Jurassic Park.",
            "review_date": "2015-06-06",
            "source": "rt"
        },
        {
            "content": "Definitely one of the better sci-fi films since the turn of the century. Cruise does a great job and Spielberg's direction was superb. The dark tone and tension made this movie stand tall in this modern sci-fi film. 8.0/10",
            "review_date": "2015-06-03",
            "source": "rt"
        },
        {
            "content": "Tremendous! Steven Spielberg's Minority Report bursts with originality and has OUTSTANDING special effects. I loved every minute of it.",
            "review_date": "2015-06-02",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg makes another visually stunning and clever storyline and also an awesome casting choice,  Tom Cruise.  My favorite actor nails it again.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "A clever idea lead by a great performance by Tom Cruise. I barely knew anything about this film before I watched it and I'm glad I didn't. The main plot point is given away in the trailer but I didn't know it which gave me the great shock value and excitement watching this without knowing much. Minority Report is an exciting sci fi flick with a new idea that is executed well. If you don't know much about this or haven't seen a trailer I recommend you go in blind.",
            "review_date": "2015-05-27",
            "source": "rt"
        },
        {
            "content": "Minority report is a terrific fun filled with amazing effects and terrific acting and story. I really liked this movie it was very original and directed efficiently by Steven Spielberg. The major flaw here is the length they should've trimmed it down a bit. Overall Minority report is a terrific film that is for sure worth a watch.\nGrade A-",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "The two decades preceding Minority Report have been a crucial transitional phase for Hollywood legend, Steven Spielberg; a treasure of the industry with such remarkable and timeless features like Raiders of the Lost Ark, Jaws, E.T. The Extra-Terrestrial and Close Encounters of the Third Kind, taking on extraordinary stories that places its audience in an escaping position, providing the heightened essence of cinema's purity. The Color Purple was the necessary seed that has grown within the filmmaker that would lead him to tackling a humanistic through the most inspiring of tales, one that opens our eyes to our faults and successes throughout history.\n\nMinority Report however takes on a similar ground but this time predicting of what would become of our society; a political drama of 2054 Washington D.C., where the invention and testing of PreCrime have proven successful in the war against homicide, finally creating the secure environment that the government have craved for. The predictions of these crimes are generated from the visions that are formed, and harnessed, by the PreCrime unit and is analysed in finding the necessary clues for its prevention. A premise that manages to display originality, even by the standards of today, that seeing it for the first time is like a breath of fresh air; transporting you to a world that evokes familiarity and innovation that detail in exposition needs not to be heavy to gain understanding.\n\nSpielberg takes on the idea and further emphasises its necessity that requires reflection towards our own conditions; the necessity to morally challenge its government for an innovation that is either contradictory or ambiguous; the undeniable growth and personalisation of consumerism; challenging the concept of fate and its potential diversion through the power of wisdom. Given Spielberg's track record, this could have simply been a replication of Raiders of the Lost Ark on a far more technical and awe-inspiring platform and transport its audience with every breathtaking set-piece. Thankfully, much like Jurassic Park, he has merged the adventure sensibilities of his youth and the thoughtful mindset in his slow transition, leaving the audience with a rewarding experience.\n\nHowever in his attempt to balance both approaches, it is far from the measured and impactful outcome of Jurassic Park; Minority Report finds itself far too stretched from its two sensibilities, with transitions coming off as far too palpable. Along with this, it arrives at a third act that creates a far too calm transition to its resolution that cushions the impact that the film could have provided if it managed to retain the same sense of encapsulating urgency and tension that filled the veins of its first two acts.\n\nMuch like Blade Runner, the film carries a sense of glory in its depiction of technological progression, whilst filling the atmosphere with dire and serious themes. The director dedicates its first 40 minutes as an exhaustive introduction of its world, its social and technological updates, and the key figures that fill it. Spielberg's film has always welcomed the concept of product placement, but unlike many filmmakers (Michael Bay, in particular); it weaves commerciality with narrative progression seamlessly, acting as a necessary element in the shaping of its world.\n\nSince their collaboration in Schindler's List, Janusz Kaminski and Spielberg have developed a strong and understanding relationship; with their films since their initial partnership have taken on a far more stylistic attitude than any of his previous films, excepting the collaborations with Douglas Slocombe. Minority Report screams out in its slick camera movements and noir-inspired lighting that fits perfectly the gritty profession and the tragic personal history of its protagonist. Although difficult to say if this is Kaminski's strongest effort, but it is no doubt an impressive one, and is a large contribution to the film's overall appeal.\n\nSpielberg's 20th feature may be ambitious and technically proficient, but it lacks the desperation of a young filmmaker that places their inner soul with each captured shot; there is a sense of comfort to be found in his direction that may have relied too heavily on the film's screenplay and fruitful experience with computer generated visual effects in its construction. Minority Report may no doubt grow its reputation as years pass and more of its reflective ideas become relevant, but for now it is simply a pleasing entry into Spielberg's prolific filmography.",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "It seems to me when ever a movie is based on a SHORT story it leaves something to be desired. The stunning visuals do not make up for this tired cliched mess that goes exactly where you think it should in the first five minutes. Sadly predictable and well too long. Also it seems the happy ending was added after it was screened.",
            "review_date": "2015-05-01",
            "source": "rt"
        },
        {
            "content": "Amazingly good film.",
            "review_date": "2015-04-15",
            "source": "rt"
        },
        {
            "content": "Stellar sci-fi film with some of the best visual effects in the early 2000s.",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "So much cool future tech! Jetpacks, sick sticks, cars that stick to walls, eye scanners, and touchscreens (which sort of now exist!). An overall engaging storyline as well, with tinges of ethical quandries. Very fun, and action packed!\nWatched with Sam at her parents place ( house sitting ), March 21, 2015.",
            "review_date": "2015-04-02",
            "source": "rt"
        },
        {
            "content": "Spielberg reminds us why is he is one of the best -- if not the best -- director working with visually fantastic, action-packed, smart, Minority Report. Tom Cruise is giving one of his best performances as the pain killer addicted former father who lost his son. Best sequence is the the scene where the spiders are crawling through the apartment complexes in that one-shot that would get the /r/movies circlejerk going for a good couple hours.",
            "review_date": "2015-03-29",
            "source": "rt"
        },
        {
            "content": "A superb sci-fi mystery thriller, \"Minority Report\" is true to Spielberg's adventurous style while making something of itself out of its dark and complex dystopian (or utopian?) premise. \n\nBased on a short story by Phillip K. Dick, \"Minority Report\" is set in a future where all murders are predicted by a group of physics called \"the precogs\", and so there is virtually no crime. Tom Cruise plays John Anderton, the chief of the so-called \"PreCrime\" task force, and so he's the guy who goes to future murderers' houses and arrests them before they get the chance to kill their intended victim. Of course, there's a twist, and soon enough Anderton is on the run (seriously, Tom Cruise runs in every movie) because the precogs have supposedly predicted that he will murder a guy he's never even heard of in just 36 hours. It's up to him to figure out if he was set up or if, in fact, he is going to be a future murderer, and there are many twists and turns along the way that have us on our toes. \n\nPerhaps the most spectacular aspect of Minority Report outside of the exciting story is the cinematography, excellent as always by Spielberg regular Janusz Kami?ski. The camera glides smoothly through each shot in a mix of quickly-paced long takes and well-framed still shots that creates an enticing mix of adrenaline and awe that keeps us entertained and interested throughout the heavy 2 hour, 25 minute running time. \n\nIf I have one criticism it's that the music, by John Williams as usual, isn't all that inspired and is at times even distracting. Spielberg hatas will probably not be impressed, either, because it's filled to the brim with his signature pacing, humor, and Indiana-Jones-like set pieces. But for anyone else (i.e. most people who like movies since Spielberg is pretty much synonymous with movies), \"Minority Report\" is an endlessly enjoyable ride that gets you thinking about Phillip K. Dick's eye-opening themes of predetermination and character without taking you out of the story for one minute.",
            "review_date": "2015-03-28",
            "source": "rt"
        },
        {
            "content": "The defining sci-fi flick.",
            "review_date": "2015-03-28",
            "source": "rt"
        },
        {
            "content": "Mind blowing sci-fi action packed epic from the great Steven Spielberg!",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "Was expecting something better",
            "review_date": "2015-03-22",
            "source": "rt"
        },
        {
            "content": "This is how science fiction should be.  I love most of  Phillip K Dick stories adapted to movies.",
            "review_date": "2015-02-16",
            "source": "rt"
        },
        {
            "content": "It's exciting and at times silly, but on the whole works. Spielberg doesn't hit you in the feels quite as much as usual, but he puts together another engaging film and one of the better adaptations of Philip K. Dick's work.",
            "review_date": "2015-02-15",
            "source": "rt"
        },
        {
            "content": "A great film that was beyond its time and set up the future of special effects in film. Spielberg does an outstanding job at creating this futuristic society with unbelievable technology. Cinematography is excellent. Acting is good. Its the storyline that propels the film forward with great themes. It makes the viewer think and also wonder if the future is set in stone or if we can make a difference.",
            "review_date": "2015-02-08",
            "source": "rt"
        },
        {
            "content": "\"Minority Report\" has a smart, futuristic take on the crime drama genre but is a bit too long to keep you onboard all the way through.",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "Minority Report is an extremely well crafted science fiction thriller but ultimately doesn't offer much to the genre or the viewer. Spielberg's style is painfully predictable and the humor breaks seem forced and manufactured. The world is impressive but also highly derivative, drawing on the earlier in the year Star Wars Episode II as well as a host of other films. The entire car factory chase scene is so reminiscent of dozens of films before it that it ruins the entertainment of the scene completely. The film is well acted but each character represents a common cliche and their actions are just as predictable, with no true distinguished performance. Ultimately, Minority Report comes off like A.I. as both are films that would have been better suited to Kubrick or Scott, as the stark, dystopian futures and broad philosophical implications just don't jive with Spielberg's personal, intimate filming approach, which is altogether too warm and fuzzy for the situation.",
            "review_date": "2015-02-05",
            "source": "rt"
        },
        {
            "content": "based on my fave sci fi writer PK Dick",
            "review_date": "2015-02-05",
            "source": "rt"
        },
        {
            "content": "The story is a tough one to crack but the way that Spielberg brings it to us is unforgettable. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "Hay películas que vuelves a visionarlas después de años y se vuelven tus favoritas, esta es una de ellas.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "Good action steven Spielberg movie starring Tom cruise. It's not the best classic steven Spielberg but a new take and is pretty successful, I think he pulled it off. But first let's talk about Tom cruise. He is good and entertaining, his character is good and you get to feel how he feels. If I didn't tell you that this a steven Spielberg film you would be shocked, that's how I felt when I found out that he directed the movie. Yes it is boring in the middle but the ending and that Tom was in a little house in the middle of nowhere was confusing because what the fudge happened but I think he was in the house the whole tune.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "A great Sci-fi film with wonderful directing and acting.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "A thriller that looks at what society could turn into if we keep up with the stereotypes around crimes and the people who commit them",
            "review_date": "2015-01-02",
            "source": "rt"
        },
        {
            "content": "While all around entertaining it sometimes went over the top with its action and became hokey. It was also quite predictable and just like most other action movies.",
            "review_date": "2014-12-10",
            "source": "rt"
        },
        {
            "content": "Intelligently written with a unique dystopian and utopian depth of world created around it, it stands out in a field of dull explosion flicks by cleverly adapting to cliches and subverting expectations to create an action film that goes much deeper than you think.",
            "review_date": "2014-12-06",
            "source": "rt"
        },
        {
            "content": "even though i didn't like the ending so much i love the movie anyway.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "Spielberg blew my mind on a regular basis for the duration of the film!",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "One of the sci-fi greats!",
            "review_date": "2014-11-28",
            "source": "rt"
        },
        {
            "content": "Was actually really entertaining and good.",
            "review_date": "2014-11-27",
            "source": "rt"
        },
        {
            "content": "Artificial and resourceful, Minority Report is a glowing thriller with a rampaging lead by Tom Cruise.",
            "review_date": "2014-11-27",
            "source": "rt"
        },
        {
            "content": "Based on a Phillip K. Dick story and directed by Steven Spielberg, Minority Report teamed  up a great writer with a great director.\n\nThe premise in Minority Report is really original. As usual with Phillip K. Dick, there is a really interesting science fiction concept at the base of the film. It discusses the nature of fate and the future in a complex science fiction setting where the concept of predicting the future is used to prevent crimes before they actually happen, a concept known as determinism. This gives the film a strong base for its tale of herosim as the protagonist of a story which presents the oppurtunity for a compelling thriller story and a strong action adventure. It has the potential to be both, and with directorial work from Steven Spielberg it successfully becomes both. Minority Report succeeds as an interesting science fiction tale and a strong action adventure, even though the fact that it diverts between both means that it is inconsistent in tone and also in pace. \nMinority Report truly is a complex science fiction film, for better and for worse. On the slightly negative side of it, the film goes between scenes with a mix of both explanations of its internal logic which is straight up and to the point and others which stretch out for much longer and slow the pace of the film down quite a bit. I expected as much from a film with such a complex high concept plot, but there just ended up being a few periods of time where things just stretched on for a while. Minority Report is a long film with an interesting central presence, and there is a lot to take in. Steven Spielberg ensures that there is adequate time for viewers to understand everything, but at the same time he ends up rendering the film a long and slow one. It evokes a mixed response because it decreases the full effect of exhileration in the film, but as a whole it does allow viewers to gain an appropriate understanding of all the concepts. As a whole, Minority Report succeeds more as a science fiction thriller than an action film, but it does have some strongly choreographed stunts. The action scenes in Minority Report are great because they capitalise on all the strong visual elements of the film and explore the creativity of the universe well, capitalising on all kinds of advanced technology and weaponry to tell its story.\nMinority Report presents a lot of interesting technology as a manner of asserting the scientific future of the film. The design of the world is great because it is futuristic without ignoring the sensibilities of being set in a not-too-distant future which makes it a believable one, and the main theme of the story also reinforces that by exploring a world where governmental use of scientific experimentation paves the way for a breakthrough anti-crime force which gives defence forces control over the future. It is a clever element of totalarian power which is way more subtle than in countless other futuristic films because it is not so much dystopian although in small parts it touches upon the idea. The story is interesting because it starts out as a simple tale with a complex concept, and as the story progresses it becomes more and more complicated. There is a progressively large amount of information to handle, but what starts out as a high concept plot evolves into one which is more imaginative and original than I could have predicted which pays a lot of credibility to the legacy of the late Phillip K. Dick as well as to \tScott Frank and Jeff Cohen who bring the story to life with a lot of intelligent dialogue and spirit. The one flaw I find in the story comes from the title. The title \"Minority Report\" refers to a moment when two pre-cogs predict the same vision of the future but the third and strongest of them predicts a different vision of the future. As this vision does not coincide with the majority, it is considered to be a titular Minority Report. It is suspected that the vision of the protagonist committing a crime is incorrect because there is said to be an unseen Minority Report which predicts him to be innocent. But one of the twists in the story is that there is not one for him, and so the fact that the film is titled Minority Report when it is simply one of the most minor elements of the film with little relevance to Captain John Anderton. The concept of a Minority Report is not taken advantage of in a film which is named after it, so that's where some unsatisfactory storytelling comes into play. Still, as a whole, Steven Spielberg brings his sophisticated wisdom as a filmmaker to Minority Report and steps back into the science fiction world once again with the same inspiration to deliver. One of the more intense moments in the film where Captain John Anderton hides himself underwater in an ice cold bathtup while robots search for him is an element that would later be repeated by Steven Spielberg on his following collaboration with Tom Cruise, War of the Worlds.\nMinority Report is the first truly notable science fiction neo-noir since the masterful classic Blade Runner which similarly was also based on a Phillip K. Dick story. While the visueal style of the film feels largely familiar for science fiction films, Minority Report incures a grim colour pallette which taints the film with a sense of shadow and darkness, and it reflects the intended universe of the film very nicely. It makes everything look good, and considering that the scenery and production design of the film is already rich with life, it just adds to it. Minority Report benefits from strong production design, powerful visual effects which are moderated nicely so that the film is not overreliant on them. Everything looks good which means that Minority Report works as both a large scale science fiction tale and a small scale neo-noir at the same time, even if it doesn't capitalise on its neo-noir potential or live up to the standard of Blade Runner. \nIt didn't take long until I  realised that the musical score of Minority Report could have only been composed by the legendary John Williams. The music is intense and mysterious with a true science fiction feel which evokes some memories to much of his earlier works, even to the greatest work of his career on Star Wars. John Williams teams up with Franz Schubert to create another wonderful musical score for Minority Report, and it gives the film the ideal atmosphere and lays down the effect of it all very well.\nBut when the film gets to the end, that is when it falters. The ending to the film is a little to uplifting for its own good. After all the complex turmoil, political corruption and violence that has occured in the film, for Minority Report to turn around and give itself what is essentially a fairy tale ending, it just isn't consistent with the complex and twisted dramatic nature of the rest of the feature. Minority Report is a film that tries to be both science fiction and character focused, but the ending to the film gives an unsatisfactory resolution to some of its main characters. A lot of the film feels like some of the character elements are just a mere distraction from the central focus of the film, and the fact that the ending to the film gave everything an overly optimistic finale.\nThe cast of Minority Report manage to bring strong characters to the feature as well.\nTom Cruise makes a charismatic lead in Minority Report. He combines both a level of professional confidence and humanity into the part so that the focus on his personal demons and his determination is found. His leading charisma is powerful because unlike in War of the Worlds, Steven Spielberg was able to direct Tom Cruise to a well balanced performance. As an amalgamation of both a realistic human being and a professional defence force worker, Tom Cruise carries the charisma of both an action hero and a professional dragged into a complicated situation without going over the top about it, enforcing a sensible level of realism to anchor his efforts.\nMax Von Sydow makes a memorable effort in Minority Report. Being one of the world's greatest living actors, Max Von Sydow has an undying legacy of wisdom to him which he easily emits in Minority Report. He delivers all of his lines with a strong understanding of the subject matter which flows from the most intelligent reaches of his mind very organically without a moment of failure. His screen time is small, but memorable because he stands out as one of the strongest cast members in the film. Steven Spielberg is able to get some of the best out of Max Von Sydow, and you can expect nothing less from him.\nColin Farrell does a nice job. His character is intriguing due to the unpredictable nature of him and because Colin Farrell brings a very confident sophistication to the part. He stands strong in the role with a very convincing level of understanding and fearlessness. He deals with the material with a strong level of professional charisma without ever losing sight of his character's intentions ensuring that he is very consistent in the part. Colin Farrell is strong in Minority Report and his interactions with the surrounding cast members boast some strong chemistry.\nLastly, Samantha Morton delivers a strong supporting effort as Agatha Lively. She has a weird part to play as a Pre-cog, but she remainsi adamantly convincing in the part simply because she fits the profile for the part physically and due to the fact that she conveys a lot of mental stress and paranoia due to scientific experimentation that led to her creation. Samantha Morton is very physically involved in the role easily, and her line delivery is perfectly warped for the part.\n\nSo although Minority Report has minor narrative flaws and inconsistent focus with pacing, it is a very original science fiction thriller which is both intelligent and visually stellar.",
            "review_date": "2014-11-21",
            "source": "rt"
        },
        {
            "content": "Minority Report is a bit of a science fiction who dunnit.  The interesting thing here was seeing Tom Cruise and Colin Farrell on the screen at the same time.  You could feel the egos oozing through the screen - which actually made the tension between their characters somewhat compelling.",
            "review_date": "2014-11-13",
            "source": "rt"
        },
        {
            "content": "It's soft sci-fi that leans a bit too close to a generic action movie for my taste.",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "Minority Report probably isn't the first movie that jumps to mind when the name \"Steven Spielberg\" enters into a conversation, but it's got the director's stamp all over it. It's slick, very well made, purposeful beyond its action veneer and layers of special effects, and rather epic in scope and feel, all of which make it a first-class Science Fiction piece and perhaps even one of the more underrated pictures in the Spielberg canon. Arguably his best film in the post-Saving Private Ryan era, Minority Report's ability to so easily combine a wonderfully deep and complex philosophical undertone with amazing action and impeccable special effects makes it a shining example of Science Fiction moviemaking done right, and this is must-see cinema for those that like to engage their brain while also enjoying the exciting world of modern filmmaking techniques and special effects.",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "A highly entertaining movie with some brilliant ideas and special effects",
            "review_date": "2014-10-21",
            "source": "rt"
        },
        {
            "content": "End of the movie needs work, but great sci-fi thriller.",
            "review_date": "2014-10-15",
            "source": "rt"
        },
        {
            "content": "Featuring consistently visually stunning camerawork and the best writing ever, Minority Report is a magnificent, intense, and emotional ride.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "Really good movie, entertaining, a lot of action, I highly recommend it, one of the best movies I've ever seen.",
            "review_date": "2014-09-22",
            "source": "rt"
        },
        {
            "content": "I love Max Von Sydow and like Colin Farrell but I hate Tom Cruise; and though the ideas are interesting the way they are explored is not. It's a well-thought out rendering of the future and the actual filmmaking is strong and there are some fun sequences but it becomes something of a chore to sit through in the final act.",
            "review_date": "2014-09-15",
            "source": "rt"
        },
        {
            "content": "After seeing this movie for the first time since it was initially released in 2002, I feel it comes out on top with a certain originality compared to most sci-fi films these days. Surprised I hadn't seen it sooner.",
            "review_date": "2014-09-05",
            "source": "rt"
        },
        {
            "content": "An enjoyable ride throughout the film.",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "A complex film that makes you appreciate it after a second thought. A cool looking film that is enjoyable despite its blantant product placement and tough storyline to understand.",
            "review_date": "2014-09-01",
            "source": "rt"
        },
        {
            "content": "Futuristic dystopian and mythological dilemma. Becoming a classic in our new securitarian society.",
            "review_date": "2014-08-29",
            "source": "rt"
        },
        {
            "content": "Love tom cruise but this ones not for me",
            "review_date": "2014-08-23",
            "source": "rt"
        },
        {
            "content": "\"Minority Report is a dazzling and mind-bending action thriller from Steven Spielberg, even though this is an unusual film for him. Tom Cruise gives it his all. Its entertaining, but pay close attention or you'll be lost.\"",
            "review_date": "2014-08-21",
            "source": "rt"
        },
        {
            "content": "A very stylish and entertaining thriller.",
            "review_date": "2014-08-18",
            "source": "rt"
        },
        {
            "content": "One of my favorite Tom Cruise movies, one of the most unique ideas for a mystery thriller I've seen, and I always find it just as exciting every time I watch it. Great acting all around, and great directing as always from Steven Spielberg. I've always thought Tom Cruise works best with Sci-fi, and this is the perfect example of that. The movie also has some really cool sci-fi ideas about the future.\n\nPersonal Grade: S+\nTechnical Score: 90%",
            "review_date": "2014-08-14",
            "source": "rt"
        },
        {
            "content": "Tom Cruise gets a lot more good movies than some people give him credit for.",
            "review_date": "2014-08-11",
            "source": "rt"
        },
        {
            "content": "Inventive and exciting, with some gnawing logic flaws.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "Awesome and original",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "This is a film I have heard people rave about my entire life. And now after finally seeing it twelve years later in 2014 I can honestly say it lives up to the hype. This is early 2000's sci-fi at its best. It's no surprise this film turned out as great with Spielberg at the helm. But what really impressed me was the story and its intriguing complex and futuristic style. Minority Report is thought provoking, action packed, smart and enjoyable. 4.5/5",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "okay, when i saw the trailor for this movie i thought i would really like it and also, the rotten tomatoes for it is really good, and they are usaully pretty reliable. but when i go and see it, you know, i'm hooked by the beginning with this whole pre crime thing, but as they get farther into the movie, i just got less and less interested. first of all, whole headband thing, and the political guy going after anderson like it's personal even though they just met and the 'fighting while machinery is building something' is so from star wars, and i just think it felt kinda cheesy in this movie. and small detail, not really, THERE IS NOOO WAY JOHN COULD HAVE SAT UP IN THAT CAR AFTER THE FREAKING SEATS WERE WELDED OVER HIM> THERE IS ABSILUTLY NOOO WAY. just that. also they whole, mentally disabled kids can tell when some one is going to get murdered before it happens, is kinda far fetched. sorry. but the idea was cool, don't get me wrong, but i just dont think that this film deserves a 91% when i couldn't stand to watch it twice. i have to say, this deffently a only-watch-once film.",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "Quite good indeed\nI was a little skeptical at first, due to poor cgi and generic story. But at about the half way mark, things really picked up as the story got a major twist as the plot thickened",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "Fantastic. 9.3/10. A.\n\n\nBoth smart, thought-provoking sci-fi and edge-of-your-seat, fun action are fantastically combined in the script and the direction. The score is powerful and the movie is a thrill ride from beginning to end.",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "This kicked off a series of Tom Cruise action movies that I have actually really enjoyed considering I have never been a huge fan of his. I think the concept here is interesting and the action/fight sequences are intense.",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "Minority Report wowed me. Not only is this a thrilling movie, I couldn't stop watching it. The main character is given surprising depth, and the emotional scenes in the film really worked. The visuals are stunning, and the plot is intriguing. This movie also makes you think about society and what is right. The plot twists range from predictable to completely surprising. This is such an original, thought provoking thriller that floored me, Spielberg has once again created a smart blockbuster. If I had any complaints, it would be that it may run a tad long, and the end seems to just be wrapped up a little too conveniently. Minority Report gets 4/5 stars (A-).",
            "review_date": "2014-07-08",
            "source": "rt"
        },
        {
            "content": "What a shame! Minority Report starts out with a cool premise, but it doesn't know how to explore its philosophy and ideas. The movie ends up turning into a kind of peculiar, non-sensical utopia with product placement and strange plot lines. Some of the movie is just so random it doesn't make an impact. Cruise, Farrell and von Sidow are fine as the leads, but they're trapped in a movie that Mr. Spielberg could've done much more with.",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "(Sorry for my bad english) The best mix between science fiction / thriller and inventiveness. Pre-crime is incredibly thought-provoking and Spielberg knows how to handle the tension and wit for more than an hour. The plot centers on a rare glitch in the visions of the Pre-Cogs. Although \"the Pre-Cogs are never wrong,\" we're told, \"sometimes ... they disagree.\"Of course, if you could outsmart the Pre-Cog system, you would have committed the perfect crime... by the way, Tom Cruise is an example of how a star's power can be used to add more dimension to a character than the screenplay might supply.",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "The future of authority",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "A very sharp, clever and engaging science fiction movie. Steven Spielberg yet again king of the blockbusters.",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "The coolest and my favorite movie by Spielberg. It has all of his director traits but it's better. Derived from a story by Phillip K Dick, the movie strives towards the idea of it which makes the movie a whole lot of better. You have Tom cruise who is great as always and a couple supporting characters who are good as well including Max Von Sydow and Colin Farell who also do fine. Just the plot and ideas are so interesting and the movie embraces them, making it savvy and more self aware. It overall felt like a sci-fi filmnoir flick which was done very well.",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "Although I'm not a huge fan of Tom Cruise, it's undeniable to say that he didn't provide a solid lead character to this Spielberg sci-fi. The movie sells the pitch that all murders can be prevented from a company Cruise heads as captain. Interesting premise, interesting characters and spectacular special effects make this movie work out as well as it does. A weaker entry compared to Spielberg's other masterful movies, but still is a pleasant film viewing.",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "Beautiful.....that is all",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "One of the best of o-two and just a plain great movie. I love these hidden gems from weird years like O2, it's tough to make a good movie in a crap year like 2002.",
            "review_date": "2014-06-10",
            "source": "rt"
        },
        {
            "content": "This is amazing. Two words: Tom Cruise.",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "A truly great science fiction film and one of the best.",
            "review_date": "2014-06-05",
            "source": "rt"
        },
        {
            "content": "A very sharp, clever and engaging science fiction movie. Steven Spielberg yet again king of the blockbusters.",
            "review_date": "2014-06-04",
            "source": "rt"
        },
        {
            "content": "If there's one genre that intrigues me the most, it's easily sci-fi. Whether its the depictions of futuristic societies or technological advances or the intriguing ideas presented, I just really enjoy this film genre. And Minority Report, one of the many films directed by one of my all-time favorite filmmakers, Steven Spielberg, is easily on the list of most intriguing sci-fi in the past decade.\n\nSet in the year 2054, John Anderton (Tom Cruise) is a Washington DC detective who works for the special unit of Precrime, a unit that arrests murderers before actually committing the crime, saving many lives in the process. The process takes place via \"precogs\", three drugged psychics who specialize in prophesying future events. John's reputation becomes challenges when he is identified as the future killer of a man he never met. With his job on the line, John becomes a fugitive as he races against the clock to prevent his possible crime.\n\nThe film also stars Collin Farrell as Precrime pursuer Danny, Samantha Morton as pregog leader Agatha, Lois Smith as the mysterious Dr. Iris Hineman, and Max von Sydow as Precrime director Lamar Burgess.\n\nThe thing I respect the most out of the greatest filmmakers is when they step out of their comfort zone. Spielberg uses this format in making Minority Report. Had I not looed at who made the film, I wouldn't have guessed Spielberg made the movie as it's different in style than regular Spielberg greats. And because of that, Minority Report is another excellent Spielberg film that joins the list of some of his all-time best.  \n\nThe first thing Spielberg gets right is creating the futuristic world of 2054. Spielberg decided to go the realism route and use as minimum of CGI as possible, and his decision is extremely brilliant. Visually Minority Report is a sight to behold, and the idea of arresting possible killers before committing their crime is an exciting (and sometimes scary) thought. With all the technological advances being a huge boom in society and hearing reports of tighter security in the country (an idea heavily questioned also in this year's Captain America: The Winter Soldier), the ideas presented in Minority Report might end up happening. Whether it will or not, Spielberg has created a thought-provoking futuristic look at our society if we continue on our current path. And Spielberg is a complete genius.\n\nAnother thing Spielberg provides really well in the film is how entertaining the film is. Considering its thought-provoking material that raises lots of questions, like with some of the best doses of Spielberg greatness, action plays a big part of Minority Report, and while some of the beatings and punches get a tad ridiculous, it's still extremely fun to watch. It also helps that you got Tom Cruise as your lead star of the film.\n\nSpielberg also succeeds in creating a thrilling modern suspense thriller on top of the thought-provoking sci-fi ideas and elaborate action. Well, when the film involves a man going all out to beat a possible corrupt system, you have to be on the edge of nail biting. There was quite a few plot twists in the film I didn't see coming, and that is definitely something to be proud of. \n\nCarrying out the greatness of Minority Report by far is it's fantastic acting performance of Tom Cruise. In the opening scenes of the film, I thought Cruise's character was just going to be this extremely bland action hero with absolutely no character development, but I have not been so wrong in early judgments in my life! Cruise nails his complex nature and creates a character that feels absolutely real. As he lost his son due to a murder crime (which caused him to join Precrime), the character of John has to overcome inner demons to get out of his situation. The story arc of facing inner demons is one of my favorites in a motion picture, and though it sounds extremely clichéd for me to say that, usually I enjoy films dealing with that problem, and Tom Cruise nails it.\n\nWhile the rest of the cast is overshadowed by Cruise's performance, particularly Colin Farrell, who basically a one-dimensional \"antagonist\", I quite enjoyed their screen presence. The one closest to being as strong as Cruise is Max von Sydow as the suspicious Precrime director, with a performance that's as brilliantly awesome as Robert Redford in the recent Captain America movie! Can't wait to see Sydow appear in the new Star Wars movie.\n\nLike the majority of Spielberg's works, the film is scored by legend John Williams, and like always, Williams' score is beast! Similar to Spielberg's unique structure of the film, Williams uses that to his advantage, creating a very intense and another unforgettable music experience that's as intense as the scores of Bernard Herrmann! \n\nIt's certainly not perfect, as it has the occasional plot-holes (such as Tom Cruise managing to get past security headquarters while being pursued by federal agents), but Minority Report joins the list of unforgettable Spielberg. The sci-fi ideas of mind control and predicting the future is thought-provoking, the action and suspense are extremely intense and pulse-pounding, and Tom Cruise gives a truly magnificent performance. I wouldn't call myself a nerd of Minority Report, but I can say that I was extremely immersed with another great work from Spielberg.\n\n\"You see the dilemma, don't you? If you don't kill me, Precogs were wrong and Precrime is over. If you do kill me, you go away, but it proves the system works. Precogs were right. So, what are you gonna do now? What's it worth? Just one more murder.\"",
            "review_date": "2014-05-20",
            "source": "rt"
        },
        {
            "content": "Awesome! Speilberg never disapoints apart from indiana jones 4 but this movie is a great speilberg movie and tom cruise is just awesome",
            "review_date": "2014-05-20",
            "source": "rt"
        },
        {
            "content": "What do you know another Tom Cruise classic, this is a brilliant idea for a movie an original plot about people getting arrested for crimes they commit in the future is genius, I can't stress enough how good this movie is.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "A spine tingling sci-fi brilliant with intriguing story. Steven Spielberg's masterfully film is outstanding throughout the end. And it may be overfull with modern technology, Spielberg never fails to do what is really required: How do you tell the story without it being banal and confusing. Terrific work!",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "Surprisingly underrated in Spielberg's filmography, Minority Report is engaging, thought-provoking and visceral, and features an excellent performance from Tom Cruise.",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "A highly entertaining, fast paced, sci-fi thriller with an intriguing plot and interesting characters. One of Spielberg's finest!",
            "review_date": "2014-04-26",
            "source": "rt"
        },
        {
            "content": "Not only the worst film Spielberg's made and likely will ever make, this monstrosity may be the most incoherent, illogical, and insulting piece of fiction I've ever seen put on film.",
            "review_date": "2014-04-23",
            "source": "rt"
        },
        {
            "content": "With a clever story, stunning sci-fi visuals, and direction from the great Steven Spielberg....MINORITY REPORT is Tom Cruise's best movie with an amazing supporting role from Colin Farrell!!!!",
            "review_date": "2014-04-22",
            "source": "rt"
        },
        {
            "content": "My favorite movie!! Love the plot.",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "Spielberg's finest take on science fiction since \"E.T.\" and \"Close Encounters\".",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "Awesome... and I'm usually not in awe of Steven Spielberg...",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "Great concept that was executed well.",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "Minority Report is an intelligent sci-fi thriller with a unique visual style and interesting themes like free will, determinism and broken families.",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "Amazing, played video game first then learned of this brilliant movie.",
            "review_date": "2014-03-25",
            "source": "rt"
        },
        {
            "content": "Interesting futuristic movie. Runs a little long for the content.",
            "review_date": "2014-03-24",
            "source": "rt"
        },
        {
            "content": "Awesome film! Amazing! I dont know how I missed this one back then",
            "review_date": "2014-03-24",
            "source": "rt"
        },
        {
            "content": "In writing, a few lines of dialogue are emotionally amiss. Otherwise stellar performances crawl all over this polished gem of a film. Gorgeous special effects, but the claustrophobic sets and framing kill the chance for many moments of amazing photography. Any head-scratching questions about the kooky premise get brutally sidelined by the complexity of the story and the intriguing mystery plot. It's actually worth watching a few times.",
            "review_date": "2014-03-24",
            "source": "rt"
        },
        {
            "content": "A brilliant and unprecedented sci-fi thriller.",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "Minority Report, while not Spielberg's best film, is still a fun ride and a very clever science fiction film. The visuals in the film are incredible, and Tom Cruise gives his all, as usual.",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "Personally, while I found the idea of Minority Report to be intriguing, I wasn't really a fan of this movie. The pacing and the plot was very uneven, and added details to the story that really didn't need to be added. First and foremost, I can't see Tom Cruise in this role. The man in the book is nearing retirement, here it doesn't even appear as though he has reached thirty. There is nothing about a dead son nor is there much focus on the pre-cog Agatha. The need to tell three stories at once was really boring, I just wish they would have kept the focus on John and not the rest of the cast. Visually it's somewhat nice to look at, but it didn't save the production for me.",
            "review_date": "2014-03-14",
            "source": "rt"
        },
        {
            "content": "Astonishing special-effects, incredible story, marvelous directing and perfect acting. Makes this film one of the best sci fi movies ever. Cruise and Spielberg never let up.",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "Easily one of the best Sci-Fi films of the decade. Cruise is magnetic and there is a suspenseful wonder to the world portrayed.",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "Take away the handful of nonsensical chase scenes, and you have an intriguing and compelling sci-fi detective movie.",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "A rip roaring rollicking adventure with brains and heart. Cruise is fantastic and if you leave without pondering a few big questions then, frankly, there's no hope for you.",
            "review_date": "2014-02-25",
            "source": "rt"
        },
        {
            "content": "One of Tom Cruise's best film.",
            "review_date": "2014-02-24",
            "source": "rt"
        },
        {
            "content": "It is nice to see Steven Speilberg come out of his shell and make a much more mature Sci-fi movie. Speilberg's look at Philip K. Dick's world is beyond cool. Tom Cruise also does a great job in this movie as well. The action and plot can also be credited because of how original and high-octane it was. Minority Report is a movie where I think that Speilberg can finally resurface in the turn of the century. Like Total Recall, Blade Runner, and even A Scanner Darkly, this Philip K. Dick adaptation turns out to be a great movie. This is definitely Speilberg's most underrated film.",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "The more you watch it the more you start to question the world we live in now and how it can change for the right and wrong reasons. Well cast, directed and edge of your seat action.",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "Great film with a great script, great idea",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "Cool Flick. Great cast and script. Love",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "Minority Report is a visual engaging, electrifying sci-fi thriller from legendary director Steven Spielberg and one of the genres most thought provoking. The story plays out superbly and the elements of fiction are represented well with a smart climax and realistic themes. A true modern science fiction classic and another great outing from Cruise and Spielberg.",
            "review_date": "2014-01-30",
            "source": "rt"
        },
        {
            "content": "one of the best science fiction films I've ever seen. not your average action film.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "Pretty good but not the masterpiece people say it is. B+",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "The dialogue goes between generic, expositional and just plain bad. Otherwise, this is one of Spielberg's more inventive and thrilling films, presenting a super cool sci-fi vision (personalized ads, self-driving cars, flexible video screens) and a twisting mystery that is always one step ahead of the audience. A futuristic Mission: Impossible...in fact, let's give Spielberg a shot at that series!",
            "review_date": "2014-01-12",
            "source": "rt"
        },
        {
            "content": "5/5 * \nAn action film that's boosted by ideas rather than coincidences. Minority Report delivers adrenaline rush action and compelling storytelling that showcases as one of Steven Spielberg's best.",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "This film can be classed as a libertarian flick because of its focus on three themes that are of general importance to libertarians: individual free will, the danger of allowing the security state to erode away one's civil liberties, and the right to not be enslaved.  As...\n\nRead the full review here: http://alexpeak.com/art/films/mr/",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "One of the best and most unique SciFi action films I've seen, though it suffers from a few Spielberg cliches he manages to keep them to a minimum to make a (mostly) dark and phenomenal action flick",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "Certainly one of my favourite Spielberg films. This is an ingenious and original sci-fi filled with dark, heart-pounding and intense events, and an indelible performance from Tom Cruise.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Setting aside the blight cynicism that comes with not only this particular film, but also every forthcoming project that will feature Cruise, I'd really forgotten how great this movie still is. Spielberg's efforts here continually ascertains how speculative sci-fi is supposed to be used, only told within the mindset of a film noir--ala \"Blade Runner.\"",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "Unquestionably THE best sci-fi movie I've ever seen, my personal favorite! Masterpiece",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "Almost good, but not quite.",
            "review_date": "2013-12-21",
            "source": "rt"
        },
        {
            "content": "A creative and clever movie, although sometimes a little too shovel happy in digging a grave for itself. Minority Report is an exciting Sci-Fi with a not-to-predictable storyline. Despite a substantial plot hole or two it is enjoyable entertainment that questions the reality of free will.",
            "review_date": "2013-12-13",
            "source": "rt"
        },
        {
            "content": "Minority Report is a highly thought provoking film with just enough spark and awesome science fiction thrills .",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "A highly intelligent and imaginative film.",
            "review_date": "2013-12-10",
            "source": "rt"
        },
        {
            "content": "Spielberg and Cruise hit a home run w a futuristic thriller.   In this society there are pre cogs who read the future.   Their goal is getting to the crime before it happens. Murders are at an all time low and Cruise leads the charge.  When Cruise sees himself committing a murder that he has no knowledge of why he would committ a crime or who the victim was , he finds himself on the run doing whatever he has to to survive.   A great thriller with an extremely unique premise and an even better sense of unpredictability.   Great movie.",
            "review_date": "2013-12-02",
            "source": "rt"
        },
        {
            "content": "Wow, what another incredible constructed masterpiece by Steven Spielberg!!  The movie was intense, extremely interesting, edgy, action-packed, and engaging!!  It will have you chained to your seat the whole way and hold your interest for the nearly 2 1/2 hours it plays out!!  This is another proof of evidence that Steven Spielberg is one of the greatest directors of all-time!!  The cast was perfect!!  Tom Cruise stole the show, which is no surprise!!  This is absolutely very much a must-see!!",
            "review_date": "2013-11-29",
            "source": "rt"
        },
        {
            "content": "Puppet tom plays a detective (shocking, I know) but the sci-fi was enough to win me over.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "Repeat watch for me...",
            "review_date": "2013-11-27",
            "source": "rt"
        },
        {
            "content": "best all around sci fi movie i have ever seen go figure the master has done it again.  the special effects speak for themselves. but where spielberg excells is in the development of all characters even the creepy doctor(peter storemare perfectly casted) who replaces peoples eyeballs so the cant be identified by futurisctic retnal scanners.",
            "review_date": "2013-11-20",
            "source": "rt"
        },
        {
            "content": "It isn't Spielberg's best work and it's first and last halves are lacking in entertainment. But thanks to a strong performance by Tom Cruise and a fantastic middle half, Minority Report manages to be a creative but flawed sci-fi thriller",
            "review_date": "2013-11-18",
            "source": "rt"
        },
        {
            "content": "One of my faves. An oldie but a goodie!",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "best movie cruise has been in",
            "review_date": "2013-11-05",
            "source": "rt"
        },
        {
            "content": "Amazing theme, Visual and story. But   theres a lot of holes in it And they could have turned ending into much better, But Still, Amazing piece of work. Worth watching",
            "review_date": "2013-11-05",
            "source": "rt"
        },
        {
            "content": "A wonderful story and a fantastic piece of science fiction that has held up perfectly over time. A perfect balance of mystery and thriller. In fact its 'future' is probably as realistic and correct as any future that has been shown in movies. I guess we'll find out eventually and when we do this movie will still be loved.",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "A basterdization of the original short story that betrays the whole point of said source material. The whole point of the short story is that you cannot stop time and what happens in the future is inevitable. The point is that he did kill this person he is accused of and wasn't set up. Spielberg ruins this by adding another 45 minutes of stuff justifying that Cruise's character is the hero. Like a lot of Spielberg's films around that time, it's riddled with unnecessary humor, too much exposition, and a clear point where the film should end but continues for another 30 minutes. Add to that THE WORST MOVIE ENDING IN HISTORY! Not only that, there's stupid character actions throughout (see the Peter Stormare character helping him). Lastly, Phillip K. Dick stories do not have happy endings!",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "Spielberg lacks the filmic nuance required for this type of science fiction.",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "Minority Report asks a fascinating question. If it were possible to catch a murderer before he or she committed the crime - did they still commit a crime? The year is 2054 and through the use of three special psychics called 'Precogs', law enforcement officers are provided glimpses of a murder before it actually occurs. With the information they gather they are then dispatched to prevent the crime from happening. The intent to kill though is still a crime, and even though the murder was stopped, the would be killer is still hauled away by the police. The system is tested though when one of its strongest supporters, John Anderton (Tom Cruise) starts to investigate a Precog vision that labels him as the killer.\n\nThe central question is covered very well in Spielberg's film. Tom Cruise delivers a powerful performance as the talented, yet troubled Pre-crime detective. He's also very ably supported by Colin Farrell as a Department of Justice stooge, and Samatha Morton as the most talented Precog, Agatha. What impressed me the most about this film was the technology on display. Everything the characters touched and interacted with seemed really well researched and completely plausible. From the 3D home projector system, to the large screen the detectives control with hand gestures when investigating Precog visions. There was nothing in this film that seemed to far fetched or over the top, and that attention to detail created a great foundation to properly explore the stories central theme.\n\nFull review - movie prep - best format - best moment -> http://talkiegazette.com/minority-report-2002/",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "A pesar de Tom Cruise... me encanta esta peli...",
            "review_date": "2013-10-27",
            "source": "rt"
        },
        {
            "content": "First time I saw this movie, it was very fresh. The idea of movie which is prevent crimes were very unique in that time, and nobody were thought people going to make this topic into movie. When i watched first time, every scene has suspense and trill. Never know what's going to be happen and twisted ending at the end was just amazing. Not only that\nIt describes the future city really well. Eye scanner machine in the subway, tiny micro robots observe sewage and car commercial on the screen in the mall shows futuristic idea very well.",
            "review_date": "2013-10-21",
            "source": "rt"
        },
        {
            "content": "Awesome Sci-fi. One of Tom Cruise best films.",
            "review_date": "2013-10-19",
            "source": "rt"
        },
        {
            "content": "Spielberg's masterful directing and Cruise's Oscar-worthy performance has given us one of the best sci-fi flicks ever to hit a screen! It's the sole definition of why us moviegoers pay money to see films in the first place!",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "A great film. One of my favs. I'm not a Cruise fan, but you've got to appreciate his acting and ability to often pick just the right vehicle. This film is exceptional because it stays away from the majority of derived sci-fi dystopia themes and is intriguing with considerable action, twists and turns, along with visually stunning cinematography. The acting is superb, Farrell, Morton, and Sydow especially. The plot is enticing and unpredictable keeping one glued to the seat. I enjoyed it so much I had to see it several times, wishing each time I hadn't seen it before to be just as shocked and awed as the first time. Bravo!",
            "review_date": "2013-10-06",
            "source": "rt"
        },
        {
            "content": "Wasn't very impressed by this.",
            "review_date": "2013-10-01",
            "source": "rt"
        },
        {
            "content": "Haunting, visually striking, and well-acted, Minority Report is another Spielberg masterpiece.",
            "review_date": "2013-09-29",
            "source": "rt"
        },
        {
            "content": "Sometimes a movie succeeds based on a creative premise alone... this is one of those cases.",
            "review_date": "2013-09-29",
            "source": "rt"
        },
        {
            "content": "One of the best Spielberg film I have ever seen! Awesome sci-fi action flick based on the Philip K. Dick novel. Everything is done with talent in it's incredibly intelligent, well directed, well acted film. This is high class entertainment from a team of really good people.",
            "review_date": "2013-09-28",
            "source": "rt"
        },
        {
            "content": "Great film to watch, cool visuals too!",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "another Philip k Dick adaptation. (bladerunner, total recall etc)",
            "review_date": "2013-09-19",
            "source": "rt"
        },
        {
            "content": "A very interesting plot and definitely some debatable issues in it. Recommended for criminology students.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg's 'Minority Report' is a smart and original technical achievement.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "My favorite Spielberg movie.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "Science fiction directed by Steven Spielberg is just what I needed to make my day.",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "I really like this movie. Tom Cruise's character is really good in this movie and you feel bad for him because of his depressing back story. The story is also very complex, but interesting.",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "Full review coming soon.",
            "review_date": "2013-08-28",
            "source": "rt"
        },
        {
            "content": "an exceptional brilliant film, a total must see",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "Minority Report is a smart sci-fi film that makes you use your head. You don't see many of those today.",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "Dystopian, quasi-Orwellian future with some far-fetched ESP stuff. Go watch Equilibrium instead.",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "Full revised review coming soon",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "Innovative concept and plot, brilliantly executed by the Master of Science Fiction, Steven Spielberg himself. Though the movie has a run-time of 2 hours 20 minutes, with a well-maintained pace and aptly-placed twists, it's constantly gripping. Other than being an intriguing thriller, it does have its heart-warming and awe-inspiring moments.\n\nNot much need of acting here since the plot and special effects are the major attraction, but still, the actors have done a commendable job.\n\nThe futuristic world is well-detailed and fascinating. The plot is well-detailed and complex, and keeps you engaged like an interesting puzzle.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "*****\nTom Cruise stars in this excellent, pulse pounding Science Fiction thriller directed Steven Spielberg. Everything about this film is brilliant. Tom Cruise gives a great performance, the direction from Spielberg is neat, and the story and concept are legitimately thought provoking.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg lo hizo de nuevo. Y Tom Cruise actuó bien, wtf.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "Gotta love the sonic shotgun.",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "Awesome, one of Cruise's best works. An anti-hero, w/a moving past personal life, this is not MI 1, MI 2, or MI 3, not by a long shot. Fantastic, fast paced thriller with a complex story line and a bit different for Cruise.",
            "review_date": "2013-08-01",
            "source": "rt"
        },
        {
            "content": "Sometimes slow but still Minority Report is a thrilling crime sci fi thriller with strong performances by it's cast, visually and tensely directed and well written.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "A thought provoking Sci Fi thriller that asks the question of whether you'd be willing to sacrifice liberty for safety, then shows you the consequences of such actions. A modern science fiction film classic and a great adaptation of Phillip K. Dick. It's gripping, intense, and eye pleasing.",
            "review_date": "2013-07-26",
            "source": "rt"
        },
        {
            "content": "You don't have to chase me. -John",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "This looked and felt like a remake of Total Recall (1990)",
            "review_date": "2013-07-16",
            "source": "rt"
        },
        {
            "content": "Classic. One of my favorites growing up. Tom Cruise delivers",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "B-. I don't like Tom Cruise. He's in good flicks, though. Some of the action was over the top, but what do you do? We take our unrealistic action sequences with our fantastic storylines. Of course, I'm complaining about realism in a movie about \"pre-cogs\" who see into the future, flying cars, etc etc. This likely earns more than the grade I'm handing out, but I can't get past Cruise. I might bump it up for Swedish dialog. OK. B.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "Minority Report is one of the most unique films I've seen. Tom Cruise stars in his role as John Anderton, lead officer in Washington, D.C.'s pre-crime division set in the mid-21st century. \"Pre-crime\" is a concept that revolves around the ability to stop murders before they happen thanks to three \"precogs\" and their ability to see into the future. This is an inherently controversial way to 'solve' crime but is largely accepted because it seems perfect considering that no murders had been committed in the six year experiment. The conflict is introduced when Cruise finds out that he is the next expected murderer. This puts him on the run from the division he once led and on an investigation to find out how he is supposedly going to murder someone he's never met. The action isn't overdone but rather placed well throughout the film. The combat sequences could've been better but they were still enjoyable. A few of the plot points were a little weak also but there weren't actual holes or anything. The acting was solid with Cruise and a supporting cast of Colin Farrell and Max von Sydow among others. The best part of the film, though, was the interesting plot. Even with the few weak parts it's just a very interesting story that develops nicely. Many movies struggle with the concept of the future being predicted but Minority Report does a great job and is very entertaining.",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "Wow.\n\nThis masterfully sleek vision of the future from director Steven Spielberg is an awesome mix of skewed science fiction, twisty Hitchcock-style thrills, stunning blue-grey tinged photography and outstanding design.\n\n- Radio Times",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "A fantastic film, with mindblowing efffects, and extraordinary acting from Cruise, Farrell, and Morton!!!!",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "The year is 2054 and the American Government have set up a specialised police department that can prevent crimes from occurring through visions of the future seen by three gifted human beings known as 'pre-cogs'. I encourage these types of films which encompass a lot of moral issues and invite viewers to enhance their thinking outside the scope of the movie setting. Can a person guilty of a crime they haven't committed? Does putting many future criminals away justify the possibility of innocent people being arrested when visions are wrongfully interpreted? Does a system of saving numerous lives justify imprisoning these innocent 'pre-cogs'? As you can see, there are plenty of ethical/scientific elements regarding free will and determinism which are up for discussion. The ending may draw its own conclusion but it still leaves much for the audience to ponder over. \n\nThe futuristic world they have created is well developed while being grounded in some places so that the fundamental parts of the story can still be related to modern society. Tom Cruise is clearly comfortable with his action man role, having the ability to embody emotion and vulnerability with masculinity and bravery. While recognising his success in of 'Jerry Maguire' and 'Interview with the Vampire', it is becoming harder to imagine anything else he is better suited to. It doesn't require a pre-cog to predict who the antagonist is from the beginning but the villain's reasoning and operation is well concealed which allowed for a very satisfying twist. Minority Report is definitely recommended as it is part of a dying breed of movies which are capable of integrating both action adventure with intelligent fiction.",
            "review_date": "2013-06-20",
            "source": "rt"
        },
        {
            "content": "Set in a futuristic world, an enforcer of a futuristic system of justice which is based on crime prediction find himself on the run after the systems predicts a crime he hasn't committed yet. A unique concept brought to life by Spielberg in a science fiction meets modern noir style that adds a visual and atmospheric depth with Kubrickian elements, a territory which Spielberg had already visited in A.I. Thrilling and exciting, as well as based on a provocative idea which raises issues that could be debated upon, Minority Report is one of those science fiction films which gets less credit than what it may actually deserve.",
            "review_date": "2013-06-17",
            "source": "rt"
        },
        {
            "content": "How fitting in the time and age. Surveillance.....Freaky and spooky, yet decently entertaining.",
            "review_date": "2013-06-15",
            "source": "rt"
        },
        {
            "content": "Spielberg still amazes me. Sci/fi or historical, He seems to pull if off (sometimes) and here he did it pretty well too. Cruise is good as is some of the supporting cast and it's an entertaining fantasy movie about a man who is being somewhat framed. Looked cool.",
            "review_date": "2013-06-14",
            "source": "rt"
        },
        {
            "content": "Minority Report by Steven Spielberg is by now an iconic science-fiction movie for its vision of all the little things that could become part of our daily life.\n\nThe good. Excellent concepts and ideas included in the future we're presented. Nice special effects that still hold well today. Very interesting story. A scenario with a great pace. Captivating intrigue. Solid suspense. Lots of action. Some touching drama. Perfect ending.\n\nThe actors. Tom Cruise is the only actor who's performance is worth mentioning here. The rest of the cast is no more than adequate.\n\nThe bad. No interface would ever require so much body gesture to work. It's a completely ineffective method. Sean's videos do not have the feel of true family home videos, although the 3D effect is well imagined even going as far as including imperfections.\n\nThe ugly. Nothing.\n\nThe result. Excellent sci-fi entertainment for all.",
            "review_date": "2013-06-13",
            "source": "rt"
        },
        {
            "content": "Compared to other Philip K. Dick adaptations, this film is predictable and boring. When compared to your average sci-fi thriller, however, this film really shines",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "I don't like how some of the technology is coming alive now... freaks me out. ~05/2013",
            "review_date": "2013-05-24",
            "source": "rt"
        },
        {
            "content": "Minority has such a great concept and that concept is executed masterfully. Go Spielberg and Team!",
            "review_date": "2013-05-24",
            "source": "rt"
        },
        {
            "content": "It has a nice concept, but It can be too scary and too sad. not to mention hard to follow",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "Brilliant film detailing the dangers of technology in the hands of technocracy - we should never bypass due process.",
            "review_date": "2013-05-19",
            "source": "rt"
        },
        {
            "content": "I thought this was going to be a retarded tom cruise movie. I was wrong. This rivals mission: impossible. Complex plot, futuristic setting, and unexpected twists like at the end make this movie great!",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "One of Tom Cruise's best movies, excellent story & Concepts. \"In the land of the blind, the man with one eye is king.\"",
            "review_date": "2013-05-13",
            "source": "rt"
        },
        {
            "content": "A fantastic futuristic thriller filled with tensions and buildup that keep the viewers on the edge of their seat.",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "This is a movie that got way too much good press. In fact, it's about as overrated as Inception. It may not be as long, but it's certainly way too complicated, and tries so hard to needlessly complicate the plot even further, but I guess that's what those pretentious Hollywood critics like. The movie does know how to set up the story, and how to explain what's going on, but I think it spends too much time portraying a horrible, horrible world than entertaining. Also, I don't like that Tom Cruise is yet another emotionally scarred action hero. One last thing, the visuals look good, but the setpieces look too unrealistically futuristic. Why hire futurists for something you can accomplish with your own imagination, or is Steven Spielberg running out of imagination?",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "Minority Report is one of my favorite sci-fis. It has great action, a very interesting premise and some good execution. It's got it's silly moments, but they don't detract from the movie in my opinion. Colin Farrell and Tom Cruise give some great performances. It's very intense featuring many twists that I didn't see coming, especially from Spielberg.\n\n9/10.",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "Better then I remember from my first time watching it.",
            "review_date": "2013-05-11",
            "source": "rt"
        },
        {
            "content": "This movie was supposed to be the sequel to Total Recall, one of my all time favourite films and one of the best Arnold Schwarzenegger movies ever made and if that was so, then why didn't you bring Arnold back as the main hero? Instead we waited over a decade for this confusing storyline about PreCrime, a technology that exists in 2054 and was invented 9 years ago to capture future criminals with the help of Precogs who are three psychics and their future predictions are never in error. When Officer John Anderton played by Tom Cruise is the next fugitive, he is on the run to find out who set him up as his own colleagues chase after him. After he kidnaps Agatha played by Samantha Morton, the most powerful precog out of the three, he begins to formulate a theory about a possible frame-up from within his own department when he finds out that the framer was in fact PreCrime's Director Burgess played by Max von Sydow. This film whilst sure resembling a beautiful and complex film noir, it has confusing plot lines which made sense in the short story by Philip K.Dick this film was based off on whereas here, it doesn't seem to work. A lot of critics seem to absolutely love this movie for certain reasons and for me, while this movie definitely did have it's problems, I thought it was good. The main problem I had with this movie is the happy ending. All of Philip K.Dick's science-fiction stories don't have happy endings and this is what this movie screwed up and this screws up the future adaptations of his stories most famously The Adjustment Bureau. Minority Report gets a solid 8.6/10.",
            "review_date": "2013-05-11",
            "source": "rt"
        },
        {
            "content": "Chocked full of suspense, thrills, and plot twists, \"Minority Report\" succeeds because it couples it's intriguing futuristic concept with profound ethical and philosophical questions.",
            "review_date": "2013-05-11",
            "source": "rt"
        },
        {
            "content": "\"Minority Report\" is often scary as the basis for a powerfully constructed science fiction movie that combines a dizzying blend of eye-popping visuals and thought provoking framework.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "pretty good and interesting movie! futuristic and great idea, especially for the 2002. even 10 years later it was as futuristic as back then! that is really great!",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "it has good screenplay, good script, and good on story telling. But, not good enough on music.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "tahun 2046 di amerika ada departemen khusus pra kriminal dan itu baru sebatas sebuah imajinasi dalam film, Indonesia tahun 2013 udah membahas tentang santet.",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "Upon first release I remember being frustrated with the inordinate amount of product placement and all that all Philip K Dick stories seem to get adapted as action films. 10 years later, those complaints are still present but it's much easier to see this film as an interesting take on neo-noir and a nice mystery. Today, I see Spielberg's work more compromised by his attempted to satisfy too many different groups of viewers. The end result is a compromise of his incredible technical talent as a filmmaker and his voice as an auteur. This film entertains; the source material challenges, and yet it still misses the mark to be truly provocative.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "Awesome future/sci-fi/cop movie. it feels allmost like a crime drama when watching it, but the sci-fi elements add so much icing to the cake",
            "review_date": "2013-04-19",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg took a traditional action/sci-fi backstory of family & revenge, and he turned it into something unexpected. It was impeccably paced, something other futuristic movies today lack. He's a genius and the film is clearly ahead of its time.",
            "review_date": "2013-04-18",
            "source": "rt"
        },
        {
            "content": "Watched this first time in 2002, It was a good film then it is a good film now... aaa all those memories I have from 2002 ... I wanna go back there with all the knowledge I have now ... and change things.",
            "review_date": "2013-04-17",
            "source": "rt"
        },
        {
            "content": "Great story, and atmosphere in this film, the precog screaming \"run\" stills freaks me out a little to this day.",
            "review_date": "2013-04-16",
            "source": "rt"
        },
        {
            "content": "Inventive, Creative, fantastic cinematography, the color scheme is magnificent!",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "A dark, sophisticated and thoughtful sci-fi piece featuring clever ideas and an original direction and execution.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "I love science fiction, I love Steven Spielberg and I like Tom Cruise. So on paper this film looks like a real winner. However, I just felt Spielberg lacked the ability to make this convoluted concept become truly gripping. There were some brilliant parts, and some so-so parts, and the whole film just comes unstuck.\n\nCruise played his part as well as he could, and the supporting cast, including Colin Farrell, Max von Sydow and the girl from Cold Case, all also fill their roles the way they needed to.\n\nIt just didn't feel as polished as I was expecting. Maybe I wasn't in the frame of mind. But for now, 3 1/2 stars.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "Fantastic. \nGreat Sci-fi. One of my favorites of the decade!",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "Great Scifi thriller.",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "\"While the way in which Minority Report presents these ideas makes them far more incredible and fantastical, it's their truth...that turns the film into something far more dark and sinister.\"",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "Going into this movie, I had no idea what it was about and who was in it, but somebody recommended it to me and hey! I was pleasantly surprised.\n\nTom Cruise is back in another action flick -- except it's a lot more than that, as Minority Report is set in 2054. John Anderton (Cruise) is the head of a special police force called Precrime, in which psychics called precogs foresee a murder happening in the future and the police arrest the perpetrator before it happens. This program, of which Lamar Burgess (Von Sydow) is the head, has been widely successful in Washington DC and Virginia, and Burgess is looking to expand the program across the United States. The only glitch? Anderton finds an inconsistency in one of the murder files, unlocking secrets that are meant to be kept from the world. This leads to him being framed, and the plot then thickens.\n\nI loved Tom Cruise in this film. His character is seen to be very unstable since his child was kidnapped a few years earlier, and Tom Cruise does an amazing job portraying such a broken character. Colin Farrell plays Danny Witwer, a Department of Justice agent, who is looking to take Anderton down, and he does a great job of this as well. I want to talk more about his character but I don't want to give any spoilers!\n\nNow on to the concept. I loved the idea of the future. The effects were pretty good for 2002, and the ideas were what made me so interested. First was the whole precrime idea in itself, the first scene is of them preventing a murder, and it was probably the best part in the whole movie. Tom Cruise looks through the images the precogs see on a floating computer hologram thing, and directs it with his lit up gloves, and it's just amazing to watch. The next thing was the cars and the roads, which moved left, right, up and down. Spielberg does a great job of making all the new technology seem practical for the future, and explains it to the audience through a policeman explaining it to Farrell's character.\n\nThere were also some things that didn't work for me in the film. The first thing would be some of the dialogue. There were some cheesy one-liners that could have been totally omitted, and which brought the film down a notch. The second thing would be Agatha, played by Samantha Morton. I liked the character and the idea, but there are scenes where she foresees that something bad will happen and screams. It wasn't even a womanly scream it was a deep weird scream that I also thought was a little unnecessary.\n\nFor ratings, I would like to give this film 4 stars. I loved the themes and ideas it brought forth, and the way it was shot was also amazing, but there were little aspects that didn't appeal to me.",
            "review_date": "2013-04-07",
            "source": "rt"
        },
        {
            "content": "Minority report creates a increbibly belivable universe and uses it at it's advantage to construct a fantasticly intriguing story with brilliant dialogues and great cinematography. But unfortunatly, the movie is sometimes confusing and some characters are not developped enough.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg and Tom Cruise team up for the action-packed science fiction thriller Minority Report.  Based on a Philip K. Dick short story, when a precrime detective is predicted to commit a murder he goes on the run and attempts to prove that he's been set up.  It's a fascinating story that deals with issues of predestination, means justifying ends, and the police state.  Cruise gives a strong performance and is backed up by a solid supporting cast, including Colin Farrell and Max von Sydow.  Yet Spielberg hinders the film somewhat by deluding the edginess and dark themes of Dick's work.  Minority Report is an impressive thriller that tackles some provocative issues, but it doesn't fully commit.",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "Though it's dirty in some point but then, the movie still high power in style and twist... Cruise and Spielberg had it coming... =D",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Spielberg's smartest and best film of the decade.Tom Cruise is superb.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "The world of \"Minority Report\" is both fascinating and kind of messy. Some major world-building elements pop up for just one scene (Why tiny police spiders? Who cares, just go with it!), and it's easy to poke holes into some of the plot details (Anderton's eyes, despite being a fugitive, still activate the retinal scanner?)... But whatever. The art direction is crammed with detail, and this is one of the more realistic sci-fi worlds in recent memory (Much of the technology on display has been invented in the last 10 years). The plot is twisty-turny, the action sequences appropriately thrilling, and the cast is really, really great. \"Minority Report\" is a fun ride with pathos and intelligence to boot.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "The underlying theme of Minority Report is man's right to have a choice, which is clearly represented in the beginning when Witwer catches the ball rolling before it would've hit the ground, symbolic of free will conquering determinism, which provides the ultimate message of the film; realizing that you as an individual always have a choice. \n\nAlthough the film stays with its genre and the themes are well-defined, the plot is a tad jumbled. In all honesty, I had to read summaries online and map out what exactly happened from what I had just watched. It took me only a few minutes to figure out from mapping that ultimately Burgess was trying to protect an otherwise perfect system. \n\nRegardless of the somewhat confusing plot, this is still, at least in my opinion, another masterpiece of Speilberg's.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Another Cruise blockbuster, this time with a properly confusing attempt at Dick's story.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Fascinating futuristic thriller, filled with clever touches and the ingenious set pieces that characterize Steven Spielberg's work. Intelligent screenplay by Jon Cohen and Scott Frank, based on Phillip K. Dick's short story. sees \"pre-crime\" cop Cruise accused of a murder that he hasn't committed yet, which forces him on the run, and an exciting run it is.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "In this science fiction thriller, we see a true sci-fi masterpiece by the great Steven Spielberg. This film combines high concept ideas and action with its story and visual effects that widen your eyes. Tom Cruise's performance in this film is astounding as well.",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "I haven't read the story by Philip K. Dick, I was really impressed with the original thought provoking concept presented at the beginning of the film and how well it develops throughout. Minority Report is thought provoking and thrilling all the way through and there's a lot of great content for science fiction fans to drool over.",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "I don't like Tom Cruise, but this was quite a good sci-fi. It'll make you think as well as thrill you.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "What do you know another Tom Cruise classic, this is a brilliant idea for a movie an original plot about people getting arrested for crimes they commit in the future is genius, I can't stress enough how good this movie is.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "Minority Report was entertaining but the futuristic tone everything had didn't give it a unique enough consistent atmosphere to leave a lasting impression.",
            "review_date": "2013-03-19",
            "source": "rt"
        },
        {
            "content": "A morally vague ending could have worked better here, given the Sci-Fi themes throughout. Also, something I never thought I'd say: This movie would have been better without jetpacks.",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "Really an excellent, underrated thriller.",
            "review_date": "2013-03-15",
            "source": "rt"
        },
        {
            "content": "A surprisingly good movie, really good story, and was played out well through all of the parts",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "An intriguing look at a moral conundrum and a distopian universe.  The first half was phenominal, the second half (after the abduction of the oracle) less so, but I truly enjoyed the experience",
            "review_date": "2013-03-12",
            "source": "rt"
        },
        {
            "content": "A science fiction movie that makes you use your head. You do not see those too often these days.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "One of the best sci-fi movies of this generation.  Great plot and action.  I highly recommend to any movie or sci fi fan.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "Interesting concept albeit disturbing to think about this sort of scenario actually occurring in the real world.",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "Pretty Frikin Sweet!",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "You may have to watch it more than once to fully understand it's complex story line, but minority report it another great film by one of the times greatest directors.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "Only Steven Spielberg could make the best modern science fiction films like this one. Excellent. He is like the George MeliÃÂ¨s of our time.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "Minority Report is a great movie.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "Interesting Scifi elements.  In my opinion, however, your time would be better spent on a different movie if scifi is your thing.",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "There's good sci-fi and bad sci-fi. This is good, and it still holds up well pretty well after 12 years. Plus, if it's got mystery with a great payoff, then it's a definite winner for me.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Loved the story line. Cruise did a great job acting.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Another one from the Tom Cruise posing collection.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Interesting, action packed, but lacking some sense of humor. Still a good movie, although you can clearly see Spielberg loosing his grip on popcorn movies here.",
            "review_date": "2013-03-01",
            "source": "rt"
        },
        {
            "content": "A sci-fi movie that rises above most other action flicks, which, unlike Minority Report, don't focus that much on story or ideas.",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "I remember enjoying this movie. But not much else.\r\n\r\nOh, except for the introduction to Collin Farrell.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "great movie! The story line is way ahead of its time.",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "demasiados finales...",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "When someone does a film as complex as this one, there are bound to be plot holes and dropped threads. But the resolution is satisfying enough to ignore them. Decently acted and very well thought out.",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "Thought-provoking and visceral, Steven Spielberg successfully combines high concept ideas and high octane action in this fast and febrile sci-fi thriller.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "Very good. Spielberg manages to make Cruise palatable.",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "Steven Spielberg is one of the few directors around today who can still manipulate an audience in one sense while dazzling and daring that same audience with storytelling and character skills fused with ingenious visual effects. Minority Report is a shining example of that, which also has the grace of having an intelligent concept to start with, which so many sci-fi films lack.\n\nMinority Report is a perfect blend of action, suspense, thrills and film-noir. The plot is intelligent and fresh. People at the time saying it is not original must have slept through the movie. The film creates many moral questions and issues, and should leave you thinking. It is worth seeing again and again.",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "Minority Report is my list of one of my favorite science fiction films.\n\nIn the year 2054, a special unit of the police department called Precrime where they arrest murders before they have committed the actual crime. Primecrime bases it's work on the visions of three psychics or \"precogs\" whose prophecies of future are never in error. When detective John Anderton discovers that he has been identified as the future killer of a man he has never met, he is forced to become a fugitive from his own colleagues as he tries to uncover mystery of the victims to be identity.\n\nDirector Steven Spielberg has managed to craft one the most spectacular mind blowing blast of a film. It's fast paced, it's got great action and really good dialogue. It's stunning, breathtaking and tremendously entertaining.\n\nTom Cruise is casted as John Anderton, who is the main star in this film and Tom Cruise is just terrific in this solid movie. Colin Farrell is also in this and he's actually not that bad.\n\nEverything about this movie is completely marvelous. Great Director, amazing concept and one of the most mind roaring things you will ever experience.",
            "review_date": "2013-02-14",
            "source": "rt"
        },
        {
            "content": "Great Sci-Fi, great Tom Cruise movie.",
            "review_date": "2013-02-14",
            "source": "rt"
        },
        {
            "content": "Future-noir, coupled with Steven Spielberg, can't really go wrong. Minority Report readily proves this.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "A great sci-fi action thriller, that keeps you in suspense right up till the credits. Thought provoking and intense, Spielberg did a great job with this.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "Not good for watching if not in the mood for Sci-fic",
            "review_date": "2013-02-07",
            "source": "rt"
        },
        {
            "content": "As a science fiction fan i think this movie is quite profound and well written. no surprise, because it is written by one of the est scence fiction authors of all time. The story ist surprisingly thrilling and, what I like best; it`s fully unpredictable.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "Great action movie with a dark plot, that is also very predictable.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "One of the best sci fi movies ever, This movie is so original, only Spielberg could have made it.",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "Tooooo confusing. The acting was great, but it was too hard to follow. And it never even shows you what happens to the main character's son.",
            "review_date": "2013-01-31",
            "source": "rt"
        },
        {
            "content": "Better than I would have thought.  I enjoyed most of this despite Tom Cruise's involvement.",
            "review_date": "2013-01-25",
            "source": "rt"
        },
        {
            "content": "89%  \nI did not enjoy Minority Report well on my first watch, but I found this more interesting on my second watch. This is one of the few Spielberg films that I really liked a lot. Usually I always feel that the Spielberg films are average despite their CGI overload(70% ratings only), like the Jurassic Park series. This film has a much believable story and protagonist. The stellar show from Cruise is great, but Colin Farrel is my favourite here. This film has a lot of logic and it's not entirely dependent on CGI work. But eventually it is predictable because you would have seen a cliche where they hide the villain till the end and when he finally come out, he would be an old man who is very close to the hero.",
            "review_date": "2013-01-25",
            "source": "rt"
        },
        {
            "content": "A perhaps surreal futuristic science-fiction thriller, Cruise perfects it by staying in control of his all-guns-blazing urges but brandishes a tricky yet fascinating personality. The ending comes extremely close to letting it all go in Spielberg style, but it felt like a matter of the poignancy involved when dealing with sensitive areas, alongside the corruption and multi-faceted look of each of the characters. Besides, it still had the action, just with the intellectual superiority, hard-hitting, thought-provoking and the haunting strangeness in both the visuals and the story that many other films don't have. The plot twists were careful enough not to tie you in knots, but remembered the audience knew that it was a science-fiction thriller, and ended up creating something intelligent and mind-blowing at the same time. Strangely, this is both Cruise's and Spielberg's best film that I have seen so far.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "Well-acted sci-fi thriller fully delivers as an excellent futuristic drama.",
            "review_date": "2013-01-23",
            "source": "rt"
        },
        {
            "content": "I love this movie. This is one of Spielberg's best and was an inspiration to me for some of my own writing. A visual wonder and a tight plot.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Ground-breaking SciFi at its best.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Another sci-fi fantasy from Spielberg, this time a more action driven film. Really good. Just what I needed to feel like a man again after watching A.I.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "An entertaining high-concept sci-fi film featuring a good cast and a great plot.",
            "review_date": "2013-01-21",
            "source": "rt"
        },
        {
            "content": "Phillip K. Dick is amazing.",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "Great futuristic movie",
            "review_date": "2013-01-16",
            "source": "rt"
        },
        {
            "content": "oh my gosh i love this movie . when it first came out i watched it at least 6 times in one day.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "really good can be confusing though",
            "review_date": "2013-01-11",
            "source": "rt"
        },
        {
            "content": "Spielberg's adaptaion of Phillip K. Dicks story results in a cracking Sci-fi Thriller that I have enjoyed many times over the years. Barely a wrong note here!",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "Another Tom Cruise flick. Ho-hum.",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "Very well done sci-fi that is engaging and has great effects. Tons of awesome sequences. Tom Cruise is good in this and Spielberg crafts a sci-fi tale that is very Hitchcockian and has some of the Kubrick coldness that he jocked in AI. Max Von Sydow is great too. The concept is really top notch.",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "One of my favorite science fiction thrillers, the use of the technology seemed flashy back in the days, still quite impressive really. The theme of the story is just brilliant, can someone who hasn't committed a crime be prosecuted? Maybe not, but in the futuristic world, it's very corrupted. I personally thought the action was great and the story was fun. It's a really well crafted film starring Tom Cruise and Colin Farrell",
            "review_date": "2013-01-07",
            "source": "rt"
        },
        {
            "content": "A very complex and emotionally rewarding sci fi crime thriller. A vast range of thought provoking themes are brought up in this film, all of which are handeld very well by Speilberg and Cruise. Spectacular action sequences and designs/special effects are on show, but it's the storys original concept and plot twists that make this a sci fi classic.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Different, but way to cool.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "One of the few movies I can watch over and over again. For all good reasons Minority Report underpins the list of top sci-fi movies of the last decade. Many trends set out in the movie have been translated into working prototypes or public policies already and many more concepts to this day are in the making.",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "could have been done less mainstream",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "I think this is a very inventive and interesting idea well developed...",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Thought it was interesting how the film is set mostly with Sky blues and white. \nThe colors are typically shown very bright. \n\nthere is a lot of suspicion and no one is allowed to speak their side. There is A problem where thoughts can be rewritten.\n\nYou always have the choice. \n\nWhen does precrime go too far?\n\nThe film was a little strange for my taste. \n\n I didn't like the score. It did not have the sound like typically John Williams scores.",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "I Just want to watch it again !",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "a crime thriller, science fiction, mystery and suspense, mindfucking, steven spielberg, john williams, tom cruise and an exceptional movie!",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "A sci-fi movie that makes you use your head. You don't see those too often these days.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "Tom cruise was such a hotty then!",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "If you love sci-fi movies, you can't miss this one.",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "pretty good tom cruise is quite good",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "A hard to predict action flick playing around with time paradoxes. Somewhat refreshing!",
            "review_date": "2012-12-24",
            "source": "rt"
        },
        {
            "content": "The movie pulls out the debate of freewill. Is freewill truly freewill if my future actions are known before hand. The Bible makes us know that God knows the end from the beginning, and that he hand crafted us, so those that mean we have freewill or are we just a piece of a big puzzle.\n\nMinority Report answers that question by saying even if the future is known, the path can still be changed it is just a matter of determination. Set 50 years into the future, this classic is about a future where the criminals are arrested before they commit the crime.\n\nThe story itself was written by Philip K. Dick and it was supposed to be a sequel to the 1990 Dick adaptation of the movie Total Recall, which starred Arnold Schwarzenegger. When the sequel was not forth coming, novelist Jon Cohen was hired in 1997 to adapt the story for a potential film version. Cruise got a hold of the script and passed it on to Spielberg, with the hope that they will make a movie together from it. Spielberg liked the script but decided it need to be improved upon and so Cohen did another draft and Cruise and Spielberg decided to go in together to make the movie, both deciding not to take any money upfront but to share a percentage of the gross profit.\n\nBoasting of high tech graphics and CGI, this futuristic film looked certain, like if God willing we are all here in the next 50 years that movie looked like what it will be.\n\nThe movie plot centers on the Lead Character John Anderton. In April 2054, Captain John Anderton (Tom Cruise) is chief of the Washington, D.C. PreCrime police force. Thanks to their proficiency and effectiveness and intense use future visions generated by three \"precogs\", (these precogs are mutated humans with precognitive abilities) to stop murders, the city of Washington has been murder free for 6 years. The moment the murderers think it up in their mind this precogs sends a visual message and the culprit is picked up before the crime is committed.\n\nThings change for Anderton soon enough, that while the system is being audited by Danny Witwer (Colin Farrell), the precogs predict that Anderton will murder a man named Leo Crow in 36 hours.\n\nAnderton is surprised because he knows no Leo Crow, so now breaks loose and is on the run stealing one of the precogs in order to help clear his name.\n\nListed as one of the best films of 2002, this financial success is one of the best surveillance and futuristic films out there a movie to watch again and again.\n\nwww.lagsreviews.com",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "Very very good sci-fi. Tom Cruise in one of his strongest roles.",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "Wow, alone when I imagine how old this film is and it's still blasting me away with his finesse, action and suspense I can't even comprehend how much it must have impressed me when I would have watch in 2002. 10 years later and and still on top of its genre. Fabulous.",
            "review_date": "2012-12-19",
            "source": "rt"
        },
        {
            "content": "Really good story and plot to this one makes this one one of my favorite sci-fi movies I've seen in awhile. Good acting by Tom Cruise as well.",
            "review_date": "2012-12-13",
            "source": "rt"
        },
        {
            "content": "Not a sci-fi.  It's a film noir set in the future.  And the future is the most realistic portrayal I believe possible.  Spielberg's best after Indiana Jones...",
            "review_date": "2012-12-12",
            "source": "rt"
        },
        {
            "content": "My favorite Cruise movie! I cant see this one enough! One of the handful of movies that after the first time I saw it, I thought about it for days later.",
            "review_date": "2012-12-09",
            "source": "rt"
        },
        {
            "content": "One of my favourite Sci Fi movies of all time, and, I think, my most loved film of Spielberg. This is an amazing film, must be watched by everyone",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "A really dull and dreary movie that is filled with product placement and predictability.",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "The Fugitive meets 12 Monkeys meets Judge Dredd",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "One of Cruise's better films in recent years. An involving storyline and intense action make this a must see. Bonus points for originality too.",
            "review_date": "2012-12-07",
            "source": "rt"
        }
    ]
}