{
    "rating": 9.4,
    "release_date": "2002-04-19",
    "num_reviews": 738,
    "genres": [
        "Mystery&thriller",
        "Crime",
        "Drama"
    ],
    "summary": "\"Nine Queens\" is the story of two small-time swindlers, Juan (Gastón Pauls) and Marcos (Ricardo Darín), who team up after meeting in a convenience store and become involved in a half million-dollar deal. As the deceptions and duplicity mount, it becomes more and more difficult to figure out who is conning whom, and we begin to ask ourselves, \"Who isn't a thief?\"",
    "reviews": [
        {
            "content": "One of my all time favorite movies.  (Little Gem)",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even if it has a couple of inconsistencies and a sort of, too much to be true ending, I like it, and you are left with some very interesting quotes.",
            "review_date": "2022-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1001 movies to see before you die.  This was a better than average Argentine con artist film that mostly kept my interest, despite it dragging at times.  There were some unique parts to this and it also had some Argentine cultural quirks that I appreciated.  Overall the acting, writing, direction and editing were good.  Lots of unnecessary swearing though.  It was an STG DVD.",
            "review_date": "2022-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The more offended you are, the less suspicious you look. If things get tough, you accuse the rest of them.\"\nMarcos, forget the street hustles, and get into politics. \n\nThe thing with heist movies (and while this is more of a 'con artist' plot, it's got the same feel) is that they all share the same critical, predictable feature - an inevitable reveal that it was \"planned all along\". Speaking from the perspective of plot alone, scam flicks have a predictability to their ending to rival midcentury Disney animated movies. What you're left to enjoy are the details that lead up to that inevitable conclusion, and there are plenty to enjoy in Nine Queens: Ricardo Darín as Marcos, who straddles the line between suave and disgusting, the dark comedy bits, and character interactions that are among the best the genre has to offer. One of the film's greatest successes is building an atmosphere among thieves that suggests professional courtesy while remaining on edge due to their inclination to get the better of one another. Enjoyable, but it's aged better in the small moments than the big swings. (3/5)",
            "review_date": "2022-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good script about a con within a con with great acting. Set against background of an Argentinian economic crisis, along with some subtle and blunt metaphor in relation to that. My main problem about the story and it's twist, is how stretched the suspension of disbelief becomes if you really think about it. Because anticipating person's actions and reactions to such precise extent and moving variables would make John Kramer blush. The con is less effective, when it relies on omnipotence.",
            "review_date": "2021-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The script is the best thing of the film: solid, sometimes funny, and with a couple of great twists. The directon is really well-done, and the performances are also at a good level.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An award winning Argentine scam-artist drama. Probably one of the best that the country has to deliver. Very well written and original for its time. The movie has a quick-witted OCEANS ELEVEN way of swindling that keep things suspenseful right up until the very last second.",
            "review_date": "2020-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3.25*\nIt was good but unfortunately I went in with high expectations so was partially let down.  I thought it was going to be a lot more complicated than that.  The acting is great... Darin is really good.  It's a PG crime film that's entertaining, but the ending leaves you wanting more.  May be it just hasn't aged that well.",
            "review_date": "2019-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Argentinian con-artist movie I ever saw. Probably the only one too.",
            "review_date": "2018-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am really fascinated by movies about con artists and their elaborate plans to get money out of people. As long as they are likable people, it makes for such a fun plot and also has built-in drama because you\u0092re always worried they\u0092ll be discovered. Part of the added enjoyment I had in Nine Queens was the fact that I was never confident about who was lying and who was telling the truth at any given moment. This made for a superb mystery that I loved. Ricardo Darin was great in the lead role, and he has a charisma that makes his performance more believable. I\u0092m not sure Gaston Pauls was quite as good, but he still did well contrasting as the novice kid who\u0092s learning from the veteran. I was surprised how little this movie felt like a foreign film to me. I\u0092m typically so annoyed by reading the subtitles and I don\u0092t enjoy the different feel of cinema from other countries. But all of that melted away in Nine Queens and I was simply loving the story. I swear, if this was made in the US with a couple big-name actors, it would have been massively successful. I\u0092m not sure all the logic works perfectly when you realize everything that happened, but I\u0092m also not sure whether that matters at all. The ending is strangely satisfying even though things don\u0092t turn out exactly as you hope. This is the type of movie that I would highly recommend to others, because it is so well-crafted and works on almost every level.",
            "review_date": "2017-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although convoluted at times, Nine Queens makes up for its flaws through legitimate unpredictability and a smart and clever script.",
            "review_date": "2017-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie about a small time con man who meets another man, who claims to be a much better con artist, and they both plot a big con together. Only it doesn't work out quite as planned. Extremely good movie. One of my all time favorites.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A charming flick and great watch with humorous twists and turns with good performances by everybody. Its fun to watch how Juan pulls off the trick at last.",
            "review_date": "2015-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good film that keeps you guessing along the journey. Ultimately though, it was predictable.",
            "review_date": "2015-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "skip the American remake of this its aweful",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever and twisty, Nine Queens is a memorable thriller.",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fantastic kind of movie that keeps you guessing until the very end",
            "review_date": "2014-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun con-man movie that keeps the viewer glued to the screen through it's twists and pace.",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Argentinian film about two cons, the skilled and the new one. The DVD has only Spanish audio and I think it would be hard to equal the richness of the dialogues into another language.",
            "review_date": "2014-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm gonna have to watch this again real soon.",
            "review_date": "2014-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Con man movie.   \n\nDefinitely worth watching. In any situation :-)",
            "review_date": "2014-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my favorite crime movies, really clever.",
            "review_date": "2014-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it!  For once, a twist I didn't see coming, which is so rare that I appreciate it so much when it happens.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A con artist drama that has an interesting story line. The suspense is smallish and the dialogue is uninteresting.",
            "review_date": "2014-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice movie, in the group with ocean's eleven",
            "review_date": "2014-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On par with the best in the genre - House of Games",
            "review_date": "2014-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good, effective, fast-paced caper but the twist in the end was kind of =/",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really worth watching.",
            "review_date": "2013-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well done, original version of matchstick men with a better story, more convincing characters and better (and less neurotic) acting. Overall, very solid.",
            "review_date": "2013-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How do you con the con-artist? Pretty much a spoiler, but Nine Queens makes the other classic heist films look stupid. Lots of twist and turns with a lot of surprises. Though the movie plot reminds me so much of The Sting with their grandeur plans of conning.",
            "review_date": "2013-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! Don't trust the imitations, watch the original. Funny and dynamic.",
            "review_date": "2013-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabián Bielinsky's first out of two full lenght films. I'm really looking forward to \"Aura\" now. This film got a fantastic flow and development. Time flies by, you are always entertained and the film just keeps on going. The pace is flawless in this neat, smart film that also got a great script. It feels a lot like the \"Ocean\"-films in a way. It's playing tricks with your mind and you can admire it, just as you do with con tricks. \n\nSadly it's quite meaningless after all. It's the kind of movie that don't stay with you for a very long time, but that does not mean that it's poor, it's two hours of enjoyment. Humour, mind games, semi-action and tense stuff all over the line withou getting stupid.\n\n7.5 out of 10 queens.",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Movie works. I recommend this Nine Queens even for those who don't normally watch subtitled movies. Most of the dialogue comes in short bursts and is witty and descriptive",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the class of grift flicks, it's better than average. But it doesn't stand out outside the niche genre.\n\nIt's a slight twist on an old story. It has it's suspenseful moments though. And some good acting.",
            "review_date": "2013-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I´ve ever seen. Being argentinian helps to understand better the characters, but the argument wins by itself.",
            "review_date": "2013-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Spanish-language heist film is filled with laughs, twists, and interesting characters. The John C. Reilly vehicle \"Criminal\" is an American remake of this entertaining movie.",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! A lot of drama and mystery.! A must see movie.",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A surprisingly great scam movie coming from Argentina. Nice dialogue, deep characters and great chemestry between the protagonists. There was not a single boring moment and the turns on the story keep the tension going until the final twist which was fantastic in my opinion. A clever, unique and funny thriller with the touch of latin cinema.",
            "review_date": "2012-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thriller masterpiece.",
            "review_date": "2012-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spoiler alert!!    Must have been a great movie back in 2000, but i watched in 2012 , after i watched \"Kahani\". Guessed the ending in the first 20 min and that kind of spoiled the movie for me.",
            "review_date": "2012-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guess I'm the only one here but I think the twist is dumb & almost ruins the entire movie",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyable and smart film. The story's good and the actors are really convicing -Leticia Bredice's impressive presence is a show stealer. One could argue that the everyday life that's portrayed throughout the film depicts exactly why Argentina went broke as an economy and a state but I guess that would've been a high-level thought. Anyway, nice movie, you'd better watch it 'till the end.",
            "review_date": "2012-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I always enjoy movies with a twist that makes the audience feel dumb for not having realised it earlier.",
            "review_date": "2012-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "may  b coz I hd seen the Indian inspired version first... this one became predictible for me from the very word GO... bt a good one nonetheless",
            "review_date": "2012-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This took a while to get going, but was pretty good. It would have been better if it were not a foreign film and I could better take in the reactions and expressions, but it was pretty satisifying.",
            "review_date": "2012-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twisty, intelligent plot, great acting... simply brilliant!",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Argentine movie!",
            "review_date": "2012-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much better than the American remake. I wish I'd seen this first, as the twist at the end is what sets it apart. It might have gotten four stars then.",
            "review_date": "2012-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film.  Simple storyline but excellent characters.  Would happily see it again.",
            "review_date": "2012-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A neat and simple heist movie and probably the best Argentinean movie of all time.",
            "review_date": "2012-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't you see the way she swings her ass? There are no saints.",
            "review_date": "2012-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A satisfying crime thriller.",
            "review_date": "2012-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nine Queens is fast paced and very cool(especially the cons they pull). THe first film in long while where I've been pulled in and sat ont herdge of my seat wondering what would happen next. Heaps of suspense and suspicion which leads to a great ending(though not surprising).",
            "review_date": "2012-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really felt something for this gang of swindlers. The dialogue is sharp and the action has a nice pace to it. Good job!",
            "review_date": "2012-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very nice crime/thriller film with very little violence, proving that it's not necessarily needed. Great ending twist.",
            "review_date": "2011-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Accolades for the pragmatic approach, never seen such film making in a while ...wonderful storytelling... i think others are coming after this  and follow the trend.",
            "review_date": "2011-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabián Bielinsky only made two feature films before his to early death in 2006. One of them will be a part of history. Nine Queens which is listed in the book 1001 Movies You Must See Before You Die. It's a well made, and twisted heist film, probably one of the best in newer times.\n\nNine Queens starts in a little convenience store in the early morning, a small-crime crook, Juan, successfully scams the cashier, but when tries it the second time with another cashier he's caught, but another crook, Marcos, gets him out the trouble and then ask if he want to go for the big score by selling a forgery of a postage stamp called Nine Queens. But that's easy said than done. I don't want to give away the ending, but I assure you. You will not be disappointed. My conclusion about Nine Queens is that it's a good movie, with a lot of lovable crooks and losers, with makes it sometimes pretty funny. Thumbs ups from me.",
            "review_date": "2011-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite an engrossing film about con men - the sharp and witty dialogues are the best part!",
            "review_date": "2011-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun script, well-paced, with two engaging leads that play well off one another, Nine Queens serves as one of the more enjoyable entries into the suspense-thriller canon of movies that make ample use of misdirection, keeping the surprises coming to the very end. The best thing about the film is its seeming joy in displaying such a wide variety of tricks--all through subtle word play and cleverly arranged circumstances.",
            "review_date": "2011-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film with plenty of twists that you will not see coming!",
            "review_date": "2011-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film + clever twists + Buenos Aires.",
            "review_date": "2011-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This rating is for the movie without the silly, unbelievable ending.",
            "review_date": "2011-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Con movies always run into the danger of being predictable ironically due to the very knowledge the viewer has that it's a con movie. What \"Nine Queens\" ensures is  a ride that is special in it's own ways irrespective of the twists that may or may not appeal to you. As it scours the con game to it's vilest details that makes you flinch and still keeps finding you searching for that one moral \"humane\" tilt to the character, you know it has already won u over and climax can only be icing on the cake, which it is, in fact more than that!!..\n\nCan't leave this review without putting a word for Ricardo Darin...He is absolutely outstanding. As smone who embodies everything reprehensible abt con games he leaves an indelible mark on film.\n\nLove con movies?...Watch it!!....",
            "review_date": "2011-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah, the plot thickens. And again. and again, and again. And in the end, the joke's on us!",
            "review_date": "2011-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart, clinical, devious. It's a con-movie in every sense. To remake this in Hollywood and call it Criminal is...well, you know, criminal!",
            "review_date": "2011-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Argentinismo a full. It loses alot in the subtitles but it was such a good movie hollywood had to make an American version in Criminal.",
            "review_date": "2011-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good con movie with a fantastic twist at the end. Loved to see and hear Buenos Aires in film.",
            "review_date": "2011-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like all good con artist films, Nine Queens maintains a palpable aura of distrust and inevitability which manipulates its audience with subtle twists and turns before delivering the final sucker punch. Director Bielinsky wisely keeps most of his film on the street where the budding partnership between veteran con man Daron and sidekick-for-a-day Pauls is played out through several entertaining scenes of one-upmanship. As each man displays his talents, the younger man's distrust of his mentor mirror own own as his amoral philosophy reveals an even blacker heart. Despite a dialogue-heavy script, NQ's is an energetic and satisfying thriller whose conclusion will have you retracing every moment of the film to see where the double and triple-crosses originate. Gripping stuff.",
            "review_date": "2011-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A friend of mine, who was also screening this, called this the quintessential con movie. It stars Ricardo Darin, who was absolutely perfect in 'El secreto de sus ojos', which was another neo-noir masterpiece. But the same chap never seemed excited when I went on raving about 'The Sting'. So, walking in, I did not go in with an open mind. I did not think this one was gonna rock. Plus, I had seen many movies that came after, that used the template this one laid out ('Matchstick men', for instance). So, when my friend asked me (during the break) to guess what was going on, I was bang on target (as the finale proved), but that, in no way, detracted from the entire experience, which unfolded as a treat to behold, without the 'royal' flourishes of a Nolan (think 'Prestige', not 'Inception'), but just by being so subtle that you might miss the point (another friend, who loves movies of this genre, actually missed the point - was paying attention to his cell phone during that 1 crucial frame).",
            "review_date": "2011-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Engaging tale of scam artists working petty street angles until they stumble upon an opportunity for a big score. \r\n\r\nThe first act in particular is well paced as we watch them relentlessly pursue their angles with every step down the street. \r\n\r\nMoving on there are many twists and overall the film is entertaining. \r\n\r\nThe ending may be just a little too pat, but the skillful buildup leaves the viewer pleased nonetheless.",
            "review_date": "2011-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deliciously wicked film is fun while it lasts. Well made film bites itself in the end but it was fun. A wonderful screenplay with good actors. I am yet to see the America remake Criminal but with John C Reilly playing Ricardo Darin's part it must be fun. Time to check out more Argentinian films. I have loved whatever I have seen till now (The Secret in Their Eyes, The Holy Girl). Please recommend.",
            "review_date": "2011-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant.  Impossible to dislike. You wont stop thinking about it!",
            "review_date": "2011-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit slow at the start, but things did pick up eventually. There are some moral issues here, but I don't think the experience changed either of them. Once a thief always a thief.",
            "review_date": "2011-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and funny thriller. I love the Argentinian´s sense of humour and Ricardo Darin´s performance.",
            "review_date": "2010-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a very simple plot, but its simplicity is what makes it so great.  It's a really enjoyable movie that doesn't try to be something that it's not, and the performances felt very real and natural.",
            "review_date": "2010-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Ricardo as for the movie not bad.",
            "review_date": "2010-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one has been remade in the US as \"The Criminal\". I can't honestly say that the original is better, it really seems to have been made for the South American audience (the ending is something that just doesn't happen in this part of the world), and quite frankly I liked the cast  in \"The Criminal\" better.",
            "review_date": "2010-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fascinating film about an unlikely duo of con men in Buenos Aires. A smart script, but a disappointing ending... worth watching",
            "review_date": "2010-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the finest argentinean movies of the decade...",
            "review_date": "2010-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A True Gem in Argentine Cinema's Crown.A slick and thoroughly enjoyable con-artist movie.When you think you've figured out Bielinsky's great game, that's when you're in the most trouble: He's the con, and you're just the mark. Kudos to 1st time great debut director & to one of my fav & Argentine's best actor Ricardo Darin!",
            "review_date": "2010-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "beauifully done, needs to be watched twice at least",
            "review_date": "2010-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great con movie. Subtle smart. Who needs Oceans 11 when you have world cinema of this calibre?",
            "review_date": "2010-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad but sort of underwhelming.  The problem with a movie like this is you go into it expecting the plot to twist and turn.  In other words, the very unpredictability of the plot makes it predictable.",
            "review_date": "2010-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great heist thriller with enough twists to keep you on your toes.",
            "review_date": "2010-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly original con-artist movie, that for once isn't a re-hash of 'The Sting'. Brilliant.",
            "review_date": "2010-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is probably the best movie to come out of Argentina in recent years. Ricardo Darin gives one of his best performances, supported with solid acting by Pauls and great directing by Bielinsky (RIP), this movie is a must see. There is almost no way you can predict what the end of the movie brings, but watch it again and you will see what you missed the first time around. Great portrayal of the life of a crook in Buenos Aires.",
            "review_date": "2010-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was really good, even if is totally ridiculous come the end.",
            "review_date": "2010-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best con movie I've ever seen... A wonderful Argentinian film with superb leads from Ricardo DarÃ­n and GastÃ³n Pauls. Beautiful, elegant, clever and funny. Love it!",
            "review_date": "2010-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong, twisty criminal affair.",
            "review_date": "2010-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well-made argentinian movie. If you know the culture of the south-american country, you'll love it. A con movie made with real cons practices (not ficticious or too unreal as you can see in Oceans' Eleven).",
            "review_date": "2010-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit predictable, but still fun to watch.",
            "review_date": "2010-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was easily conned by this one, should have seen the end coming from a mile away.  Good fun though.",
            "review_date": "2010-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nice,can never guess what happens. good one",
            "review_date": "2010-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hilarious buddy comedy/heist flick, this unconventional Argentine film is a suspenseful, intelligent joy ride.  Awesome!",
            "review_date": "2010-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great con movie. Subtle smart. Who needs Oceans 11 when you have world cinema of this calibre?",
            "review_date": "2010-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No, this is it!! As a con film...this is as good as it gets. Its a shame the awesome director had to die so early. Otherwise, we would have had such wonderful treats for so many years.",
            "review_date": "2010-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever Argentinian caper movie with very good structure and acting. It covers only 24 hours in the life of two con-artists selling a supposedly very expensive set of stamps called the Nine Queens. As in most of these movies, there is a twist, which I sort of guessed but I still enjoyed. It is overall very entertaining film which proves that not only americans are capable of making a good heist. The dialogues are vibrant and the \r\nscript is complex but not overcomplicated. This is a fun watch.",
            "review_date": "2010-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nine Queens does for swindlers what Se7en did for serial killers. It glorifies them.",
            "review_date": "2010-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twisty con flick finds a street level scammer being arrested by a cop on his tail. Juan thinks he's going up the river but it turns out the cop is another big scammer named Marcos. They decided to team up and go for some small scores, until they end up getting wind of a counterfeit group of valuable stamps called the Nine Queens. Its hard to guess who is playing who but its a light and fun caper flick, and not much else.",
            "review_date": "2010-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So good.  The only other caper/con/crime film I'd put on par with this would be The Usual Suspects.",
            "review_date": "2010-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twisty and full of turns, Nine Queens successfully threw me away from my initial guess, which did turned out to be the right one. Grrrrrrrr!\r\nFabián Bielinsky is a sad loss, I'd also recommend the even more brilliant El Aura!",
            "review_date": "2010-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing! Awesome drama/suspense movie. Excellent plot and great how it ended up with the economic crisis issue in Argentina. It reminds a little bit some American movies like Ocean's Eleven.",
            "review_date": "2010-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie starts slow but once it is on track there is no looking back. Nine queens is a film that is terrifically narrated. Definitely worth seeing.",
            "review_date": "2010-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie liked it  very much, kept the story going all through..",
            "review_date": "2010-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great con movie, with well-done dialogue, well-acted, and a plus for people who have walked the street of Buenos Aires.   Any further description would give away too much.",
            "review_date": "2010-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever scenario, very nice acting but it couldn't keep me interested throughout.",
            "review_date": "2010-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is one that I am not ashamed to speak of in absolutist terms: it is wonderful. The stunning aesthetics and gripping plots. The interesting characters and the tense postmodern cinematography. The action and suspense... I could wax eloquently, but I don't want to bore any readers.\n\n\nEssentially, this film is one of the few that truly has \"something for everyone.\" Film snobs will love the intertextual elements of the plot, with a nice does of referentiality. The artsy crowd will gawk at the intense imagery and stunning sweeping shots. The Tarentino-ites will be pleased with the rapid-fire dialogue and fast paced action.\n\nEven younger viewers would find this movie engagingly funny and action packed at the same time.\n\n5748 thumbs up.",
            "review_date": "2010-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nine Queens is a foreign con-artist movie that doesn't dazzle you with flair, but still has a style and core product that is captivating and exciting.  Juan, a likeable novice con is taken under the wing of Marcos, the experienced but callous conman looking for a partner.  The plot moves through a series of cons and spins that ultimately lead up to the final revelation - a twist that is surprising but not very satisfying.  As a whole, Nine Queens is a very good (and at times special) film that never quite becomes great.\r\n\r\nI do find it very difficult to effectively critique a foreign film that has a lot of dialogue and complex plot development.  From not understanding the nuances of the language, to constantly having to rapidly look back and forth from the action on the screen to the subtitles...I will admit that I might have liked the movie a lot better than I rated it.  There are just too many things that I may have missed or misunderstood.  So go see it and enjoy, because it is still a really good film.",
            "review_date": "2010-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Argentine variation on the \"Sting\" theme, with a cast of grifters whom you're never sure is getting the better of each other until the very, very end, which is one of the most satisfying endings you'll ever experience. Highly recommended.",
            "review_date": "2010-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well done as the characters go around the Hilton in Bueños Aires. You feel a lot of empathy for Pauls’ character as one wonders how DaríÂ­n might take advantage of him, and the movie plays very cleverly to the last scene.",
            "review_date": "2009-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GREAT Movie tht rlly shows Ocean's thirteen how it's donee!!!",
            "review_date": "2009-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well made with a superbly executed plot twist.",
            "review_date": "2009-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unexpected! you'll never know what is about to happen!!",
            "review_date": "2009-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had hoped I would like this more than I did. The premise was interesting, and there were plenty of twists, but it just didn't pull me in like I expect from a good heist flick. The characters just aren't engaging enough and the con they are trying to pull eventually turns into a simple case of buying something from one person and selling it to another at a profit. Not much of a heist, really. Still, the screenplay is clever enough, the final twist is unexpected, and the style is reminiscent of Reservoir Dogs and its kind. Give it a watch.",
            "review_date": "2009-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great con film! Has some very good plot twists throughout it. \nGastÃ³n Pauls' unibrow does get a little distracting on the closeups...LOL\nHighly recommend this foreign film!",
            "review_date": "2009-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the original version of 'criminal'. its simply original and great. hollywood's just wasting time and money to ever do a remake of it. watch this instead.",
            "review_date": "2009-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i've seen the remake (criminal) so qualified",
            "review_date": "2009-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "swindling with a twist at the end",
            "review_date": "2009-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "that a good movie, I got it alf way through though",
            "review_date": "2009-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a very solid movie and it's very good.",
            "review_date": "2009-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guess I'm the only one here but I think the twist is dumb & almost ruins the entire movie",
            "review_date": "2009-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie. The Argentinian answer to \"The Usual Suspects\". Absolutely fantastic for a debut film!",
            "review_date": "2009-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever and funny, nice pace and an overwhelming freshness that lacks a lot from films now a days...",
            "review_date": "2009-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half was boring, the second half was better. I liked the song.",
            "review_date": "2009-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good film in the vein of The Sting.  You never really know who's in on the scheme.  A lot of fun with some very good performances.",
            "review_date": "2009-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "almost same as The Usual Suspects...not very impressed, anyway",
            "review_date": "2009-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I usually don't like movies with these kind  of endings, think it's a bit outdated. But then again, this one was made in 2002, and it's clever and very funny !",
            "review_date": "2009-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a good \"thieves movie\" and a funny view of Argentinian society",
            "review_date": "2009-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is a Lunfardo term called \"viveza criollo\" which refers to slyly ripping off or conning someone whilst making the person feel as if they received a fair or good deal.\r\n\r\nThis argentinian con-artist flick is somewhat about that idea in this foreign film about two con artists who develop a partnership and attempt to con a widowed relative who owns a very expensive stamp in her husband's collection.\r\n\r\nIt's similar to \"The Sting\" as these two partners attempt to work a masterpiece con.\r\n\r\nAll in all, the con isn't all that convincing and the twist at the end isn't beleiveable either.  It was still interesting to watch footage in a Buenos Aires that was severly in a major economic depression at the time the movie was filmed.  The political commentary of the country was a bit obvious and the city footage not enough.\r\n\r\nThere wasn't any memorably catchy scenes.  Ricardo Darin is the strongest actor in this movie as is the brief scene by Alejandro Awada (the stamp fabricator).\r\n\r\nAll in all, the characters were interesting enough to follow the movie thru to the end, but in the end, this was just an average movie.",
            "review_date": "2009-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very clever movie that has everything that you can \nexpect from this kind of movies !!! Action...suspense\nand many funny moments !!! You have to see it !!! :D",
            "review_date": "2009-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intensely good watch about a pair of conment in Argentina with lots of good twists along the way, but one too many by the end of the film.",
            "review_date": "2009-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film!  As the plot thickens, you will be caught deeper and deeper in the trama up until the very end, when your jaw touches the floor while you are still sitting on your couch.\nA must-see-this-movie recommendation from me.\nSo fresh that all you need is to add some lettuce and italian dressing.\nBon apetit!\nEnjoy it.",
            "review_date": "2009-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of Argentine movie released in recent times. Very refreshing.",
            "review_date": "2009-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's impossible to watch this film about a couple of Argentinian con artists performing the scam of their lifetimes without knowing that you are being conned too.  Who is lying, who is cheating, is there even one decent honest person in the film?  I didn't guess the ending, but wasn't surprised by it - does that make sense?  The subtitles whip by extremely quickly which spoilt the film a little for me, I understand very little Spanish, so 7/10 rather than 8/10.",
            "review_date": "2009-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Original Spanish title \"Nueve reinas\"; Best Film, Best Actor (Darin), Best Supporting Actress (Berenguer), Best Director, Best Original Screenplay, Best Cinematography, Best Editing, 2001 Argentinian Film Critics Association Awards",
            "review_date": "2009-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well umn just seen this movie 4 the 1st time n think that this is a good movie 2 watch...its got a good cast of actors/actressess throughout this movie...i think that both ricardo darin n gaston pauls play good parts throughout this movie,..i think that the director of this drama/art house/international movie had done a good job of directing this movie because you never know what 2 expect throughout this movie..its an enjoyable movie 2 watch n its got a good cast of actors/actressess throughout this movie",
            "review_date": "2009-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Con movie is easily superior to it's American remake, Criminal.  Contrived and a bit goofy at times, it's still one of the few movies in this genre that doesn't telegraph the twist (Confidence, Match Stick Men, etc.).",
            "review_date": "2009-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not too bad, a little slow paced, and beginning to show its age. But enjoyable. And at the end, there's a twist!",
            "review_date": "2009-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie about manipulation that could have been even better with a slightly faster pace.",
            "review_date": "2009-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, witty, unexpected..",
            "review_date": "2009-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good better than american remake",
            "review_date": "2008-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie. The movie starts off slow and somewhat draggy as the main characters develop a relationship. Things start to get interesting and the ending is completely unexpected.",
            "review_date": "2008-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. The best of the best in Argentinian cinema.\r\nYou think you can be smart, you think you can guess how the film will end...but no...It will surprise you.\r\nIf you havenÂ´t watched it yet, just do that.",
            "review_date": "2008-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply put, one of the best con movies ever made.",
            "review_date": "2008-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thoroughly entertaining Argentine crime caper with one of the best endings I can remember. Highly recommended!",
            "review_date": "2008-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh my gosh, the ending will make you just blink.  crazy.",
            "review_date": "2008-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review will be written when/if re-watched (Probability: Zero).\n\nFirst viewing: 14.02.2003",
            "review_date": "2008-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thrilling viewing; suspenseful from the beginning to the end.",
            "review_date": "2008-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nueve reinas is a con movie, made in Argentina. I went to see it, because the description said: 'a good heist movie, which Hollywood is sure to fuck up in the remake'. It is a typical con movie where of course you can't trust anyone. Nothing you haven't seen before but well acted, entertaining and with Buenos Aires as a background who would want to miss it?",
            "review_date": "2008-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun. Entertaining. The characters are convincingly played. However, I somehow knew what to expect from the plot twists long before they arrived and was not surprised at the ending. It was an obvious con-the-con film from the beginning. Still, watching the lead conman get his comeuppance was satisfying.",
            "review_date": "2008-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "starts off well but the ending is disappointing!",
            "review_date": "2008-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie ever made in Argentina, an excellent con movie with an unexpected twist.",
            "review_date": "2008-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Argentinian heist flick that kept us guessing until the very last minute about who was duping who and who was going to end up with all the money.  Great shots of Buenos Aires, including in the new Hilton by the docks which is a great space.",
            "review_date": "2008-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well-paced tale of tricks gliding from minor cons to high-stakes, heavy plotting...stopping just short of complete cynicism before revealing its hand",
            "review_date": "2008-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What makes this film so great is it has a very realistic feel and and great ending. Nice to see a well done low budget film that doesn't need special effects to maintain an audience's interest.",
            "review_date": "2008-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was possibly my favorite film in France along with Blanche (2002) & Filles Perdues, Cheveux Gras. It was fantastic and unexpected!",
            "review_date": "2008-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[i][b]Nine Queens (Nueve Reinas)[/b][/i]\n[b]Made in[/b]: Argentina\n[b]Language[/b]: Spanish\n[b]Director[/b]: Fabian Bielinsky\n[b]Starring[/b]: Gastón Pauls, Ricardo Darín, Leticia Brédice, Ignasi Abadal, Oscar Nuñez\n[b]Year[/b]: 2000\n\n[b]Synopsis[/b]:  Innocent-looking Juan (Gastón Pauls) and hardened, cunning Marcos (Ricardo Darín) are two con men operating in Buenos Aires who, by chance, cross paths one morning.  Forming a tentative partnership, Marcos and Juan stumble upon a once-in-a-lifetime chance for a huge score.  \n\nThe plan involves selling an expertly set of forged stamps called [i]The Nine Queens[/i] to a soon-to-be-deported Spanish businessman/stamp enthusiast, Vidal Gandolfo (Ignasi Abadal).  Gandolfo happens to be staying at a luxury hotel where Marcos' estranged sister Valería (Leticia Brédice) is employed, and with whom Marcos is currently involved in a bitter legal dispute over an inheritance.  \n\nAfter successfully negotiating a price for the stamps, the straightforward plan begins going awry as third parties get involved and unexpected challenges arise.  Marcos and Juan find that things are not what they seem and no one is to be trusted as the adventure becomes more convoluted.  \n\nIs it every con man for himself or is it all just a big joke?\n\n[b]The Good[/b]:  The movie won several prominent awards at well-known festivals, such as the Biarritz International Festival of Latin America, the Bogota Film Festival, and the Lima Latin American Film Festival among others.\n\nDirector Fabian Bielinsky creates a smart, energetic crime movie that, whether intentional or not, also works as a commentary on Argentina's economic crisis which was taking place when the film was released.  The storyline is solid, and the unexpected plot twists are highly entertaining.  Leading men Gastón Pauls and Fabian Darín showcase very natural, believable performances and have great onscreen chemistry without a hint of superficial, pop-culture vanity.\n\n[b]The Bad[/b]:  In 2004, this film was remade by American studios into a film called [i]Criminal[/i].  Although I haven't seen [i]Criminal[/i] and therefore will not criticize that film, Bielinsky's original is fine as it is and does not need to be remade.  \n\n[b]Who would like this movie[/b]: If you enjoyed heist/con/crime movies such as the 2001 version of [i]Ocean's Eleven, [/i]then [i]Nine Queens[/i] is right up your alley.  It's a film that you have to pay close attention to, and perhaps even view a second time.  Any fan of crime movies can get drawn into this adventure. \n\nThe urban background and slick plot-line could place this film in any big city, despite the fact that it was shot specifically in Buenos Aires.  It's a movie that doesn't have a \"foreign feel\" to it (other than the language) and the subject matter pretty much cuts across cultural lines.  All in all, it's a cool movie that succeeds without ever [i]trying[/i] to be cool.\n\nThanks for reading- you can find more of my reviews [url=\"http://www.foreign-films-for-you.com/foreign-action-movie.html\"]here...[/url]",
            "review_date": "2008-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd watched it before, but I gladly watched it again with my best friend last night! Always witty and charming.",
            "review_date": "2008-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good Argentinian film that makes me smile! Good script, very good pace! Good actors! Simple as that.",
            "review_date": "2008-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A game of grifting is played by two strangers. The clues are there as to who is in control, but it isn't obvious. A really interesting cat and mouse game movie. Subtitled. Performances are strong. I liked it.",
            "review_date": "2008-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best non Mamet like movies.  If you want to guess the twist until the very end, this is a wonderful diversion.  Watch it twice, three times to understand the scams.  Perfect.",
            "review_date": "2008-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grifters and a David Mamet essence of \"what's going on and when will the next move occur\".Fast-paced when needed,Nueve Reinas holds an impressive and dynamic plot,Darin giving a great performance.",
            "review_date": "2008-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not that I've seen many Argentinian films, but if they're anything like this I've been missing out. So good, so well played by great characters, and masterfully stitched together.",
            "review_date": "2008-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In some ways predictable, but such a perfect movie!",
            "review_date": "2008-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All things that an argentinian have to learn!",
            "review_date": "2008-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very impressive movie about two con men",
            "review_date": "2008-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "most of all i like the pace of the movie. i liked the script, creative, not a new idea and its pretty predictable but equally entertaining.This film was carefully made with great attention to detail, everyone did their job right.",
            "review_date": "2008-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very cute! easy to watch, clever and very enjoyable",
            "review_date": "2008-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bielinsky's masterpiece! a briliant movie which u can keep watching again and again. this movie is everything...hilarious,witty,sentimental,romantic...wat else d'ya want?? Darin was amazing too.",
            "review_date": "2008-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nothing short of brilliant. Dialogues between characters are extremely insightful and philosophical",
            "review_date": "2008-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful acting and a clever storyline. The American remake Criminal pales in comparison. Acting was great too!",
            "review_date": "2008-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film that keeps you guessing who is conning who in the classic style of 'The Sting'. The ending is great and all acting is good.",
            "review_date": "2008-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent watch. In the end it all bois down to who's conning who. Well written and wel made",
            "review_date": "2008-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "like an argentine matchstick men. i SO saw the twist coming, too.",
            "review_date": "2008-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a genuine thriller!!see the original,dont go for the remake\"the criminal\"",
            "review_date": "2008-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie! Great twists - kept my attention!",
            "review_date": "2008-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this after seeing the English remake:  The Criminal (2004). Same plot, but very clever. I love the ending.",
            "review_date": "2008-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting heist movie that draws you in slowly but surely...it's not action-packed but full of delightful and mischievous surprises along the way.",
            "review_date": "2008-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderfully clever screenplay which keeps you guessing. Terrific performance by Ricardo Darin.",
            "review_date": "2008-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching \"Nine Queens\" is like watching a game of chess played by two smarmy crooks at the top of their game. It's a convoluted narrative, but the pacing is taut and the director keeps the proceedings clear. The fun is in guessing who's playing whom...and in seeing the one-upsmanship that goes along with it all.  Bravo!",
            "review_date": "2008-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply the smartest film I have ever seen with an ending that makes you want to see it all over again. From the setting, plot and sub plot, through to the understated acting and character development I can't really find a flaw. Just watch it.",
            "review_date": "2008-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyable film, whether or not you have an exceptional command of the Spanish language",
            "review_date": "2008-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good script that keeps you interested until the end. Tricky and real as life is... I enjoyed it!",
            "review_date": "2008-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good, but hell, i forgot it the minute i watched it.",
            "review_date": "2008-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOCO PERO CHEEEE, a brilliant plot line, acting, direction with Argentinian attitude.",
            "review_date": "2008-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(*** 1/2): [img]http://images.rottentomatoes.com/images/user/icons/icon14.gif[/img]\n\nIntelligent and twist-filled.  Well-acted and entertaining.  My only complaint is that I still feel some things weren't answered by the end.  This film was later remade as [i]Criminal[/i] (starring Diego Luna and John C. Reilly).",
            "review_date": "2008-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not very orignal, but well done. Reminded of me of similar Hollywood movies but this one is more \"exotic\": set in Buenos Aires, and in Spanish.",
            "review_date": "2008-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent acting, original and entertaining. Not too predictable and worth watching.",
            "review_date": "2008-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, surprising end, watch it!",
            "review_date": "2008-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "always love all movies with thieves among thieves tactic.\nthe plot was unpredictable. film was great. but it lacks the tense though.",
            "review_date": "2008-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Argentinean film ever, and as another reviewer said, anything with DariÂ­n is worth watching",
            "review_date": "2008-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting, but nothing really new or different. Good twist at the end.",
            "review_date": "2008-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anything with R.Darin is worth to watch. You think you know what's happening,but the end surprises you. Really really good.",
            "review_date": "2008-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you think you've figured out Bielinsky's great game, that's when you're in the most trouble: He's the con, and you're just the mark.",
            "review_date": "2008-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The exact opposite of El Aura, but somehow just as good.  Constantly plays with the audience without pandering like Lucky Number Slevin and similar suckfests.",
            "review_date": "2008-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just brilliant.  got to give it to the hubby for convincing me that not all foreign films suck.  this one was pieced together quite nicely and kept me going throughout.  one heist film i would definately recommend.",
            "review_date": "2008-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie that keeps you interested till the end",
            "review_date": "2008-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like random foriegn films this ones really good",
            "review_date": "2008-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better than The Sting",
            "review_date": "2008-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is okay but the (for me) surprising ending was what made it for moi. Oh, and another thing, STAY AWAY from the crappy John C. Reilly/Diego Luna remake (Criminal)...L-A-M-E.",
            "review_date": "2008-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gem of a story, really glad I picked this up when I did. I used to watch a lot of continental films when I was in my youth. This one is from Argentina and I enjoy watching it again every 6 months or so! When the english speaking films out there aren't appealing to you go out and search for a foreign movie - you'll more likely to be pleasantly surprised",
            "review_date": "2008-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A surprise from Argentina! Ricardo Darin and Gaston Pauls are great!",
            "review_date": "2008-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is amazing, the day after I watched it I was still thinking about it and piecing everything together.",
            "review_date": "2008-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One can watch this movie again and again and always discover something new.",
            "review_date": "2008-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "smart and really creative.  Darin y Pauls are great! and Leticia is a goddess!",
            "review_date": "2008-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching this movie was spoiled by the fact that I watched the American version (\"Criminal\") first.  This version was much better than the American version, but knowing what was going to happen spoiled it a bit for me.  While having flaws, the movie was well-crafted and well-acted. One flaw was that why would he tell the buyer who his sister is. At this point in the movie, it is true that he thought he would be selling the real stamps, but why would want someone to know how to trace him. And in fact, if he hadn't said that, what excuse would the buyer had that he would have some influence in convincing him to let his sister do the exchange... Anyway, still an enjoyable movie.",
            "review_date": "2008-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As intricate and well paced of a heist film as you'll see anywhere. It also takes a large portion of the movie to see who is scamming who. Perhaps everyone is lying, perhaps not. I say let your paranoia take hold and enjoy each bend around the corner.",
            "review_date": "2008-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "witty film - check this out if you have the chance to find it",
            "review_date": "2008-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I gave this film 4 stars because I it was surprisingly good considering I was convinced it would be crap. Dont like films like this generally.",
            "review_date": "2008-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't believe I've only just gotten around to seeing this. Muy cool!",
            "review_date": "2008-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable and a very good premise but didn't go all the way with it. Could have been so much more. Acting great and well shot. Worth a watch because it's refreshingly different. Ending was a bit of a let down too",
            "review_date": "2008-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed getting conned by this movie.",
            "review_date": "2008-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "simply amazing, one of the best argentinian movies that I've ever seen.",
            "review_date": "2008-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool movie. Don't see the US remake because it sucks badly.",
            "review_date": "2008-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "you must see this film",
            "review_date": "2008-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A day in the life of two Argentinian con men. Loved the way it played with the notion of predator/prey. Great acting and thrilling if a little convaluted plotline.",
            "review_date": "2008-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You've got to love a good heist movie, and this is a good heist movie.",
            "review_date": "2008-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny and original! Unexpected developments, simple setting and good character developments.\nReminds me that I should improve my Argentinian Spanish.",
            "review_date": "2008-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie with a total twist at the end! A non-hollywood thriller that is way more satisfying than your regular fare.",
            "review_date": "2008-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best films always prudeced!!!!!!",
            "review_date": "2008-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some could (or not) figured out what was going to happen by the end, but still... is a superb movie, and a crucial thing; that can be dismissed, is it portraits the poor state of Argentina and the economy back during its last crisis, a real but funny poirtrait of that moment and Era",
            "review_date": "2008-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think its one of the best Argentine movies ever made, followed by \"El Hijo de la Novia\"",
            "review_date": "2008-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very well-constructed confidence (scam artist) flick that keeps you guessing.  It's a little on the long side, and I felt like the ending oversimplified things a bit (although I only watched it once through, so I may have missed subtle hints throughout), but it's definitely worth a watch.  Don't expect nearly as much of an action flick as the trailer would have you believe.",
            "review_date": "2008-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie reminded me of \"confidence\" but with more of a sense of humor and more compelling characters.",
            "review_date": "2008-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a lesson to learn ! :-)",
            "review_date": "2008-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely worth watching. Interesting and smart.",
            "review_date": "2008-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am defintiely biased, I had to add an example of \"Cine Argentino\" to my list of Top 10! Nine Queens does not disappoint, though, with a clever script and fast-paced acting. Darin is an actor's actor. Love him.",
            "review_date": "2008-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie.  Better con movie than most american ones.  Makes Oceans11 look like garbage.",
            "review_date": "2008-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wasn't bad, would like to see it again though, don't remember it too well",
            "review_date": "2008-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the Argentinian version of Usual Suspects...",
            "review_date": "2008-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More twists and turns than a tango competition!",
            "review_date": "2008-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well, everybody would like this movie or not. But all the argentines can perfectly get identify with that.",
            "review_date": "2008-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like con artist films then you can't miss that one. Simply excellent and suprising.",
            "review_date": "2008-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. Not the best argentine movie by far (but this \"$\"#% flixter does not have the good argentine movies, typical holywoodian US-centerism), but very good plot and acting. The scene about choplifting in Buenos Aires is... impressive :)",
            "review_date": "2007-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best Argentine films, great actors, great script, great move. There are little details that you only catch when you see it in a second time...",
            "review_date": "2007-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film plays a game of chess with your mind. You can only watch this once due to the plot twists. Its brilliant the first time, but it's tedious the second time.",
            "review_date": "2007-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best ones...",
            "review_date": "2007-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast, witty, deceptive.  Like being invited in as assistant to a seriously good stage magician who's happily pocketing the audience's valuables and giving them back replicas.",
            "review_date": "2007-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Argentinian film written and directed by FabiÃ¡n Bielinsky is far superior to the Hollywood re-make version, 'Criminal', starring (the usually wonderful) John C Reilly and maggie Gyllenhaal. The story of two grifters who see an opportunity to pull off the con of a lifetime involving some fake stamps. The story takes place over one or two days and so minor twists and turns become profound. This original version sets up the relationship between the seasoned grifter and the younger, greener, grifter beautifully and this is balanced with the right amount of underlying malevolence and really great comedic nuance. Beilinsky's support characters are truly memorable too. Superior in every way - you won't be disappointed",
            "review_date": "2007-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Picture The Game crossed with The Usual Suspects crossed with The Sting. Oh, and set it in Argentina. Surprise! You've got Nine Queens, the fascinating gotcha that made an international splash a couple years ago. It all begins when a young wannabe con man is taken on as a partner by an experienced double-crosser. But can they pull off a half-million-dollar deal?",
            "review_date": "2007-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great Argentinian Movie. Funny, Interesting and surprisingly story!",
            "review_date": "2007-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty cool action movie.  It got me turned around a couple times.",
            "review_date": "2007-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great plot and acting.  In Spanish but do not let that deter you to see this drama...very suspenseful!  Ricardo DariÂ­n is a brilliant actor.",
            "review_date": "2007-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never know the answer until the very end, terrific movie",
            "review_date": "2007-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "end to end virtually flawless entertainment.",
            "review_date": "2007-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very entertaining crime thriller. The 2 leads are so believable and are great on screen together, the story is at times quite thrilling, and it has a great sense of humour too. I may have enjoyed it more had the DVD I was watching it on not stuffed up halfway through (and it seemed to cut away from subtitles really quickly, which was annoying).",
            "review_date": "2007-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Will keep you guessing till the end.  Its a movie of quick tricks and smart wit.  Strong character development and you'll start taking sides early.  Enjoy!",
            "review_date": "2007-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Forget Criminal, original and the best. Did not see the end coming",
            "review_date": "2007-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Will truly leave you guessing 'til the very last moments (at least it did for me!)  An original story, with wonderfully developed characters you love and hate at the same time.  Try it!",
            "review_date": "2007-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow - great film about con men with a 'twist' ending. Very enjoyable.",
            "review_date": "2007-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "probably the best latin american movie i've seen",
            "review_date": "2007-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i thought it was good",
            "review_date": "2007-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "con movies... i don't care if they're in a foreign language",
            "review_date": "2007-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant Argentine film, hilarious, brilliant lines and twisted story..Great actors, watched it several times and always laugh each time!!",
            "review_date": "2007-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How two con men try to sell fake German stamps called the \"Nine Queens\". Keeps you at the edge of your seat and hilarious at the same time. Strongly recommended if you want to relax after a bad day.",
            "review_date": "2007-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you still haven't, you really have to watch it!",
            "review_date": "2007-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "quality film, but gave me a bad feeling somehow",
            "review_date": "2007-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a cultural delight of our countries, shows our \"games\" and relationship very clear. - La he visto unas 9 veces y no me canso de disfrutarla, llenas de pillerias.!",
            "review_date": "2007-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ba ba ballan ass movie....so clever...i never saw it comin",
            "review_date": "2007-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good story of thieves and deception.",
            "review_date": "2007-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing is what it seems... Brilliant.",
            "review_date": "2007-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who's a better con-man?",
            "review_date": "2007-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very clever...one of the best movies i've seen",
            "review_date": "2007-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute masterpiece of directing by Bielinsky. The trama is amazing and the actors are really good. The move has something to say.",
            "review_date": "2007-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever and very entertaining.",
            "review_date": "2007-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Makes other puzzle films look like amateur hour.\r\nFar outshines The Spanish Prisoner, The Usual Suspects, or the American adaptation of this film.",
            "review_date": "2007-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It lacks the rhythm necessary for this type of film. It lacked tension.",
            "review_date": "2007-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This guys make good movies. \nExcellent comedy.",
            "review_date": "2007-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a cool con movie where you'll spend an hour and a half trying to guess who's getting screwed, before the movie shows you how wrong you were!",
            "review_date": "2007-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great movie with an excellent plot.  avoid the remake.",
            "review_date": "2007-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had to watch this for a spanish paper but it was really cool.",
            "review_date": "2007-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A clever argentinian movie which won an amazing number of awards! You really have to watch it! The director and writer died unfortunately in 2006. It's an important loss.",
            "review_date": "2007-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good plot, and truly a good thriller about smart con-men. Anyway, a very good description over Argentinian society.",
            "review_date": "2007-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really liked this one, even though I had guessed the twist right at the start it was so good I'd changed my mind by the end! besides, that is not what makes the film good it was the humour and character development that really made this film. Compulsive and enjoyable viewing from start to finish.",
            "review_date": "2007-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is pure fun..if u like twists and movies about Con artists, this is one the best..",
            "review_date": "2007-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Argentine movie ever made. Funny, well directed and great performance from Ricardo Darin.",
            "review_date": "2007-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant!!!! the us remake for this gem is the not-so-good \"Criminal\" with John C. Reilly and Diego Luna",
            "review_date": "2007-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slick Argentinian spy/thriller about two con-men on the trail of a rare set of stamps worth a huge amount of cash, and the people who are out to screw them over. Not the most action-packed of spy movies, at all. However, there's more plot twists than you can shake a stick at. If you enjoyed films like \"Lucky Number Slevin\", this one's in a very similar vein.",
            "review_date": "2007-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really really enjoyed it. Argentinian film about a young con artist learning from an older one. \r\n\r\nThere were so many twists and turns in it that it really kept me guessing right up to the last minute. Fantastic!! not enough films do that any more - they're always 'Hollywood predictable'!",
            "review_date": "2007-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect Latin movie. Nice camera and casting. Would watch it again.",
            "review_date": "2007-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast moving and very clever.  The suspense  is constant keeping your brain working overtime. Great characters.  Great film.  Highly recommend.  A must see.",
            "review_date": "2007-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it, loved the rioplatense accents and vocab.",
            "review_date": "2007-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Forget the Americanized version of this movie with John C. Reilly. This is the real deal - skanky gangsters, shysters and grifters in the biggest game of screw-your-buddy on the planet... all for nine little pieces of paper.",
            "review_date": "2007-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the Argentine greats...",
            "review_date": "2007-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like con movie, and this Argentinian movie is one of the best.\n\nFrom the start, you will know that this is about con(fidence) game.\nLike any great con movies, there is no camouflage.\nIn the first scene, we are directly introduced to the main characters : two con artists.\nThey are involved in a con game around a very rare stamp collection called \"The Nine Queens\".\n\nOriginally, they plan to work together to get the stamp, sell it, and split the money.\nBut the movie is so open, like challenging you \"Hey there is bigger plot! Be prepared for the big twisted ending!\"\n\nScene by scene, the movie cleverly builds surprises and creates ambiguity that makes us difficult to guess who is playing who.\n\nYou must see this movie if :\n1. You like con movie (i.e. Confidence, The Score, Matchstick Men, Ocean Eleven)\n2. You want to see fresh, riveting and entertaining foreign movie (feeling tired of Hollywood movie?)",
            "review_date": "2007-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "definitely worth putting in your netflix queue.",
            "review_date": "2007-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple but excellent con movie. The firsat of the new wave argentine films for export. Then again, I am biased, since I am from argentina",
            "review_date": "2007-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very clever Argentinian movie... it catches your attention from beginning to end!",
            "review_date": "2007-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic heist flick. Don't bother guessing; you're wrong.",
            "review_date": "2007-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever and full of suspense.  Worth seeing just for the Argentinian accents.",
            "review_date": "2007-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Argentine film I've seen. Great plot, and a realistic dialogue that makes Tarantino look like an amateur. Shame not everyone speaks spanish...",
            "review_date": "2007-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Que peliculon! Just when you think you've figured it out you haven't.",
            "review_date": "2007-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than \"House of Games\"",
            "review_date": "2007-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Argentinean films of the decade that we're in. And shall I say, at all. From the opening scene till its last, the suspense constantly increases; getting harder to know what is the next step. Beautyfly directed by Fabian Bielinsky, a genius that unfortunately has left us his last legacy: a brilliant film.\r\nQue D's te bendiga y te tenga en la gloria, Fabian!",
            "review_date": "2007-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slick, funny, Argentinian thriller, with strong twist. Avoid the Hollywood remake (\"Criminal\").",
            "review_date": "2007-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Foreign Film I've ever seen. Keeps you guessing until the last second, when you find out that you're totally wrong.",
            "review_date": "2007-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really clever Argentinian thriller. The low-budget feel makes Nueve Reinas even more charming.",
            "review_date": "2007-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "from allmovie: I have never seen a film as relentlessly uncompromising about the allure, power, and banality of the con game as I have seen in the Argentine `Nine Queens.' From the opening sequence where small-time grifter Juan pulls a $20 switch at a convenience store to the final scam that looks like `House of Cards' and `The Sting' welded onto `Hard Eight,' nothing is as it seems and no one can be trusted. \r\n   More recently think of `Sexy Beast,' `The Heist,' and `The Score.' However this is David Mamet territory, where buddies keep one eye on the target and the other on the buddy. \r\n\r\n   The film's pace is quick, like the hands of 3-card Monte; emotional involvement either on the screen or in the audience is minimal; everyone has a moment of triumph and defeat. Even beauty has its deceptive moment when Leticia Bredice, as the sister of other con artist Ricardo Darin, struts her stuff in the hotel lobby.",
            "review_date": "2007-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Learn spanish just to see this movie in its original language",
            "review_date": "2007-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really enjoyed this - even though reading subtitles.\r\nGood twists and classic con men movie.",
            "review_date": "2007-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "personal favorite- you have to watch it.",
            "review_date": "2007-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie!  Great ending!  Another must see if you're Argentine, or enjoy Spanish movies.  Subtitles don't do it justice.",
            "review_date": "2007-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbly pacey con flick.  Like an Argentinian \"Snatch\".  Superb!",
            "review_date": "2007-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie could have been cheesy and perdictable (like its english counterpart \"Criminal\") but instead it was sleek funny and full of suspence. Damn near perfect in terms of heist movies.",
            "review_date": "2007-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent. This one the original Argentinian version.",
            "review_date": "2007-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding heist movie. Very funny and superbly acted. Plot a lot like Confidence",
            "review_date": "2007-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two con men join forces to obtain and sell the 'nine queens' a set of rare stamps to a Spanish businessman - the deal will make them rich but can they trust each other enough to get through the day before the deal is sealed.",
            "review_date": "2007-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remade as Criminal in the US but this the real deal, very well made, one of the best Argentinian movies I have ever seen, its funny and jus great",
            "review_date": "2007-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a hidden gem ....with enough twists and turns to make you forget your reading the subtitles",
            "review_date": "2007-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just when you think you've got it figured out, it turns everything upside down! And again... And again!",
            "review_date": "2007-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remade as Criminal in the US but this, the original, is far superior....if you like films based on confidence tricks",
            "review_date": "2007-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome! american are doing the own version, why? this is a masterpiace",
            "review_date": "2007-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good heist film, lacking the production of say Ocean's Eleven, nonetheless keeps you interested throughout.",
            "review_date": "2007-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "gotta love the heist movies!",
            "review_date": "2007-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Argentinian heist flick revolves around a sheet of not-so-rare stamps, two con artists (Ricardo Darin, Gaston Pauls) and a sucker mark (Ignasi Abadal). As in the best con films, a femme fatale is required issue, and Nine Queens doesn't fail: Leticia BrÃ©dice is sex incarnate",
            "review_date": "2007-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous movie. The plot is a bit twisty and keeps you engaged. A review of the points would spoil the treat... go see it!",
            "review_date": "2007-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast-paced Argentinian con movie, funny and slick.\r\n\r\nThe ending was annoyingly clever for me but it was great fun all the same. C'mon Argentina, make more cool films like this.",
            "review_date": "2007-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart, subtle, and greatly satisfying. All the more reason to admire foreign films for making it look so easy while American movies struggle to deliver the same clever acting and dialogue like this film.",
            "review_date": "2007-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "anyon who saw the film ciminal, with john c riley should check this out, as this is the original which criminal is based, story cocerning a conman who witnsses another conman going about his business badly, so intervines when he gets caught, from this point he takes the guy under his wing, teaching him tricks and as hes setting up a big scam, wil invole him, as hes been left in te lurch by his partner, a great conman film from argentina the set up is great and simple to follow, certainly in my top ten conman flms, but whos scaming who and why, might keep you guessing, the two guys work well together, as there in every scene, and great direction as well, telling you how much crimial is similer to this i wont say, as it may spoil your enjoymnt of either one as, theres more to it than you think. im also fully recommending that fim as well, criminal is a very good remake, watch this then the other, its actually a good doube bill.",
            "review_date": "2007-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome! Malandragem sulamericana. Good scoundrels.",
            "review_date": "2007-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny , compelling, clever",
            "review_date": "2007-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely the best Argentinian movie I've watched. Excellent plot and run on a shoestring. I wonder if non-Argentinians will understand it...",
            "review_date": "2007-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its got an Ocean's Eleven flair to it but still retains a degree of reality. Very cool and hip!",
            "review_date": "2007-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good movie about swindles. For me it was an occasion to discover the Argentinian cinema .",
            "review_date": "2007-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original masterpiece!",
            "review_date": "2007-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love a good caper film, and this one kept me guessing right up until the end.",
            "review_date": "2007-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie from Argentina, plot, acting by Darin and Pauls is outstanding!",
            "review_date": "2007-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is absolutely brilliant!",
            "review_date": "2007-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Artful and entertaining heist-movie made tounge-in-cheek by debuting Bielinsky.",
            "review_date": "2007-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i remember being pretty impressed with the twists.",
            "review_date": "2007-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was better than the dorky cover suggests.  Somehow kind of blah for a tricky crime flick.  I suppose it would have seemed more clever and less random if I'd been able to catch the hints I likely missed in the dialogue.",
            "review_date": "2007-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a con movie: messing with people's firmly held social niceties for self-benefit. It's fun, witty, and very engaging.  One can get used to the subtitles pretty easily.",
            "review_date": "2007-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant movie; very clever and absorbing.",
            "review_date": "2007-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good heist movie, quick moving and surprising.  Kept me entertained the whole way through.",
            "review_date": "2007-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sadly, this film is a spot-on allegory about modern-day Argentina. It's a scam or be scammed world.",
            "review_date": "2007-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just perfect. \nI miss Bielinsky.",
            "review_date": "2007-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "truly amazing movie, if you can put up with the subtitles... great story magnificent ending, tho possibly one you might see coming... worth the watch anyhow!!",
            "review_date": "2007-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good! very good story...",
            "review_date": "2007-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What surprised me was how taught this film was considering it's director had complete freedom. Directors left to their own devices usually tend to stray from the path a bit, but here Bielinsky keeps the momentum going throughout.\r\n\r\n9 Queens keeps you guessing to the very end when the surprise twist makes it all worthwhile. \r\n\r\nOne could probably point out the plot holes, but the characters and pace of the film make such questions irrelevant. You are willing to go along for the ride simply because how fun it is.",
            "review_date": "2007-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full of humer and twist. Really amazing",
            "review_date": "2007-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amusing and witty con movie. I didn't really understand the ending, but that just means I have to watch it again :)",
            "review_date": "2007-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brush up on your argentine spanish and take the ride here...characters all loveable and detestable at the same time",
            "review_date": "2007-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie!  Really keeps you on your toes until the very end.",
            "review_date": "2007-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Argentinian movie about con artists in swindling entertainment.  Though ending needed clarification, its suave storytelling makes you cheer for the \"bad guy\"...which isn't always a bad thing.",
            "review_date": "2007-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The argentine movie industry should be proud of this fine export!",
            "review_date": "2007-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was really funny and the final was unexpeted",
            "review_date": "2007-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "over-ambitious but good. c'mon argentina show us more!",
            "review_date": "2007-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not five but nine stars to these queens!!!\r\nHey, do not waste your time with Hollywood's adaptation",
            "review_date": "2007-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Movie EVER. Ricardo Darin is one reason why I love Latin America. ...and because I'm married to a Chileno...",
            "review_date": "2007-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's in Argentine Spanish, so prepare for subtitles. Otherwise, also prepare for entertainment. Great acting, great story with an interesting ending. (I called it, but it's tricky so you might be surprised).",
            "review_date": "2007-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hey Hollywood - this is how to make a heist movie.  Take notes, assholes.",
            "review_date": "2007-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film, with a good twist.",
            "review_date": "2007-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see for any one who likes 'con movies' - especially for those that are fans of David Mamet's earlier movies!",
            "review_date": "2007-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A class Argentinian movie about two con-artists brought together by chance. The master and pupil then embark on a number of jobs before their focus turns towards a one-in-a-million opportunity to have a big pay day. Cue twists and turns and moments of not having a clue what's going to happen next. It's cool, it's clever, and it's well worth a watch!",
            "review_date": "2007-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Argentinan con movie. Very entertaining from beginning to end",
            "review_date": "2007-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a con movie... \"nine queens\" and \"catch me if u can\" have to be the greatest con movies along with \"sting\"... they dont come any better than this...amazing, amazing, amazing....",
            "review_date": "2007-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brillaint. Unknown by most people but a treasure of a movie. The kind you wish you coul dwatch again for the first time.",
            "review_date": "2007-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very entertaining movie that takes the viewer along. The ending is a little predictable but enjoyable nevertheless. The portrayal of the psyche of con artists is very revealing as is the glimpse into Argentine life.",
            "review_date": "2007-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent film. The ending was so good, I had to laugh at how well they had conned me.",
            "review_date": "2007-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the american remake is horrible, this version is the ultimate!",
            "review_date": "2007-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slick clever and a cool script",
            "review_date": "2007-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great argentinian movie....",
            "review_date": "2007-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a lot of fun. However, the story, at some point, is completely predictable.",
            "review_date": "2007-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really solid movie, much better than the American remake - surprisingly ; )\r\n\r\nIt's maybe just a little bit easy to see the end coming but it's still a very enjoyable film, well acted and directed.  It's not much under two hours though so if you don't speak Spanish the subtitles may put you off a little (stick with it!)",
            "review_date": "2007-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quirky Spanish crime comedy. A little predictable.",
            "review_date": "2007-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two street con men try to make some easy money with a legit book of stamps... or is it?",
            "review_date": "2007-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I do enjoy a good con trick film. Not sure the ending was that much of a surprise, but it was satisfying nonetheless. Liked the flagrant 'Sting' reference in the final scene.",
            "review_date": "2007-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful stroll with two scam artists proving why there's no one else to trust in the deceitful concrete jungle. a film that will hold your breath till the last minute. superbly written, acted and staged.",
            "review_date": "2007-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Branden and I saw this randomly when Cornell Cinema failed to show some random indie movie from the same country (all those spanglophone countries are the same to me, yes). I bet this was better anyway. I should actually watch it again since I was on like 4 hours of sleep and missed 20 minutes of it or so...",
            "review_date": "2007-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting and an enticing plot which keeps the audience on its toes through the entire film. The characters are blunt about their flaws -con artists- yet you find yourself guiltily rooting for them since the beginning.",
            "review_date": "2007-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The real hustle - superb Argentinian fare.",
            "review_date": "2007-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie! My cousing brought it from Argentina and well, best gift ever!",
            "review_date": "2007-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great plot and pace and an interesting portrayal of Argentine society (I guess, I have never been there).",
            "review_date": "2007-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie.  It's possibly one of the greatest Spanish movies of all time.  Funny, smart, and awesome acting.",
            "review_date": "2007-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie, it's clever, and it's engaging, fun to watch.  Some very good acting, and a wonderful predictable surprise ending.  Watching mostly American movies, it's so great to watch something with a flavor slightly different from that of Hollywood.",
            "review_date": "2007-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i hardly make time for foreign films since i hate to watch a movie AND read the subtitles. but this one was well worth it, with the brilliant plot and subplots and twists and turns, you're left wondering who's pulling a job on whom. VERY NICE!",
            "review_date": "2007-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this film.  So smart & witty.",
            "review_date": "2007-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far the best we've ever made... Or perhaps im TOO into that subject =P",
            "review_date": "2007-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good plot twist.",
            "review_date": "2007-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever Argentinian movie about con artists and their struggles. Great story with a nice twist, of course.",
            "review_date": "2007-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is excellent. But please watch the Latin version. The American remake is not as good. Good Latin drama!",
            "review_date": "2007-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie!  It plays tricks on the mind.",
            "review_date": "2007-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a rare gem, this film proves why Argentina is cinema's best kept secret to this day. Also, there's a film called Criminal with John C. Reilly, Diego Luna, and Maggie Gyllenahll. Guess what? that film is a rip-off of this one and way crappier. Watch this film.",
            "review_date": "2007-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love it, it's like ocean's 11 with ugly people",
            "review_date": "2007-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films ever, so clever, great fun",
            "review_date": "2007-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great Argentinian film!",
            "review_date": "2007-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting is so good this could be a play. Suspense is phenomenal.",
            "review_date": "2007-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wry, compact and clever con movie, Nine Queens depicts one day in the life of two con men, the merciless Marcos, and the down on his luck Juan. The more experienced Marcos picks up Juan during a supermarket con and convinces him to work as his partner for a day. The two men are miraculously handed a huge, career making con. Bielinsky?s script cleverly layers multiple cons within cons within cons to drive the audience to question whom is actually pulling the wool over whose eyes. The con is the main focus of the film, but I was drawn to the interplay between Marcos and Juan. Marcos is selfish, sly and ruthless. Juan is kind, smart and has greater skills than are evident at first glance. The two men have little in common, but neither can do the job on their own and are tenuously bound by the desire for lots of money. Nine Queens plays the relationship for laughs, but knows how and when to push the right dramatic buttons.\n\n(transcripted)",
            "review_date": "2007-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "V entertaining Argentine movie with lots of clever twists.",
            "review_date": "2007-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my favourite film ever.  i've seen it at least 10 times.  wicked.",
            "review_date": "2007-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Generally movies with plot twists are only worth seeing once. But this movie is not about the plot twists, its about the fucked up characters of Buenos Aires' underworld, so its worth seeing over and over and satisfying every time.",
            "review_date": "2007-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best thing you can do when your watching this film is not guess what will happen next, and you should definitely not try to guess the ending because you will not see it coming! If you enjoy fast-paced, script oriented, story-driven, con-artist story, and super surprises, you will very much love Nueve Reinas (Nine Queens). Who knew Argentina was not only good at football (that's soccer for ya'll) but movies as well!",
            "review_date": "2007-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply the best argentinian movie ever.",
            "review_date": "2007-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scam movie with a twist..... (no but seriously it is somewhat original!!!)",
            "review_date": "2007-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "simply fantastic, and the end will have you speechless. its funny,witty and sharp.an awesome con movie..",
            "review_date": "2007-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extraordinary screenplay.",
            "review_date": "2007-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exquisit work! Show the south american spirit and creativity! Top 5 EVER!",
            "review_date": "2007-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun.  Familiar formula, but very well done!  A con-man duo, practically a remake of \"The Sting\" AND \"Dirty Rotten Scoundrels\" AND \"Heartbreakers\".  Good characters, good performances, good directing, good script.  You'd be shocked if there weren't twist(s) coming, but what's it gonna be?",
            "review_date": "2007-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous flick, constant twists and surprises, amazingly well scripted and brilliantly acted. One of the best and most entertaining movies I've seen,  I can recommend this even for non-River Plate Spanish speakers.",
            "review_date": "2007-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really enjoyable... clever",
            "review_date": "2007-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this film at Lincoln Cinema in NYC when it came out and rented it twice. Great writing con flick. No probelmo watching this over and over again.",
            "review_date": "2007-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BRILLIANT film... great plot, great acting... masterfully put together.",
            "review_date": "2007-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is the classic who conned who movie, with constant plot twists that leave you guess. Great pace to this movie, carefully chosen angles and edits. Definitely needs to be watched twice. Enjoy.",
            "review_date": "2007-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "you dont realize how much you are being manipulated and tricked until the very end. The movie itself is like a trick that the characters in the movie would play.",
            "review_date": "2007-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film has a Great TWIST ending!",
            "review_date": "2007-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "from my country! really good movie!",
            "review_date": "2007-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great international flick.  The key point to any great movie is the story line, if its good, then people will watch it.  This movie is a prime example of just that.  Breaking and transcending language and cultural boundaries and targeting audiences world wide.",
            "review_date": "2007-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nifty crime caper with a slew of sharp twists.",
            "review_date": "2007-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sooo much fun.Made me say \"Here, pay with this.\" everytime I go to a café ;-)",
            "review_date": "2007-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film... Ricardo Darín ENORME, like always. I would say another thing. The final part eof the story reminds me to a film o James Stewart that i see a long time ago, But i don't know the name. If any black&white movies fetichist read this i would thaank ih he gives me the name of the stewart's movie.",
            "review_date": "2007-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The twists in this put hollywood in the shade",
            "review_date": "2007-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I truly love this film",
            "review_date": "2007-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great caper thriller from Argentina. Very enjoyable.",
            "review_date": "2007-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent tale about con men set in Argentina. Well-acted with a clever plot. I can't recommend it enough.",
            "review_date": "2007-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "more twists than spaghetti",
            "review_date": "2007-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the best \"con\" movie I have ever seen.  The American remake was awful though.",
            "review_date": "2007-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exelente, the english version (title: criminal) was horrible...",
            "review_date": "2007-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one the greatest films to come out from Argentina, and it teaches Hollywierd how to make films",
            "review_date": "2007-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very swift, very fun caper film. It twists and turns about its plot without ever losing you. Well-acted, and marvelously entertaining.",
            "review_date": "2007-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome movie with a great plot. better than any ocean's",
            "review_date": "2007-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far more subtle in the way it goes about dialogue and conning than its American counterparts, and the twist is so much more satisfying thanks to it.",
            "review_date": "2007-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever.  Cool.  Che chabÃ³n hay que verla.",
            "review_date": "2007-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple the best movie a have seen!! this movie is so brillant i just can explain!",
            "review_date": "2007-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great fun and interesting",
            "review_date": "2007-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had to watch this movie for my Spanish class.  It was really good!  It draws a lot of comparisons to movies like Ocean's Eleven and The Italian Job, so if you liked those, I'd recommend this.  (Our Spanish prof was adamant that this movie is a social commentary on the economic situation in  Argentina.  I guess it is, but it's also just good solid entertainment.)",
            "review_date": "2007-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've ever seen.",
            "review_date": "2007-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good acting, high re-watchability.",
            "review_date": "2007-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had so much potential but bad acting let it down and the oh-so-clever plot just didn't quite click.",
            "review_date": "2007-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Think that movies like Oceans[enter number here], The Score and others are watchable but are definitely more pomp than content, then you'll dig this one. Kinda reminds me of the Steve Martin oldie \"Dirty Rotten Scoundrels\" in spirit.",
            "review_date": "2007-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie, good portrayl of cons in BsAs.",
            "review_date": "2007-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great script, too bad we lost bielinsky...he was the most talented argentinian director.",
            "review_date": "2007-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best swindle story I have ever seen, with my only small qualm with it being that the ending is tacked on and unnecessary.  My highest recommendations for this film if you you don't mind subtitles.",
            "review_date": "2007-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the american remake. This version has class and style but doesnt have maggie gyllenhall",
            "review_date": "2007-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Argentinian version of the Sting.  Twisting, convoluted, and a heap of fun, it's quietly one of the best thrillers ever made.",
            "review_date": "2007-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't expect a thing and then suddenly; wham! - the scammed people got their revenge in the end.",
            "review_date": "2007-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "watch this not criminal , criminal is a bad adaptation!!!!",
            "review_date": "2007-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually saw Criminal first, without realizing it was the English version of this movie. In spite of that, I completely loved this movie and it was totally enjoyable.",
            "review_date": "2007-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest heist movie ever",
            "review_date": "2007-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Proud of my homies. But don't stop with this one, there's a lot more to watch from Argentina.",
            "review_date": "2007-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do yourself a favor and  rent this movie.",
            "review_date": "2007-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly keeps you guessing.",
            "review_date": "2007-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great movie to start out if you want to watch a foreign film.  One of my professors said it is named one of the top 10 best con movies ever.  Some director in the United States tried to make a re-make, but it didn't take.  Watch this one - it blows Oceans 11/12/13 out of the water!",
            "review_date": "2007-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Take The Game and The Sting, mix well, add shitloads of talent and this is what you get. Damn good.",
            "review_date": "2007-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the first foreign films I ever watched, and was a nice introduction to non-English movie watching. It's clever and funny, and I highly recommend it. Not as deep or artsy as some other foreign flims, but I think it is worth at least one viewing.",
            "review_date": "2007-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love it for its innocence!",
            "review_date": "2007-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its too bad the director commited suicide because I would have loved to have seen more from him.",
            "review_date": "2007-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very re-watchable, very fun, and ultimately, surprisingly humane. To be fair, was it not for the \"kid inside the train\" scene right before the movie ends, Juan, as a character, would be nothing but a plot-devise. Alas, this crucial scene exists. It is like the final shot of Alain Delon in Melville's \"Le Samourai;\" without it, the humanity of the protagonist would be non-existent.",
            "review_date": "2007-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "loved the ending!!!\r\nthey actually filmed one scene in my aunt's house. mi tia dice que pauls es un enano!!!",
            "review_date": "2007-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "kept me interested untill the end of the credits... GREAT movie!!!",
            "review_date": "2007-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is before The Oceans Eleven trilogy!",
            "review_date": "2007-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THE BEST LATIN AMERICAN MOVIE EVER!!!Fabian Bielinsky a great director, actors A+",
            "review_date": "2007-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, one of the best surprise endings.  Not as shit-your-brains-out surprising as, say, the end of Usual Suspects, but still substantial.",
            "review_date": "2007-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretty sweet. if you like snatch, and dont mind foriegn films...",
            "review_date": "2007-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good film up there with \"The Sting\" in terms of con-trick films. Certainly outsmarts the likes of the Oceans franchise. A couple of swindlers team up to try and pull off a massive scam but have to try and evade various other tricks and scams from others and themselves. The end twist is a great one, the biggest scam of all for Argentina.",
            "review_date": "2007-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if i didnt love firefly so much, this movie would be my #1 movie.  ive seen this movie more times than any other movie.",
            "review_date": "2007-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant and envitingly amusing!",
            "review_date": "2007-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without hesitation the best Argentinean movie ever!!!! You have to see it,period!",
            "review_date": "2007-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute romp from Fabian Bielinsky (who sadly won't be making any more movies) following a pair of small time con men who plan to step up to the big time - big time. With a superb twist at the end, this is definitely a movie to watch twice.",
            "review_date": "2007-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie, really smartly done! wayyyy better than that thing they did in Hollywood to try to catch up",
            "review_date": "2007-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, very slick and intelligently acted. Would def watch again.",
            "review_date": "2007-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "YOU HAVE TO SEE THIS MOVIE... its one of the best argentinian films i have ever seen... its gonna get you captivated from begining to the end... its amazing",
            "review_date": "2007-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nice little twists along the way",
            "review_date": "2007-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent con movie, great plot and mind blowing ending. a must see",
            "review_date": "2007-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart, funny, and full of clever surprises. Truly an Argentinian gem.",
            "review_date": "2007-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulously slick con film. Very enjoyable.",
            "review_date": "2007-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best foreign films of all time, 'nuff said",
            "review_date": "2007-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like an Argentinian Usual Suspects. Slick and well-acted",
            "review_date": "2007-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty, continues to grow in scale throughout the movie from a tiny pick pocket adventure to a full-on crime saga, also has a great jaw-dropping \"Oh Shit\" ending.",
            "review_date": "2007-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You need to see this movie.  It's smart, fun, and brimming with clever twists.  The acting is subtle and there are no fancy special effects--it's all dialogue and double-crossing.  Rent this!",
            "review_date": "2007-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "such a good movie! true argentinean witt!",
            "review_date": "2007-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wish I hadn't already known the end (the original Argentinian version of Criminal)",
            "review_date": "2007-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the remake is much better.",
            "review_date": "2007-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DOPE!!!!!  Step your spanish film game up!!!!",
            "review_date": "2007-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An largely undiscovered gem from Argentian director Fabian Bielinsky (who tragically died after making only two films), this film about a pair of small time con men who get in over their head is extremely enjoyable. The twists and double-crosses are quick and interesting making up for the sometimes sparse surroundings. One of my favorite films, which makes me sad to think of what more might have come from Bielinsky. (Also check out his second film \"The Aura\" it is also fantastic.)",
            "review_date": "2007-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An awesome movie that you can tell someone put thought into.  It keeps you interested throughout the entire movie.",
            "review_date": "2007-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lower budget but way better than oceans 11",
            "review_date": "2007-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best con movie I've ever seen.  The levels to this film are only revealed in the last minute.  If you don't speak spanish it is worth following subtitles for this film.",
            "review_date": "2007-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film about 2 conmen conning each other.  Worth seeing again.",
            "review_date": "2007-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A neat and simple heist movie and probably the best Argentinean movie of all time.",
            "review_date": "2007-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genius flic about con artists that ends up tricking the viewer. You'll have to watch it twice to catch how well it works. One of my favorites.",
            "review_date": "2007-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply a great film that keeps you guessing until the very end.  Great social commentary on Argentinian government as well.  Not to be overlooked in the foreign film section of your local video store.",
            "review_date": "2007-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of the best con movies out there,it was depressing how bielinsky died after making two movies, RIP",
            "review_date": "2007-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great plot! very simple, not many special effects but catches enough attention. I think it's really easy for me to relate because being from Argentina, I can totally see how characters act just as people do in real life over there. Ive seen the american version of it and it sucks, the way the characters do things in the movie would not work in this country. \nOne of my favorites. Suspense. and a good ending.",
            "review_date": "2007-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever little French flick about a couple of con-artists. Quite a classic approach, no special effects or camera work, but gets it right.",
            "review_date": "2007-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fun, exciting heist flick that totally delivers without relying on the fluff of big explosions or senseless violence. expertly staged and acted, i loved all the tight little plot twists.",
            "review_date": "2007-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of if not the best con man film i've seen.",
            "review_date": "2007-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love it when I can't see the twist coming.",
            "review_date": "2007-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So good and original!!!!! It keeps you guessing every part of it and it just blows you away in the end!",
            "review_date": "2007-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A con movie that does a good job of keeping interest throughout.  The plot was well thought out.  From what  I can tell the acting is good.  It's always difficult to tell how good acting is in a foreign film.  I thought the twist at the end was too predictable.  Still a good movie with a lot going on.",
            "review_date": "2007-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Argentinian director Fabián Bielinsky made two movies so far which are both fantastic. This is his first movie which is about the world of con. This is so original and enjoyable piece of cinema that you won't understand how the two hours have passed. There is a remake of it called \"Criminal\" which is exactly the same movie but with different actors and  in english. Avoid the remake see the original, you won't regret.",
            "review_date": "2007-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie... love movies that I don't figure out, at least, until the middle...",
            "review_date": "2007-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hadn?t realised the film CRIMINAL was a re-make, of course it didn?t take me long to realise that this was the original film.  I usually prefer to watch the original first, but found both equally entertaining and enjoyed both portrayals of characters in each film.\r\n\r\nAlways enjoyed the ending to this one.",
            "review_date": "2007-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "US version 'Criminal' not as good even though Maggie's in it",
            "review_date": "2007-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a Really good argentinian movie",
            "review_date": "2007-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[size=3]Well let me just begin by saying that I had no real desire to see this film, but when I began watching it on IFC, I was immediately swept away by the fast pacing, brilliant acting, and excellent direction from Fabian Bielinsky. The film closely resembles in my mind some of the greatest con-man movies in cinema: The Sting, The Grifters, etc... and this film is no prohibitor to the success of the growing legacy. [/size]\n\n[size=3]\"`Nueve reinas' or `Nine Queens,'a film made in Argentina on a shoestring, is one of the most elaborate and authentic grifter/con films ever made, and I don't know if I could explain it if I wanted to. In fact to explain it would be to ruin it for anyone who hasn't already seen it, because each successive grift is a surprise, and it's only after one has seen it that one wants very much to discuss just what it is that happened all through and above all what that final sequence means. It is the gift of `Nine Queens' to pile surprise on surprise on surprise until it seems that the grifters are the victims of their own grift at every stage of the long fascinating game. This is not a parable about cons but a literal con. It's the real thing. Stories about grifters or con artists, like, say, the excellent Stephen Frears movie, `The Grifters,' (1990), or the ingenious David Mamet movie, `The Spanish Prisoner' (1997). or Fred Schepisi's illuminating `Six Degrees of Separation' (1993), have some point to make, but the only point of a real con is that the con artist can never be trusted and his victims can always be fooled, and it's the essence of dealing with such people that you realize at some point that nothing they said was reliable, from the very first word. This is the way it is with `Nine Queens,' and that's what makes it such a classic movie and such an ultimate depiction of the world of the grifter. And so the movie becomes a kind of parable after all, because as Calderón said, Life is a dream and a dream of a dream, and as I would like to point out for those who I hope will not find it too obvious, a filmmaker is a con artist too, because he sets out to make us believe that what he depicts is real, which it is not, and that his actors are the people they portray, which they are not. And so a con artist is a perfect role for an actor to play.\n \nPerhaps Fabián Bielinsky, the creator of `Nine Queens,' who's less famous than Mamet and Frears and Schepisi, is therefore more modest, and is therefore able to focus on the con within the con without making any point besides conning us through to the end of this ingenious story. The actors are not famous, but like any actors worth their salt they are convincing and charismatic enough to hold our attention and make us believe that they are doing what they say they are. The very simplicity of the production and modesty of the actors (not of their skills, which are excellent, but of their reputations, which are minor) aid in convincing us of the audience that the scenes we are watching are or could be quite real. The story begins when a younger man who has been conning the staff of a convenience store gets caught in his con, and an older man comes in successfully posing as a policeman and takes him away, thus freeing him from the clutches of the store manager and staff. Thus two con artists, Juan, the younger man, and Marcos, the older one, meet and form an alliance, in which Marcos enlists Juan's help in a scheme he has yet to explain.\n \nAt one point early on Marcos makes a phone call when Juan is out of earshot and he says only, `It's on.' What? Do we ever find out? What is clear from that moment, if not before, is that no alliance between con artists is a sharing of trust.\n \nThe ultimate lesson to be learned from `Nine Queens' is that no one is more gullible than a con man \u0096 that grifters, in order to con people, have to be able to believe in their own fabrications, and thereby they become potential victims of the grift. Eventually the two deceivers are led to a set of stamps of great value called `The Nine Queens,' which they set out to sell to a very rich man visiting from Spain called Gandolfo. Gandolfo seems almost ridiculously eager to purchase these items from these fellows who have no pedigree or legitimate provenance. But herein lies another truth, that greed \u0096 in this case the rich collector's greed to obtain a prize item by any means necessary \u0096 will lead men to take unreasonable risks. Everyone once a con is afoot is eager to make a profit, and both con artist and victim want to believe they have found a wonder at a bargain price.\n \nIt is essential to the value of the movie that we in the audience realize only at the end that the con is on us. \n \nNo story is more focused than this one. Like a picaresque tale it moves from moment to moment: each moment is a transformation, and must be watched with riveted attention because it will change what comes next. Such a simple and effective means of constructing a movie! Yet how rarely are such means put to such good use! `Nine Queens' has etched a small but permanent niche for itself in the history of cinema.\n \nThis is a mean and ugly world, which at the same time is utterly fascinating and compulsively watchable. Can people really be like this? Indeed they can. And the interest with which we watch it all happen shows that we are made of the same cloth.\" - Chris Knipp[/size]\n\n[size=3]:fresh: 3.5/4 stars[/size]",
            "review_date": "2007-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterpiece. Plain and simple. Compeling story with clever twists that'll make you suspect from every character and make your jaw drop. Gastón Pauls is great as young & naive Juan, but the movie belongs to Ricardo Darín; proving himself once again as one of the finest actors in Latin America. If you're looking for a con movie as good as \"The Sting\" look no further, this is a worthy heir.\n\nP.S. Don't even bother watching \"Matchstick Men\" or \"Criminal\" (\"Nine Queens\" remake).",
            "review_date": "2007-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "liked it better than the hollywood version",
            "review_date": "2007-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie makes you interested right away. its about his life. teh end is so good!",
            "review_date": "2007-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You wanna know what Argentines are like - this is the flick to see!! the masters of con jobs",
            "review_date": "2007-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent, smart con film. Great ending.",
            "review_date": "2007-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*so* much better than american remake.",
            "review_date": "2006-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Con artists continuosly looking for who to swindle next... and they are so good. Fast-paced action and suspense, this is a great movie.",
            "review_date": "2006-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know if I would call this a masterpiece but it was entertaining. I would not have guessed the ending and doubt you will either. Left one star off only because when I was forced to watch it a second time, I remembered it was actually my third time! \r\nI have taken Criminal off my must see list.",
            "review_date": "2006-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite movie of all times!  Thievery, trickery, and a surprise ending!",
            "review_date": "2006-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great thriller...I enjoyed it a lot. very good story and very creative, watch it!!!",
            "review_date": "2006-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When young con-artist Juan who plays in the little leagues is approached by master criminal Marcos to forge a partnership for the day, the pair end up with an expert forgery of the Nine Queens, a sheet of stamps that is worth a lot to collectors, and a unknowing buyer for them. However, despite being innovative, young Juan has a conscience and he isn't sure if he can trust his superior not to con him out of his share of money when everyone seems to be conning someone else. Will they get the money and will it all end smoothly? Well, if I told you that, it would ruin the ending! This time, rather than my usual Asian reviews, this film is Spanish and is definetely worth watching.",
            "review_date": "2006-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nine Queens is fast paced and very cool(especially the cons they pull). THe first film in long while where I've been pulled in and sat ont herdge of my seat wondering what would happen next. Heaps of suspense and suspicion which leads to a great ending(though not surprising).",
            "review_date": "2006-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[font=Arial][size=3][size=5]Nine Queens (Bielinsky, 2002)[/size]\n     [img]http://pages.slc.edu/%7Emnegroni/c02_artandpolitics/argentina/ninequeens/ninequeens2.jpg[/img]\n     T-Meter [img]http://images.rottentomatoes.com/images/user/smilies/fresh.gif[/img]92%\n     My Rating [img]http://images.rottentomatoes.com/images/user/smilies/fresh.gif[/img]8/10\n     \n  [i]Nine Queens[/i] takes cues from [i]The Sting[/i] and [i]The Usual Suspects[/i] to create a really engaging story about two con men trying to sell a valuable set of stamps. Like all these types of films, it has funny tricks, witty dialouge, and of course, a jaw-dropping ending that I tried to guess before it happened, but I failed miserably. Nothing really sets it apart from its predecessors, other than that its a French film, but it is refreshing to see those type of movie done well for the first time in awhile.\n  \n  [size=4]   Terminator 2: Judgement Day (Cameron, 1991)[/size]\n     [img]http://i98.photobucket.com/albums/l241/BryceTheCyclops/T2.jpg[/img] [/size][/font][font=Arial][size=3][img]http://i98.photobucket.com/albums/l241/BryceTheCyclops/RobPatrick.jpg[/img][/size][/font][font=Arial][size=3]  [img]http://i98.photobucket.com/albums/l241/BryceTheCyclops/38bca347c09be.jpg[/img]  \n     T-Meter [img]http://images.rottentomatoes.com/images/user/smilies/fresh.gif[/img]96%\n     My Rating [img]http://images.rottentomatoes.com/images/user/smilies/fresh.gif[/img]10/10\n     \nNot quite as scary as it's predecessor, but the special effects and action sequences are better. [/size][/font][font=Arial][size=3]Arnold and everybody else give good performances. My favorite scene is the first chase between John, the T-101 and the T-1,000. [/size][/font][font=Arial][size=3]Cool is the one word that sums up this movie perfectly,\n\n[size=5]     Tomorrow (Anthony, 1971)[/size]\n     [img]http://www.digitallyobsessed.com/cover_art2/tomorrow.jpg[/img]\n     T-Meter N/A\n     My Rating [img]http://images.rottentomatoes.com/images/user/smilies/fresh.gif[/img]9/10\n    \n  [/size][/font][font=Arial][size=3] Based off the [/size][/font][font=Arial][size=3] William Faulkner [/size][/font][font=Arial][size=3]short story of the same name,[/size][/font][font=Arial][size=3][i]Tomorrow[/i]  is a vastly underrated gem that stars Robert Duvall as a slow-witted farmer named Jackson Fentry. Take the voice of Karl from [i]Sling Blade[/i], put it in Duvall's mouth,  and add the great love story of [i]Forrest Gump, [/i]and you get this film. It's slow-pace bothered me at times, but the authentic cinematography of backwoods, [/size][/font][font=Arial][size=3]Depression-era [/size][/font][font=Arial][size=3]Mississippi, Duvall's excellent performance, and the amazingly well-written ending are what really made the film special for me.\n    \n    [size=5]The Terminator (Cameron, 1984)[/size]\n    [img]http://i98.photobucket.com/albums/l241/BryceTheCyclops/terminatorsepic9.jpg[/img] [img]http://i98.photobucket.com/albums/l241/BryceTheCyclops/terminatorsepic10.jpg[/img]\n    T-Meter [img]http://images.rottentomatoes.com/images/user/smilies/fresh.gif[/img]100%\n    My Rating [img]http://images.rottentomatoes.com/images/user/smilies/fresh.gif[/img]10/10\n    \n    This is one of the first movies I remeber watching as a kid. It scared me then and it scares me now. Arnold gives his finest performance as the terminator. Totally cold, calculatiting, and evil.  Not only is it one of the the best science fiction films, it's also one of my favorites.\n\n[size=5]    Nosferatu (Murnau, 1922)[/size]\n    [img]http://i98.photobucket.com/albums/l241/BryceTheCyclops/nosfer31.jpg[/img] [/size][/font][font=Arial][size=3][img]http://i98.photobucket.com/albums/l241/BryceTheCyclops/Nosferatu1922-01.jpg[/img][/size][/font][font=Arial][size=3] \n    [img]http://i98.photobucket.com/albums/l241/BryceTheCyclops/nosfer15.jpg[/img]\n    T-Meter [img]http://images.rottentomatoes.com/images/user/smilies/fresh.gif[/img]100%\n    My Rating  [img]http://images.rottentomatoes.com/images/user/smilies/fresh.gif[/img]10/10 \n  \n  You don't just watch films like[i] 2001: A Space Odyssey[/i], [i]Apocalypse Now[/i], and [i]Taxi Driver[/i], you experience them. They completely entrance you from the opening frame to the last, making you entirely forget that you're at your sitting on your living room floor. F.W. Murnau's [i]Nosferatu[/i] is one of those films. It's heavily Gothic cinematography and tone would make Edgar Allen Poe proud. It certainly worked for me, as the film's huge arches, shadowy figures, and driving music will forever be etched in my memory. Max Screck's performance is one of the creepiest I've ever seen.  I can't wait to hopefully see Herzog's version later this month. [/size][/font]",
            "review_date": "2006-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classy movie. Even better when you don't know the ending",
            "review_date": "2006-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well placed thriller. Quite unsure about the ending, though.",
            "review_date": "2006-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great con movie, in Spanish.",
            "review_date": "2006-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "comparisons don't typically make for good reviews but honestly, i think el aura is superior to this movie. i'm not saying that nueve reinas was bad tho, it's a great flick, darin pulls off another great performance but the plot is a lot more accessible and predictable at times. it's a shame that bielinski's gone, he was just starting to move towards insanely unique directions.",
            "review_date": "2006-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVED this flick! Set in Buenos Aires, it's really an interesting movie that makes you pay attention. Long live the Argentinian filmmakers!",
            "review_date": "2006-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The less you know about this film, the better.  \nOne of the best of it's genre.",
            "review_date": "2006-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best 35 mm features that Argentina haves to offer the world. To prove that there's no need to be North American to know how to act",
            "review_date": "2006-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an ending!!! There are so many cool twists in this movie that it's improbable that anyone figures out the end until.....well......they get to the end of the movie.\r\n This film is highly entertaining and very well constructed. But THAT ENDING.......that's what put it over the top for me. I highly recommend this one to everyone. \r\nFYI: If you see this movie first, don't even bother watching the crappy remake \"Criminal\". I think the only people that like that movie are the ones that haven't seen Nueve Reinas.",
            "review_date": "2006-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent!!! from 1st scene (chainsmoking) to the very last (nice twist btw)...\"wing izquierdo...yo queria ser complice\"",
            "review_date": "2006-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great film, love the twist ending",
            "review_date": "2006-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to say this is one of the best movies i have seen in my life, is just splendid, is perfect cinema. Nine Queens (Nueve Reinas in spanish), is the perfect example of why i love to go the movies ~~",
            "review_date": "2006-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Argentinian con-man film Jack and I enjoyed back at Electric Shadows. Too many scams to count in this one that travels on 'Sting'-style until we're never sure who the victims are. Great entertainment which kept us on the run all the way through - should have scored more wraps than it did, we thought.",
            "review_date": "2006-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like this too, you will definitely want to see CRIMINAL, the American remake.  It's fun to compare and contrast.",
            "review_date": "2006-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a lot of fun!  Pay attention, because the plot twists a bit, but I was surprised by how much I enjoyed this.  Maybe it was just me, or the fiesta food in the Spanish room, but I thought this was a very fun/funny film.  Love the scams.",
            "review_date": "2006-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "gaston pauls, i love him since he was alejandro, in montaña rusa",
            "review_date": "2006-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW - This requires perhaps a little concentration to follow but is a delight. This is the BEST 'big-twist at the end' movie i've ever seen. And I'm not going to give it away...",
            "review_date": "2005-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw Nine Queens last night.... it was ok. It's your prototypical con movie, but made in Argentina. It's the kind of movie that some people will watch and say 'if only they made movies like this in Hollywood'... which would be fine, except they make plenty of movies like this in Hollywood. Nine Queens is basically Confidence with subtitles and without Rachel Weisz. I really like the genre, so I was entertained, but also a little bit disappointed. It's certainly not in the same class as House of Games or The Grifters, the two masterpieces of the genre.\n    \n The movie is well acted, and put together competently. As most of these, it's plot driven - none of the characters are especially well constructed. There's a point in the movie where the only buyer they have for their fake stamps exercises his oligopsony*** power and starts making unreasonable demands. This is supposed to set up the big emotional payoff, but for some reason, it just didn't hit me that hard.\n    \n In any case, it's definitely worth a watch, especially if you like con movies. But I think that a lot of the reviews have oversold it, mainly because of where it's from and how it was made...\n    \n Darwin's doing really well. He's eating better than he has in a long time, which is really encouraging. Because of the chemotherapy, he's radioactive right now... which got me thinking: in Repo Man, maybe it wasn't aliens in the trunk at all - maybe it was just radioactive cats that gave off that green glow...\n    \n    [img]http://users.erols.com/bobcan/repo/Repomandvd1.jpg[/img]\n  \n  And by the way, if you like Repo Man, [url=\"http://users.erols.com/bobcan/repo/repoman.htm\"]you gotta check out this website[/url]!\n    \n    ***I got this email from Boob a couple of days ago:\n    \n        So, I challenge you to use this word in your next entry! :)\n     \n     -------- Original Message -------- \n   Subject: A Word A Day--oligopsony\n   Date: Wed, 8 Jun 2005   \n     \n     oligopsony (oli-GOP-suh-nee) noun\n   \n      The market condition where a few buyers control the market for a product.\n   \n   [From Greek oligo- (few, little) + opsonia (purchase).]\n   \n   A word that shares the same prefix is oligarchy: government by the few,\n   where political power is held by a small group and used for selfish and\n   corrupt purposes.\n   \n     \"Does a joint Internet venture by the world's automakers to purchase\n      parts amount to an illegal oligopsony--a cartel of buyers that can\n      drive prices down through their market power?\"\n      James V. Grimaldi; Trustbusters Put On a Stern Face; The Washington Post;\n      Jun 29, 2000.",
            "review_date": "2005-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a poor excuse for a weekend. [b][i]ONG BAK[/i][/b], [b][i]OLDBOY[/i][/b], and [b][i]KUNG FU HUSTLE [/i][/b]have not yet reached my local arthouse theater, because it's a piece of shit that would rather let [b][i]THE PHANTOM OF THE OPERA [/i][/b]play for nine weeks instead of getting new, exciting films. Fucking conventional bastards............and on top of that, I've lost my cellphone. Just completely misplaced that sum-bitch. I'm such a fucking fool.\n \n [i][b]SHE HATE ME [/b][/i]is the first Spike Lee film I've outright hated. Hell, I've never disliked any of his other films until this one. He has made exactly four masterpieces in my opinion.\n [i][b]25th HOUR\n MALCOLM X\n DO THE RIGHT THING\n HE GOT GAME\n \n [/b][/i]So I started this on Friday, and I got excited. The beginning is great. Hell, the opening montage itself is excellent. There is one scene in the film that is so brilliant it belongs in another, better film. The scene in question is a flashback of sorts to a black security guard stumbling onto the Watergate scandal, and then a man in a Richard Nixon mask shows up with various members of the scandal that went on to have great careers. It's a brilliant scene, brilliantly photographed, brilliantly written. Too bad it goes downhill from there. Actually, I never thought I would ever say this in my life, but when the lesbians show up, this film does a complete 180 into dumbass idiocy. There is no way Spike Lee directed the second half of this film. At least, that's what I hope. It gets so lazy and so stupid in the second half that you're tempted to think that Spike ran into a film school student at a Knicks game and let him finish the second half of the film, it's that bad. Great first half. God-awful second half.\n \n [b][i]NINE QUEENS [/i][/b]is an incredibly engrossing heist film from Argentina that I must say, fooled the shit out of me. It does have your typical double and triple and quadruple crosses, but the ending is genuinely surprising. A good little flick for fans of a good heist flick that doesn't try to go all Mamet on us and try so terribly hard to be clever. We all know my disdain for the Mamet.\n \n [i][b]THE INCREDIBLES[/b][/i]. Wow. That's really all that needs be said. Really.\n \n Hopefully, HOPEFULLY I'll get to see one of those first three films I mentioned this coming weekend. I do know one thing for certain. I'm going to see that masterpiece called [b][i]SIN CITY [/i][/b]again this weekend. Probably two more times. It's astounding how much I've masturbated all over that flick already, and it hasn't even officially come out yet. It's that fucking good, ya hosers.",
            "review_date": "2005-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Spanish-speaking film I ever saw!",
            "review_date": "2004-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[b]City of God[/b]\nDistrubing to watch...but too exciting not to watch.\n \n \n[b]The Emperor and the Assassin[/b]\nLengthy...drags a tad in some parts...but an interesting and beautifully shot film.\n \n[b]Iron Monkey[/b]\nKickass kung-fu fighting. Dig that renegade monk with his Flaming Palm of Buddha move.\n \n[b]Nine Queens[/b]\nNifty little con flick.\n \n[b]Samurai[/b]\nI can't understand how I never heard of this film...it's an awesome piece of work. First in a trilogy. The second one was mediocre and I have yet to see the third.",
            "review_date": "2004-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[color=#8b0000][color=black][u][i]Nine Queens [/i](Fabian Bielinsky, 2002)[/u][/color] [/color]\n[b]Nine Queens[/b], a cool new Argentinean crime flick about a clever duo of con artists who team up for a day and night of scams in Buenos Aires, follows in the long Hollywood tradition of caper movies like [i]Thief[/i], [i]Reservoir Dogs[/i], [i]Sexy Beast[/i], and every second David Mamet film. As expected, it features the requisite number of tricky twists and turns. As expected, the plot is dense and convoluted, and the characters are pawns that play and are played by the game of crime.\n \n[i]Nine Queens[/i], though, is more deep and polished and atmospheric than many of these crafty shell games. As played marvellously by Ricardo Darín and Gastón Pauls, respectively, Marcos - a quick-witted, 40-ish pro in the art of suggestion, who sports a goatee and a black tie - and Juan - a young, proud, baby-faced hustler who's new to the game, yet not inexperienced at it - come to life vividly and realistically. From the time they meet in a 7-11-ish convenience store up until they try to pawn of a forged set of valuable stamps (the Nine Queens of the title) for $450 000, these guys are really believable as devious, cunning, and also desperate and vulnerable con men - humans instead of mere ciphers.\n \nFabián Bielinsky, a first-time feature director, also infuses the film with gritty visual atmosphere. The movie has a squalid, urban-greed-hits-the-dirty-streets mood and an ambiance of made-in-Argentina authenticity that lends its cons a certain voyeuristic kick. [i]Nine Queens[/i], at its best, looks and feels real, whereas too many heist films are just proud to be unbelievable. \n \nThe plot here is the usual hard-to-follow assemblage of assorted intertwined twists. Everybody cons everybody else in this greedy world of lies and trickery. The lively, believable characters and authentic atmosphere of [i]Nine Queens[/i], however, make it a true jewel worth snatching. [b]B+[/b]",
            "review_date": "2004-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another really good movie from South America.\nGreat story - fantastic ending!!!\nSee it.\nI give a percentage of 99.9% of you not thinking you've lost any of your (valuable) time. A movie as clever as it gets.",
            "review_date": "2004-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[COLOR=White] I just finished watching Nueve Reinas, great movie. If you haven't seen it yet, check it out.\r\n\r\nI got another job offer today, maybe I'll actually get to take this one. That is, if I can get my ID situation handled. Wonky Virginian DMV. I spent most of the day kicking various shapes of ass in video Games.:cool: Virtua Fighter, Soul calibur,Super Smash bro's, even wack ol Tekken 4. That game is outdated like zip drives.   I hate how the engine stutters between moves. There's no sense of speed, no flow. I doubt there will be a Tekken Five, but I know I'm wrong. Well, another boring day, another boring entry. I'm meeting some people for training tomorrow so maybe I'll be able to post about a new injury or two.\r\n\r\nGod bless this Fall Weather. And God bless Fashion photographers.  I adore the way they frame their shots. Oh, but God kill the airbrushing of models.[/color]\r\n\r\n[img]http://invis.free.anonymizer.com/http://www.celebwelove.com/Naomi_Campbell/nc02.jpg[/img]\r\n\r\n*drool* regardless :rolleyes:",
            "review_date": "2003-10-23",
            "source": "rt",
            "lang": "en"
        }
    ]
}