{
    "rating": 8.6,
    "release_date": "2002-07-12",
    "num_reviews": 190,
    "genres": [
        "Crime",
        "Drama"
    ],
    "summary": "Mike Sullivan (Tom Hanks) is an enforcer for powerful Depression-era Midwestern mobster John Rooney (Paul Newman). Rooney's son, Connor (Daniel Craig), is jealous of the close bond they share, and when Mike's eldest son, Michael (Tyler Hoechlin), witnesses a hit, Connor uses the incident as an excuse to murder Sullivan's wife (Jennifer Jason Leigh) and youngest son. Forced to flee, Sullivan and Michael set out on a journey of revenge and self-discovery.",
    "reviews": [
        {
            "content": "The greatest 01 hour: and 56 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "To me, ROAD TO PERDITION isn't about revenge or anything out of the ordinary. It's about the sheer power of the bond between father and son, and that is what gives the movie so much strength on the long run.",
            "review_date": "2023-04-10",
            "source": "rt"
        },
        {
            "content": "A great movie. Hanks is so good.",
            "review_date": "2023-04-10",
            "source": "rt"
        },
        {
            "content": "Incredible story with amazing performances by the cast.",
            "review_date": "2023-03-20",
            "source": "rt"
        },
        {
            "content": "Hanks as a mafia guy...totally miscast. Bad movie.",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "Good message; plot is slow and drawn out.",
            "review_date": "2023-02-08",
            "source": "rt"
        },
        {
            "content": "Tom Hanks recently said that no ever talks about this movie.  It is one of my favorites.  I love the storyline behind the gangster family. The strange love  among the gangster family and the true love  of his own family.  I hate that the His character had to be killed, but I know it was necessary.  Just a different happy ending.  Still moving and brings tears to my eyes even today.  Love it Tom, one of your best bad /good guys.",
            "review_date": "2023-01-22",
            "source": "rt"
        },
        {
            "content": "Excellent cinematography & music.  This is masterpiece",
            "review_date": "2023-01-06",
            "source": "rt"
        },
        {
            "content": "Sam Mendes dirige un film cupo ed elegante come il suo protagonista Tom Hanks.\nI personaggi e la sceneggiatura sono assolutamente di qualità, senza pecche e nonostante la velocità del thriller non sia elevata, non ci si annoia nemmeno per un secondo, affascinati da ogni singola scena.\nLa trama riesce a mescolare insieme un viaggio on the road, un revenge movie, un gangster movie e tante altre cose, non meno importante finisce per essere uno splendido dramma di formazione per il giovane ragazzo.\nSe ne vorrebbe ancora di più, l'avvio verso il finale mette la soddisfacente inquietudine di sapere che qualcosa di bello sta per finire.",
            "review_date": "2022-12-21",
            "source": "rt"
        },
        {
            "content": "Stylish, excellent, brilliant. The photography is fantastic. The simple soundtrack fits it beautifully.",
            "review_date": "2022-12-06",
            "source": "rt"
        },
        {
            "content": "An excellent film with great themes. Beautifully directed! Sam Mendes is one of the most creative directors in Hollywood, and this film is a good example. Hanks gave what I believe to be one of the better performances of his career, and the rest of the cast was also excellent. The cinematography was beautiful as well.",
            "review_date": "2022-11-13",
            "source": "rt"
        },
        {
            "content": "Powerhouse performances from Newman, Hanks and Law. Assuring direction from Sam Kendra, arresting visuals by Roger Deakins.",
            "review_date": "2022-10-04",
            "source": "rt"
        },
        {
            "content": "Big MAC Triumph\n\nSam Mendes did a great job of bringing Max Allen Collins graphic novel to life. MAC is a superb noir writer, creator of Quarry, collaborator with Mickey Spillane and a large number of novels integrating real (like Elliot Ness) with fictional characters and events. \n\nRTP is a story of fathers and sons. Paul Newman plays an Irish gang boss with a mean, killer son Daniel Craig, while Tom Hanks plays his best hitman Sullivan who has nosey son of his own. Sullivan's son sneaks along while Daddy and Craig make a fatal visit to one of their lackey's gone astray, and sonny boy sees the hit. This sets off an irreversible spiral of death and destruction that gives the already gloomy story an inevitable. biblical twist. Will Sullivan's son be spared? Will Newman allow his own horrible son to be cut loose? \n\nIt is more than a touch gloomy and the casting, script and camera work don't provide much relief. Newman and Hanks are excellent, as is Stanley Tucci as Capone's man Frank Nitty, and Jude Law as a sick hit man hired to snuff Hanks. But that's the thing that makes it new noir - that inevitable ending you can see coming miles away. So kudos all around - half a point off for too much rain. Not an uplifting experience but a hell of a movie.",
            "review_date": "2022-09-30",
            "source": "rt"
        },
        {
            "content": "We (My friend and I) think this movie is amazing because we're really fond of action films. We liked it because the story wasn't boring at all. Our favorite part of the movie was the ending, which was very unpredictable and shocking. We couldn't stop watching because the movie was so thrilling. The acting of the actors was also very impressive.",
            "review_date": "2022-09-26",
            "source": "rt"
        },
        {
            "content": "Another hood crime movie. Great characters and the story kept you engaged.",
            "review_date": "2022-09-15",
            "source": "rt"
        },
        {
            "content": "The cinematography is definitely its best feature but the chemistry and interaction between the main characters is also powerful.",
            "review_date": "2022-08-10",
            "source": "rt"
        },
        {
            "content": "Directed by Sam Mendes who would later helm two of the rebooted James Bond films and American Pie is a gangster film but also looking at the close bond of fathers and sons \nBased on the acclaimed graphic novel of the same name by Max Allan Collins and Richard Piers Rayner \nA very young Tyler Hoechlin, Daniel Craig, Tom Hanks, Jennifer Jason Leigh, Dylan Baker, Jude Law, Stanley Tucci, and the late Paul Newman \nIn the winter of 1931 a young boy Michael and his father, Mike Sullivan are close \nThey live with their wife/mother and younger brother/second son \nSullivan is an enforcer for powerful Depression-era Midwestern mobster John Rooney\nRooney's son Connor is heavily neglected and just wants to make his old man proud \nHis jealousy grows and things go off the rails when Michael witnesses a murder \nThis presents an opportunity for Connor to kill Mike's wife and her second child \nNow both Mike and his son are on the run set out for revenge but learning to discover what they're both made of in the process \nIt's a grueling process to place our child's life above our own, every father is a hero to his son, every son holds the future for his father, the innocence of a son is surpasses only by the fathers will to save it,\nThis is a very dark and moody period piece \nNo joy to be had for a majority of this \nHanks is more of the active player here whereas Hoechlin kinda disappears half the time \nYet Mendes delivers a good enough throwback to classic noir thrillers \nThe title refers to the road to hell as it were, the road to physical decay \nFrom what I've heard it stays pretty close to the source material and it is beautifully filmed \nMaybe I just wanted more shootouts but considering when this is taking place it is more of a moody grim experience \nHanks really delves into playing a villainous person than we're used to seeing \nThe film asks can this father legitimize this situation; can his sons soul be saved from the lifestyle he's living? \nSlogging pacing aside this is an adequate entry by Sam Mendes with some fine actors",
            "review_date": "2022-07-12",
            "source": "rt"
        },
        {
            "content": "Some actors were perfectly cast while some where a little miscast namely Tom Hanks. The story was interesting and the directing was supurb. It's definitely worth seeing if you are a noir fan.",
            "review_date": "2022-07-10",
            "source": "rt"
        },
        {
            "content": "A decent period film about organized crime in the prohibition era. Ultimately, I felt it was far too predictable and lacked any real payoff in the conclusion.",
            "review_date": "2022-06-10",
            "source": "rt"
        },
        {
            "content": "Fully displaying the talent of the cast and the director, \"Road to Perdition\" is a gritty but entertaining gangster film that soars in just about every aspect. The acting is great from every single actor, with Hanks and Hoechlin being the main standouts of this film, though Law, Newman, and Craig also do very well too. The action is done fairly good, and the visual appearance and cinematography of the film is absolutely stunning. The humor is done well but sparingly, never going over the top but giving you just the right amount to not make you depressed through the runtime. Story was very great and had some very good messages to be told. The characters all carried emotional weight and seemed to have their own unique personality. My main issue is that the movie is just too long, or at least it feels that way. There are a number of scenes that are so clearly filler and could easily be cut out from the end product. Still, though, I ended up really loving \"Road to Perdition\" and would highly recommend it.",
            "review_date": "2022-06-02",
            "source": "rt"
        },
        {
            "content": "In \"Road to Perdition\" Mike Sulivan (Tom Hanks) works for a gangster named John Rooney problems during the levaivan Sulivan and Rooney working on opposite sides. In addition to the magnificent photography, the direction of Sam Mendes manages to mix the family and criminal drama very well throughout the film, transforming the entire trajectory into a sea of ​​emotions.",
            "review_date": "2022-05-15",
            "source": "rt"
        },
        {
            "content": "this movie doesn't get enough credit as a good mob movie. has one of the best execution scenes in cinema.",
            "review_date": "2022-05-10",
            "source": "rt"
        },
        {
            "content": "Old school, pre excessive CGI and wokeness story.  It probably deserves more stars for all the effort they put in to it, but mobster flicks are not my thing.  The story is fairly pedestrian - the mob killed my family so I will get revenge.  What makes this film a cut  above that is the effort and production values.  They did a phenomenal job with the period piece (although there was no real reason to set in the 30s).  Acting and the cast are all stellar.  The father son bond is understated and subtly grows over the movie with minimal talkiness - although they both got over the tragic shooting easily enough.  Jude Law was sufficiently creepy, although Hanks, who is this fast on his feet uber cold killer, suddenly runs away like a crybaby when confronted with Law, for no apparent reason.",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "The narrative really loses steam in the third act but it's a hearty experience nonetheless featuring some of the best night cinematography probably ever put to film.",
            "review_date": "2022-04-06",
            "source": "rt"
        },
        {
            "content": "Some enjoyable action sequences, but the plot was predictable and a bit muddled. The assassin should have been killed when he was rolling around on the floor after having shards of glass in his face, the bodyguards should have taken cover, I highly doubt the range on the tommy gun is that good, there's no way the main character wouldn't have been shot, and it was foolish of him to let his guard down when he reached the aunt's house. There were quite a few characters when it came to the criminals, and Daniel Craig's character, his father, and the assassin could have had more development. The son wasn't really believable. The acting, cinematography, visual effects, sets/props/costumes, and soundtrack were all reasonable.",
            "review_date": "2022-03-11",
            "source": "rt"
        },
        {
            "content": "This film can't decide wether it's a dark violent thriller or a family feel-good film. Still a good watch.",
            "review_date": "2022-02-28",
            "source": "rt"
        },
        {
            "content": "Exemplifies “show don’t tell” with assured grace & poise, using dialogue only when necessary. Eloquent use of focus & muted tones (like watching B&W in colour). Great tension, stellar performances, & a powerful conclusion. #nitrosMovieChallenge",
            "review_date": "2022-01-18",
            "source": "rt"
        },
        {
            "content": "No puedo creer que esta sea una película de DC. Con una gran trama, una increíble banda sonora y sobre todo una excelente actuación, la película se vuelve increíblemente buena, sintiéndose muy personal. Lo que mas me gustó de la película fue en como manejan la crudeza. Haciendo una gran reflexión de la misma en toda la película. No engrandeciéndola, si no mostrando su cruda realidad; Una trama que muchas veces parece ajena en las película de este estilo. Y desde mi punto de vista lo que hace especial a la misma. Sin duda otra cosa que eleva la película es el desarrollo y trasfondo que le dan a cada personaje; Mostrando a casi cada personaje con una sátira o una critica a la violencia, Centrándose en criticar de una manera estupenda el como se mueven o se movían los criminales en esa época; No solo mostrando su cara \"Negra\" si no en como cada antagonista ya sea hasta el protagonista tienen su lado bueno; El que los mueve y el porque. Sin duda una extraordinaria película.",
            "review_date": "2021-12-31",
            "source": "rt"
        },
        {
            "content": "Extremely well acted by everyone. Extremely well edited (this movie demands close attention from the viewer). Stunningly photographed. Magnificent sets and landscapes/cityscapes. Perfect soundtrack. This is not a gangster movie. It is a character study with a Depression-era, gangster backdrop.\n\nMy only small complaint is that Sam Mendes left a little bit too much of Jennifer Jason Leigh's character on the cutting room floor. Even though Mendes called her back to film additional scenes, the movie would have been better served if her importance to the central loss in the plot had been better established.",
            "review_date": "2021-12-18",
            "source": "rt"
        },
        {
            "content": "Disjointed...dark..dark..violence without end.   Hard to picture Paul Neuman,  German Ethnicity (and all time favorite actor) and Daniel Craig, British ,as American Irish ,Mobsters...only  redeeming feature..their equally piercing blue eyes.\nHanks, as Sullivan did pretty much clear up East Coast mob single-handedly .I could not make it work that mob members and ultimate killer always knew where Sullivan would be minute to minute.\nReally wanted to like this movie with 3 of my fave actors.",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "Beautifully written, beautifully acted, beautifully soundtracked, and last but certainly not least, beautifully filmed. Not so much a typical gangster movie, but a movie about fathers and sons, contrasting the choices the fathers have made and the eternal impacts of these decisions. Phenomenal performances from Hanks, Law, Craig, and the magnificentfinal onscreen appearance from Newman. A brilliant piece of cinema.",
            "review_date": "2021-10-21",
            "source": "rt"
        },
        {
            "content": "Great buildup and solid acting",
            "review_date": "2021-10-19",
            "source": "rt"
        },
        {
            "content": "An engrossing if joyless affair, Road to Perdition extracts good performances from its cast in order to craft one of the better mob films of the new century. Some of the references to real-life figures seem unnecessary and a bit distracting, but Hanks's central performance holds the film together and the rough patches are certainly outweighed by the good ones. Some aspects of Hoechlin's character reeked of coming-of-age cliches, but I enjoyed the slight subversion of expectations in his character arc. Law plays a surprisingly good creep and I liked Newman in his late-career supporting role as Rooney. Daniel Craig does a good job although I expected him to have another scene or two to explore his character. Overall, this is a solid outing form Mendes and I look forward to watching American Beauty.",
            "review_date": "2021-09-25",
            "source": "rt"
        },
        {
            "content": "Gorgeously shot and edited, Road to Perdition can occasionally be a tad predictable, but is a satisfyingly crafted gangster film/coming-of-age story nonetheless.",
            "review_date": "2021-08-28",
            "source": "rt"
        },
        {
            "content": "Beautifully shot and well-written story about a gangster trying to save himself and his son from his old mob boss. The interaction between Tom Hanks's character and his son is touching very touching in the film and their relationship becomes really impactful for the viewer with the final scene. I do feel like Tom Hanks was miscast in this film as they could've had a more stoic-looking actor that opens up more with his son. Jude Law was OK as this photographer assassin but was a bit too moustache-twirling. Paul Newman was pretty good in the film especially in scenes with Craig and deservedly was nominated for a Best Supporting Actor Oscar for his role. I thought Newman was better than Reilly and Walken in that category but not as good as Harris and Cooper (the winner). Overall, a well-shot tension-filled gangster film with a satisfying ending.",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "Acting is fantastic.  Story is meh.",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "The Road to Perdition has to be admired. It's a feast for the eyes, thanks to Conrad L Hall's rich cinematography. The screenplay is tight and nearly faultless. And the acting is superb. Paul Newman and Tom Hanks in the same movie? Your expectations will be fulfilled. \nThe story takes place in Rock Island, Illinois in 1931. Hanks plays Michael Sullivan, a hit man for mob boss John Rooney (Newman). But Sullivan is not some noir gangster. He lives in a nice house with a loving wife (Jennifer Jason Leigh) and two young sons. Nobody in the family says much about his profession. The youngest son asks his older brother Michael what his dad does, and Michael says he goes on \"missions\" for Mr. Rooney. Sullivan's wife must know about his profession, but she's not saying anything. \nOne night, Sullivan is sent on a job with Rooney's son Connor (Danial Craig) to strong-arm a man who has been ripping off Rooney. Connor, who is a loose cannon, ends up shooting him. Michael, curious about what his dad does for a living, hides out in the back of the car and witnesses the hit. He's terrified, and he is discovered and sworn to secrecy by his dad. But Connor is not so sure the kid or his dad can keep a secret. \nI won't synopsize anymore; suffice it to say that Sullivan ends up on the run with Michael, tailed by another hired gun (Jude Law).\nThis film is dead serious (pun intended). The gravitas is overwhelming. It does take a short humorous turn about two thirds in, which I found incongruous considering the tragedy that has occurred, but that's my only complaint.\nI've never been a fan of mob movies. I just have no interest in gangsters. I didn't even like Miller's Crossing. But here, the father-son dynamic is what interested me: Sullivan and Michael, Rooney and Connor. \nNewman is unbelievable in this film. At age 77, he hasn't lost his commanding presence. A Rooney, he considers himself an honorable man, and the dichotomy between his self-image as a benevolent patriarch and a man who orders hits is the source of his angst. A mobster with a conscience? You decide.\nHanks has never had a more serious role that I can remember. He may seem like a strange choice to play a mobster, but he pulls it off effortlessly. He, too, seems to have a conscience, but his loyalty to Rooney seems to dominate. After all, Rooney has provided him with a good living for himself and a comfortable life for his family.\nHall won a well deserved Oscar in 2003 for his work in this film. Director Sam Mendes should have won an award for his direction. Newman won an Oscar for best supporting actor. I'm normally wary of Oscar-winning films because I tend to stay away from the Hollywood mainstream. But this one is so virtuosic and so masterfully presented, it must be recognized.",
            "review_date": "2021-07-12",
            "source": "rt"
        },
        {
            "content": "It's a movie with a solid story, good character arcs and good pacing. The acting is good and the way it's shot compliments the type of movie. Overall pretty solid movie.",
            "review_date": "2021-07-05",
            "source": "rt"
        },
        {
            "content": "Beautifully made. Deep cast. Well-acted. Great story.",
            "review_date": "2021-06-23",
            "source": "rt"
        },
        {
            "content": "This movie is just about perfect in every respect - script, directing, acting cinematography, sets, costumes, etc. The only thing I would change, if I could, would be to omit the unnecessary and distracting narration at the beginning and end.",
            "review_date": "2021-06-17",
            "source": "rt"
        },
        {
            "content": "Very lame movie.  Slow moving and boring.   Horrible casting.  Tom Hanks is not believable as a hitman.  The kid that plays his son looks nothing like him.  The acting is corny and predictable.   The plot is boring.",
            "review_date": "2021-06-10",
            "source": "rt"
        },
        {
            "content": "A well made crime/thriller with Tom Hanks, Paul Newman, Daniel Craig, and the whole cast doing great jobs and having a well developed and interesting story.",
            "review_date": "2021-05-20",
            "source": "rt"
        },
        {
            "content": "Very powerful movie with excellent level of acting touching on father/son relations in a mob underlying world.",
            "review_date": "2021-05-12",
            "source": "rt"
        },
        {
            "content": "Feels like it was made back when all the classics were being made",
            "review_date": "2021-05-11",
            "source": "rt"
        },
        {
            "content": "7.25/10. A bit slow to start and fairly subdued throughout, Road to Perdition is an authentic period piece that grows into an intense enough crime film that features good directing, great performances, and a thoughtful story. Tom Hanks is stellar as always, while the supporting cast are wonderful. The multiple layers of family drama are engaging, even if they take quite a bit of winding exposition to set up. The 1930's Chicago setting is rich, as is the cinematography; there are a lot of gorgeous shots, even as blood and rain-soaked bodies bodies hit the pavement. It is effective as a father/son film, but I thought was more intriguing for it's revenge plot, which admittedly is made richer because of the paternal relationship. Try to watch it when you have energy - even though it is pretty good, it might also lull unsuspecting viewers into a nap if you aren't careful or fully engaged by character-first-action-second flicks.",
            "review_date": "2021-05-05",
            "source": "rt"
        },
        {
            "content": "one of the best for me watched it 3 times already",
            "review_date": "2021-05-03",
            "source": "rt"
        },
        {
            "content": "I see a lot of reviews calling this rote, thanks to its similarities to Godfather and various other Gangster flicks. But seriously, are we supposed to not attempt anything similar to what a classic film has done ever again? Or is this another case of reviewers trying to be clever... Because it's a pretty solid adaptation of the comic. It's a dour, pensive gangster picture, with great performances and gorgeous cinematography. Do people just have a hard time taking Tom Hanks as a badass? Because he totally pulls it off here...",
            "review_date": "2021-04-13",
            "source": "rt"
        },
        {
            "content": "The acting from Hanks, Newman, and Law (plus Mike Jr.) is superb and really draws the viewer in. The plot is more nuanced and interesting than one might expect - and it really explores the powerful dynamics between fathers and sons. I enthusiastically recommend this film.",
            "review_date": "2021-04-07",
            "source": "rt"
        },
        {
            "content": "I don't see what the big deal is with this movie. Don't get me wrong, it isn't terrible, but it isn't terrific either. \nOn the good side, it doesn't surprise me that it won an Academy Award for best cinematography, it is indeed well, and stylishly shot. It's also got a golden cast, with Tom Hanks, Paul Newman, Jude Law and Daniel Craig. There is also a very strong theme of fatherhood in this film, at different levels, which I found very interesting. Loyalty is another strong theme. \nUnfortunately, those themes could've been much more explored, it feels a little bit superficial sometimes. It therefor for me is reduced to a very second-rate crime/drama. It also lacks thrills. If both of those elements were more explored, it would've been better. \nOverall, Road to Perdition was a alright flick which does have a few things to offer, and which can pass the time if you don't have anything to do. But I've seen much better genre pics. For the viewer to see for himself!",
            "review_date": "2021-04-03",
            "source": "rt"
        },
        {
            "content": "very good movie. Tom Hanks, Craig Daniels, & Jude Law... how do you go wrong? i loved the premise & the execution was great.",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "This was such a touching story. The relationship between father and son is so beautiful.",
            "review_date": "2021-02-27",
            "source": "rt"
        },
        {
            "content": "A pretty nice watch with an unpredictable ending. Didn’t know Tom Hanks could play a tough guy so well. ",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "Paul Newman and Tom Hanks with a great plot, period drama and about as non formula as you can get. How's it get much better.",
            "review_date": "2021-01-27",
            "source": "rt"
        },
        {
            "content": "Dark, twisting and a great revenge story.",
            "review_date": "2020-12-15",
            "source": "rt"
        },
        {
            "content": "This film spoke to me on every level. The acting,sets and period effects were right on. It also delivered a potent message.One of my all-time favorites.",
            "review_date": "2020-10-23",
            "source": "rt"
        },
        {
            "content": "The mobsters in Sam Mendes' Road to Perdition appear to be their own worst enemies and surely got low to middling marks in their Gangster 101 class.  For example, when engaged in a gunfight in the middle of a dark street, take cover instead of standing under a streetlight, blasting into the dark.  Furthermore, when whacking one of your own, do not give the whackee a note intended for an outside party with the terms regarding how to kill the whackee; always keep the whacking in-house.  The characters in the film always seem to be walking through shadows with contemplative expressions glued to their faces.  When they speak, it's in hushed tones filled with dramatic pauses.  Despite all of this, the cast has some huge star power.  Jude Law is great as a photographer/killer who likes to \"shoot the dead.\"  I wish he'd been in it more…a lot more.",
            "review_date": "2020-09-07",
            "source": "rt"
        },
        {
            "content": "Really leaves you thinking at the end with a powerful message that is up to the viewer to decide if it's about fatherhood, honor or nothing else but murderous revenge",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "I miss some of the violence of the comic but this is well acted powerfully told and a nice sendoff for Newman.",
            "review_date": "2020-07-01",
            "source": "rt"
        },
        {
            "content": "A well-made mob movie with satisfying performances and story.",
            "review_date": "2020-06-17",
            "source": "rt"
        },
        {
            "content": "Sam Mendes' directorial signature evolved and finalized for further growth in his second picture as his first definitive masterpiece, adapting an independent graphic novel with thematically driven brilliance of rough-edged beauty through graceful cinematography marking a finest hour, soulful emotionally channeling score, and flawlessly casted performances excelling in deepening a cinematic classic. (A)",
            "review_date": "2020-06-06",
            "source": "rt"
        },
        {
            "content": "Sure it’s real and all with pretty good acting, but bye the end of it all, this movie made me say to myself “ I’m tired of all this shit” ",
            "review_date": "2020-05-20",
            "source": "rt"
        },
        {
            "content": "what a mess. ethically  as confused  as a film can be",
            "review_date": "2020-05-20",
            "source": "rt"
        },
        {
            "content": "This movie was very beautiful and executed well. There were some moments in the film that were powerful, emotional, and beautiful. The only flaw that I could find was that the film took forever to get its momentum to continue after 20 minutes. That caused the beginning to be a little boring for me. But after that, you are invested on a journey for the survival of a father and son's complex relationship. It was a gorgeous, simple movie that was executed beautifully.",
            "review_date": "2020-05-19",
            "source": "rt"
        },
        {
            "content": "Road to Perdition is a dense film about the relationship between father and son, all wrapped well in 1930's organized crime setting. However, it's quite forgettable.",
            "review_date": "2020-05-17",
            "source": "rt"
        },
        {
            "content": "It's a slow burn, but a worthwhile one.",
            "review_date": "2020-05-16",
            "source": "rt"
        },
        {
            "content": "Boring ........🤷🏾‍♂️",
            "review_date": "2020-05-14",
            "source": "rt"
        },
        {
            "content": "This is an good movie. The it’s got good acting and good camera work. Half the movie is pretty boring and left me wanting more.",
            "review_date": "2020-05-09",
            "source": "rt"
        },
        {
            "content": "Wholesome, and excellent. Tom Hanks plays his role superbly.",
            "review_date": "2020-05-06",
            "source": "rt"
        },
        {
            "content": "7.25/10. A bit slow to start and fairly subdued throughout, Road to Perdition is an authentic period piece that grows into an intense enough crime film that features good directing, great performances, and a thoughtful story. Tom Hanks is stellar as always, while the supporting cast are wonderful. The multiple layers of family drama are engaging, even if they take quite a bit of winding exposition to set up. The 1930's Chicago setting is rich, as is the cinematography; there are a lot of gorgeous shots, even as blood and rain-soaked bodies bodies hit the pavement. It is effective as a father/son film, but I thought was more intriguing for it's revenge plot, which admittedly is made richer because of the paternal relationship. Try to watch it when you have energy - even though it is pretty good, it might also lull unsuspecting viewers into a nap if you aren't careful or fully engaged by character-first-action-second flicks.",
            "review_date": "2020-05-02",
            "source": "rt"
        },
        {
            "content": "One of the best mafia movies ever.",
            "review_date": "2020-04-20",
            "source": "rt"
        },
        {
            "content": "Most of the movie is simply a bunch of actors dressed up in 1920's clothing, driving 1920's cars on 1920's streets. Nothing else is noteworthy. Tom Hanks did not/cannot pull off the top level gangster role. Because of that, and many other things, it is hard to understand the purpose of this movie. The entire movie is incredibly slow, boring, and pointless.",
            "review_date": "2020-04-19",
            "source": "rt"
        },
        {
            "content": "Though quite inferior in its less interesting first half, Road to Perdition becomes terrific in the very moving second half. The ending is heartbreaking, its themes are well explored and the movie features a great ensemble cast with Jude Law, Tom Hanks and Paul Newman being the standouts.",
            "review_date": "2020-04-18",
            "source": "rt"
        },
        {
            "content": "There are some excellent scenes in this movie with an overall story that is just fair",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "Sam Mendes' Depression-era mob film is an admirable work of cinematography about the relationships of fathers and sons who get caught up in the nasty world of crime, but the fate of the characters is predictable from the beginning.",
            "review_date": "2020-04-13",
            "source": "rt"
        },
        {
            "content": "Excellent movie. Tom Hanks gives a great performance and you really fall in love with him as the movie progresses.",
            "review_date": "2020-04-13",
            "source": "rt"
        },
        {
            "content": "This mob drama was great. Tom Hanks, Paul Newman, Daniel Craig, Jude Law, Jennifer Jason Leigh, and the rest of the cast did a great job in this movie. The plot to the movie was very dramatic and intense. There's even a shocking discovery that character Michael Sullivan played by Tom Hanks finds as well. It'll make the movie interesting. I would recommend this movie. You probably would enjoy it.",
            "review_date": "2020-04-12",
            "source": "rt"
        },
        {
            "content": "Not my type of movie but I liked it... Tom hanks can do no wrong in my book.",
            "review_date": "2020-04-11",
            "source": "rt"
        },
        {
            "content": "Georgously shot and very well acted especially by Paul Newman. Road to Perdition is a call back to the 1930s style Mafia hit thrillers. Mostly delivers the brunt of the character exchanges and dynamics. Jude Law was extremely underrated in this feature. There were a couple times the script or the editing, not too sure which, lost my attention and led my mind astray. I think it was when Michael and his son immediately begin robbing banks and were on the run. Didn't in those scenes, feel real and too plausible.",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "The artistic choices of this movie are what make it memorable. Many of the shots are very creative and those combined with the musical score make the film great. Sam Mendes does a great job with the direction and takes every detail into account. It's a revenge story that's heart wrenching at times and funny at others.",
            "review_date": "2020-04-09",
            "source": "rt"
        },
        {
            "content": "Another masterpiece. Another amazing journey. Another awesome film. Although I do say Tom Hanks was a bit missed cast for the main role. But the story and acting were on key!",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "Great Movie, pace is a little slow, but still worth a watch",
            "review_date": "2020-04-07",
            "source": "rt"
        },
        {
            "content": "Love this movie. Amazing performances by two legendary actors. Sometimes when you put to greats together it doesn't translate to onscreen chemistry, but let me assure you Road to Perdition does not disappoint.",
            "review_date": "2020-04-06",
            "source": "rt"
        },
        {
            "content": "This is a top notch movie all around, can’t believe I didn’t see it sooner. ",
            "review_date": "2020-04-06",
            "source": "rt"
        },
        {
            "content": "Well written, acted & filmed.  Recommend it!",
            "review_date": "2020-04-05",
            "source": "rt"
        },
        {
            "content": "Road To Perdition Pros: Phenomenal Acting Amazing Directing Strong Writing Stunning Cinematography Magnificent Editing Brilliant Pacing Beautiful Set and Costume Design Outstanding Storyline Great Music & Sound (Musical Score, Sound Design, etc.) Explores its themes about father love and masculinity in an emotionally affecting manner Cons: - None Overall Grade: A+ (10/10)",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "This movie is a complete hit! The  storyline, direction, sound effects, and the play; all ingenious. From the start to the finish, the movie keeps you hooked and the men in there have made sure that the audience watches the movie open-eyed at every turn! The only one aspect that I think could've been worked on more is the lighting. there were certain scenes where one just couldn't know what was happening. Apart from that, this movie is a must watch!",
            "review_date": "2020-04-01",
            "source": "rt"
        },
        {
            "content": "Neither Tom Hanks, Daniel Craig or Jude Law have been in a better movie. This movie is captivating from the first line of dialogue to the last.",
            "review_date": "2020-03-19",
            "source": "rt"
        },
        {
            "content": "Some might complain about the film's lukewarm ending. But I think the point of this movie was to show how a father's criminal life can affect a family.",
            "review_date": "2020-03-06",
            "source": "rt"
        },
        {
            "content": "Amazing performance from Tom Hanks, one of the finest actors of his generation. The ending was a bit twisted and sad, but that's what makes the film memorable and live up to the hype of its dark graphic comics.",
            "review_date": "2020-03-01",
            "source": "rt"
        },
        {
            "content": "A great, underrated film. Great acting performances all around, but the one to really watch out for is the breakthrough performance by Daniel Craig.",
            "review_date": "2020-02-23",
            "source": "rt"
        },
        {
            "content": "A sensitive and patient film with a wonderful aural landscape and Mendes' trademark respect for the craft of acting, particularly that of the silent type. Lingering looks at the beautiful and tangible landscape of 1930's New York is shared by lingering looks at actors acting up a storm under a mask of something else.\nPOV is all important; perspective literally, including those of light and dark and through glass and reflection, and figuratively, as in the ways in which your view of people change as you grow and widen your understanding of the world.\nDaniel Craig is surprisingly solid and Tom Hanks is the lynchpin of the movie, a reason to revisit after all these year and acknowledge that it has aged very well. A sedate and ponderously shot and edited movie but also energetic and powerful when it needs to be. It has a sharp and careful screenplay, neither too showy or too rote or too telegraphing. A lot of that has to do with Mendes and his calculation of every cause and effect of his choices.\nThe ending moments are a triumph of the medium of cinema and it's a great classic-feeling exercise in mood.",
            "review_date": "2020-02-07",
            "source": "rt"
        },
        {
            "content": "Beautifully shot and paced well, Road to Perdition is one of the better prohibition era gangster flicks out there.  While I couldn't entirely buy Tom Hanks as a mob hitman, he did a great job in the role nonetheless as he always does.  Paul Newman was aces here as well.  Pre-007 Daniel Craig plays a convincing sleazebag, and Jude Law is one menacing creep here.  Certain elements like the bank robbery montage felt cliche and as a whole the plot wasn't anything groundbreaking and sometimes predictable.  Still, this is a very good film technically speaking and performance-wise with a pleasant and sometimes charming atmosphere.",
            "review_date": "2019-10-12",
            "source": "rt"
        },
        {
            "content": "A gripping drama that plays more on the relationship between father and son rather than a standard gangster film.  A must see!",
            "review_date": "2019-10-08",
            "source": "rt"
        },
        {
            "content": "Good movie, but plot is too cliche and predictable. Performance, direction, music, cinematography are top-notch. Script seems a little cliche. A lot of characters are underdeveloped. Connor, Maguire just don’t make any sense. But yeah, just for the movie and cinematography, definitely worth a watch. ",
            "review_date": "2019-09-27",
            "source": "rt"
        },
        {
            "content": "A surprisingly great movie! The cinematography and general mood of the film are what make it so great and Tom Hanks elevates this to must watch status. A classic mob movie that does not get the credit it deserves. Highly recommended!",
            "review_date": "2019-06-14",
            "source": "rt"
        },
        {
            "content": "It might not seem this amazing on paper, but my god it was phenomenal. Its brings life into the mafia genre with better development and less swearing and violence. The performances were fantastic across the board, especially Tom Hanks. With a story that is both intense, entertaining, and powerfully moving. You have a must see film by Sam Mendes that well-fully provides an amazing father and son connection.",
            "review_date": "2019-03-23",
            "source": "rt"
        },
        {
            "content": "A stunning gangster film of quiet manner.\n\nSam Mendes directed what is likely going to be remembered as his greatest film with Road to Perdition (2002). Mendes approached his direction with a steady hand alongside his cinematographer, Conrad L. Hall, to create haunting visuals for his mobster drama.\n\nEvery scene is shot so beautifully that many of the images from Road to Perdition are burned into my brain now. The rain sequences, in particular, are so visceral to witness that they offset the brutal violence so nicely.\n\nDavid Self's script is a wonderful testament to fatherhood and loyalty with many crime saga themes. Max Allen Collins' comic series is brought to life with punching lines of intense bluntness and clever dialogue of biting wit.\n\nThomas Newman's score is composed of lovely piano melodies and tender sweeping symphonies that sound of forlorn pains akin to those suffered by the gangsters within the film. Road to Perdition's score underscores the serene tone and bittersweet excitement of bloody gunshots throughout the film.\n\nThe cast of Road to Perdition is phenomenal all around. Tom Hanks is gripping as the hit-man gone rogue for revenge. Hanks plays a stoic father and a menacing figure dealing out a hail of bullets with ease. His quiet nuanced performance gives you everything you need in a leading man. Hanks is cool, strong, thoughtful, and patient as Michael Sullivan. Tom Hanks gives, perhaps, his peak acting in Road to Perdition.\n\nPaul Newman is a revelation of subtle, yet intimidating acting in Road to Perdition. In what was Newman's last great role, he finds the heart of Irish mob godfather John Rooney with his gentle and likewise fearsome performance. Newman understands the character is a man who has killed his whole life to attain peace for his sons, while regretting all his bloodshed. His final words on screen are ground shaking. Paul Newman was a classic cool actor and Road to Perdition is a respectable way to go out with a bang!\n\nJennifer Jason Leigh is excellent as Hanks' wife Annie. She is the kindly mother that can be stern as needed. Leigh completely captures a realistic suburban mom involved with the mob. Jennifer Jason Leigh is always a top tier actress and Road to Perdition is no exception.\n\nJude Law is terrifying as Macguire. His sleazy assassination and corpse photographer persona is an unsettling combination. Law gives one of his best performances as you cannot forget his cruel and sudden violence.\n\nSimilarly, Daniel Craig gives one of his most memorable roles in Road to Perdition. His rapidly unnecessary violence feels so monstrous and callous. Craig plays the self-righteous creep with ease.\n\nLastly, Stanley Tucci and Ciaran Hinds both display fantastic quietly threatening characters in their respective supporting roles. They manage to mesmerize while they are on screen. I must mention the excellent performance from the young Tyler Hoechlin as Michael. His attachment and respect for Tom Hanks is clear as his acting is very convincing for such a young boy.\n\nIn conclusion, Sam Mendes might never have matched his early success with his erotic drama American Beauty (1999), if not for his riveting gangster thriller Road to Perdition. This film should have won Best Picture over The Pianist in all honesty.",
            "review_date": "2019-03-03",
            "source": "rt"
        },
        {
            "content": "Tom Hanks actually manages to play a proper bad-ass!",
            "review_date": "2018-12-09",
            "source": "rt"
        },
        {
            "content": "Sam Mendes handles the quiet familial moments with a familiar care but doesn't seem to know what to do with the more action-oriented scenes.",
            "review_date": "2018-10-07",
            "source": "rt"
        },
        {
            "content": "more salvation than damnation..\n\nRoad To Perdition\n\n3 And A Half Out Of 5\n\nRoad To Perdition is a character driven dramatic thriller about a relationship between a father and a son which is brewed at a critical stage and higher stakes. \n\nDespite of portraying an essential chapter or episode of a young kid, the writing wisely accounts in the bonding of him with his father from the scratch. And it is so well fed to the audience that despite of its dark tone and poignant theme, there is a cathartic experience on each tiny moments of them. \n\nOne of the primary strengths of the feature is its uncertainty and unexpected outcome that it evaluates keeping the audience tangled in its world where the sense of urgency too factors in a lot. \n\nEach supporting character gets enough range and space to factor in and work effectively which shows how the makers were chewing the characters properly and were not in any rush. \n\nThe costumes designing is out of the park and so is the finely detailed production design but what draws in most of the attention is the metaphorical cinematography that is just pure passion throughout the course of it. An elevating background score, glorifying camera work and perfect editing are too some of its rich details. \n\nThe writing is simple as it can be but sensible and justifying as you've never seen. Mendes; the director, at the heart of it, has done a tremendous work on executing such a balanced feature. \n\nHanks has never been more impactful with a excellent support from Newman, Craig and Law. Jaw dropping visuals, whistle-blowing dialogues and a heartbreaking chemistry are the high points of the feature that makes you look twice. \n\nRoad To Perdition is more salvation than damnation since it has such a risky tone to explore at let along triumph over it; a masterstroke by the makers.",
            "review_date": "2018-08-17",
            "source": "rt"
        },
        {
            "content": "Well crafted script with top notch performances and a stunning photography... Also the period films I like very much... Totally it sets the tone for a ride...",
            "review_date": "2018-08-14",
            "source": "rt"
        },
        {
            "content": "This icy and at times off-putting film is propped up by fantastic cinematography and a bleeding heart that becomes more visible as the story progresses.",
            "review_date": "2018-07-10",
            "source": "rt"
        },
        {
            "content": "The story of the father and the child, the story of the family is impressed very much. Just with the brother's snow throwing scene at the beginning, my eyes got wet. However, it was spoiled by a dull screen, a famous act like Tom Hanks, a face of Jude · Row, an out-of-date Paul Newman, a production lacking tension.",
            "review_date": "2018-04-22",
            "source": "rt"
        },
        {
            "content": "I said it many times before, any movie starring Tom Hanks is always good. Unfortunately, today I have to break that hindsight. Yes, the man can act, but if the script and the direction are not equally strong as he is, then he is going to be overshadowed by the film's flaws. \"Road to Perdition\" is a predictable, father and son noir that only offers a mildly impactful punch. The cinematography was great as well as the lighting, but they are wasted on underdeveloped scenes that don't deserve them.",
            "review_date": "2018-03-01",
            "source": "rt"
        },
        {
            "content": "A really enjoyable film, not a fast paced film but all good nonetheless. The entire cast did a great job.",
            "review_date": "2017-12-26",
            "source": "rt"
        },
        {
            "content": "You have to be in a gangster genre type of mood to enjoy everything in this movie. It certainly does a great job of taking you back to a time when things were different, a hey day of sorts. ",
            "review_date": "2017-12-08",
            "source": "rt"
        },
        {
            "content": "Road to Perdition’s slow-paced mafia drama has the right meta narrative but also has a few crucial missteps along the way. Most pertinently, while it boasts a stellar ensemble, Hanks is largely unconvincing for this revenge job, and he leaves behind many scenes without the necessary closure to manoeuvre onward. I long for a remake.",
            "review_date": "2017-11-26",
            "source": "rt"
        },
        {
            "content": "Great story of a detached father doing his best to protect what is left of his family. A dark tale well told.",
            "review_date": "2017-11-21",
            "source": "rt"
        },
        {
            "content": "Brilliantly directed film with Tom Hanks at his usual best.",
            "review_date": "2017-11-07",
            "source": "rt"
        },
        {
            "content": "Brilliant, beautiful, emotional at times and great performances from Tom Hanks and Tyler Hoechlin. This is an effective different take on the mafia film genre adding in the father son element and their chemistry is very captivating to watch. This is a very very powerful film that people should see.",
            "review_date": "2017-08-16",
            "source": "rt"
        },
        {
            "content": "Very good drama with a little action. Overall the script moves pretty slowly. There are a lot of unnecessary drawn out scenes without dialogue. Feels more like the directors attempt to increase the length of the movie rather then build character's traits. \n\nExcellent wardrobe design. Very good acting from Tom Hanks and his movie son. Paul Newman was alright. \n\nI definitely recommend watching this at least once.",
            "review_date": "2017-08-07",
            "source": "rt"
        },
        {
            "content": "Good cinematography and score. It's tonally all over the place. I think the writing is the biggest fault here, because it didn't really interest me. The performances were all fine, but Jude Law was a stand out for me, and I did really like when Stanley Tucci was on screen, but both are wasted by not being used very much.",
            "review_date": "2017-06-07",
            "source": "rt"
        },
        {
            "content": "Jude law's character felt kinda empty or edgy or something\nand tom hanks' death was kinda cliched \nother than those two things  all other elements are pretty good",
            "review_date": "2017-06-01",
            "source": "rt"
        },
        {
            "content": "There is not a whole lot going on in this film: characters walk around with tommy guns and old gangster clothes, but the material never elevates itself beyond being a \"good\" gangster picture that goes through all the right steps, like the good boy in school who does all of his homework on time but never cares about what he learned. The movie wants to tell us all the way through that it's a deep, wise, and solemn picture about men and violence, I suppose, but there's nothing here that makes it extraordinary.",
            "review_date": "2017-05-30",
            "source": "rt"
        },
        {
            "content": "Again we are reminded that Tom Hanks can succeed in any role.  In a genre full of legendary films \"Road To Perdition\" has made it's presence known.",
            "review_date": "2017-05-14",
            "source": "rt"
        },
        {
            "content": "Grade - B+\nWith great direction and fantastic performances, 'Road to Perdition' is an excellent crime drama. It overcomes some minor flaws thanks to a beautiful score and a good script.",
            "review_date": "2017-05-04",
            "source": "rt"
        },
        {
            "content": "Well acted, but what is the message here?  Father and son bonding over bloodshed?  Predictable, dour.",
            "review_date": "2017-04-03",
            "source": "rt"
        },
        {
            "content": "Ultimate authentic, stylish 30's gangster film, but more than that- the story of a son's love for a father whose violent career is at odds with his otherwise moral and 'ordinary' family life.  Spectacular performances by Hanks who masters the good and evil aspects of Sullivan, and the iconic Paul Newman, the Irish mob boss who was his mentor and employer. The Thomas Newman score is haunting, sentimental, memorable. I cannot recommend highly enough.  More brilliant direction by Sam Mendes. *****",
            "review_date": "2017-02-14",
            "source": "rt"
        },
        {
            "content": "really boring film did not hold my attention",
            "review_date": "2017-02-12",
            "source": "rt"
        },
        {
            "content": "good acting but way too boring.  It seemed like it was 4 hours long.",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "entertaining.. you will rewind many scenes.",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "Paul Newman in his final full movie steals the show, supporting a fine performance from Tom Hanks. Tyler Hoechlin (actually 14 at the time) is equally superb as the son, who know 12 years old discovers his \"good father\" is anything but good.\nA slow-paced gangster movie exploring the relationship of father and son on the run, and brutally evoking the period of The Great Depression era. A little lacking in emotional attachment and some odd absurdities in the bank hold-ups (viz the lack of police) and in the character of Maguire, weaken what should have been a better,  already decent film.",
            "review_date": "2017-01-01",
            "source": "rt"
        },
        {
            "content": "It's difficult to fully escape the sins of our fathers. Road to Perdition is the kind of movie that manages to be almost soothing even through its violence. The visuals are beautiful, especially the cinematography and camera framing, softening the death and blood without ignoring it. The score is a stunning juxtaposition of dark melodies and straight-up dissonance. All the performances are good, Hanks is REALLY good, and Newman is even better.",
            "review_date": "2016-12-19",
            "source": "rt"
        },
        {
            "content": "I haven't seen this in so long, and must watch it again!",
            "review_date": "2016-11-07",
            "source": "rt"
        },
        {
            "content": "Sam Mendes' \"Road to Perdition\" is gritty and diverting enough, but, Daniel Craig's unfortunately short-lived performance aside, the acting is sub-par and the plot is preposterous.",
            "review_date": "2016-11-04",
            "source": "rt"
        },
        {
            "content": "Absolute Masterpiece!! Destined  to be a classic",
            "review_date": "2016-10-15",
            "source": "rt"
        },
        {
            "content": "A stoic tale of revenge by a father-son pair.",
            "review_date": "2016-10-12",
            "source": "rt"
        },
        {
            "content": "Another Tom Hanks blockbuster in an era when he was one of the top actors in Hollywood.  This is also Paul Newman's last cinematic acting role.  This is a very good film, but not a great one.  \n\nThe plot plays out very carefully and is well written, with just the right amount of details.  Some obvious holes will have the audience asking \"why did he do that?\"  For example, when Sullivan critically wounds the assassin, why doesn't he simply finish the job?    \n\nThe feeling of the film is dark (and wet).  This is not a \"happy\" film and thus makes it standout from the typical Hollywood ending you would expect.  Both Hanks and Newman are fantastic in their roles.  A must-see for ganster movie aficionados.",
            "review_date": "2016-10-11",
            "source": "rt"
        },
        {
            "content": "You know what to expect when Tom Hanks is in.",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "Honestly a beautiful movie. Definetely kept my interest the entire time and right when you thought you knew what was going on, they throw you in a whole new direction. \n\nThe acting, camera angles, everything about this movie is on point. \nAbsolutely no complaints.",
            "review_date": "2016-07-25",
            "source": "rt"
        },
        {
            "content": "Anchored by Tom Hank's profound performance, reined by Conrad hall's immaculate cinematography, absorbed by Thomas Newman's melodious background score, this basic period revenge drama is transformed into a pleasing , poetic movie experience.",
            "review_date": "2016-07-25",
            "source": "rt"
        },
        {
            "content": "Road to Perdition is the immaculately directed, violent gangster piece from Sam Mendes, who adapted the story from the graphic novel series of the same name, and boy does it leave an impression! The film stars Tom Hanks, playing against-type, as a mob enforcer who is forced to go on the run when a tragedy befalls his family after his son witnesses something he wasn't supposed to see. Him and his son then work as a team robbing the crime boss's bank accounts until they can come to an understanding, all the while being pursued by a ruthless assassin played brilliantly by Jude Law. The acting in this film is extraordinary with nearly every main cast member playing out of their comfort zone with Hanks being a skilled killer, Paul Newman playing the conflicted mob boss, Daniel Craig playing the skiddish and jealous heir to the crime family, and of course Jude Law as the psychopathic hitman who revels in taking photos of the dead. This is a truly arresting piece of filmmaking and with Oscar-winning cinematography, the images jump from the pages of the graphic novel to the screen in great detail and many of the shots will stick in my mind permanently! It's a great story, with well-rounded and memorable characters, features flawless direction from Sam Mendes, and the gorgeous cinematography is truly an impressive feat!",
            "review_date": "2016-06-23",
            "source": "rt"
        },
        {
            "content": "A truly great gangster film and based upon an even better graphic novel!",
            "review_date": "2016-05-14",
            "source": "rt"
        },
        {
            "content": "The lengths a father will go to save the life of his son is astounding. Tom Hanks is brilliant in this film that depicts the levels of a father's love. Jude Law is down right terrifying. The reason he is so scary is because people like him actually exist in the world. He portrays the scum of the Earth and just sends chills up your spine when you watch him. the performances of all the actors are great, and the direction is as well. Gangster films always have a special place in my heart and this one did nothing to take away from that love of the genre, and keeps my love alive. The pairing of Paul Newman and Tom Hanks is a dream come true and Sam Mendes is the perfect one to paint their picture for them.",
            "review_date": "2016-04-13",
            "source": "rt"
        },
        {
            "content": "Really, really enjoyed this on repeat viewing but then to be honest any Father-Son narrative is bound to capture my heart and imagination.  Hanks is solid here but Newman is really brilliant, completely convincing as the ageing mobster with an idiot of a son about to inherit his empire.  There's not a whole lot that's original here but it's done so in such a classy manner that it will live far longer in the memory than say Michael Mann's 'Public Enemies'.",
            "review_date": "2016-03-30",
            "source": "rt"
        },
        {
            "content": "The message in \"Road To Perdition\" is handled with director Sam Mende's trademark nuance, and is conveyed through beautiful cinematography and its universally strong cast.",
            "review_date": "2016-03-24",
            "source": "rt"
        },
        {
            "content": "A work of art in acting, directing, locations and feeling",
            "review_date": "2016-03-24",
            "source": "rt"
        },
        {
            "content": "Featuring stunning cinematography, impressive production design and great performances. Road to Perdition is beautiful, adventurous while also being brooding.",
            "review_date": "2016-03-16",
            "source": "rt"
        },
        {
            "content": "Best comic book movie\nBest mafia movie\nEvery frame a painting. Wonderfully acted. Daniel Craig does a great American accent. \nCan't praise this movie enough.  Go see it.",
            "review_date": "2016-02-27",
            "source": "rt"
        },
        {
            "content": "Road to Perdition's slow-paced mafia drama has the right meta narrative but also has a few crucial missteps along the way. Most pertinently, while it boasts a stellar ensemble, Hanks is largely unconvincing for this revenge job, leaving behind many scenes without the needed closure to manoeuvre onward. I long for a remake.",
            "review_date": "2016-02-25",
            "source": "rt"
        },
        {
            "content": "Although it finds itself dragging every now and then, Road to Perdition is immensely emotional and a beautiful second entry from Mendes.",
            "review_date": "2016-02-22",
            "source": "rt"
        },
        {
            "content": "An all round good film, well directed, well acted and a good story, even if the end was stunningly predictable.",
            "review_date": "2016-02-20",
            "source": "rt"
        },
        {
            "content": "Not as good as the Godfather, but feels and looks as if it were. Definitely a good film to watch if you like prohibition movies but I would rather watch Once Upon a Time in America before this.",
            "review_date": "2016-01-13",
            "source": "rt"
        },
        {
            "content": "Visually impressive, but Road To Perdition isn't always the most enthralling watch.",
            "review_date": "2015-12-28",
            "source": "rt"
        },
        {
            "content": "I've never seen Tom Hanks as a bank robbing killer before but I liked him as one. He's probably my favourite actor next to Tom Cruise and he does fantastic work here. This is a well-made movie. The acting all around is high-calibur, the cinematography is extremely well done with the smooth pans and lighting and the story is very tight and intriguing. I don't wanna say too much about this film because it's best to go into without knowing much. All I can say is that Sam Mendes made a great film with a great cast and crew.",
            "review_date": "2015-12-26",
            "source": "rt"
        },
        {
            "content": "Every year, there are always a few select films snubbed from contention in the race for Oscar's best picture. Every decade, there are one or two films that stand out amongst those as the best of the unjustly left behind. One such picture is Director Edward Zwick's Glory, and another is Sam Mendes' Road to Perdition. Though not completely overlooked during awards season -- Conrad Hall won a much-deserved posthumous Oscar for his exemplary cinematography and the film received several additional nominations -- the absence of a Best Picture nomination, as with Glory, seems one of the great injustices in the long history of the awards. Nevertheless, those missing notches from its belt in no way detract from what a remarkable piece of filmmaking this is. Road to Perdition is easily one of the most beautiful pictures ever made. It's got a great cast and an even better story as complimentary pieces, but there's no doubt that it's in Mendes' and Hall's brilliant craftsmanship where Road to Perdition will find its legacy as one of cinema's finest works of art.",
            "review_date": "2015-12-16",
            "source": "rt"
        },
        {
            "content": "Very good movie, some confusing plot points, but overall. No complaints for this fantastic comic book adaptation.",
            "review_date": "2015-12-02",
            "source": "rt"
        },
        {
            "content": "Although good, it seemed targeted at 'youth', for example I am surprised to see the R rating, it felt \"PG 13\" in the way it filmed some of the violence, and smacked of a morality tale for youth. Hated Hank's mustache. But a very good cast, indeed.",
            "review_date": "2015-11-21",
            "source": "rt"
        },
        {
            "content": "oscar winner and mendes best work in my opinion",
            "review_date": "2015-11-09",
            "source": "rt"
        },
        {
            "content": "God it looks and sounds so polished. Teared up watching Newman an acting and general legend in one of his final roles.",
            "review_date": "2015-10-22",
            "source": "rt"
        },
        {
            "content": "Non typical role for Tom Hanks in a fine gangster film, also starring Paul Newman.",
            "review_date": "2015-10-17",
            "source": "rt"
        },
        {
            "content": "Road to Perdition is directed by master director Sam Mendes (American Beauty) and stars Tom Hanks, Jude Law, Daniel Craig, and Paul Newman. Hanks and Craig are gangsters that work for Newman. When Hank's son witnesses something involving the two, things spin out of hand and Hanks and his son must run away and avoid trouble. \n\nI love this movie. it has a special place for me as I watched it with my dad for the first time and this movie is a father and son story. but that does not mean that this movie is just good because it has a special place in my heart, it is a fantastic movie.\n\nThe acting is phenomenal. Tom Hanks is pure perfection and this remains to be one of my favorite roles of his. Daniel Craig is great as the unstable son of Paul Newman. Jude Law gives his best performance as the endlessly creepy Hitman who is sent to kill Hanks and his son. Newman is very good as well. \n\nSam Mendes is one of the best directors of all time. He has never made a poorly shot film, or one that has anything less than great cinematography. and this movie is no different. Perfect directing that makes the movie that much better. \n\nThe score to this movie is haunting and beautiful in every way. I get chills every time I hear Jude Law's theme. it is fantastic. \n\nmy only flaw is that the movie has some pacing issues. one minute is is heart pounding and right after it can screech to a halt sometimes. not a huge flaw but definitely is a little bothersome. I also hate the narration at the beginning and the very end. It is useless and felt a little iut of place.\n\nOverall this is a must see movie. very good father and son movie as well. I love this movie and if you enjoy an unconventional mob movie this is one for anyone over the age of 13. \n\n9.1/10",
            "review_date": "2015-10-11",
            "source": "rt"
        },
        {
            "content": "A well told story with good acting, an amazing soundtrack and skilled directing.",
            "review_date": "2015-10-11",
            "source": "rt"
        },
        {
            "content": "Is there a more adept actor that Tom Hanks? Does film get any better than this? Why not 5 stars, hard to explain. It's not a film that's easy to watch, the intensity is unremitting and I don't like the end. It's the right ending but I still don't like it. Jude Law never better, Paul Newman's last film appearance, a fitting finale. Sam Mendes never better.",
            "review_date": "2015-10-08",
            "source": "rt"
        },
        {
            "content": "Gripping and fantastically acted",
            "review_date": "2015-08-01",
            "source": "rt"
        },
        {
            "content": "Road to Perdition beckons more to the Godfather than it does to the more-recent Gangster Squad. It's heavy reliance on dialogue and music makes that clear. Tom Hanks is absolutely magnetic as the no-nonsense Sullivan and Paul Newman and Daniel Craig are excellent as well, portraying the Rooney gang leaders. What makes the film particularly great is how it never forgets it's purpose, which is to elaborate how a killer and a father maintains his uneven relationship with his young son. It's beautiful.\n\nThe music is up there with the best scores out there, and acting is just as good. \nThis is a great and complex film that takes us back to before many of these types of gangster movies were so flashy.",
            "review_date": "2015-07-21",
            "source": "rt"
        },
        {
            "content": "A beautiful bittersweet mob movie,wonderfully acted as well as textured....one of the last in Newman's storied career but a great way to go out.",
            "review_date": "2015-06-26",
            "source": "rt"
        },
        {
            "content": "Featuring two incredible turns by Paul Newman and Jude Law, this movie never quite hits the mark --- but it remains a solid and entertaining experience.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "Meh, wasn't really worth finishing. It's a severely watered down prohibition mafia movie.",
            "review_date": "2015-05-09",
            "source": "rt"
        },
        {
            "content": "Awesome comic book feel and pretty good direction from Sam Mendes. slow burn crime drama.",
            "review_date": "2015-03-13",
            "source": "rt"
        },
        {
            "content": "Excellent movie but you must focus with no interruptions.",
            "review_date": "2015-03-01",
            "source": "rt"
        },
        {
            "content": "In my opinion, Road to Perdition is one of the best gangster movies of the last twenty years with its great performances from its entire cast, great direction and cinematography, and touching themes on father-son relationships.",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "Slow burning and tense. Tom Hanks is absolutely magnetic in this traffic tale of father and son.",
            "review_date": "2015-01-23",
            "source": "rt"
        },
        {
            "content": "Tom Hanks is a favorite of mine, and as always, he is spectacular here. The low-key portrayal of a mob hitman who must seek revenge on a \"family\" member for killing his wife and son is somber and somewhat frightening. Great cast. Very good movie.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "A very beautiful and very fine work - uneven - but very beautiful and very fine",
            "review_date": "2015-01-13",
            "source": "rt"
        },
        {
            "content": "Very good movie. Underrated.",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "Tyler Hoechlin was very bad in this movie, anytime he was on screen I wanted shut the movie off. Tom Hanks also felt iffy to me in this film.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "Good movie but weird ending.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "Tom Hanks is more versatile than I thought",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "This truly was a fantastic film. But it wasn't perfect and heartbreakingly powerful as I heard it was. \nIn the end though Road to Perdition is a very emotional and profound film that should be seen once in your lifetime. \nCongrats to all the great production, this is one of the most well made films I've ever seen.",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "one badass joy ride,",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "Hanks and Newman are both pretty good here, but most of the characters (even Sullivan) could have been developed more. This would have made the movie truly great. But for me, it never reaches greatness, but is a worthwhile mafia movie nonetheless",
            "review_date": "2014-08-29",
            "source": "rt"
        },
        {
            "content": "Riveting and powerful, Road to Perdition is a knockout in acting, writing, directing, etc. Tom Hanks once again pulls in an incredible performance and the ending is one of the best I've ever seen.",
            "review_date": "2014-08-27",
            "source": "rt"
        },
        {
            "content": "\"Road to Perdition\" benefits from emotionally powerful acting performances and sensitively treated direction in order to tell a heartbreaking father-and-son story that is both tense and moving.",
            "review_date": "2014-08-21",
            "source": "rt"
        },
        {
            "content": "One of Tom Hanks Best performances. Very underrated movie. Supporting cast is Top notch. Paul Newman as a fatherly figure to an entire town. Jude Law is a creepy photographer hitman. And Daniel Craig is jealous son who wants what he can't have. Check this film!!",
            "review_date": "2014-08-18",
            "source": "rt"
        },
        {
            "content": "A good movie for sure. Has really great intensity and consistency.",
            "review_date": "2014-08-18",
            "source": "rt"
        },
        {
            "content": "only five stars 'cause that's all the page will let me give.",
            "review_date": "2014-08-15",
            "source": "rt"
        },
        {
            "content": "Not your typical Tom Hanks movie but one that shows there are no roles he cannot do, a very well balanced movie  everything in the movie works I felt, nice score as well and nice direction makes this one a must see. Hanks fan or not but seriously who doesn't like Tom Hanks?",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "One of the most visually stunning movies I have ever seen. The props, the wardrobe, the cold wintery feeling that you get while watching it.. Not to mention it's a heartwarming father/son on the road movie with some deep performances from both actors.... But it's also a gangster movie. I fell in love with it the first time that I saw it. Since has become one of my re watchable over and over movies. It's on my shelf with one flew over the cuckoos nest, cool hand luke, and of course Young Guns. Like those, it never gets old",
            "review_date": "2014-07-31",
            "source": "rt"
        },
        {
            "content": "Somber and cold, Road to Perdition is one of the most compelling father-son stories put to film.\n\nThe movie is beautifully shot by Conrad Hall in the style of someone who had been making movies since the 50's- unmistakably classic in approach, but with many bold compositions.\n\nThomas Newman's score is beautiful and melancholy, with flourishes of Irish folk. The scene where Tom Hanks and Paul Newman perform a piano piece is among the most beautiful musical moments in film history.\n\nJude Law gives one of his most underrated performances. Very creepy.\n\nI love this movie. The overall feel of the film just does the trick for me, and it's definitely worth watching.\n\n\"Sons are put on this earth to trouble their fathers.\"",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "It has a nice representation of the bond between a father and son and it has great looking shots but it simply doesn't have enough weight and substance to carry its themes. The child adds nothing to their journey and the movie doesn't know what it wants to be. I thought it was okay but I don't think it deserves the praise.",
            "review_date": "2014-07-19",
            "source": "rt"
        },
        {
            "content": "Fantastic and moving graphic novel story that is essentially about fathers and sons in crime, 'Road To Perdition' is handsomely mounted on every level (bless Conrad L. Hall, one of the greatest DP's ever!), boasts stunning performances all round, from a lot of people playing against type (bless Paul Newman), and is, without doubt, the most underrated gangster movie in history.  I struggle to see what it is about this perfect film that people don't enjoy....I wait for someone to explain what about it makes it worthy of any less than five-star, classic status.",
            "review_date": "2014-07-19",
            "source": "rt"
        },
        {
            "content": "Quality drama starring Tom Hanks that has taken me 12 years to get around to seeing. Great cast that includes Jude Law, Daniel Craig and the legendary Paul Newman. 8/10",
            "review_date": "2014-07-17",
            "source": "rt"
        },
        {
            "content": "All the magic of old WB gangster films done with the emotional delicacy of Sam Mendes. Look for an early chameleon performance of pre Bond Daniel Craig.",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "Sam Mendes is a visual story-teller. Using some of the greatest cinematography of all-time, Mendes creates mood, feeling, and foreshadowing  to tell this story of father-son relationships. Mix that with the great, veteran acting of Tom Hanks, Jude Law, Paul Newman, and Daniel Craig and you've a classic film for our generation. \nMy only problem with the film is it's ending. If the film had ended at the beach house, it would have been fine. But it outstays it's welcome, as this monologue voice over from the son ruins the final few minutes of the film. The content of the monologue tries to give depth to the Hanks character since the film didn't devote much time to revealing Hanks character and his depth.\nOther than that, \"Road to Perdition\" is a thrilling, suspenseful, beautiful (I mean BEAUTIFUL) film that contains great performances.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "Les Sentiers de la Perdition est un thriller extrêmement stylisé et déroutant, qui préfère raconter la filiation entre un père et son fils au lieu de la fuite d'un ancien tueur à gages et qui se trouve être un film partiellement réussi. La première heure est particulièrement lente, avec peu de scènes mémorables et beaucoup de choses qu'on a déjà vu dix fois ailleurs. C'est la deuxième heure et le remplacement de Daniel Craig (un peu over-the-top) par Jude Law qui rend le film bien plus intéressant, avec des séquences plus réussies (la fin du film, la fusillade dans la pénombre) et des personnages enfin exploités. La musique de Thomas Newman est excellent mais semble être prise d'un autre film.",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "With beautiful cinematography and stellar acting 'Road to Perdition' is one of my favorite films as well as an thriving inspiration for my film making style.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "Watching the movie with my son right now, on Fathers Day.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "Tom Hanks just adds to his already stunning resume by showing that he can play gangsterâ?¦ while still remaining true to his own personality. A gangster with a heart and a conscience, and working with Paul Newman only adds to that three dimensionality.",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "Among all things that are great in this film, from the top-notch performances to the superbly solid script, it is the late Conrad Hall's beautiful cinematography that makes \"Road to Perdition\" a true masterpiece.",
            "review_date": "2014-06-04",
            "source": "rt"
        }
    ]
}