{
    "rating": 1.4,
    "release_date": "2002-02-08",
    "num_reviews": 50,
    "genres": [
        "Action"
    ],
    "summary": "Jonathan (Chris Klein) is the most popular player in the fastest and most extreme sport of all time: rollerball. Along with teammates Marcus (LL Cool J) and Aurora (Rebecca Romijn-Stamos), Jonathan is giving viewers what they want: visceral thrills, breakneck speed, and head-slamming action. Things go wrong when rollerball's creator, Petrovich (Jean Reno), realizes that serious on-court accidents bring higher ratings. Soon Jonathan and his friends are playing for their lives.",
    "reviews": [
        {
            "content": "This movie is very boring but the stunts in this movie are amazing ",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is sadly a missed opertunity. It does do a good job giving the old film a modern update and the cast was pretty solid as well. Sadly the film doesn't have nearly enough character development so the motivations for the villian are not even clear. This film also has very little social or political commentary which was the best part of the original. ",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have a habit of watching movies that are remade without having seen the original. More often than not I enjoy the remake but there are moments where I prefer the original. This one looked pretty good to me. I enjoyed the action, the sets, the actors, and the story. But there were plenty of things that I disliked and over time I began to realize the criticism was valid. Later I learned from the making of the movie that this had a monster of time in development that ended up making things that did stick out like a sore thumb. \n\nIn the near future, a brand-new sport is making waves across the Atlantic called Rollerball. A hard-hitting, popular team sport that is attracting players as well as media attention from all over the world. Jonathan and Marcus are two Americans that ditch their California street skating to become highly paid athletes of Rollerball. Only because the sport is brand new and unregulated in Eastern European and Asian circles, particularly by a vicious promoter named Alexis. Jonathan also gains the attention of a gorgeous player named Aurora who learns just like him that these games are dangerous beyond what happens in the arena. Worked to make Alexis as much money and power, the players are doomed to either disgrace or death. Unless of course, they find a way to fight back.\n\nI originally enjoyed watching this movie. With a great cast like Chris Klein, LL Cool J, Rebecca Romijn, Jean Reno and so many other great performers. Not to mention directed by John McTiernan, the man who directed two Die Hard movies, the first Predator movie and The Hunt for Red October. So, it was surprising to me that this movie wasn't as good as it should have been. I still like a lot of things about it but also plenty of bad things here that make it hard to watch.",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Again this movie was made for teenagers and kids but teaches the wrong ways to act in public or in private, thus my 1 and 1/2 stars rating!",
            "review_date": "2022-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remake of the 70's classic, this one stars Chris Klein and LL Cool J as teammates in the rough and tumble world of Rollerball, a futuristic sport featuring aspects of roller derby mixed with motorcycles an quidditch.  Even still this is a pretty fun action/sports movie.",
            "review_date": "2022-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lacking any character depth or development. This movie is a confusing, hollow mess. I just didn't care about anything happening. The editing makes it hard to follow. Its goofy and silly too. I would have liked more development with the setting - not much is explained well. I did like some of the action shots. I watched the PG13 cut but you can tell they edited out blood and cursing from the unrated/R cuts. Some of the fighting and hits can look pretty brutal and are done well enough.",
            "review_date": "2021-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crippled by obvious inferiority and failed focus therefore lost balance through bland, mindless action, aimless performances and pointlessly directed cinematography, while the only highlighted bit is Klein's climatic attempt in briefly replicating James Caan's rebellion. (C)",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Takes Norman Jewison's hokey 1970s film and manages to make it exponentially worse. Loud, garish, cheap looking, poorly edited. Looks like it wanted to be graphically violent, but was watered down to an anemic PG-13. The final scene had me howling with laughter.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost indiscernible plot. Extremely difficult to follow the action with constant motion shots. Terrible movie",
            "review_date": "2021-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Removing the social critique of the original, this updated version of \"Rollerball\" is violent, confusing, and choppy. Klein makes for a bland hero. That's sad, since it's brought to you by the man who made the great movies \"Predator\" and \"Die Hard,\" so he must be turnin' in his grave here.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Removing the social critique of the original, this updated version of \"Rollerball\" is violent, confusing, and choppy. Klein makes for a bland hero. Add in the PG-13 rating, and The Burnin' Medallion Of Badness takes offense. Characters: 0.5/5 Story: 0.5/5 Acting: 0.5/5 Special Effects: 0.5/5 Direction: 0.5/5 Cinematography: 0.5/5 Soundtrack: 0.5/5 Overall: 0.5/5",
            "review_date": "2020-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why remake a classic? this film is poorer in every way to the original and serves no purpose other than be a curiosity if you liked the original.",
            "review_date": "2020-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "completely inept at every level the film becomes an unintentional comedy extremely quickly.",
            "review_date": "2020-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intuition can be a shrewd and prophetic tool in the right mind.The first word that rang out like an alarm bell in my head within the first 10 minutes of this remake was 'Thin! And from there on in it lost any weight it presumed it could carry. Lacking any punch or delivery this is a sustained effort of one hell of a dire mess that needs cleaning up and flushed away.",
            "review_date": "2020-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rollerball (4 out of 5 stars) Rollerball is a science fiction remake about a futuristic sport were tyrants are trying to increase the sport rating by having violent events. Chris Klein takes on the main character and did a decent job. The cast is good. Nothing award winning performances. There is plenty of mindless action to make this entertaining. It is bloody and brutal. The costumes of the sports teams are cheesy and weird. The plot is good. The soundtrack is heavy metal rock that is good. If your looking for a mindless action movie. This would definitely be recommended.",
            "review_date": "2020-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not nearly as bad as I thought it would be. ",
            "review_date": "2020-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall, I'm shocked. Quite possibly one of the worst remakes I have ever seen in film history. With uninteresting characters and a thin (yet predictable) plot, Rollerball's excitement fizzles rather quickly. The game itself is hard to follow due to excessive close ups. And to think, this film was directed by John McTiernan. He's the man and legend who gave us the greatest Christmas film ever made: Die Hard (1988). In the end, we're all human and make mistakes in life. If you decide to watch this film you just made one of them.  1.1/10 - Walkden Entertainment",
            "review_date": "2020-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing cast, with an amazing story.",
            "review_date": "2020-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even worse than the original!",
            "review_date": "2020-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst remake possible, probably destroyed Chris's career",
            "review_date": "2019-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The viewer should be paid for watching this piece of trash.",
            "review_date": "2019-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More of a mindless action film and less thought provoking as the original.  But still, that doesn't refrain it from being just straight entertaining ",
            "review_date": "2019-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After the first game it completely came off the rails.  Maybe if they would be focused on the game and not stupid things it could've been something.",
            "review_date": "2019-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This remake was one of the worst decisions in Hollywood history, but at least they did it horribly. I notice McTiernan hasn't had much work since this stinker hit the water.",
            "review_date": "2019-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "how can i give it less than half a star!?",
            "review_date": "2018-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was batshit crazy from the beginning and didn't really go anywhere by the end.  From the adrenaline junkie start to the film to the ultra-violence in the Rollerball arena, this movie does not know what it is trying to say.  Telling me, the viewer, to feel for the hero when he is an entitled brat who is making tons of money, driving fast, exotic cars, banging hot chicks nightly and has literally nothing to truly worry about. Even during the later sequences, trying to follow his mindset is confusing and takes away from the moments. Including the tried and abused trope of rich people using money and influence in poorer nations in order to continue to fill their coffers and kill with impunity does nothing to change the blandness of this film. The on court sequences were decently done and made the film move relatively quickly. Congrats to Paul Heyman for absolutely stealing the show and owning the line of the movie, \"the other rules are in russian and confusing.\" Also good to see Shane McMahon making a 10 second cameo that does not go anywhere at all. unless you want to see Rebecca Romijn topless or watching mindless violence in the name of sport, this is not really a movie that needs to be watched.",
            "review_date": "2018-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "McTiernan was not the right choice to remake the original. The film is a combination of bad filmmaking and studio interference, the behind the scenes stories are more interesting than the final product. There's a 10 minute night vision action scene because the director shot it next to dark. This is quite possibly one of the worst films ever created by a gifted filmmaker. The film robs the social commentary for absent minded action scenes, the story behind the scenes had this full of grim action that might have helped it achieve a future cult status. This film had a better original script that McTiernan butchered with poor choices and created a bad film. This is a prime example of horrendous filmmaking and the incorrect director, think McG on Terminator Salvation. 01-01-2018.",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rollerball is one of many unnecessary remakes that follows the trend of erasing the political subtext of the original and making a straight-up action movie with repetitive action sequences and a cast of college kids who can't act their way out of a paper bag.",
            "review_date": "2017-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This wasn't that bad.  I never saw the original though.  The acting was a little rough, as to be expected.",
            "review_date": "2016-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible. An insult to it's brilliant predecessor Even Battlefield Earth was better than this.",
            "review_date": "2016-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible. plain terrible. Confusing story and awful casting. Lacks everything. Waste of money and time. These people should be ashamed of this bomb of a movie they created.",
            "review_date": "2015-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only thing this remake has in common with the original is a sharp critique of an imaginary world that is meant to be a critique of our own. Other than that the story deviates sharply from the original. Whereas the original centered around the game of Rollerball itself, and staying in that game, the characters in this film are more interested in getting away from the game. In the original, Caan was morally oblivious to the fact that he was involved in sanctioned mass murder, not so the heroes of the Rollerball reincarnation. They are fully aware of the repercussions of their actions, yet their reason for involvement in the game in the first place is not soundly proved.\nOne element extracted form the original into the remake is to make the fast paced action of the game scenes in the original the norm for the whole of the remake. The performance of the actresses and actors in the film are obscured by the swirling sequence of actions so their relative inabilities become masked and not detrimental to the film as a whole.",
            "review_date": "2015-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you remake a cult classic try not getting the most vanilla actor available.Noisy,busy unwanted remake",
            "review_date": "2015-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5/24/2015: Other than a couple decent scenes, this was not a great movie.",
            "review_date": "2015-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only movie I've ever turned off half way through.",
            "review_date": "2015-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As much as I like McTiernan as director (he did Predator, Die Hard 1 and 3) he really messed it up here. Techically is fine, but everything else is putrid.",
            "review_date": "2014-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the worst movies I have ever seen. Rollerball goes wrong in almost every single area. The plot (what there is of one) is bad (or baffling might be a better word). The acting is bad.  Chris Klein is not a leading man and his performance was tepid at best. LL Cool J seems vaguely lost in his role as Jonathan's sidekick. Rebecca Romijn-Stamos flits through half of the film with a bad Eastern European  accent and a helmet over her head.  Jean Reno came off as nothing more than a caricature of corrupt Central Asian warlord. \n\nThe editing is a textbook case of how not to edit a movie. It was an incoherent collection of random and rapid fire shots, sometimes repeated in slow motion for needless emphasis, that amount to a number of muddled and disjointed action scenes.  In the original, we understood how the game worked on a circular track. In the remake, there's a track that crosses at points like a figure eight, but because we're never shown an entire \"play\" in this game, we never understand the inner workings, so it's like watching a sports highlight film for a sport we've never seen before.  At no point during the film are we ever shown a score for a game. There were three games played in the film, but we were never told what the score is not through the incredibly annoying announcer or through graphics. If the score doesn't matter, the characters have nothing invested in the outcome of the game and the audience is not liable to care.  Moreover, this film failed to duplicate one of the best aspects of the original:  hearing the sounds made by the athletes, fans and motorcycles during competition.  Instead we are subjected to blaring rock music that distracted from the thrill of competition. The only good thing about the soundtrack is that it drowns out the inane dialogue. \n \nThe original Rollerball had the struggle of wills between Jonathan E and Mr. Bartholomew as its underlying theme, but this film has no such subtext;  leaving only a ridiculous plotline plainly obvious to the viewer. This raises the question: why remake this?  If you're going to remake a movie, there should be some kind of compelling reason to remake it such as a new take on the original story or improved special effects based on today's technology to take the concept further.  \n\nThere is nothing about this movie that I can recommend to anyone.",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's one of the best worst film ever made.The James Cann version was perfect, you just can't remake something that good. The only positive thing about that movie Rebecca Romijn's Russian assent, looking at her topless. .. sexy, I would watch that movie just to see her.",
            "review_date": "2014-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wanting so see the original Rollerball but aware that remakes were terrible, I simply watched Rollerball because of the fact that it had John McTiernan as the director.\n\nIgnoring the dystopian theme of the original film, John McTiernan updates Rollerball for 2002's contemporary MTV crowd and makes it simply a modern day story about a violent reality TV show with a bunch of attractive young people competing in a popular sport. This ignores all of the importance in the original short story by William Harrison so much that it practically disgraces him. It takes the commercialised aspects of the story and attempts to build on it from there as much as it can, doing the same thing that Paul Michael Glaser did when he directed his despicable adaptation of the Stephen King story The Running Man. Rollerball is a repeat of that terrible feat, except a lot worse because there isn't any fun in the gimmicks this time, and only the most ignorant MTV obsessed viewers will actually find this interesting.\nFor some reason, despite being fairly action heavy, Rollerball fails to actually glamourize the sport it is attempting to create. The action sequences are so boring and repetitive that it is hard to actually find the motivation to keep on watching. The technical issues in the viewing experience are different to the ones in essentially every other bad action film of today. The problem with action these days is that the cinematography is excessively shaky and the editing as way too fast. But the problem in Rollerball is that what is actually being filmed is pointless and stupid. The camera shots in Rollerball are all from the wrong angles because instead of capturing everything in perspective, the camera only ever captures a small portion of the actual character on screen or the motorbike being used, and it fails to actually make anything look the slightest bit good. Seriously, for a film that is so overblown with action, Rollerball does not have a single good action scene which means that it fails to do what its story intends in terms of glamourizing the titular sport. Rollerball is built on a lot of weak roots, and one of the most central ones is terrible action scenes. It makes the film less convincing, more artificial and above all just genuinely pointless. The titular sport of Rollerball is made to look like one of those children's game shows for adults, but its lack of technical quality make it simply a blur on the eyes which isn't the slightest bit tense of entertaining. One of the scenes in Rollerball is an extended terrible motorbike chase scene filmed entirely with a night vision camera technique which is both pointless and visually awful. You can just tell that John McTiernan has lost sense of making Rollerball a visually good film any better than he could tell a story. John McTiernan reveals that it is time for him to retire on a low note because Rollerball shows that the once promising sense that he had as a film director is no longer present. He cannot remake a film and cannot create good action out of a roller derby game, so why he was given a budget of $70 million is way beyond me, but the fact that the film lost more than $44 million makes perfect sense.\nRollerball is simply a very painfully vain commodity which attempts to use its soundtrack to appeal to the MTV generation, Chris Klein to capture the interests of American Pie fans and Rebecca Romijn to entertain people obsessed with her seductive role as Mystique in X-Men. Rollerball even gives her a scene in which she is topless, although it is unnecessary, poorly filmed, darkly lit and clearly thrown in there for publicity purposes. But it doesn't do any justice for any of them, and simply waits around for the next crappy action scene to fit into the story. There is not a single moment that I was entertained in Rollerball with the exception of the last two minutes of the film which were slightly entertaining. But Rollerball isn't even fun as a camp film or a movie that is so bad that it's good. It Is just so bad that it's terrible.\nA lot of people have put crap on Chris Klein for portraying a bland hero, but few people seem to realise that the entire movie is written to be bland and dooms any potential actors from the start. So it is clear that Chris Klein has nothing to work with, and in all seriousness an actor whose career is built on supporting performances in the American Pie films and an effort in the Academy Award nominated Election is not one that is strong enough to actually hold the low quality of Rollerball up. As the lead actors, Chris Klein is forced to carry lacklustre storytelling on his shoulders, and there is no way that he ever had a chance of doing that so his performance is not great. But none of the actors in the film really are. Although Jean Reno is ok simply because it is really easy for him to portray a villain by creating a sense of mystery, Chris Klein is an actor ideal for the role because the material is terrible but not actually ready to hold up a $70 million film. The criticism in the film can be more attributed to Larry Ferguson and John Pogue for their terrible script, and Chris Klein got a lot of the blame for it. But the fact that in such a terrible film he actually tried is slightly admirable. He failed, but at least he gave it his all which is more than can be said for anybody else involved in the production of Rollerball.\n\nSo Rollerball manages to get everything wrong as a remake and as a standalone film because it disgraces the original story, the original film and then the viewers all at once without an ounce of entertainment to boast.",
            "review_date": "2014-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "rubbish. complete and utter rubbish. don't bother watching it. stupid story and crap actors.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original Rollerball was great, it had a little bit of everything, this one is sort of a remake of that one, but they changed a lot and everything was worse for it. Basically, Chris Klein is recruited by Ladies Love Cool James to play Rollerball, the game is mostly the same as the original, but they made the course much more complicated where it was hard to really tell what was going on. The story sort of follows the original, but does everything terribly. Sometimes, these remakes can revive a series by modernizing it and kick start it again, this is not one of those.",
            "review_date": "2014-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This could have been so much better but thx to a stupid studio the film looks and feel weird. McTiernan repeatedly fight with the studio who absolutely wanted to make this film a PG13.Too bad because in the hands of such a talented man a film like this could have become something very big and fun...as it is it's just another cheap action flick with a great cast trying to save what can be..",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rollerball is a disorienting disaster - a collection of violence, weak protagonists, and woozy editing without a hint of narrative, reason, pacing, or logic.",
            "review_date": "2013-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very very very poor remake of a 70s classic.. the only thing i enjoyed about this film was the comical wire twing sound effect during the night vision bike chase.",
            "review_date": "2013-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst assembled movie I have ever seen. There is not a single moment of decent filmmaking.",
            "review_date": "2013-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly watchable, albeit unmemorable.",
            "review_date": "2013-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a remake of Norman Jewison's 1975 sports/sci-fi dystopia, here directed by John McTiernan (Predator (1987), Die Hard (1988) and Last Action Hero (1993)). It seemed like a good idea on paper, but on film, it's an absolute mess. God knows how, but this manages to look even more dated than the 1975 original. Everyone went in with so much good faith, but it was delayed by a year and it sank without trace, not surprising really. It is the year 2005, and rising hockey player Jonathan Cross (Chris Klein) is approached by Marcus Ridley (LL Cool J) to compete in the highly competitive sport of Rollerball, which is popular in Asia, Russia, Eastern Europe and parts of the Middle East. Cross is playing for the Zhambel Horsemen in Kazakhstan, and Jonathan is groomed by promoter Alexi Petrovich (Jean Reno), who gives him riches and fame. But, Jonathan, Marcus and fellow team member Aurora (Rebecca Romijn) discover skulduggery regarding Alexi's business strategies, with staged \"accidents\" occuring during the game, just to get the viewing figures up, Jonathan wants to put a stop to all this. It could have been a good film, but McTiernan failed with a cast who are stilted and a script that's as cliched and cheesy as they come. It's all over the place, with fast action that's impossible to keep up with and this is ADD cinema, and it shouldn't have come to all this.",
            "review_date": "2013-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really don't care what's in the original this is my first experience with rollerball. I say this movie is a speed racer of sport type movie. \n\nI don't agree with the world on this movie.",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible on every level. The only good thing to say about this movie is that it does eventually end. But, by that time your brain is pretty well fried. Just save yourself the time and watch something else. This movie sucks",
            "review_date": "2013-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could of been filled with background on everyone. The whole movie was slightly rushed.",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        }
    ]
}