{
    "rating": 9.6,
    "release_date": "2002-09-20",
    "num_reviews": 150,
    "genres": [
        "Fantasy",
        "Adventure",
        "Animation"
    ],
    "summary": "10-year-old Chihiro (Daveigh Chase) moves with her parents to a new home in the Japanese countryside. After taking a wrong turn down a wooded path, Chihiro and her parents discover an amusement park with a stall containing an assortment of food. To her surprise, Chihiro's parents begin eating and then transform into pigs. In this supernatural realm, Chihiro encounters a host of characters and endures labor in a bathhouse for spirits, awaiting a reunion with her parents.",
    "reviews": [
        {
            "content": "One of the best animation movies ever! It is a must watch for all the animation fans and Japanese anime enthusiasts.",
            "review_date": "2023-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great watch! Imaginative, fun and unique characters, and beautifully animated. The story feels both very real and fantastical at the same time.",
            "review_date": "2023-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is an awesome movie that you must have watched at least once in your lifetime. The only thing that is missing for me is an epic Fight/Chase scene at the end of the movie",
            "review_date": "2023-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of Hayao Miyazaki's most iconic animated films. It is also one of my favorite movies",
            "review_date": "2023-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 02 hours: and 05 minutes ever!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a good movie. I'm not an anime person, but this is a good movie.",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My very first 5 star review. This movie is absolutely beautiful, and is one of the absolute best films period.",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i wanted to stop existing halfway through.",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic, one that every generation of kids will enjoy (and some older family members!).",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story telling is actually fantastic and deep, many ppl nowadays has been devoured by real life. they let their greed control their mind. just like how dad and mom in movie got turned into pig. in conclusion i think the movie is kinda hard to uiniderstand if u only watched it for once",
            "review_date": "2023-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie had many twists and turns, but overall it was very interesting and a fun film.",
            "review_date": "2023-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you'd choose to ever see only one animated movie, this is it: Studio Ghibli's \"Spirited Away\" will prove it's boundless merits to you, starting with it's breathtaking, hand drawn presentation. Thru incredibly patient detail, Ghibli's artists bring to life everything from accurately portraying the feelings and physical movement of a young girl, to landscapes and environments full of detail that are so typical of the respect given by Japanese Shinto. But more importantly, the story in \"Spirited Away\" addresses the hallmark issues of modern Japan; issues which are incredibly human, and universal.\n\nA coming of age story, this animated movie brings to light almost all the important challenges that we face today: Everything from bravery in the face of disaster, the value of generosity and friendship, respect and patience for others... I continue to draw inspiration and see depth in this film years after having first seen it. \n\nJapanese culture is known to be one of hard work and excellence, and \"Spirited Away\" presents that solitary, dedicated life to a tee. Another great theme in Japanese culture is the important ability to befriend enemies and adapt to change. But perhaps it's greatest insight: that whatever you have lived, no matter if forgotten, stays with you and empowers you, is perhaps this movie's most important lesson. One that is transmitted with the greatest care and consideration; something that is deeply lacking in our society today.\n\n\"Spirited Away\" is a shining example of excellence in story telling, and will stand as a benchmark for filmmakers for ages to come.",
            "review_date": "2023-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spirited Away is filled with breath taking animation, an amazing soundtrack, and some of the best world-building you'll ever see. Studio Ghibili creates an endless amount of all-time classic movies that I will for sure be rewatching for the rest of my life. This movie is no different. I can't imagine how challenging it was to create such an amazing world. All of the different creatures and characters make it feel so alive. I'm so happy I finally got to watch this movie. No question one of the best animated movies I've ever seen and is landing a spot in my top 100 movies list.",
            "review_date": "2023-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazingly animated film.",
            "review_date": "2023-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An eternal masterpiece!!! Great story with outstanding meanings and symbols for both adults and children, and surely wonderful animation. The most deserved Oscar ever!",
            "review_date": "2023-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything about this film is beautiful, visuals are beautiful, Miyazaki and his team has done a fantastic job as the world already know, the plot is as beautiful as it's adventurous and calming at the same time it's the magic of Miyazaki.",
            "review_date": "2023-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "such a beautiful movie the best movie ever and the best movie made by studio ghibli the voice acting and animation is beautfiul and the story and writing outstanding.",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is beautifully animated and one of Ghibli's best films. The complex characters and themes are fascinating. Hopeful and inspiring, hopeless and gloomy. A true tear jerker and one of the most memorable animated movies of all time.",
            "review_date": "2023-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully drawn, and a unique storyline that showcases elements of Japanese culture put together in a fairytale like masterpiece.",
            "review_date": "2023-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite animated movie",
            "review_date": "2023-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gorgeously bright and escapist. One of the best Ghiblis.",
            "review_date": "2023-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Miyazaki always has a way to melt your heart.",
            "review_date": "2023-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the greatest movie of all time! The story, the visuals, the movie, it's all just amazing.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really cant describe what i felt after watching this, i have no idea what was going on in the moment at any point and they never explain anything. While i was watching it i was confused and waiting for it all to make sense, but it never did until the very end. I still cant describe anything about this movie but i can feel that this movie made sense and is one of the best movies ever, the only way to know is to watch it a movie has never made me feel this way its an emotion i cant describe. This movie almost doesn't seem real but i can remember every seen from it picture perfect which i can never do. The only way possible to understand truly what this movie is about is to watch it i still have no idea what happened.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It doesn't need my input, by any means, but I recently rewatched this with my daughter (had seen it once on my own and once in a film class before then), and this time I was gripped by all of the context that this movie has intertwined in its plot and art. I kept excitedly wondering and googling, \"What is the significance of xxxxxx\" or \"Why did he put that in this shot?\" or \"What does that Spirit represent?\" So much to unpack it was definitely worth the revisit!",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This will be my last review for 2022. Where do I even begin? If I ever did a Top 10 list with the greatest films I have ever seen, Spirited Away would easily be in the top 5. It is, undoubtedly, one of the greatest Japanese films I've seen, one of the greatest animated films, and certainly of the greatest films I have ever seen in my life. Probably one of the best of all time, as well. In contrast to Pixar and Disney, who already suffer from sequel/spinoff fatigue, repetitive themes and familiar plots (that elicit the same feelings all the time), Studio Ghibli manages to create true experiences. I don't mean to blame Pixar or Disney (they are both excellent in their own right), but movies from Studio Ghibli always make me feel something, whether that is happiness, sadness, awe, fear, melancholy, anger. Their animation is beautiful, absolutely gorgeous eye candy. Their characters (mostly female heroines) are always fleshed out and well developed. The plotlines are stupidly profound and engaging. The themes they present are relevant and thought provoking. I almost don't want to watch them, because I'm overcome with sadness when I realize that the beautiful adventure I witness will be over soon. Studio Ghibli are special. Their works communicate with the viewer, they make the strongest viewers (of every age, that is) sentimental, they make you feel like a child. They make you proud to still enjoy animation. They are timeless masterpieces. And Japanese cinema overall (along with Italian) is the only one that makes me so emotional. As for the movie itself, I cannot say much, because this is an experience that shouldn't be spoiled. The animation is astonishing, the characters lovely (I absolutely adore Kamaji and I would die for him), the story intriguing, Chihiro herself is a perfect protagonist because of her imperfections. Needless to say that the soundtrack created by auteur Joe Hisaishi is wonderful (I love his works very much and I consider him equal to John Williams). Hayao Miyiazaki himself makes perfect use of the story and Japanese folklore to convey a strong story of courage and determination. He is currently one of my favorite directors. I plan on watching Studio Ghibli's other works in the near future. For now, I recommend that you all stop what you're doing and go watch this masterpiece. This is what true cinema looks like",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not a fan of anime.  However, this movie had such a high rating I thought I would take a chance and see if there is an anime movie I could like.  Nope.  There's no doubt the animation is stunning, it's just that that's not enough for me.  I need a good story too, and this one just doesn't cut it.  So I would say to check this out only if you're predisposed to like anime.",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spirited Away is a movie that I normally wouldn't choose to watch but after seeing it, it made me open my eyes to anime and movies alike. The use of traditional Japanese culture made it almost feel like you were there. I was engaged and on the edge of my seat during the whole film because the script and storyline kept grabbing your attention. It is a very unique and intriguing story that makes you wonder if it was a legend that people passed down from generation to generation. I also really enjoyed the music in the film. Beautiful pieces of sound that brought a different life to the film. Overall, it helped me think in a different way than I had before I watched the film. A great reflection movie, would definitely recommend this even to those who aren't big anime fans.",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best animated movies ever. Miyazaki is brilliant and this is one of his best.  It doesn't follow the usual 3-act structure that we're used to in this country, but that's just part of what makes it great.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely live this movie, and it has a permanent place in my heart. This films use of colors and story boarding, in my opinion, makes it one of the best films every produced, seconded in those aspects only by other studio Ghibli films. Every time I watch it I notice something new, and that makes me want to keep coming back. Another thing this film does so well is the sound design, both the Japanese and English versions. There is a reason this film has so many awards and remains relevant.",
            "review_date": "2022-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film's long, but moves well. The animation is beautiful. The characters are crazy & colorful. The music is haunting. I can see why it's so popular.",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you're looking for a movie that feels like an actual adventure then I definitely recommend this.",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very charming movie, with great cinematography. Studio Ghibli did a fantastic job with this one, with solid characters, and an imaginative universe. My one letdown with this movie is the storyline, in some places, it is a bit hard to follow especially for younger audiences. Although, overall I would definitely recommend it, it is a timeless classic in my opinion!",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie ever animated!",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i watched this dudirng lockdown while drinking dalgona coffee it was the best experience ever it felt magical and really nice. i never got bored it had some eye catchin scenes that i really liked",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest animated films of all time. Stellar animation, interesting and relatable characters, a perfect musical score by Joe Hisashi and a timeless story in a unique fantasy world.",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not usually an Anime fan but the Studio Ghibli films are awesome!",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely. Fun and enchanting. This film manages to break your heart and fix it as well as making you laugh in 2h 5 min. Must see!",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie ever because of it great story and extraordinary animation from studio ghible",
            "review_date": "2022-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It will pull at your heartstrings.",
            "review_date": "2022-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is now one of my top favorite movies. I didn't give it 5 starts because I don't think a film could ever be that perfect for me. The film takes you through an amazing heartfelt journey, the acting and animation kept your eye the entire time. I recently got into anime and this is now at the top of my all-favorite movie list. The emotion throughout the film makes it almost believable as if this actually happened, and the fantasy world of it all. As the it gets more intense the music amps up and you can feel yourself slide forward in your seat and get a little anxious",
            "review_date": "2022-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily the best movie I've ever seen. Amazing animation and music. Wonderful story. One of Ghibli's best.",
            "review_date": "2022-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece worth watching",
            "review_date": "2022-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We own all of Hayao Miyazaki works, he is the best. We look forward to seeing them in the theater nothing better than seeing your favorites on the big screen.  A must see for all ages!",
            "review_date": "2022-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Spirited Away so much.  It was surreal experiencing this film in theaters.",
            "review_date": "2022-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome to see this movie on the big screen. Very clean and was happy they used original Japanese audio.",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great sound quality in this remaster. Epic visual in cinematic mode",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "probably the greatest movie ever made",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful film. As expected of Studio Ghibli.",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "slay the house down boots",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Miyazakis masterpiece? Its best seen on a large screen, where its lushness can wash over you. Ive seen this film a dozen times and I still saw details Id never noticed before.",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing, so beautiful, put together amazingly, honestly perfect!",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No words. Just watch.",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing piece of film to watch in threather!",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spirited Away is a great film, with a compelling story, beautiful animation, and memorable characters. Well worth the effort to see it on the big screen.",
            "review_date": "2022-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very weird fantasy film but is surprisingly appealing, is probably my favorite film on the list, the animation, the art, the characters are impressive, I mean yes is a weird film but you can find it enjoyable, I watch the entire film in Japanese instead of the dub, a lot of people like this movie mostly because of how beautiful it was but not everyone because is crazy and strange weird film, Spirited Away is impressive, but is weird and freaky. 9/10",
            "review_date": "2022-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hand drawn anime. This is the real deal. An amazing film w/c only continues to amaze each time I've seen it (this was at least my 4th time). Mouthwateringly beautiful artwork, richly complex and detailed plot ,settings, and characters. Great music. Sweeps you into a world that is as familiar as it is very very strange and unique. The only way to even begin to fully appreciate it is on the big screen. Can't wait till next year's Ghibli fest!",
            "review_date": "2022-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic of low key spooky, great adventure and a wonderful family friendly film.",
            "review_date": "2022-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation is just immaculate. The fantasy of it all is so nostalgic and brings me back to my childhood.",
            "review_date": "2022-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was wonderful seeing it on the big screen. What a great story and incredible animation!",
            "review_date": "2022-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie.  Fun for all ages.",
            "review_date": "2022-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very pretty animation",
            "review_date": "2022-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cant believe I waited this long to see this movie, great storyline from beginning to end. Im always happy when movies have a heartfelt ending.",
            "review_date": "2022-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spirited Away is a magical experience and a must see for young and old.",
            "review_date": "2022-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Will forever love this movie",
            "review_date": "2022-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible animation and story!!",
            "review_date": "2022-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion the movie is good, because the story is very creative:\nIt tells about a girl, who moved with her parents to new city. When they stop for lunch, she ends up getting lost. \nEmbarking on  another world, she has to put aside her fears and fight to get back.",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fing A Right. A few hours with the master, makes the world more bearable. Thank you, sir.",
            "review_date": "2022-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Animation: 10/10\nDirecting: 9/10\nMusic: 8/10\nCharacters: 10/10\nStory: 8/10\nA Must-see!",
            "review_date": "2022-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The biggest strong points of the movie is its music, world and detailed visuals. The music was very distinctive and kept me happy throughout especially in the silent moments of reflection in the film. The world was very engaging and creative where you wanted to know more about so many of the spirits that you see in the film. So many have great character in simply their design and engages you with simply that. They put a lot of work to make the entire world feel real and through the incredible detail. You could tell that a lot of heart went into creating everything you see in the film. The focus on the world is so great that you forget there is a story to tell and what the objective for this little girl is. I just wasn't led to believe in much of the film that getting her family back what she wanted to do, but more so something that she felt obliged to do. I understand why there is so much love for the film but looking at it with a more critical lens has me noticing that the main story of the film had the least attention compared to everything else.",
            "review_date": "2022-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THE movie that brought anime into the mainstream!",
            "review_date": "2022-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Miyazaki's masterpiece and probably the most acclaimed work in his immaculate cannon of work, Spirited Away is filled with symbolism, thought provoking questions and heart which all add up to a piece of cinematic art. While Miyazaki's works may be too \"weird or out there\" for a lot of casual film fans, anime lovers are sure to look beyond that and let it add to the fantastically element that it strives for. Miyazaki films are truly great films in both the traditional film sense and for being amazing adventures of fantasy for anyone willing to take the journey. Spirited Away will suck you in and only let go once the credits have rolled. That being said, the story and characters will stick with you after the movie is over and have a fond place in your memory as all Miyazaki's films do. Highly Recommended!",
            "review_date": "2022-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far one of the best animated films to date. Both children and adults will find themselves entranced by the art style and mystery the film brings!",
            "review_date": "2022-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of my favorite movies of all time. The first time I watched this movie was when I was a little girl, and ever since then, it has really resonated with me. I still go back and watch it sometimes for the nostalgia, but also the actual movie itself. It's such a beautiful movie to see. I will admit, it is pretty weird. I love weird things though so I can watch it a million times.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First of all, this film is very beautifully drawn. The movements and expressions of the characters, as well as the water, are very beautiful and captivating. Also, seeing the main character, Chihiro, grow and develop makes me want to do my best as well. Spirited Away makes me want to have more confidence in myself and start something new.\n\n★★★★★",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I personally really like this movie for many reasons, but especially because of the soundtrack and I can relate to Chihiro. \nFirst, I think that the music is nostalgic and at the same time it portrays Chihiro's feelings. \nSecond, Chihiro has similar challenges as me. Even though it is a fantasy movie, the anxiety that comes along with growing up is real.\nI would give a five out of five stars to this movie. If it is hard to understand for someone, then it is because they need to relate more.",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a ride. I love this movie. Some real masters were behind this picture. Miyazaki's best I would say. I was blessed to see this in a theater and what a privilege that was. I feel Ghibli films are meant to be seen in a theater, as I have seen several at home, and a couple at a theater, and they definitely feel different. It feels so much more grand in a theater with a large screen and surround sound. There were many moments in the film that were pure magic, where I just sat up, wide eyed, saying \"woah\". When she overlooked the train riding on the water, that was incredible. Not everything about the film clicked for me though so I'm not giving it a full rating as it's just my opinion, but I would 100% recommend it for everyone to see. It is incredible, pure movie fairytale magic.",
            "review_date": "2022-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have heard for years the praises of this movie… and it was just okay. The animation was great and the score was soothing, but that's the only 10 out of 10 stuff here. The characters and were less than satisfactory. When the movie finished, my literal reaction was \"meh.\" 6.5/10",
            "review_date": "2022-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish Spirited Away was in the late 80s DuckTales version.",
            "review_date": "2022-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Heroes Journey oneiric fantasy. Can't stop rewatching!",
            "review_date": "2022-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all-time favorites - an epic adventure tale of a young woman separated from her parents, trying to find her way back. It's one of the best fantasy films of the twenty-first century - a heartfelt, heroic tale that viewers can return to again and again.",
            "review_date": "2022-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The whole series of Ghibli anime is fantastic. This one is as good as the others and I don't know why people in the West seem to obsess about this one in particular but they are all equally extraordinary.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For the life of me, I do not understand all the hype of this movie, the animation was just okay, but I gave up after 40 minutes into the movie thus my rating of *1/2* stars.",
            "review_date": "2022-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How could anybody hate this? It's like the best all-age classic animated movie like- \nAnd you could watch this with anyone like parents, children, and even a cozy Friday night? My point is that this movie is a G! If you haven't watched it go for it! I've personally watched it for like the 4th time or something. Sue me.",
            "review_date": "2022-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've recently went through most of Studio Ghibli catalog and wow, WOW am I ecstatic that I did. This was the first time I've watched this and there will be many more to come. Not only was this movie magical, but it was a testament to what a movie can be. I honestly love Pixar and most of all WALL·E being my favorite. And even that spectacular masterpiece doesn't live up to what a magical, and magnificent film this truly is. With that said I think this is a movie that will stand the test of time, and I'm excited to see even more of their films starting with My Neighbor Totoro!",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolutely incredible film. It is definitely one of Studio Ghibli's best.",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's mesmerizing to watch, beautifully animated, imaginative storytelling.",
            "review_date": "2022-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ghibli's best movie in my humble opinion.",
            "review_date": "2022-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece of animated cinema",
            "review_date": "2022-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is amazing.  It surpassed all expectations and showed an amazing amount of imagination.  A beautiful merging of art and entertainment.",
            "review_date": "2022-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exercise in imagination.  So this is about a 10-year-old girl named Chihiro (Rumi Hiiragi).  Her family is in the process of moving to the suburbs, and they explore the nearby area when they make a wrong turn getting to their new house.  It turns out to be quite the fateful event because Chihiro soon finds herself in a spell-filled world of spirits.  When her parents transform into pigs, it's all up to her to find a remedy and form an escape plan.  Now anime is admittedly a big blind spot for me.  For years I dug my feet in and refused to watch it because there's such an extensive number of options that I didn't know where to start.  It's the same reason I've never really explored Bollywood.  However, I am making small steps to fix that, and I am currently enjoying the ride with my first series, Evangelion.  I decided to watch arguably the most acclaimed anime movie of all time, and Spirited Away is nothing short of wonderful.  Now, even though I am pretty green with anime, this is one of maybe two anime features I've watched in the past.  It was back when I started seriously getting into movies, so I would guesstimate that to be about fifteen years ago.  After all, I was looking at lists like the IMDb top 250 at the time, and this is universally rated highly, so why wouldn't I watch it?  I'm pretty sure I watched the dubbed version at the time, which is not something I did this time around.  Rewatching this was a great experience because I remembered next to nothing about it other than that image of a train ride with the masked character, so it was like I was watching it with fresh eyes.  Right away, this story entices you with mystery.  Sure, these are kind of terrible parents, but their shortcomings are the means to take you to this incredibly well-thought-out world.  They do a fantastic job of pulling you in because they don't take any time at all to lay out the rules.  This is a land where literally anything can happen, and you have to go along for the ride.  Oh, the parents are pigs now?  You don't have time to think about it because now there are ghosts, talking frogs, and a man with six extendable arms.  You can call this the Japanese Alice in Wonderland, and that would be fairly accurate.  I would argue that this is far more substantial because there is so much more character growth that comes with interesting character choices that are made throughout.  The world-building in this is nothing short of incredible, and this is a place that feels lived in at every turn.  This is a movie that fires on all cylinders.  The animation is standout, the score is terrific, and the pacing is taut.  Even if you were like the old me and resisted anime, you should make an exception for this one.",
            "review_date": "2022-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was the most imaginative and intriguing animated movie that I have ever seen and perhaps that there has ever been. There was seemingly no end to the creatively-drawn spirits whose main purpose was to populate the background. Every part of the plot was compelling in its own way, especially the life-or-death consequences given to each decision. Watching this after first seeing all the previous Ghibli movies lent a tremendous sense of innovation and achievement to the whole thing as the animation style was improved by computers while still remaining stylistically unique. I may have to divorce my wife for falling asleep during the final 20 minutes!",
            "review_date": "2022-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": " Very euphoric movie, every scene is like a work of art. Personally I feel like some of it was a tiny bit drawn out and it’s noticeable enough that I can’t bring myself to give this a 5 star. Beautiful movie, 9/10",
            "review_date": "2022-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best animation i've ever watched",
            "review_date": "2022-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deeper interpretation of \"Spirited Away\" reveals its author's true intent: investigate the loss of identity and analyze the authenticity dilemma.\nMiyazaki criticizes contemporary Japanese society, dominated by consumerism and indolence, greedy like the protagonist's parents.\nIn the first sequence we see Chihiro, a listless and disenchanted girl who wears an oversized T-shirt, shorts and sneakers. Western clothes in clear contrast to the traditional uniform she wears once she \"becomes\" Sen.\nThe change coincides with the meeting with Yubāba who, thanks to a magic spell capable of stealing identities and memories, takes part of her name away (千 Sen is the first character of 千尋 Chihiro).\nThe dualism in \"Spirited Away\" (tradition and modernity, East and West) represents a strong conflict that converges in a profound crisis of identity. Haku is unable to remember his real name; No-Face is looking for a place to stay and be accepted; the River Spirit needs to be purified in order to return to its original form.\nThe confused cultural hybridism disorients and frightens the young protagonist who, however, finds the determination and the courage to assert herself and accomplish her coming-of-age. Chihiro/Sen will go back to wearing her old clothes, reaffirming her Westernized identity, but only after having rediscovered her roots, Japanese tradition, and the intrinsic authenticity of her physical and spiritual journey.\nIn \"Spirited Away\" we find all the themes dear to Miyazaki: environmentalism, socialism, the ambiguity of good and evil. But, also, the critique of capitalism and globalization, which deprives the meaning of imported ideas and discredits the local ones.\nBut \"Spirited Away\" is also, and above all, a visually splendid, delicate, rich and sincere film; perfectly edited and marvelously portrayed by its animated characters. It is a masterpiece of craftsmanship that finally consecrates Miyazaki's genius internationally, not only for animation but for cinema in general, spreading his aesthetic throughout the world.",
            "review_date": "2022-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a reason Spirited Away won the Oscar for Best Animated Feature — it's what animated movies are all about. Master animator, Hayao Miyazaki, creates a surreal world of talking frogs, bulbous witches, depressed spirits, and slithery wolf-dragons. The landscapes and food in Studio Ghibli movies always appear sublime. Chihiro (Daveigh Chase), a ten-year-old who is lashing out because she doesn't want to move, is thrust into the dreamscape after only a few minutes in an abandoned amusement park — her parents (Michael Chiklis & Lauren Holly) gorge themselves on unattended food, quickly morphing into ravenous pigs. Spirited Away nails the subtlety of intertwining overarching issues — environmentalism, consumerism, modernity vs. tradition — into the whimsical coming-of-age story. Kamaji (David Ogden Stiers), \"the spider-man,\" is the epitome of a Ghibli character — he's supernatural with an arch in his relationship with our protag and possesses a big heart. There are countless scenes where Miyazaki flexes his animation muscles, but my favorite comes with Haku (Jason Marsden) when he's in dragon form. It'd been a decade since I last watched this movie and it reminded me of what had made it so special. 20 years later, Spirited Away is still a must-watch and (so far) my favorite Studio Ghibli story.",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I seen this movie on Netflix was that the movie was so catchy and could be more beautiful animation by the Studio Ghilbli who created Howl's moving castle and My\n Neighbour Totoro and it is actually a folklore but really must see it now.",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely breath-taking scenarios and very fun to watch!",
            "review_date": "2022-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every time I rewatch this movie from my childhood, I recognize even more deep themes and lessons. This movie truly feels like comfort. Great animation film that will continue to have a lasting impact.",
            "review_date": "2022-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chihiro is a 10-year-old girl who discovers a secret world of strange spirits, creatures and sorcery. When her parents are mysteriously turned, she must summon the courage she never knew she had to break free and return her family to the outside world.\nIt is an extremely enjoyable film, I feel I can watch it as many times as I want and it will continue to be very good. My favorite part is when Chihiro helps the spirit made of water, a scene with a very well placed critique of pollution.\nA totally recommended movie, my only disappointment is that I didn't have access to this animation when I was a kid.",
            "review_date": "2022-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hayao Miyazaki's magnum opus and the greatest animated movie of all time",
            "review_date": "2022-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Something sweet, gorgeous yet dark and creepy about this tale of this young girl's quest to overcome her own fears.\n\nPlays with your own judgement calls, impressions and some nail biting moments.",
            "review_date": "2022-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a masterpiece. I've never wanted to live in a fantasy world so badly before, and the visuals are just stunning. It's like Alice in wonderland on crack, but with much more heart. Amazing character building as well.",
            "review_date": "2022-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spirited Away is a work of magic not to be missed. The director creates a world which is spectacular and makes you feel that you are progressing with the character throughout the film, he creates a sense of space portrayed through time, distance and scale. There are numerous moments where the characters just exist and nothing significant happens during those scenes, which is genius. In the film, you can see the hero's journey of growth from timid to triumphant. Her strong will to help her parents and also her selflessness when she puts others needs over her own.",
            "review_date": "2022-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this work, I did not find any flaws in it. Starting from the music, ending with detailed drawing and a deep plot. Director: Hayao Miyazaki, Kirk Wise.Producer: Donald W. Ernst, Toshio Suzuki\nWriter: Hayao Miyazaki. The work received many awards and nominations for the Oscars and for good reason. Hayao Miyazaki tells the story of a girl who quietly got into the magical world and saved her childhood friend and parents from a sorceress.I want to notice how the world of spirits displays the emotional experiences of the girl and how filigree the director was able to show them.After the parents move, Тhihiro enters the world of spirits, the parents mutate into piglets and the girl gets a job with the witch, saves the spirit of the river, breaks the curse. The tale is somewhat similar to the fairy tale Alice in Wonderland. An excellent combination of animation and frame detail, you can catch any freeze frame and the picture will be beautiful. Smooth movements achieved by hours of work were not in vain, along with perfectly matched composition, the picture came out excellent. I would like to recommend this and other works of this director, it is felt that the author has put a piece of himself into each of them.",
            "review_date": "2022-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect. I would recommend this movie to anyone.",
            "review_date": "2022-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First animated film I've ever seen that I remember watching. I've seen it so many times and love it more each time.",
            "review_date": "2022-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The stunning animation weaves a weird and wonderful journey that I've never experienced in a film before. Spirited Away, while it may drag in the third act, feels so dream-like, you wonder how it could be real.",
            "review_date": "2022-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful and hypnotizing art, heartwarming story and protagonists, peculiar characters and picturesque places and landscapes. A creative masterpiece.",
            "review_date": "2022-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unique is a word that we can describe this incredible journey to imagination, to childhood and of course, to animation. Master Miyazaki outdoes himself with inspirations from Alice in Wonderland (still very distant and different from the British classic) and the Japanese culture as a whole. One of the best animated film of all time, indeed. The voice acting is incredible (in every language), the score is beautiful and the message is timeless.",
            "review_date": "2022-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "37/100 this is dogshit, i wouldn't watch again even if you pay me",
            "review_date": "2022-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie sucked, just a stinky little girl on a stinky little adventure. She is stupid and so is this stupid stinky butt hamburger movie.",
            "review_date": "2022-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Six stars, if I may, this is a outstanding story, one kind of a time. There's no way we can possibly hate this film, because it's something new, incomparable, one story to never forget.",
            "review_date": "2022-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Studio Ghibli, and Spirited Away is one of my favourite films from the studio. This is coming from someone who was delighted by Howl's Moving Castle, blown away by Princess Mononoke, emotionally devastated by Grave of the Fireflies and touched by the simplicity of The Cat Returns all but to name a few. Spirited Away is a mystical, charming and truly enchanting animated fantasy, even with the long length and some slow moments. The animation is absolutely stunning, both the hand drawn visuals and the CGI graphics give an ethereal charm to the film. The characters move more than convincingly and the colours are beautiful. The music is also outstanding, I loved the simplicity of the piano and the drama of the more dramatic parts. The story is a pleasure, I know people have complained of some loose ends, but it is an original, touching and charming one I feel. I also loved the characters. Chihiro, voiced with real enthusiasm by Daveigh Chase, is sulky to begin with, but she is also brave and resourceful, traits I like in young heroines. Lin is kind and sympathetic, and Susan Egan who was also in Porco Rosso was unusually sensitive as the character. Jason Marsden is charming as Haku, and Suzanne Pleshette is perfect as the grotesque Yubaba and as her sister Zeniba. Overall, I loved Spirited Away, it is really charming. 10/10 Bethany Cox",
            "review_date": "2022-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this anime and this is my absolute favorite animation that I ever seen. I give it 5 to 5 stars for this!! There are many things that I gain it from watching this animation.Whether it be, great characters, that change positively throughout or climax scene which so outstanding. And a little weirdness, which keeps it interesting.That I said, I also can't wait to show it to my friends or other who never watch it before. I know they will respond to the depth of feeling and art and just good storytelling. If you watch it maybe kids or older will find it fun and heartwarming. There is excitement without seeing violence (though the giant baby does threaten, and the dragon shows up hurt badly). Cannot recommend highly enough. Spirited away is the all time blockbuster movie.This movie has great role models and messages. Great for kids who love weirdness ,and I think every all of ages can watch it Just not for overly sensitive kids.\n\nThis animation are using the 2d hand drawing all of movie ,and you will see most of place and building tone is red and orange color palettes.And the director make a noteworthy character such as No face and Susuwatari. No-face and Susuwatari are the most popularity characters of this animation that is referenced of many stuffs such as stationary,accessories or clothing etc.If you talk about what is the director's propose,I will conclude it for you.From my opinion,Spirited Away is an imaginative fantasy film. and can be enjoyed by people of all ages. Since there are several layers of content and difficulties.There are a variety of symbols that can be understood. And if you watch it again at different ages.The meaning will change depending on your age.\n\nIn the last,this animation reflects me to see many sides of human like a greed and else. Then finally of this movie they just want to show that it's hard to growing up. There are many obstacles we need to face with. But finally, we all pass through.",
            "review_date": "2022-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Animated movies aren't typically my thing. I remember watching this movie as a little kid and being confused, creeped out, and thinking that it was too weird to watch. I checked it out again as a grown up and thought that it was still weird, but nevertheless impressive in quite a few ways! The music, animation/artwork, and imagery were stunning throughout the film! While the story did lose me in a few parts, it wrapped up beautifully in the end when things came back together! I get why it's popular for its production and creativity alone! It's kind of like a Japanese animated Wizard of Oz and Alice in Wonderland, but unique in its own ways!",
            "review_date": "2022-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Studio Ghibli film is amazing. Especially when one scene, where Chihiro eats a rice ongiri while crying (brought me to tears too). The characters in the film are great. Studio Ghibli should stay in a 2D animation world like this film.",
            "review_date": "2022-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Childhood starter, recommended it for people entering the ghibli hole.",
            "review_date": "2022-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If watching paint dry was a movie.",
            "review_date": "2022-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just for kids don't watch on base of rating",
            "review_date": "2022-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First let me say that I love how beautiful this film is and how easy on the eyes it is… sure, you can say that for most animated films, but Spirited Away truly stands out and is in a category of it's own. The detail on the buildings, the liveliness of water, the deliciousness of food, everything is drawn(?) to perfection. \n\nBut to me, this movie was a bit hard to follow. Maybe it's because I kept dozing off for minutes at a time, but it's really just a confusing storyline. What, with spirits, animals, hatred for humans, etc. it's really different from any other movie I've ever seen.\n\nSpirited Away also has one of the greatest scores I've ever heard in my entire life… and I've seen over 600 films so that's saying something. This score is really moving and can definitely bring tears to yours eyes in seconds.\n\nHowever might I note that this film literally made me sad for a cartoon dragon… like… if that isn't good writing I don't know what is! Hayao Miyazaki is magnificent and I'm glad my first film by him got to be his most famous one! \n\nHonestly, what's not to love about Spirited Away? It has everything you could ever want from an animated film! No wonder it's rated so highly. Can't wait to watch this again sometime! Also yes, I did shed a few tears at the end of the film. 9.5/10 from me",
            "review_date": "2022-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is simply the best cartoon ever made and I watched it a dozen times before writing this review.  Beautiful, beautiful, beautiful to look at, a complex story and so different (I believe) from anything made outside Japan.  Absolutely spellbinding viewing for young children and adults alike.  \nIt's an imaginative tale of courage and love, above all - love of family, friends and more.  These universal themes are mixed with magic, monsters, myth and legend.  Don't turn away at this point - it could be like a lot of other cartoons but it isn't.  You grow to love and hate the extraordinary characters and the scenery is the most gorgeous I have ever seen in an animated feature.  You could put any still from the film on your wall and just sit and admire it.\nThe score is splendid too and the song over the closing credits (in Japanese) will make you weep; maybe that's because by the time you get to it, you will know you're in the presence of greatness.",
            "review_date": "2022-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terribly overrated but delightful in a quirky way nonetheless.",
            "review_date": "2022-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Studio Ghibli's gripping masterpiece \"Spirited Away\" is possibly the best of their films, filled with dazzling animation, superb characters, and plenty of emotion.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tried to watch this years ago and turned it off halfway through due to complete disinterest. Now that I finally got around to finishing it, I can't say my reaction has changed all that much. This movie just doesn't do anything for me like it does for millions of others.",
            "review_date": "2022-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect. This movie feels like a warm blanket on a cold day, it meets you where you are emotionally and offers you a glance into yourself. In my humble opinion, this is the finest work by Hayao Miyazaki, and a movie that no-one, not even Ghibli themselves will ever be able to replicate.",
            "review_date": "2022-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing more needs to be said about Spirited Away of what has already been said countless times. Ghibli's enchanting fantasy film with majestic visuals, vibrant lore, and memorable creatures and characters, grabs a wide range of audiences from the casual viewer to the film fan's heart and soul and leaves them charmed and satisfied despite how niche the subject matter is. The film does have flaws, such as the story could have been expanded further, but the majority of these are minor nitpicks to an already fantastic film.",
            "review_date": "2022-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This big masterpiece of Hayao Miyazaki is only imagination and traditional animation. There's no feelings. 6/10",
            "review_date": "2022-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most overrated movie ever, other then a bugs life.",
            "review_date": "2022-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterfully and beautifully created work of art and an unforgettable and amazing experience. Such a great introduction to Studio Ghibli for me.",
            "review_date": "2021-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is the best animated movie of all time FULL STOP. Watch it and see for yourself.",
            "review_date": "2021-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spirited Away is simply full of awe and creativity. It's a film that will leave you engrossed with the world and in love with the characters.",
            "review_date": "2021-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story only Miyazaki could tell. One where adventure takes center stage and a brand new world is revealed. There is not a single other film like it, not even from Studio Ghibli. \"Spirited Away\" succeeds at breaking new ground and achieving something no other movie could achieve—there are plenty of great animated movies out there, but non tug on the same heart strings as Spirited Away. And that is why it's so unique and so great!",
            "review_date": "2021-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Gabriel Garcia Marquez took mushrooms and tried to write a kid's movie, you'd get Spirited Away. It's the Alice in Wonderland of the 21st century: it watches like a waking dream. Its horrors are like nightmares you want to wake up from but can't. Its euphoria dances in technicolor. It is just as original and perplexing as the dream world. And like dreams, there are lessons present for those who would look, though they may take some work to translate to a usable form. The themes of solitude, change, despair, absurdity, and redemption are woven throughout its impressive animated antics. More than any other movie, I find myself wanting to show Spirited Away to friends and family who've never seen it.",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a wonderful adventure with a great story and memorable characters",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true groundbreaking film, what an  achievement for animation.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone should watch this film, one of the best movies ever made.",
            "review_date": "2021-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredible story, artistry, and memory. This movie takes you back to a time when you were certain spirits lived all around you all the time... Maybe they really do? A must see.",
            "review_date": "2021-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An eerily fantastical film with breathtaking animation in its time that makes it by far a masterpiece made in the 21st Century. A must watch for all movie enthusiasts to experience.",
            "review_date": "2021-11-04",
            "source": "rt",
            "lang": "en"
        }
    ]
}