{
    "rating": 2.8,
    "release_date": "2002-10-11",
    "num_reviews": 230,
    "genres": [
        "Romance",
        "Comedy"
    ],
    "summary": "Imagine being shipwrecked on a beautiful island -- with someone you really can't stand. A young soldier (Adriano Giannini) is cast adrift on an island with his employer, a rich, self-centered woman who is used to having her own way. Cut off from society, he reverses their roles, stripping her of pride and vanity and controlling her completely. Until, that is, she falls in love with him.",
    "reviews": [
        {
            "content": "Swept Away completely misses the point of what made its predecessor so perfect (even if i never saw the original). As someone who just recently got used to listening to Madonna this movie feels generic and boring, and as much as hate to say this that, was Jennifer Lopez right about \"The Queen of Pop\" being a terrible actress? well thankfully Madonna has moved on to Confessions On A Dance Floor cause this is NOT a good example of remaking a timeless classic into something boring.",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "People are way too harsh. The original was 5 stars to be sure....and a tough act to match. But this movie was well produced. Madonna's acting isn't as bad as everyone makes out, and she looks great. I took one star away because the rewrote the ending and ruined it with the Hollywood ending. The other star I took away because the chemistry of the first was hard to match. One star? It's not unwatchable like Under the Cherry Moon",
            "review_date": "2022-11-27",
            "source": "rt"
        },
        {
            "content": "I've seen its cartoon mimic followed the basis plot, and its zanily fun animated nature is memorably more enjoyable than what Guy Ritchie directed as his first step onto a new realm away from his stylistically complex crime-ridden stories. He eventually improves as his other directorial skills grow only when integrating some of his tactics from the aforementioned realm, which none been felt here in this baseless, underdeveloped, pathetically performed story. Its best redemption that solidified itself as a remake is the conclusion whereas it felt that Adriano Giannini truly honored his father's original role, therefore also honoring the original's impact even if the whole buildup from the first minute to the climax's end doesn't agree in an ill-natured, socially parodic manner. (C-)",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "As much as I appreciate Guy Ritchie (writer and director) being faithful to the original 1974 Swept Away film, this film just falls flat. I can see why audiences wept away instead. Despite the score being composed by Michel Colombier which was pretty amusing, it can't save this 2002 remake. The 2002 version of Swept Away was just not funny nor was there any passion between Madonna and Adriano Giannini. This film teaches us that no matter how faithful a writer or a director (Guy Ritchie) can be to the original work of an artistic film, the remake will most likely fail.",
            "review_date": "2021-12-20",
            "source": "rt"
        },
        {
            "content": "It's not the hit Madonna had hoped for, but it's not as bad as many seem to think. Madonna is not the greatest actress in the world, but the character fits her nicely. Check it out if you're searching for something to watch for fun.",
            "review_date": "2021-10-12",
            "source": "rt"
        },
        {
            "content": "Madonna's affair with director Guy Ritchie spills onto screen with Adrianno Giannini, and critics were supposed to be swept away. Alas, critics wept away at Madonna's wooden performance like so much salt beach flotsam, presented with all the raw power of a soaked sandcastle. So Madonna, I'm afraid you get The Burnin' Medallion Of Badness. Characters: 0.5/5 Story: 0.5/5 Acting: 0.5/5 Special Effects (very little of them): 0/5 Direction: 0/5 Cinematography: 0/5 Soundtrack: 0.5/5 Overall: 0.5/5",
            "review_date": "2020-11-13",
            "source": "rt"
        },
        {
            "content": "Oh my god! This is easily the worst movie of the 2000s. What the hell Madonna. The movie is trash.",
            "review_date": "2020-09-15",
            "source": "rt"
        },
        {
            "content": "A remake of the 1974 Italian film directed by Lina Wertmuller, Swept Away follows a spoiled wealthy woman Amber (Madonna) and a Communist fisherman Giuseppe (Adriano Giannini) who go from spending days on a fancy yacht to being stranded on a Mediterranean island. While there, Giuseppe decides to gain authority and enslave Amber, because he's tired of her berating him. I think one of the biggest issues I have with the movie is Amber, who's too bitter and irredeemably nasty. In fact, she's so awful that any attempt to faithfully capture the comedic tension and beauty of Wertmuller's film comes off as unbelievably forced. Apart from Madonna's overacting, Guy Ritchie's take on Swept Away makes a wide series of dumb changes that ruin the chemistry of the original. In the 1974 version, Gennarino and Raffaella find a frigate in the distance, so they fight over the whistle for rescue, showing the first signs of them working off each other; later they find the island and row toward it, working together for the first time. In the remake, Amber and Giuseppe find a flare gun, fight over it before punching a hole in the raft, and they get washed away on the island. Also, in the original, after an attempted rape by Gennarino, Raffaella looks away into the bed of kelp reflecting on her decisions and, after watching Gennarino hunting, skinning and cooking a hare, she inevitably gives herself to him, hoping it would satisfy the merciless man; therefore the two engage in sexual relations later that night. In the remake, Amber looks into the campfire, watching her material world crumble, and the next day she drops the logs, kisses Giuseppe's legs and they have sex. By making these changes, Guy Ritchie makes one of the worst remakes of all time, evaporating any levity or human connection that made Lina Wertmuller's film funny and powerful. (1/2 Octopus out of 5)",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "Madonna almost saved this deeply sexist and misogynistic movie.",
            "review_date": "2020-06-21",
            "source": "rt"
        },
        {
            "content": "I swept this movie out of my mind ",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "I know it didn't get great reviews, but I really enjoyed this movie.  The visual part was beautiful; the possibility that this could have happened at some point in time...",
            "review_date": "2019-09-15",
            "source": "rt"
        },
        {
            "content": "I read about this movie that is was really bad, but I saw some of Guy Ritchie's other movies which I liked, so I just thought to give it a try. I was amazed by this movie. The breathtaking cinematography, great acting by Madonna, Adriano Giannini and a great supporting role by Bruce Greenwood. This is a compelling and catchy movie and I never lost interest until the end of it. And this despite the fact that I normally don't particularly like romantic movies. Besides that, for me personally, I think this is Guy Ritchies best movie and Madonna's best acting performance.",
            "review_date": "2019-09-10",
            "source": "rt"
        },
        {
            "content": "What even is this movie",
            "review_date": "2019-06-11",
            "source": "rt"
        },
        {
            "content": "Compelling and meticulously crafted, Swept Away is proof that Madonna can actually act.",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "One of the worst movies ever, and definitely the worst acting from Madonna. Just awful.",
            "review_date": "2019-04-01",
            "source": "rt"
        },
        {
            "content": "Really not as bad as critics have made out. It’s not the best movie, and the scenes where he’s slapping her a kinda uncomfortable to watch, but on the whole it’s a decent movie that kept me entertained. It’s the only film I’ve seen Madonna in, and can’t understand why she was slated as a bad actress so much. I feel this movie received unnecessary hate - there are far worse movies out there with much higher ratings. ",
            "review_date": "2019-01-15",
            "source": "rt"
        },
        {
            "content": "it seems like critics heard the name madonna and immediately gave her low rating",
            "review_date": "2019-01-09",
            "source": "rt"
        },
        {
            "content": "Turquoise waters, a secluded beach, and Madonna's RIPPED arms: I disagree with the negative ratings based on the scenery alone. The \"love\" story was fraught on both sides, so I ignored the romantic montages. However,  I found the story intriguing in a heavy-handed European kind of way. It swept me away to a desert island and helped me feel class-based Schadenfraude while folding laundry. Not too bad.",
            "review_date": "2018-02-26",
            "source": "rt"
        },
        {
            "content": "Swept Away is a marvel. Seriously, how does something this awful exist? It's like Ritche was trying to create the most despicable, hateful, caricatured and ugly characters and story he could, and then cast the most unwatchable and annoying performers he could. It's an abusive film, both to its own people and to culture at large, and ranks among the worst film-watching experiences I can think of. Long story short: it's not very good.",
            "review_date": "2017-05-26",
            "source": "rt"
        },
        {
            "content": "Madonna is a mostly terrible actress.  The main guy is a great actor.  The cinematography is beautiful- the story line not at all.  The ending sucks. What a waste.",
            "review_date": "2017-05-01",
            "source": "rt"
        },
        {
            "content": "Amazingly emotional.",
            "review_date": "2016-06-10",
            "source": "rt"
        },
        {
            "content": "good but I prefer the original version best",
            "review_date": "2016-04-26",
            "source": "rt"
        },
        {
            "content": "Pathetic attempt at romantic drama.",
            "review_date": "2015-10-27",
            "source": "rt"
        },
        {
            "content": "Terrible, Madonna is awful in everything she does!",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "Get past your preconceived notions and watch this film. I was expecting something decently entertaining and was Swept Away into a magnificent story of human growth and love and compassion.",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "Lacking style, substance, subtext, dialogue, heart, depth, passion, humanity, energy, chemistry - hell, I'm sure even the guy that gets the coffee and donuts phoned in their responsibilities - Swept Away is a horrendous black mark on Guy Ritchie's career that has the stench of a massive, steaming pile of \"WTF?!\" smeared all over it. Not since Creedence foreplayed the hell out of a naive Brent with an ear of corn in Troll 2 has romance been this cringe-inducing. Needless to say, this shipwreck will have you envying all 1,500 victims the RMS Titanic dragged down to the bottom of the Atlantic.\n\nFull review at http://silverscreenfanatic.com/2015/05/18/what-the-hell-were-they-thinking-72/",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "Even though it had no political context, i thought it was a nice love story funny,and well done...proof that critics don't know it all",
            "review_date": "2014-11-07",
            "source": "rt"
        },
        {
            "content": "-----I have stated earlier in reviews of other films that the specific film I was reviewing was the worst film I've ever seen. The problem with making those claims is that every once in a while a film comes along that is so inept, so completely misguided, and so rotten that is unseats the previous worst film ever. Swept Away now takes the mantle as the worst film I have ever seen. I don't doubt that one day another film will come along to take its place, but I'm really not looking forward to that day. It is a misogynist, unfunny, charmless, horribly acted, cretinous, misanthropic, badly written, badly shot, badly conceived horror of a movie. It is an anti-filim.\n-----Swept Away, directing by Guy Ritchie and staring his wife Madonna, is a remake of an Italian film about an upper-class woman and a lower-class male who get trapped on a deserted island. First bickering and hating each other, they come to fall in love and have a passionate romance on the island. However, society factors strive to keep them apart. Thank god. \n-----The glaring and obvious problem in the film is Madonna, who is playing the lead. This is the first film I've seen with Madonna in it, and I have been told she is good in other films. After seeing her in this film I can only say I don't believe them. To say Madonna gives a bad performance in this film is an insult to other bad performances. In Swept Away, Madonna is the most artificial screen presence I have ever seen. Not once does she convey any type of human truth or emotional at all. Every line she says seems likes she has no idea what she's saying and she has no investment with whats going on at all. I truly believe it is the lowest point of acting one can go, you can't possibly get any worse. I have seen actors who weren't even trying give better performances. It truly has to be seen to be believed. Nothing I could possibly write can adequately translate the terror of her acting. \n-----But the problems go beyond Madonna alone. Her co-star, Adriano Giannini actually gives a half-decent performance, at least at first. But the problem for both him and Madonna is that their character are absolute monsters. I have never seen more unsympathetic characters portrayed as the protagonists of the film. They are terrible people, and I quickly grew to hate the both of them. The fact that they become a couple truly sends the film into hellish depths. I hate a trend you see in a lot of films where two people fall in love immediately with no foundation or even reason for them liking each other. Swept Away has that trope done to the extreme. Madonna and Giannini could be the worst screen couple ever. They have no chemistry, to put it lightly, and their characters have less than no reason to get together romantically. Here are two people who have treated each other awfully for the entire film and suddenly they are heads over heels for each other. Its an ultimate insult to the audiences intelligence. \n-----Guy Ritchie directs this parade of horrors with what he thinks is charm and depth and fails miserably. Its social aspirations are insulting, its comedic bits all fall horribly flat, and it is emotionally dead. Swept Away has to be one of the worst films ever made, and everyone involved should be throughly ashamed of themselves.",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "I have stated earlier in reviews of other films that the specific film I was reviewing was the worst film I've ever seen. The problem with making those claims is that every once in a while a film comes along that is so inept, so completely misguided, and so rotten that is unseats the previous worst film ever. Swept Away now takes the mantle as the worst film I have ever seen. I don't doubt that one day another film will come along to take its place, but I'm really not looking forward to that day. Swept Away, directing by Guy Ritchie and staring his wife Madonna, is a remake of an Italian film about an upper-class woman and a lower-class male who get trapped on a deserted island. First bickering and hating each other, they come to fall in love and have a passionate romance on the island. The glaring and obvious problem in the film is Madonna, who is playing the lead. This is the first film I've seen with Madonna in it, and I have been told by friends that she is good in other films. After seeing her in this film I can only say I don't believe them. To say Madonna gives a bad performance in this film is an insult to bad performances. In Swept Away, Madonna is the most artificial screen presence I have ever seen. Not once does she convey any type of human truth or emotional at all. Every line she says seems likes she has no idea what she's saying and she has no investment with whats going on at all. I truly believe it is the lowest point of acting one can go, you can't possibly get any worse. I have seen actors who weren't even trying give better performances. It is a legendary feat of bad acting that one must see to fully comprehend. But the problems go beyond Madonna alone. Her co-star, Adriano Giannini actually gives a half-decent performance, at least in comparison to his co-star. But the problem for both him and Madonna is that their character are absolute monsters. I have never seen more unsympathetic characters portrayed as the protagonists of a film. They are truly terrible people, and I quickly grew to hate the both of them. The fact that they become a couple truly sends the film into hellish depths. I hate a trend you see in a lot of films where two people fall in love immediately with no foundation or even reason for them liking each other. Swept Away has that trope done to the extreme. Madonna and Giannini could be the worst screen couple ever. They have no chemistry, to put it lightly, and their characters have less than no reason to get together romantically. Here are two people who have treated each other awfully for the entire film and suddenly they are heads over heels for each other. Its an ultimate insult to the audiences intelligence. Guy Ritchie directs this parade of horrors with what he thinks is charm and depth and fails miserably. Its social aspirations are insulting, its comedic bits all fall horribly flat, and it is emotionally dead. Swept Away has to be one of the worst films ever made, and everyone involved should be throughly ashamed of themselves.",
            "review_date": "2014-09-07",
            "source": "rt"
        },
        {
            "content": "Started out boring but got interesting.",
            "review_date": "2014-07-05",
            "source": "rt"
        },
        {
            "content": "Awful film.  Madonna cannot act.",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "One of the worst movies worth watching just to see how many things you can build out of a car tire when you're stuck in a deserted island.",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "Worst movie I've ever seen. Had to turn it off. Rape, abuse, and filth is NOT comedic. This movie is terrible.",
            "review_date": "2014-06-08",
            "source": "rt"
        },
        {
            "content": "Any more proof needed to believe that Guy Ritchie and Madonna have no business making films? Welp, here you go.",
            "review_date": "2014-06-03",
            "source": "rt"
        },
        {
            "content": "People were dogging this movie out before it was even in the editing bay\n\nKiller ending scene in the helicopter - good job M.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "This was a complete waste of time. There is no reason for these two to fall in love after a few weeks on a deserted island when they hated each other so much in the first place. The ending was even worse if that is possible. If they are going to try to sell this love story they could have at least ended up together.",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "Probably one of the worst film i have ever seen this calamitous flick is terrible from start to finish. No story, no director in the seat, Madonna more awful than ever, nothing can save this complete waste of a film from being an utterly ship wreck! Only the cinematography is beautiful but when you shoot a film on an island that the least you can expect right.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Guy Ritchie almost kills his career by shooting an awful Madonna vehicle based on a 1975 critically acclaimed Lina Wertmuller film about a wealthy woman and her scruffy servant stranded on a deserted island. The wittier, darker and more intellectually satirical elements of the original are completely lost, in this awful film where there is pretty much nothing to like.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "One of the best movies in my view. It's touching and kind. Shows how self-centered and egoistic some of the people are. They do not appreciate their surroundings although they have so much money. They are not happy despite their wealth. This movie clearly explicit how much love and care exist in ANY human's soul and heart. It just has to be pulled out, sometimes by circumstances.",
            "review_date": "2013-12-12",
            "source": "rt"
        },
        {
            "content": "This movie is sad. Not boo hoo sad but ...sad",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "All the reviews are based on the fact that it's Madonna and Guy Ritche. I don't think half of you watched this movie. No it's not the best movie but it's not as awful as some people make it out to be.",
            "review_date": "2013-11-08",
            "source": "rt"
        },
        {
            "content": "It actually doesn't start off that bad, but once it goes downhill, it really goes downhill fast.",
            "review_date": "2013-08-13",
            "source": "rt"
        },
        {
            "content": "Probably the worst written screenplay to a romance I've ever witnessed!",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "nice romantic movie without good and usually romantic and happy ending. might be story of life.. if person is not ready to step up for himself and change his life by following his dream.",
            "review_date": "2013-04-26",
            "source": "rt"
        },
        {
            "content": "Guy Ritchie's worst film.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "This movie comes off as a bad piece of erotic fiction that feeds off of better bad erotic fiction to sustain itself.",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Madonna and Adriano Giannini portray two of the most hateable lovers I've ever been expected to root for. They lack any believable emotion or, for that matter, anything funny or sexy.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "This is actually pretty good until the convoluted ending where everything seems as if nothing happened. Watch it for yourself if you have nothing better to do.",
            "review_date": "2012-12-15",
            "source": "rt"
        },
        {
            "content": "Again-I cry everytime at the end-I know it's Madonna, but give her a chance-it's heartbreaking in the end.",
            "review_date": "2012-11-20",
            "source": "rt"
        },
        {
            "content": "Swept away is not the kind of movie you want to recommend! The music is good, and that is it",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "A sad sad story that has torn my heart into pieces. Reality bites and against all odds romance of Amber and Giuseppe. Get a grip and watch. Be prepared and grab tissues as well.",
            "review_date": "2012-11-07",
            "source": "rt"
        },
        {
            "content": "Not so keen on it but it is a gd film",
            "review_date": "2012-10-13",
            "source": "rt"
        },
        {
            "content": "I wasn't swept away but I did enjoy this film, I have no shame!",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "Madonna may lack the strength to carry the weight of the material (Guy Ritchie, she may've been your wife, but you should've known better), but she is remarkably believable as a megarich bitch with the weight of all the first world problems resting on her shoulders, though Adriano Giannini fares better and keeps things on track. \n\n'Swept Away' might not reach its potential, but is a multi-layered piece about social structure, power and love. Well worth a look and a pretty good effort all-round, despite its reputation.",
            "review_date": "2012-08-24",
            "source": "rt"
        },
        {
            "content": "I will be the only one who likes this movie, i loved it!",
            "review_date": "2012-04-27",
            "source": "rt"
        },
        {
            "content": "Not for a moment did I think, as I slid the DVD into my player, that I would think this was a good film.  I mean, it stars Madonna and, ten years later, even *I* had not seen it, so clearly I knew it was bad.  However, I could not have prepared myself for how truly bad this film is.  I mean really, really bad.\n\nAbout a rich woman and a migrant Italian fisherman getting stranded on a deserted island and inexplicably falling for each other, this film has absolutely no redeeming features at all.  I have never heralded Madonna's acting skills, but in films like \"Who's that Girl\" and \"Shanghai Surprise,\" she was not as bad as critics have made her out to be.  But in this film, she did herself no favours...her performance here is absolutely the worst she has ever done.  Watching made me cringe from the moment she appeared onscreen to the moment the credits rolled, allowing for a sigh of relief.  And, to be fair, Adriano Giannini's performance was not much better.\n\nI cannot begin to understand how in the world Guy Ritchie directed such a monumental pile of crap.  And why did, Bruce Greenwood and Elizabeth Banks even sign on to appear in this?  Just by reading the incredibly idiotic script, anyone associated to this film should have dropped it faster than a Kardashian's underpants at a basketball game.\n\nA monumental fail of epic proportions, even if you are a fan of Madonna, do not waste your time on this film.  It made me lose any and all respect for her as an actress, despite her exquisite turn in \"Evita.\"  Ritchie would have been better off divorcing Madonna immediately than agreeing to make this ridiculous film.  All copies of the film should be swept away and forgotten forever.",
            "review_date": "2012-03-11",
            "source": "rt"
        },
        {
            "content": "Not as bad as its made out to be.. Could have been a lil better..Madonna wasn't that bad on Desperately Seeking Susan..eh, figure",
            "review_date": "2012-03-07",
            "source": "rt"
        },
        {
            "content": "GUY RITCHIE IS AWFUL\n\n0/10",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "From all the bad movies, this is the best",
            "review_date": "2012-01-29",
            "source": "rt"
        },
        {
            "content": "I would just give this one star (it's that lame!) but the scenery is so amazing with the boats and beautiful sea that it gets another star just for that. I havn't seen the original but I know it couldn't be THIS BAD!",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "I love this and not just cause of Madonna I swear!",
            "review_date": "2012-01-12",
            "source": "rt"
        },
        {
            "content": "it was good, but the original is way better",
            "review_date": "2012-01-12",
            "source": "rt"
        },
        {
            "content": "Well that was unfortunate. Very muddled.",
            "review_date": "2012-01-05",
            "source": "rt"
        },
        {
            "content": "Sometimes the critic can get a bit predictable and boring when they select certain people to trash, this film is really enjoyable and unfairly  slated, it build and builds ,madonna is great in it, the ending is really sad, its a great movie that was never given a chance",
            "review_date": "2011-11-22",
            "source": "rt"
        },
        {
            "content": "I watched this film when it was first released in 2002, in the theaters and then I watched it again with my girlfriend last night.  I do not remember hating it the way almost all critics told me I was supposed to.  I am actually a student of film, so I was trying to analyze the film objectively.\r\n\r\nWhat I remember when watching the film the first time is thinking how difficult it must have been for Guy Ritchie to direct his wife in this role and also Madonna in this role.\r\n\r\nThis is actually, in my opinion, by far a better film than the original, which I have watched several times.  \r\n\r\nThe reason critics did not like the film, I believe, is not because it was a bad film.  It is because the film is profoundly politically incorrect at every level.  However, form an objective, socialogical point of view, it is insightful.  The insights are disturbing, of course.  In fact one should probably call the film simultaneously profoundly insightful and deeply inciteful.  \r\n\r\nThe woman appears to succomb to something like the Stockholm syndrome in falling in love with the man who physically brutalizes her.  But isn't that human nature?  \r\n\r\nAnother insight of the film is the way Madonna's character (Amber) shifts from hate to lust, and then to love.  It is actually believable in a very human way.  I think there is something in every woman's psyche that deeply, although sometimes unconsciously wishes to be desired by a dominant masculine presence.  Sado-masochism is not unnatural at a fundamental level, although it is certainly anti-feminist and contrary to enlightened social norms.  Nevertheless, there is a connection between sex and violence.  It is disturbing, but it is real. \r\n\r\nWhen I watched the film with my girlfriend, and she was watching it for the first time last night, she was genuinely touched by the film.  She cried at the end.  She was able to suspend disbelief, and so was I, actually, even watching it the second time.\r\n\r\nI think critics were very unfair to this film.  I notice that some of the most vitriolic attacks come from female critics.  They were in self-denial back in 2002.  They need to go back and watch this film again.  I suggest setting aside prejudices.  I am not saying you need to pretend that this isn't Madonna.  That's not my point.  \r\n\r\nAnother criticism of the film is that it makes Madonna look unattractive, or that Guy Ritchie focuses on her buff arms too much.   I think Madonna looked genuinely beautiful in this film.  Think of the scene when the two are sitting at the beach and she is asking him whether he would want her if he had a choice.  And then he responds the way any man would respond to his wife if he truly loves her, cradling her in his arms and saying he wants a woman, not a girl.  That's not romantic?  That's not touching and human?  Really?  \r\n\r\nIs there anything I could criticize in this film?  Sure, but the pluses overwhelm the minuses.\r\n\r\nI love this film.  I think couples should watch this film together.  Its really, truly, no b/s, romantic, touching and sincere.  I feel sorry for men and women who are so unwilling to look into their own hearts that they can't see the beauty in this film.",
            "review_date": "2011-11-12",
            "source": "rt"
        },
        {
            "content": "I sure wish I take back over an hour of my time for this piece of crap.  I am only giving this movie one and a half stars is because of Elizabeth Banks, she is dreamy.  Other than that, this movie sucked balls.  I hated it from beginning to the end, nothing to enjoy, everything sucked.",
            "review_date": "2011-11-02",
            "source": "rt"
        },
        {
            "content": "One of the worst films I have ever seen. Everything about it is really bad.",
            "review_date": "2011-10-08",
            "source": "rt"
        },
        {
            "content": "Oh goodness me. The cinematic equivalent of viewing a complete stranger's holiday snaps. Absolutely awful in every sense.",
            "review_date": "2011-10-06",
            "source": "rt"
        },
        {
            "content": "What a dream - marooned on a desert island with a perfect masterful survival man. Y did they ever leave????",
            "review_date": "2011-10-06",
            "source": "rt"
        },
        {
            "content": "Has its moments, but not enough - nor is it an endearing role for Madonna.",
            "review_date": "2011-10-06",
            "source": "rt"
        },
        {
            "content": "This has to go down in history as one of those all-time lows. Absolutely abysmal. Madonna is to acting what Nigella Lawson is to dieting. Stick to what ya know Madge!",
            "review_date": "2011-10-05",
            "source": "rt"
        },
        {
            "content": "This is another great example of why you should never listen to 'critics'. This is way above average for its genre and Madonna just totally mocks all the normal Hollywood standard of 'acting' She's great to watch and that was enough for me to sit through it..  ..and I'm not even a Madonna fan!!",
            "review_date": "2011-10-04",
            "source": "rt"
        },
        {
            "content": "Madonna is not a bad actress",
            "review_date": "2011-09-25",
            "source": "rt"
        },
        {
            "content": "I was surprised to see that this movie was so disliked by critics. It wasn't the best movie I have seen, but it was fairly enjoyable and I liked the acting. The only thing I didn't like was the end. Not just because it was a unhappy ending but it felt thin and not believeable.",
            "review_date": "2011-09-18",
            "source": "rt"
        },
        {
            "content": "Dont know why people dont like this movie, madonna doesnt act THAT bad, and the movie is generally good. I love the new context and it touched several importar issues of modern society! get over it!",
            "review_date": "2011-09-05",
            "source": "rt"
        },
        {
            "content": "was not bad for me,I liked the ending though it was a sad one",
            "review_date": "2011-07-29",
            "source": "rt"
        },
        {
            "content": "Once upon a time a critic said Madonna sucks as an actress.  And that became an expression people still use without being exposed to her work.  Yes, she has done bad movies, but did not she win the Golden Globe for Evita? In Swept Away, we see her going to a place that just a few divas dare to go: a physically challenging role, a though statement about social stratification, and the chance to bring a fresh version of a grand movie from decades ago.  People should just go and see a movie instead of paying attention to critics.  They seem to have the right words but absolutely no regard to who they are writing for.",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "GUY RITCHIE IS AWFUL\n\n0/10",
            "review_date": "2011-06-25",
            "source": "rt"
        },
        {
            "content": "I almost felt sorry for Madonna thinking she could care off this Movie, she made a Fool of herself",
            "review_date": "2011-06-12",
            "source": "rt"
        },
        {
            "content": "great film, madonna is great in this film,again did not deserve the slating,",
            "review_date": "2011-05-14",
            "source": "rt"
        },
        {
            "content": "\"Swept Away\" is a remake of a 1974 Italian film of the same name, about a spoiled socialite named Raffaella who goes on a Mediterranean cruise and becomes stranded on a deserted island with Gennarino, a sailor she'd tormented on board. He beats her into submission, their roles reverse, and they fall in desperate, passionate love, only to have reality rip them apart once they're rescued. \r\n\r\nGuy Ritchie remade this film in 2002 with his wife Madonna in the lead role playing Amber, a wealthy bitchy type who is obsessed by fitness (yea we see her tanned toned yoga-trimmed body) and uses her wealth and position to belittle others. Amber's incessant nagging is constant and tolerated by her well-to-do American businessman hubby Tony (Bruce Greenwood) and their equally shallow and self-absorbed friends as they all enjoy a scenic chartered boat cruise on the Mediterranean. Unfortunately Amber seems to have taken an instant dislike for poor seaman Giuseppe (Adriano Giannini) who puts up with the name-calling (Pee Pee, Guido, and other derogatory Italian monikers)  but is fed up with Amber's infuriating antics and secretly wishes that she go somewhere and drown herself.\r\n\r\nThe antagonism between the pair becomes more festered when they ultimately end up on a deserted island together. Naturally the volatile relationship undergoes a hate-love roller-coaster ride as the couple find themselves in a forced co-dependency stronghold. Because the pampered and blunt Amber got her way on the ship in the manner that she emasculated the hapless Giuseppe, the swarthy pretty boy gets a golden opportunity to turn the tables on his tormentor who won't get by without his instincts to guide her which leads to a good deal of unsettling sado-masochism as Giuseppe uses his newfound power over Amber to slap and kick her into calling him \"master\" and cater to his every whim!\r\n\r\n The inevitable happens and Amber and Giuseppe are smitten with each other, into what the movie would have us believe is love but is really an outrageous plot device that would be laughable if it wasn't so creepy. Madonna cuts a fine figure in a teeny weeny black bikini and watching her tenderize octopuses by thrashing them on the rocks (having discarded her rich bitch persona), gives the film a bit of renewed life. We almost get to like the pair who have become a couple by necessity rather than choice. Adriano Giannini brings some charm to Giuseppe, and it's ironic that this, his first English language role, allows him to reprise the same role played by his father in the original 1974 film, directed by Lina Wertmüller.",
            "review_date": "2011-04-10",
            "source": "rt"
        },
        {
            "content": "I don't see why people think this is so bad. It was entertaining and had some interesting characters. There was a pretty good script and surprisingly decent acting. I hated things like the the ending almost made the whole thing pointless, but still, it's not a bad film. I usually despise romantic comedies; I  bet that is saying something.",
            "review_date": "2011-03-29",
            "source": "rt"
        },
        {
            "content": "Some sort of law should restrict Madonna's career to singing and dancing... This is probably one of the worst films ever (though probably not the worst from Madonna)",
            "review_date": "2011-03-12",
            "source": "rt"
        },
        {
            "content": "A terrible, terrible remake of an amazing, amazing movie. I know it's sort of a clichÃ (C), but Madonna should quit acting and remain stick to her day job.",
            "review_date": "2011-03-09",
            "source": "rt"
        },
        {
            "content": "it was wicked awsome! got high to this.... madonna is the catherine hepburn of our day!",
            "review_date": "2011-03-04",
            "source": "rt"
        },
        {
            "content": "What's not to love??? The sexual chemistry is off the hook for this sunbaked comedy. Madonna really steps up and shows us an award worthy role asf a beautiful, frustrated housewife. The dialog rolls like a Woody Allen film and the slap stick banter is hilarious. I only wish there was less cussing so my kids could watch. But all in all, an exceptional movie.",
            "review_date": "2011-02-16",
            "source": "rt"
        },
        {
            "content": "Even though it full of name-calling and abuse, Swept Away still has some good scenes and a few beautiful ideas",
            "review_date": "2010-11-28",
            "source": "rt"
        },
        {
            "content": "The only reason some people tolerate the explosive diarrhea that is this film is because Madonna stars in it, Guy Ritchie directs, and there's eroticism, dubbed as steamy but in reality is soft core porn. Besides the fact that this \"love story\" is that of a love-hate affair, it also serves as a sadomasochistic relationship built on the entrapment of the poor server and the rich socialite. The original 1974 Italian version of this film used this disgusting display of man overpowering woman, making her reliant on him as his slave, all in the name of serving as a comparison to Communism and the general consensus that the American way of life isn't the only way. I can get behind the travesty of the original for the sake of art, but this film was merely made so Madonna could show off her toned arms and Guy Ritchie could...ruin his career? I'm still fuzzy on why the director of Snatch and Lock, Stock, and Two Smoking Barrels took it upon himself to cast his then wife and a barely audible Italian man in a barely intelligible remake of an already shitty movie. Besides the fact that this film is in no way romantic, culturally relevant, or socially acceptable, the original source material is intercut with these strange dream sequences best described as the deleted parts of Madonna's later music videos. There's music, impressions, and some truly corny scenes between the stranded lovers. There's also no chemistry between them, Madonna's face scowling in the hot sun and Adriano Gianniani resembling a lost underwear model. Just, please, do not watch another example of our culture at its worst.",
            "review_date": "2010-10-14",
            "source": "rt"
        },
        {
            "content": "much people dont like it but I think this movie is good and funny. I like the idea of the story, how a pure love grow without involving world and how that pure love tested by the world. somethin that probably not good in the movie is just madonna, its just weird watching her playing this role",
            "review_date": "2010-10-11",
            "source": "rt"
        },
        {
            "content": "I give it a star because it wasn't boring, but it was an exercise in how to not make a movie. An incredibly awkward blend of emotional tones, bad acting, awful dialogue, and misogyny.",
            "review_date": "2010-10-01",
            "source": "rt"
        },
        {
            "content": "No where near as bad as everyone made it out to be. I really enjoyed this movie.",
            "review_date": "2010-09-23",
            "source": "rt"
        },
        {
            "content": "A terrible remake of the Wertmuller masterpiece complete with terrible acting, dialogue and almost complete disregard for the intelligence showcased in the original.",
            "review_date": "2010-09-22",
            "source": "rt"
        },
        {
            "content": "poor... yet the survival part was nice :)",
            "review_date": "2010-09-08",
            "source": "rt"
        },
        {
            "content": "Terrible\n\nReview Later",
            "review_date": "2010-08-30",
            "source": "rt"
        },
        {
            "content": "Everyone involved in this could've done right. But sadly, almost everything's wrong. It's a total misstep from Madonna, Guy Ritchie and even the butchered fishes.",
            "review_date": "2010-08-22",
            "source": "rt"
        },
        {
            "content": "Well. I was once told that if you can't say anything nice don't say anything at all.\r\n\r\nIt was mediocre. Bland. Right out boring. The end was what did it for me though. That ruined the whole movie because it was so...bad.\r\nIt's nothing special. It hasn't got a very impressive cast or plot. I'm sorry it just...no. I'm at loss for words for this one actually.\r\n\r\nIt's not good. That's the nicest thing I can say about it.",
            "review_date": "2010-07-15",
            "source": "rt"
        },
        {
            "content": "What were they thinking? As a big fan of Madonna's, I was shocked to see such a terrible performance on her behalf. While watching this movie, I kept getting the feeling it was fake. Like a MadTV parody of some sort. It didn't seem real. The plot-line was mixed, many scenes made no sense at all, and the whole shipwreck thing. How could this get any worse? I enjoyed the base-plot-line but the production and select acting in the film was terrible. If someone other than Guy Ritchie had directed this movie, I believe that it could have been a box-office success. \r\n   I don't even remember that servant's name... \"master\", as Madonna called him. But his acting was an long-drawn-out stereo-type Italian skit, that was probably aimed to become a cult classic (a la Borat). Madonna was at her worst in this film, as if she never rehearsed her lines. If you have some free-time and nothing to do, you should watch it. But if not, stay away. Far away. As far away as possible. Keep this movie \"Swept Away\" in the discount bin.",
            "review_date": "2010-07-11",
            "source": "rt"
        },
        {
            "content": "nice romantic movie without good and usually romantic and happy ending. might be story of life.. if person is not ready to step up for himself and change his life by following his dream.",
            "review_date": "2010-06-27",
            "source": "rt"
        },
        {
            "content": "Marriage is solid  in an uncivilized society.",
            "review_date": "2010-05-24",
            "source": "rt"
        },
        {
            "content": "\"Swept away\" is probably one of the worst movies ever made. Whoever wrote this script and directed should be banned from making another movie. Sloppy acting and a sloppy story. It's pure trash.",
            "review_date": "2010-05-23",
            "source": "rt"
        },
        {
            "content": "I saw this one 'by accident'. It was on television, and it just grabbed my attention. Everybody knows the gruesome reputation this film has, but it was interesting, and the weird chemistry between Madonna and Adriano Giannini is sweet in a sadomasochistic kinda way. Not Guy Ritchie's finest hour, but not the disaster that was expected.",
            "review_date": "2010-04-08",
            "source": "rt"
        },
        {
            "content": "Really only the ending saved this movie from ultimate failure, and even then I'm not so sure.  I would not recommend this movie to anyone, especially feminists.",
            "review_date": "2010-04-02",
            "source": "rt"
        },
        {
            "content": "clairement le moins bon de guy ritchie\nmadonna et le mec jouent mal\nle seul bon point est la fin mais Ã§a sauve pas ce film rate",
            "review_date": "2010-03-23",
            "source": "rt"
        },
        {
            "content": "\"One of the Worst films of all time\"...\r\n\r\nHm... I seriously cannot understand what's so bad about this film. Madonna CAN act, she just doesn't know how to at her full potential.\r\nWhen it's not making you laugh, it's a fantastic drama.\r\nYes, it falls apart at times but it manages to pick itself up.\r\nI can bet your money that in 20 years or so, this film will be cult classic, like a previous Madonna-starring film \"Who's That Girl?\".",
            "review_date": "2010-03-12",
            "source": "rt"
        },
        {
            "content": "Well. I was once told that if you can't say anything nice don't say anything at all.\n\nIt was mediocre. Bland. Right out boring. The end was what did it for me though. That ruined the whole movie because it was so...bad. \nIt's nothing special. It hasn't got a very impressive cast or plot. I'm sorry it just...no. I'm at loss for words for this one actually.\n\nIt's not good. That's the nicest thing I can say about it.",
            "review_date": "2010-02-11",
            "source": "rt"
        },
        {
            "content": "One of the worst movies I've ever witnessed, without a doubt.",
            "review_date": "2010-01-27",
            "source": "rt"
        },
        {
            "content": "Dear lord, why? The worst from overrated director Richie.",
            "review_date": "2010-01-12",
            "source": "rt"
        },
        {
            "content": "Like the Hawaiian alphabet, a small population will see the point, but for everyone else there's just too many letters missing.",
            "review_date": "2010-01-05",
            "source": "rt"
        },
        {
            "content": "Madonna o.o'' was awesome.",
            "review_date": "2009-12-27",
            "source": "rt"
        },
        {
            "content": "terrible movie... but I like it.",
            "review_date": "2009-12-06",
            "source": "rt"
        },
        {
            "content": "Guy & Madge give it their all, but the comedy's too broad, love story too predictable & love-via-rape is, uh, kinda repellent.",
            "review_date": "2009-11-16",
            "source": "rt"
        },
        {
            "content": "I actually love this movie and think it is a thing of beauty to watch. Madonna is great as the spoilt socialite and Adriano is very sexy as \"peepee\" ! Love the musical sequence too. A MUST SEE for Madonna fans and unfairly lambasted upon release..a future classic.",
            "review_date": "2009-11-16",
            "source": "rt"
        },
        {
            "content": "I like this movie though I want to change the ending. It was very sad... After I finished watching this, I felt really depressed...",
            "review_date": "2009-11-09",
            "source": "rt"
        },
        {
            "content": "I kinda like this movie  hahahaahhhhhhhï¼",
            "review_date": "2009-11-09",
            "source": "rt"
        },
        {
            "content": "I saw this one 'by accident'. It was on television, and it just grabbed my attention. Everybody knows the gruesome reputation this film has, but it was interesting, and the weird chemistry between Madonna and Adriano Giannini is sweet in a sadomasochistic kinda way. Not Guy Ritchie's finest hour, but not the disaster that was expected.",
            "review_date": "2009-10-29",
            "source": "rt"
        },
        {
            "content": "Not as bad as the critics say, but still bad.",
            "review_date": "2009-10-09",
            "source": "rt"
        },
        {
            "content": "I was a little apprehensive of watching this DVD, obviously if the press and critics were to be believed it would be the worst film i'd ever see.\n\nThat title goes to 'From Hell', the worst east end accents i've ever heard, a film I could only watch for ten minutes.\n\nI was expecting the worst and was pleasantly surprised with Swept Away. The actors are very good and very believable, the movie obviously totally different to anything Guy Ritchie has done before, but it was fascinating how he handled the change from gangster violence to the violence portrayed in this movie. At the same time it was interesting to see the relationship between the two leads devolop. As others have commented the ending was very emotional, and it would have been better if more time was given to the characters to explore their relationship.\n\nBut after watching the movie from beginning to end I found no moments that made me uncomfortable or even boring, I would highly recommend this movie.\n\nIf you don't want to take my word for it, watch it and judge for yourself...",
            "review_date": "2009-09-26",
            "source": "rt"
        },
        {
            "content": "I wasn't swept away but I did enjoy this film, I have no shame!",
            "review_date": "2009-09-15",
            "source": "rt"
        },
        {
            "content": "I've smelled shit better than this.",
            "review_date": "2009-09-12",
            "source": "rt"
        },
        {
            "content": "if i could rate it lower than 1/2 of a star, I would.",
            "review_date": "2009-09-07",
            "source": "rt"
        },
        {
            "content": "Disappointing, & boring.",
            "review_date": "2009-08-22",
            "source": "rt"
        },
        {
            "content": "Only if you want to see Madonna wearing a black bikini... Seulement si vous souhaitez admirer Madonna en bikini noir... Very predictable and really bad acting! Tres previsible et jeu d'acteurs assez limite!",
            "review_date": "2009-08-13",
            "source": "rt"
        },
        {
            "content": "Brit director Guy Ritchie strikes out with this abrasive remake of Lina Wertmuller's Italian 1974 original, which starred Giancarlo Giannini. Here, his son Adriano stars the poor Italian fisherman cast away on a Mediterranean island with a spoiled rich bitch (Madonna at her most obnoxious), turning the tables on her, until they - surprise - fall in love. Unconvincing, wildly uneven comedy/drama finds time for \"cute\" charades montage and dancing numbers in between the sexual politics. Not as bad as you've heard, but close...very close.",
            "review_date": "2009-08-12",
            "source": "rt"
        },
        {
            "content": "OK..i was expecting a train wreck, so expectations were def low.   It all starts out well...madcap and silly....but the middle act is just painful.  Things sort themselves out by the end ...but not sure if I'd say it was worth sitting through.",
            "review_date": "2009-08-02",
            "source": "rt"
        },
        {
            "content": "I could not watch the entire movie. It is bad.",
            "review_date": "2009-06-24",
            "source": "rt"
        },
        {
            "content": "Just a strand above terrible. Something about the movie kept me watching but the acting was weak and the story was not too thrilling.",
            "review_date": "2009-04-05",
            "source": "rt"
        },
        {
            "content": "A bad remake.. madonna wanted it on a whim and has been a Guy Ritchie real flop...",
            "review_date": "2009-03-26",
            "source": "rt"
        },
        {
            "content": "Honestly, Everyone knows that Modonna wasn't the best actress at all. However, beside \"Evita\", I think this was Modonna's best acting so far. I did enjoy the movie very much, and the ending was just heartbreaking...",
            "review_date": "2009-03-22",
            "source": "rt"
        },
        {
            "content": "Why this movie got torn apart is totally beyond me. If people would look beyond Madonna's off screen persona they would actually see this as a good movie. Madonna's performance is great. I loved this movie.",
            "review_date": "2009-03-21",
            "source": "rt"
        },
        {
            "content": "pues muchos dicen que es una mierda  que el señor Ritchie  se pifio pero a mi me gusto que lugares mas paradisíacos y la historia es entretenida además es Madonna!!!!",
            "review_date": "2009-03-14",
            "source": "rt"
        },
        {
            "content": "Everybody knows that Madonna isnÂ´t a good actress but she looks great in this movie, is a good story but i hate the end not because is not a happy ending just because is a bad ending... but in my opinion is a good movie by the way",
            "review_date": "2009-03-08",
            "source": "rt"
        },
        {
            "content": "This is kinda cute. I've never seen the original movie but I love Ritchie's touch to this romantic comedy (with sad ending!!!).",
            "review_date": "2009-03-07",
            "source": "rt"
        },
        {
            "content": "This film got slated by the critics but I really enjoyed it, thought the ending was so sad!",
            "review_date": "2009-02-20",
            "source": "rt"
        },
        {
            "content": "This was visually a very pretty movie. The color of the ocean was so BLUE and the white sand beaches were so PRISTINE. The cinematography and tableaus created were so BREATHTAKING that the only pleasure one can derive fom this mess is an appreciation of the beaches in Sardinia. But all of that does not make up for a lack of plot or mischaracterizations of the protagonists. Madonna, who gets marooned on an island with a macho Italian steortypical guy reminded me of a petulant teenager. She related to her husband and Italain macho guy as a naughty teen would. No real depth of anything. The \"funny\" scenes were merely embarrassing. How could Guy Ritchie make something this bad? It doesn't make any sense after seeing Snatch and Lock, Stock. IT IS STOMACH CHURNING AWFUL people! I felt queasy with the slow motion fake-tears-chasing and the accompanying vertiginous piano: ping! ping! ping! This film was a romp on the beach with adults acting acting like thirteen year old dominant/submissives. (Madonna kissing macho's foot after she submits to him - bleh.)Most of the island scenes between these two adults were filmed like a home movie with the light shining on a worn out looking Madonna: \"Look at me! See how buff and pretty I am! I can do push ups and dancie dance, and see how big my biceps are?\" Oh my God. This was bad. Madonna doesn't act, she just plays herself. Just because she can cry on cue doesn't mean she is an actress.",
            "review_date": "2009-02-11",
            "source": "rt"
        },
        {
            "content": "I don't think this film is quite as bad as a lot of people make it out to be, but it's still not very good.  A flat, watered down version of the original.",
            "review_date": "2009-02-09",
            "source": "rt"
        },
        {
            "content": "i found a lot of nice moments here.",
            "review_date": "2009-02-01",
            "source": "rt"
        },
        {
            "content": "really hated this movie X_x",
            "review_date": "2009-01-22",
            "source": "rt"
        },
        {
            "content": "The film lacks something of the original Wertmuller film (Mariangela Melato), though it mostly stays faithful to the plot. The spaghetti scene should be on the cutting room floor while the rehashed ending and a few other added beats resolve some of the awkwardness of the original... at the expense of a little comedy.",
            "review_date": "2009-01-20",
            "source": "rt"
        },
        {
            "content": "You know, I really don't get the bad rap of this movie.  Madonna, I thought, was actually okay in this film.  Adriano Gianinni, though . . . not great.  The film gets very misogynistic about a third of the way through, which I didn't like so much, but other than that, it wasn't too bad.",
            "review_date": "2009-01-10",
            "source": "rt"
        },
        {
            "content": "Crap!\r\nIf she wasnt his wife at the time no way in a million years would Guy make this movie,\r\nGets 1 star cause I was able to finish it!",
            "review_date": "2009-01-06",
            "source": "rt"
        },
        {
            "content": "This really a movie that's pretty close to horrible.  Guy Ritche probably said \"hey babe, I want to make a movie for 90 minutes where 85 minutes of it is the audience watching your body\"  It was actually Madonna probably saying that to Guy, but whatever.  The reason I gave it two stars is it is a lot like watching a car accident: you can't help but look.",
            "review_date": "2008-12-30",
            "source": "rt"
        },
        {
            "content": "i'm not so sure why a lot of people don't like this. this is on my top ten list.\nit's a great story and a wonderful lesson on life and love. 5 stars!",
            "review_date": "2008-12-30",
            "source": "rt"
        },
        {
            "content": "Dear Mr. Ritchie,\nWhy the hell you think you should made a romantic movie after all you've done in crime genre? why the hell did you HAVE to use your wife -your absolutely untalented ugly wife- for a role that she can't play? why the hell did you have to remake a 1974 movie that sucks? I'm disappointed at you Mr. Ritchie. I'm disappointed.",
            "review_date": "2008-12-30",
            "source": "rt"
        },
        {
            "content": "It's a shame that Madonna's acting will never measure up to her fitness level.  The original of this was fun to watch as a pre-teen boy on HBO.  However, this version is poisoned by Madonna's inability to convince us of anything, and by the ridiculous idea that with $200 GPS systems, there is still a place in the Mediterranean where anyone could be lost for a few months.",
            "review_date": "2008-12-22",
            "source": "rt"
        },
        {
            "content": "Despite the many negative reviews Swept Away received i felt it was a pretty good movie but suffered from the starring of Madonna and the drastic change in subject matter for Guy Ritchie.  Giannini's performance is actually foarly decent and only when they chnage from enemies to lovers does it fall flat.  Have to mention the excellent score aswell.",
            "review_date": "2008-12-19",
            "source": "rt"
        },
        {
            "content": "Este re-make dirigido por Guy Ritchie es entretenido y no merece las duras criticas que recibio.  Ya sabemos que Madonna como actriz es muy buena cantante... pero que se le va a hacer?  Es la esposa del hombre.",
            "review_date": "2008-12-14",
            "source": "rt"
        },
        {
            "content": "Like many films said to be the \"worst ever\", this film is actually pretty interesting. There's something about the tone and pacing that truly doesn't work. However, there are actually some intriguing aspects of this film with regard to nature, gender relations, and celebrity. I'm curious about the original it remakes.",
            "review_date": "2008-11-24",
            "source": "rt"
        },
        {
            "content": "just one word\r\nterrible!!!",
            "review_date": "2008-11-23",
            "source": "rt"
        },
        {
            "content": "nice location. a nice song on the soundtrack. the movie was crap. bad acting. unlikeable characters.unfunny.  romanticizes rape. lame dialogue. i can't believe guy richie directed it. definitely good that i saw it on tv and did not need to waste any money on it.",
            "review_date": "2008-11-20",
            "source": "rt"
        },
        {
            "content": "Okay. This movie is garbage. Don't ask my how I've seen this. She is stranded with her sailor/butler and once he realizes he is the man now, he pretty much tries to rape her, and starves her, and then she falls in love with him and then they are rescued and she leaves him. Stupid Movie.",
            "review_date": "2008-11-12",
            "source": "rt"
        },
        {
            "content": "Slammed by everyone and their mother I put off seing this movie until I saw the DVD on sale for 5.00. I bought it and to be honest with you it wasn't that bad. It was a lackluster storyline to begin with but as re-makes go this one was not that bad.",
            "review_date": "2008-10-28",
            "source": "rt"
        },
        {
            "content": "muscular botoxed romantic madonna, not bad a movie.... ending for me was a \"oh no\"",
            "review_date": "2008-10-17",
            "source": "rt"
        },
        {
            "content": "Not bad. Beautiful location shooting. It's not much in the way of real successful character development. Madonna does not suck, but hers is not the kind of character you either like to watch or really want to see become a better person. It really should have been much worse to warrant all the hatred directed at this movie.",
            "review_date": "2008-10-15",
            "source": "rt"
        },
        {
            "content": "the 60's version was a bit better.",
            "review_date": "2008-10-11",
            "source": "rt"
        },
        {
            "content": "In my humble opinion, Madonna ruined Guy Ritchie's career in this one.",
            "review_date": "2008-10-08",
            "source": "rt"
        },
        {
            "content": "Its one of the sickest love movies ive seen. The acting is poor, but the characters are twisted and the emotions they show just makes your stomach turn.\nthe characters are quietly deranged in a similar way to his other films",
            "review_date": "2008-10-03",
            "source": "rt"
        },
        {
            "content": "Very, very poor movie. Nevertheless one star because I used to be a Madonna fan in the 80's :o)",
            "review_date": "2008-10-02",
            "source": "rt"
        },
        {
            "content": "guy what did you do?",
            "review_date": "2008-09-02",
            "source": "rt"
        },
        {
            "content": "Film på temat Så tuktas en arbigga, dvs inte mitt favorittema. Men om man tycker det är kul att se Madonna tvingas kalla en italienare för master och kyssa hans fötter så antar jag att det här är ett riktigt äss.",
            "review_date": "2008-08-18",
            "source": "rt"
        },
        {
            "content": "Is it as bad as you've heard? No. It's worse.",
            "review_date": "2008-08-15",
            "source": "rt"
        },
        {
            "content": "ãï¼ã¦ãããã®ï¼äººãæã«è½ã¡ãã£ã¦ã©ããããã¨ï¼ï¼ããå¾ãªããç¾å®æããªããã©ãçµæ§æ¥½ãããã»ï½",
            "review_date": "2008-08-04",
            "source": "rt"
        },
        {
            "content": "So me Ive been swept away from the Bronx, NY.",
            "review_date": "2008-07-30",
            "source": "rt"
        },
        {
            "content": "This is one of the most pointless and boring movies I have ever seen! Just awful and I despised it.",
            "review_date": "2008-07-21",
            "source": "rt"
        },
        {
            "content": "The flim critic in me HATES IT, but the faggot in me LOVES  IT.",
            "review_date": "2008-07-08",
            "source": "rt"
        },
        {
            "content": "2 hours of my life i'm never getting back.  Okay, yes, i was watching two movies at once but I just couldn't bring myself to actually WATCH this movie in its entirety...maybe it was Guy Ritchie's attempt to make an artsy film outside of his usual Brit caper films...he should really stick to the capers",
            "review_date": "2008-07-08",
            "source": "rt"
        },
        {
            "content": "I caught the end of Swept Away on TV tonight.  I hadn't seen it in SO long, and I had forgotten how much I loved this movie.  The acting was not that noteworthy, but I love the plot - it's the most heartbreaking love story ever.  The way the end sequence was filmed makes me cry almost every time.  Plus, Adriano Giannini is hot!",
            "review_date": "2008-07-07",
            "source": "rt"
        },
        {
            "content": "Only movie to ever make me cry my eyes out. Other than 'Selena', but that was when I was like 9.",
            "review_date": "2008-06-27",
            "source": "rt"
        },
        {
            "content": "No entiendo porque fue un fracaso de taquilla. Apartando mi fanatismo por Madonna, puedo decir que disfrute de la trama e incluso de la actuaciÃ³n de Madge. Su final sorprendentemente triste me dejÃ³ inconforme.",
            "review_date": "2008-06-23",
            "source": "rt"
        },
        {
            "content": "i do love Madonna but this movie its a kind of black zone !",
            "review_date": "2008-06-10",
            "source": "rt"
        },
        {
            "content": "Not as bad as critics made it out to be. Certainly not great either...",
            "review_date": "2008-06-09",
            "source": "rt"
        },
        {
            "content": "it's just for a good end, and it was funny at the begining. Yes this is guy ritchie but, why?",
            "review_date": "2008-05-27",
            "source": "rt"
        },
        {
            "content": "Muddled and lacking the political context of the original, Swept Away offers further proof that Madonna can't act.",
            "review_date": "2008-05-26",
            "source": "rt"
        },
        {
            "content": "Not a bad movie! Worth watching coz Madonna Looks Hot even at her menopause :-)",
            "review_date": "2008-05-26",
            "source": "rt"
        },
        {
            "content": "All that I have to say about this film is that Madonna sure has been working out...I mean, nice muscles! So, as you guessed, very average film.",
            "review_date": "2008-05-21",
            "source": "rt"
        },
        {
            "content": "It sucked, and it just got me mad. What on earth was Guy Ritchie thinking",
            "review_date": "2008-05-19",
            "source": "rt"
        },
        {
            "content": "A fun film to watch with your friends because damn, it sucks. :D The film probably has some of the most ridiculous scenes and lines ever. However, there was actually some good stuff mainly thanks to Adriano Giannini and the chef's helpers. But c'mon Guy Ritchie, what were you thinking?",
            "review_date": "2008-05-18",
            "source": "rt"
        },
        {
            "content": "Awesome movie! :) \"Say that you want me! Say that you want me!\" \"I want you!\" \"But I Can still say no.\" one of the hardest laughs in a very long time.",
            "review_date": "2008-05-18",
            "source": "rt"
        },
        {
            "content": "Don't waste your time!!",
            "review_date": "2008-05-18",
            "source": "rt"
        },
        {
            "content": "I hope Madonna contracts a horrible disease that causes a protracted death for what she has done to Guy Ritchie.  There is nothing at all to like aobut this movie.  Madonna's character is a bitch throughout the entire thing with no redeeming qualities.  Giannini's character is almost sympathetic until he becomes a misogynistic monster.  Like I said there is nothing (and no one) to like in this movie.",
            "review_date": "2008-05-17",
            "source": "rt"
        },
        {
            "content": "didn't really get into this movie at all.",
            "review_date": "2008-05-16",
            "source": "rt"
        },
        {
            "content": "Una jodida obra de arte. Y Madonna es Dios que no cabe duda. Y es la peli más guay que he visto en mi vida. Infravlorada. Parece hecha por Kubrick! Por Dios que gente con poca visión de fúturo. MASTERPIECE!!!!!!",
            "review_date": "2008-05-16",
            "source": "rt"
        },
        {
            "content": "A rather predictable and CHEESY one...but for whatever reason i love it anyway, and watch it whenever i see it on...",
            "review_date": "2008-05-16",
            "source": "rt"
        },
        {
            "content": "I L~O~V~E this movie...not a big Madonna fan, but I loved it! Cry every time I see it!",
            "review_date": "2008-05-14",
            "source": "rt"
        },
        {
            "content": "I didn't think this was as bad as everyone says it is. Characters are pretty two dimentional but if you accept that, it's quite fun watching a romantic comedy directed in the same way as Guy Ritchie's gangster films. Deserves credit for avoiding a predictable ending.",
            "review_date": "2008-05-11",
            "source": "rt"
        },
        {
            "content": "better than i thought",
            "review_date": "2008-05-06",
            "source": "rt"
        },
        {
            "content": "WOW! So NOT a good movie.",
            "review_date": "2008-05-02",
            "source": "rt"
        },
        {
            "content": "good saturation of colours, nice place to travel, the rest is lol",
            "review_date": "2008-04-27",
            "source": "rt"
        },
        {
            "content": "I don't care what anyone says. Even if the movie wasn't the best, it still feeds on many people's fantasy to be stuck on an island with some sexy someone. They were both hot and did a good job.",
            "review_date": "2008-04-20",
            "source": "rt"
        },
        {
            "content": "I should say right now that I did not sit and watch the entire movie, and that this review is pretty much based only on the scenes where they're on the beach and the part where they tried to run away together.\n\nI'm just amazed at how quickly two people who hated each other can fall in love (\"I love you more than life!\") after playing charades in a shack. And the whole thing where they're like \"Let's run away together!\" was just... gag-worthy. In addition to that, I thought Madonna's performance was horrible, considering how much better her acting was in her other films. Adriano Giannini was fine.",
            "review_date": "2008-04-20",
            "source": "rt"
        },
        {
            "content": "Fuck you Madonna. You ruined Guy Ritchie.",
            "review_date": "2008-04-04",
            "source": "rt"
        },
        {
            "content": "I absolutely adore this movie. I wish more people would give it a chance. I think many people give up on it near the beginning... but if only they would stick with it... it's a poignant, touching and well acted (yes, well acted) storyline... One of my all-time favourite movies",
            "review_date": "2008-03-23",
            "source": "rt"
        },
        {
            "content": "Una exelente historia de amor",
            "review_date": "2008-03-22",
            "source": "rt"
        },
        {
            "content": "madonna was hot in this",
            "review_date": "2008-03-19",
            "source": "rt"
        },
        {
            "content": "It was okay. I thought it would have been better. It was good once it got going. The beginning is really slow.",
            "review_date": "2008-03-12",
            "source": "rt"
        },
        {
            "content": "I don't get what the big deal was about. It wasn't half a painful. Really.",
            "review_date": "2008-03-12",
            "source": "rt"
        },
        {
            "content": "Decent movie... TERRIBLE ending. One of those that leaves you hanging. Madonna always leaves one wanting more, but not good in a movie.",
            "review_date": "2008-03-03",
            "source": "rt"
        },
        {
            "content": "Poor itaiÄ±an guy :(",
            "review_date": "2008-03-02",
            "source": "rt"
        },
        {
            "content": "Madonna is so funny in this movie V sad ending too",
            "review_date": "2008-02-13",
            "source": "rt"
        },
        {
            "content": "Ã§ok klasik olmasÄ±na raÄmen eÄlenceliydi",
            "review_date": "2008-02-08",
            "source": "rt"
        },
        {
            "content": "After a bad start, this film is actually very enjoyable. Good dynamics and a credible performance from Madonna.",
            "review_date": "2008-02-07",
            "source": "rt"
        },
        {
            "content": "whats another word for bad.baaaaaaaaaaaaaaaaaaaaaaad!!! or this film",
            "review_date": "2008-02-04",
            "source": "rt"
        },
        {
            "content": "Mandona's last film, after that go to...(He!He!)",
            "review_date": "2008-02-02",
            "source": "rt"
        },
        {
            "content": "realistic end of almost all non-realistic love stories...",
            "review_date": "2008-02-01",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies I have seen, anytime I need a good dry laugh I throw this in.  I have seen it at least 15 times. One of my top three of all time, the other two...brotherhood of the wolf and the big blue.",
            "review_date": "2008-01-27",
            "source": "rt"
        },
        {
            "content": "Superb performance by the island.Definitely the best actor/actress amongst the cast.",
            "review_date": "2008-01-19",
            "source": "rt"
        },
        {
            "content": "Swept Away has a non-commercial story in a commercial wrapping and I guess that is why it flopped. The story is mainly of a masochistic Madonna (as we know her from \"Sex\") and my bet is that Ritchie already had the script sent over by Madonna herself. She is not the best actress in the world but the story itself is enough to make you horny for a good, wet nights sleep.",
            "review_date": "2008-01-16",
            "source": "rt"
        },
        {
            "content": "Favorite quote: \"Where is God when you need him?\".\r\nThe whole movie is a flop. But: Madonna is super! I love her!!!",
            "review_date": "2008-01-08",
            "source": "rt"
        },
        {
            "content": "I think the bad acting is what made the film so good!",
            "review_date": "2008-01-06",
            "source": "rt"
        },
        {
            "content": "very bad acting by both actors. Madonna's character was annoying too. plus her botox scares me. but there were a couple hot steaming scenes in the middle somewhere. although they could have been better. and what's with the constant fading. bad fading too. it's like watching a kid learn to use filming tricks. poor job by Guy Ritchie.",
            "review_date": "2008-01-05",
            "source": "rt"
        },
        {
            "content": "i know madonna is not the \"best\" actress, but the the story and the italian in here turns me into niagraaaaaaa",
            "review_date": "2008-01-02",
            "source": "rt"
        },
        {
            "content": "Swept Away is my 34th favorite movie. That's right favorite was the word i used. This meant come as a suprise to some since this movie was voted the worst movie of 2002. I found it to be a great love story and almost wish i would be so lucky to be trapped on an island with nothing but the girl i love. Music was absolutely perfect in this movie with Fade Into You by Mazzy Star and Spiegel im Spiegel by Arvo Part. It was a touching movie with awfully sad ending.",
            "review_date": "2007-12-30",
            "source": "rt"
        },
        {
            "content": "i only watched it (years ago) because i heard it was terrible.  it sort of was, it was kind of difficult to watch when the roles switched and the guy was treating her like a dog.",
            "review_date": "2007-12-28",
            "source": "rt"
        },
        {
            "content": "THis is getting two and a HALF stars cause i have been in a similar situation and it had an element of truth in terms of the broad themes and emotions. the acting is terrible though and it kinda seems a little vain. the direction is bad. Maybe the fisherman is a decent actor, but i think the overall writing and story line sucked. the end seemed too cliche'd.",
            "review_date": "2007-12-21",
            "source": "rt"
        },
        {
            "content": "i couldn't finish watching it.",
            "review_date": "2007-12-20",
            "source": "rt"
        },
        {
            "content": "watched it out of curiousity cuz i heard it was like really bad and it was just so convienent that my dad had bought that movie a couple of years ago and after watching that moVie now i understand how \"curiousity killed the cat\" this movie should be illegal and never sould have been filmed! this movie should get the award for \"worst movie of all times\" I ONLY GAVE IT HALF A STAR BECUZ THEY (FLIXSTER FORCES YOU TO PUT AT LEAST HALF A STAR. if it was up to me...i would give it a a NEGATIVE infinity star. THIS ISN'T WORTH A PENNY!!!!!. SO DONT WASTE UR TIME ON THIS MOVIE CUZ THATS ALOST 2 HOURS YOU WONT GET BACK!!!!! SO I ADVISE YOU, STAY AWAY FROM THIS PIECE OF S--T",
            "review_date": "2007-12-18",
            "source": "rt"
        },
        {
            "content": "I'm partial to Guy Ritchie films, and I'm partial to love stories with depressing endings...this is both.\n\nIt's not for everybody, but none of Ritchie's movies are.",
            "review_date": "2007-12-17",
            "source": "rt"
        },
        {
            "content": "Este re-make dirigido por Guy Ritchie es entretenido y no merece las duras criticas que recibio.  Ya sabemos que Madonna como actriz es muy buena cantante... pero que se le va a hacer?  Es la esposa del hombre.",
            "review_date": "2007-12-03",
            "source": "rt"
        },
        {
            "content": "Watch the original.  Enough said.",
            "review_date": "2007-12-02",
            "source": "rt"
        },
        {
            "content": "I'm a big Madonna fan, but this one I really dont like...",
            "review_date": "2007-11-23",
            "source": "rt"
        },
        {
            "content": "guilty pleasure..\r\nthe best of the worst..\r\nenjoyable..\r\nthe comedy of cast away..",
            "review_date": "2007-11-20",
            "source": "rt"
        },
        {
            "content": "the half a star is for the scenery.",
            "review_date": "2007-11-20",
            "source": "rt"
        },
        {
            "content": "great bdsm oriented film!\r\nfor my opinion the film is made out of 2 main parts - the sin & the punishment ;-))\r\ni guess madonna love to be punished ;-)",
            "review_date": "2007-11-19",
            "source": "rt"
        },
        {
            "content": "I don't understand why this movie got ripped apart. It wasn't the best, but it had a new feel to it and was enjoyable.",
            "review_date": "2007-11-17",
            "source": "rt"
        },
        {
            "content": "I know a lot of people said tis movie was terrible, but I thought it was funny and beautiful.  I love the whole plot and story line, much funnier than CastAway with Tom Hanks.  The dynamics of the relationships go through so much.  It is a great show.",
            "review_date": "2007-11-15",
            "source": "rt"
        },
        {
            "content": "Not as bad as it's been made out to be, but still not really worth seeing",
            "review_date": "2007-11-15",
            "source": "rt"
        },
        {
            "content": "If you spend your time on an easy movie - gotta be something ike this",
            "review_date": "2007-11-14",
            "source": "rt"
        },
        {
            "content": "Guy Ritchie, come back to us, please...",
            "review_date": "2007-11-10",
            "source": "rt"
        },
        {
            "content": "again, not as bad as everyone thinks.  the part that i find horrible is the fact that madonna cries and her face doesn't even move.  thanks, botox.",
            "review_date": "2007-11-09",
            "source": "rt"
        },
        {
            "content": "Wow - what a movie.\nTerrible in almost every possible way.\nDoes a nice job of showing just how bad a director Riche is without someone shouting \"Hes a facking feef\" every few mins.",
            "review_date": "2007-11-09",
            "source": "rt"
        },
        {
            "content": "I'v loved everything ever made by Guy Ritchie BUT this piece of crap. This has probably come about from a \"MAKE ME A MOVIE\"  bitch slap upside the head or Ritchie. sad... \r\n\r\nFor trivia fans, Ritchie also made a movie for the BMW Shorts serie with Madonna, that was waaaaaay better :)",
            "review_date": "2007-11-08",
            "source": "rt"
        }
    ]
}