{
    "title": "Fair Game",
    "rating": 0.0,
    "release_date": "1995-11-03",
    "num_reviews": 81,
    "genres": [
        "Action",
        "Romance",
        "Thriller"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Brainless tosh, but quite good fun",
            "content": "Can Cindy Crawford act? Not really, but well enough to scream and run from one overblown action scene to another, taking the odd breather for showers (plural) and changes of clothes. I kind of enjoyed this brainless tosh. Cinders looks great, adequately playing an uncompromising, smarty-pants attorney. Baldwin is the cop determined to guard her body when people start trying to kill her. He just about pulls off the hardass cop routine, but never really musters the enthusiasm to look like he's enjoying it. The bad guys glower and plot, hunting the fleeing pair down with ruthless skill (and some rather suspect computer trickery), then cocking things up each time allowing them to escape. It's hugely violent, fast moving, loud, full of swearing etc.,  all the things you associate with nineties action fodder, and finishes off with a big enough bang. Don't expect much, and you shouldn't be disappointed.Oh, and if you're wondering about nudity, Cindy does indeed \u0091get them out for the lads', and Baldwin shows his butt.",
            "review_date": "2001-09-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lots of Action and Cindy Crawford Topless \u0085 How Bad Can it Be?",
            "content": "Before it careens into total silliness, `Fair Game' is a lot of fun. After the rather absurd attempted shooting of Crawford in the opening scene, `Fair Game' begins rather effectively examining the loss of privacy in the digital world, a fresh idea in 1995 (`Enemy of the State' didn't arrive till three years later). Crawford plays a lawyer specializing in civil cases. While helping one of his divorce clients she inadvertently falls under the scrutiny of a group of former KGB assassins. William Baldwin (`Backdraft')is the cop assigned to protect her. Baldwin looks like a cross between his brother Alec and Nicholas Cage; in other words, kind of goofy. Cindy Crawford looks like \u0085well, Cindy Crawford, one of the world's most beautiful women. Crawford received some pretty bad raps for this movie. That's really unfair, but not surprising, considering Hollywood's experience with supermodels. In the 50s, they used to dub supermodel Suzy Parker. Crawford's considerably better than that. Her voice and line readings remind me of early  Farrah Fawcett.The big problem here is neither Crawford nor Baldwin. It's a script that would have us believe former KGB operatives would miss Crawford with a machine gun as she stands by a storefront with no cover. It's a script that would have us believe KGB agents would blow up Crawford's house with C4 to cover a COVERT operation. It's the script that would give Baldwin endless supplies of 9mm ammunition, while he leaves behind machine guns and `street sweepers'. It's a script that has the intelligent, sensible Crawford running from Baldwin, her only ally. It's a script that would have us believe the feisty Crawford would surrender without a fight, etc., etc.\nProduction values for `Fair Game' are top notch, great color photography, sound, music, editing and stunts. Had producer Joel Silver substituted Jackie Chan for Billy Baldwin, `Fair Game' would have made a first rate martial arts movie, even with its other shortcomings.  \u0091Course, I'm not sure Cindy Crawford would've `gotten naked' for Jackie Chan.  Well, topless, anyway.`Fair Game' is a `dumb blonde' of a movie, but Crawford is anything but dumb. She deserved better and deserves another opportunity to prove her mettle as an actress. If she made another movie,  I'd go see it, even if she become closer to an \"8\" than a \"10\".Nonetheless, `Fair Game' is, at worst, a `fair' movie.  I give it a `5'.",
            "review_date": "2004-08-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I may be biased because I like Cindy Crawford, but so what...",
            "content": "Okay, so it's got hardly any plot and what there is doesn't make much sense. So it was doomed to be slated by critics the second Cindy Crawford said yes. So the film may have the world record for the number of scenes in the trailer that aren't in the finished film. It's still far from the worst film ever made, and certainly far from the worst in the year it came out (1995 was the year of \"Showgirls,\" \"Waterworld,\" \"Species,\" and \"Congo\" for openers).Way too much senseless violence, confusing scripting (from Charlie Fletcher and an uncredited Steven E. deSouza), and frenzied editing for sure, and Cindy's Oscar is unlikely to be coming any time soon - but she's no worse than the rest of the cast (and unlike Steven Berkoff, at least SHE hasn't sunk to doing a Jean Claude Van Damme film since). She's actually pretty good more often than not, and her punches are more convincing than some male actors (though hitting the smuggest of the smug Baldwin brothers provides motivation). Let's just say that the man credited as her acting coach clearly didn't see all his efforts go unrewarded.And you have to give her and the rest of the cast and crew credit; no one ever pretends that \"Fair Game\" is anything other than an unpretentious action film, which can't be a bad thing. (But then even Cindy's biggest detractors have never claimed she was pretentious.) While it is mainly for fans of the moled one, it's still short enough not to hurt, and it certainly improves on the last time the Paula Gosling novel it's based on was turned into a film (the truly awful \"Cobra\" with Sylvester Stallone), and you don't often see films starring lawyer characters doing something other than criminal law. And before you point out that no lawyer ever looked as good as Cindy Crawford, remember that that never stopped Steven Bochco - or David E. Kelley with \"Ally McBeal.\" Now who would you rather be represented in court by, Cindy or Ally?",
            "review_date": "1999-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Underwater",
            "content": "****SPOILERS***** Action packed police movie set in Florida about a group of mobsters consisting of ex-KGB agents led by former KBG agent Kazak, Steven Berkoff. The mobsters use an off-shore freighter, The Tortugo, to tap into underwater bank cables and steal millions of dollars in bank transactions. That plan falls apart when the feisty and pretty civil lawyer Kate McQueen, Cindy Crawford, got in their way and had to be eliminated in order for them to keep up their illegal activities. Attempting to assassinate Kate at the beginning of the movie as she was jogging down swanky Ocean Drive she has Homicide Detective Max Kirpatrick, William Baldwin, assigned to be with her around the clock to watch protect and defend her, it's a real hard job but somebody's got to do it, against other attempts on her life. This gang of ex-KGB thugs really mean business as they blow up half of South Florida to get the pair, Max & Kate. As usual, in the movies, Max & Kate are always one step ahead of them and the mobsters no matter how much men and firepower as well as electronic equipment that they have are no match against the two who have almost nothing but the clothes on their back, and some times not even that, to fight them with. Far more violent then most action police movies with almost the entire cast wiped out, with the exception of Max & Kate of course, by the ending credits. The action scenes of \"Fair Game\" are a lot like the old Saturday afternoon cliff-hangers with Max & Kate looking like they've had it and then just getting away from the bad guys every fifteen or so minutes in the movie. The bad guys are as bad as they can get in what they do and try to do, you can just imagine anyone trying to hurt or kill Cindy Crawford has to be the biggest enemy against hu-MAN-ity in history.The last half-hour of the movie is non-stop action on the roads and highways as well as railroad trains and ships in the South Florida area with the most graphic boat sinking since, even though movie was made in 1995 but I haven't seen it until 2004, the movie \"Titanic\" in 1997. Outlandish but at the same time ironic ending with the head gangster Kazak instead of trying to escape the sinking and exploding ship tries to punch into the ships computer the information that he needs to complete his illegal bank transaction of almost one billion dollars! All this with him knowing very well that he won't make it out alive by taking so much time doing it! It's as if Kazak just wanted to die rich.",
            "review_date": "2004-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cindy? Pretty. Movie? Pretty lousy.",
            "content": "Really bad and tedious with it.  The mystery here was not who was trying to kill Cindy Crawford, but how her hair was magically dry and sexily tousled after a series of dunkings.Cindy has exhibited better acting in lipstick commercials. And that scene where she uses her charms to persuade the geek in the computer shop to help her was reminiscent of Ginger trying to coax a coconut from Gilligan.Silly from start to finish.",
            "review_date": "1999-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent film that is sure to keep you on the edge of your seat from start to finish and blow you away",
            "content": "Even though I haven't read the book, if you ask me, FAIR GAME is an excellent film that is sure to keep you on the edge of your seat from start to finish and blow you away. I said that because Kirkpatrick (William Baldwin) and Kate (Cindy Crawford) were always on the run from danger. Also, I loved Rita (Salma Hayek). I just wish her role in the movie had been bigger. In my opinion, the performances were top grade, the direction was superior, the costumes were perfectly designed, and the cast was perfectly chosen. Also, the soundtrack is really good, too. Before I wrap this up, I must warn you that this movie is very violent if you're going to see it, so viewer discretion is strongly advised. Now, in conclusion, if you like Andrew Sipes films or enjoyed Paula Gosling's title novel, I highly recommend this movie. It's sure to keep you guessing from start to finish.",
            "review_date": "2014-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Love it or hate it - this is uncompromising action-entertainment!",
            "content": "In my opinion most blockbusters are watchable movies. Some are good, some are not so good. Some are even quite bad, but they try so hard to offer something for everyone that there usually are at least some things in the movie you like. But because they do offer something for everyone, they usually also have some things you don't like. However, once in a while a film comes along which focuses solely on it's own target audience. Sometimes the critics and fans of so-called 'quality cinema' are the target audience. In those cases we have films like \"American Beauty\". Sometimes fans of sex-related teen-comedies are the target audience and we have a film like \"American Pie\". And sometimes fans of pure action-entertainment are the target audience and we have a film like \"Fair Game\".This is a film which most people have a strong opinion of. Others love it while others hate it. What's interesting is that the reasons for the opinion of the film are the same for both people. Others hate it because it's unbelievably dumb, excessively violent, has an unoriginal plot, stupid dialogue and has no good actors. However, others love it for the same reasons. And I'm one of those people.The film is based on Paula Gosling's novel of the same name. It's interesting to notice that Sylvester Stallone's actioner \"Cobra\" was also based on the same novel but the films have very little in common. About the only thing they share is the hate of the critics and the love of action-fans. What's even more interesting is that Stallone was originally attached to this film as well.Anyway, about this film.. While it's true that no-one has been able to make a good macho-actioner since the 80s (except Steven Seagal and even he is now making films like \"The Patriot\"), this is a quality effort if there ever was one. This has everything I want (a macho cop as the hero, a sexy woman as his sidekick, lots of action and gratuitous violence) and nothing I don't (a deep and original plot, Academy Award-winning actors, emotional scenes between mom and daughter...). Actually many scenes here are so stupid that they could be considered campy and even if you aren't a fan of the genre, you might enjoy laughing at the movie's unintentional humor.One of the things which always means a lot to me in films is the score and \"Fair Game\" has one of the best scores I've ever heard. I liked Mark Mancina's score to \"Speed\" and \"Bad Boys\" but they're nothing compared to this. A brilliant main theme combined with excellent underscore. Full marks.There is also the traditional \"You killed my partner. Big mistake, you hear me? Wanna know why? Because I'm gonna come and get every last one of you!\"-threat from Baldwin. I love those lines, I really do. \"Cobra\" was filled with them and the  mid-80s was a good time for macho-actioners.\nIn fact, \"Fair Game\" is like a throwback to the 80s, when Joel Silver still made good actioners (Commando, Action Jackson, Die Hard, Road House - all brilliant). Of course it's not intelligent. Of course it's not original. Of course it's not a film which makes people think about their lives. It is pure action-entertainment, nothing more and nothing less. This will definitely appeal to fans of \"Cobra\", \"Action Jackson\" and the early Steven Seagal-films. However, if you don't like action, pure action and nothing but the action - skip it. Even if you liked films like \"Speed\" and \"Face/Off\", you might not like this.Gunfights, explosions, gratuitous violence, gratuitous nudity (from Cindy Crawford, no less!), a brilliant score..what more could a guy who loves action ask? Definitely a 10.",
            "review_date": "2000-03-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Action packed, and Cindy Crawford. What else do you need in a movie?",
            "content": "Definitely not Oscar material, but a good late night watch.  Lots of action and stunts.  Cindy Crawford can't act, but who cares!?  The plot involves some high tech Ruskies who are after Cindy, as F.B.I. Agent Billy Baldwin comes to the rescue. There is ensuing sexual tension.",
            "review_date": "1999-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Totally underrated!!!!",
            "content": "Okay, so the screenplay wasn't really Sidney Lumet, and the two leads were in bad need of an acting class, but you can't say this movie wasn't entertaining. It was campy! Everyone in the cast talked like they were reading off a chalkboard somewhere, making it hilarious. What's more (or to add good expectations for the male side) you get a full glimpse of Cindy Crawford's bare breasts and the millionth Baldwin brother to take a shot at acting. (And without a surprise, this shot proved blank.) Don't take this as something serious; look at it as the \"Plan 9 Of Outer Space\" for Hollywood action movies. If you have to poke fun an it, you could, but take the whole thing like a grain of salt.Invite some friends over, leave your brain at the door, get a few beers and Chinese take-out and prepare yourself for a blast!",
            "review_date": "1999-08-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you take the facts out of this film, you gut it.",
            "content": "Fair Game is one of those films that teaches you things you never realised were true until it happened on screen. Things like this:Explosions that blow up a mansion, and send someone flying into the water never leave a mark on that person. But they will have blood on their clothes, irregardless.Teams of expert assassins can be beaten by one cop.It's not humanly possible for a bad guy to kill someone without using a one-liner first. This may explain why they don't feel any remorse.Cars blow up on impact, regardless of where the impact is and what the impact is with. Unless of course our hero is in the car, in which case, it just catches fire.Perfect looking fake IDs aren't necessarily done with the use of any computers.Letters that look like 3s, but aren't, are found by typing in '3' into the computer.Employees of small stores swear freely and loudly while on the phone in the store.Continuity is not important. It can easily flow from late afternoon, before the sun starts to set at all, to well after the sun has set, in a matter of seconds.Choppers can't be heard over bad sex scene music and Cindy Crawford's disinterested moaning.Cops leave the safety off when they put their gun away.Trained assassins watch their target do a random Baldwin brother instead of actually doing their job.A bomb counts down from 2 minutes 57 seconds to 1 minute 47 seconds in just under 15 seconds. That bomb then proceeds to blow up everything except the room the bomb is located in.",
            "review_date": "2006-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ok...So maybe models are wooden, lifeless creatures...",
            "content": "I like Cindy Crawford. I really do. I respect the class she has maintained in an often classless fashion and modeling industry.  But some people should stick to what they know.Cindy, my God! In this movie, you were just in your lovely apartment overlooking the water. Your apartment is then blown up, you are blown off the balcony into the water, your cat is toast and all your possessions are gone. Oh, and by the way, a bunch of very bad people are now trying to shoot you dead. You get out of the cold water, run for your life and get taken to a safe house where the 2nd rate Baldwin asks you `How do you feel?' And Cindy says with the intensity of a heroin  addict, `Like my life just exploded. What is this place, Motel Hell?' She said it like she was reading the phone book! A real actress would have been looking at the cop like he was nuts! And she would have delivered the lines accordingly. It got worse.Did you see at the very first scene in the movie where Cindy's character is jogging and gets shot? Did you notice her slowing down to hit her mark and wait for the shot? I've never heard or seen anyone more stilted and lifeless except for a really bored telemarketer.The writing was just BAD, and the movie was just about look how good Cindy looks after being dumped in water and having no shower. Notice her lips still had color? Did they have the long-lasting stuff back then?\nLuckily it wasn't the kind of bad where you can't sit and laugh at it. You can sit and laugh at this one. In fact, you don't have a choice.",
            "review_date": "2003-07-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Could have been anybody in this unoriginal bit of tosh",
            "content": "When a civil lawyer is almost killed twice, cop Kirkpatrick is assigned to protect her.  Things go from bad to worse when his partners are killed and Kirkpatrick goes on the run with Kate, unsure of who to trust.  Meanwhile the assassins are using powerful computer technology to locate them using phones, credit cards etc.  Kirkpatrick and Kate must work out who is trying to kill them and stop them before they are caught.This was Cindy Crawford's big vehicle to turn her from a model into a movie star - and it didn't quite work.  The story is one of the main problems. Now action films never really need that good a plot, but this needed a much better reason than it had for the criminals trying to kill Kate - when you find out what it is it's all a bit silly and killing her wouldn't actually have solved it!  Also the criminals spend the whole movie in the back of two landrovers with a couple of laptops that seem to be able to tap into every system on earth - yet they still can't manage to trap them.  This system is advanced enough to tap calls (when the plot wants) or just locate a phone (when the plot wants), if nothing else then they just have someone say \"they're not on the highway so they must be on a freight train\" - and of course they are.  It really is pretty thin even by action movie standards. The daftness is shown by the way that they try everything to kill her (blow up her house, shoot her on the street, car chases in public etc) and it's obvious that they don't care who sees - but when they eventually catch her, rather than kill her they kidnap her and keep her alive (don't know why) just so Billy Baldwin has time to come rescue her!The action itself is quite good - however the opening scene where a jogging Crawford is just missed by a bullet is the most tense scene in it.  The rest is the usual - people just making it out of explosions, diving gun-play, fancy car chases etc.  People are killed, things blow up and the two leads just walk though it, emotionally unscathed.  The other \"action\" is also there (to keep all Crawford's teenage fans happy) - in a unheated freight train, in the middle of the night, on the hood of a car - then they decide to do it!  It's all soft focus, bit of breast, bit of ass etc and the way it is forced into the action shows that they wanted to show a bit of skin but weren't sure where to get it in!Considering it's Crawford's film, she mostly has second billing to Baldwin as she doesn't have much to do except play the \"woman-in-peril\" card for all she's worth.  Billy Baldwin (the least needed of the brothers) has a bigger role but isn't much of an action hero - during action scenes he has his face screwed up like a psycho and outside of that all he does is shout.  Steven Berkoff does his best \"Beverly Hills Cop\" bad guy but just hams it up in a thankless role.  To show you how wrong this film is in terms of performances - Crawford is given the lead while a really good actress like Salma Hayek is given a tiny role as Kirkpatrick's quickly forgotten girlfriend.Overall some good explosions but don't you want more than that?  If you don't then this probably has enough guns, mayhem and nudity to keep you happy for 90 minutes.",
            "review_date": "2002-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Give this movie some gratitude!",
            "content": "I don't why \"Fair Game\" got such a harsh critique. I thought the cast choices were great. Billy Baldwin playing a tough cop, and Cindy Crawford as a lawyer. This movie was action-packed, and a thrill-seeker as well. I liked the train scene when the cop and lawyer got on, and the Caddy sacrificed itself at the pole. Going after the KGB is an extreme task, especially when these agents are extreme themselves. Killing everyone in their path, targeting anyone they first lay eyes on. At first, both Kate(Crawford) and Max(Baldwin) don't get along too well. But when the rogue KGB starts targeting people, and killing Kate's sister, that's when the two began to trust one another. Some scenes remind me of \"The Gauntlet\" and \"The Joshua Tree\". The action of the movie is just right, I don't see what the big deal was. Perhaps when a model decides to go into acting, expect a lot of typecasting in the making. I don't see it that way, Cindy Crawford did fine there. I don't care what the critics say, this movie was fine, not in the theaters, but at home, it's a hit! 3 out of 5 stars!",
            "review_date": "2007-10-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pain has a new name: Fair Game",
            "content": "This is bad, very bad.  It must have sounded like a good idea at the time: \"Die Hard With Legal Mumbo-Jumbo\" with a twist: we'll have a sexy model as the star.Erm, it sounds good on paper, and perhaps it would have been a good idea if they hadn't screwed the damn thing up by giving us a weak script, even weaker plot, weaker villians and then give up on the sexy model as John McClane and turn her into a damsel in distress.It almost feels like Producer, Joel Silver is satirizing or parodying himself in the constant need for set-piece action after set-piece action strung together on the weakest thing to ever grace the screen.Everything that hits something explodes, cars hit telegraph poles and explode violently, tree's that are in the way explode even more violently...its almost too much to take in.  I know action is what was driving hollywood around the early 90s - but this is just TOO much.Anyway, the film pretty much nose-dives when Crawford - who looks stunning - turns into a damsel in distress with Baldwin acting like he's painting by numbers - just doing the thing because either Stallone dropped out or because of the money.Not even the \"sex-scenes\" can save this terrible affair.  Not even Berkov, now type-cast as Russian bad guys, can save it.  Everything hurts...everything.  The end explosion looks kinda cool, but it can't mask the fact that this film is flimsy at best - and at worst?  Well, I just don't wanna think about that.They could have made it a lot better than this trash.  A die-hard with a woman as the hero could have been done a lot better.  Its a shame with the buckloads of money they wasted on this trash seems to have gone onto Crawford's make-up.My Rating: 0/10",
            "review_date": "2000-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Where Are They!!",
            "content": "I was fueling at the truck stop in Florida,chatting with the hog hauler fueling at the pump next to me. He was telling me about the time he had pulled off the road to take his 8 hour break,when a bunch of Russians pulled him out of his truck at gun point. Made him open his trailer,all the time yelling \"Where are they\". One had a g.p.s. locater device. He makes his way thru the hogs and stops about half way through the trailer. Stops ,reaches down through the hop crap, and picks up a cell phone. Im thinking,\"Some truck drivers have nothing better to do but think up wild stories to tell his fellow truckers.\" Cindy Crawford,Selma Hayek,Johann Carlo, and Jenette Goldstein are hot!! ---One Truck Drivers Opinion--- erldwgstruckermovies.com",
            "review_date": "2011-07-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad. Really, really bad.",
            "content": "Leggy lawyer Cindy Crawford is attempting to get sleazy lawyer Dan Hedaya to admit that his client owns a certain boat.Crawford shows Hedaya a picture of a boat. \"Never heard of the *Tortuga*,\" he  says.\"I didn't say the name,\" says Crawford.Ha! Gotcha! Isn't she clever? Even though there was no reason--NONE--for Hedaya to say the name of the boat, he said it anyway. I mean, it doesn't even make any *sense* for him to say the name of the boat at this point. In the situation,  it's virtually a *non sequitur*.But he said it anyway! That's just how brilliant Ms. Crawford's character is.And you know what? That's only a minor idiocy, like having Billy Baldwin claim that he's been on hold for 20 minutes when we can clearly hear that he's  at the very beginning (\"press 1, press 2\") of one of those automated phone systems.It gets worse...oh, so much worse. I mean, Cindy Crawford plays a brilliant lawyer, for God's sake!Then there's the \"infrared scope\" scene, the stupidity of which is beyond my descriptive powers.And am I wrong, or was \"They did it on computers!\" a really lame explanation for all this, even back in 1995?And I have given up trying to understand how the bad guy's plan is supposed to  work--I mean, what is killing one lawyer supposed to accomplish? Is the idea that she's the only lawyer in Florida who could get a judge to enforce an outstanding court order? Or is she supposed not to have put any of this information in her law firm's files? Or mentioned it to anyone else? Or filed  any court papers? Or employed a single clerk or investigator on the case? You  know, I really don't think these guys understand how the world works.And since their plan is going to be completed in a very short time anyway, does  it even matter? Wouldn't it have been smarter just to have sleazy lawyer Hedaya stall for a couple of days if necessary? It just doesn't make any sense!And I absolutely refuse, for the sake of my own mental health, to even go into this \"federal maritime court\" nonsense.It comes as no surprise to learn that idiot screenwriter Charlie Fletcher has only one other credit. Whether this is because he's too stupid even to gain employment in Hollywood, or smart enough to have changed his name, I don't know.Idiot director Andrew Sipes (whose cinema career seems to have come to an abrupt and deserved end after he helmed this, his one and only movie) tries to add \"excitement\" to the first couple of \"action\" scenes by doing flash pans accompanied by \"SHOOM!\" noises, although he abandons this after the first couple  of scenes and moves on to the even more clichéd slow-motion.If anyone had been stupid enough to give Ed Wood a $50-million-dollar budget (and if anyone had been, it would have been idiot producer Joel Silver), this is  the movie he would have made. If you enjoy repeatedly shouting \"Oh, come ON!\" at the screen, then you'll like this movie. If you want intelligent scripting, competent acting, exciting action, and skillful direction, look elsewhere.",
            "review_date": "2002-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Foolish,laughable Hollywood actioner",
            "content": "Supermodel Cindy Crawford launches her star movie career,and promptly crashes it in FAIR GAME.The premise to begin with is heavily far-fetched as we're supposed to accept La Crawford as a high-flying lawyer in trouble with ex-KGB baddies intending to exterminate her at all cost over some nonsense concerning a boat belonging to an associate,while would-be macho cop Billy Baldwin is on hand to protect our Cindy when the ensuing mayhem starts.And what mayhem! The above is the basic plot line,thin even for a routine one-hour TV episode.Perhaps unconsciously realising this,the film's makers decide to pad it out with as much absurd,ludicrous and hilariously over-the-top action as possible,with barely the slightest concern for intelligence,wit,or logical plot development.Crawford herself looks predictably lovely in various states of skimpy dress or undress,but this is the only positive aspect of her performance;when it comes to delivering the admittedly hackneyed dialogue,she struggles terribly and embarrasses herself,as mostly does her leading man Baldwin.Steven Berkoff is mildly enjoyable in yet another variation on his innumerable mad Soviet-style villains,but his hammy,bellowing visage becomes tiresome.The film's only assured performance comes in a cameo from Salma Hayek,as a former beau of Baldwin's.Ms Hayek would've been a better choice than Crawford as the leading lady;she is criminally wasted in this tiny role.Cindy C as a lawyer broke credulity barely as the film started;if anything,it goes even more downhill from there as Berkoff and Co.(thanks to sophisticated computer tracking devices) are remarkably clever at tracking the exact point and time wherever Cindy and Billy happen to be,but despite the couple being armed with little more than a token gun and their fists (though in Cindy's case,her breasts,which are teasingly present underneath tight-fitting t-shirts),they are hopelessly inept at bumping off their prey,despite seemingly having the equivalent of the entire world's military hardware to hurl at them! Aside from the odd scratch here and there and mussed-up hair,the hero and heroine amazingly survive their ordeal unscathed.With such dumbness present,FAIR GAME could've been enjoyed as a no-brain action thriller had there been any sort of chemistry with the two leads and better dialogue.Since it fails dismally on most of these and other points,it is barely watchable,and Cindy Crawford has not starred in any film since.She has however,performed adequately in supporting roles (her appearance on US sitcom THIRD ROCK FROM THE SUN received unexpected praise in some quarters) in other films and TV programmes.Cindy Crawford is a great supermodel,an acceptable small-part actress,but not a leading actress.Perhaps even Cindy realises that now.Rating:2 and a half out of 10.",
            "review_date": "2007-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's like painting a huge bullseye on your......",
            "content": "Kate McQuean suddenly finds herself targeted for death by a crack team of KGB assassins, because she had something to do with Dan Hedaya and his boat, and they have the technology to access every aspect of her life.Fortunately, maverick cop Max Kirkpatrick is there to protect her, because he's just broken up with Salma Hayek who looks good, but sheesh, she puts in an awful performance.Together, amidst violence, death, and destruction, they must stay alive and stop them. In the meantime, Max and Kate find themselves falling for each other, because we all know that most of us saw this to see Crawford's talents.....And if you say 'no' to the last line of that paragraph, and you are a male around the ages of 35-42, you my friend are a blatant liar.I went to see it because of this, i'm not going to lie, but the fact that it's produced by the king of the eighties action movie, and has it's roots buried deep in the eighties, it doesn't really let you down in the action scenes either.It's based on the same source material that was used for the Stallone movie Cobra, but the two films couldn't be further apart. Watching Cobra now, it comes of as more of a horror movie than your atypical Stallone vehicle, while this is your more generic action film, and there is one scene where Baldwiin literally jumps in the air and fires his gun while landing in the water.It looks so stupid, but it fits so well in this movie.It's also the kind of film where characters only need to look at something and it will explode. For example, there is a scene in a car park where our two heroes are duped by the KGB, where a car just literally blows up for no reason at all, and this is the same scene where his partner is killed, but it's played for laughs because his wig falls off, and it's not even supposed to be intentionally funny.Baldwin is okay, his agent obviously thought that this would make his star shine, but when watching the film, during key action sequences, Baldwin has a look on his face like he has just sat on a chair with a drawing pin in it.There's not much to say about Crawford, she looks really good, but there is a reason why she hasn't been in a leading role since.Berkoff is good but he does this stuff in his sleep, and he looks all the more fed up for it.If you are a fan of eighties action, where all you need is big explosions and silly one liners, then this is for you.It's the nineties Action Jackson.",
            "review_date": "2016-04-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beauty Is Not Enough",
            "content": "I am in love with Cindy Crawford. In common, I would have thought, with just about every heterosexual male old enough to remember the Golden Age of the Supermodel in the nineties. It's not just that Cindy is beautiful- although she must count as one of the loveliest women of her generation- but also that she possesses a grace and dignity which set her apart from certain other supermodels who are notable less for their modelling work than for their tempestuous sex lives, for their temper tantrums and for their addiction to alcohol, cocaine and blood diamonds. No names mentioned.Blessed with the looks of a Hollywood goddess, Cindy evidently thought she would try to become one. She was not the only supermodel to have had this idea in the mid-nineties; Elle Macpherson and Naomi Campbell also tried their hand at acting around the same time. They, however, contented themselves with supporting roles (such as Elle's appearance as Blanche Ingram in Zeffirelli's version of \"Jane Eyre\"), whereas in \"Fair Game\" Cindy finds herself cast in a leading role. She stars as Kate McQuean, a Florida lawyer who inadvertently falls foul of the Russian mafia. As Kate has a civil law practice concentrating on divorce and no involvement with criminal law enforcement, exactly what she has done to upset them would take too long to explain here; suffice it to say that they want her dead. She is therefore forced to go on the run with Max Kirkpatrick, the police officer charged with protecting her.Contrary to a widely held belief, beauty alone is not enough to make you a film star. At any given time there must be hundreds, if not thousands, of aspiring young wannabes in Hollywood, nearly all of them strikingly attractive. The few who make it to the top must, therefore, have something more than their beauty to set them apart from their less successful rivals, and that something is normally a modicum of real talent. (Although in a few cases an influential or well-connected husband or boyfriend will suffice, thus accounting for the fact that some attractive but genuinely talentless actresses have enjoyed quite lengthy careers at the top. Again, no names mentioned).Much as I love Cindy, I have to admit that genuine talent is something she lacks, at least as far as acting is concerned. One critic said of this film that \"One could scavenge the thesaurus to find synonyms for 'awkward' to describe Crawford's performance,\" although actually \"awkward\" would be perhaps a milder criticism than many people would use. The lovely Cindy, I'm afraid, spends the entire film looking as though she has no idea what she is doing. She was nominated for a Worst Actress Razzie, but lost out to Elizabeth Berkeley for her role in \"Showgirls\". (Actually, whatever one might think about the merits of Paul Verhoeven's film, Berkeley's performance is a lot more animated and lively than Crawford's).One cannot, however, place the blame for the failure of this film on Cindy alone, or even on the standards of acting alone. (William Baldwin is not as wooden as his co-star, but even so he still, on this evidence, has a lot to do before he can live down the accusation that he is not even the best actor in his family). The film was made in 1995, several years after the fall of Communism in Eastern Europe, but Hollywood was still pursuing its own private cold war against all things Russian.The old cliché of Russians as villainous communists was simply replaced by a new cliché of Russians as villainous fascists or villainous gangsters; the main baddie here is a former Colonel in the KGB. (See also \"Crimson Tide\", \"GoldenEye\", \"The Peacemaker\", \"Air Force One\", etc.) This new cliché did not end with the nineties. By chance \"Fair Game\" was shown on British television on the same evening as \"Salt\", made as recently as 2010. Although \"Salt\" is a better film than \"Fair Game\", it still relies on the sort of Russophobic prejudices which should have come down with the Berlin Wall nearly a quarter of a century ago. Salt, however, does have a decent plot- indeed, a rather ingenious one- something which \"Fair Game\" totally lacks. What storyline it possesses is little more than an excuse for repeated scenes of gunfire, explosions, and Kate and Max running for their lives pursued by the baddies, all leading up to a totally predictable ending. It is hardly surprising that Cindy did not go on to a major film career. 3/10",
            "review_date": "2012-05-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fair Game is 90's Hollywood action in a nutshell: dumb, stupid, and actually very entertaining.",
            "content": "When KGB assassins target the life of Attorney Kate McQuean (Crawford) because of her associations with a mysterious boat, only one man can come to her rescue: Marion \"Cobra\" Cobretti -- er...Max Kirkpatrick (Baldwin)! According to the movie's tagline, he's a Cop on the Edge - or COTE, as we call them. With the baddies using all kinds of high tech (for 1995) gizmos to track their whereabouts, Max and Kate will always have to stay one step ahead of the highly-mobile evildoers. If that means a few car chases, stunts, shooting and...romance...then so be it. With nowhere to run and no one to trust, will our heroes be FAIR GAME for the bad guys? Hey, if we wanted to see movies that are Cobra (1986) without being Cobra, we'd probably just watch Black Cobra (1987), starring Fred Williamson. Because it's based on the same Paula Gosling novel that spawned one of our all-time favorite movies, Fair Game seemed very familiar to us. But instead of Stallone cutting pizza with scissors and Brigitte Nielsen posing with robots, we have one of the Baldwins and Cindy Crawford. Why does Hollywood always do this? What, Cobra wasn't good enough for them? They thought that they could improve upon perfection by haughtily going back to the original title, getting a big budget and a glossy look and no one would notice? Now, while this may be a needless run-through of Cobra, it's not without some charm of its own, but we felt we should get that out there as our opening salvo.As we've said before, there are many kinds of dumb when it comes to movies - dumb is not one size fits all. Thankfully, despite (or maybe because of) its retread status, Fair Game is very dumb; sort of a cross between \"Hollywood Dumb\" and \"90's Dumb\". The key question is: is it entertaining? And the answer is yes. The clichés are so broad and the plot so paint-by-numbers, I'm surprised the script wasn't written with a paintbrush and printed on an easel. It doesn't seem like there was ever an attempt to make it any other way. The dialogue may be groan-inducing, but the action scenes are solid and well-executed, if a bit on the silly side (Baldwin flying sideways while shooting).Maybe out of a guilty conscience, the movie can't seem to let go of its Stallone connections - at one point, someone calls Baldwin \"Sly\", even though his name is Max. Baldwin smokes cigars, clearly a reference to the fact that Marion Cobretti said smoking is bad for your health. In Cobra, Brigitte Nielsen was a model, so naturally that led to the casting of Cindy Crawford as her replacement. And this may be a stretch, but the whole 90's Dumb/Hollywood Dumb connection comes through clear as day when you look at the similarities between this and Stallone's The Specialist (1994). The natural humor of Cobra is replaced with \"humor set-pieces\"...but is that what kept this flying off video store shelves in the 90's? As for Cindy Crawford, hey, she gave it a try. If you're looking for us to criticize a non-actor for having a flat affect when speaking, you won't find that here. Lord knows we're used to seeing that around these parts. The fact that she's a lawyer in the movie is a bit of a leap; perhaps she could have been a model working at night for her law degree, or maybe a paralegal. But Crawford as a full-on lawyer was a bit much...yes, there is some light Crawford nudity, but is it really her? With all the 90's tech on display, it's easy to get distracted. The baddies know where to find her because they hack into her pizza account. HER PIZZA ACCOUNT. Well, if there's any takeaway from this movie it's this: don't have an online account with any local pizza joint. Instructive.Fair Game is 90's Hollywood action in a nutshell: dumb, stupid, and actually very entertaining. Fascinatingly, this is director Andrew Sipes's only directorial effort to date. Maybe he got depressed because he tried to out-Cobra Cobra, didn't do it, then gave up entirely. It may have been Fair Game for the critics, but who cares? This site is all about the fans, and if you see it on cable or find it cheap on DVD, check it out. You could do a LOT worse.",
            "review_date": "2016-05-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fascinating",
            "content": "This movie basically blows.  But, it's fascinating to watch just because it's so bad.  I find myself not able to turn the station when I stumble across it.The acting is terrible, the plot is terrible.  There are too many goofs to count.  It just goes to show you it does not require a great script or even a great idea to make a movie.",
            "review_date": "2000-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cindy Crawford can walk and talk",
            "content": "Miami police detective Max Kirkpatrick (William Baldwin) is dumped by his angry ex Rita (Salma Hayek). Civil lawyer Kate McQuean (Cindy Crawford) gets nicked by a stray bullet and gets interviewed by Max. Kate uses a maritime law loophole to seize a freighter in a divorce case. The problem is that it's owned by criminal Emilio Juantorena where ex-KGB Colonel Ilya Pavel Kazak and his Russian team operate their high-tech criminal enterprises. They blow up Kate's home. She survives and given police protection. When they attack again, Max escapes with Kate.The plot is really basic and is only an excuse for most of the movie to be a chase. Everybody is piling on to make fun of Cindy Crawford's acting. I've seen worst. For a model, her acting is passable. The movie is simply asking too much from her to be the lead actress. She doesn't really act as much as she can walk and talk. I actually like her when she's punching Max in the face but then the movie forces them to make out in the next moment. There are major problems but most of it is in the script. There is lots of action and explosions to cover up any actual acting in the movie. If anything, it's too overloaded with action and makes this a laughable mess.",
            "review_date": "2016-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Are you Serious?",
            "content": "This was by far one of the worst films ever made. Money definitely should have been spent on some acting lessons. The plot was needing of well ANYTHING and there was no chemistry between the actors. There was a lot of things being blown up\u0085 unfortunately none of them was the film itself. Cindy Crawford is of course a beautiful center piece but her acting is so strained there is no emotional connection with her acting partners or with the audience. Baldwin also bombed in having any kind of real or believable connection with his scene partners. I actually walked out of this movie because it was so painful. Some really good films would be Pierce Brosnan and Rene Russo in the \"Thomas Crown Affair\" or a more comical film like \"True Lies\"",
            "review_date": "2006-07-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "it's an action movie, and the majority of action movies are straightforward so why all these bad critics",
            "content": "i actually enjoyed this film, we know cindy Crawford isn't the academy award actor, but simply this movie had an amazing ambiance to it, the Miami setting, the score of mark mancina simply amazing let's you get involved, the cinematography was good, bad script and bad plots doesn't mean the viewer doesn't enjoy the movie, it doesn't have to be that bad script makes a bad movie, these types of films are for fun, entertainment, it doesn't want to be serious more than it has to be, i recommend it for all action lovers, this is the same as Armageddon,deep impact,the specialist, these movies are for fun, not every movie has to have a strong plot.",
            "review_date": "2011-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fair Game is a 'fair' movie",
            "content": "Fair Game has been justly maligned for its bad plot arcs and often absurd dialogue, especially from the head Russian mobster, but the movie also has some positive attributes. It has nicely choreographed stunts and Billy Baldwin and the gorgeous Cindy Crawford make for a good hero and damsel in distress, respectively. It would be interesting to see what they could do with a better screenplay.  All in all, this movie is passable for an hour and half of entertainment, 5.5/10.",
            "review_date": "2003-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good-natured dumb action flick.",
            "content": "Is Cindy Crawford really supposed to be staggeringly beautiful? I mean, she's okay, with her pointy chin and beauty spot, but is she any more attractive than, say, Madeleine Stowe, Sean Young, or Jennifer Connolly? Crawford is taller than the others, true. She could be on an all-girl's Olympic basketball team. But it would be hard to rank order the beauty parade that's been on screen lately. When you get so close to the top it becomes a matter of stylistic choice, almost arbitrary.There's another woman in this movie, a homely middle-aged KGB agent who demolishes men with a single kick to the head. It could be argued that a woman with such a talent for meting out punishment might be a more exciting date than some marshmallow ex-model.Anyway, Crawford, the ex-model at hand, isn't bad. She has legs the length of a giraffe's and she takes two showers at the beginning of the movie and changes her T shirt in front of the camera once. I don't mean to be too critical of her appearance.It's no wonder that her bare midriff prompts the goggle-eyed Baldwin to put a cigar in his mouth and try to light it. I take this to be symbolism although, to be sure, \"sometimes a cigar is just a cigar.\" But then she cozzens some computer nerd so much that he winds up \"fiddling with my joystick.\" Can a joystick sometimes just be a joystick too? Of course she can't act but we can't count that as a demerit because nobody else in the movie can act either, so the absence of skill on her part is hardly noticeable. Her performance though does put on display at least one of her attractive features, in addition to the other two, and that is an endearing lisp. \"Pizza\" comes out \"PEET-tha.\" Kind of nice. Gives her a vulnerable quality, you know? Speaking of her vulnerability brings up the question of the plot, alas. See -- these ex-KGB agents try to murder her in every way possible -- shooting, blowing up her house, shooting yet again, and again. Then, towards the end, they decide she can't be killed but rather she must be interrogated. End of discussion of plot.I found myself wishing the heavies weren't all ex-Russian KGB agents because the movie was shot, after all, in 1994, five years after the collapse of the USSR, which either makes the villains out of date or the screenwriters unimaginative in their search for heavies. Maybe both.It doesn't matter really, except that there are some people of an impressionable age who might be tempted to take this cartoon as a serious reflection of reality. Their minds might be warped enough by exposure to these stereotypes that they grow up imagining all Russians have faces with the general contours and texture of potatoes. The heavies all scowl and sneer and speak with one or another foreign accent. Was it Oliver Cromwell who said, \"Take me for what I am, warts and all\"? Makeup has given the chief heavy a prominent wart right in the middle of his forehead, like a third eye, I suppose so we don't mix him up with the others.These ex-Soviet Seals are something special. They are \"experts in electronics,\" the film tells us, but that doesn't do them justice. Their equipment has positively supernatural attributes. For instance, they use an infra-red heat sensor that can not only penetrate walls but can detect that the leading lady is wearing high heels as well. And their radio direction finder can \"triangulate\" a transmitter's position all by itself.Essentially the whole movie is one long chase. None of it makes too much sense. After Baldwin saves Crawford's life a dozen times over she suddenly turns on him angrily then runs away. Shortly afterward, aboard a freight train, they have a physical fight and then she immediately falls into his arms and they make love. Unfortunately it's one of those love-making scenes in which such arty effects as dappled spots of blue light move across patches of undifferentiated limbs, and it's interrupted by one of the agents who has a laser-sight-equipped weapon that plants a red circle on Baldwin's butt. At least Crawford notices this. I can understand why Baldwin might not have.There are some gags and would-be jokes and sassy lines sprinkled through this melange of explosions and shootings and slow-motion fireballs. It doesn't add up to much but it's so slam bang that I found it kind of fun. I really do wish we had some generic villain for these types of movies though. Those impressionable minds -- the ones that can't remember the difference between Russia and the Soviet Union -- worry me at times.",
            "review_date": "2005-05-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very good Joel Silver flick.",
            "content": "This review contains extra bits of the plot! The heroine, played by Cindy Crawford as Miss Mcqueen is shot on Orlando Drive, while jogging. A cop, played by William Baldwin who is supposed to be Sergeant Kirkpatrick, is publicly humiliated by his girlfriend (played by Salmek Hayek), in a police station, before he has to interview Cindy Crawford. She goes home after a quick trip back to the office and just when Kirkpatrick shows up to get something signed, her house gets blown up by the Russians. This is when Steven Berkoff steps in to attack Baldwin and Crawford. A chase ensues because through a computer, they can track the couple's every movement. The baddies kill two police cops at a safehouse, several f.b.i. agents, bash two computer salesmen, and generally create mayhem. In the end, Crawford gets captured, and Baldwin comes to the save the day. The ship explodes with the remainder of the baddies, including Berkoff and that wraps up the film. It is quite a short film, with the British version lasting nearly an hour and a half. It also plays in widescreen and looks like a good but dud film of that era. If you like action, you will like this.",
            "review_date": "2005-05-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "high intensity fun",
            "content": "i fail to see why this movie has such a low rating on this site(3.7/10).and i also seem to remember critics blasting it.again,i fail to see why.for me,Fair game is an intense,exciting chase movie.so what if it's generic and not that original.to me,it's more about what you do with the material.in this case,the filmmakers made an entertaining movie.it even had some funny one liners.and the stakes in this movie are a bit higher.the bad guys are not your typical bad guys.they're smart and deadly and have no problem killing people.William Baldwin plays Max,a cop who must protect Kate,(Cindy Crawford)a high powered attorney who has angered the wrong people.from this point,the movie is basically a high intensity chase down to the wire.William Baldwin does a good job,but that's not surprising.Cindy Crawford,not having acted before,did a fine job as well.she was i think the brunt of the criticism of this movie,and undeservedly.there are many actresses out there who are much worse than she is in this film.unfortunately her acting career ended before it began thanks to unfair critics and movie goers.if i were a filmmaker,i would cast her in a film,but then i saw potential where almost nobody else does.but that just shows how shortsighted people are.for me, Fair Game is easily an 8/10",
            "review_date": "2007-08-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie was terrible.",
            "content": "The plot was stupid and the acting was so bad.  Cindy Crawford can absolutely not act.  And the movie didn't even have any decent nude scenes. If the people responsible for this movie are going to subject us to such garbage they can at least throw in some decent nudity so that the movie won't be a total loss.",
            "review_date": "2002-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"She's using her credit card again. Typical Americans.\"",
            "content": "Garbage thriller notable only for the brief nudity of star Cindy Crawford. You kids today won't remember but this was a pretty big deal at the time among teenage boys. It's pretty tame by today's standards I guess. The movie itself is some thrown together by-the-numbers story about a cop (the always slimy William Baldwin) protecting a lawyer (Crawford) from a Russian out to kill her for a pretty stupid reason. If you're not interested in Crawford's looks there really is nothing to recommend about this. If you are interested, Cindy is certainly gorgeous throughout the picture, despite her limited acting ability. If you insist upon watching this I suggest muting it and keeping your free hand on the fast-forward button.",
            "review_date": "2015-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Did a teenager write the script for this?!",
            "content": "No, a teenager couldn't have written the script for this, because a child in preschool could have done a better job! Quite possibly the worst movie I've seen this year with the exception of \"1941\", I was shocked by the stupidity of \"Fair Game\". I really think the author of the book this was based on must have just decided to make up a pointless story on a Sunday morning with only ridiculous gadgets, pointless violence, and a sexy woman to hold up this lemon.",
            "review_date": "1999-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A most dangerous game (To watch)",
            "content": "William Baldwin stars as a cop who protects a high powered attorney (Cindy Crawford in her career stopping performance!) from a group of terrorists who for some reason are looking to do our bubbleheaded attorney in. Believe it or not, Fair Game is actually an adaptation on a novel that inspired the underrated Cobra that was fascinating in it's right wing tendencies. Cobra had it's detractors and I think it rates at like 4.3 out of 10 so that goes to show you how B.movies tend to do in the IMDb polls. (Yet strangely, newer action movies pull of 5.5 ratings and anyone who thinks today's actioners are better than the 80's ones, are people I have no interest in knowing. This is a different rant for a different time.) Anyway Fair Game is quite possibly the Alone In The Dark of the 1990's. A laughable bomb which has Billy Baldwin (They could have at least given us Daniel!) at one point sighted with a rifle laser beam on his ass crack. Not since the The Punisher have we been treated to such gratuitous hairy man's ass and at least Dolph Lundgren had the decency to never show his ass again in a different movie. Fair Game plays less like an action flick and more like an ego trip for Cindy Crawford and Billy Baldwin. I was afraid that this wouldn't be as ridiculous as Cobra. I also feared that it would be bald on political statements. I was however wrong. Fair Game is equally as ridiculous as Cobra and it also has a political message. One that includes the idea that Crawford could actually make it into law school and second that it is important for sexy attorneys to take showers at regular intervals. Yes indeed. The reason Fair Game is so bad is it because it represents what is wrong with action movies as it comes from the \"Bigger is better\" school and although the explosions and action stock come from the assembly line, I think it is more important that we acknowledge that at one time there was a movie that said, not only can Cindy Crawford act but she can also play an intellectual who is a damn good lawyer too! I would say that Cindy Crawford is the worst actress to ever come from the modeling field but I can't because she is a notch above Anna Nicole Smith and one below Bo Derek. As for me I was laughing through out. Although I kind of feel sorry for the author, I never read the novel but i'm guessing this abortion of a movie won't be getting people out there to read the book. And they wonder why today's youth doesn't read anymore! 1/2* Out of 4-(Awful)Note:Someone pointed out that indeed it was a woman not a man who wrote the novel.",
            "review_date": "2006-09-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cindy Crawford is no Arnold Schwarzenegger",
            "content": "You would think that combining a generic action movie with one of the most beautiful women in the world would be a foolproof formula. Have a few people get shot, blow something up real good and make Cindy Crawford take her top off. What could possibly go wrong? Well, if you watch Fair Game you'll know the answer to that question is\u0085so very, very much. I've seen coloring books better written than this script. I've witnessed better acting jobs from cigar store Indians. And I've had fever dreams that made more logical sense than this movie.The long and the short of this paint-by-numbers story is that Miami lawyer Katherine McQueen (Cindy Crawford) invokes a little know aspect of maritime law that throws a monkey wrench into the plans of some former KBG agents to steal the ludicrous sum of 957 million dollars. They try and kill Katherine, sending her into the protective arms and slicked back hairdo of detective Max Kirkpatrick (William Baldwin). Unable to get help from other cops because of the ex-KGB agents improbable skill at impersonating law enforcement, Katherine and Max are forced to flee on their own by car and train before everything winds up on a boat off the Florida coast, where the bad guy manages to get both blown up and drowned while Katherine and Max escape a fireball by jumping in slow motion. Yeah, it's that kind of film.To call Fair Game trash would be an insult to used tissues and half-eaten cinnamon buns. It's predictable, ridiculous and stupid, frequently all at once. Crawford shows all the acting ability of a seasick sea slug. The most entertaining thing about the whole movie is comparing the amateur bad acting of Crawford with the professional bad acting of William Baldwin, who conclusively proves here that he's the least talented of all the Baldwin brothers. In fact, watching this will make you suspect Baldwin was actually adopted and just had plastic surgery so he'd resemble the others. When you make Daniel Baldwin look like a master thespian, you should really find another line of work.The only possible reason anyone could ever have for renting this DVD is if you enjoy making fun of truly terrible films. From Crawford's breasts having the power to cloud men's minds to Salma Hayek as Max's inexplicable ex-girlfriend to Christopher McDonald playing Max's lieutenant like he has a lit blowtorch shoved up his ass, it's hard not to laugh at much of this crap. Fair Game is such a poorly contrived disaster that it almost morphs into a parody of bad action flicks.When Fair Game was produced, Crawford was still one of the most famous and attractive women in the world, so you really can't blame anyone for trying to make a movie star out of her. She certainly was a no more unlikely candidate for cinema stardom than a mush mouthed bodybuilder from Austria. But this film demonstrates why Crawford's career on camera peaked with MTV's House of Style and the embarrassment it caused Crawford is probably one of the main things that pushed Tyra Banks away from movies and into reality TV. So that's another thing we can blame on this film.Unless you're planning to watch/mock it among friends, skip Fair Game.",
            "review_date": "2011-07-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The only \"Fair Game\" is the audience",
            "content": "The 'action' crowd - much like the 'horror' crowd - is an awfully forgiving bunch: probably due to expectations that are already pitifully low, they seem happy to get whatever they're handed, no matter how clichéd, derivative, and/or poorly acted/directed it may be. If they're men - particularly straight men - they often say, with puffed-up chest, that they don't care about \"crap\" like acting, writing, directing, or anything else. They just want good action and lots of it. Don't get me wrong: I like action flicks myself! But what's wrong with expecting something in the way of quality? It's probably far too late in the game to look forward to originality in the Action genre, so why is it too much to ask for, say, clever writing, inventive stunts, crackling-good dialogue, solid acting, and direction that doesn't look phoned-in? \"Fair Game\", essentially a remake of a painfully funny 1986 turkey, \"Cobra\", starring Sylvester Stallone and then-bride, hulking she-beast Brigitte Nielsen, tells the story of a beautiful lawyer and a studly cop being chased by baddies. Many people die and even more things blow up in the process. The cop is played by William Baldwin; the lawyer by model Cindy Crawford, in her acting debut. From the film's outset, they are at odds, but it doesn't require a Master's Degree to figure out they're going to get along JUST FINE before the end. This is one of those films where, in the midst of being chased endlessly by a ruthless band of Russian thieves, the two leads find time to disrobe and get intimate. Just like real life. It's also the type of film in which, no matter how brutally our leads get beaten, or how bruised and battered and bloodied they be, they somehow manage to look merely tousled and none worse for the wear. Just like real life. As for those Russian baddies, you KNOW they're bad because they ARE, after all, Russian, and in Hollywood you know what THAT means: one of them will be a steroid-riddled she-male (kind of like former WWE star, Joanie \"Chyna\" Laurer). That role this time belongs to Jenette Goldstein, best known as that fabulously butch soldier in \"Aliens\". In \"Fair Game\" you KNOW she's not to be messed with because: 1) she's outfitted in bulky black leather, 2) she speaks with a generic Eurotrash accent and says \"witty\" things like \"Let mama make it feel better!\" while beating up Baldwin, and, most importantly, 3) she's given a brutal haircut and has bright red lipstick slashed across her downturned mouth. It's like she's fresh from playing a warden in a women-in-prison flick! Alas, these camp moments provide the only levity in a pretty sad affair, made none the better by its stars, who share absolutely ZERO CHEMISTRY. Baldwin is his usual self: pretty. Cindy Crawford is also HER usual self: pretty. And therein might lie the problem: they're both stunningly pretty, which makes the action less-than-believable, somehow. (In fact, HE'S even prettier than SHE is!) Action stars should have a little roughness, if not overtly then around the edges. Runway-model beauty is fine for drama and romantic comedy but an action flick? It just doesn't seem to work, at least not here. It sure ain't helped by a hapless director who seems intent on pleasing both his stars by maintaining his stars' prettiness at all costs, even when the effect is downright comical. (As mentioned earlier, they come through fights, brawls, gunshots, whippings, you name it, with only the teensiest of scratches on maybe an arm but never - and I mean NEVER - on the face. Just like real life.) Baldwin has never really been much of an actor, and he often seems to have little, if any, chemistry with his female co-stars (perhaps because he's usually prettier than them?), but I suppose he tries his manful best to give a credible performance (or at least as credible as is possible with this movie). As for Crawford, well...bless her heart, she tries. She really, really tries. Unfortunately, as soon as she opens her mouth to say her first line, the truth becomes achingly obvious: she simply cannot act. You give the poor girl credit for trying, but let's face it: in what bizarre alternate universe would YOU believe Cindy Crawford to be a high-priced, amazingly successful lawyer? To make up for this and other mistakes, the makers decide to throw in explosions and gunshots almost at random, or whenever the tempo slows. They even manage to throw in some violence during a lovemaking scene (on a freight train, no less). Said lovemaking reaches the levels of \"The Specialist\" at its robotic best: she flashes her breast, he shows his posterior, and the lighting in the freight car goes all cool blue as they bump, grind, and gnash their teeth in imagined ecstasy. Then, suddenly, a gunman arrives to take care of our 'heroes'. However, said gunman is quite the gentleman because even though he has the clearest shot in the world, he waits patiently for Crawford to see him, pick up a conveniently placed gun, and shoot him. What a guy! In fact, MOST of the bad guys here do the same thing, again and again: run up to fire at their target, then pause while Baldwin or Crawford can shoot first. It's refreshing to see that even though they're Russian, they have such an incredible sense of manners! But who watches this stuff for manners, anyway? You want action and blowin' up and killin' and shootin'? You'll get it here. All the time. Even when there's no reason for it. You want Cindy Crawford in an ever-shrinking tank top? You get that, too. (Body-conscious female viewers might want to keep that in mind next time they're being chased by international killers: make sure to wear pre-shrunk tank tops.) But if it's fun you're after, look elsewhere. Goodness knows I wish I had!",
            "review_date": "2005-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An unfair game",
            "content": "Before I start the review, I would just like to point out that Fair Game is not entirely bad because of Cindy Crawford's performance. Her acting is one note and monotone, but that's not the real reason why the film is bad.The plot is so illogical it makes no sense at all. We are told that Crawford's character, Kate McQuean, is a Lawyer who has been marked for death by the KGB, the reason being they could lose their ship in a court case that McQuean is pursuing. This kind of story line would belong in a courtroom drama, not an action film. And why are the villains the KGB? This was 1995; the KGB was irrelevant by then. The film itself is one long chase, and concentrates more on action instead of paying attention to character detail, which is another of the film's failings.The action scenes are well-staged, and are the only good point to Fair Game. But there are certain questions raised; for a start, how could the villains use electronic equipment to track every move they make? Not to mention the use of a heat sensor, which can allow the villains to see everything they do (since when has such a thing ever existed?). And by the time the villains have finally captured McQuean, they are then instructed to 'keep the girl alive'; why? You've just spent the whole time trying to kill her, why not just get it done and out the way? Instead we have to watch the story get dragged out for longer. By this point, you'll be glad when it's all over.Only worth watching if you're curious about Cindy Crawford's acting debut.",
            "review_date": "2016-08-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not Bad But Could Be Better",
            "content": "Fair Game, a book written by Paula Gosling gets a reboot for the second time but with a different cast. Nine years before this movie, Cobra (1986) which starred Sylvester Stallone in an action packed film that was great to watch. In this film, the story is more or less the same except it has a totally different cast. This is not a horrible film but I feel that it could have used some more work.Starring in this film is William Baldwin, who earned his stardom in Backdraft (1991). Co-Starring with him is Cindy Crawford in her first feature film. Besides these two, I really didn't know any of the actors. However, Salma Hayek does appear in this movie but as a very minor, irrelevant character (unfortunately), she's actually pretty funny for the minutes she shows up. This movie is one whole big chase scene but most of it is entertaining. Sometimes it can get annoying because Baldwin and Crawford's characters are forced to argue with each other due to the screenplay. Then you have the moments where they actually cooperate and that's always a nice relief. There are also some scenes that have some comedy. I liked the part where Baldwin talks to the bad guys through a regular phone but not by directly calling them. When he does this, a store cashier gets involved in the conversation, I couldn't stop laughing.The action is good in this movie. There's plenty of big explosions; cars, houses, boats, you name it. For the musical score, Mark Mancina composed and conducted for the background of this film. It has an interesting beat that keeps the movie on its toes. I guess what sinks this movie is the plot. It just seems so weird how a small group of terrorists can do so much damage and get away with so little. Obviously this is not the greatest movie ever to hit the big screen but it can please action fans to a point because that is the strong element in this film.As the second adaptation to Gosling's book, other than Stallone's Cobra (1986), this film is mostly unrealistic because of how the plot was written up. All in all, it makes a good popcorn flick for when you just want to sit down and watch some random action movie; but that's about it.",
            "review_date": "2011-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Game Over Before It Starts.",
            "content": "A civil law attorney (Cindy Crawford) is chased by a crazed group of KGB operatives (led by Steven Berkoff, trying to rekindle his 1980s days of horrifying bad dudes). Now it is up to lucky detective William Baldwin to protect Crawford and save the day. Laughably over-the-top action dud that does its best to cover up its silliness by focusing on attempting to make Crawford a movie star. Like the production itself, it fails in its attempt. More proof that you cannot take popular icons and turn them into legitimate performers with suspect direction and a lackluster script. Watch for then-unknown beauty Salma Hayek in a small role. Turkey (0 stars out of 5).",
            "review_date": "2005-05-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Some fun entertainment",
            "content": "This movie was perhaps not the most accurate when it comes to effects, cars don't explode when they make contact with stationary objects, but isn't movies some entertainment? The movie caught on quite quickly, no slogging with getting to know characters just some prime action directly. Cindy isn't perhaps the most capable actress but she is fair to look at. I liked the movie, it tickled some laughs and gave my some entertaining moments. I rate this much higher than a lot of drama that seems to be the only thing people like these days. I might have things go another way if I where to shoot this movie, but the action was good, even though it was predictable sometimes.",
            "review_date": "2011-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the worst movies of the 90's!",
            "content": "This would have been one of the best comedies of 1995. Except for the fact that I don't think it was supposed to be a comedy. I think the reason Cindy Crawford was cast in this movie was because the producers were hoping that the audience would be so busy admiring her beauty that they wouldn't notice how bad the movie was.It's hard to find anything good to say about this movie. Thin plot, hyperactive editing, dumb dialogue, and lots of pointless violence. Not to mention atrocious acting, especially from Crawford. I think it's safe to say that she instantly killed her acting career with this movie. There were moments where I was laughing at the unintentional humor, but mostly I sat there with my jaw on the floor amazed at how awful this movie was.Cindy Crawford looks hot, but that's the only positive thing I can say about this film. If you ever find yourself having to choose between renting this movie and burning three bucks, I'd advise you to get the Bic lighter out.",
            "review_date": "1999-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolute rubbish",
            "content": "When I first saw this movie I practically hated it. It was little more than a try-hard action movie created to flaunt Cindy Crawford's apparently attractive body. Personally I think supermodels are way overrated, and though that may be attractive, they are far from being the goddesses that people treat them as. This movie, is simply little more than a vain attempt to introduce Crawford to the acting scene, and fortunately she did not stay. One may say that she is more than just a pretty face, but when it comes to acting, one should look in another area.Basically Crawford is a civil litigator who gets mixed up in a KGB plot to steal a lot of money, simply because she is using the divorce court to claim a ship that happens to be the KGB's base. She runs into a cop, played by Stephen Baldrin and inevitably they have sex and beat up the bad guys. The sex scene here is quite trashy, and in fact they get caught with their pants down.Personally this movie is little more than mindless pap. While it is okay to watch, it really goes little beyond that. The bad guys are interesting and use some nasty technology, but this is all lost on the fact that for all their skill and ability, a lawyer and a cop manage to beat them, and they don't even seem to break a sweat. This movie makes the KBG look like a bunch of bumbling idiots that couldn't steal a poster from the wall - and it isn't even a comedy.Personally, if you are bored, then watch it, but if you have better things to do, then it is best that you do them.",
            "review_date": "2012-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Highly enjoyable movie",
            "content": "If you are coming into this thinking it will be an erotic thriller based on the cover, you would be mistaken. This movie feels like it could be set in the Bad Boys universe and even has the guy who did the music in Bad Boys (Mark Mancina). Its a very fast paced movie with a great cast and is not to be taken too seriously. Sure there are some corny lines but if you like good mindless fun this is the movie for you.",
            "review_date": "2021-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Utterly braindead",
            "content": "I'm seriously surprised this movie cost fifty million dollars.  Who knows what they spent it on...The entire premise of the movie makes no sense.  The villain only needs two days to complete his so-called plan, yet he's worried about the lawyer having the boat seized... even if she could get a court order to have it seized immediately, the villain could just pull the boat out into international waters and nobody could seize it until it pulled into port.Action scenes I guess are exciting, despite the fact the make no sense whatsoever.  I love the scene where they're being fired on by people who can somehow manage to hit the windows but not the people inside nor anything vital to keepinbg the car running.  Apparently the same marksmen who were in \"Behind Enemy Lines.\"Even if you're just hoping to see Cindy Crawford naked, forget it.  One time she is it's so badly lit you can't see anything.  And likely it's just a body double anyway.On the plus side, is so stupid it's funny to watch.  Almost every scene here is good for a laugh, except for the ones that are actually supposed to be funny.",
            "review_date": "2003-07-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ridiculous",
            "content": "A terrible action movie. All possible clichés will appear on your screen. If someone has a fake ID William Baldwin comes with the brilliant line: \"they must have done that with computers.\" That probably says everything you need to know about this movie. Even the beautiful Cindy Crawford can't save this thing a little with her beauty. Her acting, as is Baldwin's, is terrible. One of the worst movies I have seen.",
            "review_date": "2003-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fair? Impossible!",
            "content": "Max Kirkpatrick (Bill Baldwin) is a kind of robocop: the bullets never touch him and in car-driving, or better car-jumping he must be the absolute best in the American police-corps.  I liked the scene in the underground-car-park, it is highly violent and it is the best scene of the movie.  KGB-Colonel Ilya Kazak (Steven Berkoff) has entrance to all classified documents of the FBI (?!), I do not believe that it is so easy to falsify a FBI-card, and certainly not when you show it to a policeman.  KGB-agents never use their ZZ-bullets in foreign countries as the laboratory-girl indicates.  It is impossible to track a visa-card with a simple computer.  The fight between the police-man and the KGB-woman: don't think that it is so easy to put a knife in somebody's body or to surprise them from behind and shoot them. And why does her comrade not have a bullet-proof vest?  The scenes in the train (a 10 for train-coordinator Art Miller!) are good but again I do not believe that car-train-jumping is so easy.  And Kate McQueen (Cindy Crawford)... yes she is nice to look at, but did you understand her involvement as a lawyer in this story?.",
            "review_date": "2002-08-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Should be called 'plot hole'",
            "content": "If there is a movie with more plot holes or a more inane plot than this one had, I really don't want to know about it! Actors could have been replaced by cardboards with printed images and I would not have known the difference. The adolescent shots of nudity and the less than viable plot almost made me gag. If only I had not been too tired to get up from the sofa and going to sleep instead, I would have been saved from a lot of groaning.(Spoilers!:) Plot holes: After finding out that the FBI agent was a fraud, the cop goes on about how he 'did everything he was supposed to do' in order to make sure that the agent was real. Well, he did check the ID, but I would not call that enough! Later, when he finds out that the bad guys might have used a computer to make the ID (GASP!), his reaction is absolutely silly! Also, almost immediately after this, the cop suddenly knows that the bad guys can use their computer to trace his mobile phone and cunningly places it in a truck that's going the other way (to veer off the bad guys)... A leap of logic, that is, if anything!A bad, bad movie... Should not have been made... 1/10.",
            "review_date": "2001-10-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If God is a movie, he's this one.",
            "content": "My moron friend John says that this movie is tripe but in reality this is one of the finest accomplishments of modern cinema.  Fair Game incorporates elements from every terrible action/suspense/thriller movie and creates the ultimate viewing experience in that you get the best of everything and the worst of nothing.  Also, Cindy looks really great.  After all, the only reason for watching movies is to see lead actresses, right?  Okay, this is not a GOOD movie so much as it is an enjoyable one. Seriously, watch it at least twice for the full experience.",
            "review_date": "1999-03-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Reproductive health guide or it's a movie review : You decide!",
            "content": "IMDb, let's talk about THIS movie, Flair Gain. It's about apes, specifically the talking kind. Those apes, those Goddamn sh*t throwing apes, oh, let me tell you, they get up to some shenanigans, like stealing stuff, shooting stuff with guns also shooting people with guns, it's America it's cool, BLOWING STUFF UP!!! Do you know who Cindy Crawford is? She's a lady, professionally. She's not some kind of part-time lady, y'know, only being a lady on the weekends and holidays, she's a full time lady, whole movie. So the story of the movie is pretty lady gets with hunk, ugly people try to stop them. The good news is the really attractive people kill all the ugly people in the movie, and that's where babies come from.",
            "review_date": "2015-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A flashy, yet empty, action flick",
            "content": "As a fan of action flix, I love to see explosions, fire, bullets, guts, yada yada yada. But I expect to see some substance in them, too. Maybe a little bit of heart and soul, and good acting. There are a lot ofaction flix with a great mix of everything (DIE HARD and LETHAL WEAPON are true exceptions). But there are some that action but no diversequalities. FAIR GAME is a case in point. Sure, the action in thiscop flick is awesome (the train/sports car race is breath-taking) butit only left room for the rough stuff, and not enough substance.What a damn shame.",
            "review_date": "2001-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful Pyrotechnics",
            "content": "The story line is OK if entertainment is what you are after. There are a lot of holes in continuity and in the graphics. With a small leap of imagination and remembering entertainment is what we are pursuing. this is an enjoyable film........... and deserves Kudos for the pyrotechnics.",
            "review_date": "2002-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An underrated thrill-ride.",
            "content": "When Kate McQueen, a family lawyer, finds herself as the target of ex-KGB agents, it is up to Max Kirkpatrick, a Miami detective, to keep them both alive.\"Fair Game\" is n underrated film in which time may have been kind on. I found the film to be a high-intensity thrill ride without a single dull moment. It isn't over-plotted or filled with annoying characters. It's quite simply a slickly enjoyable and fast-paced action movie with two sizzlingly attractive leads. Although the movie was poorly received on release I think this film was highly entertaining and very re-watchable.",
            "review_date": "2022-05-19",
            "lang": "en",
            "source": "imdb"
        }
    ],
    "meta_rating": 5.9,
    "meta_summary": "A dedicated family attorney becomes the target of an assassination plot. Her only protector is a detective who can't resist her charms. (Warner Brothers)",
    "vibes": [
        "hairy",
        "political",
        "basic",
        "smart",
        "attractive",
        "minor",
        "regular",
        "irrelevant",
        "frenzied",
        "pretentious",
        "smug",
        "uncredited",
        "unpretentious",
        "unrewarded",
        "exciting",
        "nice",
        "illegal",
        "non",
        "outlandish",
        "rich",
        "swanky",
        "underwater",
        "whole",
        "notable",
        "gorgeous",
        "surprising",
        "unintentional",
        "safe",
        "hot",
        "pointless",
        "silly",
        "gratuitous",
        "afraid",
        "fascinating",
        "random",
        "endless",
        "sensible",
        "awful",
        "thin",
        "civil"
    ]
}