{
  "title": "Boogeyman",
  "rating": 6.1,
  "release_date": "2005-02-04",
  "summary": "In this chilling horror movie, Barry Watson stars as Tim, a young man who must return to his childhood home and confront the terrifying visions that have haunted him all his life. (Screen Gems)",
  "critic_reviews": [
    "Trendy influence of insidiously creepy Japanese horror pics is felt in almost every frame of Boogeyman. The effectively atmospheric and unusually involving thriller tells the story of a distraught young man's protracted duel of wits with the eponymous evildoer.",
    "Unexpectedly gripping horror movie.",
    "This film does cause shivers, creeps, scares, and jumps. It may even make you scream a bit.",
    "It suffers from a lack of genuine chills or suspense that renders its slight virtues rather moot.",
    "Director Stephen T. Kay (The Last Time I Committed Suicide) busts off some cool shots, and Eric Kripke's story is pretty sound until the finale. Worth a look for horror fans, but nothing classic.",
    "An otherwise passable horror film that delivers more than enough cheap thrills to forgive the plot holes.",
    "Has little to offer in the way of entertainment or originality.",
    "An opportunity to exploit childhood nocturnal fears is missed in a second-rate horror.",
    "A film willing to cheat whatever way necessary to scare you... The good news is that once you leave the theatre, you'll never think of Boogeyman again.",
    "While stylishly filmed and edited, Boogeyman is filled with every imaginable fright cliche... It's like a meal consisting entirely of airy hors d'oeuvres.",
    "This is strictly substandard stuff, with imitative creepy noises, vertiginous camera angles, and long pauses.",
    "The filmmakers are smart enough to keep the monster out of sight for a long time and then to show only glimpses, but a similar tactic of providing only glimpses of plot and character is disastrous.",
    "Mostly Boogeyman remains content to be a film about a boogeyman who hides in closets and under beds and gobbles people up. And for that, it deserves a certain amount of respect. On the other hand, the film could hardly be any sillier.",
    "The MPAA's rating explanation for this PG-13-rated snoozer misleadingly claims it contains \"intense sequences of terror/violence\"; it would be more accurate to state that Boogeyman contains \"virtually every horror-movie cliché of the past 30 years.\"",
    "If you can't spell \"bogeyman,\" you shouldn't make movies about him.",
    "It's difficult to remember a recent movie with less regard for spatial or temporal coherence. With the bar set so low, one wouldn't think the ending could possibly come as a letdown. Believe me, it does.",
    "Even the should-have-been-triumphant revelation of the Boogeyman arrives as a CGI letdown of epic proportions.",
    "A horror film whose only scare is that it was made at all... As with so many stupid horror movies in these post-''Scream\" times, this one is at such a creative loss that all it can do is make its audience feel duped for having purchased a ticket.",
    "It’s a waste."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "a good story from the creator of Evil Dead Sam Raimi and director Stephen Kay. a well cast and a complete spoke the boggeyman this a film where you jump out of your chair and scream or yell like  a clown ( like i did). Grade ?????",
      "review_date": "2014-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The only way to really describe Boogeyman is unmemorable. You've seen every horror movie trick and trope it uses a hundred times before making for one of the least scary horror movies you'll ever see. Not even the awesome Lucy Lawless canThe only way to really describe Boogeyman is unmemorable. You've seen every horror movie trick and trope it uses a hundred times before making for one of the least scary horror movies you'll ever see. Not even the awesome Lucy Lawless can save this one and by the time the movie ends you'll be hard pushed to recall anything you've just watched.",
      "review_date": "2014-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This isn't an horror movie. This almost are not a movie! So poor, so boring, so... omg! I really love horror movies but this... don't watch it guys. Trust me.",
      "review_date": "2015-04-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is one of worse that I have seen stocks on fear there were some frights that they were nice and were plundering you, but the majorities of frights were giving laugh Nothing advisable to see before any movie that you have before that this.",
      "review_date": "2009-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought this movie was going 2 be good but it wasnt it was not thought out well and very very bad acting like the boogeyman was not even scay.",
      "review_date": "2005-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is something of an underrated film in the horror genre, it was actually much, much, much better than I thought. You see I don't usually watch PG-13 horror due to the fact that it is usually is bland , cheesy, contrived, over This movie is something of an underrated film in the horror genre, it was actually much, much, much better than I thought. You see I don't usually watch PG-13 horror due to the fact that it is usually is bland , cheesy, contrived, over rated and over hyped. This film was none of those, Boogeyman, or as I like to call it The Boogeyman is a very suspenseful, dark and foreboding Psychological horror thriller. This film was very good for five of reasons. 1) It didn't use an abundant of CGI or gore to tell it' story. 2) it thought out it's story and characters reasonable well. 3). 4) it use old school techniques(which I love more than the new way of horror story telling .) and it uses it so well to bring out the very dark and scary nature of the legend of the monstrous Boogeyman. 5) It pulls no punches when it comes to telling horror, it get's in your head and just won't leave even after the film is over. Boogeyman wasn't Halloween(1978) or Dracula(1931) scary, but it was scary none the less. It's style and means of scaring you were conventional and old school and that was something that shocked me. You don't see that in a modern horror film. And that makes this film a stand out among them; I mean I've seen Rob Zombie's Halloween( I call it suckloween), I've seen Turistas( I call it dumbristas) but this is the first film since Secret Window that I'm proud to call a good horror movie. Barry Watson( You may know him as Jessica Beil's boyfriend on 7th Heaven.) plays a distraught and disturbed young man who has to come to terms with the childhood fear that has afflicted him all his life.He plays this part relatively well and does good in what he is suppose to do. Emily Deschanel was alright, she wasn't horrible but she wasn't good either. She kind of lags in the the emotional depth department and made her kind of a drag to watch. But besides that they both hold up nicely in this. Boogeyman is not an oscar worthy film but what it is is a great scare machine that doesn't quit from the opening scene until the closing, and it delivers an effected psychological look into the paranoiac fear that most people have of The Bogeyman and the dark. All in all Boogeyman wasn't a bad film and if your kind you will see it as well. It isn't a gore machine like you would expect, or like but it is a very effective movie in it's own right. Boogeyman gives you one wild and nightmarish ride for your money and I can promise you. You won't be disappointed with the outcome. All in all Boogeyman is one door you do want to open.",
      "review_date": "2009-10-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Everyone is afraid of the boogeyman. I really like this movie. I love a good horror flick.",
      "review_date": "2022-12-11",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 27,
  "genres": [
    "Drama",
    "Mystery",
    "Thriller",
    "Horror"
  ]
}