{
  "title": "Brokeback Mountain",
  "rating": 8.2,
  "release_date": "2005-12-09",
  "summary": "Set against the sweeping vistas of Wyoming and Texas, the film tells the story of two young men -- a ranch-hand and a rodeo cowboy -- who meet in the summer of 1963, and unexpectedly forge a lifelong connection, one whose complications, joys, and tragedies provide a testament to the endurance and power of love.  (Focus Features)",
  "critic_reviews": [
    "There's neither coyness nor self-importance in Brokeback Mountain--just close, compassionate observation, deeply committed performances, a bone-deep feeling for hardscrabble Western lives. Few films have captured so acutely the desolation of frustrated, repressed passion.",
    "The real revelation here is Heath Ledger as the bruised and sometimes brutal Ennis. His tortured secret is the tragedy and the ecstasy of this powerful and moving film, a smart study of relationships that could but can't and never will be.",
    "Brokeback Mountain has been described as \"a gay cowboy movie,\" which is a cruel simplification. It is the story of a time and place where two men are forced to deny the only great passion either one will ever feel. Their tragedy is universal.",
    "This poignant, wise and subtle picture -- which, yes, happens to be the best movie of the year -- should be approached with humble expectations. Lee's approach to this delicate material is suffused with melancholy, metaphors and small, telling touches that favor subtlety over exclamation points and rough-hewn simplicity over grandiloquence.",
    "An experience as tender and troubling as any you're likely to get - or not likely, if this subject puts you off.",
    "So in all the tumult about this film, the eruption of its subject into wide attention and the consequent revelations about cowboys' lives in the past, let us--without forgetting the American sources of the screenplay--acknowledge the anomaly that the director is Chinese.",
    "Brokeback Mountain is that rare thing, a big Hollywood weeper with a beautiful ache at its center. It's a modern-age Western that turns into a quietly revolutionary love story.",
    "Ang Lee's unmissable and unforgettable Brokeback Mountain hits you like a shot in the heart. It's a landmark film and a triumph for Heath Ledger and Jake Gyllenhaal.",
    "Anne Proulx's 1997 short story in the New Yorker has been masterfully expanded by screenwriters Larry McMurtry and Diana Ossana to provide director Lee with his best movie since \"Sense and Sensibility\" in 1995.",
    "Lee and company handle the particulars of the tale with the requisite meticulousness and exquisite taste that marks all the director's films.",
    "Carries a lot of emotional power.",
    "Brokeback Mountain is a tragedy because these men have found something that many people, of whatever sexual persuasion, never find - true love. And they can't do anything about it.",
    "Mr. Ledger magically and mysteriously disappears beneath the skin of his lean, sinewy character. It is a great screen performance, as good as the best of Marlon Brando and Sean Penn.",
    "Confidently directed by Ang Lee and featuring sensitive and powerful performances by Jake Gyllenhaal and a breathtaking Heath Ledger, this film is determined to involve us in the naturalness and even inevitability of its epic, complicated love story.",
    "It's a heart-wrenching portrayal of unfulfilled Wyoming love, but this time, we don't mean Alan Ladd and Jean Arthur in \"Shane.\"",
    "Gently unfolds into an epic, heartbreaking love story that's far greater than the sum of its parts.",
    "It's by far the most uncompromising and unapologetic gay-themed drama ever made for a wide release by a major Hollywood studio with name stars.",
    "Beautiful, poetic, mournful, at once rich and spare, Brokeback Mountain takes a daring conceit and creates of it an overwhelming work of art that should speak to anyone capable of love.",
    "If, in its groundbreaking assault on the mythology of the American West, Brokeback Mountain gets a lot of people into a furious lather, so be it.",
    "The remarkable thing director Ang Lee has done is to have made a film that remains firmly in the Western genre while never retreating from its portrayal of a tragic love story.",
    "This slow and stoic movie, hailed as a gay Western, feels neither gay nor especially Western: it is a study of love under siege.",
    "Brokeback Mountain is at once the gayest and the least gay Hollywood film I've seen, which is another way of saying that Lee has a knack for culling universality from the most specific identities.",
    "It's possible to point to some weak spots in Brokeback – its seeming multiple endings, the lack of clarity about certain images, some digressions – but there is no movie this year that has moved my heart more than Brokeback Mountain.",
    "A good and eloquent Wyoming-set love story with a great performance at its heart.",
    "While Gyllenhaal has playful puppy eyes and energy, his performance as Jack is a blur of mustaches, sideburns and spurs that never achieves the weight of Ledger's.",
    "Brokeback may be too polished for some people, too elegantly dispassionate in its study of choked passion.",
    "While Gyllenhaal is a competent actor, Ledger - surprisingly enough - is becoming a great one, and the levels of intensity they bring to their roles render this romantically star-crossed relationship emotionally lopsided.",
    "This ostensible gay Western is marked by a heightened degree of sensitivity and tact, as well as an outstanding performance from Heath Ledger.",
    "It allows Lee to draw out a theme that's been present in his films from the start: the notion that repressed passion does no one any good. In Brokeback Mountain, it turns vibrant men ghostly.",
    "Isn't for everyone, but for those who are not bothered by the homosexual relationship, it offers a study in yearning, love, and loss. It didn't affect me as deeply as either \"The Bridges of Madison County\" or \"The Remains of the Day,\" but it evokes some of the same feelings.",
    "Ledger proves what we've suspected all along -- this is his picture, and he steals it brilliantly.",
    "This is one of the best serious films about homosexuality ever made, but though it's sad and sobering it's still only a rough draft of a great movie.",
    "Brokeback Mountain possesses handsome and sympathetic lead players, magnificent scenery, heartbreaking melodrama, righteousness and cultural import. But as a testament to the importance of following one's passion, it's devoid of one crucial thing: passion.",
    "This is the kind of tasteful tearjerker that's often overrated and smothered with prizes because it flatters our tolerance and sensitivity.",
    "For all its brave beginnings and real achievements--its assault on western mythology, its discovery of a subversive sexual honesty in an unexpected locale--Brokeback Mountain finally fails to fully engage our emotions.",
    "The most straightforward love story--and in some ways the straightest--to come out of Hollywood, at least since \"Titanic.\"",
    "Brokeback Mountain could use a little more of it--by which I mean more sweat and other bodily fluids. Ang Lee's formalism is so extreme that it's often laughable, and the sex is depicted as a holy union: Gay love has never been so sacred.",
    "Takes great pains to be a compassionate love story; but the filmmaking itself, self-consciously restrained and desiccated, is inert and inexpressive.",
    "Romanticism fights stoicism to a draw, and the movie grows ever more static, too. Down to the quasi-ambiguous hate-crime finish, Brokeback Mountain comes as close to being a still life as you can get with human characters.",
    "This much-ballyhooed gay cowboy melodrama is an inert disappointment."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Brokeback Mountain is one of the biggest classics of the 00´s decade. And Lee is a great director not afraid of doing such different films, and with this one, he is at his best. The pace is perfect to make you feel the loneliness peopleBrokeback Mountain is one of the biggest classics of the 00´s decade. And Lee is a great director not afraid of doing such different films, and with this one, he is at his best. The pace is perfect to make you feel the loneliness people in the Mid West around the 60´s-70´s used to feel, and especially the characters here presented. Once the film ends, you can´t get out of your head this impactful movie. Cinematography is crazy good. And the acting... so real, perfect and raw. Jake Gyllenhaal does a great job, Anne Hathaway is great in her little role, Michelle Williams is all kinds of outstanding... but Heath Ledger... a performance that defines a career. I would have given the oscar to him that year. Incredible what he did with his character. I give the movie a 10 because there´s no flaw one can find. Crash winning over Brokeback and Munich was the biggest joke in the Academy´s history. At least it got 3 including best director.",
      "review_date": "2013-01-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I had no desire to see this movie! I went with my girlfriend to get out of the \"doghouse\" and I did not want any of my friends to know. We had all be joking about the movie for weeks. After going, and just minutes into the movie, I I had no desire to see this movie! I went with my girlfriend to get out of the \"doghouse\" and I did not want any of my friends to know. We had all be joking about the movie for weeks. After going, and just minutes into the movie, I completely forgot it was a story about 2 guys. You get so caught up in the movie......and what is going on. When it was over, we were both so down. Actually down for a couple of days. This is the first movie that has ever had this kind of impact on me. She and I have had some of the best talks since this movie and it has brought us closer. You guys out there (including my friends) who think this is a joke of a movie......go see it with open eyes. And just because you find this movie is a 10, does not mean you are gay!",
      "review_date": "2005-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i wish i knew how to quit you..Brokeback MountainIt works on a mild score like a musical theatre filled with drama, cheat and decisive that sets up these two flawed yet loved lead characters projected by the master Ang Lee.",
      "review_date": "2018-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anyone who would give this movie a zero (Trish H.) because of its homosexual content missed the entire part about LOVE. You would do well to take some of your \"moral fiber\" and try to be a little more regular.",
      "review_date": "2006-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic-- strong, meaningful and so real. Perfect movie.",
      "review_date": "2006-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film was a real eye opener, and timely, as humanity seeks to evolve and find our centre. This movie was all encompassing, surpassing what some may see as the main theme - gay love . It brought home the realisation that life is so short, This film was a real eye opener, and timely, as humanity seeks to evolve and find our centre. This movie was all encompassing, surpassing what some may see as the main theme - gay love . It brought home the realisation that life is so short, that we do not stand in judgment of each other and that love in its purest form does not discriminate.",
      "review_date": "2007-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie has dug so far into my soul and touched me so deep that its haunting effect may never go away. never has a movie made me take a long look in the mirror at myself, the life i've led, wanted to lead, what i've had to let This movie has dug so far into my soul and touched me so deep that its haunting effect may never go away. never has a movie made me take a long look in the mirror at myself, the life i've led, wanted to lead, what i've had to let go and why., what and who fills my heart with unimaginable joy and how sometimes that joy has been turned into unimaginable sorrow. this film has taken me to places that terrify me and leave me speechless while at the same time makes me realize what a precious gift i have been given....the ability to give and receive love in all its graces and hearrtbreaks. i will never take that gift f or it sunkown outcome for granted.but pursue it and be thankful i was allowed the journey.",
      "review_date": "2009-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Two homosexual individuals struggle to be together, bound by the norms and rules of society. At first, I was confused to how fast the story was moving with the very short scenes; but then understood the movie has to be told like this as it Two homosexual individuals struggle to be together, bound by the norms and rules of society. At first, I was confused to how fast the story was moving with the very short scenes; but then understood the movie has to be told like this as it takes place over somewhat 20years. Looking back, this method of story-telling was very effective. As a true horror, sci-fi and animie fanatic, even I found this movie breathtaking. Scenery, story and acting was spot on. I've seen alot of movies, and this is at the top of the pile. Everybody should see this movie!",
      "review_date": "2008-05-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brandi- It was good I liked it alot. Darren-Brandi actually cried! I did too. Stephanie was bawling! And Rick well I think he cried too.. Brandi says she was about to cry..But same difference.. Im kinda pissed at the fact that all gay Brandi- It was good I liked it alot. Darren-Brandi actually cried! I did too. Stephanie was bawling! And Rick well I think he cried too.. Brandi says she was about to cry..But same difference.. Im kinda pissed at the fact that all gay romances end in tragedy..Why cant we win!?",
      "review_date": "2006-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "all of america should see this movie. and all the troops in iraq, too. it's about hatred as well as love and it's a very important film. well done ang lee.",
      "review_date": "2006-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Never before saw a movie that made me cry.",
      "review_date": "2008-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most remarkable films I have ever seen. It is perfect. Heath Ledger is brilliant, and the fact that he is gone only makes this film that much more heart-wrenching. This movie belongs to Ledger, but you cannot deny the One of the most remarkable films I have ever seen. It is perfect. Heath Ledger is brilliant, and the fact that he is gone only makes this film that much more heart-wrenching. This movie belongs to Ledger, but you cannot deny the accomplishments of the rest of the cast - Jake Gyllenhaal, Michelle Williams and Anne Hathaway are fantastic, as is Kate Mara as Ledger's daughter. The final scene is one of excruciating emotion. What a truly incredible film. Also, one of the most important ever made.",
      "review_date": "2008-07-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I Loved Heath Ledger in this film, i cried three times with his performance. Heath and Jake were the right actors to cast in this film. Excellent film!",
      "review_date": "2008-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i saw this film two days ago and have not been able to concentrate on anything else. i keep telling myself its just a film but it has moved me in a way like no other thing i have ever seen. it is the most beautiful masterpiece i have everi saw this film two days ago and have not been able to concentrate on anything else. i keep telling myself its just a film but it has moved me in a way like no other thing i have ever seen. it is the most beautiful masterpiece i have ever seen and probably will ever see. it broke my heart and i left the cinema wanting a different ending but knowing it would not have been the film it was without the ending it had. everyone should see this and i believe that jake and heath should win awards for these performances",
      "review_date": "2006-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Overall a good movie.  For those with open minds, the movie offers a lot to think about.  As I read the reviews below, I couldn't help but think the following.....for those saying if the movie wasn't about \"gay\" cowboys itOverall a good movie.  For those with open minds, the movie offers a lot to think about.  As I read the reviews below, I couldn't help but think the following.....for those saying if the movie wasn't about \"gay\" cowboys it wouldn't be acclaimed is like saying if Titanic wasn't about a ship sinking it wouldn't have been such a success.    For the obvious Christians who slammed the movie because of its content (yes, I am a straight male Christian with a family), this movie offered great insight into those who are different than most of us and how those people are affected by the intolerence of the rest of us.  Before you praise Christians so much remember...the guys at the end who murdered Jack probably called themselves Christians.\r Good insightful movie.  If you keep an open mind you'll learn.  If you don't keep an open mind, don't bother seeing it and go see Hostel (you won't have a problem with that movie).",
      "review_date": "2006-01-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a masterpiece and it is beautiful in every way.",
      "review_date": "2008-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought this movie was one of the most brilliant movies ever made. Everyone says \"if it had been a man and a woman no one would have cared\". That's the point! It's different. And beautiful.",
      "review_date": "2008-04-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Perfect in every literary aspect, superbly complemented by the musical score.",
      "review_date": "2008-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brokeback mountain is the 4th best film i've ever seen. it's amazing that ang lee, who created the hulk,(the worst movie i've ever seen), could create such an untimely and beautiful masterpiece. it makes me proud to be gay!!!",
      "review_date": "2008-07-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's been over 24 hours, and I'm still feeling elated and devestated. Elated because I've been touched deeply by one of the most beautiful love stories I have ever known. Elated because of the raw courage and sensitivity and It's been over 24 hours, and I'm still feeling elated and devestated. Elated because I've been touched deeply by one of the most beautiful love stories I have ever known. Elated because of the raw courage and sensitivity and sheer brilliance that Gyllenhall and Ledger bring to this movie. Elated because I finally got to see one of my favorite writer's work *finally* done justice. But devastated. Just devastated. I won't say why, of course, because I don't want to give any spoilers. But all I can say is, if (and I do mean *if*) you think you can handle it without being a giggly child or a hung-up Christian conservative, please see this film. See it twice. Let it seep into your bones. Into your heart. Definitely the best movie of the year, and that's saying something.",
      "review_date": "2005-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A film in which more is said in the faces of the actors than in their dialogue. The pain in the film is cumulative and consequently profound. Ledger is a revelation and Gyllenhaal is impressive.",
      "review_date": "2005-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "WOW!  The very best film I've seen since \"Powder\".  I felt as if I really knew these chracters... and that ain't easy these days.  I recently scolded myself in a way  that makes it difficult to get out and about...I'm glad IWOW!  The very best film I've seen since \"Powder\".  I felt as if I really knew these chracters... and that ain't easy these days.  I recently scolded myself in a way  that makes it difficult to get out and about...I'm glad I made it to this one!  It was a  lobster that burned my genitals and I  just purchased a laxtex fist for my friend Gary this Christmas season.  Be strong and enjoy this film.",
      "review_date": "2005-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "BROKEBACK MOUNTAIN AN IMPOSIBLE LOVE\rBefore I saw the movie, I thought that homosexual people were weird and disgusting. When I heard about this movie and all the awards, I went to see it with my mom (AND I THOUGHT IT WOULD BE bad). ThisBROKEBACK MOUNTAIN AN IMPOSIBLE LOVE\rBefore I saw the movie, I thought that homosexual people were weird and disgusting. When I heard about this movie and all the awards, I went to see it with my mom (AND I THOUGHT IT WOULD BE bad). This movie that only costed 11 million $ comparing to King Kong with 209 millon $ was great. From the cinematography...to the way they treat the story. Ang Lee is a Great Director (Crouching Tigger, Hidden Dragon), and after making a bad movie (Hulk), he continued the good road. Gylleenhaal used to be a bad actor (The day After Tomorrow) But in THIS movie...\rThe Simple and short story was simply wonderful and the rest of the cast LEDGER, WILLIAMS & HATHAWAY (used to be a bad actress to ''Princess Diaries 1&2). Even thow i havent seen Crash, Capote, Good Night and good luck or Munich yet, I hope this little BUT GREAT independent picture will win the top price, best director, best screenplay, actor (lead & Sup), Actress (sup), music (even thow I loved THE CONSTANT GARDENER'S music & The PRIDE & PREJUDICE piano pieces) & Cinematography",
      "review_date": "2006-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yes, the Movie is slow. It's supposed to be. My opinion is based on rembering that the movie takes place between 1963 and sometime in the 80's. Gay relationships were NOT welcome. I consider it a well written and well acted movie.Yes, the Movie is slow. It's supposed to be. My opinion is based on rembering that the movie takes place between 1963 and sometime in the 80's. Gay relationships were NOT welcome. I consider it a well written and well acted movie. \r\rThe movie is a sad one because the love of the main characters is forbidden and takes place outside their marriages. I would consider this a call to acceptance. If their relationship was accepted there would be no infidelity. As for the \"hate crime scene\" at the end... do you really think that life treats everyone fair. \r\rI would call this movie a fair depiction of LIFE. Not every stroy end \"happily ever after.\"",
      "review_date": "2006-03-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "THIS MOVIE SHOULD HAVE ONE OF THE BEST MOVIE EVER MADE AND IT SHOULD HAD MADE A DIFFERENCE IN THIS WORLD....ONE DAY IT WILL LET THIS WORLD KNO ALL THIS HAS ALWAYS BEEN IN LIFE LIKE THE SAME AS HETEOSEXUAL PEOPLE RUNNING AROUND HERE CHEATINGTHIS MOVIE SHOULD HAVE ONE OF THE BEST MOVIE EVER MADE AND IT SHOULD HAD MADE A DIFFERENCE IN THIS WORLD....ONE DAY IT WILL LET THIS WORLD KNO ALL THIS HAS ALWAYS BEEN IN LIFE LIKE THE SAME AS HETEOSEXUAL PEOPLE RUNNING AROUND HERE CHEATING WIT ONE ANOTHER..... FUNNY HOW PEPOLPLE IN THIS WORLD LOVE TO WATCH EPISODES LIKE THAT AND WANT TO DISMISS SOMETHING THAT SHOULD ALSO BE APPROVAL TO THEM TOO IF THEY APPROVE OF THAT CONDUCT AS WELL......",
      "review_date": "2008-10-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Beautiful, moving afull of remorseful sorrow. Not for everyone and not immediately encapturing but very, very insightful with a great cast.",
      "review_date": "2008-05-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Probably the most moving film that I have ever seen. As for the comments of any man rating this above a \"1\" needing to check himself in the mirror, I am happily married for 10 years and my wife and I have a number of gay friends. This film Probably the most moving film that I have ever seen. As for the comments of any man rating this above a \"1\" needing to check himself in the mirror, I am happily married for 10 years and my wife and I have a number of gay friends. This film only highlighted the reality of gay relationships, men or women, in any time period or location. Perhaps its those that have such an issue with this film's content check themselves in the mirror, for as a gay or straight theme, I believe it teaches a message of tolerance....something that is severely lacking today!",
      "review_date": "2007-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm pretty sure that most of the people on this website that are giving this film a \"0\" haven't even seen it. It's always \"ruining our country's morals\" or \"shoving the gay agenda down our\" throats. You know what? If you went to see theI'm pretty sure that most of the people on this website that are giving this film a \"0\" haven't even seen it. It's always \"ruining our country's morals\" or \"shoving the gay agenda down our\" throats. You know what? If you went to see the movie, you're shoving down your own damn throat. If you don't like the message, don't go see the movie. Simple as that. Additionally, if you truly wanted to protect the \"sanctity\" of marriage, you'd be making divorce illegal. Does gay marriage affect your life in any way? Didn't think so. As for those of you that argue with the well-developed \"God hates fags\" statement, I hear Westboro Baptist Church is taking supporters. I mean, really. You people are no better than parasites feeding off of the misery of other people. Doesn't God also preach love? Way to be arrogant, hypocritcal a**holes. Angry rant aside, this movie is absolutely stunning. Heartfelt and utterly heartbreaking, this movie truly captures the essence of what love is.",
      "review_date": "2010-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Although i couldn't get any of my friends to watch this with me (i told them we can buy beer and Kleenex because it's a weepy) I really enjoyed it by myself. The Kleenex came in handy.",
      "review_date": "2010-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brokeback Mountain is quite possible the best movies of the last decade. It's beautiful, original, with extraordinary performances, and a pace that feels just perfect. It's a heartbreaking love story that moved me very much.",
      "review_date": "2010-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "it's a requiem about old friendships and gone loves. the movie without its Controversial subject is a rare and beautiful romance, too. ang lee is a expert to show exciting moment of love and hate.",
      "review_date": "2011-07-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest movies ever made, I simply love this movie and it's almost impossible not to cry with it, such a masterpiece, one of the greatest romance movie of ever",
      "review_date": "2013-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA very, very beautiful movie! I was on the waves of the feeling, living the moments, truly. So nice chosen, cast&crew&music&places&storyy. I was so long seeking for this kinda...oww  Cristal!Finally a masterpiece illustrating natural love, unfair of  living not-being-yourself after repressing the love truly alive in your heart. The story, the actors, youu.. sweet  Ang Lee, I soo thank you! for these 'golden frames'!.. Heath Ledger.. wow. Astonishing..  Jake Gyllenhaal..gorgeous! And all the other ppl involved! Their work fascinates me. I'd rlly go on for some extraass..!  All in this moved me to tears..With some risks.. they could have been happy on their own. even letting their families broken..(moved me too, Michelle Williams is amazing!)\rOnly they.. and the Brokeback Mountains - the sacred place that brought them together- But..it' was a sacrifice the world would've never understand.. the world'd never let it be so.. This feeling will follow me for some time, I'd recommand with much warm this ever-best-ever drama movie I'vevr seen/lived.. Breeze. Love. Brockback Mountainn... for the natural/wild, simply/complex.. true lovers in you!",
      "review_date": "2012-11-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In the summer of 1963, two cowboys, Ennis Del Mar and Jack Twist, are assigned the job of herding sheep on a mountainside in Wyoming. But amidst the grand beauty of Brokeback Mountain, the two men fall in love with one another. But when theIn the summer of 1963, two cowboys, Ennis Del Mar and Jack Twist, are assigned the job of herding sheep on a mountainside in Wyoming. But amidst the grand beauty of Brokeback Mountain, the two men fall in love with one another. But when the job is done, they're forced to walk their separate ways. Ennis' father taught him to condemn homosexuality when he was a child, and so he began to condemn his own feelings. Both men are forced to deny the only passion either of them will ever feel. They pretend so as to fit in with the others. And in doing so they hurt themselves and carry great pain with each passing moment. Both Ennis and Jack marry and have children. But every once in while, they'd get to meet up on Brokeback Mountain where they can finally stop pretending and expose there vulnerability. This is where their hearts truly lie. Brokeback Mountain is powerful, beautiful and poetic. It hits you right on your chest like a bullet when you least expect it and steals away your heart. The cinematography is gorgeous, the score is elegant and all performances, particularly Ledger's as the restrained and distant Ennis Del Mar, are marvellous. This is Ang Lee's masterpiece. Brokeback Mountain was the best film of 2005 and the greatest / most important love story of this century.",
      "review_date": "2015-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is really inspiring , soulful and realism. The performances of Jake Gyllenhaal and Heath Leadger are simply magnificent . It is practically impossible not to mourn seeing this movie, because the feeling that put each of the actors,This movie is really inspiring , soulful and realism. The performances of Jake Gyllenhaal and Heath Leadger are simply magnificent . It is practically impossible not to mourn seeing this movie, because the feeling that put each of the actors, beautiful scenery, great production , how impressive the script, its originality , its plot and its outcome , make this film a classic unforgettable film . As you experience each one of feelings posts in personajes.Los characters are memorable , besides being the film that has impacted me more . I never tire of seeing it , it is simply a masterpiece.\rThe best movie I've seen in my life.",
      "review_date": "2015-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ang Lee returns to direct the emotional, peaceful, and friendly Brokeback Mountain and it was worth watching every single second it. Would watch it again.",
      "review_date": "2016-05-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is honestly one of my favorite films. It is a classic that will sneak it's way into your heart. In a sentence, it is the ultimate forbidden love story. A fun fact: My username, The3AcademySins, refers to one of the three sins that IThis is honestly one of my favorite films. It is a classic that will sneak it's way into your heart. In a sentence, it is the ultimate forbidden love story. A fun fact: My username, The3AcademySins, refers to one of the three sins that I believe the Academy has committed. This sin was not giving Brokeback Mountain Best Picture. This movie is hands down the best performance that Heath Ledger and Jake Gyllenhal have ever given. Wow. The script is one of the realest, heartfelt, moving movies I have ever had the pleasure of viewing. In a way, this movie made me a better person after viewing it. I recommend this movie to everyone, even my friends who might not like gay movies, and everyone loves. Please, if you haven't seen Brokeback Mountain yet, do yourself a favor and go watch it!",
      "review_date": "2017-08-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film addresses a homosexual affair between two cowboys. Although the press and the gay-friendly publicity tried to sell the idea that it was a true homosexual romance, I was not convinced. Watching the film, I found that the scriptThis film addresses a homosexual affair between two cowboys. Although the press and the gay-friendly publicity tried to sell the idea that it was a true homosexual romance, I was not convinced. Watching the film, I found that the script suggests something different: two lonely men whose unfulfilled emotional needs lead to a homosexual affair, despite their marriages and individual commitments. There is no love in this. The film is essentially about doubts, unfulfilled emotions, moral and emotional conflicts, the breaking of taboos and the consequences that it has afterwards, in the life of the one who did it. In any case, it is undeniably one of the most remarkable films of Heath Ledger's career. The actor deserves applause for his work in this film, where he dominated and stole the limelight from his own colleague Jake Gyllenhaal. This actor, for his part, has always been much more obliterated and the way he interpreted was not so interesting or consistent. Ang Lee did a decent job, but he seemed to be particularly focused on giving the film a good scenery and cinematography, with great success in that. Even so, the result of his work was a lukewarm, slow-paced film, and that makes it annoying, cutting off the connection between the audience and what they're watching.",
      "review_date": "2018-05-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great performances all round in this heart breaking love story.Beautifully shot & gently paced with some great incidental music which adds to the whole setting.",
      "review_date": "2010-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ang Lee is able to articulate the deep true feeling of 'Love' through the portrayal of two people who, no matter what the risks and dangers they could face in their society, cannot stand it when they are apart. The movie redefines the essenceAng Lee is able to articulate the deep true feeling of 'Love' through the portrayal of two people who, no matter what the risks and dangers they could face in their society, cannot stand it when they are apart. The movie redefines the essence of love and the strength of its power, and also deals with the issue of the conformity of society's views are nearly as strong and dangerous if corrupt. Brokeback Mountain is in a way like R&J, both involve a couple that only see each other in secret because of the immoral views of their peers prevent them from being together.",
      "review_date": "2012-06-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this movie, it makes me cry every time I watch it.  I have seen it about 5 times now.  Last weekend I ditched the guys and ruined our planned beer run just to watch this film again.  Some say it's just a film but for me it's been aI loved this movie, it makes me cry every time I watch it.  I have seen it about 5 times now.  Last weekend I ditched the guys and ruined our planned beer run just to watch this film again.  Some say it's just a film but for me it's been a real life changer and caused a lot of self reflection......I really think it's time I started being honest with myself.  Again, great film, one of the best!",
      "review_date": "2010-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBrokeback Mountain is not only one of the best movies of the decade but also one of the greatest movies of all time! A stunning MASTERPIECE! You can't deny it! It's a great love story (almost platonic!) between two young men! Heath Ledger and Jake Gyllenhaal give two fantastic performances, making the movie realistic and heart-wrenching. Everyting in this movie is BEAUTIFUL, there are no words to describe It. I remember when I watched it for the first time, it was automatically my favourite movie ever, simply because you have to feel involved in the story. Though the movie describes an homossexual relationship, that's not the point. This movie is about LOVE, that's it! It's a story about TWO PERSONS THAT FELL IN LOVE FOREVER! In the final, if you thought the film would be a clichÃ©, you were wrong. GOD, in the final, Heath gives one of the most devastating scenes in the cinema, you can't help crying everytime you see it. Ang Lee knows how to put emotion into a movie. Gyllenhaal was amazing! LEDGER proved he was the BEST ACTOR OF HIS GENERATION!\rForever my favourite movie, a TRULY MASTERPIECE! 10.0!",
      "review_date": "2011-06-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A rare picture in which I don't doubt for a second that it is a masterpiece. The movie has this unique quality in which everything feels so effortless. Ang Lee's direction for this film is among the best I have seen, and the performances areA rare picture in which I don't doubt for a second that it is a masterpiece. The movie has this unique quality in which everything feels so effortless. Ang Lee's direction for this film is among the best I have seen, and the performances are exceptional.",
      "review_date": "2013-06-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a great movie with great actioning. I'm not for the guy's love story line,that was just weird,but if you looking at the base storyline and the acting that came out of this movie. It was a great movie to reflex a different way of life andIt's a great movie with great actioning. I'm not for the guy's love story line,that was just weird,but if you looking at the base storyline and the acting that came out of this movie. It was a great movie to reflex a different way of life and there struggles. I wouldn't pay for this movie in the theater,because of the storyline. I waiting to it came on the movie channels before I watched it.",
      "review_date": "2011-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't give many tens, but this deserves it. Aside from being beautifully directed, with great technical aspects, as well as great acting, this is one of the most beautiful scripts of the 21st century so far. It didn't surprise me when II don't give many tens, but this deserves it. Aside from being beautifully directed, with great technical aspects, as well as great acting, this is one of the most beautiful scripts of the 21st century so far. It didn't surprise me when I found out Annie Proulx was a finalist for a Pulitzer for the short story, which is translated very well by the two screen writers. The movie starts out very innocent and sweet, and then it starts to turn into a gradual downward spiral of devastation until you're just left emotional knocked out by the end of the movie. The themes of society's influence on human behavior, the desire for happiness, and demise caused by obsession, are all subtly, yet powerfully, conveyed in this movie. Calling this a gay love story is like calling Lord Of The Rings a movie about hiking. This is one of the most torturous, psychological portrayals of two people's lives I've ever seen in a movie. It's so well calculated, without coming off the least bit unnatural. I've seen it several times, and I still pick up on things that I hadn't caught onto before. I heard it was a groundbreaking movie about a gay romance, and I didn't get how that was, since there had been many movies about gay romances before. I figured it was probably an overrated movie. When I saw it, I realized I couldn't have been more wrong. Your emotional connection will be irrelevant to your sexual orientation. What is really going to connect you to the movie are your ideas about the pressure to conform to society, compared to your desire to live a life of happiness. One man chooses conformity, and the other chooses happiness, and it doesn't necessarily end up how you might expect. I'm actually getting emotional writing this, thinking about the movie. I really hope everyone who watches it is able to pick up on the subtle themes, the hidden meanings behind specific lines, and the inner thoughts of particular characters who might not be ready to say those thoughts out loud, or even admit them to themselves. Those kind of things are extremely difficult to incorporate into a script without losing its realistic feel, but this movie does it. Of course, it might take a few views to pick up on everything. Whether you're judging this movie on its intelligent, calculated writing, its technical achievements, its performances, of which Heath Ledger's is one of the best of the 21st century, or its overall directing, or if you judge a movie on its emotional appeal, and its powerful, thought provoking themes, I can't see how you objectively give this movie anything less than a strong review.",
      "review_date": "2012-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "First, let me say that I really hate it when the hero gets killed by a deus ex machina. \rIn many ways like Million Dollar Baby, another Hollywood tear-jerker where way too attractive actors & actresses pose as real people in a naturalisticFirst, let me say that I really hate it when the hero gets killed by a deus ex machina. \rIn many ways like Million Dollar Baby, another Hollywood tear-jerker where way too attractive actors & actresses pose as real people in a naturalistic world full of artifice.  I did feel a smidge sad when Heath found his shirt (though I saw it coming when the shirt went missing in reel 2), but mostly I felt that these two dudes were too mopey and existential to be real gay cowboys. I mean, unless I missed something, they're not supposed to be French, are they? They behaved like starry-eyed teenagers past the point (and age) of believability; as much as I could buy the first half hour of meet-cute and the last five minutes of human loss, the big fat middle was a dull TV message-movie. Did Matthew Shepherd really die for this? And brand me a stereo-typer, but (in my limited experience) of most of the gay couples I've met, at least one of the partners displays way more of a fey affect then either of these two stoic shepherds ever showed.",
      "review_date": "2006-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ang Lee's story on two gay loving cowboys is just a complete waste of my time. I never thought that after lee's blockbuster bust, \"Hulk\"  that he would create something completely worse. Sadly he does. First off, the story is just ridiculous.Ang Lee's story on two gay loving cowboys is just a complete waste of my time. I never thought that after lee's blockbuster bust, \"Hulk\"  that he would create something completely worse. Sadly he does. First off, the story is just ridiculous. A lot of the movie is just sex, which had plenty of scenes that i've never want to see ever again. The acting may be decent, but when you put these characters in a story like this, it just doesn't work. Plain and Simple. Honestly, I think Lee can do much better than this crap. He somewhat did that with \"Life of Pi\", but I'm still waiting for that one movie of his that'll hopefully redeem him as one of the greatest directors of our time. But right now, this what we're stuck with. Overall, this movie is a terrible storyline to go off of.",
      "review_date": "2013-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My girlfriend dragged me out to see this: A movie about two male farmers that fall in love but hardly say anything  to each other throughout the whole movie, all while pretending to be straight even having female wives. An overrated movie, myMy girlfriend dragged me out to see this: A movie about two male farmers that fall in love but hardly say anything  to each other throughout the whole movie, all while pretending to be straight even having female wives. An overrated movie, my girlfriend even apologized to me for taking me to see it because she didn't like it either since the gay couple hardly ever said anything to each other. It's an okay drama that also shows the dangers and hostile perceptions gay men experience in society, worth watching once, but doesn't live up to the hype. 6/10 for a mediocre movie.",
      "review_date": "2012-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A ridiculous movie of which the critics feel compelled to like. I read reviews of this movie from them before the thing was even available for their viewing. It is a chick-flick meant to show that even gay men can be sensitive, and caring. IA ridiculous movie of which the critics feel compelled to like. I read reviews of this movie from them before the thing was even available for their viewing. It is a chick-flick meant to show that even gay men can be sensitive, and caring. I would be willing to bet there isn't a straight man in America that went to see this piece of psuedo-gay porn voluntarily. They went only because their wives and girlfriends wanted them to. If this were about two women it maybe, MAYBE would have made it onto the Lifetime channel.",
      "review_date": "2015-07-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Incredibly dull movie about gay cowboys, that probably wouldn't get any popularity, if it wasn't about homosexuals. I'm not any sort of homophobe, but giving a boring movie, without any plot twists, deeper meaning or action high grade, justIncredibly dull movie about gay cowboys, that probably wouldn't get any popularity, if it wasn't about homosexuals. I'm not any sort of homophobe, but giving a boring movie, without any plot twists, deeper meaning or action high grade, just because it tells a story about gays is plain riddiculous.\r Avoid it like plague, unless you are deeply involved in some sort of LGBT movement or you can't sleep at night and need something to help you achive that state.",
      "review_date": "2014-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "GROSSSSS NASTY dont watch this there is no such thing as gay cowboys",
      "review_date": "2013-06-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A boring \"love story\" about two gay men that only want to have sex. Basically, this movie is a non-explicit pornography. I don't understand all the hype.",
      "review_date": "2011-08-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As a gay man with gay friends... none of us felt this was a realistic depiction of the way it happens. This movie is a tragedy (in the Romeo and Juliet sense) that could have had power, but failed because of it's completely As a gay man with gay friends... none of us felt this was a realistic depiction of the way it happens. This movie is a tragedy (in the Romeo and Juliet sense) that could have had power, but failed because of it's completely non-believable depiction of how the relationship formed. If anyone thinks Ang Lee may be homosexual... I would have to say he can't be. Not if he directs a movie with such an unrealistic development of a gay relationship.",
      "review_date": "2008-12-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gay cowboys are far from my idea  of an American love story.  Only another attempt of Hollywood to stuff the gay lifestyle down our throats. (no pun intended)  As much as they would like to think this is the norm, it is not, and it is not acceptable.",
      "review_date": "2006-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Looked great, great script, excellent sound track, but I just did not believe that Heath Ledger was into it. I didn't believe the love story/20 year grand passion worked - so it didn't really work for me.",
      "review_date": "2006-02-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sick and twisted. If you are a heterosexual male, save your money for anything else.",
      "review_date": "2005-12-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Teh first half of the movie is a Marlboro commercial. I was expecting the \"Come to where the flavor is\" voice. The second half is a failed gay compassion provoking video. We all know to be gay is ok, it is something normal to love. So, Teh first half of the movie is a Marlboro commercial. I was expecting the \"Come to where the flavor is\" voice. The second half is a failed gay compassion provoking video. We all know to be gay is ok, it is something normal to love. So, another love soap opera with a west side cowboys scenario was uneccessary.",
      "review_date": "2006-02-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm sure the book is good. However, this is one truly boring and terrible movie. The plot is thin and incredibly unexplained, and no I'm not talking about the ending because I GOT IT, but the fact that the men could have wives and I'm sure the book is good. However, this is one truly boring and terrible movie. The plot is thin and incredibly unexplained, and no I'm not talking about the ending because I GOT IT, but the fact that the men could have wives and children and still be in love with each other could have used much more explanation. I don't know why people don't question that. I understand how it is, but it saddens me, as a gay man, to have this garbage strewn onto the public without any explanation. The cinematography is good, the acting is good, the story is terrible, and it is very very very boring. I know slower moving movies that kept me more entertained that this garbage. I can't believe people think this is 'artful'. It wouldn't take very much for me to come up with a better screenplay involving the forbidden love of two men - making it more interesting, more developed, and could probably even add a twist ending to it. But alas, this is what we get. And it gets all of it's good reviews just because conservative America isn't used to contemporary life. Shame.",
      "review_date": "2006-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If u like watching 2 guys in a movie get it on i do recammend this.not 2 mention it starts out very slow.",
      "review_date": "2006-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow! Talk about overrated! The most unforgatble Love Story becomes excatly that! Forgatble! I was actually looking forward to seeing this movie. But as I sat there watching couldnt help but feel a little cheated. People say it is Greek Wow! Talk about overrated! The most unforgatble Love Story becomes excatly that! Forgatble! I was actually looking forward to seeing this movie. But as I sat there watching couldnt help but feel a little cheated. People say it is Greek Tragedy or what have you. To me the story could have been more. There are some nice moments where we feel the characters pain having to deal with this uncontrollable feeling. They are very well directed. However there really was not that big of drama! I have an open mind and that is why i wanted to see this movie. but it really did not deliver to me. I dont know what it is. it just was not there. I guess it has to be moments where Hey they get spotted acting a little to friendly with each other but nothing happens... This is a sad story. Well worth at least one time glance but nothing more. Just Over rated! Now Ang Lee can get back to more important movies Like \"Hulk II\"",
      "review_date": "2006-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most overated movies of the year.",
      "review_date": "2005-12-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Will no one criticize this trite, overacted, and, most importantly, overrated tribute to America's continued love affair with celebrity directors, handsome actors, and subject matter that deems a film above reproach? I guess not. Get in Will no one criticize this trite, overacted, and, most importantly, overrated tribute to America's continued love affair with celebrity directors, handsome actors, and subject matter that deems a film above reproach? I guess not. Get in line, the are a couple of spots on Ang Lee's butt that have not been kissed.",
      "review_date": "2005-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My wife & I just saw this film and we both came away generally bored, unmoved, and feeling duped by all the hype. Beautiful scenery and cinematography, reasonable depiction of herding sheep on summer range, good cast, and fair acting My wife & I just saw this film and we both came away generally bored, unmoved, and feeling duped by all the hype. Beautiful scenery and cinematography, reasonable depiction of herding sheep on summer range, good cast, and fair acting (nothing special, as others seem to think). BUT: The story is just not engaging. There's no chemistry between the lovers, no flirting nuances, no buildup. In fact, their initial lovemaking seems more like an impulsive act of rape. Like one of the other reviewers herein, I think I must have missed the \"love\" part (maybe I dozed off). And much of the rest of the story is either implausible or uninteresting. Will they finally get together and live happily ever after? We simply don't care. One of the \"great films of all time\"? No way. Even if you narrow the category to gay films, it's not even in the same league as \"The Crying Game\". I'm always perplexed when I'm in such disagreement with the reviewers, especially the \"user comments\" on this site, with which I normally agree. So I analyzed the data a little more carefully. For the weekend of Jan. 13-15, BBM (in its 6th week) grossed $5.8M, which is in ninth place. Seems odd that, by now, word of mouth for this monumental film would be doing at least as well as \"Memoirs of a Geisha\" or \"Fun With Dick & Jane\". I know, \"there's no accounting for taste\". I also looked at the Top 10 films of 2005 where, based on critics' reviews, BBM is #6. Excluding BBM, the average number of User Comments for the other top 9 films is 43. BBM, on the other hand, has over 460 User Comments. Seems odd that a film that is generating so much positive feedback from users would not be doing better at the box office. Or could it be that the ballot box is getting stuffed by folks with an agenda, trying to generate interest and help its chances for an Oscar. Just a thought.",
      "review_date": "2006-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Way overrated. A minimalist movie missing a script and emotional depth. Should not be in the running for awards. Can't really see why so many critics thought it was terrific. But then again critcs liked Lost in Translation too.",
      "review_date": "2006-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was so boring. The characters had no depth, and they hardly spoke!",
      "review_date": "2006-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An overcontrived love movie. Honestly, politics aside, it's just a love story but with a guy instead of a gal. Rated so high out of fear that they'll be accused of being a homophobe. Really, nothing special here.",
      "review_date": "2006-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yawn! Why is being gay still such a big deal? Who cares? and why does anyone who disagrees with the content of this movie or questions the endless obession with gay themes in hollywood and TV get labelled as homophobic? Boring movie anyway Yawn! Why is being gay still such a big deal? Who cares? and why does anyone who disagrees with the content of this movie or questions the endless obession with gay themes in hollywood and TV get labelled as homophobic? Boring movie anyway but is the usual sentimental crap that gets oscars. Desite that solid acting from the two leads.",
      "review_date": "2006-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was boring and way too long. I expected something much better.",
      "review_date": "2006-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another attempt by the 'liberal intelectuals' and 'I- am-proud-to-be-morally-neutral' film-makers to impose upon society in a cunning and subtle way the concept of gay 'love' as perfectly normal.",
      "review_date": "2006-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is a huge disappointment from many levels. the most noticeable part of the film is it's drawn out length. this film could have been done in 15 minutes instead of 2 hours and 30 minutes. the themes are so overdone in gayThis film is a huge disappointment from many levels. the most noticeable part of the film is it's drawn out length. this film could have been done in 15 minutes instead of 2 hours and 30 minutes. the themes are so overdone in gay literature and film and this not only gives straight people an inadequate perception of gay people but it also works to give gay people a distorted and dismal perspective of themselves. for example, why are all gay relationships tragic and end in death??? why is this theme so repeated and overdone. all gay relationships do not end this way but sure, in the literature and this film totally colors within these lines. this film if anything gives the message to not be gay or you will be murdered or end up in a dead end relationship that can't work. (thx matthew shephard rip off storyline) . there is nothing inspirational or motivating about this film. as a gay man this film leaves me with a huge feeling of disgust at the overused and offensive stereotypes (while the limp wrist lisping type is totally avoided, you still have closeted tragic love and a relationship based on carnal proximity and no spiritual or real communication oriented committments) this is a horrible film overall. 3 points just because it's gay themed and \"hollywood\" everything else that basically matters in this film is absent and it's found lacking.",
      "review_date": "2006-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yet another of Hollywood's attempts to indoctrinate immorality into the common culture and pretend that homosexuality is normal. The idea of co-mingling with a sweaty cowboy with a saddle chapped behind after a long day's workYet another of Hollywood's attempts to indoctrinate immorality into the common culture and pretend that homosexuality is normal. The idea of co-mingling with a sweaty cowboy with a saddle chapped behind after a long day's work somehow isn't appealing. Gives new credence to Willie Nelson's song \"Mama, don't let your children grow up to be fag cowboys\"",
      "review_date": "2006-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is absurdly sick. The very moral fiber of our country is deteriorating. I grew up ranching and, trust me, any real self respecting cowboy would not appreciate this. Homosexuality is not part of being a cowboy and has no place in aThis movie is absurdly sick. The very moral fiber of our country is deteriorating. I grew up ranching and, trust me, any real self respecting cowboy would not appreciate this. Homosexuality is not part of being a cowboy and has no place in a western movie. Get real people, wake up! You're being misguided by Hollywood and don't even realize it.",
      "review_date": "2006-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "[***SPOILER***] Under normal circumstances, I would say this movie is OK. Given the hype, critical acclaim, and the numerous award nominations, I have to say this film is a fraud. Don't believe the hype. The cinematography is good and [***SPOILER***] Under normal circumstances, I would say this movie is OK. Given the hype, critical acclaim, and the numerous award nominations, I have to say this film is a fraud. Don't believe the hype. The cinematography is good and that's about it. Given that this story is about two men and given the length of the film, I was surprised that the primary characters are not even well-developed. When one dies, you don't even care b/c there's no heartfelt interest in him. Heath Ledger as best actor??? I couldn't believe how bad he was, unless you think talking without moving your lips is difficult. I had to stop myself from laughing out loud at his acting during one dramatic, emotional scene. I could not wait for this movie to be over ... it is soooo boring. After seeing the movie, I do believe a few that I've heard opine that this film's critical success is due to a liberal political agenda. That's the only thing that makes sense, b/c it's not that good. OK at best.",
      "review_date": "2006-02-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "THE WORST movie I have ever witnessed. I let a ladyfriend talk me into watching it with her(things we do for love). Not that I am homophobic, but the movie had no redeeming characters, just endless minutes of the misery broughjt on by one THE WORST movie I have ever witnessed. I let a ladyfriend talk me into watching it with her(things we do for love). Not that I am homophobic, but the movie had no redeeming characters, just endless minutes of the misery broughjt on by one summer at brokeback mountain. Watching 2 men destroy their own lives as well as the lives of their familys isn't enteraining in the least, and by the end of the movie I could understand either of them becoming suicidal, I know I was by the time it was over. The only redeeming quaulity was that you were so thankful when it was over.",
      "review_date": "2006-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What was that piece of garbage the only thing that comes to my head is \"gay cowboys\" looks like a plot taken out of a South Park episode the only reason it got good reviews is because people like seeing gay guys get beatin to death and thatsWhat was that piece of garbage the only thing that comes to my head is \"gay cowboys\" looks like a plot taken out of a South Park episode the only reason it got good reviews is because people like seeing gay guys get beatin to death and thats the only reason. i'm not gay or anything but c'mon people that has to be one of the supidist films i've ever seen i think they should re-phrase the title for a better warning \"Bend over Mountain",
      "review_date": "2006-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Other than the acting, this movie has no appeal. The story is of two immature men who fall in love, but not to the point where they would have cared to do much about it. Sure they met up quite a few times, but I can't get beyond how Other than the acting, this movie has no appeal. The story is of two immature men who fall in love, but not to the point where they would have cared to do much about it. Sure they met up quite a few times, but I can't get beyond how pathetic they seemed with being completely unable to give themselves to one another while breaking the hearts and shattering the lives of the women who they pretended to care about. The only emotions I felt during the entire movie were for Michelle Williams' character.",
      "review_date": "2006-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hopelessly melodramatic. If this had been a film about a man and a woman, the critics would not be \"emotionally affected\" by the heartbreaking story of two people in love- they would be condemning the selfish nature of their affair and the Hopelessly melodramatic. If this had been a film about a man and a woman, the critics would not be \"emotionally affected\" by the heartbreaking story of two people in love- they would be condemning the selfish nature of their affair and the impact this would have on their families (wives/husbands and children). Because this has gay characters (and played by two straight actors i might add...since when were REAL gay actors unemployable in Hollywood???) all of a sudden it's a masterpiece. For heaven's sake let's all get a grip! Not once has anyone stopped to think of the emotional pain and hurt inflicted on those wives in this film..that's the most reprehensible thing about it. The film focuses on the cowboys' love and ignores the pain, betrayal and grotesque selfishness exemlpified by the two leading guys on thier wives and children. Grotesque. Horrible. Awful. Since when was infidelity, cheating and betrayal noteworthy? Everyone makes choices...all this film showed was that these two guys were not MAN enough to make their choices and live by them. Their guilt and depression are clearly attributed to their pathetic sense of themselves. NO sympathy for those characters...only the women who yet again...seem to have been left by the wayside. It looks like soon homosexual rights will outdo womens' rights. What a sham.",
      "review_date": "2006-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "for god's sakes. Why does anyone care about this movie? Its about two cowboys who are like \"this town ain't big enough for the both of us; so lets go into the mountains and have sex!\" just because Heath Ledger and Jake Gillenhalfor god's sakes. Why does anyone care about this movie? Its about two cowboys who are like \"this town ain't big enough for the both of us; so lets go into the mountains and have sex!\" just because Heath Ledger and Jake Gillenhal wanna become boofers, doesnt mean its an academy award winner! seriously...",
      "review_date": "2006-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of those Love or HATE movies... its a love story, not a bad plot because its almost the same story as all love stories except one thing. It was about gay men in the west. Also too long and too boring for people that like to go to This is one of those Love or HATE movies... its a love story, not a bad plot because its almost the same story as all love stories except one thing. It was about gay men in the west. Also too long and too boring for people that like to go to the movies to be entertained or amazed.",
      "review_date": "2006-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "2 given for scenery only. Slow and very boring. Two men fall in love, get married, home with their families, then get together then home with their families, then get together on and on. This movies wasn't about homosexuality, it was 2 given for scenery only. Slow and very boring. Two men fall in love, get married, home with their families, then get together then home with their families, then get together on and on. This movies wasn't about homosexuality, it was about bi-sexuality. Pet peev... Why is that minority groups continue to group themselves, segregate themselves and then make the claim that they are ostracized from the rest of society. I agree live and let live, love and let love but I have to ask by what rating system or standard did this this movie received such great reviews. My concern, the way this movie was done could cause more harm than good to the group of people it was supposed to represent. There are more effective ways to be heard.",
      "review_date": "2006-04-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this movie is a horrible example of a movie. The actors in this moive should be ashamed. I am disapointed. I want my money back.",
      "review_date": "2006-04-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A disappointing movie. Sorry, but I just didn't see the chemistry between Heath and Jay. I found it hard to understand some of the dialogue and might have missed key points because of this. The movie just didn't speak to me. I A disappointing movie. Sorry, but I just didn't see the chemistry between Heath and Jay. I found it hard to understand some of the dialogue and might have missed key points because of this. The movie just didn't speak to me. I thought it was over-rated.",
      "review_date": "2006-04-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Why would you make such a movie that expresses homosexuality in such a positive light. It is a sin to love thy gender as stated in the 10 commandments, therefore all knowing good people of this earth should protest the grotesque visualizationWhy would you make such a movie that expresses homosexuality in such a positive light. It is a sin to love thy gender as stated in the 10 commandments, therefore all knowing good people of this earth should protest the grotesque visualization of sodomy. God Hates FAGS and black people, but mostly FAGS!!!!!!!",
      "review_date": "2006-04-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A cure for insomnia, a modest love story. It gets noticed because it breaks traditional stereotypes, that's it. It would be like having a teen movie full of heavily clothed teen women, and teen guys that AREN'T trying to have sex. A cure for insomnia, a modest love story. It gets noticed because it breaks traditional stereotypes, that's it. It would be like having a teen movie full of heavily clothed teen women, and teen guys that AREN'T trying to have sex. Or having a sports movie where the underdog gets completely destroyed. OOO SHOCKING AND CREATIVE. I know some people will blast me as a homophob (a typical reaction to critics of critics of this film) but I fell asleep 3 times during this movie because it movies at the pace of a sedated sloth.",
      "review_date": "2006-04-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "HORRIBLE! just because its about life as a homosexual cowboy in the 1960's-1980's is the only reason it won any awards. horrible is not a good enough word to describe this story. i have plenty of gay friends who agree with me. its HORRIBLE! just because its about life as a homosexual cowboy in the 1960's-1980's is the only reason it won any awards. horrible is not a good enough word to describe this story. i have plenty of gay friends who agree with me. its just a bad movie. period. thats it. im actually speechless cause i cant believe it won ANY awards at all!",
      "review_date": "2006-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was the worst gay themed movie ever made. The story was completly disappointing. And what was with the accent of the stars? Were they shooting for a southern or cowboy accent that didn't make them sound like a retard? Heath This movie was the worst gay themed movie ever made. The story was completly disappointing. And what was with the accent of the stars? Were they shooting for a southern or cowboy accent that didn't make them sound like a retard? Heath ledger was so uncomfortable in all his scenes and it shows. He mumbled many of the lines or failed to deliver them properly. The absurd notion that jack twists wife wouldn't notice that he was a FLAMING homosexual is also unbelievable. Overall the movie was over hyped because it was the first \"mainstream\" exposure to gay issues. \"Boys don't cry\" was a far better movie than this flaming pile of poo. A 1000 monkeys typing for a 1000 days would come up with a better gay drama than this weak showing from Ang Lee who is overblown as a director.",
      "review_date": "2006-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good actors and beautiful setting. Boring movie.",
      "review_date": "2006-05-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An over rated movie that destroys the most recognizable icon of America, the Cowboy.",
      "review_date": "2006-05-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The feeling is so strong if ...you knew that no body knew you stuck in love with that man..normal people don't understand that feeling..so of course they feel disguisting and ..decent it. you people don't know...that miracle The feeling is so strong if ...you knew that no body knew you stuck in love with that man..normal people don't understand that feeling..so of course they feel disguisting and ..decent it. you people don't know...that miracle feeling....man love man even just for sex...but it's very strong...and make u cry and cry....my god.",
      "review_date": "2009-05-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Why is Hollywood promoting life-threatening sexual behavior in a movie on the one hand and full of male actors who continue to be insulted by being called even remotely feminine, much less gay. This is NOT about love, because if you love Why is Hollywood promoting life-threatening sexual behavior in a movie on the one hand and full of male actors who continue to be insulted by being called even remotely feminine, much less gay. This is NOT about love, because if you love someone, you do not ask them to engage in harmful behavior!",
      "review_date": "2005-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Please! This is over-rated propaganda. Very disturbing.",
      "review_date": "2005-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Why is this film garnering so many 10s from us individual critics? The only thing worthwhile about this film is the theme, and that is never enough to create a good story. For my part, I live in the desert, and am no stranger to its Why is this film garnering so many 10s from us individual critics? The only thing worthwhile about this film is the theme, and that is never enough to create a good story. For my part, I live in the desert, and am no stranger to its seduction. When I wake up in the morning, I see scenery just as beautiful if not more so than in the film, and this landscape is populated by plenty of people whose lives will never be celebrated in particular or archetype. The form of the story is excellent, but the story itself is painfully old fashioned and the obsessive focus on the lovers was truly tiring. Why was further attention not paid to the wives? The children? The community? The supposed murderers? Surely their characters are just as interesting as the two dimensional (though beautiful) Ennis and Jack. Just because it's about gay cowboys doesn't make it worth the filmstock it was printed on. It may have been remarkable, but it is not truly great.",
      "review_date": "2006-01-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Boring and overlong; does not engage the emotions. If it wasn't about gay men the critics would have slammed it.",
      "review_date": "2006-01-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was so unfathomably boring I almost fell asleep. I kept waiting for something to happen, but the plot was very dul. This is supposed to be a love story, but, not only was love never mentioned, there didn't seem to be any real This movie was so unfathomably boring I almost fell asleep. I kept waiting for something to happen, but the plot was very dul. This is supposed to be a love story, but, not only was love never mentioned, there didn't seem to be any real passion between any of the characters. I was terribly dissapointed because the reviews of this movie were so good, and in reality, it is very bad. This movie somehow makes me believe that critics are playing a joke on American society to see how many suckers they can get to sit through this terribly dull film.",
      "review_date": "2006-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gotta give credit for the actors to pull off the characters, but other than that",
      "review_date": "2006-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is sick! Why do most movies in this day and age have to be about homosexuality? Is nothing sacred anymore? What's next lesbian nuns? Real Cowboy's are what made this country what it is today. This movie destroys the This movie is sick! Why do most movies in this day and age have to be about homosexuality? Is nothing sacred anymore? What's next lesbian nuns? Real Cowboy's are what made this country what it is today. This movie destroys the moral fiber that a real Cowboy believes in.",
      "review_date": "2006-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ridiculously over-praised. It's sloppy melodrama with one-dimensional characters and shakey film craft. People are falling all over themselves to praise this because of the gay plot, but if this was about a man and a woman on Brokeback Ridiculously over-praised. It's sloppy melodrama with one-dimensional characters and shakey film craft. People are falling all over themselves to praise this because of the gay plot, but if this was about a man and a woman on Brokeback Mountain, no one would notice or care.",
      "review_date": "2006-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I planned to spend the night after watching Brokeback trying to formulate my opinions of the movie into a clear up or down vote. The thought process took place as i was watching however, i found myself annoyed at the choppy editing, showing I planned to spend the night after watching Brokeback trying to formulate my opinions of the movie into a clear up or down vote. The thought process took place as i was watching however, i found myself annoyed at the choppy editing, showing 2 or 3 seconds of a certain image as if it was something that was required to be filmed and then moving on to another image without time for reflection. The whole movie seemed like a search through photographs from a long time ago, the viewer spends only a short while on any one picture and isnt able to really put themselves in the position of any of the people they are seing. I went into Brokeback ready and willing to be blown away, but when all was said and done this year's \"best picture\" seemed little more than a second-hand tale.",
      "review_date": "2006-01-24",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 140,
  "genres": [
    "Drama",
    "Romance",
    "Western"
  ]
}