{
  "title": "Howl's Moving Castle",
  "rating": 8.8,
  "release_date": "2005-06-10",
  "genre": [
    "Adventure",
    "Fantasy",
    "Romance",
    "Animation"
  ],
  "summary": "An amazing new animated adventure that celebrates the power of love to transform and the resiliency of the human spirit in the face of adversity.  (Disney)",
  "critic_reviews": [
    "Though it's difficult to work out what's going on, it's never boring.",
    "An organic, childlike wonder, fabulously unpredictable and seethingly inventive.",
    "You run across animation this ingenious about as often as a moving castle comes your way.",
    "Perfect for anyone with a youthful heart and a rich imagination.",
    "Parse it any way you like, Miyazaki's gifts as an animator place him in a category of his own. To see his latest film is to be somehow reminded of Italians who could hear Verdi's operas as soon as they were sung or English readers who could experience the novels of Dickens episode by episode.",
    "The movie's dreamlike spaces and characters are sometimes worthy of Lewis Carroll.",
    "Howl's Moving Castle is one animated epic that has it all: poetic intensity, potent storytelling, vivid and surprising characters, and intoxicating powers of visual imagination.",
    "It's one of the best and strangest films of Miyazaki's career.",
    "Howl's Moving Castle has the logic of a dream: behind every door lie multiple realities, one more astonishing than the next.",
    "The plot is pretty convoluted, but Miyazaki has a very good handle on it and lavishes his customary heart, humor, and inventiveness on every situation he depicts.",
    "A picture from an old man working at the top of his game.",
    "The worldview, the sense of childlike fun shaded with adult melancholy, and the joyful, serene attention to visual oddity and wordless beauty could only be made in Japan. And, specifically, made by Hayao Miyazaki.",
    "Movie magic is only as powerful as the imagination that casts it. Japanese master Hayao Miyazaki's imagination is the most creative in animated filmmaking.",
    "The perfect e-ticket for a flight of fancy into a world far more gorgeous than our own. The film doesn't halve itself to appeal to two generations. At its best, it turns all moviegoers into innocent kids, slack-jawed with wonder.",
    "Another soulful gem from the peerless Japanese animator Hayao Miyazaki.",
    "Sophie, in both her incarnations, joins an impressive sisterhood of Miyazaki heroines, whose version of girl power presents a potent alternative to the mini-machismo that dominates American juvenile entertainment. Not that children are the only viewers likely to be haunted and beguiled by Howl's Moving Castle - all that is needed are open eyes and an open heart.",
    "In the best moments of Howl's Moving Castle and in his extraordinary body of work, Miyazaki teaches his viewers more valuable lessons.",
    "There's a word for the kind of comic, dramatic, romantic, transporting visions Miyazaki achieves in Howl's: bliss.",
    "Clever and often enchanting.",
    "The tireless volley of ideas and inventions make this a delight that should connect with kids and adults in both dubbed and original-language versions.",
    "Miyazaki's animated adaptation of Jones' book is a charming and thoroughly absorbing treat.",
    "You'll gladly surrender to the whole gorgeous muddle.",
    "Because of its convolutions, Howl's Moving Castle isn't quite as transporting as \"Spirited Away.\" But it's a moving bridge between his lyrical fancies and his outrage. Miyazaki is like a soulful cartographer of the soul, mapping our inner landscape, leaving us bedazzled.",
    "It is almost inevitable that Miyazaki, often compared to C.S. Lewis and J.K. Rowling, should have found in Diana Wynne Jones a kindred spirit.",
    "Miyazaki may not have achieved the level of \"Spirited Away,\" but he's still ahead of the curve.",
    "A richly inventive, slightly eerie animated movie from Japan.",
    "The story, which also involves an asthmatic dog and a scarecrow, is more accessible than \"Spirited Away\" but less transporting than that Oscar-winning masterpiece.",
    "The filmmaker's obsessions have got the better of him. That said, I can't recommend the film highly enough, since bad Miyazaki is still leagues better than anyone else.",
    "A wise and wonderful parable.",
    "With its bold screen-filling imagery, this is definitely a movie to be relished on the big screen.",
    "While Howl’s Moving Castle is far from perfect, it’s still a very good movie. It’s just not a great one.",
    "The voice acting, from new Batman Bale to the almost unrecognizable Bacall is fine – even Crystal reigns in his usual Borscht Belt bravado – if a little plain.",
    "While the movie contains delights and inventions without pause and has undeniable charm, while it is always wonderful to watch, while it has the Miyazaki visual wonderment, it's a disappointment, compared to his recent work.",
    "Miyazaki's movies are as stunning as they are confounding.",
    "Just as Miyazaki seemed on the verge of properly crossing over, he serves up an anime riddle wrapped in an enigma - though with all his usual charm, wit and hand-drawn beauty.",
    "The plot of Howl's Moving Castle meanders so listlessly that its details become less and less charming.",
    "The movie made almost no sense whatever to me. I literally could not follow it, even as I was dazzled by it.",
    "The movie is practically incomprehensible.",
    "Miyazaki, like an evil sorcerer, has plucked the heart out of Jones's story and left it there to die."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "It was super! it's soooo beautiful!! and fun to watch and wonderful characters. I loved Sofie and I loved Howel and I loved Calcifer! and just everybody! and the surroundings were sooo beautiful! Miyazaki is a genius, as we all know, It was super! it's soooo beautiful!! and fun to watch and wonderful characters. I loved Sofie and I loved Howel and I loved Calcifer! and just everybody! and the surroundings were sooo beautiful! Miyazaki is a genius, as we all know, and Ghibli's films are always very well drawn, and Diana Wynne Jones isn't famous without reasons, so it's no wonder that the film is so great! I want to see it again, and again, and again, and own it. this is gonna be my precious.... ^_^",
      "review_date": "2005-10-06"
    },
    {
      "review_title": null,
      "content": "I never grow tired of watching this show...charming, beautiful, classic...better than the book to me.",
      "review_date": "2009-07-03"
    },
    {
      "review_title": null,
      "content": "Japanese Animation still lives on in this super brilliant movie Howl's Moving Castle. the animation was beautiful, the characters were amazing, and the visuals kick a**.",
      "review_date": "2010-10-24"
    },
    {
      "review_title": null,
      "content": "I'm totally speechless! \"Howl's Moving Castle\" is a real anime masterpiece! For me it's amazing just like \"Spirited Away\", i would even say a little better! It's full with action,fantasy and beautiful moments! I really think that if you haveI'm totally speechless! \"Howl's Moving Castle\" is a real anime masterpiece! For me it's amazing just like \"Spirited Away\", i would even say a little better! It's full with action,fantasy and beautiful moments! I really think that if you have no imagination you shouldn't watch movies like this. But if you love magic,dreams and fantasy, no matter how old you are i HIGHLY recommend to you this movie! My final score for Hayao Miyazaki's perfect movie is 10/10 ",
      "review_date": "2013-05-01"
    },
    {
      "review_title": null,
      "content": "Howl's Moving Castle is a great offering from visionary writer and director Hayao Miyazaki. On a technical level, the film is a masterpiece. Beautifully animated with a gorgeous score and charming characters, Howl's Moving Castle also has aHowl's Moving Castle is a great offering from visionary writer and director Hayao Miyazaki. On a technical level, the film is a masterpiece. Beautifully animated with a gorgeous score and charming characters, Howl's Moving Castle also has a very nice anti-war message, and provides a fun love story. I will say the overall story is one of Miyazaki's weaker ones, as there are a TON of subplots to follow and sometimes it's hard to keep track of everything that is going on and how all of the characters relate to each other.",
      "review_date": "2017-12-04"
    },
    {
      "review_title": null,
      "content": "With thrills, heart, love, visual beauty and humor and the great original score Hayao Miyazaki has directed another fantastic and beautiful adeventure. I give this move 95%.",
      "review_date": "2011-12-27"
    },
    {
      "review_title": null,
      "content": "\"Howl's Moving Castle\" is amazing with powerful visuals. Mostly the symbolism of the movie, that life can be seen through adversity, was very touching and true. It's a movie you would like and become spellbound to.",
      "review_date": "2011-09-29"
    },
    {
      "review_title": null,
      "content": "It was almost totally incomprehensable. I was pretty much hoping they would finally fall over a cliff and get it over with.... a huge dissapointment given the glowing ratings from most sources.",
      "review_date": "2006-03-22"
    },
    {
      "review_title": null,
      "content": "Complete mess, aswell as weakest Ghibli movie so far.",
      "review_date": "2006-03-08"
    },
    {
      "review_title": null,
      "content": "This movie stinks!",
      "review_date": "2008-09-26"
    },
    {
      "review_title": null,
      "content": "Howl's Moving Castle is a beautifully animated fantasy film. As usual with Gibili anime, the movie delivers some intense sweetness and some subtle catharsis. That said, Howl's Moving Castle also has a fair few problems, including someHowl's Moving Castle is a beautifully animated fantasy film. As usual with Gibili anime, the movie delivers some intense sweetness and some subtle catharsis. That said, Howl's Moving Castle also has a fair few problems, including some incomprehensible fantasy weirdness,  weak character motivations (why exactly is the movie's villain bent on war?) and too many coincidences. But it's altogether a fun adventure.",
      "review_date": "2013-03-18"
    },
    {
      "review_title": null,
      "content": "Stunning animation and charmingly idiosyncratic characters fail to make up for an incomprehensible, utterly nonsensical plot- even by anime standards. I never once felt like I understood what was going on. What, exactly, is this \"war\" about?Stunning animation and charmingly idiosyncratic characters fail to make up for an incomprehensible, utterly nonsensical plot- even by anime standards. I never once felt like I understood what was going on. What, exactly, is this \"war\" about? Who is the Witch of the Waste, and why did she curse Sophie? Who is Howl? Why does the moving castle have a tongue? Perhaps the answers to these questions can be found in the book on which the film is based, but you won't find them here. Children and adults alike will enjoy the intricate, vibrantly colored artwork that fills each and every frame of \"Howl's Moving Castle,\" but I doubt many among us would be able to explain just what the heck the movie was about. Miyazaki's previous film, \"Spirited Away,\" is a far superior work.",
      "review_date": "2012-12-07"
    },
    {
      "review_title": null,
      "content": "Segundo filme da Ghibli que tive prazer de assistir, sua histórias, personagens, visual  que  muito bonito  e sua trilha sonora, fazem esse belo filme uma obra magnífica.",
      "review_date": "2014-01-02"
    },
    {
      "review_title": null,
      "content": "The short answer is that this is a Feminist rant, chick flick, mainly for retarded or soon-to-be retarded kids.Morales that are prominant: Fat people suck, hero men wear earings on both ears, random people will destroy your life, young girlsThe short answer is that this is a Feminist rant, chick flick, mainly for retarded or soon-to-be retarded kids.Morales that are prominant: Fat people suck, hero men wear earings on both ears, random people will destroy your life, young girls should clean houses, war is bad.Some of this is true . . . Good luck figuring out which morals are true after watching this.",
      "review_date": "2018-08-13"
    },
    {
      "review_title": null,
      "content": "first Ghilbi movie here. Was expecting a great anime, since everyone seems surprised i've never watched a Ghilbi movie and apparently they're good. But i was bored to death for the whole 2 hours. 3 points only for the classic art style and animation.",
      "review_date": "2019-09-03"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI am ENRAGED First of all, the stereotypes are KILLING ME. Poor country girl who thinks she's ugly just because she doesn't wear makeup is being hit on by men, saved by a charming prince figure, who then shows up to his house and cleans it like some snow white rip off. The \"master of the house\" sees that as normal, is emotionally and mentally immature as seen in the little back story with having a child's heart, or when he was about to destroy the entire house because his hair color changed. He is seen as the bread winner and LITERALLY GOES TO WAR.Tell me it's based off life in the 50's without telling me it's based off life in the 50's.Second, this girl gets cursed for NO REASON WHATSOEVER by an evil witch who looks like an important character, who then is dehydrated and turn into their grandma? Somebody tell me how this makes sense because it just doesn't. Same grandma who stole the heart to EAT IT basically threathening the entire movie.Third, cursed girl whose curse is irrevresible magically transforms back at certain parts of the film and at night with NO EXPLANATION.Same girl who leaves her hometown doesn't get any homesickness and even when she gets back she has no intent portrayed to visit her home. The mother visits her, doesn't realize her daughter's an old lady, and tries to sabotage the whole thing because of her new rich husband because a husband is more importanf than your daughter who has been missing and is also an old lady.Fourth. Will you please cut me some slack on the love story? If this movie was supposed to be a love story then let me tell you, they failed MISERABLY. NOT ONCE did Howl have a conversation with her, so the idea of \"looks don't matter, personality matters\" is completely dismissed. And I'm sorry to break it to you but the only actually good explanation is that he has a thing for old people In conclusion, people GET YOUR S**T TOGETHER THIS MOVIE HAS NO PLOT, IS SUPER STEREOTYPICAL AND A SNOW WHITE RIPOFF, MAKES 0 SENSE AND THE ENDING IS ABSOLUTE GARBAGE. THANK YOU FOR COMING TO MY TEDTALK.Summary: Read at your own risk",
      "review_date": "2021-06-17"
    },
    {
      "review_title": null,
      "content": "One of the best movies ive seen so far! It was better than Spirited away!",
      "review_date": "2005-10-04"
    },
    {
      "review_title": null,
      "content": "I loved it!",
      "review_date": "2005-10-06"
    },
    {
      "review_title": null,
      "content": "The best movie ever¡¡¡",
      "review_date": "2005-10-07"
    },
    {
      "review_title": null,
      "content": "A very nice, warm and funny film where an aimless girl, who is placed under a spell meets a \"heartless\" wizard and each help each other through various obstacles... The animation and scenes are breathtaking as usual. Double thumbs up! Great A very nice, warm and funny film where an aimless girl, who is placed under a spell meets a \"heartless\" wizard and each help each other through various obstacles... The animation and scenes are breathtaking as usual. Double thumbs up! Great heart-warming film.",
      "review_date": "2005-09-11"
    },
    {
      "review_title": null,
      "content": "This was the best movie that Disney has put its name on in ten years.",
      "review_date": "2005-09-10"
    },
    {
      "review_title": null,
      "content": "The best moovie when i ever seen.",
      "review_date": "2005-09-27"
    },
    {
      "review_title": null,
      "content": "This movie is...amazing. See it, I'm begging you. Perhaps you aren't really into Japanese Animation. You tbink...\"it's just cartoons, kid stuff...\" Some is. But Miyazaki's movies are \"for those who are ten, for those who This movie is...amazing. See it, I'm begging you. Perhaps you aren't really into Japanese Animation. You tbink...\"it's just cartoons, kid stuff...\" Some is. But Miyazaki's movies are \"for those who are ten, for those who will be ten, and for those who used to be ten.\" So please, immerse yourself in the fantastical world of Miyazaki, see it like a child, see it as an adult. You will see something different in each viewing, and this will only make you enjoy it more.",
      "review_date": "2006-03-14"
    },
    {
      "review_title": null,
      "content": "this is a wonderful movie and the sountrack is wonderful.",
      "review_date": "2006-03-21"
    },
    {
      "review_title": null,
      "content": "I love the idea of witches and wizards in a story and Hayao Miyazaki has made Howl's moving castle my favourite movie ever. The storyline is great and the animation is amazing. I loved it!",
      "review_date": "2007-10-21"
    },
    {
      "review_title": null,
      "content": "One of the best movies I've ever seen in my entire life. Watch it right now if you like magic, anime, or complex stories. The animation is fantastic (probably the best I've ever seen), and so are the characters, locations, and One of the best movies I've ever seen in my entire life. Watch it right now if you like magic, anime, or complex stories. The animation is fantastic (probably the best I've ever seen), and so are the characters, locations, and adventures. Too bad I didn't get the chance to see this in theaters. This is a movie experience I will never forget, and I hope it will be the same for you too.",
      "review_date": "2007-06-10"
    },
    {
      "review_title": null,
      "content": "Look quietly and deeply and you will understand that hope must prevail lest we are doomed. I am enthralled by the beauty of this film I watch it and admire its masterpiece. See it for yourself and fall in love again.",
      "review_date": "2007-06-14"
    },
    {
      "review_title": null,
      "content": "This movie is beautiful. it's like a strange fairy tale. i like the strangeness of the plot and how howl is not what he seems to be at first, you do alot of thinking after watching the movie, i recommend it to anyone.",
      "review_date": "2007-07-02"
    },
    {
      "review_title": null,
      "content": "I loved this moving . the cast and the characters . i wish they would make a howls moving castle 2 . like the book castle in the air but more by the book not peoples ideas very one should read castle in the sky after this moving and howls I loved this moving . the cast and the characters . i wish they would make a howls moving castle 2 . like the book castle in the air but more by the book not peoples ideas very one should read castle in the sky after this moving and howls moving castle the book . howl and Sophie just might have a kid and her sister read both books to find out !!!!",
      "review_date": "2007-08-10"
    },
    {
      "review_title": null,
      "content": "I personally loved the movie. It was one of the best movies I've ever seen. I keep thinking back and can't find any flaws! Those critics out there.. yap yap. I guess I'm just one of those people with a childish heart and big I personally loved the movie. It was one of the best movies I've ever seen. I keep thinking back and can't find any flaws! Those critics out there.. yap yap. I guess I'm just one of those people with a childish heart and big imagination to the point that the movie did not bore me! I recommend watching it!!",
      "review_date": "2008-01-08"
    },
    {
      "review_title": null,
      "content": "im a your #1 fan also it was the best movie from miyazaki i ever seen i hope he keeps making more movies like this on or Spirtted Away also i was wondering if you were the one who made Princess Monokay bye the way do you have a myspace?",
      "review_date": "2008-03-17"
    },
    {
      "review_title": null,
      "content": "Howl's Moving Castle by Miyazaki Hayao A Review Written for Friends by Kazuki Anno, Translators United for Peace Like a vivid dream, Miyazaki's film presents an alternate world for children of all ages. For more mature viewers, Howl's Moving Castle by Miyazaki Hayao A Review Written for Friends by Kazuki Anno, Translators United for Peace Like a vivid dream, Miyazaki's film presents an alternate world for children of all ages. For more mature viewers, however, his works represent the complex realities we face here and now in this cruel, yet beautiful world. Howl's Moving Castle will take us on a journey of moral quest to confront unnecessary and destructive wars that make us victims of, and collaborators with, terror at one and the same time. If our children can handle such serious subjects as war, justice and humanity, so must we. Miyazaki tells us that we are not what we seem to be. Howl is a handsome young man who looks like a dashing rock star and behaves like a flamboyant prince. Nevertheless, he is a wizard. Yet, unlike other wizards, he no longer works for the Palace, and when night falls, he turns into a black monster bird, flying across the sky to intercept a massive bomber formation over defenseless cities burning in flames. Howl spreads his wings and tries to catch bombs in the air, but all he can do is to neutralize a few bombs out of thousands. Thus, he goes to war each day, knowing in advance that he will fail. Which one of his multiple characters is truer than the other ones? Is any one aspect of his as true as any other? Sophie, a 19-year-old girl, is turned into a 90-year-old woman by the Witch of the Waste Land because she attracts the attention of Howl whom the Witch desires for herself, secretly envious of his youth and beauty. Is this a curse by a jealous witch, or does it merely mirror the lost heart of Sophie who does not know what she is to become, having resigned herself to a drab life in her family's hat shop? If the latter is the case, what can she do to break the spell? So, she sets off on an adventure to discover herself. Not even the Witch, an elaborately dressed dowager, is immune to power. When she is called to the Palace, she kowtows to authority and transforms herself into a helpless old woman, going up a flight of steep stairs that lead to a majestic chamber. It has been a long time since the ancient oral traditions she represents were annihilated and subjugated by nation-states in the age of modernization. Calcifer, a cantankerous fire demon, is supposed to be a free being in the universe, but he is under a contract to Howl, so he is kept in a small fireplace to generate energy for the moving castle. When more energy is needed for the castle in crisis, Sophie offers a lock of her hair to Calcifer who then says, \"If you give me your soul, I will be able to produce unimaginable amounts of energy.\" Perhaps, the wizards at the Palace who are in charge of inventing all the machines, warplanes, tanks, bombs, and missiles, have given up their souls to Calcifer to develop nuclear weapons. As citizens of nations with industrial democracies which uphold a single economic model, namely extreme capitalism unleashed by neo-liberal shock treatments in the era of corporate globalization, we have no faces, no voices, and no names. Here we have Miyazaki's invitation to take off on a magical journey, together with Sophie and Howl, to search for the infinite possibilities that dwell in each one of us. It will be as hard an adventure as anyone can undertake in the mysterious frontier of the human mind, as valuable an experience as dreams that would not cease to inspire us, and as easy a task as remembering once again our own names. Peace, Kazuki",
      "review_date": "2008-08-02"
    },
    {
      "review_title": null,
      "content": "'It's like dreaming....' says Sophie half way through the film. I couldn't have put it better myself. Watching Miyazaki movies is like having a brilliant dream: this is the best of his movies that I have seen. It's 'It's like dreaming....' says Sophie half way through the film. I couldn't have put it better myself. Watching Miyazaki movies is like having a brilliant dream: this is the best of his movies that I have seen. It's tighter, with a stronger narrative thread, and avoids going too far along the surreal, blob-lined tangents that Princess Mononoke and Spirited Away linger on. As always, the visuals are exceptionally beautiful, breathtaking in a way that non-animation landscapes can never hope to match. We watched it exhausted after a day of packing before a house move, and yet were gripped and enchanted for the full two hours of the movie, with idiot grins fixed on our faces both during it and for at least an hour afterwards. Wonderful.",
      "review_date": "2005-09-27"
    },
    {
      "review_title": null,
      "content": "Very nice movie realy touch our heart.",
      "review_date": "2006-01-11"
    },
    {
      "review_title": null,
      "content": "One of those movies I could watch over and over again. Yes, it is hard to understand at some points. Yes the plot can be a tad hard to follow. But once you watch it a few times and once you start paying attention to what the crowd says (like One of those movies I could watch over and over again. Yes, it is hard to understand at some points. Yes the plot can be a tad hard to follow. But once you watch it a few times and once you start paying attention to what the crowd says (like the scene where the two men are talking in the background just before Sophie meets Howl) you can truly understand this masterpiece. I can't say that I've read the book because I haven't, but I love this story anyway.",
      "review_date": "2006-10-29"
    },
    {
      "review_title": null,
      "content": "other than inuyasha and fruits basket it was the best anime movie.",
      "review_date": "2006-03-13"
    },
    {
      "review_title": null,
      "content": "Absolutely outstanding - my favorite Miyazaki movie so far. Awesome plot, glorious, imaginative art, and beautiful soundtrack. I was absolutely enchanted.",
      "review_date": "2006-03-15"
    },
    {
      "review_title": null,
      "content": "Visually beautiful. The witch of the waste character was both darkly compelling and good comic relief. The set up of the story is good but the payoff at the end really shortchanges the viewer.",
      "review_date": "2006-03-29"
    },
    {
      "review_title": null,
      "content": "Top rate animation, spirited story, but if you have read the book by diana jones you end up a little disappointed. It lacks a little of the magic that all other Miyazaki films have abundantly.",
      "review_date": "2006-03-29"
    },
    {
      "review_title": null,
      "content": "i've seen all of miyazaki's work and this is my new favorite! i can't seem to stop watching it. it's so well done!",
      "review_date": "2006-03-31"
    },
    {
      "review_title": null,
      "content": "If only the last five minutes of this film didn't happen, it would be a seven, maybe an eight, but come on, has anyone actually SEEN the ending? It compromises the whole story and insults the viewer's intelligence. His other movies If only the last five minutes of this film didn't happen, it would be a seven, maybe an eight, but come on, has anyone actually SEEN the ending? It compromises the whole story and insults the viewer's intelligence. His other movies are much better.",
      "review_date": "2006-03-09"
    },
    {
      "review_title": null,
      "content": "Even it's quite late for me to watch this movie but it was spectacular and womderful. I love Miyazaki creation. And I'm simple fall in love with Howl and all character in Miyazaki masterpieces.",
      "review_date": "2006-05-17"
    },
    {
      "review_title": null,
      "content": "Yet another classic from Miyazaki. His animation is so much more dazzling (to me) than any computer animated movie, and I really hope he continues to make animated movies even as he enters \"old age.\" It's hard to really explain why this Yet another classic from Miyazaki. His animation is so much more dazzling (to me) than any computer animated movie, and I really hope he continues to make animated movies even as he enters \"old age.\" It's hard to really explain why this movie is so great. A girl is transformed into an old woman by a witch and boards a moving castle, (controlled by a kind-hearted wizard and his awesome fire sidekick named Calcifer, dubbed by Billy Crystal)with doorways that open into different places. It's pretty incredible stuff. Japanese animation just has creativity and inventiveness that American animation just doesn't have (with the possible exception of Pixar.) It seems almost like it's from another world. Really cool movie and I actually liked it better than Miyazaki's (good, but overrated) Spirited Away. Some problems with Japanese anime in general are present here. It's too long by about a half hour and it starts to make less and less sense as it nears its conclusion. Also, the actions of a particular character towards the end of the movie become frustrating. Still, it doesn't take much away from what can best be described as (yeah, I know it's corny as hell,) \"movie magic.\"",
      "review_date": "2007-07-08"
    },
    {
      "review_title": null,
      "content": "There is something deeply wrong with the reviewers who could not follow the plot, and thought that this film has no heart. I am in my twenties and love all Miyazaki films; these films have more heart than any Disney film has in its little There is something deeply wrong with the reviewers who could not follow the plot, and thought that this film has no heart. I am in my twenties and love all Miyazaki films; these films have more heart than any Disney film has in its little finger. The morality of these films is deep and complex; there is not true good or evil, and children are put in places of responsibility where they must take responsibility for their actions. Howl's is no different. Spirited Away is my favorite Miyazaki film, but this comes in close second. The film never gets old; it's like a favorite song.",
      "review_date": "2008-04-04"
    },
    {
      "review_title": null,
      "content": "THISis one of my ALL time FAVORITE movies!!! I talk about it any chance that i get !! i also love Howl! :)",
      "review_date": "2008-06-12"
    },
    {
      "review_title": null,
      "content": "One of the best animated movies of this year!! Bravo!! Move over Disney!!",
      "review_date": "2005-11-21"
    },
    {
      "review_title": null,
      "content": "It could have used some more explanation of why things are as they are, but the characters are adorable and the story is fascinating. I liked it, my 8 year old girl liked it and my 16 year old son liked it!",
      "review_date": "2005-09-26"
    },
    {
      "review_title": null,
      "content": "A true bonafide classic from a legend.",
      "review_date": "2007-08-12"
    },
    {
      "review_title": null,
      "content": "This Movie Is The Best Anime Movie I Have Ever Seen In My Life! It seems to me that im obessed of it but who cares.",
      "review_date": "2008-10-25"
    },
    {
      "review_title": null,
      "content": "I absolutely loved this movie! It has so much heart, and I was enthralled all the way through. The storyline differs from the book a bit, but that only makes it more original. The artwork is beautiful, and the music is among the best I absolutely loved this movie! It has so much heart, and I was enthralled all the way through. The storyline differs from the book a bit, but that only makes it more original. The artwork is beautiful, and the music is among the best soundtracks I've heard. Bravo!",
      "review_date": "2008-06-26"
    },
    {
      "review_title": null,
      "content": "A thoroughly bizarre story, but thoroughly worth watching. Miyazaki's story lines are always a bit on the odd side, but this atypical approach to writing is what makes his movies so fascinating and captivating.",
      "review_date": "2010-08-17"
    },
    {
      "review_title": null,
      "content": "I loved this movie! It's definitely in my top 3 favorite movies! Yes some parts i didn't get the FIRST time watching but i still loved it. It's perfect for someone who still finds hope in things also if you have a young heart and big imagination!",
      "review_date": "2010-10-26"
    },
    {
      "review_title": null,
      "content": "This is a spectacular show. I read the book and Love the Movie. The animation was amazing,  and i just could not believed that this did not win the academy award for best animation.",
      "review_date": "2011-10-30"
    },
    {
      "review_title": null,
      "content": "It's not in the same league as Spirited Away and Princess Mononoke, but still pretty fantastic in its own right. It boasts amazing visuals in a wonderfully realized world, full with rich interesting characters. The plot is engaging and fullIt's not in the same league as Spirited Away and Princess Mononoke, but still pretty fantastic in its own right. It boasts amazing visuals in a wonderfully realized world, full with rich interesting characters. The plot is engaging and full with much appreciated symbolism.",
      "review_date": "2014-02-06"
    },
    {
      "review_title": null,
      "content": "Absolutely wonderful film. I usually get bored with long films because they lose my interest at some point, but this one stayed consistently entertaining throughout. It's a heartwarming film I think any age could appreciate.",
      "review_date": "2012-05-04"
    },
    {
      "review_title": null,
      "content": "This is, in my opinion, Miyazaki's best movie to date. It's an emotionally powerful, humorous, magical, beautifully made and scripted animated masterpiece. Don't listen to all the trolls posting bad reviews; watch this movie now. You won't beThis is, in my opinion, Miyazaki's best movie to date. It's an emotionally powerful, humorous, magical, beautifully made and scripted animated masterpiece. Don't listen to all the trolls posting bad reviews; watch this movie now. You won't be disappointed.",
      "review_date": "2012-02-10"
    },
    {
      "review_title": null,
      "content": "Miyazaki's usual dazzling animation and engaging characters don't always support its lack of Western charm and cohesion. However, Howl's Moving Castle still manages to capture the heart and the mind with its wit and charm.",
      "review_date": "2011-11-27"
    },
    {
      "review_title": null,
      "content": "One of Ghibli's best works. Howls Moving Castle is possibly the most mature Ghibli feature with a story, Character depth and wit made to make one think.I love the range of characters in the film and the way the plot unravels and theOne of Ghibli's best works. Howls Moving Castle is possibly the most mature Ghibli feature with a story, Character depth and wit made to make one think.I love the range of characters in the film and the way the plot unravels and the antagonist isn't quite who you believe it to be from the offset.Once again Studio Ghibli prove that they are animation kings and masters of story telling.",
      "review_date": "2012-02-04"
    },
    {
      "review_title": null,
      "content": "Terrific animation but can't shake the feeling of bizarre incoherency typical of Japanese animated films.",
      "review_date": "2019-04-08"
    },
    {
      "review_title": null,
      "content": "Another masterpiece from Hayao Miyazaki. In addition an amazing design, the film also has a wonderful story that, in a simple and effective, teaches us many things and manages to inspire all.",
      "review_date": "2012-06-23"
    },
    {
      "review_title": null,
      "content": "Another fantastic 'Studio Ghibli' production, well deserving to be in the collection of movies from this amazing production studio. Incorporating features from both the Japanese 'Anime' as well as the American animation cultures, this filmAnother fantastic 'Studio Ghibli' production, well deserving to be in the collection of movies from this amazing production studio. Incorporating features from both the Japanese 'Anime' as well as the American animation cultures, this film combines an amazing story together with smooth animations as well as excellent voice acting. Thoroughly recommended to audiences of all ages and i guaranteed it will be thoroughly enjoyable. From old to young it will rekindle the fires of your imagination and encompass you in its wild and colorful world.",
      "review_date": "2012-04-01"
    },
    {
      "review_title": null,
      "content": "This Is Such A Amazing Movie! Really Really Powerful Visuals! In Bits It Very Touching, And Warm! The Only Thing I Could Say Is Bad Is The Ending Feels A Little Bit Rushed!\rStill One Of The Greatest Films Of All Time!",
      "review_date": "2012-05-28"
    },
    {
      "review_title": null,
      "content": "Although beautifully drawn and well scored How's Moving Castle lacks on one large aspect. That aspect is that it fails to have you connect with any of the characters in the movie on a personal level. At times it's hard to tell why you shouldAlthough beautifully drawn and well scored How's Moving Castle lacks on one large aspect. That aspect is that it fails to have you connect with any of the characters in the movie on a personal level. At times it's hard to tell why you should be rooting for a character or if a character is villainous or not. That being said it's interesting and unique story largely makes up for this deficit.",
      "review_date": "2013-11-20"
    },
    {
      "review_title": null,
      "content": "Miyazaki's another fantastic, believable film. This film is about love and courage. Well cast voice actors for english dub, memorable characters, and incredlble visuals. The only nick pick I have is that how Sophie change to young form whenMiyazaki's another fantastic, believable film. This film is about love and courage. Well cast voice actors for english dub, memorable characters, and incredlble visuals. The only nick pick I have is that how Sophie change to young form when she's asleep. But if that's only one I have, can't think anything else. This is perfect.",
      "review_date": "2014-12-21"
    },
    {
      "review_title": null,
      "content": "One of the first movies I've ever seen that I don't totally understand, yet am still completely enamored with regardless, \"Howl's Moving Castle\" is part Brothers Grimm fairy tale, part allegory for the Iraq War, part experiment in juxtaposingOne of the first movies I've ever seen that I don't totally understand, yet am still completely enamored with regardless, \"Howl's Moving Castle\" is part Brothers Grimm fairy tale, part allegory for the Iraq War, part experiment in juxtaposing steampunk elements against traditional French architecture. In short, it's challenging, yet impossible to look away from or get bored with. Of course, it helps that everything's simply incredible to look at from an animation standpoint and it's Miyazaki's vision for this that ultimately carries everything to its beautiful fruition. So much of the runtime was filled with the following examples of internal questioning. \"Wow, I wonder what that was about?\" \"Huh, I wonder what that guy's deal is?\" \"Interesting, I wonder why that's like that in this world?\" Did all of these questions end up getting answered in the end? Not even close. Did I need them to be? Evidently not, for my thinking on the unanswered and unexplained elements is only making the movie better in my eyes. What a vibrant, imaginative and satisfying entry point into the Studio Ghibli catalogue this was for me.",
      "review_date": "2020-05-11"
    },
    {
      "review_title": null,
      "content": "My very first Miyazaki film, and what a spectacle it was. The animation was absolutely gorgeous; there is truly nothing else like it out there. When it comes to foreign films, I always try to skip dubbed versions and just go along withMy very first Miyazaki film, and what a spectacle it was. The animation was absolutely gorgeous; there is truly nothing else like it out there. When it comes to foreign films, I always try to skip dubbed versions and just go along with subtitles; I wish I would have done the same here. At times the script was very cheesy, and I can't help but think  that the Japanese to English translation attributed to that. Also, the story got very confusing, especially at the end. Overall though, I absolutely loved this film. Breathtaking and beautiful!",
      "review_date": "2013-06-08"
    },
    {
      "review_title": null,
      "content": "Basically this movie was the best ever. Why I really like it though is that I thought of this kind of stuff when I was little and I didn't see this untill I was older but this was my childhood imagination.",
      "review_date": "2013-01-14"
    },
    {
      "review_title": null,
      "content": "Despite what some critics think, I believe this film is a masterpiece in animation and narrative that only the perplexing mind of Miyazaki can achieve.",
      "review_date": "2013-01-20"
    },
    {
      "review_title": null,
      "content": "\"Howl's Moving Castle\" is amazing with beautiful and epic visuals. Hayao Miyazaki gives to us a powerful film with a complexity for stylish spectators. After \"Spirited Away\", Miyazaki returns back with reloaded energy.",
      "review_date": "2013-06-30"
    },
    {
      "review_title": null,
      "content": "One Of The Most Creative Movies I Have Seen In Along Time! Along With All Of Ghibli's Other Movies It's Visually Stunning!",
      "review_date": "2013-03-23"
    },
    {
      "review_title": null,
      "content": "Although the story may seem quite odd this movie is one of my favorite. One more excellent work of Japaneese genius Hayao Miyazaki. Dont try to understand all plot twists, just watch the movie and enjoy the animation and symbolism.",
      "review_date": "2013-06-03"
    },
    {
      "review_title": null,
      "content": "Howl's Moving Castle easily captivated me with a sense of adventure as I felt that every character played a part in the movie, and the english dubs were impressive. What I like most is that the movie instilled a sense of wonder everywhere itHowl's Moving Castle easily captivated me with a sense of adventure as I felt that every character played a part in the movie, and the english dubs were impressive. What I like most is that the movie instilled a sense of wonder everywhere it went all the way to the mesmerizing credits song, Sekai No Yakosoku. Easily one of the best animated films of all time, and I can applaud Gibbly once more.",
      "review_date": "2014-06-01"
    },
    {
      "review_title": null,
      "content": "Though Howl’s Moving Castle has its narrative shortcomings, Hayao Miyazaki’s direction, Studio Ghibli’s dazzling animation, and a stunning soundtrack turn the onscreen adaption of British writer Diana Wynne Jones’s 1986 novel of the same nameThough Howl’s Moving Castle has its narrative shortcomings, Hayao Miyazaki’s direction, Studio Ghibli’s dazzling animation, and a stunning soundtrack turn the onscreen adaption of British writer Diana Wynne Jones’s 1986 novel of the same name into an overall enchanting and endearing world where every moment—including its darkest—has a certain charm beneath it. It also has the best English vocal performances within Studio Ghibli’s filmography, general acclaim awarded to Christian Bale, Billy Crystal, and of course, late legends Jean Simmons and Lauren Becall.\r Overall rating: 8.4",
      "review_date": "2015-03-16"
    },
    {
      "review_title": null,
      "content": "Smart, entertaining, and heartwarming, fits this film to the Ghibli name. With its visual wonder and life lessons, along with a superlative score, will lead to on a fantastic adventure. The film may feel unfocused at times, and is ultimatelySmart, entertaining, and heartwarming, fits this film to the Ghibli name. With its visual wonder and life lessons, along with a superlative score, will lead to on a fantastic adventure. The film may feel unfocused at times, and is ultimately not as powerful as his previous film \"Spirited Away\", but it is sure a delight in the eyes of older age viewers.",
      "review_date": "2013-08-23"
    },
    {
      "review_title": null,
      "content": "Beautiful film. As always, from 2/3 minutes in your hooked into the film. Would have been nicer if the film played on the theme of beauty a little more, it veered into being cheesey at some stages.",
      "review_date": "2013-07-13"
    },
    {
      "review_title": null,
      "content": "Despite a bit of cheesiness, Howl's Moving Castle is probably one of the finest animated features I have ever seen. Its touching to see a film that is anti-war, about seeing inner beauty and full of heart.",
      "review_date": "2016-06-29"
    },
    {
      "review_title": null,
      "content": "I fell in love with this movie.  The first time I saw it I had to rewatch it over and over.  Almost know the lines by heart. It seems like I see something new each time.",
      "review_date": "2014-01-11"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAmazing visuals and a touching story. Although some parts were a bit difficult to understand, it was not enough to make this review mixed, much less negative. Watched it 3 times and loved every second, except for some over exaggerated moments with Calcifer. Some of the characters were better explained in the book. The Witch of the Waste for example. In the beginning you are completely blindsided by why she curses Sophie, but it is revealed to you later in the movie that she was in love with Howl (who could blame her!) and wants his heart for herself (which belongs to Calcifer). She is angry because she notices the budding friendship between Sophie and Howl. All I can say for Howl is… AMAZING! He is kind, yet mysterious and dark, and extremely vain, but I do wish you got to know him a bit better. Over all, he is a perfect addition to the cast of characters, who fits along with the theme, hearts can change, very well. He seems realistic because although at first he seems perfect, you gradually learn that he has flaws.\r Sophie is a typical heroine, low self esteem but oozing inner strength.\r The only other thing I wished they explained more was the missing prince. The fact that Sophie kisses him to turn him back into a human is a bit cliche-ish and unexpected. They only mention briefly that the missing prince is the cause of the war.\r Over all, an amazing and beautiful movie, with minor setbacks that are dwarfed by the pros of the film.",
      "review_date": "2014-06-14"
    },
    {
      "review_title": null,
      "content": "it is one of the most imaginative films i have ever seen. visually it's stunning with great ideas and designs with amazing animation to back it up and the cast of the english dub were great Jean Simmons and Christian Bale give theit is one of the most imaginative films i have ever seen. visually it's stunning with great ideas and designs with amazing animation to back it up and the cast of the english dub were great Jean Simmons and Christian Bale give the performances of there careers and billy crystal brings his A game even though he doesn't have too many lines. Miyazaki really did an excellent job especially with the hard task of following from the fantastic spirited away",
      "review_date": "2014-12-18"
    },
    {
      "review_title": null,
      "content": "Howl's Moving Castle suffers from confusing storytelling, incomprehensible story and character development, undone characters and choppy plot points, enough to downgrade its beautiful animation, great score, an interesting first impressionHowl's Moving Castle suffers from confusing storytelling, incomprehensible story and character development, undone characters and choppy plot points, enough to downgrade its beautiful animation, great score, an interesting first impression and imaginative ideas.",
      "review_date": "2016-08-21"
    },
    {
      "review_title": null,
      "content": "After Spirited Away, this is the second most original film that Studio Ghibli has ever produced. It's perfect in every way (almost). The story is absolutely impressive. It just has so many things and is able to handle all of them perfectly.After Spirited Away, this is the second most original film that Studio Ghibli has ever produced. It's perfect in every way (almost). The story is absolutely impressive. It just has so many things and is able to handle all of them perfectly. It has comedy, romance, action, a lot of imagination and some really unexpected things most people will not expect. It is also an emotional, touching and beautiful story, and, I repeat, it is very imaginative!. Except for a couple of things, you have not seen anything similar to this in a lot of time, probably never. I seriously think everyone should watch it.",
      "review_date": "2015-06-30"
    },
    {
      "review_title": null,
      "content": "I love anime, and when I noticed that Howl's Moving Castle was showing today, I knew I had to see it. And you know what, I wasn't disappointed. I admit I haven't read the book by Diana Wynne Jones, but this film is so imaginative andI love anime, and when I noticed that Howl's Moving Castle was showing today, I knew I had to see it. And you know what, I wasn't disappointed. I admit I haven't read the book by Diana Wynne Jones, but this film is so imaginative and delightful I doubt I would have cared if it was unfaithful to the book or not. The animation here is amazing, the backgrounds are gorgeous and the colours so bright. Plus the castle itself was a wonder to behold. The visual style here also has a certain elegance about it, and the atmosphere the visuals create is somewhat meticulous. I also have to mention the score, it was absolutely stunning. Beautiful, magical and poignant themes that caressed my ears, like a Mozart opera would. The characters are engaging and are beautifully voiced by a terrific voice cast. Christian Bale's(not a stranger to voice work, he voiced Thomas in Disney's Pocahontas as well) seductive and silky voice brings vain wizard Howl to vivid life, and Sophie is a very lovable and beautiful character, whether in her younger form or her older form. Her younger form is sensitively voiced by Emily Mortimer and her older self is voiced by the late Jean Simmons with real sincerity. The Witch of the Waste is a character consumed by jealousy, so much so it results in Sophie's transformation from a young 18 year old girl to a pensioner. This character is perfectly voiced by screen legend Lauren Bacall. Billy Crystal is a joy to behold as Calcifer, one of my favourite characters in the film, and Turniphead was very intriguing as well. The story is a sweet, timeless imaginative one, not the best written one by all means, but it did touch me a lot. Did I notice anything wrong? Yes, but these flaws are minor compared to the overall beauty of the film. The final third is a little too rushed, and the ending is a little over-surreal. But overall, Howl's Moving Castle is an enchanting and delightful work from Miyazaki. 9/10 Bethany Cox",
      "review_date": "2022-03-16"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nHowl's Moving Castle narrowly beats Spirited Away as my favourite Ghibli film.\rI might be a tad biased because it's also the first one I watched and is really what got me into Japanese film in general but even after watching it a dozen times years later I can honestly say that it's the best.  Sophie and Howl both dramatically develop as characters throughout the plot, with Sophie coming out of her shell and Howl essentially growing from a moody teenager into a man who, instead of running from responsibility chooses to stay and confront them head on.\rThere's plenty of humor with the Witch of the Waste and Calcifer being absolutely hilarious.  The plot sometimes gets a tad bit muddled but that's easily forgivable because it never collapses and instead travels on a different path, turning from a fantasy film into a love story.\rMiyazaki really outdid himself with the visuals of this movie from the steampunk like moving castle to the scenes where all we're doing is staring at the sea and yet are completely mesmerized.\rEverything about this movie really makes it my favourite and I recommend it to everyone.",
      "review_date": "2015-08-07"
    },
    {
      "review_title": null,
      "content": "Though I liked \"Howl's Moving Castle\" a lot with all of its wonderful surreal imagery, I wasn't quite pleased with it as I was with Hayao Miyazaki's \"Spirited Away\" or \"Princess Mononoke\". Probably because the mentioned movies are just beyondThough I liked \"Howl's Moving Castle\" a lot with all of its wonderful surreal imagery, I wasn't quite pleased with it as I was with Hayao Miyazaki's \"Spirited Away\" or \"Princess Mononoke\". Probably because the mentioned movies are just beyond this world good and set my expectations too high...",
      "review_date": "2016-01-01"
    },
    {
      "review_title": null,
      "content": "Based on book of Diane W. Jones, is one of best opus of Hayao Miyazaki. The bumpy story love of a young hatter and a sorcerer is roller coaster that never stops until the last minute. A must to see once and again.",
      "review_date": "2017-04-26"
    },
    {
      "review_title": null,
      "content": "It is nice to have an European or Asian adaptations from great novels such as The Catcher In The Rye, Dune, Dracula (etc.) which is critically acclaimed and deserved an adaptation but Miyazaki knows how to visualize an adaptation.",
      "review_date": "2016-11-11"
    },
    {
      "review_title": null,
      "content": "Um filme maravilhoso, com romance, aventura, ação, drama, uma obra prima de animação. Recomendo a todos que gostam dos filmes do Miyazaki, esse faz parte de um dos melhores filmes dele!",
      "review_date": "2017-09-29"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n''The short answer is that this is a Feminist rant, chick flick, mainly for retarded or soon-to-be retarded kids.Morales that are prominant: Fat people suck, hero men wear earings on both ears, random people will destroy your life, young girls should clean houses, war is bad.Some of this is true . . . Good luck figuring out which morals are true after watching this.''Acclamation, all of this is the reason why you're pathetic and garbage. None of this is true and everything you have typed in is also the reason why people hate good movies cause of you, dumbass. Everyone else in the negative section can go back home to their moms. And young girls don't clean and crap, they adventure too. Maybe you should clean your mom's and not do anything else but just that, pathetic idiot.",
      "review_date": "2021-02-20"
    },
    {
      "review_title": null,
      "content": "I think this is a Ghibli version of what a lot of people think of what Disney's princess movies are, not that is a bad thing tho'. I really like that it has this serious feel of wonder about how the movie's universe works... at least for theI think this is a Ghibli version of what a lot of people think of what Disney's princess movies are, not that is a bad thing tho'. I really like that it has this serious feel of wonder about how the movie's universe works... at least for the first half of the movie, but this being a Ghibli movie there's a subplot about \"war is bad\" that didn't work that good for me, but nothing to destroy the movie.Overall is a beautiful looking movie with some wonderful messages about inner beauty and love.",
      "review_date": "2019-03-16"
    },
    {
      "review_title": null,
      "content": "Howl's Moving Castle is a beautifully charming, fun, and comely experience appropriate for a wide variety of audiences. Extremely cute, but can be a little bit slow and obtuse at points. The story wasn't especially deep or detailed, but itHowl's Moving Castle is a beautifully charming, fun, and comely experience appropriate for a wide variety of audiences. Extremely cute, but can be a little bit slow and obtuse at points. The story wasn't especially deep or detailed, but it was very artfully constructed in a way mindful of pacing.",
      "review_date": "2018-10-24"
    },
    {
      "review_title": null,
      "content": "I would like to start of with the fact that this has by far one of the most beautiful and pleasant soundtracks that you can listen to. The music fits the scenes and movie perfectly especially the more scenic and peaceful scenes. The animationI would like to start of with the fact that this has by far one of the most beautiful and pleasant soundtracks that you can listen to. The music fits the scenes and movie perfectly especially the more scenic and peaceful scenes. The animation is beautifully crafted and even holds up for today standards. The scenic art really sets up the mood for the peaceful and tranquil moments. The only downfall for this movie is the narrative. There are a couple of issues and focuses on the characters and by the end they throw too many inconsistent plots at you just to somehow make the ending more climatic. Overall a beautiful and emotional movie that you should watch.",
      "review_date": "2022-07-03"
    },
    {
      "review_title": null,
      "content": "This is the only Miyazaki film I've seen so far that's what's on its surface is way, way less impressive than what's underneath it. Neither its fantastical story, its visual splendor, nor its understated yet funny humour hold a candle to itsThis is the only Miyazaki film I've seen so far that's what's on its surface is way, way less impressive than what's underneath it. Neither its fantastical story, its visual splendor, nor its understated yet funny humour hold a candle to its subtext. Howl's Moving Castle's weight lies on What's beyond its story. It's actually a meditation on age and love. Miyazaki allows you here to see the world through the eyes of an adult who longs to be young again while conveying a plethora of lessons by his visual storytelling, which is here at its finest regarding practicality, but this is not the case regarding creativity.The film also has tons of pacing issues, most noticeably in the first hurried 15 minutes and the rushed denouement. It also never fully settles into its storytelling technique. I wouldn't have minded the self-indulgent dreamy-like narration (well, not so much), nor this of the your typical sweet fairly tale one. But the mix of both made everything feels quite messy instead of flowing like a hallucinatory dream or an intriguing fantastical adventure story.Indeed, these issues had me confused a little bit. But the unprecedented practical visual storytelling I've mentioned above undeniably compensates for that. As the film proceeds, I find myself understand almost every obscure detail without being explained. That's mostly, if not entirely, due to Miyazaki's unmatched ability to tell a story relying on visual symbolism that remarkably keeps paying off till the last second.Overall, Howl's Moving Castle is the least Hayao Miyazaki film I've enjoyed so far. But that should by no means indicate that it isn't an exceptional work that's as light-hearted and delightful as it's though-provoking and heartwarming.(7.5/10)",
      "review_date": "2019-07-26"
    },
    {
      "review_title": null,
      "content": "\"My dear Lucy... girls grow quicker than books... you are already too old for fairy tales... but some day you will be old enough to start reading fairy tales again\" wrote C.S. Lewis in the foreword to \"The Lion, the Witch and the Wardrobe\".\"My dear Lucy... girls grow quicker than books... you are already too old for fairy tales... but some day you will be old enough to start reading fairy tales again\" wrote C.S. Lewis in the foreword to \"The Lion, the Witch and the Wardrobe\". Apparently, a similar growing up overtook me. I had a strange attitude towards Miyazaki - on the one hand, I've watched and highly appreciate almost all of Ghibli's movies, which were not filmed by Miyazaki, but on the other hand, this were his movies, except for \"The Wind Rises\", which I did not ever bother watch completely. The same applies to the \"Howl's Moving Castle\" and \"Spirited Away\", which I began to watch several times, and was utterly bored somewhere in the middle. It's funny, but something unlikely brought me back to both films - the mythological symbolism in the pattern of interaction between masculine and feminine principles and proper representation of a female archetype in Miyazaki's movies. Indeed, what Miyazaki was filming are true fairy tales with the structure and symbolism of myths. Both \"Castle\" and \"Spirited Away\" tell about becoming feminine, about the transformation of girls into young women, their interaction with \"monsters\" - a male archetype embodied in one case in a shapeshifter-wizard, gradually forgetting himself and losing his humanity; in another case, in a shapeshifting river dragon, who has forgotten his name. Both beauties must first find their femininity in order to free the \"monsters\" (from the deal with the demon / evil sorceress), return them to normal from the borderline, awaken them as men. The heroines of these Miyazaki movies are the embodiment of femininity. They find their true strength and splendor through acceptance of their femininity, rather then through denial of femininity and imitation of men. They self-actualize through acceptance of their nature and following the greater good, not through self-denial and mimesis of men like Rene Girard would probably say and as it is customary to portray lately through the trope of a \"strong independent woman\", which is in the essence is epitome of self-denial and radical form of misogyny. Such self-denial and mimesis could only lead to conflict, scapegoating and destruction. Not so in the \"Castle\". The masculine and feminine are embodied here in a proper way, acquire completeness and integrity, creating harmony and the feeling of a fairy tale. Traditionally for Ghibli, the story is implemented through gorgeous animation and beautiful music, woven into the atmosphere of this fairy tale, which can absorb and hold your attention for two hours if you are still young enough or already old enough to love fairy tales.",
      "review_date": "2021-02-20"
    },
    {
      "review_title": null,
      "content": "An eclectic mix of Western story and Eastern story telling. Beautiful animation, as can be said of any Studio Ghibli film.",
      "review_date": "2019-04-30"
    },
    {
      "review_title": null,
      "content": "I don't think that this movie is as good as the other ones by Studio Ghibli. Again, just like other movies in the same category, there's much absurdity going on, from the girl being cursed with being an old woman, to the guy who transformsI don't think that this movie is as good as the other ones by Studio Ghibli. Again, just like other movies in the same category, there's much absurdity going on, from the girl being cursed with being an old woman, to the guy who transforms into a bird who fights planes in a fictional war, to fluid monsters who have literally no right to existence after their former master was stripped of her powers, yet they still somehow exist, I genuinely don't know. In terms of theme, sure there's this magic and coming of age, but sometimes it's horrifying, sometimes it's romantic and so on and so on, it's really all over the place. If you want to watch a genuinely good Ghibli movie, watch My Neighbour Totoro or Spirited away, this one's good, but no masterpiece.",
      "review_date": "2020-08-26"
    },
    {
      "review_title": null,
      "content": "Within a few hours Miyazaki succeeds in retaining the magical awe of the original novel, all the while creating a new animated masterpiece in  par with Spirited Away and Princess Mononoke.",
      "review_date": "2019-07-21"
    },
    {
      "review_title": null,
      "content": "This is a very good movie, but I have a lot of issues with it.This movie, espcially its messy third act, feels like sensory overload. Everything is happening so fast and so loud and the quiet moments of rest (which are always the best partsThis is a very good movie, but I have a lot of issues with it.This movie, espcially its messy third act, feels like sensory overload. Everything is happening so fast and so loud and the quiet moments of rest (which are always the best parts of every Ghibli film) are very few and far between compared to other Ghibli films. It feels very rushed and overwhelming and it gives me a headache.Also, the exact nature of Sophie's curse (and the movie's world in general) is never really explained. I like how her age changes, but it would be good to know what exactly triggers those changes. A lot in this film is unexplained and it's very frustrating. This is probably Ghibli's most nonsensical movie.With that said, I do like it. While I think that the second half is kind of a mess, the first half is really good. It's a lot slower and more focused. There are less characters and there's actual moments to rest and contemplate the beautiful scenery. The ending is also really nice.The best things about this movie are the visuals (obviously) and Howl, especially when he's being a total drama queen. I want more dramatic Howl please.Overall, this is far from being one of my favorite Ghibli movies, but I think the good outweighs the bad just enough. I know it's really beloved, but I will still take Spirited Away or Whisper of the Heart over this anytime.",
      "review_date": "2020-09-25"
    },
    {
      "review_title": null,
      "content": "Second film I see from Studio Ghibli and I am surprised again. I found the story a little slow and very monotonous, but that doesn't mean it ruined my experience with the film. The film, visually, is so full of details that it made my eyesSecond film I see from Studio Ghibli and I am surprised again. I found the story a little slow and very monotonous, but that doesn't mean it ruined my experience with the film. The film, visually, is so full of details that it made my eyes shine because of the beauty of the lines that were on the screen in front of me. The landscapes, the castle moving, the protagonist's dress and her hair. And one of my favorite scenes is breakfast. (How could a movie have made me feel hungry?). The characters are very charismatic and well built. Calcifer is a very comical character with very few scenes, but he does not lose his importance in the story. What to talk about Howl? He is a very important character too and we see a little bit about his personality before becoming attached to the protagonist, and his personality after her. Rather ambitious and narcissistic to become someone who cares about others. Then we have our protagonist named Sofia. She is humble and sweet, but she has, between the lines, a low self-esteem that is almost invisible. He is naturally a person who would help anyone, even if they were your enemy. She is a very realistic character, in which she treats her problems with caution and with her heart. Once again Studio Ghibli shows once again that it does not feel obliged to provide details about the world of its film. He just wants us to follow the growth of all the characters. In the end that's just what will matter.",
      "review_date": "2020-03-07"
    },
    {
      "review_title": null,
      "content": "1)I love this movie, it is one of the best movies of my life, I saw it when I was a baby, until now, very good, I highly recommend it ...",
      "review_date": "2020-04-14"
    },
    {
      "review_title": null,
      "content": "Mood and BGM was perfect. But I'm not sure if  the message of anti-war was certainly expressed in the movie. It shows the horror of violence but no solution.",
      "review_date": "2020-04-12"
    }
  ],
  "num_reviews": 139
}