{
  "title": "Kung Fu Hustle",
  "rating": 8.5,
  "release_date": "2005-04-08",
  "summary": "Set amid the chaos of pre-revolutionary China, small time thief, Sing (Chow), aspires to be one of the sophisticated and ruthless Axe Gang whose underworld activities overshadow the city.  (Sony)",
  "critic_reviews": [
    "Chow's savagely funny cinematic love letter places Hong Kong legends Yuen Wah, Leung Siu Lung and former Bond girl Yuen Qiu in well-cast pivotal parts, establishing Kung Fu Hustle not only as an endearing homage to a genre's history, but an astonishing piece of cinema in its own right.",
    "Kung Fu Hustle is something you rarely encounter in theaters: a genuinely original comedy.",
    "With a delirious mix of the sublime and the silly, Hong Kong comedy king Stephen Chow Sing-chi has taken the kung fu comedy genre to new heights of chop-socky hilarity.",
    "The movie refers glancingly to dozens of Hollywood classics, from \"West Side Story\" to \"City Lights,\" but at heart it is a debt of honor richly paid by Stephen Chow to his martial-arts forebears and to the traditions that shaped his sensibility. His gong fu is the best.",
    "Moviemaking doesn't get much smarter, funnier, handsomer, better than this.",
    "It's a short, sharp, shock to the cinematic system that's virtually impossible to dislike, and if you don't leave the theatre grinning your face off, then buddy, movies just aren't for you.",
    "All of Kung Fu Hustle is like that: You don't just watch it, you ride with it, laughing all the way.",
    "It's a visual feast that only a crack director could provide, and it's mounted within a story and setting that, played utterly straight, might still have made a good movie.",
    "Brilliantly choreographed and shot, Kung Fu Hustle is often grisly, visually spectacular and unabashedly silly, sometimes all at once.",
    "Gut-Bustingly funny moves are pretty rare, so hustle over to Kung Fu Hustle, actor-director Ste phen Chow's exhilaratingly hilarious and affectionate send-up of Hong Kong action flicks.",
    "Raymond Wong, who has become Chow's favorite composer, iced this cake with music that sounds like Beethoven, Henry Mancini's jazz and all the James Bond themes run together in a blender.",
    "Guaranteed to deliver more innovative eye candy and smarter fun-per-second than most of this summer's fare, and that one-two punch ought to knock you off your seat.",
    "In a farce like this, where the story is merely a string of martial-arts movie cliches lined up to be parodied, that has its own rewards.",
    "Half-amazing, half-ridiculous, thoroughly exhilarating.",
    "Its crowd-pleasing, action-packed brand of frenetic parody promises to spread Chow's mythos even further.",
    "Chow manages to have his cake and eat it too: Kung Fu Hustle is a kung fu parody that's also a terrific kung fu movie.",
    "Defies all laws of gravity in its pursuit of thrills and laughs—and it's so disarmingly eager to please that only a stone-faced kung fu purist could object.",
    "The inspiration appears to be equal parts \"Looney Tunes\" and Capcom video games like \"Street Fighter II.\" All the energy that was missing from the recent \"Mask\" sequel is here, and then some.",
    "It won't be long before you feel the compulsion to watch again. There is too much to appreciate in one sitting.",
    "Kung Fu Hustle pummels \"The Matrix\" trilogy into a puddle.",
    "Viewers will discover that the film has something to offer nearly everyone, whether they are a novice or a black belt in kung fu cinema.",
    "Does the plot spin out of control? You bet. But dumb fun this smart is a gift.",
    "For all its excitement Kung Fu Hustle is mostly a marvel of comedic ingenuity and mile-a-minute creativity run wild. You've never seen anything like it.",
    "Hustle's approach to a simple good-vs.-evil plot is eccentrically exuberant.",
    "Kung Fu Hustle is to \"House of Flying Daggers\" what \"Blazing Saddles\" is to \"Unforgiven.\"",
    "Like a meal prepared by an extreme chef, ''Hustle\" is more than a bit of a mess. It still tastes like nothing you've ever had before.",
    "This is the kind of movie where you laugh occasionally and have a silly grin most of the rest of the time.",
    "Vivid and madcap but fails to connect on any emotional level.",
    "A celebration of Hong Kong action cinema that mocks gravity, both emotional and physical.",
    "For all its punches, kicks, whacks and thumps, the movie does not have much impact, and for all its affectionate nostalgia, it produces a strange kind of amnesia. It knocks the sense right out of your head, and its own as well.",
    "Chow depends way too much on jokey computer graphics that make the whole thing feel like a superhero comic, instead of athleticism or charisma or good storytelling, and that Kung Fu Hustle wears itself out long before it's over.",
    "At times, the picture evokes such stylized musicals as \"The Band Wagon\"; at others, it seems to whirr every kung-fu movie ever made into the most luscious action smoothie you'll ever imbibe.",
    "Chow's newfound patience and attentiveness to stasis, tinged with nostalgia, are promising indications of where he's taking his art as he attempts to influence the commercial cinema that's long influenced him.",
    "The upside: Chow has energy and invention to burn. The downside: He doesn't know when he blisters his audience.",
    "A giant leap forward in Stephen Chow's ongoing assault on Jackie Chan's status as reigning balletic clown-master of martial-arts mayhem, this extravagantly nutty crime comedy is a work of some kind of genius. Not everybody's kind of genius, to be sure.",
    "Devoid of genuine inspiration or involving character development.",
    "The overly broad martial-arts comedy Kung Fu Hustle was obviously made with skill and affection for its many cinematic sources, yet I found the tone, timing and emotional involvement off by just enough to irritate rather than enchant.",
    "For all its stylishness, verve and moments of visual poetry, the relentlessly punishing slapstick and overall cruel tone left me cold."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "There aren't many good comedy movies, everybody knows that. Buy sometimes you find a gem, guess what this is a GEM. Kung Fu Hustle is such an unique comedy movie, you won't find this anywhere else. Form the beginning of the movie till the endThere aren't many good comedy movies, everybody knows that. Buy sometimes you find a gem, guess what this is a GEM. Kung Fu Hustle is such an unique comedy movie, you won't find this anywhere else. Form the beginning of the movie till the end of the movie I genuinely laughed my @ss off. A comedy with good acting, really funny scenes, a ridiculous plot and martial arts? That is a 10/10 ALL DAY LONG!",
      "review_date": "2013-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Kung Fu Hustle was an excellent movie.  Set out exactly what it meant to do and in a very aesthetic manner.  It was absolutely hilarious and one of my favorites.",
      "review_date": "2010-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great beauty. comedy, and action. What more could you want? Really pretty to watch on blu-ray. Movie has emotion to which is rare.",
      "review_date": "2007-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I gave this movie 10 because it's the best combination of style, humor, action and parody I've EVER seen in a single movie. This is the best of them all.",
      "review_date": "2008-11-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a tremendous film. It is absolutely nuts. Imagine mixing a cartoon with *Kill Bill *with *Seven Samurai*. It’s about a group of poor townspeople who fend off against gang terrorism, with the select few locals who are gifted andThis was a tremendous film. It is absolutely nuts. Imagine mixing a cartoon with *Kill Bill *with *Seven Samurai*. It’s about a group of poor townspeople who fend off against gang terrorism, with the select few locals who are gifted and powerful. At the same time, a man is desperate to join the gang, in order to validate his masculinity that was taken from him as a child, due to bullying.There is a lot happening but it all comes together beautifully and ridiculously. The movie is so strange. It’s like a cartoon with exaggerated movements and superficial action. I want to say it has poorly done SFX, but it’s so bizarre that it works perfectly for what it is. It’s an absurd action/comedy/fantasy that really strikes a chord with my strange sense of humor and adoration for absurdism. Also, you’ll never see a movie like this again. It’s genre-busting, unique, and a tremendous piece of cinema.",
      "review_date": "2020-08-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After rewatching the entire Ip Man series which had a grounded style of fighting, I've thought about a martial movie that was the opposite of that. I haven't watched this movie in ages but I remember it for being the most ridiculous movieAfter rewatching the entire Ip Man series which had a grounded style of fighting, I've thought about a martial movie that was the opposite of that. I haven't watched this movie in ages but I remember it for being the most ridiculous movie ever. I decided to rewatch \"Kung Fu Hustle\" and it is still as grand and ridiculous as ever.When the hapless Sing (Stephen Chow) and his dim-witted pal, Bone (Feng Xiaogang), try to scam the residents of Pig Sty Alley into thinking they're members of the dreaded Axe Gang, the real gangsters descend on this Shanghai slum to restore their fearsome reputation. What gang leader Brother Sum (Chan Kwok-Kwan) doesn't know is that this neighbourhood doesn't take kindly to interlopers. Let's start with what makes this movie stand out from other movies, the comedy. This movie has very dark humour, for example, the axe gang leader kills two people with a knife and shotgun and then the next scene goes to them all dancing to a cool score by Raymond Wong. You're never really sure if you are meant to laugh or it is genuinely seriously but director Stephen Chow intertwine both together to create some weird humour but it just works. Another part of the charm of the unique comedy is this movie is the surprisingly over the top slapstick, Looney tunes comedy. The director employs this by using very cartooney sound effects and having guys get hit around like toy ragdolls that result in some laugh out moments. There is a chase scene that feels like it is from Bugs Bunny. I don't want to spoil any of the moments if you haven't watched it but it's as crazy as it sounds and it's awesome. This movie isn't just all comedy though and has some amazing fight/action scenes.  The director uses a lot of wirework and surprisingly a lot of CGI which is quite unprecedented in a martial art or even a comedy movie but it is used very effectively. The fight scenes are well directed and edited but best of all incredibly exciting and thrilling to watch. Despite all the wirework and CGI, every fight is completely visible with no over edits or shaky cam and in 2004 that was quite rare in action movies.The movie was undoubtedly inspired by many American movies such as The Matrix, Spiderman and even The Shining. The director incorporates these very blatant references in the movie to the point that it seems like it is copying but yet it feels unique due to how the director utilises it. All the actors in this movie are great including the director, Stephen Chow, who plays the main lead. Every actor including supporting actors embody the ridiculous nature and manage to stand apart from each other that even in the short runtime of 98 minutes, the audience can grasp every single character's personality and quirkiness in minutes. The set design is amazing as it represents the 1940's Shanghai and feels vibrant and alive. The costumes are great as they feel believable and manage to capture the personality of some of the characters. The score by Raymond Wong is incredible and captures the nature of the movie with one of the stand out being the Axe Gang music which will make you want to dance with it. If there had to be a flaw in the movie then it has to be the lack of a coherent plot. The synopsis is the basic premise for the beginning of the movie but a lot of other different plot points happen to intertwine with this about other characters and then there is this other new plot happening in the third act which makes it feel incoherent. Another flaw would be the lack or very rushed character development which is in part due to its short runtime. Characters can completely change in personality in a matter of minutes without any real build-up towards it.Bill Murray described this movie as \"the supreme achievement of the modern age in terms of comedy\" and honestly that is a fair assessment. I feel like there will never be another movie like this ever. The movie blends kung fu, CGI and cartooney humour to create what I consider is one of the most hilarious movies ever made. If you haven't watched it then I HIGHLY recommend you give this movie a watch!",
      "review_date": "2020-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is great... Maybe it is a little bit lesser than Shaolin soccer but enjoyable all the same.",
      "review_date": "2020-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another great film from Stephen Chow. \"Kung Fu Hustle\", as the title suggests, is a well choreographed combination of martial arts and humor. The plot is silly, but when there are so many hilarious scenes, you really just don't care anymore.Another great film from Stephen Chow. \"Kung Fu Hustle\", as the title suggests, is a well choreographed combination of martial arts and humor. The plot is silly, but when there are so many hilarious scenes, you really just don't care anymore. Oh, and don't expect any character development, there's no time for that.",
      "review_date": "2013-11-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Worst movie ever!! I was excited to finally see it after so much hype. I couldn't even get half way through it. Completely cliche and over the top. The writing is also horrible. I'd feel differently if it was at least clever abd Worst movie ever!! I was excited to finally see it after so much hype. I couldn't even get half way through it. Completely cliche and over the top. The writing is also horrible. I'd feel differently if it was at least clever abd humorous. But I feel the director tried to use too many stylish scenes with redundant special effects. This movie made me ill. I couldn't believe it was this bad. The director needs to stop watching American cartoons. What's funny and absurd to him may have been funny back in the 40's or 50's. Audiences are smarter than this. Hopefully.",
      "review_date": "2005-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA recent film I watched was entitled Kung Fu Hustle directed by Stephen Chow. One of the reasons I enjoyed this movie is the humour and the way it sends a message that there are serious problems of society in our time. One part of the movie I particularly enjoyed is the way it uses music and sounds to give a better meaning to the movie. At some moments the music was able to give the meaning of humor, but it was also able to give moments wherein we must be serious. With the music it also makes us want to think - what is the meaning of this scene. The elements incorporated gave the meaning of importance.The kungfu hustle movie focuses on satire, a way to criticize something through humor and irony. As the movie goes on it focuses on martial artists, gangs and normal people. This shows that there are levels in society wherein one is stronger than the other. The main character a seemingly weak person wants to join the axe gang, but is instead rejected, and used to get their end goals. But after a while he betrays the enemy and joins the good guys and then beats the enemy. This shows that people in the low society are always used and are rejected, but even if they are down in society they are able to rise up and become better, stronger than the ones who think they’re on top. Overall the way it sends a message and how nice the movie was, I’d give it a 8/10.",
      "review_date": "2018-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great comedy if taken lightly. However, I saw this once in theaters and once on DVD. I give a 9 for the theater version. I give a 2 for the DVD version. It seems the subtitles were completely off from what I saw at the theaters, and took a A great comedy if taken lightly. However, I saw this once in theaters and once on DVD. I give a 9 for the theater version. I give a 2 for the DVD version. It seems the subtitles were completely off from what I saw at the theaters, and took a lot away from the humor.",
      "review_date": "2007-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While this movie did have many funny parts the overall movie didnt make me laugh that much. I rented it in hopes of a constant laugh fest more like kung pow and what i got was a good movie with interesting characters but not at all like what While this movie did have many funny parts the overall movie didnt make me laugh that much. I rented it in hopes of a constant laugh fest more like kung pow and what i got was a good movie with interesting characters but not at all like what i expected.",
      "review_date": "2005-09-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's potent overall as a whole, but the comedy sometimies comes off as a hit or miss affair. The Looney Tunes impressions weren't all that humorous. THe back story is actually somewhat good, but actually begs for a serious approach It's potent overall as a whole, but the comedy sometimies comes off as a hit or miss affair. The Looney Tunes impressions weren't all that humorous. THe back story is actually somewhat good, but actually begs for a serious approach instead of zaniness. A Great action movie, and OK comedy that begs for a more serious undertaking. No complaints aboutt he last fight scene, where the parody of old kung fu movies actually works well w ith yuen Mo Ping's choreography.",
      "review_date": "2005-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have seen thousands of movies in my lifetime, this one is in the top 3. Very fun to watch and never wanted it to end. Thank-you Mr Chow.",
      "review_date": "2005-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's fun and if taken lightly, it will grab you and let you in. It's a parody, so just let the ride take you and don't worry too much about deep meanings in this romp. Just enjoy the ride.",
      "review_date": "2006-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a breath of fresh air! An amazing movie; very well done. Those who voted 2 or so must have a boring sense of humour. Good funny films are not easy to make (and I'm a filmmaker myself!). Chow manages to pull this one off with sheer What a breath of fresh air! An amazing movie; very well done. Those who voted 2 or so must have a boring sense of humour. Good funny films are not easy to make (and I'm a filmmaker myself!). Chow manages to pull this one off with sheer brilliance. Those who moan want miracles from movies. There's nothing wrong with this one; it's perfect. I enjoyed this one much more than the Matrix trilogy. The cigar lighting scene/catching fire was the funniest movie moment ever. What a gem. Thanks Stephen!",
      "review_date": "2007-04-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie looked cartoony, but the action was so badass, like wow.",
      "review_date": "2005-08-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really funny movie, If you did not like it than you did not understand it.",
      "review_date": "2005-09-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought the movie would really stink after watching the 1st 10 minutes. After that, I was laughing to hard to care. I think it was a great movie along the lines of Monty Python and Mel Brooks. Seriousness can be overstated. Sometimes I thought the movie would really stink after watching the 1st 10 minutes. After that, I was laughing to hard to care. I think it was a great movie along the lines of Monty Python and Mel Brooks. Seriousness can be overstated. Sometimes silliness is just what the doctor ordered.",
      "review_date": "2005-09-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie. I particularly don't know what in the world the NYT is talking about in their review.",
      "review_date": "2006-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Disjointed and bizarre, this sets itself apart even from kung fu cinema. If you're used to American or European action movies, this is something completely new. Kung Fu Hustle survives on a comical strand, drawing inspiration from Disjointed and bizarre, this sets itself apart even from kung fu cinema. If you're used to American or European action movies, this is something completely new. Kung Fu Hustle survives on a comical strand, drawing inspiration from martial arts humor as well as old Looney Toons. Its insistence on empowering the weak, often making superhuman characters out of stereotypes like housewives or browbeaten husbands, is probably its best strength. Its sense of style, of constantly mingling cool (magical guitars, dropkicking mafia badguys through walls, classical or compelling music, etc.) with the deliberately uncool (old lady in hair curlers, assassin in his underwear, etc.) is something to behold. It's at least a half an hour too long, but it's such an over-the-top and oddball film that if you can let yourself go, this is a great way to kill an evening.",
      "review_date": "2007-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was the BOMB!!!!! only move that even came close to this was kung pow but this wins hands down!",
      "review_date": "2008-08-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies I've seen in a long time. Very original!",
      "review_date": "2005-08-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Most people who I have heard say they hated it (1) saw it in the movies, where it had not been dubbed, so they had to use subtitles, and/or (2) said they had walked out \"half way thru,\" whereas it is towards the end the action really picks Most people who I have heard say they hated it (1) saw it in the movies, where it had not been dubbed, so they had to use subtitles, and/or (2) said they had walked out \"half way thru,\" whereas it is towards the end the action really picks up, and the dialogue becomes almost irrelevant. BTW, if you watch the DVD, listen to the English track AND watch the close captioning. The two apparently were translated separately, and sometimes one is better, and funnier, than the other.",
      "review_date": "2005-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An amazingly funny movie, a total break from the American-type comedies (most of which are fairly dark and sarcastic nowadays). This is the \"Family Guy\" of movies, and if it doesn't have you in stitches you really need to check your An amazingly funny movie, a total break from the American-type comedies (most of which are fairly dark and sarcastic nowadays). This is the \"Family Guy\" of movies, and if it doesn't have you in stitches you really need to check your pulse: you may be dead!",
      "review_date": "2006-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is wonderful. Absolutely adorable and funny; I loved it.",
      "review_date": "2006-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have to be honest, I REALLY enjoyed this movie! What a great comedy. I don't let reviews sway my opinions on stuff but glad it got a good reception.",
      "review_date": "2007-12-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hilarious absurdity and comedic timing. Like the Monty Python of Asian films.",
      "review_date": "2007-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely wonderful film. The action was brilliant, the comedy was hilarious, and it had a great story to boot.",
      "review_date": "2008-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a fantasticly fanciful action comedy.",
      "review_date": "2008-08-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Low and negative votes due to moral righteousness is a total non sequitur for a film that does not expect itself to be taken seriously. This film had everything, including one of the funniest scenes I have ever seen in my life. We had to Low and negative votes due to moral righteousness is a total non sequitur for a film that does not expect itself to be taken seriously. This film had everything, including one of the funniest scenes I have ever seen in my life. We had to stop the movie so that we could have a moment to die laughing....The action, physical acting, special effects, crazy characters and its fable-like approach to story telling makes this one of the funnest, and kick-a$$ experience you could ever hope for from a movie.",
      "review_date": "2005-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I actually watched this film by accident and i must say it was one of the best accidents i have ever made. it was so original, funny, sweet, emotional, and unlike any movie i have ever seen. it may seem a bit silly at first but the story is I actually watched this film by accident and i must say it was one of the best accidents i have ever made. it was so original, funny, sweet, emotional, and unlike any movie i have ever seen. it may seem a bit silly at first but the story is so well done and i went from dieing of laughter to wanting to cry to being in utter shock. i LOVE this movie and if you havent seen it, then watch it....right now, the whole thing. its great!",
      "review_date": "2008-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hats off to Stephen Chow for doing virtually for everything in this film (writing, directing and staring). There was certainly a lot of things doing for this movie. It was pretty comedic at times, Had plenty of good characters and the fightHats off to Stephen Chow for doing virtually for everything in this film (writing, directing and staring). There was certainly a lot of things doing for this movie. It was pretty comedic at times, Had plenty of good characters and the fight scenes, while a bit too CGI for my taste, were enjoyable as well. It's certainly a very unique movie and I really appreciate that but it's not without its flaws.I felt the story kind of faded in and out throughout the course of the movie, Pacing was a little uneven and I thought that they could have used a bit more action sequences rather than saving everything for the ending.",
      "review_date": "2019-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great martial arts comedy. It won me over with its characters, humor and awesome fights. It is set in the 1940ties in Shanghai. There the criminal Axe Gang has taken over the city. They are more ruthless, brutal and uncompromising than allA great martial arts comedy. It won me over with its characters, humor and awesome fights. It is set in the 1940ties in Shanghai. There the criminal Axe Gang has taken over the city. They are more ruthless, brutal and uncompromising than all others which is especially true for their leader Brother Sum. Meanwhile the two crooks Sing and Bone try to pull of a scheme to extort money from the residents of the Pig Sty Alley by pretending to be members of the Axe Gang. Unbeknownst to all the residents are not that defenseless. I stop here to avoid spoilers. The story is really entertaining. They mix interesting characters with good backstories into an immersive story add humor, character growth and great martial arts fight scenes. This fully worked and won me and my friends fully over. The actors are amazing. Stephen Chow as Sing is a great main character that we rooted for, Danny Chan Kwok-kwan as Brother Sum so enjoyable evil and Leug Siu-lung truly magnificent “Beast”. Also all the other actors do a great job and I praise the whole cast, director, writer and team behind the screen. The fights are immersive and put a smile to my face. I think the team had as much fun as we viewers. The final battle alone is worth watching the movie. Lastly the humor works well and it entertained us too. Overall I recommend this movie to martial arts lovers and comedy fans. It is enjoyable and entertaining. Barely misses a 10/10 for me.",
      "review_date": "2022-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very funny movie that pushes the envelope in terms of form and tone. It's a true original -- you've never seen anything quite like it.",
      "review_date": "2021-06-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is simply an excellent comedy. Tons of wacky twists, great action and lots of other movie references for you to force trivia down your friends throats while they watch it with you. Almost as pure in hilarity 'God of Cookery'.",
      "review_date": "2016-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What happens when a daydreamer yearns to join a ruthless gang? You get an action-comedy story that dumps Jackie Chan, Bruce Lee, The Matrix, Zhang Yimou, the Looney Tunes, and Tarantino in a shaker. The combination may not be for an anthologyWhat happens when a daydreamer yearns to join a ruthless gang? You get an action-comedy story that dumps Jackie Chan, Bruce Lee, The Matrix, Zhang Yimou, the Looney Tunes, and Tarantino in a shaker. The combination may not be for an anthology but it does provoke more than one laugh.",
      "review_date": "2021-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Beautifully directed, lots of charm, and has some really stupid but hilarious moments. Kung Fu Hustle is a very unique action comedy that even has a bit of emotion to it too. It has the perfect mix of style, action, humour and parody. Most ifBeautifully directed, lots of charm, and has some really stupid but hilarious moments. Kung Fu Hustle is a very unique action comedy that even has a bit of emotion to it too. It has the perfect mix of style, action, humour and parody. Most if not all of the acting is top-notch, however i did wish the characters had more development. The fight scenes are fantastic - amazing choreography, beautifully directed and are so entertaining, humorous and even suspenseful at times, although a lot of the CGI did bother me. My biggest flaw with Kung Fu Hustle however would be that some of the jokes fall flat, or are ruined by CGI. There is also a scene where you suddenly realize who a certain character is, and it's a powerful moment - until it then ruins itself by using an unnecessary flashback to explain who that character is. Apart from those few flaws i really enjoyed Kung Fu Hustle with its beautiful direction, amazing choreography and its style, its charm, the humour and the action, and i'm going to give it a 7/10. I highly recommend checking this one out.",
      "review_date": "2016-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pure entertainment.Beautifully filmed, with a story structure that doesn't skip a beat.  Riveting action sequences are in abundance, plenty of humor and heart.  Timeless classic and a rare film that's served better with English dubs",
      "review_date": "2018-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is strange in many ways. Funny, yes, but also so weird to the point that I felt alienated sometimes. This is something you can watch with your friends when you're drunk - something like Who Killed Captain Alex?, but besides theThis movie is strange in many ways. Funny, yes, but also so weird to the point that I felt alienated sometimes. This is something you can watch with your friends when you're drunk - something like Who Killed Captain Alex?, but besides the over-the-top fight-scenes, it doesn't have much else to offer in my opinion.",
      "review_date": "2021-04-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "How did I miss this one? I went in thinking I was getting a straight up kung fu movie, but I ended up being entertained by the hilarity of it all. Still, I felt like the film lost itself in certain comedic moments, and it ended up not being for me.",
      "review_date": "2020-03-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Funny, excellent fight scenes, a cartoonish classic. the cgi is very dated but hardly affects the quality of the film",
      "review_date": "2020-06-21",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 86,
  "genres": [
    "Action",
    "Fantasy",
    "Comedy",
    "Crime"
  ]
}