{
  "title": "Match Point",
  "rating": 8.4,
  "release_date": "2005-12-28",
  "genre": [
    "Drama",
    "Sport",
    "Thriller",
    "Romance",
    "Crime"
  ],
  "summary": "Match Point is a drama about ambition and obsession, the seduction of wealth, and the often discordant relationship between love and sexual passion.  Perhaps most importantly, however, the story reveals the huge part luck plays in the events of our lives, refuting the comforting misconception that more of life is under our control thanMatch Point is a drama about ambition and obsession, the seduction of wealth, and the often discordant relationship between love and sexual passion.  Perhaps most importantly, however, the story reveals the huge part luck plays in the events of our lives, refuting the comforting misconception that more of life is under our control than really is.  (Dream Works Pictures)… Expand",
  "critic_reviews": [
    "One reason for the fascination of Woody Allen's Match Point is that each and every character is rotten.",
    "Whether it's simply the change of locale, or a change in Allen's psyche, something is up in Match Point. With a dark view of humankind, and of the vagaries of chance - bad luck, good luck, dumb luck - the filmmaker has crafted a wicked, winning gem.",
    "Allen's most satisfying film since \"Bullets Over Broadway\" (1994) and his most compelling since \"Crimes and Misdemeanors\" (1989).",
    "To call Match Point Woody Allen's comeback would be an understatement - it's the most vital return to form for any director since Robert Altman made \"The Player.\"",
    "An unpredictable, unusual, consistently engrossing drama of a kind that has almost disappeared from Hollywood.",
    "It's a sexy thriller, tautly constructed, deeply acted and heartfelt, despite a cool and knowing tone.",
    "The gloom of random, meaningless existence has rarely been so much fun, and Mr. Allen's bite has never been so sharp, or so deep. A movie this good is no laughing matter.",
    "Not only could one argue that this is the best \"serious\" work the director has ever attempted, but it's presented in a way that even the most seasoned Allen fan will have difficulty recognizing the iconic filmmaker's fingerprints.",
    "Woody's a master wordsmith, and here he's crafted a bit of audience-friendly fare that's smart without feeling exclusionary. It's a portrait of elite society--and the hangers-on who wish to penetrate it--made in an surprisingly accessible way.",
    "Allen, rejuvenated by foreign settings, makes us appreciate posh parts of England as he always did Manhattan. (Credit cinematographer Remi Adefarasin for showing us how seductive upper-crust London can be.)",
    "Match Point begins to recall Hitchcock as it unfolds, although it wouldn't be right to call it a thriller. This is still very much a Woody Allen movie, populated by upper-class characters who chatter about literature and fine art, frequent museums and designer boutiques and accidentally run into each other on the street with uncanny regularity.",
    "Woody Allen's best movie in years means to trip us up: Sexual sizzle. London instead of Manhattan. Brit actors. Dark humor with a sting that leaves welts. You bet it's a change. And it looks good on the Woodman.",
    "Its many pleasures derive from the way this drama unfolds unexpectedly from the characters rather than imposing itself on them.",
    "What fans want are good movies. This one isn't particularly funny or romantic, but it's gripping and tragic. It asks some nasty, yet profound, questions about human desire and behavior.",
    "Rhys-Meyers and Johansson work well together - they both know how to project glossiness and guile.",
    "Even for non-Allen fans this has all the appeal of a good story well told and capped with a deliciously vicious little twist.",
    "A sort of romance noir -- spruced up in pressed white linens -- this British-made film is elegant, uncompromising and oh-so- veddy nasty.",
    "Well-observed and superbly cast picture is the filmmaker's best in quite a long time.",
    "Allen covers it all with intelligent dialogue and unexpected moments of clever visual storytelling.",
    "It pretty much keeps its pulse steady, its blood cold and its nerves tamped down -- which, combined with cinematographer Remi Adefarasin's architectural Hitchcockian flourishes, lends a queasy, cool air to the proceedings.",
    "Match Point is fantastic to look at, sharply dramatic and Allen is--who knew?--a master of suspense.",
    "The movie is unexpectedly disciplined and enjoyable.",
    "Proof that Allen, who many have dismissed with his last few forgettable films, is still a filmmaking force.",
    "Allen's new movie, Match Point, devoted to lust, adultery, and murder, is the most vigorous thing he's done in years.",
    "An efficient genre piece with a few provocative metaphysical trimmings; the mainly English cast is effective.",
    "Match Point starts out crisply and deliciously, but in the end, it's a chess problem crossed with an ethics exam.",
    "One aspect certainly is remarkable. The dialogue is, at least to an American ear, authentic. Allen doesn't mention any aid on the script, so we are to assume that he wrote it himself.",
    "Switching into a dramatic gear, Woody Allen surprises but often struggles in this dark morality tale.",
    "Though the tale is told with crisp sangfroid and a wonderful twist, there's hardly a scene I haven't seen somewhere else.",
    "When they get to canoodling and conniving, you won't ask for your money back.",
    "Just when the seemingly endless scenes of Johansson's nagging threaten to sink Match Point for good, the movie becomes the thriller that early reports promised.",
    "The question that should be asked is whether Woody Allen has made a good movie this time out, and the honest answer is \"almost.\"",
    "Match Point may well be a return to form but only for those who love \"September\" and \"Interiors,\" movies populated by Bergman evacuees too inert and dreary to even crack a smile.",
    "Rather than providing a foil for Bill Murray in \"Lost in Translation\" or embodying the mostly silent model for the painter Vermeer in \"The Girl With One Pearl Earring,\" Johansson actually has to emote prodigiously here, and she is just not up to the task.",
    "Johansson bequeaths the welcome sight of a talent in full bloom to this wilted, dark whimsy of a movie.",
    "Match Point is a perfectly presentable, entirely unremarkable domestic melodrama parked queasily between opera and realism, two irreconcilable forms if ever there were.",
    "Match Point is a fatally neat exercise in detached craftsmanship, and maybe that's the best we can expect from Allen at this point.",
    "This thin chronicle of bad behavior among the rich and self-obsessed is above all painfully derivative, borrowing wholesale from Theodore Dreiser's \"An American Tragedy\" and echoes Allen's own \"Crimes and Misdemeanors.\"",
    "A modest and mildly pretentious mediocrity in the Woodman canon."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This is one of my favorite movie ever. It's a very smart plot (normal for Woody), about a ambicious and smart tennis player, who uses his interest in high culture to penetrate the upper class. Chris is completely amoral. He just coldlyThis is one of my favorite movie ever. It's a very smart plot (normal for Woody), about a ambicious and smart tennis player, who uses his interest in high culture to penetrate the upper class. Chris is completely amoral. He just coldly calculates the probability of success. Woody plays well with the theme of luck (which is common in his movies), including two interesting scenes, one at the begginning, with a tennis ball touching the net  and luck defining in which side of the court it is going to fall, and another one at the end that makes you anticipate, wrongly, the end of the movie. Scarlett is gorgeous. Myers delivered a good performance. The movie oscilates a lot in its plot, as luck is seemingly defining the path the characters take, and the end tends to be not what you expected (unless you know Allen well). It is philosophical, entertaining, full of suspense and sexy. A masterpiece in my opinion. Dostoevsky would be proud, despite the alternative, nietzschean ending.",
      "review_date": "2015-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dark and atmospheric, \"Match Point\" is also, especially with those operatic insertions, just too pretentious for its own good. I found hard to believe what the Jonathan Rhys-Meyers character does to get out of his predicament. A different Dark and atmospheric, \"Match Point\" is also, especially with those operatic insertions, just too pretentious for its own good. I found hard to believe what the Jonathan Rhys-Meyers character does to get out of his predicament. A different Allen movie doesn't necessarily translate into a very good one..",
      "review_date": "2006-08-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie was full of great ideas only half-baked. I thought I would love it shortly into it, but I barely made it to the end. Woody Allen needs someone on his team to take care of the details. I was aggravated by the waste of the potential The movie was full of great ideas only half-baked. I thought I would love it shortly into it, but I barely made it to the end. Woody Allen needs someone on his team to take care of the details. I was aggravated by the waste of the potential this movie had.",
      "review_date": "2006-02-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Woody Allen's huge return to form (not). Well crafted but predictable, almost totally lacking in the sharp humour that distinguishes the best Allen scripts. Johannson looks uncomfortable throughout with her daggy and dreary role, and Woody Allen's huge return to form (not). Well crafted but predictable, almost totally lacking in the sharp humour that distinguishes the best Allen scripts. Johannson looks uncomfortable throughout with her daggy and dreary role, and the final Sophoclean cameo doesn't mend things. Time to prefer younger directors, evidently Allen is no Bunuel or Huston who is going to hold his nerve and pull off that very late masterpiece.",
      "review_date": "2006-04-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA great contemporary cinema adaption for \"Crime and Punishment\" in which crime is justifiable for social ascension and not for the harm an old usurer does to society.",
      "review_date": "2013-07-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Woody allen is definitely back. Great film and acting. absorbing.all characters played their roles well!!a real woody allen ending./ we are not always dealt the best of cards!!!",
      "review_date": "2006-01-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's like night and day from some of his recent films. It's entertaining, brilliant, interesting, and perfectly cast. The reviewers are way underrating this film. Woody-prejudice abounds. But this film is not a Woody Allen It's like night and day from some of his recent films. It's entertaining, brilliant, interesting, and perfectly cast. The reviewers are way underrating this film. Woody-prejudice abounds. But this film is not a Woody Allen film--it's just a really good film....great storytelling, classic and modern with a palpable tension. It's a model film.",
      "review_date": "2005-12-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best one I've seen for months.",
      "review_date": "2006-01-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I just can't believe how awful this film is and yet it reviewed so well by many. I think this is a case of people focusing on Allens excellent back catalogue of former glories and not treating this as a standalone film. The script is so bad,I just can't believe how awful this film is and yet it reviewed so well by many. I think this is a case of people focusing on Allens excellent back catalogue of former glories and not treating this as a standalone film. The script is so bad, that it made me hate it despite the normally likeable leads.",
      "review_date": "2014-04-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Appalling. The acting is fine, the filmmaking is skilled, yes; but this movie is essentially just \"Crimes and Misdemeanors\" all over again. There was no need to make this movie; Mr. Konigsberg already said what he had to say in that earlier Appalling. The acting is fine, the filmmaking is skilled, yes; but this movie is essentially just \"Crimes and Misdemeanors\" all over again. There was no need to make this movie; Mr. Konigsberg already said what he had to say in that earlier film. And all he has to say is that he is perfectly justified in having lived his selfish, amoral life. It's more of the same garbage the John Cusack author-stand-in-character spewed in \"Bullets Over Broadway\": artists are special, artists don't have to behave morally, artists can do whatever they want, including screwing and marrying the daughters of their wives and the sisters of their children. Please. Spare me.",
      "review_date": "2006-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Am I the only person who hated this film?!?! It feels like Woody Allen had 2 bottles of Shiraz and decided to write a little film! As my friend said \"this is Woody Allen's burp\" The acting is laughable, the script is awful and since Am I the only person who hated this film?!?! It feels like Woody Allen had 2 bottles of Shiraz and decided to write a little film! As my friend said \"this is Woody Allen's burp\" The acting is laughable, the script is awful and since when does it not rain in London?!?! just because there were 3 mini coopers in one scene doesnt mean its London! Awful awful awful!",
      "review_date": "2006-01-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In tennis, if the ball drops forward - you win, if it drops backwards - you don't. In Woody Allen's new film, it drops forward - Game, Set, Match. I, for one, have never thought Mr. Allens career was ever in a slump. Any film In tennis, if the ball drops forward - you win, if it drops backwards - you don't. In Woody Allen's new film, it drops forward - Game, Set, Match. I, for one, have never thought Mr. Allens career was ever in a slump. Any film written and directed by Woody Allen has been worthy of my 10 dollar admission, but in Matchpoint, he's left the comedy in Manhattan and moved his setting to London and once again made a movie that I'll drop another 10 bucks on to see it again! The critics are all saying Woody is back, well he's not back, He has just moved up another rung on his cinematic ladder. Imagine, a New Yorker making movies in London, I seem to remember that it worked for Kubrick too, but we don't have to wait 7 years for the next Woody Allen film!! Yes Virginia, there is a Woody Allen.",
      "review_date": "2006-01-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Do not spend a single minute considering MATCH POINT. It's Woody Allen (by Woody Allen) for Dummies. One A-Plot and no anything else-plots as not to confuse anyone (possibly and especially him and his obviously depleted sensibility).Do not spend a single minute considering MATCH POINT. It's Woody Allen (by Woody Allen) for Dummies. One A-Plot and no anything else-plots as not to confuse anyone (possibly and especially him and his obviously depleted sensibility). There are direct lifts of dialogue from C & M, no foolin' (\"You mean if I won't leave my wife, you'll go to her and tell her...\" crap like that). It crosses that delicate line from tension to tedium at nearly every opportunity. With a THEME (capitals, mine) (Luck Over Greatness) that's boring, obscure and meaningless to anyone who ever grew intellectually under his tutelege. Woody is so squeamish about depicting sex (pants on, blankets up to the neckline) and so it cripples him from accurately and genuinely portraying the mania that accompanies it. The lovers end up looking like they've had too many Starbucks mocha grandes or some such.",
      "review_date": "2006-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolute drudgery!",
      "review_date": "2006-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An excellent return to the crime & punishment theme Allen first visited in Crimes and Misdemeaners. Here the plot is simplified and laid bare, though with a sinister atmosphere that lurks even in the \"happy\" corners of the film. The acting An excellent return to the crime & punishment theme Allen first visited in Crimes and Misdemeaners. Here the plot is simplified and laid bare, though with a sinister atmosphere that lurks even in the \"happy\" corners of the film. The acting is top notch and the denoument works perfectly.",
      "review_date": "2006-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A Must see. All the people that are giving low ratings don't have the brain power, nor the culture to Understand Woody Allen's Genius. I'm still thinking about this movie...truly a great work.",
      "review_date": "2006-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Following two painfully slow and pointless hours viewing his latest, I'm still nowhere on the road to appreciation of Allen films -- one-dimensional women and men who are jerks and get away with in -- all in a faux upper class setting Following two painfully slow and pointless hours viewing his latest, I'm still nowhere on the road to appreciation of Allen films -- one-dimensional women and men who are jerks and get away with in -- all in a faux upper class setting -- not so clever, insightful, or fabulous in my opinion.",
      "review_date": "2006-02-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Provocative and entertaining. Although I don't necessarily agree with director/writer Woody Allen's point of view on matters of fate and morality, I appreciate his ability to ask thought-provoking questions on the nature of life.",
      "review_date": "2006-03-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Much better than average adult movie. Not many out there any more!",
      "review_date": "2006-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hugely disappointing. Movie is shallow, characters are flat. I was expecting to see plot and characters that would move me in similar way as Closer, but I was totally turned off. Woody Allen fails to unleash the potential of the characters, Hugely disappointing. Movie is shallow, characters are flat. I was expecting to see plot and characters that would move me in similar way as Closer, but I was totally turned off. Woody Allen fails to unleash the potential of the characters, which act mechanically. Scarlett Johansson's monotonous role hugely fails to leverage her talent. Jonathan Rhys-Meyers' role gave him potential to shine but he fails to deliver the goods. Only Emily Mortimer as Chloe seems to perform consistently and with some sentimental background. Shame. ",
      "review_date": "2006-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Any half-way literate person will love this movie. The entire second half or so is a wonderfully done modernization of Dostoevsky's \"Crime and Punishment,\" with some interesting twists and turns. Actually of the people I know who Any half-way literate person will love this movie. The entire second half or so is a wonderfully done modernization of Dostoevsky's \"Crime and Punishment,\" with some interesting twists and turns. Actually of the people I know who disliked this film, none of them had read \"Crime and Punishment\"--so maybe being intelligent makes this film more enjoyable.",
      "review_date": "2006-01-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Luck has everything to do with it as does sexual passion.",
      "review_date": "2006-01-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Although I disagree with Dr. Suess (the poster) that having read \"Crime and Punishment\" makes you intelligent, I did find it quite a nice surprise to see how the classic found its way into the movie. It was very satisfying. I do find it Although I disagree with Dr. Suess (the poster) that having read \"Crime and Punishment\" makes you intelligent, I did find it quite a nice surprise to see how the classic found its way into the movie. It was very satisfying. I do find it curious that hardly any of the other critics (the official ones) noted it, but overall it was a great movie, however a little broken in two, which wasn't all that bad.",
      "review_date": "2006-01-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Brilliantly captures British upper class. Well written, provocative storyline, well acted. Defintely very very good with moments where the insights make it great.",
      "review_date": "2006-01-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I realize that I am going against the grain here, but I really, really, hated this movie. If I hadn't had to write a review for the school paper, I would have walked out, which I had never done. If you want to see how bad Closer would I realize that I am going against the grain here, but I really, really, hated this movie. If I hadn't had to write a review for the school paper, I would have walked out, which I had never done. If you want to see how bad Closer would be without Clive Owen, then Match Point is the movie for you. It is completely irredeemable.",
      "review_date": "2006-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "most uncomfortable movie i have ever seen - felt like it lasted 5 hours instead of two.",
      "review_date": "2006-01-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Nudity would've been right for this movie. Ludivine Sagnier, if she could learn an American accent, would've been the right girl. During the filming of \"The Island\", it was reported that Scarlett Johansson volunteered to go Nudity would've been right for this movie. Ludivine Sagnier, if she could learn an American accent, would've been the right girl. During the filming of \"The Island\", it was reported that Scarlett Johansson volunteered to go topless, but Michael Bay needed to pull in a PG-13 rating. The love scenes between Chris(Jonathan Rhys Meyer) and Nola end just before things get interesting. We need to see what Chris sees, but the hiding of Johansson's birthday suit puts lust and greed on unequal footing, so the decision made between these two powerful emotions seems like the plausible one to make if you're a sociopath. \"Match Point\" is a good film, but it's no better or worse than \"Melinda and Melinda\" and \"Sweet and Lowdown\".",
      "review_date": "2006-01-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Like with most recent Woody Allen movies, proven actors are maddeningly wasted in two-dimensional supporting roles bringing the kind of character depth you'd find in a Banana Republic Holiday Story. The excellent above the line actors Like with most recent Woody Allen movies, proven actors are maddeningly wasted in two-dimensional supporting roles bringing the kind of character depth you'd find in a Banana Republic Holiday Story. The excellent above the line actors (including Brian Cox, Emily Mortimer, Matthew Goode and Penelope Wilton) are immaculately dressed and filmed with absolutely nothing original to do or say. In Allen's world, the obscenely wealthy Hewett clan just sip G&Ts, play polo and go to the opera - evoking unintentional laughs in this Serious Woody Allen Film. Maybe it's the director's commentary to paint the British upper class so broadly, but the problem with gutting the family of character is the viewer is forced to wade through strings of unbelievably hollow and inconsequential scenes and chatter to reach the mildly interesting parts. Allen effectively zeroes in on the film",
      "review_date": "2006-01-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Without doubt the worst film I've ever paid to see. It's odd how critical acclaim seems to be divided across the Atlantic. Generally, the American papers loved it, the British papers loathed it. As a Londoner who's been Without doubt the worst film I've ever paid to see. It's odd how critical acclaim seems to be divided across the Atlantic. Generally, the American papers loved it, the British papers loathed it. As a Londoner who's been happily settled in San Francisco for many years, I'm ASTONISHED by the fact that this film has garnered any favourable reviews at all. It is a risible movie. The script is absurd, the location/accents inauthentic, the plot ridiculous, the acting appalling - Jonathan whats-his-name is just unbearable....and while Scarlett looks lovely, she has nothing to play with here... I estimate that a third of the audience walked out when I saw this last Saturday. I did stay to the end - happily heckling, laughing and sympathising with the remaining audience. Utter sh.t. Go see it - you'll be as astonished as i was.",
      "review_date": "2006-01-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't usually give movies \"10s\" or \"0s\" - but if it's deserved, it's deserved. I'm not even sure where to start with this movie: the writing was *ghastly*, cliched, pompous, heavy-handed. I ended up loathing every I don't usually give movies \"10s\" or \"0s\" - but if it's deserved, it's deserved. I'm not even sure where to start with this movie: the writing was *ghastly*, cliched, pompous, heavy-handed. I ended up loathing every character - not that I have to like characters to like a movie, but there has to be *something* that makes the whole thing worth your time. The characters were too shallow to permit any kind of understanding of the \"human condition.\" I lived in England for a little while and *cringed* at all the blatant and ridiculous stereotypes. And to top it all off, it was *boring*! I was looking at my watch only a half-an-hour in. By the time the third or fourth false ending rolled along, I was literally groaning in my seat. The ghosts/guilty apparitions in the kitchen?? The ridiculous dialog between the police detectives?? The convenient fact that a heroin addict found the ring?? And *yes* I get that it's a movie about luck (had that theme pretty much crammed in my ear within the first few minutes), but that's just **bad** writing. UGH. The acting was all right, given what the poor actors had to work with. The sex was cliched, uninteresting. There wasn't a single new or interesting or provocative image or message in this whole overly-long movie. Really and truly bad. I can't believe the critics like it. Full of literary/musical/cultural allusions, yes, aren't we all smart? But relentlessly superficial and banal, and, no, I don't think *that's* the point. The movie took itself far too seriously for that to have been the point. That's it. I'm officially done with Woody Allen.",
      "review_date": "2006-01-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A truly Awesome film......Great acting....The writing is superb. This is a must see film. If you hate Woody Allen; You'll love him now..",
      "review_date": "2006-01-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Woody Allen's most brilliant work in many a year. Unlike the ridiculous King Kong, this film had actors with real dialogue and a director with outstanding skills. Although it starts slowly, it builds until it actually grasps its Woody Allen's most brilliant work in many a year. Unlike the ridiculous King Kong, this film had actors with real dialogue and a director with outstanding skills. Although it starts slowly, it builds until it actually grasps its audience in conflict. You find yourself unsure how to resolve the conflict until a desparate act is committed. From this point, you finally realize that in life, it doesn't matter how good you truly are? All it takes is a luck and being in the right place at the right time; or sometimes, unfortunately in the wrong place at the wrong time. Woody Allen dispells the notion that good things happen to good people and bad things happen to bad people. Luck can be both good and bad. Absolutely thought provoking? Worth the watch if you stay with it.",
      "review_date": "2006-01-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A marvelous, stunning flim. The 3 of us who went the other night still can't stop thinking about it. The casting is perfect, the story sublime. If you appreciate more to film than the latest Vin Diesel vehicle, go see this. It's great.",
      "review_date": "2006-01-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was kind of muddling through this one throughout the first two thirds of the film, and was pretty unimpressed. It was kind of slow, kind of boring at times, and I agreed with some of the naysayers that the film was lacking any oomph. I was kind of muddling through this one throughout the first two thirds of the film, and was pretty unimpressed. It was kind of slow, kind of boring at times, and I agreed with some of the naysayers that the film was lacking any oomph. However, the end of the movie changed all of that for me. This film will hardly hold up with Allen's greatest works, but this was an extremely solid effort, and he took what could have been a completely vanilla movie and turned it into something my wife and I were talking about the rest of the night. No, it's not as good as \"Crimes and Misdemeanors\" by any stretch of the imagination. But it is a good film by its own right, and is a very different film thematically. Here, Woody questions the ideas of luck, class, character, and opportunity very successfully. For those that say the dialogue is boring, I say you weren't paying attention enough to the story. There are several hints dropped along the way, and judgments are made about every character. The miracle here is that Scarlett Johansson's Nola, who at first glance seems like an airheaded nymph, turns out to be the moral center of the film. This film is a thinker; don't let the slow pace fool you. You won't get it if you're not paying full attention.",
      "review_date": "2006-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Woody Allen has always been a bore. And still is a bore!",
      "review_date": "2006-01-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic from start to finish. Excellent film perhaps the best of 2005.",
      "review_date": "2006-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I have just returned from the cinema and have to warn you all out there to wait until this movie appears on your television sets on a Sunday afternoon, just so you have the option to turn the channel over. It was so boring that it could have I have just returned from the cinema and have to warn you all out there to wait until this movie appears on your television sets on a Sunday afternoon, just so you have the option to turn the channel over. It was so boring that it could have easily been a 2 part drama on television, and a pretty average one at that. I totally agree with the comments made by Heather W so I'm not going to be repetative and just point you in the direction of her post. (Apart from the not liking Woody Allen anymore, But word of advice, Stick to comedy Woody).",
      "review_date": "2006-02-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Although the pace is often maddeningly slow, the plot is intriguing enough though not entirely original. Allen's still got it, and he proves that by staying away from his trademark wit and humor, instead providing a tense and troubling film.",
      "review_date": "2006-04-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Chilling, intensely fascinating nail-biter. You'll want to watch it again just to pick up on all the nuances. One of those layered classics you can discuss for hours afterward.",
      "review_date": "2006-05-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am shocked at the grotesque judgement of professional critics who have given good reviews. It is almost as bad as the worst film of all time, 'Breaking the Waters.' Forget that it is contrived in the cheapest way, I am shocked at the grotesque judgement of professional critics who have given good reviews. It is almost as bad as the worst film of all time, 'Breaking the Waters.' Forget that it is contrived in the cheapest way, Dostoevski's Crime and Punishment, the crooning of Caruso, the lame tennis metaphors, the acting is horrible, and their is nothing to redeem the wast of time. Films like this makeme want to demand my money back. They are a fraud. Reviewers who compared it to Robert Altman's, The Player, are out of their mind. Let's note some differences. The lead character was sympathetic, his dead protagonist unsympathetic, his death propelled by accidental rage and passion. Here we have an unsympathetic character who coldly plots the murder of his pregant girlfriend and carries it out. Why was this set in England? It is An American Tragedy merged with A Place in the Sun, inspired by Crime and Punishment, with a single twist that let's Liz Taylor and Montgomery Clift drive off into the sunset together. In the opening of this dirty little film, my wife's first reaction was that the lead character reminded her of Montgomery Clift. And we knew nothing in advance about the story. I felt unclean after watching it. Simply awful.",
      "review_date": "2006-05-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film was appalling. The characters' motives were unclear, there was very little chemistry, and Scarlette Johansson's acting was atrocious. It left me with a sick feeling in my stomach.",
      "review_date": "2006-06-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great wrapping, shame about the plot. If you consider yourself an above average intelligent person with an appreciation , then stay away from this one, because you will be disappointed. And if you're not, then you're not, and your Great wrapping, shame about the plot. If you consider yourself an above average intelligent person with an appreciation , then stay away from this one, because you will be disappointed. And if you're not, then you're not, and your reaction to this movie is proof. It wasn't even funny! Sic transit gloria Woody. And pity the actors and crew; this is a waste of talent.",
      "review_date": "2006-08-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So predictable, and that's because it was so unoriginal. You can't blame the actors for acting poorly in this film(for signing on maybe) when the dialogue is this pretentious with zero subtlety. Every scene is either a waste of So predictable, and that's because it was so unoriginal. You can't blame the actors for acting poorly in this film(for signing on maybe) when the dialogue is this pretentious with zero subtlety. Every scene is either a waste of time gap filler or based on ideas we've seen a hundred times. I never was a huge fan of Allen but this movie is a joke. Best Picture nominee, dear god.",
      "review_date": "2006-09-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hugely overrated film. Was so disappointed with it in so many ways. No character was believable or well-developed, the dialogue was rubbish, the plot seemed to have been hatched by a 6 year old and Scarlett Johanssen was completely wasted. Hugely overrated film. Was so disappointed with it in so many ways. No character was believable or well-developed, the dialogue was rubbish, the plot seemed to have been hatched by a 6 year old and Scarlett Johanssen was completely wasted. She is too good for this banal crap.",
      "review_date": "2007-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best film of the year, Woody's back!",
      "review_date": "2005-12-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Woody Allen abandons his usual neurotic New Yorker genre to tell the story of a man who ascends to the top of the London upper-crust, and is faced with losing it all due to his infidelity. The tale is told slowly, but the acting, writing and Woody Allen abandons his usual neurotic New Yorker genre to tell the story of a man who ascends to the top of the London upper-crust, and is faced with losing it all due to his infidelity. The tale is told slowly, but the acting, writing and screenplay are all first-rate, so it doesnt drag. The suspense which at first is lacking kicks in toward the end and the film really holds your attention. No great fireworks, and not superlative, but a well-crafted film worth seeing.",
      "review_date": "2005-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of Allen's best, period, not to mention of the top films of the year. Great acting from overall smaller time actors, great dialogue and exciting, best of all it's a movie you'll think about a long time after you see it.",
      "review_date": "2005-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What a bore and a drag. too long too predictable dont waste u r money. Better off being packaged as a Channel 5 movie (UK) or a BBC multi part drama.",
      "review_date": "2006-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Plain old stupid luck explains away all of the plot holes. That is what makes this all so enticing. Why was any of the characters a super genius? Of course not. Just that the family had everything go its way. As for the unlucky American Sexy Plain old stupid luck explains away all of the plot holes. That is what makes this all so enticing. Why was any of the characters a super genius? Of course not. Just that the family had everything go its way. As for the unlucky American Sexy Beauty, nothing ever went right for her. Wrong place at the wrong time. And that is what life is about. Now do you get it?",
      "review_date": "2006-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best films of the year. Not for those with IQ of a body temperature, though.",
      "review_date": "2006-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great film - very sharp and entertaining - highly recommended.",
      "review_date": "2006-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Only reason this isn't lower is because Scarlett Johansson looks great, but even she is unappealing and whiny throughout. The dialogue in this film is laughably poor.",
      "review_date": "2006-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Please. Moronic melodrama, laughable dialogue, ludicrous situations. A string of coincidences flimsily held together by a forced overarching theme of \"luck.\" Fraudulent and a sad testament to fall of a great artist. Don't believe the Please. Moronic melodrama, laughable dialogue, ludicrous situations. A string of coincidences flimsily held together by a forced overarching theme of \"luck.\" Fraudulent and a sad testament to fall of a great artist. Don't believe the hype. This film is the definition of \"smoke and mirrors.\"",
      "review_date": "2006-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What would movitate Woody Allen to make this inferior retread of Crimes and Misdemeanors again? Obviously the theme of getting away with murder interests him, and my guess is he's still grappling with a \"murder\" of his own; seducing a What would movitate Woody Allen to make this inferior retread of Crimes and Misdemeanors again? Obviously the theme of getting away with murder interests him, and my guess is he's still grappling with a \"murder\" of his own; seducing a young girl, his wife's own daughter, and not only getting away with it but thriving. For a man of any conscience, this must be constantly on his mind.",
      "review_date": "2006-01-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of my Allen's favorites movies. A suspense and sensuality reflexion on the luck and opportunities. Brilliant!",
      "review_date": "2006-01-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What? A shotgun goes off twice in a tight apartment building and no one hears it? Nobody does fingerprints in London? No one knew she was pregnant? How is it that he's an Irish Tennis player with an English accent? And the London Police What? A shotgun goes off twice in a tight apartment building and no one hears it? Nobody does fingerprints in London? No one knew she was pregnant? How is it that he's an Irish Tennis player with an English accent? And the London Police have Irish accents? Too many holes to fill to be believable. Sorry.",
      "review_date": "2006-01-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Appauling acting. Laughable dialogue. This film feels like it was cobbled together in 10 mins by an amateur dramatics society. Rubbish.",
      "review_date": "2006-01-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's very interesting to see the fan reviews for this movie. It seems people either loved or hated this movie. I for one loved it but it's pretty much amazing how many people hated this. WARNING nothing EXPLODES in this movie, if It's very interesting to see the fan reviews for this movie. It seems people either loved or hated this movie. I for one loved it but it's pretty much amazing how many people hated this. WARNING nothing EXPLODES in this movie, if you have ADHD you may need to pop a few ritalins to sit in one place and enjoy this one. The theater I watched it in was completely spellbound. The rich layers of metaphor and inuendo are probably lost on those giving this a red review. To me this was a better film than any i saw in 2005. This film makes no apologies that its not reality television, and it doesn't need to. Films are stories they are not real life get over it!",
      "review_date": "2006-01-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I did like this movie; I thought it was set in reality until the \"plot turn,\" and that's what made the last 30 or so minutes of this movie unbearable to me. To some reviewers that think that negative reviewers didn't see the same I did like this movie; I thought it was set in reality until the \"plot turn,\" and that's what made the last 30 or so minutes of this movie unbearable to me. To some reviewers that think that negative reviewers didn't see the same movie, yes, there are plot holes; you probably were too engrossed in the story to actually see them. Personally, I was thinking that maybe there would have been some forensic scientists in England, but in Woody Allen's England, forensic scientists must not exist. The movie covers up its plot holes, flat characters and bad dialogue with opera metaphors and the theme of \"luck over goodness.\" Apparently the metaphors and themes are what most people see in Match Point instead of the shortcomings of this movie. I must have caught a lot of the shortcomings.",
      "review_date": "2006-01-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Should have been 'made for TV', could have seen the same drivel any night of the week. The story line was so concieved you could see it coming before you even walked into the cinema!",
      "review_date": "2006-01-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film was well written and, for the most part, well acted. Don't go to this film expecting the \"typical\" Woody Allen movie - there's not much in the way of levity. The film was pretty intense, yet engrossing with a somewhat This film was well written and, for the most part, well acted. Don't go to this film expecting the \"typical\" Woody Allen movie - there's not much in the way of levity. The film was pretty intense, yet engrossing with a somewhat surprising ending.",
      "review_date": "2006-01-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I guess it's a backhanded compliment (no pun intended) to say that this is best Woody Allen movie he's made in a long time precisely because it's the LEAST Woody Allen-like movie he's made in a long time. But so what? A I guess it's a backhanded compliment (no pun intended) to say that this is best Woody Allen movie he's made in a long time precisely because it's the LEAST Woody Allen-like movie he's made in a long time. But so what? A good movie's a good movie.",
      "review_date": "2006-01-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Allen's best film since \"Crimes.\"",
      "review_date": "2006-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It captures, it intrigues; it keeps me in confrontation and in perpectual interaction with the actions and feelings of the characters. Definitely a thought-provoking film that mesmerizes and keeps the audience from falling asleep...",
      "review_date": "2006-01-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I believe one of the elements of a great film is if it can stimulate strong emotion and conflict in the viewers-regardless of whether that emotion is directed toward the characters in the film, the viewers' own lives, or some larger I believe one of the elements of a great film is if it can stimulate strong emotion and conflict in the viewers-regardless of whether that emotion is directed toward the characters in the film, the viewers' own lives, or some larger all-encompassing issue or value. Match Point depicts a number of issues with which viewers can empathize. First, there is the issue of fidelity. Then, the question arises of whether one should commit to a relationship that is secure and content but unfulfilled, or one that is full of passion and excitement but doomed to fail. Another prominent theme was the debilatating effects of guilt, which not so subtly mimics \"Crime and Punishment\" (we see the main character reading this book in the beginning of the film) Quick summary: Set in London, Chris, a penniless tennis instructor is befriended by affluent Tom, who has a cluelessly happy and rich little sister, Chloe. Chloe falls in love with Chris, and Chris devlops an attraction toward Nola, Tom's American girlfriend. I won't give anything else away. It is captivating to watch how the main characters' flaws and vile actions lead to their demise. But somehow, Allen makes you empathize with them as well, producing a provacative, mentally-stimulating film.",
      "review_date": "2006-01-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The storyline is absolutely brilliant. It really keeps you grasped throughout the entire film. A very good comeback for Woody Allen. I don't usually like his movies, but this was different...It was good.",
      "review_date": "2006-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Horrid, horrid movie. I had very high expectations for this film, but found it to be tedious and extremely unoriginal. I was reminded of The Talented Mr. Ripley, which has been one of my least favorite movies of all time... until now. I Horrid, horrid movie. I had very high expectations for this film, but found it to be tedious and extremely unoriginal. I was reminded of The Talented Mr. Ripley, which has been one of my least favorite movies of all time... until now. I would not recommend wasting time or money on this film, despite all of the acclaim. The only positive side? Beatiful cinematography. The scenes were often breathtaking. Perhaps watching it without sound would be worth a try.",
      "review_date": "2006-01-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Story could have been better. The script is uneven. The characters are two dimensional and with the exception of Scarlett Johansson are not very interesting. The third act was completely overblown and unbelievable. I think it's just Story could have been better. The script is uneven. The characters are two dimensional and with the exception of Scarlett Johansson are not very interesting. The third act was completely overblown and unbelievable. I think it's just lazy on the filmmaker's part to start the movie with the saying about being lucky rather than being good and then proceeded to make a film with 'surprise' twists. I want the film to be good not just hoping to be lucky. Too bad, the editing was a bit jumbled and thoroughly wasted beautifully filmed scenes. Woody took a big step back in this one.",
      "review_date": "2006-01-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great film.",
      "review_date": "2006-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was a laughably bad film, literally - we were in hysterics at the woefully delivered lines, the embarrasing dialogue (the foppish English thing works for Hugh Grant, but was terrible here..), the sex scenes, the overdoing of everything This was a laughably bad film, literally - we were in hysterics at the woefully delivered lines, the embarrasing dialogue (the foppish English thing works for Hugh Grant, but was terrible here..), the sex scenes, the overdoing of everything \"English,\" the unconvincing acting, and especially the ridiculous murder scene. I can't understand how anyone could have even vaguely liked this film. Perhaps the previous reviewer was right; being British might be some help in detecting the sheer aburdness of it all. A point in case being the murder scene and its aftermath, in which the pacing and acting resembled that of a silent movie. Seriously. [melodrama]I fear that non-British people who see this movie will think that we all talk in such a ridiculous and stilted manner, and I will now be afraid to speak in an English accent in public.[/melodrama]",
      "review_date": "2006-01-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Highly entertaining and extremly well done thriller.",
      "review_date": "2006-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Garbage. Though only January 7th this may be the worst film of this year and quite possibly 2007 as well. To the lemmings who love this \"film\". A few questions: In England women don't check their husbands' cell phones? Crime Garbage. Though only January 7th this may be the worst film of this year and quite possibly 2007 as well. To the lemmings who love this \"film\". A few questions: In England women don't check their husbands' cell phones? Crime victims don't get autopsies? No one checks ballistics? Fingerprints? Phone records? Oh, and what about those pesky video cameras all over the city of london? Clearly, Mr. Allen has lived in a hole for the past few years and this dreck is the result. The one good thing about this movie is that it has supplied the world with a handy metric by which to measure the intelligence of others.",
      "review_date": "2006-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I went reluctantly, with friends, and was utterly captivated by this blend of film noir and operatic melodrama set in a contemporary near-fantasy world of privilege and raw emotion. Bravo Woody!",
      "review_date": "2006-01-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Really great.",
      "review_date": "2006-01-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Frighteningly misogynistic, psuedo philosophical, unimaginative and uninspired, I almost laughed out loud at the \"hot sex\" (tight t-shirt--ripped off!)and \"sophistication\" (dog-eared Dostoyevsky). A two dimensional remake of Crimes & Misd.- Frighteningly misogynistic, psuedo philosophical, unimaginative and uninspired, I almost laughed out loud at the \"hot sex\" (tight t-shirt--ripped off!)and \"sophistication\" (dog-eared Dostoyevsky). A two dimensional remake of Crimes & Misd.- without the legandary talent or comedic subplot. I miss you, Woody. The fact that you are still fixated on this theme (men can do all kinds of terrible things and get away with it!) bodes poorly for you and all of us. Perhaps denying old sins does come at a cost after all-- the curse of making bad movies.",
      "review_date": "2006-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Refer to previous posts. This is Woody Allen at his absolute worst. The only bright spot was the guy who played Spud in Trainspotting playing a cop talking about heroin addict criminals. That was good for a reminiscent laugh. Otherwise, Refer to previous posts. This is Woody Allen at his absolute worst. The only bright spot was the guy who played Spud in Trainspotting playing a cop talking about heroin addict criminals. That was good for a reminiscent laugh. Otherwise, absolutely awful picture.",
      "review_date": "2006-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good film.The first half an hour was awkward in both dialogue and acting.When Chris and his future broher-in-law were sitting by the tennis court at the start of the film, discussing opera in their posh voices,I wanted to get sick.But it Good film.The first half an hour was awkward in both dialogue and acting.When Chris and his future broher-in-law were sitting by the tennis court at the start of the film, discussing opera in their posh voices,I wanted to get sick.But it improves tremendously.Maybe the finale was too convenient and the theme shoved in our faces, but by the end I was hooked.Johansson was superb; being careful to stay away from being both likeable and unlikeable.Where's the Oscar nomination?",
      "review_date": "2006-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am surprised to see such mixed reader reviews of this film. I was engaged throughout the story and felt (as I rarely feel) a delicious uncertainty of where the characters were headed. I was delighted at the crispness and realness the I am surprised to see such mixed reader reviews of this film. I was engaged throughout the story and felt (as I rarely feel) a delicious uncertainty of where the characters were headed. I was delighted at the crispness and realness the dialogue emoted. When Johanssen finally lashes out at Rhys-Meyers, I felt vindicated, and when the crushing ending arrives, I thought Allen provided a satisfying conclusion to an otherwise easy to follow yet captivating tale of fate, luck, and constructed destiny. I am a mild fan of Allen's work, but hands down, his decisions to let the camera watch the actors is essential to the success of the film. At times Johanssen lost my immediate attention, but Emily Mortimer was exceptionally consistent in her performance. The entire ensemble proved to be up to the delightfull challenge of Allen's stationary scenes and continual shots of interiors and exteriors. I was engaged, carried, and given a well thought out film. I appreciate it, and thank you Mr. Allen.",
      "review_date": "2006-02-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good movie. Scarlett Johansson is excellent (as always). But someone should've told me that I was going to watch \"Another crimes and misdemeanors\". Is this movie really necessary? I don't know.",
      "review_date": "2006-02-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If I hadn't known that this was a Woody Allen movie, I never would have guessed it. It's not like any of his previous movies that I have seen -- except for being very good. It's true that the pacing is a bit too slow and If I hadn't known that this was a Woody Allen movie, I never would have guessed it. It's not like any of his previous movies that I have seen -- except for being very good. It's true that the pacing is a bit too slow and deliberate in the beginning, but that allows it to slowly build to a stunning crescendo. I loved the ending. I also loved the always good Scarlett Johansson. I find it ironic that it took Woody Allen to cast her primarily for being Smoking Hot for once, instead of her usual roles where she just happens to be good looking. Whenever she was on screen the sexual tension was palpable. How some of the raters could say that this movie was flat or that she was boring is beyond me.",
      "review_date": "2006-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The characters in this movie are flat and pretentious. It's not that they are unlikeable or evil as Roger Ebert would have it. They are just boring and uninteresting. Homer Simpson is more fully rounded than most of the characters in The characters in this movie are flat and pretentious. It's not that they are unlikeable or evil as Roger Ebert would have it. They are just boring and uninteresting. Homer Simpson is more fully rounded than most of the characters in this film. He's also a lot more interesting. The characters in this movie seem more like parodies of rich people out of the Simpsons than real flesh and blood people. It is no wonder that we don't feel too saddened or shocked when someone finally gets killed. We all know that it was just a cartoon character (and a boring one at that) getting killed, not a real person. To call this film a thriller is only possible if you have slept throught he first two thirds of the film which is certainly possible. The plot twists and philosophical questions that arise near the end of the film are interesting. All in all this would have made a fine half hour Twilight Zone episode, but, as a two hour movie, it is really overwrought.",
      "review_date": "2006-02-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A terrific film that should have you guessing until the very end.",
      "review_date": "2006-02-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing film! Don't pay attention to negative reviews!",
      "review_date": "2006-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the worst movies I have seen in a long time. I am usually very forgiving of Woody Allen-- even if a movie is bad, if there is one funny line, then I enjoy myself. I can't think of any-- not a single-- moving or interesting or One of the worst movies I have seen in a long time. I am usually very forgiving of Woody Allen-- even if a movie is bad, if there is one funny line, then I enjoy myself. I can't think of any-- not a single-- moving or interesting or funny line in this movie. what happened to his writing? didn't we see this in Crimes? and how come he can't get SJ to act? Why does it seem like she is reading a cereal box? How did she turn into the girl on that seventies show? Is this the end of her reign? I would have walked out if I didn't know that it was raining outside.",
      "review_date": "2006-03-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So many people revert to hyperbole when reviewing so I figured I'd give an honest scoe. 8 1/2 is probably more accurate. A very solid and thought provoking film. The person who gave the movie a 0 and said the characters get away with So many people revert to hyperbole when reviewing so I figured I'd give an honest scoe. 8 1/2 is probably more accurate. A very solid and thought provoking film. The person who gave the movie a 0 and said the characters get away with their misdeeds is obviously not intelligent enough to intepret beyond dialogue. The last scene, and I won't spoil it, shows that none of the characters, particulalry the male lead, \"get away with it\".",
      "review_date": "2006-03-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Grating performances, unengaging characters for whom i felt no empathy whatsoever from beginning to end.",
      "review_date": "2006-03-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a good movie but very painful to watch. You can admire it but not because it is enjoyable.",
      "review_date": "2006-03-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie should NOT be rated R. I looooved it so much, but there is no nudity or language. There is one sex scene that doesnt show anything...a lot less graphic than PG-13 Titanic. There are a bunch of scenes leading up to sex but we never This movie should NOT be rated R. I looooved it so much, but there is no nudity or language. There is one sex scene that doesnt show anything...a lot less graphic than PG-13 Titanic. There are a bunch of scenes leading up to sex but we never really get there. R! Come on! Amazing film though.",
      "review_date": "2006-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first two-thirds of this film drolls through the conventional love triangle/backstabbing melodrama that is put out by so many nameless directors. If Allen is going to break his mold, he shouldn't go so far into someone else's. The first two-thirds of this film drolls through the conventional love triangle/backstabbing melodrama that is put out by so many nameless directors. If Allen is going to break his mold, he shouldn't go so far into someone else's. Granted the last third of the film saves it from total drudgery, but still it retains a sense of pretentiousness. If Allen is going to give us an operatic backdrop and intricate allusions, he should also not beat us over the head with redundant metaphors.",
      "review_date": "2006-04-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I really enjoyed this movie! Lots of twists & turns. Engendered feelings and emotions like anxiety, disgust and disbelief. Unlike most from Woody Allen, there wasn't any real humor. But like life, sometimes dumb luck and blind justice I really enjoyed this movie! Lots of twists & turns. Engendered feelings and emotions like anxiety, disgust and disbelief. Unlike most from Woody Allen, there wasn't any real humor. But like life, sometimes dumb luck and blind justice saves the day.",
      "review_date": "2006-04-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not enjoyable. Seems to tread much the same ground as Closer, just not as effectively or bravely. Shame.",
      "review_date": "2006-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Have just paused this movie - came online to find out how much more i have to endure - and just HAD to vote here! would like to second every sentiment in johnathan's posting (above), this is one of the worst films i have seen in years! Have just paused this movie - came online to find out how much more i have to endure - and just HAD to vote here! would like to second every sentiment in johnathan's posting (above), this is one of the worst films i have seen in years! am v disappointed as a woody fan, hannah and her sisters a long-time favourite.",
      "review_date": "2006-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was so boring. How did anyone get entertained by this?",
      "review_date": "2006-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's amazing to see how divided folks are on this film. Maybe it really is a barometer to filter out the intelligent from the pretenders. Most of what i would nitpick (laughable police work, ridiculously contrived situations) have been It's amazing to see how divided folks are on this film. Maybe it really is a barometer to filter out the intelligent from the pretenders. Most of what i would nitpick (laughable police work, ridiculously contrived situations) have been mentioned, so i'll just add the complete lack of chemistry between the two leads. I have NEVER seen more AWKWARD love scenes in my life. I don't normally postulate about a person's sexual orientation, but Jonathan Rhys Meyers' appeared to be in an AWFUL lot of pain, there.",
      "review_date": "2006-05-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A dragging, boring, predictable movie without any high points - disappointing.",
      "review_date": "2006-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Nothing is sadder than disparaging a movie because the main character is unsympathetic. How narrow-minded! God forbid a movie actually try to challenge one's notions of primal human desires like greed and lust rather than fall into the Nothing is sadder than disparaging a movie because the main character is unsympathetic. How narrow-minded! God forbid a movie actually try to challenge one's notions of primal human desires like greed and lust rather than fall into the same cookie-cutter cliches as most Hollywood movies. If this movie made you feel uncomfortable, guess what? That means you are actually feeling feelings and some of us consider that a key to life. If you are not one of those people, just stick to movies like Charlie's Angels and Wedding Crashers and save the sophisticated, thought-provoking, artful, intense, intelligent films for the rest of us.",
      "review_date": "2006-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Honestly, I think the movie had immense potential. However, I found the lack of chemistry between the lead characters (Mortimer, Johansson & Rhys Meyers) to be.. well, extremely difficult to endure. That being said, it's rather Honestly, I think the movie had immense potential. However, I found the lack of chemistry between the lead characters (Mortimer, Johansson & Rhys Meyers) to be.. well, extremely difficult to endure. That being said, it's rather surprisingly that I still quite liked the movie despite that massive fundamental flaw. Normally, I quite like Scarlett Johansson, but I didn't find her to be at all believable in this role and I think that she was horribly mis-cast. Jonathan Rhys Meyers and Emily Mortimer's performances were only mediocre, and as I stated earlier, they entirely lacked chemistry. In fact, I think the only person I found to be completely believable is Mathew Goode. I think he made really creative decisions and added personality to a relatively small role. Overall, the movie lacked a lot, some of which it made up for in other areas. Basically, any way you look at it, it can only really average out as mediocre. I also found it to be a bit desultory.",
      "review_date": "2006-06-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Easily the best movie I have seen in 2006. It has a great story, excellent acting and it really stays with you, long after the final credits have rolled. Scarlett Johansson and Jonathan Rhys-Meyers are amazing in this film!",
      "review_date": "2006-06-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is just excelent, and scarlet Johannson, just the most beatifull person in all the entire world.",
      "review_date": "2006-08-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "That I've seen - only Capote and Tristram Shandy were finer films in 2006. Woody Allen has created a riveting story based on the premise that life hangs in the balance -- using the wonderful opening tennis ball suspended in the air That I've seen - only Capote and Tristram Shandy were finer films in 2006. Woody Allen has created a riveting story based on the premise that life hangs in the balance -- using the wonderful opening tennis ball suspended in the air above the net metaphor --ultimately of things beyond our control. [***SPOILERS***]A dark commentary on the human soul as the main character -- who is aruable noble, not rotten as others surmise -- is corrupted by $$$. Familiar you say ? Yes, but very un-Hollywood. Briliant dialogue and supporting cast --- Allen rivets, inspires and crushes with finality. Brilliant film-making and terrific performances.",
      "review_date": "2006-09-18",
      "source": "metacritic"
    }
  ],
  "num_reviews": 139
}