{
  "title": "Oldboy",
  "rating": 8.6,
  "release_date": "2005-03-25",
  "genre": [
    "Action",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "summary": "Oh Dae-su (Choi Min-sik) is an ordinary Seoul businessman with a wife and little daughter who, after a drunken night on the town, is locked up in a strange, private \"prison.\" No one will tell him why he's there or who his jailer is. The imprisonment last for 15 years until one day when Dae-su finds himself unexpectedly deposited on aOh Dae-su (Choi Min-sik) is an ordinary Seoul businessman with a wife and little daughter who, after a drunken night on the town, is locked up in a strange, private \"prison.\" No one will tell him why he's there or who his jailer is. The imprisonment last for 15 years until one day when Dae-su finds himself unexpectedly deposited on a grass-covered high-rise roof, determined to discover the mysterious enemy who had him locked up.  (Tartan Films)… Expand",
  "critic_reviews": [
    "It's a movie of such jaw-dropping violence, wild improbability and dazzling style it overpowers all resistance.",
    "This hunt for revenge is really a quest for self-discovery. The story, acting and brilliant directing elevate Oldboy into a human struggle to know yourself and your place in the universe, and to live with that sometimes terrible knowledge.",
    "Oldboy is a powerful film not because of what it depicts, but because of the depths of the human heart which it strips bare.",
    "Park's direction is flawless and Jung Jung-hoon's cinematography is stunning.",
    "Startling and amazing -- a cinematic hammer to the skull.",
    "It's a movie that you feel you're not so much watching on screen as having beamed directly into your skull from some malign, alien planet of horror.",
    "Whatever its oversteps and excesses (I do think Park ran a little amok with the computer gimcrackery), Oldboy has the bulldozing nerve and full-blooded passion of a classic.",
    "Anguished, beautiful and desperately alive, Oldboy is a dazzling work of pop-culture artistry.",
    "It's a work of art for sure, but a sadistic one. Oldboy is one of the year's best; it just isn't for everyone. If you're still interested, go for it.",
    "As always with Park Chanwook, you just hold on and let him rip.",
    "Once the picture gets into Hollywood's bloodstream, it could well prove to be as influential as John Woo's 1989 crime thriller, \"The Killer.\"",
    "A wild, intensely cinematic ride into two men's burning desire to get even.",
    "The result is a powerfully visceral experience that justifies itself almost entirely on surface chops, with striking color composition and a complex sound design that elevates the story to an operatic scale.",
    "Obviously, this sort of taboo-flouting imagery isn't for everyone, but Park's vision is all of a piece.",
    "This is absolutely not a film for all tastes, but it's a masterpiece of pitiless power whose audacious, ambiguous climax strikes a note of insane romanticism as haunting as it is perverse.",
    "You will surely leave this movie shocked, shaken and surprisingly moved. And definitely stuck on that poor octopus.",
    "Its magnificence is that it takes itself dead serious. It's not entertainment, but it's sure a piece of toughness.",
    "While the climax is admittedly something of a letdown after all the build-up, it's a hopelessly, helplessly original film, all guts, no glory.",
    "Regardless of how you look at Oldboy, it's unlike anything you are likely to have seen before.",
    "As mysterious as it is sinister.",
    "More than anything else, Oldboy recalls Alfred Hitchcock with all restraint tossed to the wind, or Hitchcock's most obsessed devotee, Brian De Palma, at his most nastily inspired.",
    "This nightmarish revenge drama from Korea is grueling, intense, cruel -- the very definition of extreme cinema.",
    "This is a movie about draining, tenderizing and chopping up the audience emotionally.",
    "It says something when you come out of a film as weird and fantastical as Oldboy and feel that you've experienced something truly authentic. I just don't know what. I can't think of anything to compare it to.",
    "It's just the kind of film that you'd expect a jury led by Quentin Tarantino to choose, a bloody and brutal revenge film immersed in madness and directed with operatic intensity.",
    "Oldboy has the fatal air of wanting so desperately to be a cult movie that it forgets to present itself as a coherent one.",
    "Oldboy caused a love-it-or-hate-it stir at Cannes last year, and how could it not: It's an onslaught made to cause a sensation. Consider me simultaneously jolted and depressed.",
    "Entertaining to watch - notwithstanding the scene in which Dae-su eats a live animal - which is a good thing, because there is not much to think about here, outside of the choreographed mayhem.",
    "Despite its director's skill at staging trash with dash, Oldboy is too long and portentous to be an enjoyable B movie. The movie's self-seriousness short-circuits its sensationalism.",
    "There's a lot less here than meets the eye.",
    "Put simply, in my humble opinion, Oldboy sucks."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "\"Oldboy\", a Korean revenge thriller, differs from those western revenge films such as \"Kill Bill\", \"Machete\", or \"Inglourious Basterds\". It doesn't use sword and blood to define revenge, but thought provoking words and tension between the\"Oldboy\", a Korean revenge thriller, differs from those western revenge films such as \"Kill Bill\", \"Machete\", or \"Inglourious Basterds\". It doesn't use sword and blood to define revenge, but thought provoking words and tension between the main characters. It's a 'revenge' movie that builds itself unlike other revenge movies.",
      "review_date": "2011-09-10"
    },
    {
      "review_title": null,
      "content": "I read critics of people who try to explain that this movie has flaws, that Park Chan-wook is overrated or that this movie's a load of bull. Then I learn what movies they like and it all makes sense. This movie is one of the very fewI read critics of people who try to explain that this movie has flaws, that Park Chan-wook is overrated or that this movie's a load of bull. Then I learn what movies they like and it all makes sense. This movie is one of the very few masterpieces that exist in human history. If you don't like this movie or if you think you see a flaw then I ask you to watch again and again and again ad infinitum. Maybe you'll learn of its beauty somewhen.",
      "review_date": "2011-06-17"
    },
    {
      "review_title": null,
      "content": "Masterpiece. Critics who gave this movie negative reviews probably didn't understand it or it's simply not their taste. The violence may also be a bit too raw for some. But if you're a true movie fan, within 1 hour into this movie you'llMasterpiece. Critics who gave this movie negative reviews probably didn't understand it or it's simply not their taste. The violence may also be a bit too raw for some. But if you're a true movie fan, within 1 hour into this movie you'll realize that you're watching a true work of cinema art. From the intriguing storyline, raw character portrayal and excellent direction to the explosive twist ending, filled with underlying messages and morals, this is one movie you will never forget. You might even learn a thing or two about revenge.",
      "review_date": "2011-09-23"
    },
    {
      "review_title": null,
      "content": "This is the movie that prompted me to dive, head first into Korean drama. The second instalment of the Vengeance trilogy, and by far the best of the three. Oh Dae Su is a modern day Monte Cristo (as is the antagonist, the sociopath) But whileThis is the movie that prompted me to dive, head first into Korean drama. The second instalment of the Vengeance trilogy, and by far the best of the three. Oh Dae Su is a modern day Monte Cristo (as is the antagonist, the sociopath) But while the latter is imprisoned by demons  of his mind, poor Oh Dae Su is imprisoned in the literal sense. When he is released, its vengeance VS freedom. Too many times, he could have simply walked away from it all, and lived a happy life, but instead chose the path to vengeance, which leads to one of the most hideous immoral and perverse endings ever. Im not gonna spil it, but the reasoning behind his imprisonment is a bit contrived- and it could have been something a bit more solid, but it is still believable, if you put yourself in the antagonist's mind. Now lets talk art- the cinematography is breathtaking. Obscure angles, too-wide shots, split screens...all this with BOLD bright colors and high contrast, make this movie incredibly pretty to look at.  Theres some pretty epic gorey scenes with a hammer, and a sweet fighting scene set to a beautiful score (This is one of my favorite movie soundtracks, gogo Vivaldi!).\rIts a tragic tale of two mens revenge. One man in the end, dosent get to kill his adversary(and the closure he gets is pretty crappy, once he finds out the why, but hey, when your dealing with a psycho, what can you expect?), while the other succeeds in completely ruining the others life.",
      "review_date": "2010-12-10"
    },
    {
      "review_title": null,
      "content": "This movie was a masterpiece. This film is not like any western film that hit the big screen, you can say this movie is completely original. Park Chan-wook does an amazing job of delivering this dark story in a way that keeps your eyes gluedThis movie was a masterpiece. This film is not like any western film that hit the big screen, you can say this movie is completely original. Park Chan-wook does an amazing job of delivering this dark story in a way that keeps your eyes glued to the screen. This movie is very brutal and definitely not for people under the age of 18 because of the topics it deals with and the brutal violence. I would recommend this movie to anyone who enjoys Quintin Taratino movies, or any revenge movies for that matter.",
      "review_date": "2013-04-04"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA highly overrated movie , it seems that people are taken by \"visual candies\" and cinematography that they loose focus on the plot and story.\rThe movie opens high and intense and grabs you from the beginning , and you'd want to know why Dae-so was imprisoned , but when he gets out and as soon as he meets Mido the first thing that comes to your mind is that she's his daughter, although they try to push that idea away later after that , still that's the first logical explanation you got  , so that ruins the big surprise in the end.\r Also the fight scenes were very strange... why all those (thugs , gangs , security personnel....whatever they are) why they didn't have guns and just shoot him ?!! why are they carrying baseball bats ? and why are they breaking them on walls?!!\rand if his prison room had security camera why they let Dae-so continue digging through the walls all that time? and why didn't he block the sleeping-gas tubes?\r And in the final scenes, Really all that was because of a \"Rumor\"?? 15 years in prison and make him **** his own daughter for a \"Rumor\"!!! and it wasn't a \"Rumor\" !! he said what he saw, what actually happened ...!\r Woo-Jin should've just kicked Dae-so's ass in school and that's it , end of conflict.\rI don't know how things happen in Korea but when the young school girl was pregnant or appeared pregnant no investigation was done by the parents or by school or anyone !!\r Dae-so gave good emotional acting moments towards the end  , but cutting the tongue was just too much  , he could've just killed Woo-Jin and got back to his daughter...\r And the Final scene made everything worse, after all what he knew , that Mido is his daughter and that he was hypnotized to love her for the revenge , even-then Dae-so still went back to hookup with Mido..!!\r The Story is everything in a Movie no matter what genre it is even if it's a psycho / horror or even sci-fi , the story should always make sense.",
      "review_date": "2012-10-05"
    },
    {
      "review_title": null,
      "content": "The film kicks off brilliantly and at times is genuinely absorbing but, unfortunately, it fails tie up the story convincingly enough to make it a must see. The histrionics at the film's climax and the cringingly puerile motives at the The film kicks off brilliantly and at times is genuinely absorbing but, unfortunately, it fails tie up the story convincingly enough to make it a must see. The histrionics at the film's climax and the cringingly puerile motives at the story's core, spoil an otherwise enjoyable and stylish film.",
      "review_date": "2008-10-02"
    },
    {
      "review_title": null,
      "content": "After a thrilling, original premise, we take a two hour trip down mystery lane toward an incredibly unsatisfying solution. The filmmakers must have known this, when they decided to throw in another twist at the end (done to shock us on a After a thrilling, original premise, we take a two hour trip down mystery lane toward an incredibly unsatisfying solution. The filmmakers must have known this, when they decided to throw in another twist at the end (done to shock us on a pretty shallow level) since the original puzzle solution wasn't worth 2 hours.",
      "review_date": "2006-02-18"
    },
    {
      "review_title": null,
      "content": "Excellent.",
      "review_date": "2010-04-20"
    },
    {
      "review_title": null,
      "content": "Stunning performanse, stanning soundtrack, and ofcourse story!!!",
      "review_date": "2005-11-30"
    },
    {
      "review_title": null,
      "content": "It was the best movie in my life.never fet so emotionally shocked.a true love story.",
      "review_date": "2008-04-05"
    },
    {
      "review_title": null,
      "content": "It is the best revenge flm ever! Just watch it!!!",
      "review_date": "2005-10-15"
    },
    {
      "review_title": null,
      "content": "I'm sorry critics, but it looks like you're just going to have to accept it: Asian cinema rocks and it's going to take over. This is one of the best.",
      "review_date": "2005-12-20"
    },
    {
      "review_title": null,
      "content": "A masterpiece. One of the best ever. :)",
      "review_date": "2005-10-30"
    },
    {
      "review_title": null,
      "content": "Very slick but ultimately too sadistic and hollow to fill out its overlong runtime with meaning. Oh, and killing four live octopi (it wasn't just one) can never be justified in making a film.",
      "review_date": "2007-01-08"
    },
    {
      "review_title": null,
      "content": "My question is, what is the point of this movie? Besides leaving you with the feeling of being raped. This movie sucked. If you enjoyed this, you probably secretly desire incest with your children. Or you just lack complete empathy or moral My question is, what is the point of this movie? Besides leaving you with the feeling of being raped. This movie sucked. If you enjoyed this, you probably secretly desire incest with your children. Or you just lack complete empathy or moral center as a human being.",
      "review_date": "2007-11-07"
    },
    {
      "review_title": null,
      "content": "Absolutely fucking horrific. Good people are tortured in unbelievably vile ways for having done nothing at all; everyone in the film is pointlessly disturbed and it leaves one with absolutely no satisfaction at the end. I didn't feel Absolutely fucking horrific. Good people are tortured in unbelievably vile ways for having done nothing at all; everyone in the film is pointlessly disturbed and it leaves one with absolutely no satisfaction at the end. I didn't feel that justice had been done, which is the point for me of films like this, I just felt like I'd seen some cool fighting and needless suffering. Watch this if you want to destroy your faith in humanity, watch the far superior Lady Vengeance to have it restored.",
      "review_date": "2007-08-17"
    },
    {
      "review_title": null,
      "content": "A personal favourite and one of the best films from asian cinema. The plot centres around the story of Oh Dae-Su, who has been locked up in a room for 15 years. His lack of knowledge about his captors or the motives behind his imprisonment soA personal favourite and one of the best films from asian cinema. The plot centres around the story of Oh Dae-Su, who has been locked up in a room for 15 years. His lack of knowledge about his captors or the motives behind his imprisonment so drives him into insanity, with TV being his â",
      "review_date": "2011-01-24"
    },
    {
      "review_title": null,
      "content": "The film that introduced to Korean Cinema and still my favorite Korean film to date. An incredibly affecting and powerful tale of revenge. A masterpiece.",
      "review_date": "2012-11-09"
    },
    {
      "review_title": null,
      "content": "This movie leaved me uncomfortable after and slightly depressed, They're only few movies can made individual paralyzed after this bloody and horrible truth. I still don't know what inside of the director's mind of how he made this film.",
      "review_date": "2012-11-08"
    },
    {
      "review_title": null,
      "content": "I'm not even going to write a review, I want to watch this movie over and over again. Why read a review when you could be watching this movie? GO WATCH OLDBOY!! Its a truly amazing film!",
      "review_date": "2013-07-03"
    },
    {
      "review_title": null,
      "content": "Oldboy is a fu****ng great masterpiece. You will never see a film like this. An artistic film like this  It will make you feel pain and sadness but after watching oldboy you will just feel empty. It has great direction and that violence is soOldboy is a fu****ng great masterpiece. You will never see a film like this. An artistic film like this  It will make you feel pain and sadness but after watching oldboy you will just feel empty. It has great direction and that violence is so disgusting that you will want to watch that film again and again. Oldboy deserves your attention and you will be thrilled by its amazing plot, actors and an ending that you would have never expect. Thumbs up to the sky for that film. A must-watch masterpiece. And I am not lying. I wouldn't score it 10 out of 10 if it was not a great film.",
      "review_date": "2013-07-28"
    },
    {
      "review_title": null,
      "content": "Entertaining story, live octopus eating The pace is a little off but worth watching.  I also vouch for the other 2 in the trio and thirst for that matter.",
      "review_date": "2013-06-18"
    },
    {
      "review_title": null,
      "content": "It can't be missed. This is one of those films that grab your heart by the aorta and shake it around violently until you have to take a deep breath and recover from the trauma. You don't need to read a review of this movie, you need to watchIt can't be missed. This is one of those films that grab your heart by the aorta and shake it around violently until you have to take a deep breath and recover from the trauma. You don't need to read a review of this movie, you need to watch it tout suite.",
      "review_date": "2013-12-01"
    },
    {
      "review_title": null,
      "content": "A powerful film, with a powerful cast, Park Chan-wook's Oldboy is great by all means. It is rare I feel sympathy for a villain, but this film makes it happen with the great writing that went on with it. If you have a soft stomach, this mayA powerful film, with a powerful cast, Park Chan-wook's Oldboy is great by all means. It is rare I feel sympathy for a villain, but this film makes it happen with the great writing that went on with it. If you have a soft stomach, this may not be the film for you as it is a revenge film. Like most revenge films it is brutal and, without spoiling anything, has an event occur that was rather harsh to stomach down. If you can get through that, you will end up watching a piece of art in motion. A true masterpiece.",
      "review_date": "2014-06-08"
    },
    {
      "review_title": null,
      "content": "I normally avoid foreign films but this revenge drama is simply flawless, with the over the top violence and the brilliant acting elevates this ingenious film to a must see.",
      "review_date": "2014-08-15"
    },
    {
      "review_title": null,
      "content": "No me gusta criticar así las películas, pero tengo que decir que 'Oldboy' es una de las películas más raras que he visto nunca. Y es que quería darle una oportunidad al cine coreano y que mejor que con una película de la envergadura de esta.No me gusta criticar así las películas, pero tengo que decir que 'Oldboy' es una de las películas más raras que he visto nunca. Y es que quería darle una oportunidad al cine coreano y que mejor que con una película de la envergadura de esta. Dicho esto, no me parece mala película dado que esta dirigida y escrita magnificamente, pero para mí es una ida de olla, una fumada, una rayada, llamemoslo como queramos. Es una película que odio después de verla profundamente porque es el típico tipo de película que odio. La doy un 6 porque no puedo suspenderla porque a mí no me guste. Es una buena película por mucho que a mi me pese...",
      "review_date": "2017-04-13"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe best Korean movie for you to see and think about other new creative elements in Asian films in the 2000s. The director Chan-wook Park made his masterpiece.",
      "review_date": "2017-04-01"
    },
    {
      "review_title": null,
      "content": "Incredible film that pushes back the boundaries. I hate being outsmarted and it doesn't happen much, but this is a film that manages it with some style.",
      "review_date": "2006-07-01"
    },
    {
      "review_title": null,
      "content": "Jackie, the point of the movie is not to destroy all your faith in humanity, but to question it. Park actually portrays a good view of humanity. Oldboy tells us that revenge is not the best option. By stripping bare Dae-su and then Jackie, the point of the movie is not to destroy all your faith in humanity, but to question it. Park actually portrays a good view of humanity. Oldboy tells us that revenge is not the best option. By stripping bare Dae-su and then recreating him as an animalistic beast he is basically showing the depths of human destruction, and how far the want for revenge is from that lowest point. This movie is as close to a masterpiece of cinematography and plot as you could find... The man is a creative genius hell bent on showing the beauty of the human spirit!",
      "review_date": "2008-05-20"
    },
    {
      "review_title": null,
      "content": "Brilliant, brilliant, brilliant. One of the best films I have ever had the privilege to watch. It is a must see film.",
      "review_date": "2008-09-16"
    },
    {
      "review_title": null,
      "content": "Absolutely, my favorite, not one of my favorite, this is absolutely the best film and will still be in my whole life. this movie is the most brilliant thriller that has ever made. To every director and wannabes on Earth, this is the main Absolutely, my favorite, not one of my favorite, this is absolutely the best film and will still be in my whole life. this movie is the most brilliant thriller that has ever made. To every director and wannabes on Earth, this is the main text you shouldn't miss at all, shut your mouth and go for it!!!!",
      "review_date": "2009-01-07"
    },
    {
      "review_title": null,
      "content": "An amazing movie that some critics obviously dont get because there still hoping movies lie brokeback mountain and derailed will rock. Screw you critics, Asian cinema has taken over.",
      "review_date": "2005-12-07"
    },
    {
      "review_title": null,
      "content": "After hearing everyone talk about Oldboy in my East Asian Cinema class, I decided take the plunge and see it at the Nuart. I didn?t know what to expect, which is probably a blessing; expectations can go a long way towards ruining a film. After hearing everyone talk about Oldboy in my East Asian Cinema class, I decided take the plunge and see it at the Nuart. I didn?t know what to expect, which is probably a blessing; expectations can go a long way towards ruining a film. Dae-su, the protagonist, starts out as a useless drunk. Then, seemingly for no reason, he is held in a room for fifteen long years, left with only a television to entertain him. His meals come from a slot under his door, and every once and while he?s knocked out with sleeping gas. When he wakes up, his hair has been cut and he?s been given a shave. Through his TV, he learns that he is being charged with the murder of his wife. Someone clearly has revenge on his mind, but who? And for what purpose? Freud would approve. Since the plot hinges on a central revelation, I won't say anything else about it. Instead, I'll talk about some standout scenes. In a cinematic moment that has become infamous already, Dae-su (who looks just beastly with hair teased within an inch of it's life) walks into a sushi bar after being released and asks to eat something \"alive.\" He chomps into a live octopus, but before he can finish, he faints, one tentacle still squirming. On a visceral level, I was repulsed. But then I remembered that this guy just missed out on more than a decade of living and just wanted to feel vital again. In some strange way, my heart went out to him. Eventually, Dae-su figures out where he was incarcerated. So great is his fury that he storms in without any forethought, armed only with a small hammer that he picks up along the way. In a long shot of a hallway, he does battle with his former jailers, displaying an emotion I can only categorize as ?primal rage.\" Even a knife in his back can?t do much more than slow him down. What made the scene captivating was the fact that violence was used to highlight an emotion, rather than for mere shock value. If you have a strong stomach and a taste for black humor, you'd do well to see this movie.",
      "review_date": "2005-10-03"
    },
    {
      "review_title": null,
      "content": "No, this movie isn't going to be for everybody, especially for those who truely enjoy mainstream movies in America, where plot, and acting have been replaced by big names, over the top digital effects and an overall warm and fuzzy No, this movie isn't going to be for everybody, especially for those who truely enjoy mainstream movies in America, where plot, and acting have been replaced by big names, over the top digital effects and an overall warm and fuzzy feeling at the end of the movie. For those who look for something more than American cinema this is at least worth a look. It is rare that I feel I need to take a shower after I watch a movie, and every time I sit down and enjoy it I wonder if I truely am a bad person for doing so. The first time I saw it I was literally stunned. I couldn't speak, I couldn't really do much of anything but digest what I had just witnessed. I'm not sure I can think of any other movie that had that effect on me, and even now I am a bit unsettled after watching it. The style, the topics, the twists, it is all unlike anything most people have ever and will ever see because the American audience prefers to shelter itself from movies like this. My advice, if you want to look outside the box experience Oldboy at least once, start to finish, I'm willing to bet that unless you are an avid watcher of Korean cinema, you won't soon forget the plight of Oh Dae-su.",
      "review_date": "2006-11-01"
    },
    {
      "review_title": null,
      "content": "Excellent film.",
      "review_date": "2006-01-13"
    },
    {
      "review_title": null,
      "content": "Absolutely unmissable. Choi Min-Sik, Yoo Ji-Tae and Kang Hye-Jung all excel in their roles.",
      "review_date": "2006-02-04"
    },
    {
      "review_title": null,
      "content": "There is one disappoiting thing about this movie that got to be mentioned: The violence it contains and the violence the movie is advertising with that make a lot of ppls expect nothing more but a brainless b-movie massacre like for exampleThere is one disappoiting thing about this movie that got to be mentioned: The violence it contains and the violence the movie is advertising with that make a lot of ppls expect nothing more but a brainless b-movie massacre like for example kill bill is.\r In fact Oldboy is smarter, more entertaining, more emotional and more stunning than most of the high rewarded mainstream hollywood movies. An overall masterpiece in many ways and a loss for every movie fan not watching it.\r Clear 10/10",
      "review_date": "2007-01-20"
    },
    {
      "review_title": null,
      "content": "Although at times visually mesmerising I found it hard to not leave the cinema. Painful viewing left me feeling empty. Not for the weak minded, its stretched my mind. I am left asking myself wether or not that defines a good movie, one that Although at times visually mesmerising I found it hard to not leave the cinema. Painful viewing left me feeling empty. Not for the weak minded, its stretched my mind. I am left asking myself wether or not that defines a good movie, one that makes you feel bad or uncomfortable.",
      "review_date": "2007-03-05"
    },
    {
      "review_title": null,
      "content": "I just saw it, and will definitely go back for the other two in the trilogy. Although I'm not giving it a 10, and can understand some of the criticism here, but that anyone could use the attribute \"hollow\" to describe this movie is I just saw it, and will definitely go back for the other two in the trilogy. Although I'm not giving it a 10, and can understand some of the criticism here, but that anyone could use the attribute \"hollow\" to describe this movie is beyond belief. Greek tragedy at the core, and really a remarkable meditation on the idea of vengeance. With little dialogue, captures complex relationships and emotions.",
      "review_date": "2007-06-04"
    },
    {
      "review_title": null,
      "content": "Out of all the movies I've seen in the past 5 years, this movie was the best and it was made ..5years ago. It's rare that I'm still thinking of a movie days after i watch it. It totally screwed my head up. The ending was Out of all the movies I've seen in the past 5 years, this movie was the best and it was made ..5years ago. It's rare that I'm still thinking of a movie days after i watch it. It totally screwed my head up. The ending was Crazy! It just kept pouring on and on and on with twists that I could never have thought of.",
      "review_date": "2008-10-29"
    },
    {
      "review_title": null,
      "content": "10,without a doubt.I cried both-first and second time while I was seeing it.Deeply disturbing but utterly beautiful masterpiece.",
      "review_date": "2008-05-10"
    },
    {
      "review_title": null,
      "content": "Excellent.",
      "review_date": "2005-10-17"
    },
    {
      "review_title": null,
      "content": "Dazzling and sophisticated this film may be, but the fact remains that it's built on a contrived and totally unconvincing plot.",
      "review_date": "2005-08-24"
    },
    {
      "review_title": null,
      "content": "Great film, one of the greatest existential dramas in memory. BTW, when 40-year-old-virgin is given similar rating as Oldboy, one can easily voice a volume of criticism of the critics (and perhaps the mysterious rating system of this web Great film, one of the greatest existential dramas in memory. BTW, when 40-year-old-virgin is given similar rating as Oldboy, one can easily voice a volume of criticism of the critics (and perhaps the mysterious rating system of this web site). Is it possible that the last trace of intelligent thinking for the betterment of cinema are readily abandoned under the overwhelming Hollywood assault of sophomoric titles after titles ?",
      "review_date": "2005-08-28"
    },
    {
      "review_title": null,
      "content": "This movie is a unqualified classic. Cinematography, art-direction, screenplay, acting, direction--all pitch-perfect. I've seen some complaints about some of the plot twists, but really, they are so minor compared to other films of this This movie is a unqualified classic. Cinematography, art-direction, screenplay, acting, direction--all pitch-perfect. I've seen some complaints about some of the plot twists, but really, they are so minor compared to other films of this sort that are now hailed as classics that I think this film deserves to be forgiven.",
      "review_date": "2005-09-26"
    },
    {
      "review_title": null,
      "content": "Easily the greatest movie ever made.",
      "review_date": "2006-10-18"
    },
    {
      "review_title": null,
      "content": "This is one of my all-time favourite movies, and I've only seen it twice (over the last two days).",
      "review_date": "2006-04-21"
    },
    {
      "review_title": null,
      "content": "I can't remember much of anything after seeing this film except feeling completely emotionally spent. I was too busy picking up the pieces of my shattered jaw off the floor.",
      "review_date": "2007-01-28"
    },
    {
      "review_title": null,
      "content": "This has to be one of the best made films of all time. This movie is far better than Lady Vengeance; with all due respect, I don't know what Jackie is saying. Of course Oldboy is dark, sick and disturbing, but that's also what This has to be one of the best made films of all time. This movie is far better than Lady Vengeance; with all due respect, I don't know what Jackie is saying. Of course Oldboy is dark, sick and disturbing, but that's also what makes the film so original . The director does a good job to get people to think about what the outcome will be without losing momentum .",
      "review_date": "2007-09-28"
    },
    {
      "review_title": null,
      "content": "One of the best ever....holllywood can dream about a movie like this.",
      "review_date": "2006-12-21"
    },
    {
      "review_title": null,
      "content": "A perfect film. No film that I've ever seen has been able to balance a great script with superb directing, flawless acting and a hauntingly beautiful soundtrack. Oldboy ticks all the boxes for me and is truly a masterpiece. Park Chan-wook hasA perfect film. No film that I've ever seen has been able to balance a great script with superb directing, flawless acting and a hauntingly beautiful soundtrack. Oldboy ticks all the boxes for me and is truly a masterpiece. Park Chan-wook has proved to be a modern master film-maker.",
      "review_date": "2011-08-15"
    },
    {
      "review_title": null,
      "content": "Korean film about a man imprisoned for 15 years without really knowing why.He is released then looks for revenge.Stylish, slick, gruesome & some fantastic twists & turns.\nI'd heard a lot about this film & it really is as good as peopleKorean film about a man imprisoned for 15 years without really knowing why.He is released then looks for revenge.Stylish, slick, gruesome & some fantastic twists & turns.I'd heard a lot about this film & it really is as good as people say.Min-Sik Choi is brilliantly intense as the lead with a good supporting cast as well.",
      "review_date": "2010-09-13"
    },
    {
      "review_title": null,
      "content": "I'm typically not a big fan of the \"Asian-Extreme\" genre that seems to be blowing up these days overseas, but \"Oldboy\" has a philosophical hinge to it that keeps its storytelling from flying out of control to pure exploitation. StrangelyI'm typically not a big fan of the \"Asian-Extreme\" genre that seems to be blowing up these days overseas, but \"Oldboy\" has a philosophical hinge to it that keeps its storytelling from flying out of control to pure exploitation. Strangely enough, the movie has the pacing and feel of a Hitchcock film, but the violence and over-the-top twist brings a whole new perspective to the genre.",
      "review_date": "2010-08-27"
    },
    {
      "review_title": null,
      "content": "This is by far the BEST foreign movie i've ever seen, and one of the first times i agree with the majority of critics. 'Oldboy' was a lot better than the other two movies in the vengeance trilogy, both of which i found terribly dull inThis is by far the BEST foreign movie i've ever seen, and one of the first times i agree with the majority of critics. 'Oldboy' was a lot better than the other two movies in the vengeance trilogy, both of which i found terribly dull in comparison. i really liked the whole movie but i felt that the twist at the end was really well done and was the factor that made this film so much better than others.",
      "review_date": "2010-10-02"
    },
    {
      "review_title": null,
      "content": "A spectacular revenge movie that has intense action and a devastating emotional impact. Creatively directed and brilliantly written, Oldboy begins with an intriguing premise and builds on it in an unexpected way, culminating in a powerful andA spectacular revenge movie that has intense action and a devastating emotional impact. Creatively directed and brilliantly written, Oldboy begins with an intriguing premise and builds on it in an unexpected way, culminating in a powerful and affecting conclusion.",
      "review_date": "2011-09-23"
    },
    {
      "review_title": null,
      "content": "One of my favourite Korean films and a good introductory film in to the darker realms of South Korea's movie catalogued. This is a compelling revenge story littered with over the top action, comedy and twists. Of the trilogy that it is partOne of my favourite Korean films and a good introductory film in to the darker realms of South Korea's movie catalogued. This is a compelling revenge story littered with over the top action, comedy and twists. Of the trilogy that it is part of this one stands out the most for me because of the hammer profile fight scene. First time I saw that I was blown away and had to re-watch it.  Of course, this film is not for the faint of heart and even though most of the guys in college that I showed the film to were pretty desensitized to this kind of violence, I had a girlfriend cover her eyes multiple times. It gets gruesome but never too ridiculous ala some Takashi Miike films. Oldboy is a classic and the visual style and imagination of the film keep bringing me back every so often to share it with those who aren't familiar with films outside American borders.",
      "review_date": "2011-05-17"
    },
    {
      "review_title": null,
      "content": "This film starts off slow, really got into it though. Full of mystery and thrills. Not sure on the ending, think it could of been alot better then what they went for. Worth a watch though.",
      "review_date": "2011-07-10"
    },
    {
      "review_title": null,
      "content": "This adrenaline pumping film leaves you pined to your seat. As the plot twists and unravels, so will you. You can't take your eyes off of the screen.",
      "review_date": "2011-11-27"
    },
    {
      "review_title": null,
      "content": "It's good but not as good as people make it out to be. Yeah the violence is pretty good and the twist is fascinating none the less. But at times I felt nothing for the main protagonist. It`s hard to care about him because there's really noIt's good but not as good as people make it out to be. Yeah the violence is pretty good and the twist is fascinating none the less. But at times I felt nothing for the main protagonist. It`s hard to care about him because there's really no info on the guy. And the room he stayed for 15 years is just so crazy and bizarre that it's hard to take the movie serious.",
      "review_date": "2012-02-04"
    },
    {
      "review_title": null,
      "content": "74 Critic Reviews score? on of them gave it a score of 10?! ha ha hathis movie is a reason why movies are art,now with all hollywood you can rarely say that.if you like a strange,good story and one of the best fights in cinema then watch74 Critic Reviews score? on of them gave it a score of 10?! ha ha hathis movie is a reason why movies are art,now with all hollywood you can rarely say that.if you like a strange,good story and one of the best fights in cinema then watch this movie.it should be a must watch film for all american directors to learn how you make and film fight scenes,no fast, cut scenes etc.incredible movie",
      "review_date": "2011-12-29"
    },
    {
      "review_title": null,
      "content": "Hollywood are so far behind places like Korea at the min its shocking. What with Oldboy,man from nowhere,Host and the good the bad and the weird Korean films are on a roll. Oldboy is a little odd at first but  is truly a modern masterpiece.Hollywood are so far behind places like Korea at the min its shocking. What with Oldboy,man from nowhere,Host and the good the bad and the weird Korean films are on a roll. Oldboy is a little odd at first but  is truly a modern masterpiece. The acting is amazing and so is the atmosphere. You owe it to yourself to watch this film. the only reason its not a 10 is the blu ray release. its not true HD but other than that perfect",
      "review_date": "2012-03-04"
    },
    {
      "review_title": null,
      "content": "possibly the best film ever made !., it is the raw characterization tat has to be applauded. A film tat boldly ventures on understanding the very equilibrium of a human mind between sane and insanity . u end up feeling sympathetic to all thepossibly the best film ever made !., it is the raw characterization tat has to be applauded. A film tat boldly ventures on understanding the very equilibrium of a human mind between sane and insanity . u end up feeling sympathetic to all the characters my the end of the movie .",
      "review_date": "2011-12-23"
    },
    {
      "review_title": null,
      "content": "Thrilling, violent, and unpredictable, Oldboy was a joy to watch. There was never a dull moment. The acting was fantastic and the violence was engaging. Be warned: this movie is not for the faint at heart.",
      "review_date": "2013-02-27"
    },
    {
      "review_title": null,
      "content": "Quite possibly one of the most imaginatively shot, brilliantly conceived and amazingly paced revenge thrillers of the past quarter century.  In fact, if I were forced to list my favorite movies period to be made since my birth in 1980, thisQuite possibly one of the most imaginatively shot, brilliantly conceived and amazingly paced revenge thrillers of the past quarter century.  In fact, if I were forced to list my favorite movies period to be made since my birth in 1980, this would most definitely be near, if not AT the top of that list. Park has very quickly, in my mind (ever since my exposure to his Joint Security Area) skyrocketed to the top two or three directors of the generation.  He not only can tell a story, perfectly balancing the surreal and aesthetic qualities that make cinema interesting, not only can he present those concepts in such a way as to allow the viewer to suspend disbelief and become personally invested in the overall arc, but he can do so without throwing his intellect out the door as many directors are wont to do in the interest of making something flashy to hold their viewers interest.Now that seems like very high praise in a general sense toward the director, and it is, and yet this film and the films preceding and succeeding it in his roster move a step further into something wholly visceral, tragic and unimaginably investing.  This film in particular, is quite possibly the only film to have been made in the last decade that I would actually be perfectly comfortable placing the name \"Shakespearean\" to.  The tragedy of this film, Mr Vengeance and Lady Vengeance are such that if this director, and for that matter the actors, and crew who put themselves into this film aren't remembered along with the likes of Aronofsky, Goddard, Welles and the like it would be a true miscarriage of justice.  I would recommend any person with a love of tragedy, action, mystery or just a love of cinema in general seek out this film, I've watched this from beginning to end at the very least two dozen times (not including the playthroughs I've done with the commentaries on the Tartan \"Asia Extreme\" boxed set I own), and I've yet to become tired of it.  One of the great classics of our age,  if not all time in cinema.",
      "review_date": "2012-05-17"
    },
    {
      "review_title": null,
      "content": "Oldboy at its most basic is a revenge story, this film is however much more complex than that. It is a barrage on the viewers senses. Visually stunning as well as emotionally visceral. On the surface the narrative is very straightforward, butOldboy at its most basic is a revenge story, this film is however much more complex than that. It is a barrage on the viewers senses. Visually stunning as well as emotionally visceral. On the surface the narrative is very straightforward, but little is as it seems throughout the entire film up till the last few minutes. Not for the weak of heart Oldboy has some of the most violent sequences that I have witnessed.\r Oldboy does many things extremely well. From the opening sequence we are treated to a score that adds much to the film. Having a great score but knowing how to properly use it so as to not allow it to overwhelm the film is not an easy task. Park does it perfectly in Oldboy. Park also uses the split screen masterfully in this movie. This is another device that I have seen used to the detriment of a movie, not so here. Park is an artist with the camera. One sequence in particular stands out for me. The main character comes to a location that is familiar to him and important to a memory that he is trying to recall. As he recalls this memory he chases the memory of his younger self through the sequence. It is beautifully shot, we never lose our sense of time or place as can easily happen in such a scene.\r The visuals and score are not the only positives in Oldboy. The narrative is gripping and tense. Our protagonist is on a mission of revenge for what has been done to him. We are along for the journey every step of the way. We feel every emotion that he is feeling as his story progresses. We feel his fear, torment, and hatred. Like all good revenge stories as he begins to reek his havoc we wonder at what cost it is coming. Are his motives pure, and even of they are is it worth the price it is costing his soul. Oldboy handles these themes masterfully.\r I have two issues with this film. The first is I was never completely on board with the character of Mi-do. It is not a spoiler to say that we learn very early on that she has had a very similar experience to the protagonist. Despite this fact we are given she always seems to be much more aware than he is. He spends the film unraveling a mystery, she appears to understand most of what is happening but is just relying on him for protection from it. My second issue is the ending. While much is revealed in the last third and there are some very well done intense scenes, the last five minutes lacks the punch that a film like this needs.\r Oldboy is an amazingly directed film that is well worth your time. While you may not wish to revisit this world, you will be happy that you took the journey.",
      "review_date": "2013-03-27"
    },
    {
      "review_title": null,
      "content": "I loved this movie.  The realism in this movie was really good.  I love that they didn't go in the direction of Oh Dai-Su training himself into some kind of martial arts master during his imprisonment but that he became more of a raw brawler.I loved this movie.  The realism in this movie was really good.  I love that they didn't go in the direction of Oh Dai-Su training himself into some kind of martial arts master during his imprisonment but that he became more of a raw brawler.  Excellent acting, cinematography, and musical score.  The story itself is a bit of twisted genius.  There is a point in the movie where it seems like it is getting too long but keep on watching, the ending is well worth it.  Highly recommend!",
      "review_date": "2012-06-01"
    },
    {
      "review_title": null,
      "content": "Chan Wook Park directs this violent revenge film with style. The fight sequences are the best because they",
      "review_date": "2012-07-09"
    },
    {
      "review_title": null,
      "content": "Visually beautiful and creepy. Filled with twists and amazingly entertaining violence you just can't help but to love Oldboy. In fact, Oldboy even managed to get me to laugh a couple times and not because it was bad because it was supposedVisually beautiful and creepy. Filled with twists and amazingly entertaining violence you just can't help but to love Oldboy. In fact, Oldboy even managed to get me to laugh a couple times and not because it was bad because it was supposed to. It's a Tarantinoesque Korean film that I would recommend to anyone! It's very interesting and engaging purely a must see so long as you can deal with violence.",
      "review_date": "2013-01-28"
    },
    {
      "review_title": null,
      "content": "A great movie, I don't know what the remake can add\rYes it could have been better made but anyway a great love-drama-thriller that makes you question yourself\rNot everyone will be satisfied or even accept it's plot resolve;\r\nAt the endA great movie, I don't know what the remake can add\rYes it could have been better made but anyway a great love-drama-thriller that makes you question yourself\rNot everyone will be satisfied or even accept it's plot resolve;\rAt the end you're rewarded with a remarkable soundtrack ",
      "review_date": "2013-11-10"
    },
    {
      "review_title": null,
      "content": "Oldboy is often cited as a masterpiece direct from South Korea. For me, it simply was not my thing. The violence was not too much for me, as is often the case. Though excessive in spots, Oldboy simply falls out of my range of enjoyment. As itOldboy is often cited as a masterpiece direct from South Korea. For me, it simply was not my thing. The violence was not too much for me, as is often the case. Though excessive in spots, Oldboy simply falls out of my range of enjoyment. As it stands, it is an entertaining ride with a disappointing conclusion that really lets the air of Park-Chan Wook's claustrophobic thriller.\r Shot in a way that makes the viewer feel entriely claustrophobic alongside Oh Dae-Su (Choi Min-Sik), the film really does a great job capturing his anguish, loneliness, and torment, as he is locked up for 15 years for reasons unknown to him. The film's thrills continue as he meets the far too trusting Mi-do (Kang Hye-jung) and the mysterious Lee Woo-jin (Yoo Ji-tae), who is the reason he is locked up in the first place.\r The fim's willingness to dive into shocking violence is a problem, namely the tongue sequence. It makes sense, but no thank you. Other than that, the acting is well shot and well choreographed, especially when Oh Dae-su fights the men in the compound. A masterfully shot sequence, it almost made me a believer. That scene in particular is not just well shot, but Chan-wook Park does a terrific job creating tension and thrills in that scene, as well as the rest of the way.\r This is about where the noticeable positives stop for me, personally. My list of complaints is admittedly longer. Firstly, the beginning. Maybe I am dumb, but I barely realized it was the same guy at the beginning. I got what they were trying to do, but the beginning sequence of Oh Dae-su being very drunk and then winding up in this prison for 15 years was horrifically executed. It was incoherent and made no sense while watching it. I obviously figured out that was what happened at some point, but the film made no attempt to make it a coherent transition. Instead, it showed a drunk guy and then a guy locked up asking why he is being held with very little connection.\r Additionally, the biggest complaint is the end. Oh Dae-su is held for 15 years because he saw Lee Joo-win have sex with his sister and then he told his friend who spread the news around the school. The sister killed herself as a result (oh wait, excuse me, she was dropped). That is why this happened. Even worse, Chan-wook Park then decided it would be fun if the film became absolute nonsense by having Oh Dae-su have sex with Mi-do who is his daughter. Brilliant twist really. How did he wind up doing this, you ask? Oh well Lee Joo-win, in his endless quest to get payback for his dead sister, had a woman hypnotize the two of them to put them in situations where they will fall in love. This is not a problem with coherence. I understood it. However, these explanations were less than satisfying. I was already torn on whether or not the overall tone and feel were up my alley, but the ending convinced me that Oldboy was simply not my thing. For me, the ending was not just unsatisfying, but outright dumb.\r I get that everyone else loves Oldboy. That is fine. I did not hate it. I just would be hard pressed to say I like it. That said, the overwhelming praise will lead to me watching this one again later on. Though, it may be a while since it took me a while to watch it once to begin with since I was convinced it would not be my thing. Now that I have watched it, it seems that my initial impressions were correct. Though I loved the way it was shot and the action in the film is terrific, the incoherent beginning and awful conclusion is a major buzzkill. Sorry.",
      "review_date": "2016-09-12"
    },
    {
      "review_title": null,
      "content": "\"Oldboy\" is a mind-bending revenge tale that ventures into the emotional extremes, and there is no chance of emerging unscathed. Full of grand passions, bloodthirsty violence, with a wicked sense of jet black humor, \"Oldboy\" is a sadistic\"Oldboy\" is a mind-bending revenge tale that ventures into the emotional extremes, and there is no chance of emerging unscathed. Full of grand passions, bloodthirsty violence, with a wicked sense of jet black humor, \"Oldboy\" is a sadistic masterpiece. The director, Park Chan-wook, is one among several filmmakers who've made South Korean cinema what it is today, and requires a viewing at least once by serious moviegoers.\r The plot is utterly unique: Seoul businessman Dae-su Oh (Min-sik Choi), is kidnapped one rainy evening by parties unknown. He awakens in a seedy motel room  complete with hideously tacky wallpaper, threadbare carpet, a double bed, and a television  but in reality, it serves as a cell. Days, months, and years go by with no explanation given for his incarceration. A daily meal comes through a tiny slot in the door, and every so often sleeping gas seeps in as well. From the television in his room, he learns that he is the prime suspect for the murder of his wife  and now, even if he escapes, he's a wanted man.\r Fifteen years later, Dae-su awakes one day on a grass-covered roof of a downtown building in Seoul, outfitted with a finely tailored suit, a cell phone, and a wallet stuffed with cash. Before Dae-su can begin a new life, he must answer several key questions about his imprisonment. Only after he has these answers can he exact his revenge and turn the page. Meanwhile, his captor decides to turn Dae-su's quest for answers into a cruel, exhausting game that will push him to his limits. Additionally, he has just five days to not to only find out why he was held captive, but to also identify his tormentor, and seek his revenge.\r The committed performance by Min-sik Choi strikes a genuinely tragic note amid the mayhem and cartoonish excesses of violence. He does a marvelous job walking on the edge of insanity, while retaining likability and compassion from the audience. Superlative acting across the board, and a pulsating score to compliment the arresting imagery, while the true astuteness of the script will reward only on further viewings.\r \"Oldboy\" has a wild, twisty storyline on such an epic scale emotionally, and it rarely slows down to consider the logic of some of its most outrageous plot contortions. The revelation in the third act is a bit of a letdown considering the thrilling, ambitious set up. Cinematic in the extreme, the movie has an emotional core that will leave some viewers stunned, yet others disgusted. As tough as it is to endure  it is brutal, yet brilliant  and it is undoubtedly a work of art.\r \"Oldboy\" is the second installment of The Vengeance Trilogy, directed by Park Chan-wook, preceded by \"Sympathy for Mr. Vengeance\" (2002) and followed by \"Lady Vengeance\" (2005).",
      "review_date": "2013-10-06"
    },
    {
      "review_title": null,
      "content": "Oldboy is a sick and twisted revenge thriller with shocks and twists through the entire movie. Hands down the best ending in movie history. A well done movie, a must see.",
      "review_date": "2014-04-12"
    },
    {
      "review_title": null,
      "content": "This second installment in Park's \"vengeance trilogy\" is also the most popular and it's easy to see why. With an interesting story, intriguing characters, great acting performances, well made action sequences and a shocking ending, OldboyThis second installment in Park's \"vengeance trilogy\" is also the most popular and it's easy to see why. With an interesting story, intriguing characters, great acting performances, well made action sequences and a shocking ending, Oldboy deserves the title of a classic",
      "review_date": "2019-02-20"
    },
    {
      "review_title": null,
      "content": "Mind-blowing film. Lee Woo-jin is one of my favourite movie villains ever, he's the perfect combination of genius and crazy and the way his story is told was brilliant. The story is disturbing but if you expect that going in to watch thenMind-blowing film. Lee Woo-jin is one of my favourite movie villains ever, he's the perfect combination of genius and crazy and the way his story is told was brilliant. The story is disturbing but if you expect that going in to watch then you'll likely enjoy yourself, but if not that you will definitely appreciate the film for the masterpiece it is.",
      "review_date": "2014-06-04"
    },
    {
      "review_title": null,
      "content": "Overall an exciting indie film. The directing was especially accomplished. I thought that one of the major plot \"twists\" was too predictable though, which detracted, I thought, from the overall quality of the film.",
      "review_date": "2014-07-03"
    },
    {
      "review_title": null,
      "content": "All I can say is wow. If you like revenge movies, Oldboy is one of the most complex and visceral ones I've ever seen. Not complex in that it's hard to follow; it's very dense and has a lot of layers to the story. It's on Netflix if you're interested.",
      "review_date": "2015-05-09"
    },
    {
      "review_title": null,
      "content": "And I have wasted two hours on this?! The prison years part is good but everything else is so terrible and meaningless that I was dissapointed to disgust.",
      "review_date": "2019-07-02"
    },
    {
      "review_title": null,
      "content": "The torture porn flick i expected Saw to be. Sadly, it has less plot, cohesion, and balls than Ichi the Killer. The animal cruelty scene was a snuff masterpiece, though.",
      "review_date": "2015-04-01"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis movie has a very dark atmosphere which I enjoy a lot. A don't usually enjoy movies and get bored quickly if nothing intrigues me. The movie could make me sit for two hours straight wanting to know the reason why the abducted was locked for 15 years, which disappointed me.The movie tried hard to make you empathize with the abductor which does not make sense: He is a sick incest rapist who had was in love with his sister. The abducted accidentally watched them together while doing it and he just said what he saw. It's not his fault the psycho sister killed herself, she would do it anyway because it is a sick relationship.For the abducted to have his wife killed, locked for 15 years and hypnotized into having sex with his own daughter is too much. If I were him, I would just kill that bastard by beating him hard, pulling out his teeth and throwing him from the window instead of barking like a dog and cut my tongue.The movie surpasses the manga in every way so this is also a positive point for the movie.",
      "review_date": "2020-06-24"
    },
    {
      "review_title": null,
      "content": "I don't quite understand the super negative reviews, but I couldn't in all conscience give Old Boy a 10.  It is an awesome movie.  The whole getting kidnapped and imprisoned for 15 years and coming out as a bad ass was great.  TheI don't quite understand the super negative reviews, but I couldn't in all conscience give Old Boy a 10.  It is an awesome movie.  The whole getting kidnapped and imprisoned for 15 years and coming out as a bad ass was great.  The cinematography awesome.  The fight scenes, most realistic I've ever seen in a movie.  My only real problem, the ending...\rEverything from Dae Su banging his daughter, to Woo Jin's long drawn out explanation of why, to the stupid reason why, to the hypnosis subplot, just killed the ending for me.\rStill all in all a solid movie.",
      "review_date": "2015-08-25"
    },
    {
      "review_title": null,
      "content": "Oldboy, Chan-wook Park's best movie to date, won the Grand Prize of the Jury in Cannes Film Festival (and it was also nominated for Palme d' Or), as well as the best film and best Screenplay awards in Fantasporto (the most serious fantasyOldboy, Chan-wook Park's best movie to date, won the Grand Prize of the Jury in Cannes Film Festival (and it was also nominated for Palme d' Or), as well as the best film and best Screenplay awards in Fantasporto (the most serious fantasy festival).\rAs probably everyone knows Chan-wook Park's obsession is the theme of revenge. Old boy is the second movie of his revenge trilogy (Sympathy for Mr. Vengeance - 2002, Oldboy and Sympathy for Lady Vengeance - 2005). Oldboy is by far the best movie of the trilogy and one of the best Asian films of all time. Drama, mystery and thriller are thrown in the film in equal portions, which is humorously violent and brutally funny. If you have no idea about the excellent South Korean (or Japanese) modern cinema this is a good movie to start exploring them.",
      "review_date": "2015-12-08"
    },
    {
      "review_title": null,
      "content": "Asian movie of revenge with some tone of sadomasochism and high, gruesome doses of violence, altough some sequences fells slow. Maybe not suitable for weak stomachs.",
      "review_date": "2017-05-06"
    },
    {
      "review_title": null,
      "content": "A manga from East Asia is suitable for a great adaptation by Korea which is also from East Asia, but Oldboy has a great visual and outstanding story of being trapped and being free to investigate. The scene when Dae-su fights over 10 men in aA manga from East Asia is suitable for a great adaptation by Korea which is also from East Asia, but Oldboy has a great visual and outstanding story of being trapped and being free to investigate. The scene when Dae-su fights over 10 men in a small corridor is one whole shot is memorable. Asian adaptations is much nicer. I rate it a 92/100.",
      "review_date": "2016-10-22"
    },
    {
      "review_title": null,
      "content": "A really enjoyable film. Great cinematography in this story set in South Korea in modern times (The majority of the film plays in the times the film was released). The story is gripping and this film is one of those rare pieces that isA really enjoyable film. Great cinematography in this story set in South Korea in modern times (The majority of the film plays in the times the film was released). The story is gripping and this film is one of those rare pieces that is genuinely able to make me despise the antagonist. The plot relies heavily on subjects such as love and revenge, but in a manner I've not yet seen before. It has some major twists that were shocking. The action / fighting sequences were the only things that were somewhat poorly done, with actors clearly missing each other while still pretending to be hit, but in the end that doesn't make the overall experience any less emotional.",
      "review_date": "2018-03-07"
    },
    {
      "review_title": null,
      "content": "Oldboy will go down in history, whether the critics want it or not. Its meaning is a symbol of a cinema that no longer exists and that has passed to a better life. Movies like this are no longer made.The only \"but\" of this movie is anOldboy will go down in history, whether the critics want it or not. Its meaning is a symbol of a cinema that no longer exists and that has passed to a better life. Movies like this are no longer made.The only \"but\" of this movie is an ending that does not work quite well compared to the whole movie.",
      "review_date": "2018-09-14"
    },
    {
      "review_title": null,
      "content": "Amélie's quirkiness, Tarantino's violence and gore, interesting characters, intriguing plot, profound philosophical questions, and insanely cool action sequences made this gut-wrenching revenge tale the most gripping, entertaining, andAmélie's quirkiness, Tarantino's violence and gore, interesting characters, intriguing plot, profound philosophical questions, and insanely cool action sequences made this gut-wrenching revenge tale the most gripping, entertaining, and enthralling movie of its kind, except it's actually one of a kind!Amid the gruesome scenes, and the brutal fight sequences, Oldboy has a very emotionally devastating story. Chan-wook Park could have easily leaned on nothing but the action and the gore to grab the viewers' attention from the beginning. Instead, he knew that if there is anything that can attract the attention of the audience, and make them invested in the protagonist as fast as possible, it would be a thoughtful moral philosophy mingled with a sentimental story. That's how Chan-wook Park captivated the viewers from the opening scene until he evoked a catharsis in the audience at the traumatic third act.Flawless is a very weak, and unsatisfying word to describe the third act. It's simply look like nothing you've seen before, or even you'll see. With its twist reveal, to the outrageous and shocking visceral images, the third act is provocative, distressful, and utterly maddening. But nothing would have worked in it, and in the entire movie as a whole without Min-sik Choi's kinetic multi-layered performance.The fact that this movie didn't get a single Oscar nod, at least for Min-sik Choi's incredible performance, is as infuriating as the movie itself. For me, Min-sik Choi delivered one of the best performances in the past decade. Yes, I would easily put his performance alongside Adrien Brody's in The Pianist, Leonardo DiCaprio in The Aviator, Daniel Day-Lewis in There Will Be Blood, and Heath Ledger in The Dark Knight. But all that thanks to Chan-wook Park who allowed Min-sik Choi to show all his talent challenging him, and his pathetic, Dae-su Oh.What is truly impressive is how Chan-wook Park put us in Dae-su Oh's shoes by changing the tone, so gracefully, to resemble how the protagonist feels. The movie starts off with flashes of dark humor matching how mazed and lost the character feels. Then, when things become more clearer and clearer the tone becomes darker and darker till the climax when the movie became acutely distressing and dreary.Nevertheless, these tonal changes didn't work very well at the second act. Not because the tonal shift wasn't smooth, nor it came abruptly, but because that was the time when our protagonist, as well as us, discovering clues, and collecting pieces to get the whole picture. The whole act was very convoluted, for better or worse, but the thing is that the pacing was madly rushed resembling Dae-su Oh's confusion and ignorance. Not to mention, there were some sequences where we get to know about some very important characters, and some specifics related to them. Adding insult to injury, some of these details could be passed up, because they are simply not that important. The result is that the movie almost lost me a couple of times. I mean that I really lose track of some small details.Oldeuboi is a very powerful, thought-provoking, and visceral film, and that's because what it implies more than what it depicts. I think it's the first Korean film I watch, and it definitely won't be the last. Just help me with some recommendations, if you wouldn't mind! :)(8.5/10)",
      "review_date": "2018-08-29"
    },
    {
      "review_title": null,
      "content": "As a Korean, I'm so proud of this movie, because most of the Korean movies suck, and that's an undeniable truth. If you think this is gonna be a one-time popcorn movie, that's so wrong. In one way or the other, this movie is gonna change yourAs a Korean, I'm so proud of this movie, because most of the Korean movies suck, and that's an undeniable truth. If you think this is gonna be a one-time popcorn movie, that's so wrong. In one way or the other, this movie is gonna change your whole life as it did to mine.",
      "review_date": "2020-07-11"
    },
    {
      "review_title": null,
      "content": "This movie is not an artistic representation of the strengths of the human heart or a powerful tale of vengeance. It is simply, a revolting perverted nonsensical loathsome piece of flaming dung or revenge porn. I have no idea why Roger EbertThis movie is not an artistic representation of the strengths of the human heart or a powerful tale of vengeance. It is simply, a revolting perverted nonsensical loathsome piece of flaming dung or revenge porn. I have no idea why Roger Ebert loved this movie or why many critics call this one of the best movies of the 2000s. They were probably jacking off to the screams of violence or the sexual moans when giving Oldboy a review. To call it overrated, would be a fatal mistake. This film has no beauty or humanity in it what so ever. It is a soulless abomination spawned from the devil's ass and is an embarrassment to all of cinema.Plus the lead actor was not even acting, he was just mimicking an rage fueled emo teenager with zero character development. Park Chan-wook, you suck big balls when it comes to directing.",
      "review_date": "2018-09-03"
    },
    {
      "review_title": null,
      "content": "This was a pretty wtf movie and i enjoyed  most of it quite a lot.The story is pretty interesting and the plot twists were good but unfortunately some of the acting kinda made me feel super bored and uncaring for the characters.Overall aThis was a pretty wtf movie and i enjoyed  most of it quite a lot.The story is pretty interesting and the plot twists were good but unfortunately some of the acting kinda made me feel super bored and uncaring for the characters.Overall a pretty good movie if you can get pass the acting and ''DRAMATIC'' feeling",
      "review_date": "2020-05-02"
    },
    {
      "review_title": null,
      "content": "I love the main character, the songs and also the direction but I think the plot is fragile in many points... also the behavior of one secondary character (I dont want to spoiler who) is unlikely",
      "review_date": "2019-11-21"
    },
    {
      "review_title": null,
      "content": "Good cinema, but I didn't like the perversely decadent theme. Original and competent (great use of classical music to amplify the emotional effect of violence), but way too over the top. Also, the director had overdone the ambiguity schtickGood cinema, but I didn't like the perversely decadent theme. Original and competent (great use of classical music to amplify the emotional effect of violence), but way too over the top. Also, the director had overdone the ambiguity schtick for the ending.",
      "review_date": "2021-05-02"
    },
    {
      "review_title": null,
      "content": "after the movie, you will surely wonder how it could be possible not to watch this sooner. it is one of the best experiences that a film lover could experience. its worth watching many time for normal and professional viewer. it has so manyafter the movie, you will surely wonder how it could be possible not to watch this sooner. it is one of the best experiences that a film lover could experience. its worth watching many time for normal and professional viewer. it has so many astounding aspects you'll be confused",
      "review_date": "2020-03-23"
    },
    {
      "review_title": null,
      "content": "\"Oldboy\" is quite possibly the most poetic work of art to ever come to cinema.",
      "review_date": "2020-01-05"
    },
    {
      "review_title": null,
      "content": "Don't watch the trailer or ask someone about its story. Just watch it, make predictions about the big question in the movie and when it's revealed... well, just feel bad",
      "review_date": "2021-04-27"
    },
    {
      "review_title": null,
      "content": "one of the greatest films ever made, this should have been the first foreign film to win an oscar not the overrated Parasite, it's a shame Americans can't handle subtitles and had to try and ruin this film with one of the worst remakes everone of the greatest films ever made, this should have been the first foreign film to win an oscar not the overrated Parasite, it's a shame Americans can't handle subtitles and had to try and ruin this film with one of the worst remakes ever made, watch the original it's 10000000000000000000000000000000000000000000000000000 times better.",
      "review_date": "2020-11-13"
    },
    {
      "review_title": null,
      "content": "One of the best movies to come out of South Korea.A wickedly violent tale of recrimination that has plenty of twists and turns to keep you on the edge of your seat.",
      "review_date": "2022-01-21"
    },
    {
      "review_title": null,
      "content": "A Park Chan-Wook masterpiece! Performances, plot twists and soundtrack are incredible. Also camera work and editing are insane.",
      "review_date": "2021-03-17"
    },
    {
      "review_title": null,
      "content": "Brilliant and clever revenge flick with phenomenal performances from an excellent cast. Definitely deserving of a watch.",
      "review_date": "2021-06-30"
    },
    {
      "review_title": null,
      "content": "This movie is disturbing albeit a masterpiece. Performances feel so real and the plot is so intriguing and intense. So many excellent sequences in this movie. A true disturbing masterpiece.",
      "review_date": "2022-05-10"
    }
  ],
  "num_reviews": 131
}