{
  "title": "Once Upon a Time in the West",
  "rating": 8.3,
  "release_date": "2005-09-30",
  "genre": [
    "Western"
  ],
  "summary": "Sergio Leone's monumental epic is as big as its Monument Valley locations, as grand as its fine, distinguished cast, as tough and bawdy as every kid imagines the Old West.  (Paramount)",
  "critic_reviews": [
    "An additional treat is seeing Hollywood good guy Henry Fonda playing one of the nastiest curs in the West. Once Upon a Time in the West is one of the great films in cinema history.  (8/30/2000 Review)",
    "Leone brought back a masterpiece, a film that expands his baroque, cartoonish style into genuine grandeur, weaving dozens of thematic variations and narrative arabesques around a classical western foundation myth.(Review of Original Release)",
    "Sergio Leone's masterpiece. In Once Upon a Time in the West, Leone pulls together all the themes, characterizations, visuals, humor, and musical experiments of the three \"Dollars\" films and comes up with a true epic western. It is a stunning, operatic film of breadth, detail, and stature that deserves to be considered among the greatest westerns ever made.  (Review of Original Release)",
    "Akira Kurosawa once said that Toshiro Mifune could give him in three feet of film the emotion any other actor would take 10 to deliver, but in a single flash of Fonda's electric turquoise orbs, Leone (Kurosawa's first and sincerest flatterer-imitator) managed to say as much about John Ford, the devil, and the corruptions of the Way Out Western world as the genre ever would.",
    "It’s probably unwise to come to Leone looking for too much in the way of feminism. Instead, Once Upon a Time in the West offers quintessential examples of the things he was better known for, including another blustery Ennio Morricone score. Visually, he mostly vacillates between extreme close-ups of intense faces and vast widescreen compositions, a technique that is lurching but also luridly beautiful.",
    "Henry Fonda and Jason Robards relish each screen minute as the heavies, and Charles Bronson plays Clint Eastwood's 'man with no name' role. (Review of Original Release)",
    "Good fun, especially if you like Leone's way of savoring the last morsel of every scene. (Review of Original Release)",
    "The biggest, longest, most expensive Leone Western to date, and, in many ways, the most absurd... Granting the fact that it is quite bad, Once Upon the Time in the West is almost always interesting, wobbling, as it does, between being an epic lampoon and a serious hommage to the men who created the dreams of Leone's childhood.\r\n(Review of Original Release)",
    "Alas, the big screen also magnifies the problems with Once Upon a Time in the West. Specifically, Leone’s insistence on style trumped the need for substance. The film is basically a B-Western stretched an agonizing 165 minutes."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "A poignant masterpiece, everything about this film is amazing. From the uncompromisingly rich musical score, the fine cast, and it's grand cinematography. Stands neck-to-neck with it's predecessor The Good, The Bad, And The Ugly.",
      "review_date": "2009-03-03"
    },
    {
      "review_title": null,
      "content": "An epic to be savored like a fine meal...don't watch this movie if you're in a hurry. Your patience with the slowly building story line is more than rewarded with some of the most compelling and operatic concluding scenes ever put An epic to be savored like a fine meal...don't watch this movie if you're in a hurry. Your patience with the slowly building story line is more than rewarded with some of the most compelling and operatic concluding scenes ever put on film. I think that this has more in common with Lawrence of Arabia than the spaghetti westerns that Leone became famous for. It is a masterpiece. The music is unforgettable, and Fonda and Bronson are perfectly cast, along with all of the supporting actors.",
      "review_date": "2007-07-10"
    },
    {
      "review_title": null,
      "content": "As good as movies -- of any genre -- get.",
      "review_date": "2007-02-24"
    },
    {
      "review_title": null,
      "content": "Sergio Leone's first saga of his ONCE UPON A TIME trilogy after competing THE DOLLARS trilogy. ONCE UPON A TIME IN THE WEST is as good as his classic Spagetti Western predecessors if it is not better. Mustering three Hollywood toughiesSergio Leone's first saga of his ONCE UPON A TIME trilogy after competing THE DOLLARS trilogy. ONCE UPON A TIME IN THE WEST is as good as his classic Spagetti Western predecessors if it is not better. Mustering three Hollywood toughies Bronson, Fonda and Robards, the film evidently echoes the pattern of THE GOOD, THE BAD AND THE UGLY (1966, 8/10), although Bronson is a perfect specimen embodies both the Ugly and the Good, and for the first time Sergio deploys a woman, the Mediterranean beauty Cardinale to be a pivot among these three, contrives an interwoven plot with vengeance, duel, murder, vice as well as the righteous side of the Western ideology: masculinity, integrity, fraternity and chivalry.\rcontinue reading my review on my blog: google cinema omnivore, thanks",
      "review_date": "2014-10-05"
    },
    {
      "review_title": null,
      "content": "Although I have not seen all his films, I have yet to see a Sergio Leone film I hate. The movies I have seen of his are visually gorgeous with superb scores and interesting stories and characters. Once Upon a Time in the West is no exception.Although I have not seen all his films, I have yet to see a Sergio Leone film I hate. The movies I have seen of his are visually gorgeous with superb scores and interesting stories and characters. Once Upon a Time in the West is no exception. It is long and slow, but I think the film was deliberately paced like that.Once Upon a Time in the West does take a lot of risks, including improvising the action around the score's moods. This was a risk that paid off. The story is rich and compelling and the dialogue is thought provoking and beautifully written. Leone also proved what a fine director he was by directing so wonderfully on this film.The characters are great and quite complex, and are further advantaged by being wonderfully portrayed. There is the brutish gunfighter, the beautiful widow, the mysterious harmonica player and the sympathetic outlaw. Henry Fonda particularly does brilliantly in the role of Frank. The visuals once again are exquisite and quite grandiose in its scope and beauty, while Ennio Morricone's wonderfully operatic-like score fully justifies why he is considered one of the all-time great film composers.All in all, a big and bold western and one unlike any other. It also took risks, ones which could have gone horribly wrong but due to the evident work and care of all involved, they paid off. 10/10 Bethany Cox",
      "review_date": "2022-05-04"
    },
    {
      "review_title": null,
      "content": "Leone's best Western (tied with The Good, the Bad and the Ugly) is nothing short of a masterpiece.",
      "review_date": "2019-06-08"
    },
    {
      "review_title": null,
      "content": "instead of talking, he plays..C'era Una Volta Il West\n\nEven though these features are overlong and walks on familiar and usual tracks and characters, what works in it, is the gripping and finely detailed screenplay and amazinginstead of talking, he plays..C'era Una Volta Il WestEven though these features are overlong and walks on familiar and usual tracks and characters, what works in it, is the gripping and finely detailed screenplay and amazing cinematography that brings out its own stunning methodology. Sergio Leone whose features are similarly looking for revenge, never misses on executing its script to perfection and delivers everything that is expected. Charles Bronson; the protagonist, holds on to its part and is well supported by Claudia Cardinale and Henry Fonda (the best thing that can happen to this installment). C'era Una Volta Il West is a character driven plot that has a wafer thin plot, but its sometimes beautiful and also horrific screenplay is what helps him sail off this boat for around 164 minutes.",
      "review_date": "2018-02-26"
    },
    {
      "review_title": null,
      "content": "If Claudia Cardinale had not been in this, it would have been unwatchable. I know it's supposed to be a tribute to the American Western but it often seemed like a parody of the \"spaghetti Western.\" People stared silently at each other If Claudia Cardinale had not been in this, it would have been unwatchable. I know it's supposed to be a tribute to the American Western but it often seemed like a parody of the \"spaghetti Western.\" People stared silently at each other so often I started laughing each time it happened. If you don't like Westerns, stay away!",
      "review_date": "2009-05-02"
    },
    {
      "review_title": null,
      "content": "I read a quote by Sergio Leone where he said \"you only need 3 great scenes in a movie, and no bad ones\" or something to that affect, and he did that brilliantly with the dollars trilogy, but here it felt like he was trying to make everyI read a quote by Sergio Leone where he said \"you only need 3 great scenes in a movie, and no bad ones\" or something to that affect, and he did that brilliantly with the dollars trilogy, but here it felt like he was trying to make every single scene in the movie a great one, and while there are quite a few, most of them are drawn out when they shouldn't be and eventually make the movie a chore to watch. Just wish he would've taken his own advice.",
      "review_date": "2014-12-28"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBottom line: I've always thought I hated westerns and its because of movies like Once Upon A Time in the West.\r.5/4\r Once Upon A Time in the West opens to a quiet dusty train station. An old, wiry, prospector type man (really, he is a caricature) is held up by three intimidating, quiet men. The three men are waiting for the next train to arrive. After several minutes of standing and waiting and sitting and waiting, the train arrives. Charles Bronson (we come to know him as Harmonica) stands alone with a bag in one hand. He drops it, pulls out a gun and kills the three men. Now before I get much further, let me start with my first gripe about this movie: the art direction.\r It's like Leone said,\" Alright, we are going to make this a Western Epic!\" The movie is overflowing with landscape shots of \"The West\": covered wagons going into the distance flanked by mesas, stagecoaches, bustling \"wild west towns\". It is like the art director pulled out the Wild West Catalog and said,\" I want two of everything! We need children’s toys? Wooden railroad stations and widdled horses. Oh, and don't forget dusters which can be the gang uniform.\" It's like walking into a Cracker Barrel. There is something to be said about creating a fully fleshed out world but let's not get carried away.\r The thing that troubles me the most about this movie is the treatment of women. It has a general, gross, misogynistic vibe that makes me uncomfortable. Then again when is misogyny not gross? I mean just about every line directed towards or about women has a rape-y vibe. This isn't something shockingly new; I was playing the video game Red Dead Redemption and just about every single line, I kid you not, is suggestive of rape. Let me give you some examples from Once Upon A Time in the West:\r Jill McBain comes from New Orleans to live with her new husband and his three children. Before she arrives at the homestead the outlaw, Cheyenne, supposedly murders the family. Cheyenne comes to the widow to explain that he isn’t guilty. At one point she says, \"Why don't you throw me over the table and have your way with me and, better yet, why don't you call your men in too! All I'll need to do it jump in a pot of boiling water and I'll be exactly the same as I was...\" Now, when she said that she would need to jump in a pot of boiling water, I thought she was saying that she could just quickly commit suicide, but no! She was just saying that she would use the water to clean herself. Germs are really the only damage of rape, right? Mental and emotional damage? Meh, that doesn't happen so we can just ignore that.\r At one point Frank, the man who murdered Jill’s husband, kidnaps her. The camera cuts to them lying in bed together. She helps him take off her pink corset while he says,\" You're the type of woman that needs to feel a man's hands...all over you...even if they are the hands that murdered your husband. Is there anything you won't do to save your own skin?\" \"No, Frank.\" She kisses him and turns onto her stomach, taking off her blouse in the process. The camera pans away and fades. So how are we supposed to feel about this? The dialog has a weird, problematic, rape-y, sadistic vibe to it.\r We aren't supposed to sympathize with Frank but the camera is, for the most part, positioned from above the bed looking down on her. The dialog and camerawork force us to gaze at Jill. How I am supposed to sympathize with her if she is able to sleep with this guy without hesitation? But wait, there’s more!\r Jill is living alone and the railroad is being built through her land. Before leaving, Cheyenne looks at the railroad workers and says,\" You should go give [the railroad workers] some water. They are tired hardworking men and there's nothing like seeing a beautiful young woman. And if one of them should pat you on the behind, act like nothing happened, they've earned it.\" He pats her on the butt, winks at her, says,\" Just act like nothing happened,\" and leaves. The movie closes with her giving the crowd of men water. Yeah, just go, little lady; let those men objective and grope you because they've earned it! That's how this 175 minute movie ends and it makes me sick. It's as if sexual harassment is endearing with a \"Boys will be boys\" type of attitude.\r I think it goes without saying that I was really disappointed by Once Upon A Time in the West. The extended cut of The Good, The Bad and The Ugly is over three hours long but it doesn't feel like it. The film has the patience to slow down. It is a wonderful way of building tension by contrasting the speed of a gunfight with the desolation of the empty, western landscape. In Once Upon A Time in the West, the extended silence feels like little more than an imitation. If you want to see a good Western, or even a reasonable Western go see one of Leone’s other films.",
      "review_date": "2015-08-31"
    },
    {
      "review_title": null,
      "content": "The spagetti western is an inherently flawed format, but this movie begs to differ, and is a fine example of the possibilities of the genre, rivalled only by The Good The Bad & The Ugly in relevance and breadth of perspective.",
      "review_date": "2006-08-07"
    },
    {
      "review_title": null,
      "content": "The restored re-released version of this film, the only one I've seen, is astounding in its classic western themes, acting, shot-making and story. It holds the viewer's interest throughout its running time of some 2 1/2 hours. The restored re-released version of this film, the only one I've seen, is astounding in its classic western themes, acting, shot-making and story. It holds the viewer's interest throughout its running time of some 2 1/2 hours. It's the ultimate revenge, retribution western. Perhaps the only C. Bronson film where he is the hero.",
      "review_date": "2005-10-01"
    },
    {
      "review_title": null,
      "content": "Sometimes too slow, but always brilliant. Ennio Morricone's score and other sound effects contribute to probably the greatest collaboration ever witnessed in cinema. The brooding revengeful Charles Bronson stalking evil incarnate Henry Sometimes too slow, but always brilliant. Ennio Morricone's score and other sound effects contribute to probably the greatest collaboration ever witnessed in cinema. The brooding revengeful Charles Bronson stalking evil incarnate Henry Fonda in the most effective stylisation of the Western form. Sergio Leone's opera masterpiece will never be bettered.",
      "review_date": "2006-02-15"
    },
    {
      "review_title": null,
      "content": "Family has house & plot of land, authorities want it, hired guns get involved, Mother of family returns, a real good hoe-down.Another one of Sergio Leone's masterpieces & if pushed would say as good as The Good, The Bad & The Ugly. (apartFamily has house & plot of land, authorities want it, hired guns get involved, Mother of family returns, a real good hoe-down.Another one of Sergio Leone's masterpieces & if pushed would say as good as The Good, The Bad & The Ugly. (apart from the showdown at the end, you can't top that!!)The setting & characters are brilliant & then, of course, with the genius of Ennio Morricone's score on top.As with most Leone films there's a lot of Italian/Spanish extras so quite a bit of lip-syncing but the performances by Henry Fonda, Claudia Cardinale, Charles Bronson & especially Jason Robards are magnificent.",
      "review_date": "2010-08-19"
    },
    {
      "review_title": null,
      "content": "I have seen the light. Years ago, I saw two of them Man With the No Name trilogy entries by Sergio Leone and I liked them a lot. But, I did not love them. Once Upon a Time in the West was even going the same way for me until halfway through.I have seen the light. Years ago, I saw two of them Man With the No Name trilogy entries by Sergio Leone and I liked them a lot. But, I did not love them. Once Upon a Time in the West was even going the same way for me until halfway through. Until then, it was a good western, but one with far too many sequences of somebody just staring off into the distance and then looking back, only to look off into the desert again. By the halfway point though, something changed. It clicked. This staring became brilliant. The scenes of action well earned and brilliantly executed. It is a pitch perfect western and was the very embodiment of what the genre is and was capable of becoming. With a terrific score, great acting, and brilliant direction, Once Upon a Time in the West is a tremendous film.A story concocted by Leone, Dario Argento, and Bernardo Bertolucci, will hardly ever turn out poorly and Once Upon a Time in the West shows why. Its story - a man and his family with a land settlement are killed by a ruthless man. His widow is left with the land, which is apparently quite valuable as the railroad is set to come through the acreage and her husband planned on building a town surrounding it, having already purchased the materials. It is the perfect settlement and the criminals of the wild west know the score. In its relatively simplistic plotting, the film is clearly influential on a variety of westerns, such as Robert Altman's McCabe & Mrs. Miller or Clint Eastwood's Pale Rider. Both revisionist westerns, the films show upstart towns with unexpected value. Altman's film shows a frontierman who marries a prostitute (just like in this film), who meets his demise after his town becomes the target of men who wish to control the whole area. Pale Rider has a similar set-up, but with gold under the settlement. A variety of westerns have had this set-up, but both of those feel cut from the same contemplative and methodically paced cloth as Leone's film.Direction-wise, the film is pitch perfect. Terrific staging of each sequence, a largely tight plot, and beautiful imagery adorn this film. For a film so slow and long, it never bores. There is significant power in the random close-ups of the film and it is because of the direction of Leone. The film is engaging due to the varied approach to the gun battles and characterizations in the film, with each sequence having characters hiding in signs or shadows, creating a great sense of mystery and originality each time a man brandishes a gun. Additionally, each character wears their personality on their sleeve. Every drop of this film is precise and included for a reason, even if the film is not dealing with overly complex themes or anything. It is simply a tight, straight forward western that hums along at its own pace. One of the strongest parts of this film, however, is the score from Ennio Morricone. At a certain point, the men all look the same. They are tanned white guys with beards. It is hard to tell them apart. Morricone's score helps. It serves as an introduction to who they are, what to expect from the scene, and it cultivates atmosphere. Numerous scenes ride on the sense of mystery instilled by Morricone's score that keeps the viewer alert to the fact that something is off or that something is about to happen. The score not only serves for dramatic impact and as an extension of the characterization, but it is also quite sonically pleasing with Morricone's classic western chords coming to play throughout the film and really creating the perfect ambiance for this film. There is not a note that goes wrong with every chord and line coming off beautifully and helping to created a full figured beauty of a film.A classic and masterpiece, Once Upon a Time in the West is a film that I should have seen long ago, but I am glad to have encountered it now because I was finally ready to let Leone into my life as the master that he was. Brilliantly scored, directed, and paced, the film may be long, but its preciseness and terrific technical and visual elements sink their hooks into you with ease and never let go until the film ends. Of the 1960s westerns from Leone, this one certainly ranks as the strongest and with great reason. This is a film that soars on its unpredictability and originality, constantly keeping the audience guessing as to how everything will turn out due to both the plotting and staging of the film and its shootouts. This is not just some simple shoot 'em up western. This is a film with violence and shootouts that advance the plot and serve a purpose, which give them significant stakes and power. Once Upon a Time in the West is just so damn good.",
      "review_date": "2017-03-11"
    },
    {
      "review_title": null,
      "content": "A masterfully made, if frustratingly imperfect epic that starts out with some of the best things that filmmaking has to offer, furthers its plot with some elements that represent more of a mixed bag, and finishes with - again - some of theA masterfully made, if frustratingly imperfect epic that starts out with some of the best things that filmmaking has to offer, furthers its plot with some elements that represent more of a mixed bag, and finishes with - again - some of the best things that filmmaking has to offer. It's supremely well-made from a cinematographic standpoint. Every shot feels like the threads of a suit that's been tailor made. It's impeccably scored, featuring a bevy of memorable cues for each noteworthy character. It's got an incredible filmmaker behind its camera, without a shadow of a doubt. But there are some other, rather questionable elements to the film - particularly concerning Claudia Cardinale's character - that don't really age that well, and a plot that wavers into convoluted territory within the second act. Definitely a fantastically made film, with a really strong opening and finish, but one that - for me - also possessed a flawed middle portion.",
      "review_date": "2017-12-05"
    },
    {
      "review_title": null,
      "content": "An epic about the expansion and construction as the frontier pushed toward the pacific, interlined with one man's journey to make someone pay for what he did in the past.\r From the outset, Leone makes it clear that his focus on portrayingAn epic about the expansion and construction as the frontier pushed toward the pacific, interlined with one man's journey to make someone pay for what he did in the past.\r From the outset, Leone makes it clear that his focus on portraying the life and environment of the West would supersede any need to tell the story. His self appointed task of showing all the mundane happenings and goings on of this world is well achieved. A train station is shown where the typical protagonist of a Western, who never has a name, engages himself in a shoot-out while in search for a man named Frank.\r Focus shifts to McBain and his family who owns a land in the middle of nowhere. He is clearly suspicious about something that is going to happen and we are rewarded with what it is almost immediately. During this conflict we are introduced to this Frank that the first man was searching for.\r A woman enters the story right around here who becomes more involved in the plot as the movie progresses, so is another character by the name of Cheyenne. She suddenly finds herself the centre of attention among outlaws and rail-road companies. The treatment of women is summed up quite clearly the way men behave with her. She is initially a woman who is well dressed and of a noble birth by all accounts and if even that could not gain her even the lowest level of respect, nothing could. The latter is the more engaging of any characters in the script, and thank God for his presence.\r As the plot thickens, the mysterious man looks for Frank, Cheyenne seeks to clear his name in an incident involving multiple killings, and Frank helps his partner acquire land in the path of the envisioned rail-road to the pacific. The first two decide to stick around and help Jill with something that would honour the memory of the man who was killed, while Frank does all he can to take the land he needs to build the rail-road.\r Frank asks the man twice who he is, to which he lists the names of some of the men he has killed. It is not enough that Frank should die. He needs to suffer while thinking about why this man wants to kill him. To this purpose he is even saved by this man. And surely enough, when Frank cannot take it any more, he himself goes after the man to find out the reason. At this point we finally learn the secret.\r I felt like the movie lost steam an hour and a half into it and after that it felt like a task just to finish watching it. It was a narrative mess. The Man has every intention to come across as mysterious and awe-inspiring, but I found it frustrating after a while. He seemed to be content with wasting other people's (including the audience) time. I found Cheyenne much more interesting.\r The dialogue was sparse. Only Cheyenne knew how to say things that would make people laugh and keep humoured, which was essential given the length of the movie. The plot develops linearly but Leone decided that it wasn't doing it for him and jumbled up everything. Some plot jumps took place, one of which infuriated me the most. The cinematography captured the bleak landscape of the West. The score was slow paced and introduced tension during the key moments. The set design depicted the life at the frontier with the wooden towns, horse-drawn carriages, sweaty people, all that.\r Considered the greatest of Leone's work, I could not agree in good conscience. The Good, the Bad and the Ugly was a hell of a lot more fun and had engaging characters, even though it had a fraction of the budget for this movie, proving once again that great movies need not be created through extravagance.  Here, the characters seemed bland for the most part. They seemed not to know where they had to move in service to the story and wandered around aimlessly. There was not a single scene that cut it out for me. The only thing that Once did better was portray the daily life and toil of ordinary people in the west.\r The movie failed to make a major impact on my emotions and senses right until the last shoot-out, which speaks for Leone's idea of greatness_ bore people so much that they have to see the timer several times to make sure the movie is headed forward. While it can be argued that the movie depicted the general life in the west quite effectively, I for one feel that story always trumps the need for grand style and an urge to make some kind of a statement. There's no doubt that the setting needs to be strong, but the characters need to be much stronger, which in turn should give way to the plot.",
      "review_date": "2013-12-30"
    },
    {
      "review_title": null,
      "content": "Classic. Only second to Good the Bad and the Ugly as far as westerns go. Anyone who enjoys a good western, in the unlikely event they haven't seen this one, needs to see it.",
      "review_date": "2014-01-30"
    },
    {
      "review_title": null,
      "content": "Por mucho que digan, para mí esta es la MEJOR PELÍCULA de Sergio Leone y de mis western favoritos. Es tan redonda y sublime que creo que la pondría entre las 5 mejores películas western de siempre. Obra Maestra.",
      "review_date": "2018-01-18"
    },
    {
      "review_title": null,
      "content": "The Best One - everything in this movie is soo touch, the soundtrack is great. Claudia had the drama face, Jason relativity good/bad partner, Henry were dangerous, but the better have a name, our pal Charles \"Harmonica\"!",
      "review_date": "2015-03-05"
    },
    {
      "review_title": null,
      "content": "This is an old movie in 1968.This movie is also long 165 minutes.It is worth watching.The plot is complicated for me.You can't go to a bathroom while you are watching.You may miss an important scene.I loved the actors and actress.This is aThis is an old movie in 1968.This movie is also long 165 minutes.It is worth watching.The plot is complicated for me.You can't go to a bathroom while you are watching.You may miss an important scene.I loved the actors and actress.This is a great classic film.",
      "review_date": "2019-10-03"
    },
    {
      "review_title": null,
      "content": "Epic and iconic. A true masterpiece which for me, contains the finest pairing of music and visuals of any movie. Sure, there are many lingering head shots in OUATITW but they too are the finest lingering head shots of any movie!",
      "review_date": "2017-10-26"
    },
    {
      "review_title": null,
      "content": "My second Leone film, and I expected to see another Western masterpiece, with a gorgeous Morricone score, stunning cinematography, and incredible stand off's, stares & shooting scenes, but that is more serious, and not as cool as, than TheMy second Leone film, and I expected to see another Western masterpiece, with a gorgeous Morricone score, stunning cinematography, and incredible stand off's, stares & shooting scenes, but that is more serious, and not as cool as, than The Good, the Bad and the Ugly, and that's almost what I got. But what I didn't expect to see is one of the best, and most profound, contemplative movies ever made!Signifying the end of the Old West, Sergio Leone loaded his near-three-hour sprawling epic with symbols. The symbolism is seen in almost every aspect of the movie; the setting, the costumes, the music, and most importantly, the characters. In fact, each character stand for an iconographic Western role. But Leone did humanize them through his melodrama, and the result is that all the characters became some of the most interesting and compelling characters ever!What amazed me is how rich the plot seems despite its simplicity. And as convoluted as the narrative sounds, the movie never lost me. That's simply because the story is actually pretty simple, but the sophisticated themes and symbolic characters gave it mythic feeling.Aside from its remarkable opening scene, which became one of my all-time favorites, I found the first hour of unbearably tedious! I usually don't mind watching movies with a deliberate pace, but almost the entire first hour gave us nothing but glances of each of the interesting characters that I totally invested in afterwards. The extremely strong, compelling, sympathetic, interesting and memorable characters portrayed by a spectacular charismatic cast definitely made me forget how bored I was during the first act, but also definitely didn't make me forget that I was about to fall asleep a couple of times!(8.5/10)",
      "review_date": "2018-11-04"
    },
    {
      "review_title": null,
      "content": "Excelente despliegue artístico: producción y detalle exquisito, fotografía y banda sonora espectacular, actuaciones sobresalientes. La historia pasa a ser una anécdota, como una serie de recuerdos fotográficos de un sueño que ocurrió en otroExcelente despliegue artístico: producción y detalle exquisito, fotografía y banda sonora espectacular, actuaciones sobresalientes. La historia pasa a ser una anécdota, como una serie de recuerdos fotográficos de un sueño que ocurrió en otro tiempo.Un gran película que todo amante del cine debe ver al menos 2 veces y valorar.",
      "review_date": "2018-09-26"
    },
    {
      "review_title": null,
      "content": "My score 100Metascore / User score 80 / 83Tomatometer / Audience score 98 / 95IMDB 85(90.2)",
      "review_date": "2018-10-02"
    },
    {
      "review_title": null,
      "content": "Anyone writing a long review of this movie is moronic. If you truly get what is Western, you'll be in awe. And if you're not in awe after watching it, you'll know where you stand in your ability to appreciate and understand what is trulyAnyone writing a long review of this movie is moronic. If you truly get what is Western, you'll be in awe. And if you're not in awe after watching it, you'll know where you stand in your ability to appreciate and understand what is truly Western--somewhere between 1 and 9.",
      "review_date": "2018-12-29"
    },
    {
      "review_title": null,
      "content": "I don't know what the f**k is up with these Spaghetti Westerns. They're too good for me. Will we ever get a movie like this in the present day? Too bad that we don't get Westerns like these today. ..Good : I can say \"entire film\" and getI don't know what the f**k is up with these Spaghetti Westerns. They're too good for me. Will we ever get a movie like this in the present day? Too bad that we don't get Westerns like these today. ..Good : I can say \"entire film\" and get away with it, but I won't. The character introductions in this film are some of the best character introductions of all times. Especially those of \"Harmonica\" and Frank. The intros don't have a dialogue or an exposition to introduce them. All the movie does is show you the characters, clearly indicating that they're up to something. One of those characters was played by Charles Bronson and the other by the great Henry Fonda. And, I don't know if this was the first time Fonda played such a character, but I was blown away by seeing him in a role like that. I didn't expect him to be a bad guy when I first saw him. Fonda being cast against type in this movie is perhaps the most mind blowing example of casting against type. And Fonda doesn't even remind me of his \"messiah\" characters at all. The characters are very interesting in their own right - every main character - Jill, Frank, Harmonica and Cheyenne. Harmonica has that mysterious origin similar to Eastwood's character in Dollars films. It's just an exception that Harmonica was not so mysterious but is still a Man with no Name. He resembles a lot to Eastwood's iconic character, but is quite a lot different at the same time. Cheyenne is a sort of a comedic anti hero, who will do some badass things and will also make you laugh. Jill - probably the most complex character of them all. It feels as if she is too selfish and has mood swings quite often, but having watched it many times, it's clearly justifiable by her apparent past. It wasn't selfishness, but sorrow. I won't say her characterization is relatable or so, but it is realistically understandable. Frank sounds like a generic bad guy, but he has a menacing presence. He is calm and focused. That mixed with the amazing performance of Fonda makes him a good villain. Even secondary characters like Morton are memorable. You can feel for him, though he is a c**t. He is a very good supporting character. The story doesn't have much complexity to it. But that doesn't hold the movie down. Leone has shown his ability of visual storytelling once again. There is mystery and there is unfolding of the story. But most of it is told via the scenes, not with exposition. Leone knows how to build suspense. He shows something, he creates the subtlety and then he explodes everything. This works incredibly well in all of his films. That, along with Morricone's epic music takes it to a whole new level of greatness. There is nothing in this movie to be deemed as stupid. Everything, including character dynamics and story unfolding, is incredibly interesting. You won't even feel the time passing due to the great visual storytelling by Sergio Leone. Every actor - Fonda, Bronson, Robard and Cardinale give their best. ..Conclusion : It is one of the greatest films in the genre. It is not your old and typical \"wupikaayaayokaaiyayyy\" kind of Western, but retains the many things of those purely American and goofy Westerns like happy ending and triumph of good over bad and all that. But isn't goofy or slimy. It is intense and can be taken seriously. If you are a fan of Western films, or not, this is a must watch. ..Rating. ..Score : absolute 10/10Grade : golden A+",
      "review_date": "2019-03-24"
    },
    {
      "review_title": null,
      "content": "A film witch talk with video instead of dialogue. The film music works as an character and it can talk with the audience.",
      "review_date": "2019-10-20"
    },
    {
      "review_title": null,
      "content": "The best western ever made. Henry Fonda's turn as a villain for the first time in his career , makes one wonder why he hasn't played the heavy before. His steely blue-eyed stare will tell you everything you need to know without saying a word.The best western ever made. Henry Fonda's turn as a villain for the first time in his career , makes one wonder why he hasn't played the heavy before. His steely blue-eyed stare will tell you everything you need to know without saying a word. Tremendous, epic aand beautiful.",
      "review_date": "2019-12-15"
    },
    {
      "review_title": null,
      "content": "Probably my favourite film of all time.  4 amazing characters, a score that most films can only dream of, an amazing back story and some of the bet cinematography I in this genre.It is hard work for some people sure, but give it chance, itProbably my favourite film of all time.  4 amazing characters, a score that most films can only dream of, an amazing back story and some of the bet cinematography I in this genre.It is hard work for some people sure, but give it chance, it rows on you, the main stars are perfectly cast, Claudia Cardinale is unforgettably beautiful and strong, remember this is a long time ago, Henry Fonda is a brilliant baddy with a steel gaze and nasty aura, Jason Robards very lovable and Charles Bronson, stoic, good-natured and hides his heart well.The ending is sublime, but the build ups to each character are what makes this film, by far the best Western and up there in my top 5 of all time fave films.",
      "review_date": "2020-01-17"
    },
    {
      "review_title": null,
      "content": "Sergio Leone will one day, maybe fifty years from now, replace Mister Wood on every critic's list as the worst movie director of all time. He'll at least make the top ten. At least Wood could make a story interesting, at least one characterSergio Leone will one day, maybe fifty years from now, replace Mister Wood on every critic's list as the worst movie director of all time. He'll at least make the top ten. At least Wood could make a story interesting, at least one character you might care about, and didn't have the gigantic Leone budget. Leone fails on every level. The story is very disjointed. It's mostly just comically unrealistic gunplay, with some guys being able to kill minor characters from great distances, but unable to kill major stars that should be easier. That's nothing new, but the circumstances are quite laughable. The story is just killing after killing, to take land away, and it follows sadist Henry Fonda, and his opponents, Charles Bronson and Jason Robards. Jack Elam appears in what amounts to a cameo. The characters aren't much to like. Bronson makes little jokes like an underdog hero of a Japanese movie, but the plot is so bad, and the characters so unlikable, you don't really care. To be fair, they aren't as unlikable as other spaghetti Westerns, but they don't have any appeal, either. You struggle to watch the film. You won't be able to do in one sitting. You'll have to watch a piece at a time, because you will fall to sleep. What makes the movie a bomb is the use of such outstanding cool music that neither matches or contrasts the situation. It falls flat, and it is a waste of good music.",
      "review_date": "2021-11-05"
    },
    {
      "review_title": null,
      "content": "amazing film that it is fully recommended to watch it several times with family all togeterrrrrrr",
      "review_date": "2021-11-27"
    },
    {
      "review_title": null,
      "content": "Best western ever made and one of the best movies of all time!!! Everything is just perfect,actors,music,story,picture... Opening scene is best in all movie history and Charles Bronson line:You bring two too many...Best line ever!!!Truly masterpiece",
      "review_date": "2022-01-16"
    }
  ],
  "num_reviews": 42
}