{
  "title": "Serenity",
  "rating": 8.3,
  "release_date": "2005-09-30",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Thriller"
  ],
  "summary": "This story of a small band of galactic outcasts 500 years in the future centers around Captain Malcolm Reynolds, a hardened veteran (on the losing side) of a galactic civil war, who now ekes out a living pulling off small crimes and transport-for-hire aboard his ship, Serenity.  (Universal)",
  "critic_reviews": [
    "As challenging as it must have been to pilot Joss Whedon's space opera from the TV junk pile to the big screen, the finished product is a triumph.",
    "If you think the \"Star Wars\" prequels are a disease, then Serenity is the cure.",
    "This is a film that exists because of fans, was written for the fans and yet can be enjoyed by just about anyone willing to have a good time.",
    "Serenity is a trim little picture of epic proportions.",
    "A brash, funny, action-packed bit of sci-fi ecstasy--and a giant raspberry to the execs who let \"Firefly\" fall out of the sky.",
    "Whedon wants to make a Serenity trilogy, and I suspect the actors will grow on me if he does. In this case, familiarity would breed not contempt but comfort.",
    "Serenity is still taut, immersive, and alternately hilarious and heartbreaking, a well-balanced blend of whooping Wild West action and space opera.",
    "It's but a witty, engaging hodgepodge of archetypes and clichés; it retreads not only the TV show's story lines, but also those of every \"Star Trek\" and \"Gunsmoke\" episode. It needed the room of a big screen just to fit all of its influences into a single place.",
    "A highly entertaining piece of genre-blending fun.",
    "No matter what's coming their way, post-apocalyptic doom or gloom, this James Gang of the galaxy is just plain fun to watch.",
    "A sci-fi saga that manages to be at once stirring and screwball, gut-busting and gut-wrenching, and more fun than you had at any bigger-budget movie this past summer.",
    "If you're a novice, this is a plucky introduction to Whedon's world and the most fun sci-fi of the year. If you're a devotee, this is the magnificent return you've been praying for.",
    "Serenity evinces the kind of swashbuckling bonhomie that made so many of us fall in love with the original \"Star Wars\" films, a love that was mightily tested by George Lucas' humorless prequels.",
    "Jaw set but never stiff, he (Fillion) gets both the Whedon wit and the Whedon grandiloquence between cheek and gum, and gives the whole enterprise the heft of a real saga.",
    "Serenity is made of dubious but energetic special effects, breathless velocity, much imagination, some sly verbal wit and a little political satire.",
    "Serenity shows what might have happened if Han Solo had been the focus of the original \"Star Wars\" instead of whiny Jedi wannabe Luke Skywalker.",
    "Although Mal is ostensibly the movie's hero, and River its heroine, Whedon does a good job of giving all onboard their own story arc, their tragedies and triumphs. The cast, to a man (and woman), is solid, although it's the ballet-trained Glau, who gets to mope in high angst and go Zhang Ziyi-crazy in a couple of martial-arts scenes, who steals the show.",
    "The film's strength is compelling character relationships and Whedon's trademark dialogue, a smarter version of the cliched action-movie barrage of wisecrack under fire, only better executed, laden in personality, and enriched with evocative western colloquialisms of a frontier culture.",
    "It features truly monstrous bogeymen in the Reavers, cannibalistic renegades who, legend has it, went to the edge of the universe and were driven mad by the abyss.",
    "Serenity may be short on exposition, but it's smart and fun.",
    "While it's a geek's paradise from scene one, newcomers are likely to feel left out until they get their bearings.  Fortunately, Whedon's characteristic humanity, coupled with the slyest sense of humor in Hollywood, greatly eases the transition.",
    "After witnessing the wearying parliamentary debates among good and bad senators in recent Star Wars episodes, it's a pleasure to watch a sci-fi movie where more than just the spaceships move quickly.",
    "A fast-paced, engaging science fiction adventure tale.",
    "Serenity may not be the next \"Star Wars,\" but it's the best we've seen since the original trilogy, and if Wheedon is planning Serenity trilogy (the door is left open), it would certainly be welcome.",
    "What makes Serenity refreshing is its avoidance of CGI, which gives the pic a much more human dimension; the evident chemistry between the cast; and a humor that doesn't rely simply on flip one-liners.",
    "Though richly allegorical, Serenity also works as a rousing and unabashedly manipulative adventure that never takes itself too seriously.",
    "Scene for scene, Serenity is more engaging and certainly better written and acted than any of Mr. Lucas's recent screen entertainments.",
    "An appealingly low-rent, if not earth-shattering, 26th century \"Star Wars\" with faint glimmers of \"Blade Runner,\" \"Buckaroo Banzai\" and \"The Manchurian Candidate\" for good measure.",
    "Chiwetel Ejiofor (Dirty Pretty Things) is the sinister operative dispatched to retrieve the ship's psychic passenger, who as played by Summer Glau kickboxes better than Maggie Cheung and Zhang Ziyi combined.",
    "I mean Serenity no disrespect when I say it's enjoyably junky.",
    "For folks like me, who missed \"Firefly,\" the short-lived TV show on which the movie's based, watching Serenity is like showing up for a big lecture course at the end of the semester. And yet, after an hour of intense disorientation, the movie's arch sarcasm becomes oddly entertaining.",
    "It's the zippy chatter among the Serenity's wised-up space pirates that gives the film most of its punch, but with only serviceable action sequences and largely cookie-cutter effects, you can still sense the void just outside.",
    "The dialogue, delivered mostly in Southern accents, is intended to be funny and fresh, but much of this Western-influenced sci-fi adventure story feels reheated.",
    "If you can't be original, why not borrow from something no one has seen, like Ben Affleck's last five movies?"
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "What's not to love? An opening scene that changes perspective three times, followed by an extended-take tour through the ship, introducing all the crew members in the process. Like the much-lamented TV show, a labor of love. Buy it, as What's not to love? An opening scene that changes perspective three times, followed by an extended-take tour through the ship, introducing all the crew members in the process. Like the much-lamented TV show, a labor of love. Buy it, as you'll want to see it again and again.",
      "review_date": "2008-06-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best, if not the best sci-fi movies i have seen. A viewer would do himself a huge favor to watch the Firefly series first though, in order to get backstories sorted, etc, as the movie moves very quickly, and can become confusing One of the best, if not the best sci-fi movies i have seen. A viewer would do himself a huge favor to watch the Firefly series first though, in order to get backstories sorted, etc, as the movie moves very quickly, and can become confusing on its own.",
      "review_date": "2009-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It makes you wonder why Star Wars gets so much attention even today, when there are absolutely amazing space-set sci-fi films such as this one around. Then again, Serenity truly is on a plateau of quality all its own. Sensational film.",
      "review_date": "2007-06-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Long live Joss. How can someone not love this movie with the hysterical dialouge and suprise losses. It really helps to watch firefly first though, but not necessary to enjoy the film.",
      "review_date": "2007-08-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I loved Firefly, so I was really excited when I heard that they were going to make a movie, and I wasn't disappointed. Great way to end the story.",
      "review_date": "2008-07-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie.  Great characters, great story, great writing.  This movie was the reason I started watching Firefly and the reason I am an avid Browncoat to this day.",
      "review_date": "2011-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Serenity is a unique movie in the sense that you probably need to have watched Firefly to truly appreciate it. That being said, I have seen the show Firefly so my rating will be dictated by that fact. This is a true sequel to the show andSerenity is a unique movie in the sense that you probably need to have watched Firefly to truly appreciate it. That being said, I have seen the show Firefly so my rating will be dictated by that fact. This is a true sequel to the show and therefore, most of the story and emotion is predicated on the viewer having built up a certain amount of investment to take full effect. There were some minor changes where they altered some of the canon in order to explain things to new viewers and I didn't really care for that much but everything else was perfect. The cast of characters was the same group of beloved and diverse people from the series. The acting was fantastic, the charm was still there, the special effects were obviously improved, and they kept the little things that made fans fall in love with the show years ago. Most importantly, however, they wrapped up the loose ends. This is the conclusion Firefly and the fans deserved.",
      "review_date": "2014-01-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Even if you're not a fan of Whedon, the sharp dialogue, crisp pacing, characterization and genuine heartfelt emotion makes Serenity one of the best films out there this year, and lifts it miles above the sci-fi/action drivel that has Even if you're not a fan of Whedon, the sharp dialogue, crisp pacing, characterization and genuine heartfelt emotion makes Serenity one of the best films out there this year, and lifts it miles above the sci-fi/action drivel that has been released by the studios in the past decade. Sharp, smart, clever and engaging, Serenity is a must see!",
      "review_date": "2005-09-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this was an amazing movie that captured the essentials of the television show (also great), but also gave new viewers the chance to see why the characters are so memorable and heart warming.",
      "review_date": "2008-09-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Simply amazing. I do suggest watching Firefly first for the full impact, however.",
      "review_date": "2009-08-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Top drawer. Answers questions raised in Firefly, yet is totally complete for first-time viewers. Tremendous suspense. Satisfying action. Character driven. I read where 87% of everybody who saw it gave it an \"A\" rating. I too, give it an \"A\" rating.",
      "review_date": "2005-10-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie holds up after repeat viewings. Still can't ever decide when to run to the bathroom if needed. There's nothing I want to miss.",
      "review_date": "2006-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "FIREFLY/Serenity is one of the greatest Sci-Fi shows of our time. Fox really dropped the ball when they aired the episodes at random show times and then canceled the show prematurely.",
      "review_date": "2007-12-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A truly amazing film from a series that was cancelled well before its time.",
      "review_date": "2009-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awesome!",
      "review_date": "2005-09-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "well filmed, great script, and some classy one liners. this sci-fi brings a fresh face to a usually recent boring genre.",
      "review_date": "2007-12-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Perfect characterizations and a thought-provoking story, full of humour, intelligence and great special effects and music. The acting and character interplay and attention to detail added dimension to the space story. Not a fairy-tale story, Perfect characterizations and a thought-provoking story, full of humour, intelligence and great special effects and music. The acting and character interplay and attention to detail added dimension to the space story. Not a fairy-tale story, but a realistic mythos and universe.",
      "review_date": "2007-09-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies of all time. Not only does it include a political theme, it has action and romance (but not ooey-gooey sappy romance, just plain fun romance) and comedy. It does have a lot of violence, so if that isn't your One of my favorite movies of all time. Not only does it include a political theme, it has action and romance (but not ooey-gooey sappy romance, just plain fun romance) and comedy. It does have a lot of violence, so if that isn't your thing you probably won't like it much. Regardless, I'd also recommend the Firefly tv series. It has all the action, romance, comedy, and political statements, but often without quite as much violence.",
      "review_date": "2008-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely brilliant film. One of my favourites of all time. Much better if you've seen the series of course, but not entirely necessary.",
      "review_date": "2009-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best sci-fi films I have ever seen.",
      "review_date": "2008-12-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nProof that dreams can come true. When Firefly was unfairly cancelled by Fox, Browncoats round the world rallied together to try and revive the series. Sadly, another season was off the cards. But Universal Studios saved the day, by picking up a Firefly film, known as Serenity. They took a gamble, picking up a movie based upon a failed TV show. And you know what? I'm glad they took that chance. Sure, it cost the lives of fan favourites Wash and Sheppard Book, with the latter and Inara off Serenity with less screen time, but it doesn't hinder the story. The dialogue still shines, the chemistry between cast members is still there and the film does not dissapoint. The new villain, The Operative, is a brilliant one, masterfully played by (i'm sorry, I can't spell his name for soup) that awesome guy. We get the story rounded off, with answers about River and the Reavers feature more prominently. The crew finally defeat the alliance and Kaylee and Simon finally get it on! Sure, theres some questions left unanswered (until the comic books are released) but nethertheless, this film is for true fans of both Firefly and the Whedonverse. A sequel may seem unlikely, but we can still enjoy this fine film in all its glory. Praise be to the Serenity Crew",
      "review_date": "2011-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Whether or not you're a fan of it's parent TV show Firefly, Serenity makes for a fantastic slice of sci-fi action. The chemistry between the crew members is fantastic, bringing much more humor and warmth than we usually get to see from theseWhether or not you're a fan of it's parent TV show Firefly, Serenity makes for a fantastic slice of sci-fi action. The chemistry between the crew members is fantastic, bringing much more humor and warmth than we usually get to see from these type of movies. The plot is suitably epic and there is a great foil for the heroes in the form of Chiwetel Ejiofor's calm, calculatingly evil assassin. You'd be hard pressed to find a more entertaining or soulful sci-fi movie than Serenity.",
      "review_date": "2012-09-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Serenity is proof that Joss Whedon truly understands the key elements of great, involving filmmaking, that is to say, character, relationships and story. With the addition of impressive special effects and production design, a grand andSerenity is proof that Joss Whedon truly understands the key elements of great, involving filmmaking, that is to say, character, relationships and story. With the addition of impressive special effects and production design, a grand and moving score from David Newman and Whedon's usual flair for snappy almost poetic dialogue, and this sci-fi really stands out from the crowd. Serenity is a fittingly grand and rewarding send-off to Firefly, an exceptional TV series cruelly cancelled before it reached its full potential, and Whedon thankfully wasn't tempted to overcomplicate the plot, keeping it relatively stripped-back and linear, sticking to resolving a couple of dangling plot threads from the series, and always focussed on the characters and their relationships that steadily develop over the course of their journey. It feels like we've never left the space-faring rustbucket, as the technically impressive single-shot opening sequence that guides us through the entire vessel proves - the characters are exactly where we left them, and we as an audience feel ready to be re-acquainted with their various eccentricities. The cast all deliver, with Nathan Fillion upping his performance as a far darker Captain Mal Reynolds than we saw in the TV series, Adam Baldwin's towering but soft-at-heart Jayne still brings the laughs, and Summer Glau's psychic warrior angel River proves to be a real force of nature. The newcomers also impress - Chiwetel Ejiofor is terrifyingly calm and collected as a fanatical nameless assassin, and David Krumholtz's information dealer Mr Universe is a fun character and invaluable ally to the crew of the Serenity. Like the preceding series, Serenity is a film of striking contrasts - science-fiction/western, Eastern culture/Western culture, the darkness of human nature and the eternal optimism in the human heart. As a film it delivers not just in terms of spectacle, but in terms of intelligent ideas and emotional character-driven drama, particularly in the film's stunning final act. This universe of galactic frontiers, settlers, smuggling, adventure and mad space cannibals remains endlessly entertaining, and if this really is the final time we'll see Whedon's beloved creation on-screen, then it has been given a majestic final voyage.",
      "review_date": "2012-10-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I can only say I love this movie. One of my all-time favourites. I wish a sequel was possible. It continued the story, which was tragically and foolishly cut shot, in the TV series, and though it tried to conclude the story.. it just made meI can only say I love this movie. One of my all-time favourites. I wish a sequel was possible. It continued the story, which was tragically and foolishly cut shot, in the TV series, and though it tried to conclude the story.. it just made me want more.",
      "review_date": "2015-07-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It absolutely boggles my mind that someone could actually not like this movie, the reviews I've seen that absolutely bad mouth the film, I'm pretty sure they either never watched Firefly or actually understood it. Serenity was a fantasticIt absolutely boggles my mind that someone could actually not like this movie, the reviews I've seen that absolutely bad mouth the film, I'm pretty sure they either never watched Firefly or actually understood it. Serenity was a fantastic film, the unfortunate cancellation of Firefly left me dead inside, thinking about all the amazing things Joss Whedon must have planned for the show, there must have been A LOT, so fitting a lot of it into a movie to give it a proper finale must have been tough but pulled off brilliantly! A definite must watch, but PLEASE remember to watch Firefly first! I've seen way too many people watch Serenity without watching Firefly first.",
      "review_date": "2012-09-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Thank you Joss, mission accomplished.",
      "review_date": "2005-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Finally, a film which treats viewers as intellegent people... Serenity is what I want to see more of in the cinema. Fast paced, witty, and moving, it shows Sci Fi can have interesting characters and Action movies can make you think.",
      "review_date": "2005-10-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When the user score and the critics score have this big discrepancy, you know the critics really missed something...as in..the mark. This is an EXCELLENT screen production of a superb TV series. Don't miss it.",
      "review_date": "2012-12-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Why this one gets so good review is beyond me. It's really a TV-movie with a si-so plot, barely acceptable acting and generally substandard special effects.",
      "review_date": "2013-01-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Entertaining enough, but a bit of a rip-off of the 80's British sci-fi series Blakes 7. Enough things changed to avoid direct plagiarism, but very, very, very close. Too close.",
      "review_date": "2005-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bag of Shite. I watched this movie with the prospect of seeing something the 3 new star wars films had missed and wtih the glimmer of hope that it would have the freshness of the originals. Oh how i was wrong,mumbling lines, cheesy dialogue, Bag of Shite. I watched this movie with the prospect of seeing something the 3 new star wars films had missed and wtih the glimmer of hope that it would have the freshness of the originals. Oh how i was wrong,mumbling lines, cheesy dialogue, computer game visuals, incredibly loose and dull plot, boring fight sequences adn due to the amount of characters nobody you actually gave a rats ass about. the reavers were so intensely grotesque it seems the director was scared of putting them on camera just a swish of somebody with red paint on their face every now and again. the plot was ludicrous, never explained why the girl was being harboured into whatever, and why anyone would give a rats ass about the fact they watched a video saying the government was corrupt.- tell me something i don't know.",
      "review_date": "2006-07-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awful movie in every aspect you can think of. Fake characters, dumb dialogues, pointless plot, bad CG, mediocre music... I thought having a 9.2 score on MC it couldn't be that bad... but it is. Even worst than the Phantom Menace...",
      "review_date": "2011-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Why do you like this movie? I was bored :(\rMaybe it's the movie, maybe the company... maybe i had a bad day, maybe because i saw it in spanish (my mother language) anyways i didnt like this movie... really.",
      "review_date": "2014-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie was ok by itself but it wasn't true to the characters and the chemistry the characters had in the TV series like for example they were able to do so well with the Star trek series and movies.    It wasn't special effects and actionThe movie was ok by itself but it wasn't true to the characters and the chemistry the characters had in the TV series like for example they were able to do so well with the Star trek series and movies.    It wasn't special effects and action that drew me to the TV series.    In the series for example how Simon clumsily flirted with Kaylee, and in the end the romance blossomed.    I didn't recognize Simon who turned into this alpha-male in the movies.    All of the characters were more cynical, meaner, darker in the movie.    If you were looking for a movie that played homage to the series you will be disappointed.   The movie by itself is OK to watch.",
      "review_date": "2011-10-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you didn't like the TV show - the movie won't be any more enjoyable. Just as painfully trite and witty as you remembered it, with bad effects, weak cinematographjy, weak soundtrack and TV-quality acting. \"Buffy's A-Team in If you didn't like the TV show - the movie won't be any more enjoyable. Just as painfully trite and witty as you remembered it, with bad effects, weak cinematographjy, weak soundtrack and TV-quality acting. \"Buffy's A-Team in Space\" - Could barely make it an hour through until I walked out. I may see the end when it comes on the SciFi channel. Really don't care if I do or not. Comparing this to any real film, sci-fi or not, does terrible injustice to the art of movies.",
      "review_date": "2005-10-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Relative to almost any classic western or sci-fi (eg: High Noon, Alien) this film was a failure. Why is the teen market (at which this is obviously aimed) calculated to be so undiscerning? The story was derivative and muddled, and crucially Relative to almost any classic western or sci-fi (eg: High Noon, Alien) this film was a failure. Why is the teen market (at which this is obviously aimed) calculated to be so undiscerning? The story was derivative and muddled, and crucially lacked tension or suspense. The characters traded constantly in witless banter allegedly funny due to its sarcastic intonation (a peculiar mainstay of much modern American comedy). The direction was sloppy and generic; I often had little idea of what action was taking place due to shaky close-up camerawork and poor choreography. Chiwetel Ejiofor had at least some gravitas to his delivery, but could not rescue a script in desperate need of the bold clarity and dynamism of the old westerns from which its influences are obviously taken.",
      "review_date": "2005-10-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Is this a film for intelligent adults looking for a decent night of escapism and/or entertainment? No. Its a bland, monotonous, stupid, derivative bore. And, to add insult to injury, it is laced with some of the most painfully unfunny Is this a film for intelligent adults looking for a decent night of escapism and/or entertainment? No. Its a bland, monotonous, stupid, derivative bore. And, to add insult to injury, it is laced with some of the most painfully unfunny dialogue yet heard in a cinema. AVOID. (If you're an intelligent adult.)",
      "review_date": "2005-10-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I didn't walk out (though I though about it). The little house on the prairie dialogue and costuming didn't work for me. It was like they were trying to hard to be different by being cliche. Much of the movie felt like a half-life I didn't walk out (though I though about it). The little house on the prairie dialogue and costuming didn't work for me. It was like they were trying to hard to be different by being cliche. Much of the movie felt like a half-life like video game, it made me want to leave the movie and play my x-box. I don't understand what people saw in this movie. Do we have such low standards nowdays?",
      "review_date": "2005-10-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "okay movie. LOL, it got robbed at the box office, only made it to second place with better reviews then the first place movie, FlightPlan! To quote IGN \" serenity got robbed\" HA, how does it feel Joss Whedon? like you robbed millions of dark okay movie. LOL, it got robbed at the box office, only made it to second place with better reviews then the first place movie, FlightPlan! To quote IGN \" serenity got robbed\" HA, how does it feel Joss Whedon? like you robbed millions of dark angel fans, with a show that got cancels mid season. still, okay move. so i kinda forgive ya!",
      "review_date": "2005-10-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good effects and a good effort all round by the crew. Ultimately this film is let down by two things, the story and the acting. Fillion is pretty poor as the lead, all of the supporting characters are much more interesting than him and can Good effects and a good effort all round by the crew. Ultimately this film is let down by two things, the story and the acting. Fillion is pretty poor as the lead, all of the supporting characters are much more interesting than him and can act better really. I noted a comment about Blakes 7 by another user. I think this is what really, really gets me annoyed with Wheedon and this film. So many people say its totally original and has a great story - yes it does, it has the story from Blakes 7. Which is pretty much superior in every way. I am also a little disgruntled to see the \"fans\" giving out scores of 10 and then talking about the series - this is not the series, the series is completely different to this. This is not a great scifi film, it isnt a cult film it is merely average. Watch it and make your own mind up.",
      "review_date": "2009-07-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love firelfy but whedon dropped the ball on this one. the characters were transparent with no background or direction. i feel like i just loaned a friend my favorite toy and he blew it up right in front of me.",
      "review_date": "2005-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The script, the graphics, the logic, the actors.... generally any elements which may contribute to the making of a \"movie\" were lacking in the most dire manner. As a casual viewer, and not having seen this \"Firefly\" series, I can vouch for The script, the graphics, the logic, the actors.... generally any elements which may contribute to the making of a \"movie\" were lacking in the most dire manner. As a casual viewer, and not having seen this \"Firefly\" series, I can vouch for the movie's lackluster composition. It is my opinion, as well as the entire group of twenty academics, this movie will serve as evidence to convince threat nations that the United States consists of mere potato heads not worthy of existence. In reading other reviews I question if critics even viewed the movie, or merely composed an elaborate scheme to entice America into a two hour session of intellectual decay. Instead of gold poured into my eyes as movies have the obligation of performing, I found fiber-glass and mace. ",
      "review_date": "2005-10-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was rubbish and Josh Weedon sucks! Ha, I joke you. It was great. Add a '1' to the '0' - or, better, read Tom C's review, it's fair minded and accurate.",
      "review_date": "2005-09-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An awful movie based on a deservedly cancelled television show, SERENITY starts nowhere and goes nowhere, only looking pretty as it flies without direction. Perhaps an accomplished director (this is Whedon's theatrical debut) An awful movie based on a deservedly cancelled television show, SERENITY starts nowhere and goes nowhere, only looking pretty as it flies without direction. Perhaps an accomplished director (this is Whedon's theatrical debut) might've brought more spark to the film and quite possibly could've seen better through the plot-holes (Whedon also wrote the script, which comes in a few notches better than his ALIEN: RESURRECTION draft), but the film is based on a 'little engine that could' TV show that refuses to accept 'it couldn't.' The film delivers more than a handful of solid laughs, but only fans of the short-lived TV outing will fully comprehend what's going on here.",
      "review_date": "2005-09-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I can't believe all these 10 ratings?!?! This film felt like a B-Movie. The story was ok but the characters were terrible. The 'Mal' character had absolutely no screen presence at all, and I didn",
      "review_date": "2006-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Trashy pulp scfi with zero atmosphere - the viewer ends up thinking \"well that was OK\" But it does romp along enjoyably & undemandingly, plenty of action & whizzy stuff for teenagers. The actors are cardboard cutouts who struggle to make Trashy pulp scfi with zero atmosphere - the viewer ends up thinking \"well that was OK\" But it does romp along enjoyably & undemandingly, plenty of action & whizzy stuff for teenagers. The actors are cardboard cutouts who struggle to make real characters from the script! best thing is the references to star wars, buffy, alien (its almost as if the film sets were borrowed!) worth watching at home with a takaway & a few beers.",
      "review_date": "2009-06-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was the stupidest, pointless, suicidendial, and boring movie I have seen in a LONG time. The whole movie was about trying to save the univerese. Been there, done that, its one of the most used plots out there. Even little kids movies have It was the stupidest, pointless, suicidendial, and boring movie I have seen in a LONG time. The whole movie was about trying to save the univerese. Been there, done that, its one of the most used plots out there. Even little kids movies have that plot. Guys were commiting suicide left and right, and bad corny jokes were scattered thoughout the film. I almost fell asleep, the actors were bad at what they did, they said everything without meaning. The so called good guys killed the innocent, and did almost nothing. The story got nowhere except to have a girl and guy make out. BEWARE OF THIS MOVIE, AVOID.",
      "review_date": "2005-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't see what everyone thought was so great about this movie. I was underwhelmed. Okay, but definitely no 9 or 10... Maybe it's just that I'm not a gamer.",
      "review_date": "2005-12-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I have to agree with Nick on this one. It's, at least for my taste, one of the worst movies I've ever seen. Yes - I liked the first five minutes the most too. To be honest I left the cinema 30 minutes before it was over because I I have to agree with Nick on this one. It's, at least for my taste, one of the worst movies I've ever seen. Yes - I liked the first five minutes the most too. To be honest I left the cinema 30 minutes before it was over because I couldn't take it.",
      "review_date": "2006-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of the most ridiculous movies I have ever seen. The story premise was good, decent plot, but the DIALOGUE made it nearly unwatchable. Grammar errors bordering on the absurd. Cliche's used with such abandon that it was nearly This is one of the most ridiculous movies I have ever seen. The story premise was good, decent plot, but the DIALOGUE made it nearly unwatchable. Grammar errors bordering on the absurd. Cliche's used with such abandon that it was nearly mind numbing. The Operative and River were great characters with halfway decent script but the rest, total B-movie hack jobs.",
      "review_date": "2006-03-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I really don't see what the big deal is with this film. It was completely average in every single way. To compare this film to any of the Star Wars films is an insult. And the so called \"witty banter\" is just utter crap. Their I really don't see what the big deal is with this film. It was completely average in every single way. To compare this film to any of the Star Wars films is an insult. And the so called \"witty banter\" is just utter crap. Their isn't a more average sci-fi film out there.",
      "review_date": "2007-04-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Yes the special effects are really good. But its sooo boring! the acting is bad, and so is the story.",
      "review_date": "2005-12-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I saw this movie shortly after watching the \"Firefly\" series on Netflix.  I absolutely loved \"Firefly\", its premise, writing and characters.  Unfortunately \"Serenity\", which is a sequel of sorts to this series, does not measure up.  The plotI saw this movie shortly after watching the \"Firefly\" series on Netflix.  I absolutely loved \"Firefly\", its premise, writing and characters.  Unfortunately \"Serenity\", which is a sequel of sorts to this series, does not measure up.  The plot of the movie was remarkably predictable whereas the series always had you guessing, the villain was unremarkable and out of place, and the main character acted out of character when compared to the series.  The big reveal felt unremarkable and contrived; I would have been far more interested in finding out about the Institute and its G-Man then about the origins of the Reavers.  The movie also contains many plot threads that seem to go nowhere.\r Sadly the series died when it was canceled and the attempt to revive it was just not successful.  This film feels more like a generic action adventure flick than a continuation of the series.  It is functional but just doesn't measure up to the rest of \"Firefly\".",
      "review_date": "2014-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fun ride, fast pacing, great villan and best of all...great lines. I love this movie and love the TV series.",
      "review_date": "2005-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Simply one of the best Sci-Fi movies I've ever seen. I am trying desperately to get the word out, and so far have taken several people to see the film. All of them have loved it. Whether you saw the original series or not, go see this movie!",
      "review_date": "2005-10-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While it misses the Sino-Western atmosphere of the TV series to some extent, Serenity creates a compelling world and compelling characters to inhabit it. Edge-of-the-seats action, and a wonderful cast.",
      "review_date": "2005-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Rocked from start to finish. Best action movie I've seen this year (better than Batman, which I liked a lot). Great characters, funny dialogue, loads of suspense and did I mention the action?",
      "review_date": "2005-10-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was worried that my friends that have never seen the show wouldn't like this movie. To my surprise, they both enjoyed it. Awsome movie, lets hope for a sequel.",
      "review_date": "2005-09-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great sequel to the greatest TV-series. Finally meet the Reavers and get to know how they became what they are now...",
      "review_date": "2006-10-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Staggering. I had high expectations but they were well on their way to being exceeded by the time the opening credits started. That guy knows how to craft a story.",
      "review_date": "2005-10-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best Sci Fi film in recent memory. Beats Star Wars, beats the Matrix, etc. I'd say its probably the 2nd best film of the year after Batman Begins, but they aren't far apart.",
      "review_date": "2005-10-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best sci-fi i've seen in ages!",
      "review_date": "2005-10-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a great little sci-fi flick that should have received more cred in the box office. By having likable characters, wit, and an engaging story we are reminded why the new Star Wars movies sucked so badly. I was also impressed with the This is a great little sci-fi flick that should have received more cred in the box office. By having likable characters, wit, and an engaging story we are reminded why the new Star Wars movies sucked so badly. I was also impressed with the special effects in this film wich werent overdone or corny at all.",
      "review_date": "2005-12-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Would love to see this as a new series on the SciFi channel.",
      "review_date": "2005-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wow! 'Serenity' is a superb movie. Other scifi writers need to take a lesson from Joss Whedon and 'Serenity'.",
      "review_date": "2005-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I can't believe that this was the best film I've seen all year.. but it was.",
      "review_date": "2005-10-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wow! Just Wow, this is Joss' work at its finest!",
      "review_date": "2005-10-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am a huge fan of the series and currently own it. Serenity is an amazing movie. It knows how to jerk the heartstrings in one moment and cause a laugh in the next. The characters are so easy to relate to and a person really become attached I am a huge fan of the series and currently own it. Serenity is an amazing movie. It knows how to jerk the heartstrings in one moment and cause a laugh in the next. The characters are so easy to relate to and a person really become attached to them. They're REAL people instead of characters from a story. Joss Whedon is an genius when it comes to things like that and I am anticipating the next 2 in the trilogy. I can't wait to see them though I'm not sure I can make it through them since the Serenity itself made me cry. I would and am recommending to everyone to go see this movie and watch the 14 episodes of the tv series.",
      "review_date": "2005-10-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best sci-fi film I've seen for a long while.",
      "review_date": "2005-10-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Won't win an Oscar but it certainly was entertaining. If you enjoy Sci-Fi and action movies don't miss this one.",
      "review_date": "2005-10-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "With one tenth of one percent of the budget of Star Wars Ep. 1 (and it shows), Whedon creates a movie thats 100 times more enjoyable. Nothing that came out this summer was nearly as fun... Do yourself a favor and check it out.",
      "review_date": "2005-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I think this movie's gonna be another sleeper hit, like it's sister show Firefly. I don't think enough people are going to go see this film and enjoy it. I went because I enjoy anything Wedon touches...but some folks just I think this movie's gonna be another sleeper hit, like it's sister show Firefly. I don't think enough people are going to go see this film and enjoy it. I went because I enjoy anything Wedon touches...but some folks just plain HATE him. If you hated Buffy, Angel, or Firefly then you'll hate it! If you're a sci-fi nut, or a Wedon-Worshiper you'll dig it. I thought it was the best film I've seen this year. Miles better than anything I've seen this year.",
      "review_date": "2005-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good plot + good chemistry between actors + unexpected humor + good action = great movie. I thought it was the best show that I have seen this year.",
      "review_date": "2005-10-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "To me, this wasn't as much Firefly as a standalone involving my favourite characters and universe.",
      "review_date": "2005-09-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Now if you see my comment you will wonder what does this guy have to say well i wont tell what serinity is like but i will say these 3 words GO SEE SERENITY!!!!!",
      "review_date": "2005-09-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While the opening jumped about perhaps a bit quickly for someone who hasn't seen the television show, if you're willing to stick with it for about 5-10 minutes, the technically amazing single shot that introduces all the main While the opening jumped about perhaps a bit quickly for someone who hasn't seen the television show, if you're willing to stick with it for about 5-10 minutes, the technically amazing single shot that introduces all the main characters does a very good job of catching you up. From that point on, there are solid special effects, and interesting storyline on a fairly grand scale, and some of the best fight choreography I've ever had the pleasure to watch, but the true highlights of the movie are the comparatively scenes allowing the relationships between the characters to truly play out. Watching adversaries who resepect each other come to realize that their conversation will end in violence, or a brother and sister who really truly care for each other, you realize that basic human interaction is what drives this film. And in the final act, that is where the film takes it's boldest steps...not as sci-fi, but as a solid, character driven drama.",
      "review_date": "2005-09-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie rocked.",
      "review_date": "2006-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is awesome! A must-see sci-fi film of true imagination and energy. The characters, dialogue and effects rock!",
      "review_date": "2006-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Suprisingly good, but by no means fantastic. However, i see a lot of potential if the series continues.",
      "review_date": "2006-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was a huge Firefly fan and really looked forward to this movie. However it suffers from several problems, the 9 central characters from the series are just too many for a movie and for people not familiar with the TV series must have I was a huge Firefly fan and really looked forward to this movie. However it suffers from several problems, the 9 central characters from the series are just too many for a movie and for people not familiar with the TV series must have seemed very 2 dimensional. The other main issue is that it doesn't really work as Sci-Fi,some minor points are the solar system with numerous habitable planets/moons all with the same gravity (just doesn't make sense), the brightest planet (Miranda) is supposedly the furthest out, the location of Mr Universe's transmitter etc. but the single biggest issue is the Reavers, we're told there are only 30,000 of these essentially mindless zombies yet they are able to run starships and in the 6 or 7 years since their creation the Alliance military have been totally unable to deal with them.",
      "review_date": "2006-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you are one of those people who appreciate a good story, plenty of action, and some genuine fun, Serenity is a good fit for you. This is the silver screen portrayal of the beloved (but short-lived) Firefly TV show. The characters in the If you are one of those people who appreciate a good story, plenty of action, and some genuine fun, Serenity is a good fit for you. This is the silver screen portrayal of the beloved (but short-lived) Firefly TV show. The characters in the movie all live up to their past acclaim and also do a good job of welcoming new visitors to Joss Whedon's amazing western/sci-fi universe. Please, if you have any love for the science fiction genre, give this a try. Then, if you love the movie, for godsakes, buy the Firefly Box Set!",
      "review_date": "2006-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A great movie that exemplifies Josh Whedon's enigmatic writing with the best of all scifi genres, cowbuys in space!",
      "review_date": "2010-05-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Stellar. A few fans will have major disappointments (which I cannot disclose for fear of spoiling someone's viewing of it) but overall it's thrilling and well made. Must-see!",
      "review_date": "2005-10-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Pretty damn great. can't believe how much was packed into two hours. the only real gripe i have is that parts were a bit too stereotypically hollywood, especially the climactic fight scenes.",
      "review_date": "2005-10-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Entertaining Nonsense.",
      "review_date": "2005-10-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A GREAT movie! Must see for any sci-fi fan, especially if you've seen even a single episode of Firefly. Let's make this movie #1 at the box office so we can push them into making another 2 movies!",
      "review_date": "2005-10-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you like scifi, this movie doesn't disappoint. If you like humor, this movie doesn't disappoint, if you like action, this movie doesn't disappoint. But if you were a fan of the series, prepare for all of that, plus the If you like scifi, this movie doesn't disappoint. If you like humor, this movie doesn't disappoint, if you like action, this movie doesn't disappoint. But if you were a fan of the series, prepare for all of that, plus the bittersweet emotion of closure.",
      "review_date": "2005-10-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good effort but the TV show was better. Hated taht he got rid of an impprtant character. Ending was weak.",
      "review_date": "2005-10-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Serenity is not a perfect movie. The score is sometimes clunky, the camera work sometimes amateurish, and the plot devices sometimes a bit TOO convenient. But I give it a perfect score because it is so unique, original and captivating, that Serenity is not a perfect movie. The score is sometimes clunky, the camera work sometimes amateurish, and the plot devices sometimes a bit TOO convenient. But I give it a perfect score because it is so unique, original and captivating, that it is unlike any other movie in theatres. Serenity is a definite must-see movie!",
      "review_date": "2005-10-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Simply brilliant.",
      "review_date": "2005-10-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic: Serenity is the best of all possible worlds (sci fi, western, comedy, zombie).",
      "review_date": "2005-10-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great Movie! I never saw the TV series and had no problem following it. I thinking about buying the series on DVD now to see the long term character build up an then see the movie again on Video. Much better than Star Wars prequels. This Great Movie! I never saw the TV series and had no problem following it. I thinking about buying the series on DVD now to see the long term character build up an then see the movie again on Video. Much better than Star Wars prequels. This won't let you down unless your humorless and witless.",
      "review_date": "2005-10-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent!",
      "review_date": "2005-10-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am a Joss Whedon fan (from Buffy to Firefly) and this movie had all the heart and soul that I have come to expect. It was true to the series and a pleasure from start to finish. Even my wife--who has spent limited time in Whedon I am a Joss Whedon fan (from Buffy to Firefly) and this movie had all the heart and soul that I have come to expect. It was true to the series and a pleasure from start to finish. Even my wife--who has spent limited time in Whedon land--thought it could not have been any better. Twenty minutes (or less) into the movie and I already wanted to see it again.",
      "review_date": "2005-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent in every sense of the word. Joss didn't miss a step from the show to the movie.",
      "review_date": "2005-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It surpasses the expectations of even the most die-hard Firefly fan. Quite simply, the best sci-fi thrill ride since Empire Strikes Back.",
      "review_date": "2005-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Outstanding Sci-Fi Epic Drama...Perfect Story, great acting and effects that come close to Star Wars...Much smarter and better movie then Star Wars post Episodes...Let's hope it gets 2 sequels!",
      "review_date": "2005-12-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Outstanding movie! It kept all the charm and humor of the Firefly series and yet was credible and engaging on the big screen. Bring on the sequel.",
      "review_date": "2005-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "George Lucas should take notes.",
      "review_date": "2005-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm hooked. I want a gorram sequel !",
      "review_date": "2005-10-02",
      "source": "metacritic"
    }
  ],
  "num_reviews": 134
}