{
  "title": "Sin City",
  "rating": 8.7,
  "release_date": "2005-04-01",
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "summary": "Robert Rodriguez and comic book icon Frank Miller co-direct Sin City, based on the series of graphic novels created, written and illustrated by Miller.  The film is infested with criminals, crooked cops and sexy dames, some searching for vengeance, some for redemption and others, both. [Dimension Films]",
  "critic_reviews": [
    "The visually stunning Sin City has grit to spare and a thrilling undercurrent of morality.",
    "Sin City is brazenly, thrillingly alive.",
    "It's a guaranteed must-see for its generation. Sin City has a long, long shelf life ahead.",
    "I loved it. Or, to put it another way, I loved it, I loved it, I loved it. I loved every gorgeous sick disgusting ravishing overbaked blood-spurting artificial frame of it.",
    "This isn't an adaptation of a comic book, it's like a comic book brought to life and pumped with steroids.",
    "A movie unlike any other.",
    "Two hours and six minutes has never seemed so much like two and six-tenths seconds. It's pure pulp metafiction.",
    "Some things in Sin City are almost too much to watch: the violence, the cruelty, the irredeemable evil. But it's irresistibly magnetic because it serves as a barely distorted mirror to our world.",
    "Sin City is the first mainstream American picture I've seen this year that feels even remotely brash or original. It's a hard, viciously funny little movie, one with all the subtlety of a billy club. But there's artistry here.",
    "Honestly, this ultra-noir adaptation of Frank Miller's black-and-white cult comic series is a visual feast ripped straight from the original medium's blood-soaked pages.",
    "The most visually inventive comic book adaptation to make its way to a movie screen.",
    "Sin City is an evil place, full of awful people, an obsessive movie full of monomaniacal tough guys. Yet when Miller and Rodriguez move it into gear, noir lives.",
    "The worst thing I can say about this savage, sexy and ferociously funny screen translation of three stories from Frank Miller's Sin City series of graphic novels is that it's too much of a good thing.",
    "Occasionally very funny, the picture tends to coast on its cosmetics. A first-rate script might have made it a twisted masterpiece.",
    "Tarantino may have nicked the title first, but this is the real ''Pulp Fiction,\" with all the drama and the dead ends that implies.",
    "A rough-and-tumble magnum opus of digital filmmaking that thrillingly basks in the sick, slick, sexy and quick-witted excesses of its imaginatively mutant stylizations.",
    "For geeks, action freaks and sensation-seeking teenage boys of all ages, the price of admission will provide a one-way ticket to hard-boiled heaven.",
    "It's gory stuff, but it's also a visually arresting blitzkrieg with action so bare-knuckled you'll leave the theater spitting out teeth.",
    "Sin City draws on the cumulative history of both mediums, creating a pastiche that would have been technologically impossible even three years ago. Its creators invent a queasily intoxicating new world.",
    "Rodriguez clearly assumes Sin City to be his \"Pulp Fiction,\" his rambling portmanteau--a blending of disparate tales to form a complete, overwhelming epic.",
    "Rodriguez slams down the sledgehammer with so much brutal, punishing force, there's no room to breathe.",
    "For the guys it's Rodriguez's best film by far and a treat for fans of good-looking girls in black-and-white, of classic film noir and of imaginative ultra-violence.",
    "Sin City snaps, crackles and pops like no graphic novel ever brought to the screen. Mixing live-action with computer-generated images, it looks like the novels, talks and bleeds like the novels, is as muscular and voluptuous as the novels - and it leaves you breathless as only a movie can.",
    "This is noir on steroids, cartoonishly ultra-violent and drawing inspiration from Mickey Spillane novels and E.C. comics of the '50s.",
    "Sin City gives sin a great name -- it's never been more plentiful or looked so gorgeous.",
    "Sin City has been made with such scrupulous care and obvious love for its genre influences that it's a shame the movie is kind of a bore.",
    "But once you're good and drunk on the look, details like the tin-eared tough-guy dialogue (which sounds especially stilted issuing from flesh-and-blood mouths) don't seem so important.",
    "Rodriguez's evident delight in the form make this a worthwhile piece of eye candy.",
    "Sin City is always moving on to the next thing, and despite surprisingly good work from its large cast (especially Rourke and Owen, who are both outstanding), the picture feels synthetic and artificial.",
    "To say that Sin City is a guy movie - and an often brutally misogynist one, at that - would be an understatement.",
    "Glued tightly from page to screen, Sin City is so seduced by the visual possibilities of sin that style becomes its own vice.",
    "After half an hour spent drooling over its visual splendors, I found the movie every bit as sickening as its creators intended it to be, minus the kicks they so palpably got out of making it.",
    "For a relentlessly violent and exploitive noir knockoff, Sin City is mystifyingly flat and static - cartoonish, even, if you want to get tautological about it.",
    "Sin City is a seedy tribute to rugged masculinity disguised as a rogue's gallery, all the better to please college boys who like their sentimentality slicked with grunge.",
    "What binds and clads the new movie most thoroughly, however, is not storytelling but the high pressure of atmosphere.",
    "Eye-popping yet ultimately thin and shallow as a page in a graphic novel.",
    "Sin City lacks the human interest, not to be confused with humanism, that \"Pulp Fiction\" had in abundance. As if to underscore the fact, Tarantino guest-directed a scene. It's readily recognizable as the only one in which the dialogue has the slightest conviction.",
    "Everything here has been done better in other books, other movies. The lone remarkable thing is the level of violence, which exposes the cowardice and hypocrisy of the Motion Picture Association of America's ratings system.",
    "The attainment it achieves is in the depths of pointless, mean-spirited exploitation."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I loved the way the it is presented; a pulp noir thing. I never read the comic so I really didn't know what I was in for when I decided to watch this and I am glad I did. The violence is a bit over the top but it's no big deal, it acts asI loved the way the it is presented; a pulp noir thing. I never read the comic so I really didn't know what I was in for when I decided to watch this and I am glad I did. The violence is a bit over the top but it's no big deal, it acts as part of the city helping boost the fact that it's 'Sin City'",
      "review_date": "2011-08-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sin City is grisly, violent, and over-the-top in all the best ways. The stunning cinematography, taught direction, and electrifying script make it one of the best modern film noirs.",
      "review_date": "2014-07-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spilt into chapters Sin City is a faithful adaptation of three of Frank Millers violent, but brilliantly written, Sin City stories. Shot largely in black and white using Millers graphic novels as story boards director Rodriguez has been ableSpilt into chapters Sin City is a faithful adaptation of three of Frank Millers violent, but brilliantly written, Sin City stories. Shot largely in black and white using Millers graphic novels as story boards director Rodriguez has been able to create a visual feast the likes of which still hasn't been matched.\r Fortunately the stories themselves are able to match the visuals with each of the three fast-paced and engaging chapters providing truly memorable heroes and villains that take full advantage of the impressively talented cast. An all out success just sit back and enjoy two hours of fantastic entertainment.",
      "review_date": "2013-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nComic book movies have usually been the big hitters, like Batman, Superman, and the Marvel heroes. Today is the exception with Sin city. I never heard of it, and I never knew that this was based off a comic book, in fact the menu for the DVD tells you by itself. Not that I'm judging it differently now that I know it was based off a comic, but I can definitely see nods and ideas that comics themselves would take. Sin city is the dark noir; add salt and salt, view of three people: a cop, I think a detective, and a loser; persay. Each tale is told well in their own way, showing off the grittiness of the everyday city some us walk through everyday; if you lived in Chicago at least, and is told by unique and interesting people. Bruce wills plays a cop; stop me if you heard this before, and is hunting down a serial pedophile, he does good in not making his role too extreme or boring, just the right I'd say. Mickey Rourk does an awesome job of playing the bad ass Marv, I said earlier that he was a loser, but that was only figuratively. The last I guy I don't know, he's okay he definitely sells me on the character he's trying to play, but his monotone voice is rather boring. The stories are divided well and purposely don't tie into each other, which is good so that it doesn't get confusing. I mean a character will see another one from another tale, but it doesn't mean anything. Finally I conclude with saying this is one of the best comic book movies out there, near the dark knight, but not close.",
      "review_date": "2013-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If I had to sum Sin City up In Two Words, I would say \"Stylistically Badass\"  This film has TRULY Unique and equally Beautiful Visuals and a surprisingly Epic story, And something that makes this stand out from other comic book to movieIf I had to sum Sin City up In Two Words, I would say \"Stylistically Badass\"  This film has TRULY Unique and equally Beautiful Visuals and a surprisingly Epic story, And something that makes this stand out from other comic book to movie adaptations is how faithful the live-action characters are to the original comic book characters.",
      "review_date": "2014-11-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of the best comic book movies ever released. The look, cinematography, acting, and action are all perfect. Elements of the script are cheesy, but I chalk it up to its origins as a comic book.",
      "review_date": "2020-06-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n\"Sin City\" is a very good movie with intense action. It really goes all in on showing how bad the crime scene is there. I especially like the narrative point of view character's in it. I also like that in the movie there are no limits in how bad the crimes really are at all. It does a great job in delivering certain items or people to be different color from the rest to point them out. The cast does a great job especially Clive Owen in his performance. Overall this is a dark movie, with violence and corruption which is what the movie is supposed to represent and they do an excellent job at it.",
      "review_date": "2014-04-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This didn't affected me too much while i was watching but after a 2 or 3 days, i noticed that i kept thinking about this and then i realized how an epic experience this movie was. I actually watched it because of Jessica Alba, but i couldn'tThis didn't affected me too much while i was watching but after a 2 or 3 days, i noticed that i kept thinking about this and then i realized how an epic experience this movie was. I actually watched it because of Jessica Alba, but i couldn't believe it would be that good. Comments? Come on guys, if you give this movie anything lower than 5, then it is your problem. Cast is already full with stars: Jessica, Bruce Willis, Clive Owen, Mickey Rourke and even Michael Clarke Duncan bro...Noir Crime movies is not something seen common in Hollywood  (i dont even remember another Noir Crime other than Max Payne Movie) Watch it and you will love it...",
      "review_date": "2012-02-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another breakthrough in cinema comes in the form of Sin City, a film brimming with so much drama, flare, excitement and beauty that it will ultimately be one of the defining, unforgettable and dramatic pieces of modern cinema that exploresAnother breakthrough in cinema comes in the form of Sin City, a film brimming with so much drama, flare, excitement and beauty that it will ultimately be one of the defining, unforgettable and dramatic pieces of modern cinema that explores and discovers new ground, and brings the comic to movie adaption scenario to a whole new level. The film is told through various stories based on Frank Millar's comic book series, the man who also directed the film along with Robert Rodriguez, and a special credit for Quentin Tarantino, along with an ensemble cast that have the pleasure of taking part in such a unique film.\rWe have Bruce Willis playing an ageing cop with heart problems, who struggles to do his duty, while in another story we have a heavily make-upped Mickey Rourke playing Marv, a man on the hunt for the person who killed his mistress in the night, and he will not let anyone stand in his way, good or bad. The large cast which also includes Jessica Alba, Josh Hartnett, the late Brittany Murphy, Elijah Wood and Michael Madsen, all play very versatile and intriguing parts, and to my understanding this is more a \"translation\" than an adaption, as it is very close to the comics. These actors and actresses really throw themselves into the roles, particularly Mickey Rourke as the larger than life Marv, and also Clive Owen, a mysterious man helping out a town of prostitutes.\rThe statement of the film and its faithful translation of the comic series is visually true on screen, when we see the graphic content and the neo-noir effect used entirely throughout the film, where it is predominately black and white save for certain colours such as blood and lipstick.\rThis unique and edgy form of filming is magnificent and full of gore, with an exaggerated and out of this world form of violence. Its a real delight when a film like this comes along, combining the power of technology and of course, the imagination, to create a very singular and unorthodox film that never quits being surprising, innovative and most of all, fun.\rThe film is one of historical significance in terms of its groundbreaking style of filming, but it is also well written and can be summed up in various aways, a crime film, a thriller but also a very brutal and imaginative tale, a must see for comic book and film fans alike.",
      "review_date": "2013-08-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Sin City\" is much more than a gory, stylized flick, it actually has a story and plot and, well, everything else.  Shot in a gritty black and white background with highlighted shades of red and yellow, this is one hell of a movie. And believe\"Sin City\" is much more than a gory, stylized flick, it actually has a story and plot and, well, everything else.  Shot in a gritty black and white background with highlighted shades of red and yellow, this is one hell of a movie. And believe me, it has such style.",
      "review_date": "2012-07-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Its on my list for one of the best movies of all time, Sin City grabs audiences in on all levels whether its humor or its satisfying style of thrilling violence. Rodriguez at his absolute best.",
      "review_date": "2013-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is extremely disturbing: the violence is gruesome, the plot is dark, and a lot of the scenes/themes are vile, but that's what a graphic novel is! Despite loving the direction of the film, I was heavily disturbed (in particularly theThis film is extremely disturbing: the violence is gruesome, the plot is dark, and a lot of the scenes/themes are vile, but that's what a graphic novel is! Despite loving the direction of the film, I was heavily disturbed (in particularly the Last Jessica Alba scene), but while I was ringing at the horrific images all I could think was how generally excellent this film is.",
      "review_date": "2013-01-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ever thought you'd actually like a movie with a heavily used up \"Detective's POV\" style of progression? From this century? Well think again! A surreal, visually stunning Neo-noir by the legend himself - teaming alongside the likes TarantinoEver thought you'd actually like a movie with a heavily used up \"Detective's POV\" style of progression? From this century? Well think again! A surreal, visually stunning Neo-noir by the legend himself - teaming alongside the likes Tarantino and Rodriguez - entertainment couldn't possibly get any better than this.",
      "review_date": "2014-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Robert Rodriguez has made some good and bad films in his career, so one has the right to be unsure of whether to see this film or not.  However, the very appealing cast persuaded me to watch 'Sin City', and I'm very glad I did.  The cast wereRobert Rodriguez has made some good and bad films in his career, so one has the right to be unsure of whether to see this film or not.  However, the very appealing cast persuaded me to watch 'Sin City', and I'm very glad I did.  The cast were excellent, the dialogue strong (although sometimes a little cheesy, which I didn't mind) and the effects were breathtakingly brilliant.\r It is stylistic, sometimes funny, well-acted and all together, a fantastic film.  An absolute 'must-see'!",
      "review_date": "2014-07-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sin City is a masterpiece. the black and white with some color visual style of this movie is amazing. the stories in this movie are great and interesting told.",
      "review_date": "2020-09-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "AlvaradoKTAJun 16, 2014Even on such a low budget, this is the best in the Mexico-trilogy films. Well paced from the opening title to the to be continued promise, every scene has a humorous note. An original script with a good amount of shootAlvaradoKTAJun 16, 2014Even on such a low budget, this is the best in the Mexico-trilogy films. Well paced from the opening title to the to be continued promise, every scene has a humorous note. An original script with a good amount of shoot outs, this film",
      "review_date": "2021-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤°°°°°°°°°°°°°°°",
      "review_date": "2021-04-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "●●●●●●●●●●●●●●●●●●●■■■■■■●●●●●●●■■■■■■■■●●●●●●●●●●~~~~~~````````````,,,,,,,,,,,,,,",
      "review_date": "2021-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "++++++++++++×××××××××××××××××××÷÷÷÷÷÷÷÷=÷÷÷÷÷÷==========::::::;;;;;;;::::::::::::::::°°°°°°°°°°°°~~~~~~~~~~~~~~~",
      "review_date": "2021-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇●●●●●●●●●●●●●●●●●●●●zxcvnmmsodmodmkdmosmswet",
      "review_date": "2021-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,■》■》■》■》■》■》■》■》■》●》●》●》●》●》●》●》●》●",
      "review_date": "2021-06-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "the greatest comic book movie ever created, what a masterpiece! i love the the theatrical cut but i love extended cut even more bcuz it expand the story even more when it didn't even have to, such perfection. marv is my favorite character butthe greatest comic book movie ever created, what a masterpiece! i love the the theatrical cut but i love extended cut even more bcuz it expand the story even more when it didn't even have to, such perfection. marv is my favorite character but honestly i love all of the characters. the cast is so perfect and fit so well. its nothing negative that i can say about this movie.",
      "review_date": "2021-07-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "10 for style, but only a 5 for plot, yielding about a 7 overall. Didn't love it, but it was definitely original. Mickey Rourke is outstanding. Part 3 is repetitive, but then again Bruce Willis is a fine actor, so he pulled me in. Some 10 for style, but only a 5 for plot, yielding about a 7 overall. Didn't love it, but it was definitely original. Mickey Rourke is outstanding. Part 3 is repetitive, but then again Bruce Willis is a fine actor, so he pulled me in. Some of the violence was too much for me.",
      "review_date": "2005-08-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the five best films I've ever seen, Sin City is a masterpiece of monumental proportions. The only reason people are giving this film bad reviews is because they have no taste, thought it was boring, and hated how it represented One of the five best films I've ever seen, Sin City is a masterpiece of monumental proportions. The only reason people are giving this film bad reviews is because they have no taste, thought it was boring, and hated how it represented everything wrong with society. That's what the purpose of it is, it represents what is wrong with society and isn't far from reality. This film was amazing throughout and if you get pissed at films that show the dark side of human nature, then just walk away. If you actually have taste in films and have no problems with films that aren't interested in happy endings or showing a good side of humanity, then this is quite the sight. It's determined to be stylish and feel realistic. BEST COMIC BOOK FILM EVER.",
      "review_date": "2009-06-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Expected so much more from this one. Sin City starts out intriguing, but in the middle gets so terrible I had to actually fast forward through parts of it and fight the urge to press stop and quit watching it. The problem, obviously, is notExpected so much more from this one. Sin City starts out intriguing, but in the middle gets so terrible I had to actually fast forward through parts of it and fight the urge to press stop and quit watching it. The problem, obviously, is not with the graphic presentation - it's stylish and sometimes very gory. Also gotta take note of the female cast - Jessica Alba is adorable, and others (especially Carla Gugino, to my surprise) are outright hot. (Boobs included) But a movie isn't all about its presentation (and boobs), it's also very much about the plot, and it's pretty damn awful here. The main problem are the characters and the overall goofy comicbook crap that it's based on. Mickey Rourke's ugly-as- **** character throwing people like he's superpowered, Clive Owen jumping down buildings, creepy cannibalistic Elijah Wood, people surviving totally grave wounds and some ugly disgusting yellow freak are ridiculous and just plain stupid.\rIt is impossible not to see how hard this tries to be \"noir\". with all the black-and-white colouring, constant rain or snow and neverending inner monologues. But it tries too hard, not achieving much. What the movie lacks is a good source to be based on - maybe some detective novel, some real literature, not this comic book junk from Mr. Miller, who can hardly be called a writer.\rOnly good thing is that now I know that I'm in no way spending money on a cinema ticket to the Dame to Kill For, despite its boob-cast now including Eva Green.",
      "review_date": "2014-08-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sin City is just not my thing I guess. I did not like the story and the characters too much and they dragged the rest of the film down with them. The film just has no soul and it shows so much throughout the film as it is entirely hollow. TheSin City is just not my thing I guess. I did not like the story and the characters too much and they dragged the rest of the film down with them. The film just has no soul and it shows so much throughout the film as it is entirely hollow. The acting is fine and the direction is certainly stylish. The visuals of the film are revolutionary and a true wonder. That is the film's main redeeming quality; the visuals. I wanted to like this one more, but I just did not. Maybe I will rewatch it, because I want to love this film and I feel like I am being harsh on it, but it just did not land for me at all. The visuals must have taken forever to do and I appreciate the effort, especially since they are so groundbreaking. Plus, they are breathtakingly gorgeous, which does not hurt. The colors and when they are not present are just...wow. The direction is fine, but the characters and plot just make the rest fall apart. I could not get into this one at all and it also felt so shallow and hollow. Overall, I wish I liked Sin City more than I did. Sorry.",
      "review_date": "2016-02-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The story and characters are brutal, gritty and motivated. The visual style is atmospheric and comic book like. The soundtrack is just right. The movie delivers entertainment and interest in the characters.",
      "review_date": "2016-06-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Extreme brutality and violence, visually-arresting cinematography, and nothing short of pure genius. Remarkable crime thriller neo-noir based on Frank Miller's graphic comic novel series. Directed by Robert Rodriguez and Frank Miller, thereExtreme brutality and violence, visually-arresting cinematography, and nothing short of pure genius. Remarkable crime thriller neo-noir based on Frank Miller's graphic comic novel series. Directed by Robert Rodriguez and Frank Miller, there wasn't a screenplay written for the film, and instead they approached the filming as a translation. This isn't an adaptation of a comic book, it's like a comic book brought to life and pumped with steroids. The movie is based on three of the \"Sin City\" stories which works perfectly for a two hour film. There are big time actors in the movie (Bruce Willis, Clive Owen, Mickey Rourke), but there is no lead role so much as actors who dominate the foreground and then move on. Fully digital, live action picture incorporating a technique of colorization while filmed in black and white. To say that this is the best comic book to movie adaptation I've ever seen would be an understatement.",
      "review_date": "2013-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After watching Sin City for the first time it would be a huge understatement to say that I am excited for \"A Dame to Kill For\" later this year! This movie was plain awesome! Everything from the fantastic characters, the interwoven story linesAfter watching Sin City for the first time it would be a huge understatement to say that I am excited for \"A Dame to Kill For\" later this year! This movie was plain awesome! Everything from the fantastic characters, the interwoven story lines and the down right jaw dropping visual style; everything was almost exactly how it should be! I can honestly say that this is the first comic book films I have seen where the pages were not only adapted but truly brought to life!",
      "review_date": "2014-07-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The sheer faithfulness of the movie to the comic book series is evident, and has my respect from before the movie even begins. The stylized neo-noir color, cinematography, and editing is added with stellar acting and an actual plot. TheThe sheer faithfulness of the movie to the comic book series is evident, and has my respect from before the movie even begins. The stylized neo-noir color, cinematography, and editing is added with stellar acting and an actual plot. The violence is turned into its own art form, which up until this film, I only thought Tarantino could pull off.",
      "review_date": "2014-06-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The film is split into 3 shorter stories. One of which, \"That Yellow Bastard\" is tense, gripping, and excellently directed. The second, \"The Hard Goodbye\" falls short, but is still pretty entertaining. The third, \"The Big Fat Kill\" isThe film is split into 3 shorter stories. One of which, \"That Yellow Bastard\" is tense, gripping, and excellently directed. The second, \"The Hard Goodbye\" falls short, but is still pretty entertaining. The third, \"The Big Fat Kill\" is absolutely ridiculous and horrible. The whole experience levels out to be something quite shallow and underwhelming, and by the end, you feel like Robert Rodriguez is just throwing blood all over the viewer's face saying \"LOOK AT IT! LOOK AT IT!\" Definitely not really worth watching, unless you can find \"That Yellow Bastard\" as a standalone short film.",
      "review_date": "2014-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a good comic book to movie adaptation.Bruce Willis,Mickey Rourke,Jessica Alba and Clive Owen are excellent in their roles.The only thing that I found disappointing is, the fact, that Josh Hartnett was not there enough.But the movieThis is a good comic book to movie adaptation.Bruce Willis,Mickey Rourke,Jessica Alba and Clive Owen are excellent in their roles.The only thing that I found disappointing is, the fact, that Josh Hartnett was not there enough.But the movie was still excellent.",
      "review_date": "2015-05-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Unbelievable! In this age, a black and white movie making me love it so much? I'm amazed really. The characters, the story, the filming... Women to kill and die for! Everything is perfect. Sin City has made it upon my list of classics for sure.",
      "review_date": "2017-05-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sin City is a movie that is interested in one thing and one thing only: being cool.And boy does it accomplish that.\nEvery second of each of its different stories is dripping with unapologetically stylish visuals, sex, violence, brooding andSin City is a movie that is interested in one thing and one thing only: being cool.And boy does it accomplish that.Every second of each of its different stories is dripping with unapologetically stylish visuals, sex, violence, brooding and edge.It's completely devoid of any pretentions while also being the perfect kind of pretentious. It knows exactly what it is, and it loves every second of it.There are few movies as confident in their ability to wow audiences like this one. It certainly wowed me.",
      "review_date": "2020-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A+ *************************************************************************",
      "review_date": "2020-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "+++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■",
      "review_date": "2021-06-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sin City was absolutely amazing! Just like the comic book, the movie's format of color is incredible.\r Watch it online for free: https://www.primewire.ag/watch-589-Sin-City-online-free",
      "review_date": "2016-01-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Sin City\", a neo noir movie based on the graphic novel, is a beautiful film. It films in glorious black and white with rich story segments and artistic brutality. Simply a dazzling crime movie that has everything one craves for.",
      "review_date": "2011-09-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Easily one of the best comic book movies is so goddamn awesome so many awesome characters and such an amazing setting worth all the moneys 10/10 so much goddamn good",
      "review_date": "2013-10-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One my favorite comic adapts.  I still think its one of the best.  Great black and white noir look mixed with fantasy elements.  Each character almost more over the top than the next.  The only thing is I thought they should have done theOne my favorite comic adapts.  I still think its one of the best.  Great black and white noir look mixed with fantasy elements.  Each character almost more over the top than the next.  The only thing is I thought they should have done the long goodbye last because it was strongest of the stories and the best performances are in that story.  The other stories are good but nothing quiet lives up to Mickey Rourke's turn as the revenge for the hooker with a heart gold..Goldy...",
      "review_date": "2013-07-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just because Sin City is derived from a graphic novel does not necessarily mean I wish for the film to appear as exactly such. The visuals were mediocre alongside its choppy script.",
      "review_date": "2014-09-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@:@:@:@:@:@:@:@:@:@:@:@:@:",
      "review_date": "2021-06-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While the film does start out interesting, It gets pretty old and boring the further you get into it. Also the stories are rather stupid and pretty generic, They lack interest as well. Also the acting is well below what I expected from theWhile the film does start out interesting, It gets pretty old and boring the further you get into it. Also the stories are rather stupid and pretty generic, They lack interest as well. Also the acting is well below what I expected from the star studded cast. It looks good but thats about it.",
      "review_date": "2011-12-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I expected to see alot more from this movie, really i expected the best but it didn't deliver. It's hard to rate cause the movies 3 storys in one. The frist one was like having a open hart surgery and the last one was not much I expected to see alot more from this movie, really i expected the best but it didn't deliver. It's hard to rate cause the movies 3 storys in one. The frist one was like having a open hart surgery and the last one was not much better. The second one was actully prity frigen good, the the hole movie was just and extened vertion of the second story I may have given it a 8 or 9. The worst thing was the Narration, the main chariture narrarates his own story. Which sounds cool but then you find out they all sound like Sam Spade and have cheesy diologe. Oh and the gore was enofe to make Jason from Friday the 13th sick. If they had cut back on the crudy narration and gore it would have been grate, but these 2 things murdered the film.",
      "review_date": "2005-10-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sin City is, in every respect, a masterpiece of kistch. Simultaneously celebrating shallowness and gratuitousness while offering twisted spins on the themes of noir stories, Robert Rodriguez (and Frank Miller, but he is not technically aSin City is, in every respect, a masterpiece of kistch. Simultaneously celebrating shallowness and gratuitousness while offering twisted spins on the themes of noir stories, Robert Rodriguez (and Frank Miller, but he is not technically a director of this film) paints a pulp art story then enjoys itself, while allowing the audience to enjoy it. Provided you have a strong stomach.",
      "review_date": "2011-09-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the kind of vile, ridiculously brutal movie made by a country that can't win real wars, and where economic failure causes its citizens to fantasize about ultraviolence. Sixty years ago Americans fought their wars with honor, and This is the kind of vile, ridiculously brutal movie made by a country that can't win real wars, and where economic failure causes its citizens to fantasize about ultraviolence. Sixty years ago Americans fought their wars with honor, and for the right reasons, but made movies that respected human dignity. We're flushing ourselves down the toilet of history.",
      "review_date": "2009-03-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Definatley one of the worst movies i have ever seen.",
      "review_date": "2006-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Easily the sickest mainstream movie of 2005 was \"Sin City.\" This is a duller than dull, grosser than gross adaptation of Frank Miller's adored graphic novels. But the movie, which features an all-star cast (Bruce Willis, Michael Madsen, Easily the sickest mainstream movie of 2005 was \"Sin City.\" This is a duller than dull, grosser than gross adaptation of Frank Miller's adored graphic novels. But the movie, which features an all-star cast (Bruce Willis, Michael Madsen, Mickey Rourke, Jessica Alba, Elijah Wood, and on and on), is so sleazy and frankly boring that by the end of its two hours of screen time I feel exhausted and disgusted. Not since \"Batman Returns\" has a director been so fixated on creating moods and emulating creepy noir settings at the expense of storytelling that is coherent and enthralling. Director Robert Rodriguez (working with Quentin Tarantino) settles for misogynistic material that is amazing for the eyes to behold. But since when has that been enough? Working with Tarantino is a major tip-off to this movies abundance of problems. I loved \"Kill Bill 2\", thought it was among the best films of 2004. But there is a joy to the \"Kill Bill\" movies; a zeal for exhilarating movie making that calls to mind the joyful destruction of \"Goodfellas\" and those movies actually had strongly feminine proclivities. There is no joy, no fun, and no pleasure in \"Sin City\" (except for people who dig seeing the 50th head chopped off or women slapped around). Even if you can look past that there still isn't much to marvel at. Worse than the triumph of style over substance, \"Sin City\" champions bad attitude over ideas.",
      "review_date": "2006-09-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm not offended by nudity, and violence is okay if the flim has some other redeeming qualities. Sin City has no redeeming qualities. If Sin City is representative of modern comics I'm glad I gave up reading comics in my teens. Sin I'm not offended by nudity, and violence is okay if the flim has some other redeeming qualities. Sin City has no redeeming qualities. If Sin City is representative of modern comics I'm glad I gave up reading comics in my teens. Sin City isn't simply bad, it's disgusting.",
      "review_date": "2007-03-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ridculous dialogue. Self-serving and preposterous. This movie uses every cliche in the book. It's gut wrenching watching quality actors seem like they are suffering through such a goofy movie with some of the worst lines ever written.",
      "review_date": "2005-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good looking but so what. Elijah Woods was in this where? Vile and bloody.",
      "review_date": "2005-08-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One day someone will have to explain to me what use \"cool\" is in praising a movie. It can't be quantified, or analyzed, or particularly defined. Something is \"cool\" when it is \"cool.\" That's Sin City. All the men are big gritty One day someone will have to explain to me what use \"cool\" is in praising a movie. It can't be quantified, or analyzed, or particularly defined. Something is \"cool\" when it is \"cool.\" That's Sin City. All the men are big gritty types with fast cars and guns and hard fists -- \"cool\" All the women are prostitues or strippers in various states of undress who also have guns, though require protecting by the men -- \"cool\" The writing is cliche, the dialogue is bad, the acting is worse. The only thing that can be said positively is that the visual style of the movie is sometimes interesting. If Sin City is the essence of \"cool\" then that whole concept has come perilously close to \"corny\"",
      "review_date": "2006-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "a disgusting blend of mind-numbingly banal cliches and over-the-top sadistic violence..i really wonder about those infants who find this film entertaining. It is about as original as a snuff movie and is a worrying sign of the direction a disgusting blend of mind-numbingly banal cliches and over-the-top sadistic violence..i really wonder about those infants who find this film entertaining. It is about as original as a snuff movie and is a worrying sign of the direction Hollywood is taking. Bravo rayo for your wonderful critique...when kidnap,torture,rape and cannibalism becomes mainstream popcorn-fodder you really have to ask yourself about the world you're living in. This movie really does not have any redeeming features. Sorry to sound like an evangelist but as someone who loves cinema i find sin city empty, shallow, fake, offensive and in the end plain dumb.",
      "review_date": "2007-06-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is by far the worst movie ever made. The positive reviews MUST be a complete conspiracy of those who made or are paid to promote the movie.",
      "review_date": "2005-10-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The characters are all the same, the violene is unrealistic, the story moves way too fast and never explains itself, the film has multiple and uneeded sexual refences.",
      "review_date": "2005-12-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Sin City\" is a depressing, anger-inducing headache for anyone who cares about humanity. The only thing this film accomplished is to make me loathe the worst of human nature just a little bit more. The comic book visuals could not get me to \"Sin City\" is a depressing, anger-inducing headache for anyone who cares about humanity. The only thing this film accomplished is to make me loathe the worst of human nature just a little bit more. The comic book visuals could not get me to detach from its turgid subject matter.",
      "review_date": "2008-06-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Overrated and overhyped crap. Teenage boy's wet dream, and comic book geeks will love this but those with any taste in movies will be hugely diappointed. The violence is over the top and disturbing, the whole thing reeks of misogyny and Overrated and overhyped crap. Teenage boy's wet dream, and comic book geeks will love this but those with any taste in movies will be hugely diappointed. The violence is over the top and disturbing, the whole thing reeks of misogyny and the dialogue is crap. Mickey Rourke's story is ok, but the rest of the acting is weak. Shame with such good acting talent on board too. Comparisons with Pulp fiction are all wrong.",
      "review_date": "2005-08-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quentin Tarantino's most well liked movie is The Good, The Bad, and The Ugly. Undeniably these are the premises of which this movie may be judged upon. The Good: The singular notion of a theme is the principal reason of why this movie Quentin Tarantino's most well liked movie is The Good, The Bad, and The Ugly. Undeniably these are the premises of which this movie may be judged upon. The Good: The singular notion of a theme is the principal reason of why this movie is notable. Rodriguez struggles to concentrate on depth and heaviness in his movie's eternal soul. He pelts on superficiality rather than exploring the rigid atmosphere, the characters, and why in Sin City each of the characters is interwoven. Neither of any of these is explored. He explores confidence. Never achieving any merit with his central theme. All he centres on is his characters obsession with vengeance; other themes are not targeted. The Bad: Characters. Dialogue. Themes. Mood. Atmosphere. The painting that Rodriguez and Miller paint with each of their characters feels as if it were painted by cheap water colors that were purchased at a second hand store. Their intention with their paint and brush is to only fufill themselves with covering that blank sheet. That is what their characters are. Cheap, flat and abysmally written. Rodriguez is the only individual that is aware of how the audience is able to resonate with each character; they are never given an opportunity.",
      "review_date": "2006-11-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All style and no substance. It's as ugly and as fake as Mickey Rourke's makeup (whose story was the only enjoyable one). Definitely for geeks who masturbate to cartoon women.",
      "review_date": "2006-02-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "a action packed movie that feels original and is well acted . ive never read the comic of sin city but its some thing that is deffinitly different . a big cast of named actors bring this thing to life . its 3 different storys that mildlya action packed movie that feels original and is well acted . ive never read the comic of sin city but its some thing that is deffinitly different . a big cast of named actors bring this thing to life . its 3 different storys that mildly inetrtwine with each other . its bloody, gory ,faced paced , over the top , and action packed , cheesy and enjoyable.",
      "review_date": "2010-08-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love this movie. All the story to this movie are awesome. This movie was kind of confusing at first. This movie is a very interested one. Very different from all the other movies. The storyline i really fine but confusing. I think everybodyI love this movie. All the story to this movie are awesome. This movie was kind of confusing at first. This movie is a very interested one. Very different from all the other movies. The storyline i really fine but confusing. I think everybody would love this movie. It might start of bored to some people. Everybody might not like all the stories in this movie but there are more than one so I think everybody would find some story they like.",
      "review_date": "2011-04-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the most visually stunning, brutal, dark, and all around best comic book/graphic novel movies out there. \"Sin City\" is an absolutely fascinating world. It's filled with sick, twisted, and screwed up characters. Even each of the filmsOne of the most visually stunning, brutal, dark, and all around best comic book/graphic novel movies out there. \"Sin City\" is an absolutely fascinating world. It's filled with sick, twisted, and screwed up characters. Even each of the films heroes aren't immune to this fact. They're all unhinged in some way.\r It's a gripping movie. One that should be seen by any fan of noir-esque tales. It's smart, violent, and at times absolutely demented. It's absolute brilliance all around and a must watch. I give it a  total score of 9.8/10-Amazing.",
      "review_date": "2014-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Comparing three seemingly undying men trying to do the right thing in a web of corruption, sickness, violence, and revenge. Great filmmaking. --------",
      "review_date": "2011-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ang Lee tried to make the abysmal Hulk look like it was a live comic book and failed miserably; Sin City was the one that did it to near perfection.  If you take a decent comic book and a full on gynormous fan as the director, you getAng Lee tried to make the abysmal Hulk look like it was a live comic book and failed miserably; Sin City was the one that did it to near perfection.  If you take a decent comic book and a full on gynormous fan as the director, you get something different and engaging on the screen.  Robert Rodriguez took Frank Millers popular comic and must have looked up and down from his worn copy to the camera before every shot.  He found a cast that matched the books characters and if he didnâ",
      "review_date": "2011-08-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very cool visually but has serious screenplay and story problems. Acting is okay.",
      "review_date": "2020-02-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well acted, Interesting story, and entertaining from start to finish. One of few original films to actually live up to the hype and is definitely a must watch.",
      "review_date": "2014-10-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sin City, based on the graphic novels, is a thrilling ride through the dirt and muck that corrupts and influences even the most upright of men. Its visually unique style emphasizes the morally grey nature of violence and sin, when evil menSin City, based on the graphic novels, is a thrilling ride through the dirt and muck that corrupts and influences even the most upright of men. Its visually unique style emphasizes the morally grey nature of violence and sin, when evil men often dig their own graves.",
      "review_date": "2012-08-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I couldn't get into this direction. The comics are better, I cannot get into the CGI background noir style. The stories and characters were fine.",
      "review_date": "2018-08-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a rather unique film that some will not like, but according to most everyone has loved it! It's very creative and visually looks stunning, and is lead by a strong all-star cast. We follow three 'heroes' with interwoven stories all inThis is a rather unique film that some will not like, but according to most everyone has loved it! It's very creative and visually looks stunning, and is lead by a strong all-star cast. We follow three 'heroes' with interwoven stories all in Sin City itself, each with their own strong points. The graphics are what make this film unique as well as the selective choice for the colour of blood, etc. Overall I thoroughly enjoyed it and those with a open mind should do the same ",
      "review_date": "2013-08-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I really wanted to enjoy this movie more than I did. It was filmed nicely, and the screenplay was adapted well. On the other hand, you could definitely tell it had a low budget at times. Acting, at some parts, was laughable. Everyone seems toI really wanted to enjoy this movie more than I did. It was filmed nicely, and the screenplay was adapted well. On the other hand, you could definitely tell it had a low budget at times. Acting, at some parts, was laughable. Everyone seems to love this movie, and they seem to be ignoring some flaws in its design.",
      "review_date": "2013-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ah, a fun graphic novel/neon noir film at its finest. \"Sin City\" is filled with 3 interesting stories of revenge, vengeance and all in between. While some of the stories were better than others, the entertaining factor still remainsAh, a fun graphic novel/neon noir film at its finest. \"Sin City\" is filled with 3 interesting stories of revenge, vengeance and all in between. While some of the stories were better than others, the entertaining factor still remains throughout the whole film. The characters are not only great, but present great narratives as well. Bruce Willis, Mickey Rourke and Clive Owen really hold their own ground in each of their stories. Even the visuals are a marvel to watch. It's just like reading the pages from the graphic novel. Even though the multiple credits annoyed me and some parts of some of the stories were lacking, it's still a bloody good time! I give it an A-!",
      "review_date": "2014-09-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Unique way of making a movie, reminds a lot to comics. But I am not 14 anymore and such unrealistic and simple stories are boring to me. But thats not the worst. I hated all the feministic and pseudohero \"I save all the poor and sacred women\"Unique way of making a movie, reminds a lot to comics. But I am not 14 anymore and such unrealistic and simple stories are boring to me. But thats not the worst. I hated all the feministic and pseudohero \"I save all the poor and sacred women\" stupid propaganda.",
      "review_date": "2019-11-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first time I saw this movie, I wasn't impressed.  But after I thought about and watched it a second time on HBO it became one of my favorite movies.  I love how everything was black and white except for certain colors that are importantThe first time I saw this movie, I wasn't impressed.  But after I thought about and watched it a second time on HBO it became one of my favorite movies.  I love how everything was black and white except for certain colors that are important to the plot.  Great plot, acting, and almost everything was perfect about this movie.  Must see for comic book fans.",
      "review_date": "2014-11-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It really is a unique film, but how it is approached is just .. do not know, not my taste.    .",
      "review_date": "2015-04-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A game changing movie. It provides a whole new look at how to present graphic novel/comic book material. I had no prior knowledge of Frank Miller or the Sin City world but this film made me an instant fan. These characters resonate withA game changing movie. It provides a whole new look at how to present graphic novel/comic book material. I had no prior knowledge of Frank Miller or the Sin City world but this film made me an instant fan. These characters resonate with something no one of the viewers could comprehend, that is why we need their storytelling. A new universe backed by a rock solid cast. Clearly only for adult viewers. Full of tall tales of revenge, love, and survival in the twisted depths of Basin City, better known as Sin City. A new world is created with this movie, as well as a dynamic stage for actors to step in and blossom as pretty much the whole cast did. Impressive. It takes a particular audience to like these types of movies due to the dark subject matter and graphic content, for that it is not a ten, but it has plenty other qualities that should not go ignored.",
      "review_date": "2014-10-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\" A perfect noire style with a great cast and brutal action...\"\r + style of the movie\r\n+ characters\r\n+ cast\r\n+ dark\r\n+ monologues\r\n+ brutality\r\n+ the setting: sin city\r\n\r\n- no main story\r\n- a little bit to long\r\n\r\nGENRE RATING: 9.2\r\nOVERALL\" A perfect noire style with a great cast and brutal action...\"\r + style of the movie\r+ characters\r+ cast\r+ dark\r+ monologues\r+ brutality\r+ the setting: sin city\r - no main story\r- a little bit to long\r GENRE RATING: 9.2\rOVERALL RATING: 7.9",
      "review_date": "2016-02-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "10 for style, but only a 5 for plot, yielding about a 7 overall. Didn't love it, but it was definitely original. Mickey Rourke is outstanding. Part 3 is repetitive, but then again Bruce Willis is a fine actor, so he pulled me in. Some of the10 for style, but only a 5 for plot, yielding about a 7 overall. Didn't love it, but it was definitely original. Mickey Rourke is outstanding. Part 3 is repetitive, but then again Bruce Willis is a fine actor, so he pulled me in. Some of the violence was too much for me.",
      "review_date": "2016-09-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Espectacular película dividida en diferentes historias ambientadas en el mismo universo con una de las mejores fotografías que he tenido el placer de ver. Un discurso brutal con un doblaje al español de quitarse el sombrero. Un reparto y unasEspectacular película dividida en diferentes historias ambientadas en el mismo universo con una de las mejores fotografías que he tenido el placer de ver. Un discurso brutal con un doblaje al español de quitarse el sombrero. Un reparto y unas actuaciones sublimes basadas en el cómic americano original hacen que Sin City sea un clásico visual único que tardará en volver a repetirse.Especial atención a la pequeña trama de \"The Customer Is Always Right\" (de Josh Harnett y Marley Shelton), de apenas un par de minutos, sublimemente contada y con un diálogo espectacular. Muy recomendada.",
      "review_date": "2018-10-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It has aged better than I expected, it still looks good and the style is really enjoyable.",
      "review_date": "2020-01-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie truly was a masterpeice. It was entertaining and interesting. It was gorey, but in no way simply for the sake of gore. You can clearly see the comic book in the film. It's very well done in a unique style.I just can't This movie truly was a masterpeice. It was entertaining and interesting. It was gorey, but in no way simply for the sake of gore. You can clearly see the comic book in the film. It's very well done in a unique style.I just can't beleive William Arnold thought so low of it. I don't say this much about these types of stylistic, modern art type things, but this movie really was extrodanarily done, and it's great entertainment all the way through.",
      "review_date": "2005-09-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It would seem campy if it weren't so visually advanced, but the campiness combined with the CGI actually makes for an unforgettable combination.",
      "review_date": "2007-04-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When I saw Sin City I was blown away by the pace and style that it had. The film not only had an artistic style that has never been seen before in cinema but also strong stories as well as a great cast of characters who, over the course of When I saw Sin City I was blown away by the pace and style that it had. The film not only had an artistic style that has never been seen before in cinema but also strong stories as well as a great cast of characters who, over the course of the film, you care about and support as the film runs its course. The film has a deeply dark tone but also a great humane quality about it. Heres hoping Sin City 2 is soon produced.",
      "review_date": "2008-01-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The epitome of sadistic movies. And it was good that way. The trash, the sadism and the cruelty actually gave the film a sense to the non-sensed and nutcase plot. Extraordinary visuals too. The negative point goes to the cast with all the The epitome of sadistic movies. And it was good that way. The trash, the sadism and the cruelty actually gave the film a sense to the non-sensed and nutcase plot. Extraordinary visuals too. The negative point goes to the cast with all the Hollywood stars. I'd prefer less famous actors.",
      "review_date": "2009-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Frickin Amazing!!!! A couple of bad lines and bad props (the gold eye) wont even make you flinch. This is the closest think to true piece of art I have ever seen.",
      "review_date": "2005-08-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best movies I have ever seen. It was amazingly directed and so unique. The fact that there is so many hotty's in it helps, but it was the visual aspect that really impressed me. This movie in 100% getting bought.",
      "review_date": "2005-09-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The film has an excellent atmosphere and feel. The film-noir style which is achieved makes the movie all the more brilliant. It is a seamless adaptation of some of Frank Miller's comic books. Unless you're squeamish and can't The film has an excellent atmosphere and feel. The film-noir style which is achieved makes the movie all the more brilliant. It is a seamless adaptation of some of Frank Miller's comic books. Unless you're squeamish and can't stand the sight of blood and gore, it's a must-see. The dialogue is delivered smoothly and effectively. The film defines 'cool', not by the strippers and hard-men, but by their surroundings, the musical score, the monochorome~colour effects employed and visual style.",
      "review_date": "2006-04-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best movie ever made ! I can't wait to see Sin City 2!",
      "review_date": "2006-06-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best movie that tells diffrent life stories throug the eyes of others who try to survive the wild life in Sin City. This movie has great fighting scenes and great effects. Robert Rodriguez really outdone himself in this movie",
      "review_date": "2006-07-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was terrible from beginning to end. Unfortunately I watched the whole movie because I believed it would redeem itself There was no humor in it and the violence was offensive. It was completely awful.",
      "review_date": "2006-08-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you dont appreciate and really love this movie you are pathetic, maybe you know it or maybe you dont, but trust me... you are, either that or your IQ is waaaay too low.",
      "review_date": "2007-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is the perfect example of a perfect acting and directing. At first I believed that it would be one more usual movie which is totally different from the comic but when I saw it I changed my mind completely. The transfer from the This film is the perfect example of a perfect acting and directing. At first I believed that it would be one more usual movie which is totally different from the comic but when I saw it I changed my mind completely. The transfer from the comic is excellent and as fantastic is the comic so fantastic is the movie. Frank Miller remains the best!",
      "review_date": "2007-05-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "To say this movie is just visually appealing is wrong. Everything is appealing. This movie took me on a ride to and what I saw I was not disappointed with. Wow",
      "review_date": "2007-06-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just amazing... I'm stunned... The cinematography is unbelievable! One of the best movies I've seen in years.",
      "review_date": "2005-10-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Without question, the best movie adaptation of a comic book ever made (to this point). The section with Clive Owen is the weakest. Mickry Rourke gives an amazing performance. Not for the faint of heart.",
      "review_date": "2005-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Practically perfect.",
      "review_date": "2005-12-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "WOW!!!",
      "review_date": "2005-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing.",
      "review_date": "2005-06-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wow! Best movie I've seen in a while. It is what it is.",
      "review_date": "2005-08-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quite possibly the definitive guy movie. Beneath the misogynistic, teenage-fantasy grime beats a chivalrous heart. It's a riveting, blood-spattered nightmare, and you've seen it all before but never quite like this. At times Sin Quite possibly the definitive guy movie. Beneath the misogynistic, teenage-fantasy grime beats a chivalrous heart. It's a riveting, blood-spattered nightmare, and you've seen it all before but never quite like this. At times Sin City is too sicko for its own good, such as the scene that Tarentino himself directed (a dead guy talking out of his slashed throat) but the dialog is sharp and the hookers add some amusing B-movie comic relief. But wow, if your girlfriend is a feminist...just tell her you went to see Sisterhood of the Traveling Pants.",
      "review_date": "2005-08-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The styleized graphics of the movie make the whole seem better. Whie the movie had no main characters it still seems to flow very well. i beileve future movies in this series will be better. A good first try but a better cast will make a The styleized graphics of the movie make the whole seem better. Whie the movie had no main characters it still seems to flow very well. i beileve future movies in this series will be better. A good first try but a better cast will make a better movie then what was here. The action while exciting left much to be desired except with the yellow bastard. A must see if you like any of these directors or this style of movie but not if your looking for the next revolutionary movie.",
      "review_date": "2005-09-01",
      "source": "metacritic"
    }
  ],
  "num_reviews": 139
}