{
  "title": "Son of the Mask",
  "rating": 5.5,
  "release_date": "2005-02-18",
  "genre": [
    "Adventure",
    "Fantasy",
    "Comedy",
    "Family"
  ],
  "summary": "A decade after the legendary Mask of Loki wreaked havoc on the life of an unsuspecting adult, the magical mask finds its way into the possession of a child in the family comedy Son of the Mask. (New Line Cinema)",
  "critic_reviews": [
    "The characters twirl around like mini tornadoes, but between random brash moments of technological eye-tickling, Son of the Mask sags more than it spins.",
    "In actuality, it's silly fun custom-tailored for reluctant young fathers and that entire clan of 20-something man-children who still read comic books and play video games, guys who do everything possible to resist the notion of adult responsibility.",
    "While not as edgy or funny as \"The Mask,\" the popular 1994 \"original\" starring Jim Carrey, the movie offers eye-popping animation high-jinks and a warm-and-fuzzy story that reinforces what some would call family values.",
    "A harried, screechy film that goes nowhere at a breakneck pace, full of sound and furious slapstick overkill but devoid of wit.",
    "At its heart is a deep, unresolved ambivalence about child rearing.",
    "Even with a new leading man and a more family-friendly rating, some things never change: The Mask still stars Industrial Light & Magic.",
    "What the filmmakers missed in assuming the mask from the earlier film is that it was Carrey's astonishing physical comedy that made that film a hit, not the animation.",
    "What we basically have here is a license for the filmmakers to do whatever they want to do with the special effects, while the plot, like Wile E. Coyote, keeps running into the wall.",
    "The net result is a truly numbing experience.",
    "Most of the animated sequences, capably mixed with live action, leave a bad aftertaste, particularly when the ultimate fate of one beaten and battered human bystander after another is left callously unresolved. In other words, parents beware.",
    "Lacks \"spark.\"",
    "Too low-key and amiable to match the lubriciousness Jim Carrey brought to the original.",
    "Cumming's antic acting is the only asset of this boisterous comedy.",
    "Little kidniks with an appetite for zap-pow silliness might find this to their liking. Everyone else, beware.",
    "Icky and incompetent (special effects aside) in equal parts, this groaner makes 1994's \"The Mask\" look like something you'd study in a film graduate course at NYU.",
    "Doing a sequel to \"The Mask\" without Jim Carrey sounds like a really bad idea. As Son of the Mask proves, it is.",
    "A comedy so unfunny, it's tragic.",
    "Loud, mean-spirited and generally obnoxious, Son of the Mask makes the boisterous 1994 original look downright demure and refined.",
    "One presumes the only thing worse than making this disaster is actually watching it; wouldn't wish either on anyone.",
    "It's astonishing how dull a movie that packs so much visual overstimulation into its frames can be.",
    "S-s-s-smokin'? Hardly, this sequel to the 1994 Jim Carrey flick \"The Mask\" should have been snuffed out in the drawing room.",
    "At its least intolerable, the movie is a fatherhood freak-out.",
    "But for anyone who assumed Kennedy's experiment couldn't sink any lower than \"Malibu's Most Wanted,\" there are, it appears, ever deeper depths in the realm of comedic misfires.",
    "An irredeemable mess, a computer-animated Punch and Judy show without wit, heart or a single memorable performance.",
    "A witless and vulgar sequel.",
    "No doubt extensive market research shows that there's an audience out there for movies like Son Of The Mask, but it's too depressing to speculate who that might be."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Childish, unfunny, and boring.",
      "review_date": "2009-07-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie stinks! Where's Jim Carrey?!",
      "review_date": "2010-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "whats the purpose of this movie? it missed the presence of Jim Carrey from the original. this is by far the worst.",
      "review_date": "2010-10-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The worst movie I have ever seen. Not funny, lame, and Jamie Kennedy needs to realize he is not Jim Carrey and he cannot attempt the same slap stick humor it just looks so bad that you almost feel sorry for the poor looser.",
      "review_date": "2007-07-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Where's Jim Carey? He's not dead, or at least i don't think he's dead. I mean, he did eat that bomb at the end of the first one. Anyways, They needed him very badly in this film. The main problem with the whole movie that Where's Jim Carey? He's not dead, or at least i don't think he's dead. I mean, he did eat that bomb at the end of the first one. Anyways, They needed him very badly in this film. The main problem with the whole movie that I had was that they didn't really use the mask and the whole GOD thing just made it seem even stupider than it actually was.",
      "review_date": "2009-11-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "solo por un pequeño momento de risas el uno pero lo demas es un cero efectos animados muy malos chistes absurdos para lo que era la mascara de Jim Carrey",
      "review_date": "2013-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I watched this movie hoping that there would be some sign of JIm Carry, but sadly no.The special effects sucked, and what was up with Jamie Kennedy's face when he put it on. Worst movie I have ever seen",
      "review_date": "2006-09-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "To make a sequel to the Mask, you must include Jim Carrey. Or else, it just wont be the sequel to the Mask.. Pitiful.",
      "review_date": "2007-04-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love how there are either 10s or 1's as people's score. You don't see any 5s or 6s... which means you either love or hate it. i hate it. Maybe would have been ok if i was 15 years younger.",
      "review_date": "2007-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's very uncool, man. Not cool at all. Son of the Mask is beyond a shadow of a doubt one of the worst sequels of the decade. This movie may just mock Jim Carrey's absence and it nearly failed every minute of it. I love the original MaskIt's very uncool, man. Not cool at all. Son of the Mask is beyond a shadow of a doubt one of the worst sequels of the decade. This movie may just mock Jim Carrey's absence and it nearly failed every minute of it. I love the original Mask where Carrey plays a talkable Frank Sinatra or Don Corleone-like character that likes to have fun and cause so much trouble. That was one of my favorite Jim Carrey movies of all time. I certainly don't know and don't care who casts a sequel to The Mask. Jamie Kennedy, he's a great actor from the Scream movies and Malibu's Most Wanted as a white rapper that sorta look like Eminem. But playing the lead role in Son of The Mask just made a terrible example of how stupid a director should be putting this from a good-old fashion PG-13 movie for adults to bringing a family-friendly kiddie version that is still unwatchable. Maybe it's time for a reboot. Maybe it's about time we need Jim Carrey to bring back the Mask, the type of role that made him a comedic megastar just like Ace Ventura and so on.",
      "review_date": "2012-09-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a disaster movie, i don't like it!!!!!!!!!!! The Mask with Jim Carrey was much better than this part of mask!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "review_date": "2013-03-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While the movie does have a few redeeming points, I do find the movie just tries too much and too hard. Ultimately ruining itself. The potential is there, and the premise is an OK one that fits the narrative. But the execution is justWhile the movie does have a few redeeming points, I do find the movie just tries too much and too hard. Ultimately ruining itself. The potential is there, and the premise is an OK one that fits the narrative. But the execution is just horrific. How the actors could walk onto the set each day and not feel ashamed, is beyond me. I'm assuming the entire production staff were a LSD test group, making a movie on the side.\r Overall:\rIf I didn't know any better, I would have thought the movie was written  directed and produced by a 5 year old. A pointless waste of a movie.",
      "review_date": "2013-09-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Son of the Mask\" mostly looks like an horror movie due to the absence of Jim Carrey, cartoonish CGI, unfunny jokes, wooden performances and disgusting slapstick.",
      "review_date": "2014-11-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Uscito ben undici anni dopo l'originale The Mask che tanto divertì il pubblico a metà degli anni 90, questo Son of the Mask è un filmetto per famiglie che non ha nulla a che vedere con il suo fortunato prequel. Il protagonista non è più loUscito ben undici anni dopo l'originale The Mask che tanto divertì il pubblico a metà degli anni 90, questo Son of the Mask è un filmetto per famiglie che non ha nulla a che vedere con il suo fortunato prequel. Il protagonista non è più lo spassoso Jim Carrey ma un anonimo Jamie Kennedy, gli attori recitano in modo scialbo, l'ironia maliziosa ha ceduto il posto ad un senso dell'umorismo molto infantile e la trama non è nulla di particolarmente memorabile. Un sequel decisamente mal riuscito. Un vero peccato.",
      "review_date": "2015-07-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This Movie Sucks, The Mask is a classic with really funny comedy and a fun creative slapstick satire, however this replaces that all with overused drama scenes, and an infamous sperm scene",
      "review_date": "2021-06-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's not often you see a movie with all special effects and no script but this is it.",
      "review_date": "2007-10-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best movie ever made!!!!!!!! The bit where Jim carrey pushes Garfield into the sea is so good and probably the greatest movie moment of all time . I quote many lines of dialogue from it daily such as “ I hate Monday’s but I love lasagna”The best movie ever made!!!!!!!! The bit where Jim carrey pushes Garfield into the sea is so good and probably the greatest movie moment of all time . I quote many lines of dialogue from it daily such as “ I hate Monday’s but I love lasagna” and “oh boy my bones are about to hatch!!” . However easily the best part is the lightsaber fight with shrek on top of the Eiffel Tower",
      "review_date": "2020-08-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An 8 out 10...an 8 out of 10!!!??? If their was any proof that America's IQ is going down the crapper, one can look no farther than the poor souls that gave this an 8 or higher. A movie directed with all the subtlety of a jackhammer and An 8 out 10...an 8 out of 10!!!??? If their was any proof that America's IQ is going down the crapper, one can look no farther than the poor souls that gave this an 8 or higher. A movie directed with all the subtlety of a jackhammer and wit of Pauly Shore...It is pure garbage.",
      "review_date": "2007-11-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My kids want to watch this movie over and over. Very funny, crazy film.",
      "review_date": "2010-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Films are getting more and more awful by the second and this film is no exception. Its one of those films that is shot nealry entirly with a fish bowl lens and extreme closeups. The effects were awful, the acting was horrific, and the Films are getting more and more awful by the second and this film is no exception. Its one of those films that is shot nealry entirly with a fish bowl lens and extreme closeups. The effects were awful, the acting was horrific, and the cinemography story and everything else was so horid. How this got a rating of 7.8 from users is way beyond me. This film falls under the category of AVOID AT ALL COSTS!",
      "review_date": "2009-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Surprisingly funny, fun movie. The critics are way off to me. Maybe they are hung up on the absence of Jim Carrey. If you can get past that, you might really enjoy this one.",
      "review_date": "2009-03-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wow. I had avoided this movie because of the criticism but finally saw it and was blown away. Hilarious, unique, genuinely good film, albeit it's a family movie and not like the first Mask in that way. Maybe this should not have been a Wow. I had avoided this movie because of the criticism but finally saw it and was blown away. Hilarious, unique, genuinely good film, albeit it's a family movie and not like the first Mask in that way. Maybe this should not have been a Mask sequel. There's something brilliant about this picture but it seemed to get tripped up by the title and the expectations it set for Jim Carrey fans and fans of the first movie. It's so unlike the first Mask that it would have been better off if they just went with it's own title, since it's clearly it's own story and new characters. Having finally seen it, I thoroughly enjoyed it.",
      "review_date": "2009-03-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is nowhere near as good as \"The Mask\" which is my favourite movie of all time. But on it's own, it's pretty good. The absence of Jim Carrey is definitely a problem but Alan Cumming's Loki manages to fill a tiny bit of that void. TomThis is nowhere near as good as \"The Mask\" which is my favourite movie of all time. But on it's own, it's pretty good. The absence of Jim Carrey is definitely a problem but Alan Cumming's Loki manages to fill a tiny bit of that void. Tom Hiddleson will always be the best Loki but Alan Cumming is probably the second best. The scenes with the dog and the baby are pretty funny as well. The only problem with them is that the dog is shown wearing the mask during the day and night and in the first movie, the mask is only supposed to work at night.  It doesn't come close to the classic \"Mask\" but it doesn't deserve it's horrendous reputation.",
      "review_date": "2015-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "How in the world did this get away with a 6.3 user score and how come there are more positive ratings than negative ratings? This is a shameful sequel to the best Mask movie everyone will see.",
      "review_date": "2016-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Son of the mask just doesn't quite cut it with the absense of Jim Carrey and the fact that is more based on the kid's crazy stuff then the actual mask. Is not a bad thing but some jokes feel old and overall the plot and story are Son of the mask just doesn't quite cut it with the absense of Jim Carrey and the fact that is more based on the kid's crazy stuff then the actual mask. Is not a bad thing but some jokes feel old and overall the plot and story are too bland. Kids could find good things here and there but teenagers and adults won't find that much enjoyment on this one.",
      "review_date": "2005-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Anybody who says ANYTHING positive about the movie CLEARLY HAVE NOT SEEN THE MOVIE!!!!\r They're just trolls trying to give  a positive reception. They're  losers who are ruining Metacritic and the scope of human internet user knowledge.Anybody who says ANYTHING positive about the movie CLEARLY HAVE NOT SEEN THE MOVIE!!!!\r They're just trolls trying to give  a positive reception. They're  losers who are ruining Metacritic and the scope of human internet user knowledge.\r This movie is just flat out awful from start to finish.",
      "review_date": "2013-03-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Son of the Mask can stand out on its own, but it is pretty mean spirited. In the movie, it is hard to understand who is the real main character. Most of them act villainous at one time or another. The visuals are great and the story is okay,Son of the Mask can stand out on its own, but it is pretty mean spirited. In the movie, it is hard to understand who is the real main character. Most of them act villainous at one time or another. The visuals are great and the story is okay, but not great.",
      "review_date": "2012-03-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a bad movie. When it tries tp be funny ot just gets really creepy. This is one of the worst films ever made.And this film is much more family-friendly oriented and the tone is much lighter and comical. Infact Ben Stien's personalityThis is a bad movie. When it tries tp be funny ot just gets really creepy. This is one of the worst films ever made.And this film is much more family-friendly oriented and the tone is much lighter and comical. Infact Ben Stien's personality of his character explains how I was during the movie.",
      "review_date": "2014-06-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I would call this movie an \"overtly feverish onslaught of frivolity\", but I'm afraid that after watching this movie, I'm no longer intelligent enough to use such words. Bad, bad movie.",
      "review_date": "2012-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "CHRIST! The movie at times feels like it is actually trying to kill you. SO many disturbing CGI images. I don't see how any child could watch this and not get nightmares. I feel icky after seeing it....",
      "review_date": "2014-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A trite, annoying sequel to the funny original that is sorely lacking the presence of the original Mask, Jim Carrey. It may entertain the smallest demanding audiences, but it will disturb all others.",
      "review_date": "2013-08-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Oftentimes, a film you enjoyed as a kid won't be nearly as good of a watch when you are older. \"Son of the Mask\" embodies this. Believe it or not, I once enjoyed this film. Nowadays, though, I see just how unfunny, poorly-acted andOftentimes, a film you enjoyed as a kid won't be nearly as good of a watch when you are older. \"Son of the Mask\" embodies this. Believe it or not, I once enjoyed this film. Nowadays, though, I see just how unfunny, poorly-acted and poorly-designed the film really is. Though it may have potential as a diversion during \"Bad Movie Night,\" this is one you'll generally want to skip. It's simply not worth watching.",
      "review_date": "2016-11-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Son Of The Mask\" is the worst movie of all time to me. It scared the daylights out of me when it first came out back in 2005. If I was told I had to review this movie for a newspaper, I would turn it down, because there is absolutely no way\"Son Of The Mask\" is the worst movie of all time to me. It scared the daylights out of me when it first came out back in 2005. If I was told I had to review this movie for a newspaper, I would turn it down, because there is absolutely no way I am going to see \"Son Of The Mask\" without my plush Twilight Sparkle or without closing my eyes every second.",
      "review_date": "2013-11-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The second sequel to a Jim Carrey film which doesn't feature Jim Carrey serves as a reminder to always practice safe sex. Even an cartoonish alternate personality can get you pregnant.",
      "review_date": "2014-05-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A note for anyone make a sequel to a film.  Step one:  keep the lead actor.  Step two:  keep the same writer.  Step three:  keep the same director.  Step four:  keep the same age rating.\r These are the ways to not horrifically mess up aA note for anyone make a sequel to a film.  Step one:  keep the lead actor.  Step two:  keep the same writer.  Step three:  keep the same director.  Step four:  keep the same age rating.\r These are the ways to not horrifically mess up a sequel.  Every single one of my golden rules were broken and the result was this badly made, unfunny, stupidly acted waste of money.  There are two mildly amusing moments involving the baby that stopped this  rating being 0, but there is still no point whatsoever is watching this film.\r If you liked 'The Mask', don't watch this movie.  If you like comedy, don't watch this movie.  If you like life, don't watch this movie!",
      "review_date": "2014-07-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Oh no not this movie, it was likely the worst movie many people ever saw and In my opinion is really nothing like the instant classic Jim Carey movie The Mask, it seemed like this movie was aimed somewhere in between adults and children, butOh no not this movie, it was likely the worst movie many people ever saw and In my opinion is really nothing like the instant classic Jim Carey movie The Mask, it seemed like this movie was aimed somewhere in between adults and children, but everyone behind the movie kept forgetting which one he/her was trying to please.\ras a result, you will see loony tunes like scenes in this movie, dumb childish dialog, and then unintentional scary imagery, guns here and there etc. I put all that in the back of my mind for a moment and reviewed the movie as just a movie by itself, and I cant find a really good story or any real redeeming factors worth waiting for throughout the 94 minutes of pain this movie is.\r if you want to watch the worst movie made in the last decade this would be on any hard core movie goers list of worst movies...\rI really hated the acting, the script... [well let me save you readers time] the whole movie felt like the whole production team behind it was torturing me...[I'm most likely not the only one who felt this way] this movie is like bad everything only a handful of things are even passable in the film.\rplease get Jim Carey back and make a real sequel and proudly call it  THE MASK 2",
      "review_date": "2014-08-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this movie is awful with bad cgi stupid plot horrible acting and dialogue and is way to dumb!! this is easily the 2nd worst movie of all time under cat in the hat",
      "review_date": "2015-06-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The original film with Jim Carrey was a clever and hilarious film, with a very sophisticated and dynamic visual style. What a way to ruin such a fantastic film, with such a poor sequel? It does make me sad. I will give some credit, it isn'tThe original film with Jim Carrey was a clever and hilarious film, with a very sophisticated and dynamic visual style. What a way to ruin such a fantastic film, with such a poor sequel? It does make me sad. I will give some credit, it isn't quite the worst movie I have ever seen, Disaster Movie, Superbabies:Baby Geniuses 2 and Home Alone 4 were worse, but judging by how really poor the film is, that is not saying much.Let me start by saying the script was quite terrible, very clichéd and stale, with nothing new to expand from its predecessor. And the direction from Laurence Guterman, who also directed Cats and Dogs, which is much more decent, was close to incompetent. The story about the magical mask falling into the hands of a cartoonist who fathers a son is rather substandard and takes a while to get going.The special effects and animation attempts to spark some imagination, but it completely lacks the visual style that made the original so endearing to look at. Intead the whole film looks cheap in comparison and looks like it was made for TV, despite the valiant attempts of the animators to make it look good. The casting is uninspired to say the least. Jamie Kennedy as the cartoonist lacks charisma, and I will say I found the baby really creepy. Alan Cumming is a very talented actor, and has been in some great films namely the wonderful 1994 version of Black Beauty where his voice over of the beloved horse was note perfect. Here he can't do anything with his villainous role, which is so badly underwritten it's not hard to see why. And how Bob Hoskins got dragged into this I shall never know.All in all, I can see why people say this movie is bad, it is. Not just because it is not a true sequel but also it is substandard in comparison to its much superior predecessor in terms of sophistication and quality. Not quite the worst movie I have ever seen, but it is bad! 1/10 Bethany Cox",
      "review_date": "2022-03-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just gonna keep this short this is in my top 10 worst of all time list    Yeah its that bad and thats a fact",
      "review_date": "2015-08-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The law of diminishing returns dictates that sequels to bad movies are the worst movies of all, because the producers are not only working to rebottle the original non-magic, they're inevitably doomed to come up short. Even by thoseThe law of diminishing returns dictates that sequels to bad movies are the worst movies of all, because the producers are not only working to rebottle the original non-magic, they're inevitably doomed to come up short. Even by those standards, Son Of The Mask is more handicapped than most, since 1994's The Mask was a vehicle tailored to the specific talents of rubber-faced fartsmith Jim Carrey, who's wisely keeping his distance. But as with Dumb And Dumberer, another sequel to a Carrey hit minus its principal cast, New Line owns the property and has retooled it for the thumb-sucking set, so parents are advised to bust out the emergency Ritalin. It's hard to believe that beings as young and delicate as children are the target audience for such a frantic, retina-searing assault on the senses, but as pure visceral experience, Son Of The Mask borders on the experimental.\r Ally McBeal fans may want to stick around, though, because their beloved creepy computer-animated dancing baby is back, even in the ultrasound. The spawn of the title comes about when lowly cartoonist Jamie Kennedy discovers the fabled mask in his back yard and wears it to an office Hollywood party, where he turns into a whirling mass of runaway egotism and lame improvisation. The wild night ends with him impregnating his baby-crazed wife Traylor Howard, but the child really belongs to Loki, the Norse god of mischief, who wants his mask back and will stop at nothing to get it. Played by Alan Cumming, who could stand to cool off on the wacky shtick, Loki dons various unfunny disguises in pursuit of the baby while Kennedy tries to play father to an infant whose special qualities include speaking in a lucid adult voice, bouncing off the ceiling, and spraying a geyser of urine into Dad's face.\r Though his roots in sketch comedy (TV's The Jamie Kennedy Experiment) make him a natural C-list successor to Carrey, Kennedy mostly occupies the sidelines while his scrappy mutt Otis and the Elasti-baby chase each other around the house. The Scooby-Doo movies are a lesson on the perils of CGI pooches, but nothing is more chilling than a computer-enhanced infant enunciating, sprinting, or doing the Electric Slide. (The worst moment is when the baby first converts from a flesh-and-blood child to a CGI puppet—it's as if his humanity has been cruelly stolen.) No doubt extensive market research shows that there's an audience out there for movies like Son Of The Mask, but it's too depressing to speculate who that might be.",
      "review_date": "2016-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Son of the Mask can stand out on its own, but it is pretty mean spirited. In the movie, it is hard to understand who is the real main character. Most of them act villainous at one time or another. The visuals are great and the story is okay,Son of the Mask can stand out on its own, but it is pretty mean spirited. In the movie, it is hard to understand who is the real main character. Most of them act villainous at one time or another. The visuals are great and the story is okay, but not great.",
      "review_date": "2017-05-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Son of the Mask can stand out on its own, but it is pretty mean spirited. In the movie, it is hard to understand who is the real main character. Most of them act villainous at one time or another. The visuals are great and the story is okay,Son of the Mask can stand out on its own, but it is pretty mean spirited. In the movie, it is hard to understand who is the real main character. Most of them act villainous at one time or another. The visuals are great and the story is okay, but not great.",
      "review_date": "2017-05-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Son of Mask has horrific and bizarre scenes with lousy special effects, exaggerated interpretations,extremely boring and a script full of holes with no sense at all",
      "review_date": "2017-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Son of the mask has annoying characters, a dumb plot and some of the freakiest imagery a movie can offer. I loved the original mask and I still do to this day but son of the mask I try to forget as hard as possible",
      "review_date": "2017-10-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is a classic classic arcade games and I love it and it Works time of time with the big one ☝️ this is one of those beautiful girls and beautiful beautiful photos and I just play it and I play it    Disclaimer this was all a autocorrected sentence",
      "review_date": "2019-07-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Gross and creepy enough to entertained really messed up kids who will not like it anymore once they grow up.",
      "review_date": "2020-10-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I watched 30 minutes of this movie and I went to sleep, I would recommend it if you're having problems getting to sleep on the night.",
      "review_date": "2020-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just as awful as I had anticipated. With that said, it's nothing so bad that it offended me - it's simply totally and utterly bad, to the point I kinda find it hard to hate on it because I just don't have any thoughts on it. It is, withoutJust as awful as I had anticipated. With that said, it's nothing so bad that it offended me - it's simply totally and utterly bad, to the point I kinda find it hard to hate on it because I just don't have any thoughts on it. It is, without question, undoubtedly worse than 1994's 'The Mask' in every conceivable way though.Jamie Kennedy's version of this Dark Horse Comics character is truly dreadful, especially visually, though thankfully the film doesn't actually give that much air time to Kennedy as The Mask; like, he's there but it's predominantly the dog and the son that get much of the screen time alongside Alan Cumming's Loki - to slightly better effect too, the way the kid is animated kinda nearly works... it doesn't, but almost.Ryan Reynolds, according to Kennedy himself, possibly wanted this role. It's lucky Reynolds didn't get his way, or he'd be stuck with a green ghoul in his past. Oh, wait!4/10 is probably generous on my part, though there are far worse films out there that actually annoy me - 'Son of the Mask' honestly doesn't. It kinda just exists and I'm almost nonplussed about it.",
      "review_date": "2022-08-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I thoroughly enjoyed it, people are too harsh on this movie, it's very entertaining and has a good energy too it, I liked it more than the original which is also a solid movie. Very fun film, I liked it a lot.",
      "review_date": "2020-06-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good concept and story idea but performed and executed absolutely terribly and horribly.",
      "review_date": "2020-07-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "worst superhero movies ever of 2005! this movie is my least favorite movies of 2005 along with elektra",
      "review_date": "2021-03-11",
      "source": "metacritic"
    }
  ],
  "num_reviews": 77
}