{
  "title": "City Lights",
  "rating": 8.7,
  "release_date": "1931-03-07",
  "genre": [
    "Drama",
    "Comedy",
    "Romance"
  ],
  "summary": "The Tramp (Charlie Chaplin) struggles to help a blind flower girl he has fallen in love with.",
  "critic_reviews": [
    "There’s dignity and folly to The Tramp in City Lights, and everything in between.",
    "If only one of Charles Chaplin's films could be preserved, “City Lights” (1931) would come the closest to representing all the different notes of his genius. It contains the slapstick, the pathos, the pantomime, the effortless physical coordination, the melodrama, the bawdiness, the grace, and, of course, the Little Tramp--the character said, at one time, to be the most famous image on earth.",
    "Both funny and touching, this showcases Chaplin at his best.",
    "Of all Chaplin's films (with the possible exception of Modern Times), City Lights offers the fullest characterization of the Tramp. He's a loner who comes and goes almost like a dream figure or a drunken angel. Without family, friends, or a place to live, he stands outside of our reality, sometimes trying to fit in and sometimes not caring whether or not he does. Yet, like a child, he is a complete innocent with a pure heart and the best motives.",
    "We're exhausted because we laughed so much and so heartily at City Lights that we feel considerably weakened. Here's praying that we fast regain our strength so that we may journey to the George M. Cohan theatre to see Charlie again - and again - in this new heart-breaking masterpiece of comedy which he offers pantomimically to a worldful of movie-goers...City Lights is excruciatingly funny and terribly, terribly sad. It makes you chuckle hysterically. You have the greatest time imaginable, and yet, occasionally you find little hurty lumps in your throat.",
    "It was a joyous evening. Mr. Chaplin's shadow has grown no less.",
    "Its last few moments are among the most brilliant (and risky) endings in film history.",
    "A beautiful example of Chaplin's ability to turn narrative fragments into emotional wholes. The two halves of the film are sentiment and slapstick. They are not blended but woven into a pattern as eccentric as it is sublime.",
    "One of the cinema's greatest and most durable masterpieces.",
    "The first great peak in City Lights, the boxing scene, may be the most brilliant single comedy sequence of his career, not least because of the participation of Hank Mann, who plays the Tramp’s Bluto-like opponent in the ring, and Eddie Baker, who plays the referee.",
    "A paradox in City Lights is the virtually equal weight given the theme of courtly love and male camaraderie. Indeed, one of the most interesting characters in the Chaplin canon is the rich man (Harry Myers) who embraces the tramp during their nocturnal revels, but who invariably forgets their association by the dawn’s ugly light when they have sobered up.",
    "The movie exemplifies everything that was great and grating about the filmmaker’s artistry: his impeccable physical slapstick (see the boxing match) and his overreliance on embarrassing sentimentality; his intuitive understanding of the medium and frequent displays of the mammoth martyr complex that informed the comedian’s every move.",
    "It’s not Chaplin’s best picture, because the comedian has sacrificed speed to pathos, and plenty of it. This is principally the reason for the picture running some 1,500 or more feet beyond any previous film released by him. But the British comic is still the consummate pantomimist, unquestionably one of the greatest the stage or screen has ever known. Certain sequences in “City Lights” are hilarious."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Started with Modern Times and found the comic genius of Charlie Chaplin. I've seen his movies before but they were mostly a blur. Now that I have revisited them I found a newfound appreciation for this era (somewhat). From The Kid to The GoldStarted with Modern Times and found the comic genius of Charlie Chaplin. I've seen his movies before but they were mostly a blur. Now that I have revisited them I found a newfound appreciation for this era (somewhat). From The Kid to The Gold Rush, all his movies have laughs and heart, something I never thought I'd find in comedies. City Lights takes the cake for me sharing a slice of it with Modern Times.The Tramp in some scenes might come off as a booze-drinking, cigar-chomping klutz but this is only because of his selflessness that leads him into these circumstances putting him in one comedic situation to another. What I love about this movie is the relationship he develops with a blind flower girl which blossoms (pun intended) into something pure and innocent. This contrasts his relationship with the millionaire who takes him galavanting, often leading into trouble. Don't let the lack of color and spoken dialogue fool you, this movie packs a lot of heartfelt moments, further cementing Charlie Chaplin's place in cinema history. Must watch.",
      "review_date": "2020-07-03"
    },
    {
      "review_title": null,
      "content": "As much as I loved The Kid, The Gold Rush, Modern Times and The Great Dictator, City Lights is the film I consider Charlie Chaplin's masterpiece. And there are several reasons why this is so for me.I love how City Lights is filmed, onceAs much as I loved The Kid, The Gold Rush, Modern Times and The Great Dictator, City Lights is the film I consider Charlie Chaplin's masterpiece. And there are several reasons why this is so for me.I love how City Lights is filmed, once again the cinematography is stunning as are the costumes and sets. The music is also a delight(though my favourite soundtrack in a Chaplin movie is the one for Modern Times) with plenty of themes that stuck in my head, while the sound effects are wonderfully incorporated and the subtitles easy to understand. The comedy is brilliantly done, the scene in the boxing ring is not only one of my favourite scenes in a Chaplin movie(along with the final sequence and the dance of the bread rolls of The Gold Rush, the final scene of The Kid and the speech from The Great Dictator) but ever in a comedy, while there is a very touching love story between the Tramp and the little blind girl(played touchingly by Virginia Cherrill) he falls in love with. And I also found the close-up climax achingly poignant because of its beauty and ambiguity. Chaplin is superb, his pantomime skills and physical humour are extremely well judged and he is acts beautifully with Cherrill.Overall, yet another Chaplin masterpiece, yet for me this is the best of them all. 10/10 Bethany Cox",
      "review_date": "2022-03-27"
    },
    {
      "review_title": null,
      "content": "Day and night. Day and night. This is how the film travels making sure that both of them are present at once.City Lights\n\nCharlie Chaplin's boxing match is not a serious match. I know that's obvious. But it is not. Not expected. At the backDay and night. Day and night. This is how the film travels making sure that both of them are present at once.City LightsCharlie Chaplin's boxing match is not a serious match. I know that's obvious. But it is not. Not expected. At the back your thoughts, you are always waiting to get things serious. Gritty. Bloody. Brutal. Intense. And it is these films that makes us expect these things from a genre as such. Not even touching the Rocky milestone, I am just playing around Raging Bull by Martin Scorsese and Battling Butler by Michel Keaton- someone from Charlie's days itself. They've all tried to plaster the sincerity of that job on screen. You can joke around, fool around as much as you like but that sport is respected with a jarring punch when the time comes.Not to say that Charlie doesn't respect it. His method of living up to that \"dutiful\" objective is somewhat different. Nay, not different. Mature. Ahead of time. He doesn't pay homage to those heavy lifters by putting them in the ring, but does it so elegantly in the dressing room. From hard work to the stakes that are played every night on the screen, everything is mocked or more accurately notified in Charlie's dictionary. There is a sense of pride in carrying that note.And maybe that is why he has crafted such an empathetic and a low key character in the rest of the screen time. He is wreck but an adoptable one. Another thing that makes this film incredibly different than the others is the jokes. All the jokes are an elaborative comic sketches that takes energy along with time for it to work, from you. And then there is the end of the tunnel in the City Lights. A purely unconditional and innocent act that penetrates your emotion as that good old symbol of love arrow does. The birds fly and sing by merrily.",
      "review_date": "2019-10-19"
    },
    {
      "review_title": null,
      "content": "The best, GREATEST inspiring romcom movie ever made! With the best movie character ever portrayed: Charlie Chaplin as The Tramp! And the best movie score ever composed!",
      "review_date": "2019-08-23"
    },
    {
      "review_title": null,
      "content": "Muito bom, amo desde criança, sou vooooooooooooooooooooooioooooooooiioiooooooioocriado nesse filme",
      "review_date": "2019-08-24"
    },
    {
      "review_title": null,
      "content": "The very best inspiring romcom movie ever made! With the best movie character: Charlie Chaplin as The Tramp! And the best movie score ever composed! Greatly Acted",
      "review_date": "2019-08-29"
    },
    {
      "review_title": null,
      "content": "so sweet and sad on so many different levels. this could be playing with your emotions by the original way of charlie chaplin. you dont wanna miss this",
      "review_date": "2020-03-23"
    },
    {
      "review_title": null,
      "content": "Real Rating: 83.5/100This is my 3rd favourite film of Chaplin's. Modern Times and the Great Dictator, rank higher for me personally. Though to the man himself, this is his favourite film and Welles, Kubrick, Tarkovsky and Woody Allen agree.Real Rating: 83.5/100This is my 3rd favourite film of Chaplin's. Modern Times and the Great Dictator, rank higher for me personally. Though to the man himself, this is his favourite film and Welles, Kubrick, Tarkovsky and Woody Allen agree. It is strange though that Chaplin's 3 greatest works came after he was deemed obsolete, but being the artistic Luddite, he was. He pushed forward and did not allow modern technology to steal his craftsmanship. In a way, you must applaud that, but at the same time from a critical analysis standpoint, you must also detract marks for it. For is it genius? Or a has-been doing their best to cling on to a world that has moved beyond them?BE: With a Chaplin film you have to ask yourself can you really comment on the directing. Given that he does a large percentage of the workload himself, it would be like applauding Michelangelo's overseeing of the Sistine Chapel rather than the painting itself. The editing is decent, and the transitions move swiftly and give a sense of speed and the story with what limited cinematography we have for the time.W: The writing is simple but effective. Some claim that the pathos as they put it is limiting the film and not allowing it to be as good as it can be. However, we have seen the Tramp 12 times prior to this, and this is the last outing. Giving this comedic character a sense of compassion and sympathy at this stage is where the story should progress. Rather than leaving it in the purely farcical realm. We have completeness and sadness that often appears in great comedy, and from the very first scene with the Tramp and the blind girl, we have a pleasant mix of longing with pratfall comedy.C: It is 1931, and Fritz Arno Wagner is continuing to put Hollywood cinematography to shame. Meanwhile, in Hollywood, Chaplin has brought along his old standby in Roland Totheroh, and he provides the standard for a Chaplin outing. The angles on some shots are nice, and some of the shadow work is pleasant, but nothing outstanding.A: At the beginning of the film, it says it is in pantomime, which implies over the top acting and with subtly and nuance removed from the piece. Which would be fine, save for the fact that it does have these things due to the previously mentioned pathos. Which forces me to be meaner on some of the more weak acting exhibited by the rest of the crew. Chaplin is excellent and very few people have such command of body language as he. The blind girl did not always feel blind, but we are still in the early days of cinema, so it is slightly excusable. S: The opening of the film is annoying in terms of sound. We have mumbled audio from several characters, and then the Tramp appears and then silence. Which seems to imply yes films have dialogue now but let us enjoy this nostalgic throwback. Which is an excellent way of presenting the film, but in terms of audio quality, it is weak, and we could have had that same effect while presenting clear audio to the viewer. The rest is standard silent film fare.PD: The sets are sets of the era, and they took effort, but nothing stands out, especially when one knows what is coming in the 1930s in regards to set design.BA: Costume design is again very Hollywood and of the era. Nothing makes it feel all that special save for the Tramp himself.EVO: Thoroughly enjoying and while the comedy is not on par with the circus or modern times. It offers the viewer so much more and allows us to see how romantic films should be done. I kid you not. Look at most of the great romantic movies, and you will find that the romance in the film is left in the background and only adds to the overall work. Like a lovely sauce over a delicious meal. Rather than your standard romantic movie which is like eating a 15 kg bag of marshmallows in a single sitting.",
      "review_date": "2020-05-21"
    },
    {
      "review_title": null,
      "content": "It is one of the greatest not only comedy,but in general,film.It is the best film of outstanding Chaplin.The classic for all times.",
      "review_date": "2020-05-29"
    },
    {
      "review_title": null,
      "content": "As I was watching Charlie Chaplin's 'City Lights', I was watching the ups and downs of life's simplicities unfold before my eyes. The film has a sweet, funny, and charming personality that is all wrapped up with a level of class andAs I was watching Charlie Chaplin's 'City Lights', I was watching the ups and downs of life's simplicities unfold before my eyes. The film has a sweet, funny, and charming personality that is all wrapped up with a level of class and sophistication- handled masterfully by Chaplin's passion to contributing a large chunk of the film himself. 'City Lights' is unlike any other films that have come after it because it truly is rooted in delivering a story that is fueled on basic human wants and emotions. The only thing I wish was better was its pacing, and no, I don't mean that because it is a silent film that needs to use cards for dialogue, it's just that some of its scenes drag. However, all is more than forgiven because this film contains quite possibly the best concluding payoff ever put onto film. I truly mean that, the ending to this film perfectly captures raw expressions that are enough to move all who have watched this adorably funny, yet poignant, adventure. Bravo!",
      "review_date": "2021-08-21"
    },
    {
      "review_title": null,
      "content": "Watching this gem reminds you that Chaplin's true greatness lie not in his oustanding humor, but in his humanity. Here, he delivers a heartfelt story that at no point feels manipulative or contrived, even viewing it from a modern lens ofWatching this gem reminds you that Chaplin's true greatness lie not in his oustanding humor, but in his humanity. Here, he delivers a heartfelt story that at no point feels manipulative or contrived, even viewing it from a modern lens of emotional overload. \"City Lights\" is his Chaplin at his most human. He transcended the medium with silence (even when sound was available) and showed the world what cinema is capable of with moving pictures.",
      "review_date": "2021-10-25"
    },
    {
      "review_title": null,
      "content": "Hello, this is a default review because i'm forced to use 75 characters. I'll edit this review in the future talking about the game, don't worry ;)My final rate is: 10",
      "review_date": "2023-01-26"
    }
  ],
  "num_reviews": 25
}