{
  "title": "Frankenstein",
  "rating": 8.2,
  "release_date": "1931-11-21",
  "genre": [
    "Sci-Fi",
    "Drama",
    "Horror"
  ],
  "summary": "An obsessed scientist assembles a living being from parts of exhumed corpses.",
  "critic_reviews": [
    "One of the most deservedly famous and chilling horror films of all time.",
    "Beautiful photography, a heartbreaking story, and iconic moments from beginning to end. Absolutely unmissable.",
    "The most influential horror film ever made, this stark and stylish work has a weird fairytale beauty. Boris Karloff gives one of the most indelible performances in American cinema as the monster, misjudged by the society that created him, at once terrifying and pathetic, a moving study of alienation and primitive anger.",
    "Nothing can detract from the power of the most influential monster movie ever made.",
    "Frankenstein works as a fast-moving thriller and, even now, a stylish, frighteningly atmospheric horror film, but also as a sad outcast parable. Frankenstein's creature may be a monstrosity, but he's also instantly sympathetic to anyone who's ever felt like a misfit.",
    "Whale’s direction nods to German Expressionism — the Escher-like dimensions of Dr. Frankenstein’s laboratory, the off-kilter camera angles, the long-armed shadows that extend over characters’ faces. Yet something softer anchors the film: sorrow.",
    "As much as the later movies diluted the character of the Frankenstein creature, nothing could blunt the impact made by Karloff in the role of the most memorable movie monster of all time.",
    "James Whale has done a great job in his direction. This is not an easy thing to direct — just how far to go in playing upon an audience's credulity, it's sympathy, it's nerves. Whale seems to have gone far enough, but not too far.",
    "Universal entrusted the direction of Frankenstein to James Whale. He did it in the Grand Guignol manner, with as many queer sounds, dark corners, false faces and cellar stairs as could possibly be inserted.",
    "Looks like a Dracula plus, touching a new peak in horror plays and handled in production with supreme craftsmanship.",
    "A stark, solid, impressively stylish film.",
    "It is naturally a morbid, gruesome affair, but it is something to keep the spectator awake, for during its most spine-chilling periods it exacts attention."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Es un buen clásico, de eso no hay duda, pero en mi opinión está lejos de ser tan espectacular como muchos la consideran.",
      "review_date": "2020-06-08"
    },
    {
      "review_title": null,
      "content": "I don't necessarily think it's a bad movie, I just had a hard time getting into it. I thought the pacing was slow. It felt like there were parts of the movie just skipped over due to the odd fade to black moments throughout. It doesn't age asI don't necessarily think it's a bad movie, I just had a hard time getting into it. I thought the pacing was slow. It felt like there were parts of the movie just skipped over due to the odd fade to black moments throughout. It doesn't age as well as you would hope it would, at least in comparison to other universal monster movies.",
      "review_date": "2020-02-21"
    },
    {
      "review_title": null,
      "content": "This is a classic movie that you never gets old.This made Boris Karloff horror icon!This is a movie that the whole family can watch. It might be too intense for younger children.",
      "review_date": "2019-06-15"
    },
    {
      "review_title": null,
      "content": "There have been complaints that Frankenstein is dated. Personally I don't find that, it isn't the most sumptuous of all films, but it is still a wonderful film, that is still shocking and enthralling to me. The Gothic set design is veryThere have been complaints that Frankenstein is dated. Personally I don't find that, it isn't the most sumptuous of all films, but it is still a wonderful film, that is still shocking and enthralling to me. The Gothic set design is very imaginative, helped by the beautiful cinematography with suitably bizarre camera angles, and the music score is haunting, melancholy and atmospheric. James Whale's direction is also very impressive, it is very focused and innovative. The story is without a doubt a classic, tense, moody and melancholic, and the Monster itself is just a masterful creation. The cast are superb, Colin Clive is very good as the eccentric Henry Frankenstein, while Mae Clarke is an alluring and sympathetic Elizabeth. There is no doubt in my mind though that Boris Karloff gave the best performance, not only that but the definitive portrayal of the monster. He is almost unrecognisable and scary with his make up, and while he was scary with the towering presence and the frightening look in his eyes, his monster is also somewhat touching, particularly when he reaches up to grasp a ray of sunlight. Overall, shocking, enthralling and just wonderful. \"It's Alive!\" 10/10 Bethany Cox",
      "review_date": "2022-03-14"
    },
    {
      "review_title": null,
      "content": "I watched it this Halloween season (2022)...and it's still a good movie.Short, beautiful black and white glory, a classic.Better than Dracula in my opinion",
      "review_date": "2022-11-03"
    },
    {
      "review_title": null,
      "content": "At side of Nosferatu and Dr. Jekyll & Mr. Hyde, a pioneer of terror genre. The screenplay isn't quite faithful to Mary Shelley book, but you can forgive due the detail of who is the monster: the creature or the creator. Despite it's 90 yearsAt side of Nosferatu and Dr. Jekyll & Mr. Hyde, a pioneer of terror genre. The screenplay isn't quite faithful to Mary Shelley book, but you can forgive due the detail of who is the monster: the creature or the creator. Despite it's 90 years old, still is ghastly due the presence of Boris Karloff.",
      "review_date": "2019-11-17"
    },
    {
      "review_title": null,
      "content": "Some films are more valuable for the inheritance they leave. This film, one of the most classic among the classics of horror cinema, is one such case. I don't know if it's really worth summarizing the script because almost everyone, evenSome films are more valuable for the inheritance they leave. This film, one of the most classic among the classics of horror cinema, is one such case. I don't know if it's really worth summarizing the script because almost everyone, even those who haven't read the novel, knows the story of Victor Frankenstein, a notable doctor and scientist who lets himself be obsessed with the idea of creating life by his own hands and using electricity to give life to a being made up of pieces of several human bodies. The film fails to recreate the controversial and morally challenging story, written by Mary Shelley in the midst of a snowstorm in Switzerland, and makes very little use of the original material. But it has the merit of bringing to life one of the most popular and revisited creatures in horror cinema for cinema, and of giving us the impeccable work of one of the actors who most competently brought her to the screen: Boris Karloff.Karloff was an anonymous actor before this film and I doubt if he was aware of the impact and the strength he was going to have. After all, Bela Lugosi himself, who was the great horror actor at the time thanks to the way he had given life to Count Dracula (another monstrous character with whom the Frankenstein Monster will meet many times, in several films), had ended to refuse the role of the monster! Karloff does the work of a lifetime in this film, and jumps into immortality. He is so striking that the following actors who brought the Monster to life basically limited themselves to copying the actor's work, manners and physical appearance. And all of this, be amazed, without saying virtually a syllable! The entire remaining cast was overshadowed, including Colin Clive, who played Dr. Frankenstein.The film is also a pearl when it comes to technical aspects, although it is not brilliant or particularly well done. The landscapes are outlined, all the scenarios are summed up to the essential, occasionally covered with artificial dust, visibly false spider webs and other resources that are basic to us, but were good at the time. Black-and-white cinematography works well and looks elegant, and the work of make-up (of the Monster, of course) and costume fulfills its role with pride and distinction.",
      "review_date": "2020-11-15"
    }
  ],
  "num_reviews": 19
}