{
  "title": "Airplane!",
  "rating": 7.9,
  "release_date": "1980-07-02",
  "summary": "A straight-faced yet absurdist comedy about a burned out lovelorn ex-pilot is pressed into service when an airliner's crew succumbs to food poisoning.",
  "critic_reviews": [
    "The really great thing about Airplane! is that the jokes undercut your expectations so deftly, right down to the sour air traffic controller called Stack. When it's suggested that he turns on the landing lights on the runway, he snaps back: \"That's just what they're expecting us to do.\"",
    "The distinguishing feature of what many people consider to be the funniest movie ever made is the sheer number of gags.",
    "The spoof that launched a thousand parodies – this is the one that's 100% funny.",
    "At a time when throwaway gags seem like a luxury in any film, Airplane! has jokes—hilarious jokes—to spare. It's also clever and confident and furiously energetic, and it has the two most sadly neglected selling points any movie could want right now: it's brief (only eighty-eight minutes), and it looks inexpensive (it cost about three million dollars) without looking cheap. Airplane! is more than a pleasant surprise, in the midst of this dim movie season. As a remedy for the bloated self-importance of too many other current efforts, it's just what the doctor ordered.",
    "The humor is an ingenious concoction of satire, spoof, burlesque, slapstick, raunchy dialogue and low-comedy sight gags. The jokes are directed at sex, politics, religion and almost everything else. The level of humor is not always consistent, but the filmmakers have thrown almost everything in with a shotgun approach and the routines work more often than not.",
    "Airplane! is a splendidly tacky, totally tasteless, completely insignificant flight, a gooney bird of a movie that looks as if it could never get off the ground and then surprises and delights with its free-spirited aerobatics.",
    "Airplane! is what they used to call a laff-riot. Made by team which turned out Kentucky Fried Movie, this spoof of disaster features beats any other film for sheer number of comic gags.",
    "The onslaught of one-liners and sight gags in AIRPLANE! is so relentless that even the most dour viewer is ultimately won over--or exhausted.",
    "The hits outnumber the misses well enough in Airplane!, especially in the first half, when the Zucker-Abrahams-Zucker team (writer-directors David Zucker, Jim Abrahams, and Jerry Zucker) are layering jokes in the foreground and background. There are parodies of popular favorites like Jaws and Saturday Night Fever, wacky stock footage on back-screen projection, slapstick violence against various religious solicitors, and plenty of silly wordplay.",
    "If you get half of the jokes flung your way, and laugh at half of those you’re still in much better shape than the very best episode of Three’s Company. If you truly study this movie and love it all, you probably haven’t done much with your life, but at least you’re smiling.",
    "It is sophomoric, obvious, predictable, corny, and quite often very funny. And the reason it's funny is frequently because it's sophomoric, predictable, corny, etc. Example: Airplane Captain (Peter Graves): Surely you can't be serious. Doctor (Leslie Nielsen): I am serious. And don’t call me Shirley. This sort of humor went out with Milton Berle, Jerry Lewis, and knock-knock jokes. That's why it's so funny.",
    "There are also plenty of background sight gags that often go unnoticed on a first viewing.",
    "The punchlines come quick and thick, with little foreplay or consideration for anything other than getting a physical reaction from the audience.",
    "The film is funny in a way few of these toothless exercises are. The gags aren't exactly clever, but there are a lot of them, and the cutting finds a fast, effective tempo. Joe Biroc's witty cinematography gives the picture an authentically flat, artificial Universal look, and Lloyd Bridges, Peter Graves, Leslie Nielsen, and Robert Stack are around for added iconographical persuasiveness.",
    "It should be disastrous. But psycho ground controllers (Stack and Bridges), laff-a-second pace, and bludgeoning innuendo make this the acceptable face of the locker-room satire.",
    "Airplane loses its buoyancy. Jim Abrahams, David Zucker and Jerry Zucker, who share both writing and directorial credits, become so desperate for laughs that the jokes descend to a much cruder level. And Airplane does an abrupt nosedive, turning a hopelessly flat movie, sparked only by the occasional appearances of Lloyd Bridges as an easily rattled air traffic controller whose nerves are such he depends on booze and pills to keep himself going on the job."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "There needs to be a scientific study into how this film stays so consistently funny for so long. It's actually baffling that a film like this can even exist.",
      "review_date": "2017-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One Of The Best Parody FilmsAirplane! is clever, funny, excellently written, and very memorable.",
      "review_date": "2020-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great humour with a lot of hints to so many things. Classic movie, that never gets old.",
      "review_date": "2019-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "According to Superman, flying is the safest means of travel. Or not? This parody of the catastrophe movies that were trending in the increasingly distant 70s, is the pioneer of slapstick comedies from which many imitations would emerge.According to Superman, flying is the safest means of travel. Or not? This parody of the catastrophe movies that were trending in the increasingly distant 70s, is the pioneer of slapstick comedies from which many imitations would emerge. Despite the years it's been around, some jokes are still effective.",
      "review_date": "2021-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "we're falling..Airplane!\n\nIts cheeky slick fun to a point where one finds itself laughing to the most redicule thing that if being thought about, comes out smarter than it seems. The gags still works like a charm that is hand over to eachwe're falling..Airplane!Its cheeky slick fun to a point where one finds itself laughing to the most redicule thing that if being thought about, comes out smarter than it seems. The gags still works like a charm that is hand over to each individual amusing characters who invests equally as the writers have. Jim Abrahams, David and Jerry Zucker; the writer-director, are putting all their chips in and wins over the audience without much effort. The cast has done a decent work and have stucked to their sketchy characters throughout the course of it. Airplane! has many strength where the writing being the core one, but that doesn't mean that it always works in its favor for there are some sequences where the makers blurred out between fun and stupid which is the only weakness in this feature.",
      "review_date": "2018-05-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of THE funniest movies I have ever seen. The perfect marriage of comedy and suspense. Oh, by the way, stop calling me Shirley!",
      "review_date": "2019-10-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is a bit of a classic, well known for being quite over the top but in a comic sort of a way - from the very start, it has the visual look and feel (music and visually speaking, with large, blocky text appearing boldly on screen) ofThis film is a bit of a classic, well known for being quite over the top but in a comic sort of a way - from the very start, it has the visual look and feel (music and visually speaking, with large, blocky text appearing boldly on screen) of an impending disaster film - indeed it could be thought of as a satire on disaster films but most certainly a comedy based one. It features very wacky, somewhat eccentric comedy and its certainly one of my favourite comedy films. The comedy is so random at times, I can't help but laugh at it - Its one of quite a few films that I've seen on more than one ocassion, mostly I just stick to watching new films but when my TiVo box recorded this film as I'd stated that I like Leslie Neilson films, I decided to keep the recording and watch it again - I think I saw it some years back. I try my best not to be too biased - it takes quite a lot to not have any criticisms at all or to give a film a full 5 star rating.From early on, I noticed there were some potentially offensive stereotypes - I knew it was a little cliched, after all it dates back to 1980 but there was one scene featuring a couple of presumably African Americans talking in a somewhat strong dialect, with subtitles providing an upper class/aristocratic version of what they were saying, which I didn't find one of the more amusing moments, as I, personally, could understand most of what was being said and it felt perhaps a little too sneary. There are also moments features women which some may find somewhat distasteful, although I wasn't too bothered about them personally. The air stewardesses are portrayed as dolly birds - pretty much all of the characters are made fun of in one way or another, so we're encouraged to laugh at them, more than with them and in a sense that made it seem somewhat less offensive in the few moments that were a little close to the bone perhaps. It is very much an absurdist style film - perhaps slightly like Sacha Baron Cohen's films, also featuring very exaggerated comic people, although with his films he tends to mock people who perhaps don't seem to be best keen on it, shall we say. Its also somewhat like the Police Academy films, in terms of the slapstick comedy used, although I personally find it funnier than most of the Police Academy films.The comedy is present both in terms of the sometimes witty dialogue and its also conveyed via some surreal visual elements. There is also narration present at times and it varies from time to time, in terms of which character is voicing the narration. Cast wise, the film stars Lloyd Bridges as Steve McCroskey (the head of air control), Robert Hayes as Ted Striker and, of course, Leslie Nielson as Dr. Rumack. Leslie is at his quick witted best, although he seems a little more straight faced compared to other actors who have acted in similar films (for example Jim Carrey or maybe Adam Sandler). The fact that he appears so serious when dealing with frankly ludicrously surreal scenarios seemed to make it more funny. Other cast members present include Peter Graves as Captain Clarence Oveur, a very laidback, professional seeming pilot and Julie Heggerty as Elaine Dickinson. Content wise, this film features partial nudity, sex references and implied sex scenes, plus a character who asks sexually suggestive questions to a young boy (presumably a paedophile?), which some may find offensive. There is (mostly comedic styled) violence, nothing especially graphic but it does include various characters attempting suicide to get out of a certain apparently intolerable situation and there are some fist fight type scenes, although there is nothing particularly graphic or overly bloody shown. There are also drug references and a scene featuring someone snorting illegal drugs. There are some mild profanities uttered but no especially graphic language as such. The film was originally given a 15 rating due to the content but I believe it now carries a 12a rating.Music wise, I felt that, at times, the incidental music was a bit too loud, in that it made it a bit difficult to fully follow the dialogue on screen at the time. It does feature quite a heavy use of tense sounding instrumental incidental music (try saying instrumental incidental multiple times in a row(!!) at times, which I found to be a bit distracting at times.All in all, I still enjoyed watching this film again overall but I concede that it has some elements which will put off some people, or otherwise that it won't suit everyone. It is quite witty in parts but other parts I felt were perhaps poorly judged, certainly by todays standards anyway. To be fair, its certainly not a film that takes itself too seriously, or even seriously at all I suppose - as a parody of disaster films, it does well, poking fun at some of the relevant cliches and I liked the mix of dialogue based comedy and visual comedy but it won't appeal to everyone, hence my overall rating.",
      "review_date": "2021-11-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Honestly right, this has to be one of my favourite comedy movies, the reasons on why it's so good is because of the actors, they always give a good performance in this movie and every character made me laugh in some way or another. Also, thisHonestly right, this has to be one of my favourite comedy movies, the reasons on why it's so good is because of the actors, they always give a good performance in this movie and every character made me laugh in some way or another. Also, this movies got some great gags and it passed the time, its worth the watch if you haven't already watched this hilarious movie before.",
      "review_date": "2020-04-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic and a go to for all spoof movies till this day.Laugh out loud jokes, memorable characters and sound bites that are still quoted today.",
      "review_date": "2021-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very funny, sometimes hilarious film that runs out of ideas towards the end.",
      "review_date": "2020-02-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Airplane! perhaps one of the best comedies in cinema. The film is a standard in which the abserd is brought to the level of farce. First of all, this is a chamber film, and this is not a simple genre that puts screenwriters in a not simpleAirplane! perhaps one of the best comedies in cinema. The film is a standard in which the abserd is brought to the level of farce. First of all, this is a chamber film, and this is not a simple genre that puts screenwriters in a not simple position. But the Zucker brothers will really mix the viewer in a childish way. The film is still relevant for more than 40 years.",
      "review_date": "2022-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film never get old.  It's just as funny as it was the first time I watched it.",
      "review_date": "2018-11-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Say what you want about how offensive this movie can get today, just realize that it was made in 1980. This film is by far the funniest I've seen and it just seems unnatural to how funny it can stay every time you watch it.",
      "review_date": "2019-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a really funny movie only in english, the story it's trash but they want it like this. -BETTER TO WATCH IT OVER THE AGE OF 8y-Trama:8/10kids:6/10adults:10/10",
      "review_date": "2021-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A film from the golden era of American comedies. It's almost unbelievable, but the film is made in such a way that you can't find anyone who wouldn't laugh at the humour in this film.The film is built on people taking everything tooA film from the golden era of American comedies. It's almost unbelievable, but the film is made in such a way that you can't find anyone who wouldn't laugh at the humour in this film.The film is built on people taking everything too literally. Simple, cute and above all funny.I'm not going to pick out the funniest moments of the film here, because I'd have to retell the whole movie, and I don't want to. Please find an hour and a half of free time some evening to devote to this gem from a bygone era. 8/10",
      "review_date": "2022-01-24",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 32,
  "genres": [
    "Comedy"
  ]
}