{
  "title": "Ordinary People",
  "rating": 6.7,
  "release_date": "1980-09-18",
  "genre": [
    "Drama"
  ],
  "summary": "In Robert Redford's directorial debut, the accidental death of the older son of an affluent family deeply strains the relationships among the austere mother (Mary Tyler Moore), the compassionate, well-meaning father (Donald Sutherland), and the guilt-ridden younger son (Timothy Hutton).",
  "critic_reviews": [
    "Each character in this movie is given the dramatic opportunity to look inside himself, to question his own motives as well as the motives of others, and to try to improve his own ways of dealing with a troubled situation. Two of the characters do learn how to adjust; the third doesn't. It's not often we get characters who face those kinds of challenges on the screen, nor directors who seek them out. Ordinary People is an intelligent, perceptive, and deeply moving film.",
    "A moving, intelligent and funny film about disasters that are commonplace to everyone except the people who experience them. Not since Robert Benton's \"Kramer vs. Kramer\" has there been a movie that so effectively catches the look, sound and temper of a particular kind of American existence.",
    "An austere and delicate examination of the ways in which a likable family falters under pressure and struggles, with ambiguous results, to renew itself. This is not very show-bizzy stuff, but for once, a movie star has used his power to create not light entertainment or a trendy political statement, but a work that addresses itself quietly and intelligently to issues everyone who attempts to raise children must face.",
    "A powerfully intimate domestic drama, Ordinary People represents the height of craftsmanship across the board.",
    "It is nearly impossible to look at this brilliantly executed movie without being moved to tears.",
    "It never exploits its characters or demands their way of living. For all the hidden misery it uncovers, it remains compassionate and humane from first scene to last.",
    "This is thoughtful and beautifully observed work, from the social backdrop and the tell-me-what-you're-feeling analysis sessions to the painful performances including Mary Tyler Moore playing against type as the chillingly repressed mother.",
    "An actors' movie and an advert for therapy, extremely bitter, but handsomely directed in its elegant pretentiousness, it leaves you the impression that Redford is, despite it all, as cuddly as a teddy-bear.",
    "Whatever social statement Ordinary People was making about its time has evaporated during the intervening years, leaving behind an open, honest drama lacking the emotional punch that would make it unforgettable today. Ordinary People should be devastating, but it's not. By any standards, it's still a good movie, but three decades have stripped away any pretense of greatness. [21 Feb 1999]",
    "Although the story is admittedly slight, Redford demonstrates a tremendous understanding of his subjects, wealthy white suburbanites who struggle to conceal the rage and fear that eats away at them. His quiet, gentle direction is epitomized in memorably painful moments, such as the famous photo scene, when the squelched feelings threaten to explode.",
    "The film is an admirable argument for the legitimacy of psychotherapy, especially for the time, played out in an affluent Chicago suburb.",
    "The film looks austere and serious, rather as if it had been shot inside a Frigidaire, and the oppressiveness of the images tends to strangle laughter, even at the most absurd excesses of Alvin Sargent's script."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "An absolutely blunt, realistic portrayal of American families. The story of how one seemingly 'perfect' family falls into despair as a string of tragedies befall them. Timothy Hutton and Mary Tyler Moore act out in two of what seems to be theAn absolutely blunt, realistic portrayal of American families. The story of how one seemingly 'perfect' family falls into despair as a string of tragedies befall them. Timothy Hutton and Mary Tyler Moore act out in two of what seems to be the perfect performances of the late 20th century. Donald Sutherland is the one who plays the most normal of the family, but Hutton and Tyler Moore have such a complexity to their respective roles it's impossible to believe she didn't win and he only received Best Supporting Actor, but I guess it's better than losing to De Niro in Raging Bull. I don't understand how he hasn't done anything at all recently.",
      "review_date": "2014-01-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Such a great film,.Although its reputation not deserving its best film oscar, no family drama has been  this good. Redford may not be the greatest director. However he certainly knows how to analyse a dysfunctional drama. Mary Tylor Moore isSuch a great film,.Although its reputation not deserving its best film oscar, no family drama has been  this good. Redford may not be the greatest director. However he certainly knows how to analyse a dysfunctional drama. Mary Tylor Moore is fantastic while Timothy Hutton deserves his oscar as Conrad.",
      "review_date": "2014-07-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In 1981 Timothy Hutton won the Oscar for Best Supporting Actor for ORDINARY PEOPLE, the first movie directed by Robert Redford. The problem is... Hutton's character, Conrad Jarrett, was the protagonist of the story, so he should have won theIn 1981 Timothy Hutton won the Oscar for Best Supporting Actor for ORDINARY PEOPLE, the first movie directed by Robert Redford. The problem is... Hutton's character, Conrad Jarrett, was the protagonist of the story, so he should have won the Oscar for Best Actor! It looks like the Academy Awards' jury didn't want to act rudely towards Donald Sutherland, playing the role of Hutton's father, thus an actor much older than the 20 year old Timothy. Let's say that this was a severe case of excessive politeness. I hope Timothy Hutton again finds a movie as powerful as Ordinary People, and to finally win the Oscar he deserves.",
      "review_date": "2015-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "not so ordinary and not so people-alike..Ordinary People\n\n3 And A Half Out Of 5\n\nOrdinary People is a plot driven feature about a writhing family that may or may not remain stable for a longer period and the journey that has got them here.not so ordinary and not so people-alike..Ordinary People3 And A Half Out Of 5Ordinary People is a plot driven feature about a writhing family that may or may not remain stable for a longer period and the journey that has got them here. The scrutiny justifies the hype that is offered in here and not because of its complexity but its layered material that it brings along with it whether then it be its unexpected consequences or eerie perspective. It is short on technical aspects like background score, art design, sound department and cinematography although is perfectly edited. The writing is strong if not gripping, it's thought-provoking and intriguing enough to keep the audience invested in it. The adapted screenplay by Alvin Sargent is smart and has covered adequately every bits of the material without stretching it or over-stuffing it. Robert Redford; the director has done a decent work on pulling off this burdened dysfunctional family and their day-to-day life that is clearly not mundane. The performance by the lead cast is plausible like Donald Sutherland and Mary Tyler Moore who are supported nicely by Timothy Hutton and Judd Hirsch. Ordinary People is not so ordinary and not so people-like and yet is grounded with humane emotions and actions that helps the audience connect with them swiftly.",
      "review_date": "2018-07-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Slow paced but moving drama with superior cinematography and intelligent screenplay. The superior cast elevate the basic plot.",
      "review_date": "2022-12-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Robert Redford le mauvais acteur, s'est mis à la réalisation et il a sévi plusieurs fois à cet égard... il s'est spécialisé dans le genre nunuche à deux de tension et tous ses films se ressemblent et se rassemblent sous la bannière de laRobert Redford le mauvais acteur, s'est mis à la réalisation et il a sévi plusieurs fois à cet égard... il s'est spécialisé dans le genre nunuche à deux de tension et tous ses films se ressemblent et se rassemblent sous la bannière de la niaiserie, de l'hébétude et du drame à la petite semaine plus ou moins sirupeux...Ainsi, ce premier film n'est-il qu'un vague téléfilm à deux balles qui a pour cadre un psychodrame familial dont l'ennui et la lourdeur dépassent largement la guimauve qu'il tente d'y insuffler. Il a étalé, il a étiré au maximum ce qui ne peut pas l'être ou ce qui tiendrait à peine en un épisode de télénovela ou de Santa Barbara (ça te barbera...).D'ailleurs, on ne sait pas pourquoi on regarde ça ni pourquoi on devrait regarder ça, car ça sonne tellement creux, c'est si ridicule qu'on arrive pas à y croire... On reste là, sidéré, mortifié devant tant de vide, un vide que Robert tente de meubler comme un crevard pendant deux plombes !",
      "review_date": "2018-10-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'd just said a few days ago that Quiz Show is Robert Redford's best film to date and I stand by that statement, even though this is also a very good film.But that's not the point, the point is that I need someone to explain to me how thisI'd just said a few days ago that Quiz Show is Robert Redford's best film to date and I stand by that statement, even though this is also a very good film.But that's not the point, the point is that I need someone to explain to me how this film was considered in any way superior to The Elephant Man and Raging Bull in the Oscars and how the hell Redford won the director's award over Lynch, Scorsese and Polanski.",
      "review_date": "2020-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is supposed to reflect psychological disturbances of a boy who lost his brother in a small sailing boat in a stormy sea, and he feels responsible, and guilty for the loss of him.And then his mother's looses her affection againstThis movie is supposed to reflect psychological disturbances of a boy who lost his brother in a small sailing boat in a stormy sea, and he feels responsible, and guilty for the loss of him.And then his mother's looses her affection against her husband and younger son after death her elder son.Psychological disturbance of the boy as a result of guilt feeling is not convincing.Mother displays a character of an order freak at home, and acts like a resentful robot against her son.All acting in this movie looks amateurish. And plots are sooo boring.From the beginning to end, for every actor, one feels that casting was wrong. No one is impressive. And I remember of nothing of the soundtrack if there was one.",
      "review_date": "2021-09-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the greatest family drama of all time. Just think they made the mother the villain! Talk about taking a chance. Besides Elliott in ET, Timothy Hutton gives the greatest juvenile performance of all time. I mean come on, he won theThis is the greatest family drama of all time. Just think they made the mother the villain! Talk about taking a chance. Besides Elliott in ET, Timothy Hutton gives the greatest juvenile performance of all time. I mean come on, he won the Oscar. Mary Tyler Moore took such a chance taking this role. This beat Raging Bull for the Best Picture Oscar, and why? Because it made people feel, deeply. The ending comes out of nowhere. Kramer vs. Kramer and American Beauty don't even come close to this FILM.",
      "review_date": "2021-05-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is short on technical aspects like background score, art design, sound department and cinematography although is perfectly edited.$1 to buy a Netflix account, Google search: vtvshare",
      "review_date": "2022-08-11",
      "source": "metacritic"
    }
  ],
  "num_reviews": 22
}