{
  "title": "The Blues Brothers",
  "rating": 8.3,
  "release_date": "1980-06-20",
  "summary": "Jake Blues, just out from prison, puts together his old band to save the Catholic home where he and brother Elwood were raised.",
  "critic_reviews": [
    "The film also has stunning car chases, choreographed like the dancing in a musical, as the Blues Brothers are pursued throughout Chicago, at one point even tearing through a shopping mall, in their 'Bluesmobile', a retired 1974 Mount Prospect, Illinois Dodge Monaco patrol car.",
    "The stunts are still awe-inspiring, and there's plenty of laughs. They really were thinking big.",
    "And then, of course, there was the music, better music than any film had had for many years.",
    "What's a little startling about this movie is that all of this works. The Blues Brothers cost untold millions of dollars and kept threatening to grow completely out of control. But director John Landis (of “Animal House”) has somehow pulled it together, with a good deal of help from the strongly defined personalities of the title characters. Belushi and Aykroyd come over as hard-boiled city guys, total cynics with a world-view of sublime simplicity, and that all fits perfectly with the movie's other parts. There's even room, in the midst of the carnage and mayhem, for a surprising amount of grace, humor, and whimsy.",
    "That Dan Aykroyd and John Belushi adore this music is not in question – it’s lovingly chosen and brilliantly performed – but the film sometimes feels like a work of cultural tourism, particularly in scenes set in a gospel church and a Chicago street market. These lively musical sequences also sit awkwardly with director John Landis’s bizarre predilection for wholesale destruction: sure, smashing up cop cars can be fun, but Landis takes things to a tiresome extreme.",
    "If Universal had made it 35 years earlier, The Blues Brothers might have been called Abbott & Costello in Soul Town. Level of inspiration is about the same now as then, the humor as basic, the enjoyment as fleeting. But at $30 million, this is a whole new ball-game.",
    "THE BLUES BROTHERS is a monument to waste, noise and misplaced cool, but it does have its engagingly nutty moments.",
    "There are parts of The Blues Brothers that would have played infinitely better with a knock-about feeling, a sloppiness like that of \"Animal House.\" As it is, the movie is airless. The stakes needn't have been so suffocatingly high.",
    "John Belushi and Dan Aykroyd star as two white boys who love nuns, blacks, and the blues. But for all of the dramatic focus on poverty, the subject of John Landis's mise-en-scene is money—making it, spending it, blowing it away. The humor is predicated on underplaying in overscaled situations, which is sporadically funny in a Keaton-esque way but soon sputters out through sheer, uninspired repetition.",
    "Landis seems no surer of his visual style than he does of his movie's tone, so he tries everything: shots angled from a dog's-or a god's-eye view, eerily lighted special effects, more dancers, more extras, more noise, more cars and car crashes. Alas, more is less, and The Blues Brothers ends up totaling itself.",
    "Ironically, the stars didn't get it together either. The Blues Brothers offers the melancholy spectacle of them sinking deeper and deeper into a comic grave."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I've probably seen this movie 30 times in my life.  So many amazing cameos, so many amazing music sequences, and so many amazing car chases make this one of the all-time best.  You have to love the rate Charles sequence, with all the dancingI've probably seen this movie 30 times in my life.  So many amazing cameos, so many amazing music sequences, and so many amazing car chases make this one of the all-time best.  You have to love the rate Charles sequence, with all the dancing out in front of the music shop.  And the Rawhide sequence?  Brilliant. John Belushi is at his near peak best in this film second only perhaps to animal house.",
      "review_date": "2017-05-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Alright, well, here this goes. No, I didn't really like \"The Blues Brothers.\" And that's okay. I don't have to like every movie widely regarded as a classic of the American cinematic arts. In fact, I can plainly see why this one is soAlright, well, here this goes. No, I didn't really like \"The Blues Brothers.\" And that's okay. I don't have to like every movie widely regarded as a classic of the American cinematic arts. In fact, I can plainly see why this one is so sweepingly adored. The infectious dance numbers, the joy-inducing cameos, the bombastic set pieces. It's all fairly enjoyable and - in fact - I enjoyed a lot of it. It's just that, even though there's a general throughline here, there's also this episodic nature to the majority of the second act that didn't really dazzle me in any way. Jake and Elwood have to go to X place and get X person to do X, they do it, and then have to go to X place and get X person to do X as well. It's all too piecemeal for my tastes. But, again, there's still a lot here to be enjoyed and \"enjoy\" I did (for the most part).",
      "review_date": "2017-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic fusion of cast, setting, music and direction makes this an almost ageless slice of entertainment.",
      "review_date": "2022-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The cult classic with one of the best if not best score in movie history. They got so many great artist (some would say legends) like Aretha Franklin, John Lee Hooker, Big Walter Horton, James Brown, Ray Charles and more. There is no movieThe cult classic with one of the best if not best score in movie history. They got so many great artist (some would say legends) like Aretha Franklin, John Lee Hooker, Big Walter Horton, James Brown, Ray Charles and more. There is no movie that can easily compare. Also there are the songs performed by the Blues Brothers themselves which gave an awesome performance and are a welcome addition to the score. But it does not end here. They took also great effort in delivering an entertaining story, great humor, remarkable quotes and create characters you never forget. I wont spoil any of the former parts because I believe this is a movie you should experience yourself. The combination of Director John Landis and the chemistry between John Belushi / Dan Akroyd is pure gold. I will say the quote “Movies like this will not be made anymore” is a fitting description. Overall this is a must see movie with a must listen soundtrack you need to own for your collection. Special warning: Blues Brothers 2000 is the worst sequel I know (except the score) and the only movie that destroyed the prequel. Yes, that is possible (I couldn't believe that was even a thing before. Though only extreme fanboys say something like that). If you watched it you will know what I mean.",
      "review_date": "2020-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie reminds me of my childhood. We watched this as a family and laughed each time. Probably seen it over 20 times now. One of the best movies of all time!",
      "review_date": "2019-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The amazing adventure of two brothers half-singers, half cons, that includes spectacular car chases that makes Fast & furious babies stuff. Awesome cast of the royalty of Soul and Rhythm & Blues: James Brown, Cab Calloway, Ray Charles andThe amazing adventure of two brothers half-singers, half cons, that includes spectacular car chases that makes Fast & furious babies stuff. Awesome cast of the royalty of Soul and Rhythm & Blues: James Brown, Cab Calloway, Ray Charles and Aretha Franklyn. Good choice for a friday evening.",
      "review_date": "2018-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A couple of cool blues dudes on a mission from God wreck police cars and kill nazis. What's not to like.",
      "review_date": "2018-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "All time cult classic from comedy to casting to soundtrack this film is to be learned from.",
      "review_date": "2020-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "one of the greatest films ever made with the best soundtrack you could ever dream of and so many classic scenes in",
      "review_date": "2020-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic.One of the most quotable comedies of all time.And the car chases. The likes you've never seen before.Did I mention the music. Amazing.",
      "review_date": "2021-01-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a perfect mixture of comedy, musical and action. You can be laughing your head off by one scene, then enjoying the songs by Blues Brothers, and being amazed by the explosions and car stunts, all in half an hour.",
      "review_date": "2022-03-20",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 23,
  "genres": [
    "Action",
    "Comedy",
    "Crime",
    "Music",
    "Musical"
  ]
}