{
  "title": "Kill Bill: Vol. 2",
  "rating": 8.2,
  "release_date": "2004-04-16",
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "summary": "An epic tale of one woman's quest for justice presented in two installments. (Miramax)",
  "critic_reviews": [
    "Kill Bill-Vol. 2 puts to shame doubts entertained about aesthetic strategies or structural imbalance provoked by \"Kill Bill-Vol. 1.\" Now that the entirety of Quentin Tarantino's epic revenge melodrama is on view, \"Kill Bill\" emerges as a brilliant, invigorating work, one to muse over for years to come.",
    "You'll thrill to the action, savor the tasty dialogue and laugh like bloody hell.",
    "Originally conceived as one film, the two-parter that has finally emerged can now be seen as a truly epic work.",
    "A piece of spectacular silliness, but that's not meant with disrespect. The key word is spectacular.",
    "The film succeeds by expertly melding the two stages of Tarantino's career. The rambling Tarantino of \"Jackie Brown\" and \"Pulp Fiction\" is evident in every lovingly crafted and delivered monologue, each leisurely paced scene and long take. The more action-oriented, fight-intensive Tarantino reappears in the viscerally exciting bursts of ultra-violence that punctuate the stretches of dialogue.",
    "There's no denying that when it comes to communicating a certain delirious romanticism of character shaped by thousands of hours spent sitting in the dark, the artist who made this showpiece is a master.",
    "It's a comic book at heart, albeit a thoroughly, grandly romantic one in the end.",
    "This is a movie of head-spinning richness.",
    "The most voluptuous comic-book movie ever made.",
    "Few filmmakers love movies as intensely; fewer still have the ability to remind us why we fell for movies in the first place.",
    "Put the two parts together, and Tarantino has made a masterful saga that celebrates the martial arts genre while kidding it, loving it, and transcending it.",
    "If Kill Bill Vol. 1 was bloody exhilarating, Vol. 2 is bloody great. And, as a bonus, not nearly so bloody.",
    "The result is insanely good, and the best time I've had at the movies in ages.",
    "While Tarantino's famous fight sequences are grisly, funny and genuinely entertaining, his love scenes are so tender, so fraught, you fear for the safety of your own heart.",
    "Vol. 2 is the most sheerly enjoyable movie I've seen in ages, allowing for all the intimacy that was missing from its predecessor -- this time, the violence feels PERSONAL. Yet this film, too, would be richer if it didn't stand alone, but rather were part of one grand grind-house epic.",
    "This installment delivers more of the pleasures that made Tarantino the wunderkind of 90s cinema: offbeat scumbag characters, narrative sleight of hand, an extraordinary visual sense, and affectionate genre pillaging.",
    "This being a Tarantino film, the conversations are as long and lurid and finely choreographed as the martial-arts set pieces.",
    "It is the more satisfying of the two installments - less over-the-top, arterial-gushing violence and more investigation into character, motives, back-story.",
    "Bout No. 2 is among the best closed-quarters screen fights ever, as good as (and longer than) Frank Sinatra vs. Henry Silva in The Manchurian Candidate. And Hannah does more for an eyepatch than anyone since the late Israeli defense minister Moshe Dayan.",
    "Vol. 2 isn't anywhere near as self-indulgent as its predecessor, but it still plays like the work of a man too in love with his creations to decide which of his darlings to kill - so he ended up with merely a very good movie.",
    "For all its relative subtlety, Kill Bill, Vol. 2 remains a cartoon: Its wit is broadsword rather than rapier, and its motives are elemental. The banter is second-tier Tarantino: a cut above his imitators, but below the standard set by \"Pulp Fiction\" and \"Jackie Brown.\"",
    "Tarantino maintains a flawless balance between flat-out action, quirky dialogue, stylish homages to the glistening shadows of film-noir thrillers, the sun-baked brutality of Westerns (American and Italian), the ritualistic rhythms of Shaw Brothers martial-arts pictures from the 1970s and quietly dramatic moments, shifting between them with quicksilver facility.",
    "There's no doubt that Kill Bill is an epic, and no doubt of the skill that's often apparent. But what it leaves us with is awesomely trivial.",
    "A compendium of really neat stuff and nifty sequences, and it will just have to do until Vol. 3 or reunification comes along.",
    "As it currently stands, Kill Bill is a victim of its director's ego and its distributor's greed. The moments of greatness make it worth seeing, and there's certainly plenty of entertainment to be found here, but it's hard not to lament what might have been.",
    "Tarantino has always been an inventive director, and in Kill Bill: Vol. 2 he's at his cinematic best, showing an ingenuity that nothing in his monster hit \"Pulp Fiction\" surpasses.",
    "In its defense, I can only say that, technically, it's an exhilarating piece of filmmaking; it offers a commanding comeback role for Carradine, and it serves as a summation, dead end and, perhaps, epitaph, for Tarantino's unique contribution to world cinema.",
    "So much cinematic majesty perched precariously atop so little common sense. But, hell, maybe Quentin's right; relax, enjoy -- a castle with a shaky foundation is still quite a sight.",
    "All [Tarantino] has to do is trim a full hour out of \"Vol. 1\" and a half hour out of Vol. 2, combine what's left and he'll have something not just amusing and idiosyncratic, but outstanding.",
    "What's surprising is the atmosphere of sweet reason--elatively speaking--that distinguishes Kill Bill Vol. 2 from its bloody precursor.",
    "The first Kill Bill was nothing but violence--swordfight upon swordfight, till the clanking of steel blades drowned out anything anyone said. The second is its emotional counterpart, the heart without all the blood drained from it.",
    "For those seeking the vibrant innovation of Tarantino's first movies or the sheer rush of \"Kill Bill, Vol. 1,\" Vol. 2 feels like a dulled blade.",
    "All this frenzy, all these \"quotes\" from other movies, and yet Vol. 2 is strangely static - a dulling experience that can safely be admired from afar without it ever engaging the senses.",
    "Vol. 2 isn't exactly disappointing, and like all of Tarantino's movies, I suspect it will improve with repeated viewings. But for now, Vol. 2 leaves you pondering what could have been.",
    "“Volume Two” is what they call a movie-lover’s movie, in that it’s replete with references to just about everything a cinema geek would appreciate.",
    "As it is, it’s an aloof conclusion, an unclimactic climax to a stand-alone film.",
    "I don't mean to unduly target Kill Bill Vol. 2 --it's certainly no worse than most of the blam-blam fare out there. But what I crave now are movies that speak to me in a different way about violence, that acknowledge the fact that real people are harmed.",
    "Watching Thurman's character \"triumph\" in a context as joyless and self-referential as Tarantino's is a soul-deadening experience, one that over two hours takes on the same dreary monotone as the cheapest pornography."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Kill Bill volume 2 is almost a completely different film to the first. Where volume 1 is purely action-driven with a lot of uncensored blood & gore, this one is the opposite. The first volume had some excellent scenes and fantastic direction,Kill Bill volume 2 is almost a completely different film to the first. Where volume 1 is purely action-driven with a lot of uncensored blood & gore, this one is the opposite. The first volume had some excellent scenes and fantastic direction, but lacked depth in its story. Volume 2 provides this backing, and does it in an immersive way. Every moment feels like it was expertly directed and put together. There is perhaps only one or two moments of actual violence in this film, the rest is purely story and character driven. However, the beauty of it is that there's not a single minute where you're bored and wishing for more of the brutal combat shown in volume 1. There are a lot of subtle but powerful messages in this film, and in my opinion more than make up for the lack of action. The fact that all the action is in volume 1 and the story in volume 2 actually makes the film more unique in my opinion, rather than having a generic mix of the two. I think this film is passable stand-alone, but you need to have seen volume 1 to appreciate it more and understand why there isn't much action in it. Overall, a must-see if you have watched Kill Bill Volume 1 and want to know more about the story.",
      "review_date": "2013-08-17"
    },
    {
      "review_title": null,
      "content": "Best than it's predecessor, this volume show us how creative Tarantino's mind can be. Showing the revenge of the Bride aka Beatrix Potter - Uma Thuman, in her best acting ever, even better than in Pulp Fiction- we get the blood we need, andBest than it's predecessor, this volume show us how creative Tarantino's mind can be. Showing the revenge of the Bride aka Beatrix Potter - Uma Thuman, in her best acting ever, even better than in Pulp Fiction- we get the blood we need, and even another great character, Elle Driver -Daryl Hannah, once again, great. Brilliant.",
      "review_date": "2011-11-15"
    },
    {
      "review_title": null,
      "content": "I recently just watched both movies for the first time i have to by it self this movie is not much to talk about, but seeing vol.2 the movie was extremely better as a whole. This one by itself was really good and i really liked the ending ofI recently just watched both movies for the first time i have to by it self this movie is not much to talk about, but seeing vol.2 the movie was extremely better as a whole. This one by itself was really good and i really liked the ending of it all. I recommend especially anyone who is a fan of the old kung fu movies",
      "review_date": "2011-11-16"
    },
    {
      "review_title": null,
      "content": "Definently the better of the two films. Acting is a lot better, So is the action. It ended in a good way as well. Definently worth watching imo. I really liked it.",
      "review_date": "2012-03-18"
    },
    {
      "review_title": null,
      "content": "Every so often a sequel surpasses its predecessor, Kill Bill Vol. 2 does that by a long shot. Volume 2 is tighter, swifter and much more entertaining.",
      "review_date": "2014-08-28"
    },
    {
      "review_title": null,
      "content": "This movie wasn't as violent, and well written as its procedure, The acting is way more better, especially Thurman's performance.",
      "review_date": "2012-11-24"
    },
    {
      "review_title": null,
      "content": "The Bride continues to seek her vengeance by searching the man responsible of the grace shot she received. It is the perfect combination of gore, action and Tarantino touch in a single movie. (Considering Kill Bill vol.1 and vol. 2 as oneThe Bride continues to seek her vengeance by searching the man responsible of the grace shot she received. It is the perfect combination of gore, action and Tarantino touch in a single movie. (Considering Kill Bill vol.1 and vol. 2 as one film)  It should be recognized as a MUST see at anytime given.",
      "review_date": "2013-06-26"
    },
    {
      "review_title": null,
      "content": "Another good film by QT I think that a lot of his stuff is overrated but not this one I really enjoyed this one. It is not as gory as the first but it is better. There are some really cool fight scenes and a great story and dialogue typicalAnother good film by QT I think that a lot of his stuff is overrated but not this one I really enjoyed this one. It is not as gory as the first but it is better. There are some really cool fight scenes and a great story and dialogue typical in most QT movies. The acting in this movie is great as they make all of the characters really mysterious which I thoroughly enjoyed. Definitely check this one and the firs one out.",
      "review_date": "2014-05-30"
    },
    {
      "review_title": null,
      "content": "\"Kill Bill: Vol. 2\" is even better than the first part! It's not as action-packed, but it covers more of why The Bride is so hell-bent on getting revenge which makes up for the slower parts of the film. Volume 2 is bigger, bolder, and better\"Kill Bill: Vol. 2\" is even better than the first part! It's not as action-packed, but it covers more of why The Bride is so hell-bent on getting revenge which makes up for the slower parts of the film. Volume 2 is bigger, bolder, and better than Volume 1.",
      "review_date": "2014-09-03"
    },
    {
      "review_title": null,
      "content": "I don't know how Volume 2 manages to be better than Volume 1, but this installment quickly surprised me every single minute with a single detail this movie can't leave behind.",
      "review_date": "2016-04-18"
    },
    {
      "review_title": null,
      "content": "Mostly just an extension of volume one, and while it's not as strong as that film, it's still mostly flawless in its execution",
      "review_date": "2018-02-10"
    },
    {
      "review_title": null,
      "content": "If you have seen Vol.1, don't expect Vol.2 to be as action-packed as the first part. The only scenes that are really breathtaking are the fights. But music, direction, acting and dialogue are incredible. Also, the ending was satisfying.If you have seen Vol.1, don't expect Vol.2 to be as action-packed as the first part. The only scenes that are really breathtaking are the fights. But music, direction, acting and dialogue are incredible. Also, the ending was satisfying. Awesome movie! My favorite one! 10/10!",
      "review_date": "2018-05-13"
    },
    {
      "review_title": null,
      "content": "The second volume is far more talkier than its predecessor, but nonetheless expands on its storyline and ultimately delivers an engrossing sequel and a satisfying conclusion.",
      "review_date": "2018-10-11"
    },
    {
      "review_title": null,
      "content": "A great conclusion to a brilliant movie phenomenon. Though not as fast-paced and adrenaline-pumping as Volume 1, the second part leaves a better aftertaste. Tarantino has not only shown that he's still the king of gritty crime movies, A great conclusion to a brilliant movie phenomenon. Though not as fast-paced and adrenaline-pumping as Volume 1, the second part leaves a better aftertaste. Tarantino has not only shown that he's still the king of gritty crime movies, but also how effortlessly he can handle romantic and emotional aspects to a marvellous effect. When put together, Kill Bill will stand as one of the greatest motion pictures of the new milennium. And after reading Johnny U.'s post - Do you honestly believe that just because you can't see a movie's good qualities that means there are none, and thus everyone rates that movie a 10 because the hype tells them so? Judging from your way of writing, it seems the only comment on the movie is \"an absolute boreathon\". Well, Johnny, maybe you should start judging a movie from its script, acting and direction too? Because these are the things that have made Tarantino's movies famous, and if you can't notice these things in a film, you shouldn't be commenting here at all. ",
      "review_date": "2004-09-10"
    },
    {
      "review_title": null,
      "content": "The first film was all action and very little to no character development or plot. All that comes in this part 2. And it's so much better! The action was very fast paced and over the top i the first one. Now we find out what it was all The first film was all action and very little to no character development or plot. All that comes in this part 2. And it's so much better! The action was very fast paced and over the top i the first one. Now we find out what it was all about and just who these people are. Tarantino has made a true epic when you put these 2 films together. And this part 2 shines far beyond the all action part one section.",
      "review_date": "2005-09-17"
    },
    {
      "review_title": null,
      "content": "This along with the prequel to this are definitely the collab of the best movie ever made. I love to watch Vol. 1 and 2 as if it is just one big movie. I LOVE the fight scenes, the more unlocked tells of the other members of the squad and theThis along with the prequel to this are definitely the collab of the best movie ever made. I love to watch Vol. 1 and 2 as if it is just one big movie. I LOVE the fight scenes, the more unlocked tells of the other members of the squad and the story of the Bride before all things went south for her. LOVE THE MOVIE!!!!!!!!",
      "review_date": "2010-11-17"
    },
    {
      "review_title": null,
      "content": "There seems to be some confusion in evilD's post. So that you don't get the wrong idea, Kill Bill was not made into two movies to maximize profits. The length of the movie if combined was longer then anticipated. The \"over the topness\" of theThere seems to be some confusion in evilD's post. So that you don't get the wrong idea, Kill Bill was not made into two movies to maximize profits. The length of the movie if combined was longer then anticipated. The \"over the topness\" of the movie is purposeful, creating a homage of old Hong Kong martial arts films, Japanese Chanbara films, exploitation films and spaghetti westerns. Tarantino captures both visual and audial senses of the viewers with the amazing soundtrack to great camera work! Though some may say it had a shallow plot, it was the story of the bride that really held me down in my chair. I can proudly say Kill Bill Vol.1 and Kill Bill Vol.2 are my favourite movies.",
      "review_date": "2011-02-13"
    },
    {
      "review_title": null,
      "content": "Kill Bill: Vol. 1 allowed Quentin Tarantino to show off his panache for crafting thrilling and stylish action. Vol. 2 allowed him to prove that he is also a master of character development and affecting drama. Uma Thurman once again impressesKill Bill: Vol. 1 allowed Quentin Tarantino to show off his panache for crafting thrilling and stylish action. Vol. 2 allowed him to prove that he is also a master of character development and affecting drama. Uma Thurman once again impresses as The Bride, and this time her character is allowed to become a real human being driven by emotions beyond those connected to a desire for revenge. Michael Madsen also makes his mark as Budd, Bill's brother and another former assassin on The Bride's kill list, who is long past his best and quite understanding of her need to kill him and his former associates, proclaiming with a hint of remorse \"That woman deserves her revenge, and we deserve to die\". Fittingly, seeing as he's the titular character and primary antagonist of this two-part epic, the late David Carradine's Bill is utterly mesmerising. He completely embodies the enigma and contradictions of his character - a caring father and also a violent mercenary, a philosophical big-thinker but also heavily reliant on animalistic instinct, a stoic outward appearance but not above crude insults. He's a superb character creation of Tarantino's, and is easily one of the best, most terrifying, interesting and layered movie villains of all time. While the story is enthralling throughout, where the film reaches its true potential is with the final act. You'd be forgiven for expecting an extravagant final battle, blade-to-blade between The Bride and Bill, as that's what we've been lead to believe we've been building to. What Tarantino gives us instead is a taught, tense and sublimely written final conversation between the two characters. The result is a far more original, intelligent and satisfying conclusion to this incredible revenge saga. With the first volume of Kill Bill, Quentin Tarantino managed to make lowbrow filmmaking respectable; with Vol. 2, through accomplished direction, a brilliant cast and flawless craftsmanship, Tarantino elevates trash to high art.",
      "review_date": "2012-06-12"
    },
    {
      "review_title": null,
      "content": "Kill Bill... is cool. Really, really cool. It's Quentin Tarantino. He's cool. Really, really cool.I've said it before and I'll say it again, Kill Bill isn't supposed to be believable. It's supposed to be... cool, brilliant, and tastefullyKill Bill... is cool. Really, really cool. It's Quentin Tarantino. He's cool. Really, really cool.I've said it before and I'll say it again, Kill Bill isn't supposed to be believable. It's supposed to be... cool, brilliant, and tastefully ridiculous.  And that's exactly what Quentin Tarantino does best.",
      "review_date": "2011-07-22"
    },
    {
      "review_title": null,
      "content": "Its rare that I give a film 10/10 or 5 stars but this film truly deserves it. It is the perfect culmination of the two films. The first film acted as a great origins film looking back on what brought The Bride to where she was when sheIts rare that I give a film 10/10 or 5 stars but this film truly deserves it. It is the perfect culmination of the two films. The first film acted as a great origins film looking back on what brought The Bride to where she was when she started her quest for vengeance but it had its flaws (ultra violence only works in small quantities, just ask Total Recall). Kill Bill Vol 2 works with what the 1st volume had already established but rounded out the remaining targets as well as The Bride herself. The emulation of classic Kung Fu films further accentuated  the characters and there admiration for the art. In the 1st volume that was something only touched on briefly and most characters suffered because they were not properly build with O-Ren Ishii being nothing more than a mob boss. Volume 2 shows Bill to be both a complex character with multiple urges and desires but also a extremely childish character who is incredibly impulsive. Yet again Tarrantino's script is so nuanced and detailed that every conversation comes off as real in a film that even embraces the cheese of vintage Kung Fu movies (fast zoom and all).  Despite the fact that the film had a problem with momentum there was never a moment when I wasn't completely encapsulated in what was happening on screen with the Pai Mei scenes being extremely riviting despite serving very little purpose. The main draw however was understanding these characters, what drives them, why they need what they need. Daryl Hannah's Elle is one such character whose seething hatred of The Bride would seem like petty jealousy if you had only seen the 1st film but there is so much more to it and this film succeeds in every aspect of character. If there is anything wrong with this film it would be Budd's section (not that there is anything wrong with Michael Madsen) because there were scenes that just served no purpose at all, not even a little and yet were shoehorned in to give Madsen something to do. The finale of the film is both riveting and deeply emotional with everything that had been set up by the final moments of Volume 1 culminating beautifully and the final scene with The Bride (whose name is revealed) on the bathroom floor just describes how detailed this film really is. A masterpiece in every sense of the word. Also, who knew making sandwiches could be so captivating.",
      "review_date": "2011-09-26"
    },
    {
      "review_title": null,
      "content": "Certainly less action-packed than the first one, Part II of this film returns many of the elements that made the first film a success, namely Uma Thurman being a total badass and then the dark comedy that is a trademark in all TarantinoCertainly less action-packed than the first one, Part II of this film returns many of the elements that made the first film a success, namely Uma Thurman being a total badass and then the dark comedy that is a trademark in all Tarantino films. In addition, the omages to samurai and spaghetti westerns is perfectly done (and is almost done comedically too). In addition, this film does a better job than the first at providing depth to the characters and figuring out events that we simply saw glimpses of in Volume 1. The acting is also really good, especially Thurman and David Carradine. Michael Madsen also turned in a solid supporting role. However, the best thing this film provides is entertainment. Like its predecessor, this one is endlessly entertaining.\r In terms of the script, it is admittedly incredibly cheesy. At times, I caught myself thinking, \"Really? They put that in?\", but as it is undoubtedly intentionally bad, it is not really a major knock against this one. Also, my more major knock is the ending. It is very...unsatisfying and anticlimactic. We're waiting for this moment the whole time and then...ok? I just wish that the ending was more of what the film was seemingly leading up to, rather than a detour from that script.",
      "review_date": "2014-05-08"
    },
    {
      "review_title": null,
      "content": "O filme  simplesmente um máximo",
      "review_date": "2014-01-06"
    },
    {
      "review_title": null,
      "content": "meskipun dengan action yang kurang dari film sebelumnya, namun kekurangan itu berhasil ditambal dengan cerita yang menarik dan dialog2 yang baik, uma thurman tamah mengkilap di film ini namun dua jempol patut disematkan pda David Carradine asmeskipun dengan action yang kurang dari film sebelumnya, namun kekurangan itu berhasil ditambal dengan cerita yang menarik dan dialog2 yang baik, uma thurman tamah mengkilap di film ini namun dua jempol patut disematkan pda David Carradine as Bill auranya dalam film itu sungguh powerful banget",
      "review_date": "2013-08-31"
    },
    {
      "review_title": null,
      "content": "It might not succeed VOL 1, but Tarantino sure did succeed once again. The direction of this film is as predicted very artistic and splendid as usual. It’s funny and crazy – just what Tarantino is famous for. It’s an enjoyable ride with manyIt might not succeed VOL 1, but Tarantino sure did succeed once again. The direction of this film is as predicted very artistic and splendid as usual. It’s funny and crazy – just what Tarantino is famous for. It’s an enjoyable ride with many ups and downs, including a well illustrated villain with a clear motivation. But this isn’t as fast-paced nor entertaining as VOL 1 – not even close. There’re even some unclear motivations of some of the characters that they apparently forgot to clear out. But it got way more character depth — and it sure is an action-packed and bloody, & perhaps (for some) too bloody film. But it sure is a wild one!\r Personal rating: 70/100\rCritical rating: 75/100",
      "review_date": "2016-06-25"
    },
    {
      "review_title": null,
      "content": "The second half ties up everything both neatly and blood-soaked. Continuing the tense actions, the dramatic camerawork, the dialogue that I love Tarantino for, he continues the joyride for another two hours. His films are almost never boring.The second half ties up everything both neatly and blood-soaked. Continuing the tense actions, the dramatic camerawork, the dialogue that I love Tarantino for, he continues the joyride for another two hours. His films are almost never boring. Have to love the allusions the most, though. As a film buff, it always makes me smile.",
      "review_date": "2016-05-31"
    },
    {
      "review_title": null,
      "content": "Vol. 2 really shows why two parts complete itselfs. Bride, as other characters, are better developed here, and in this move is where is enlightened to viewer without loose ends. Thematic is already something different in Tarantino'sVol. 2 really shows why two parts complete itselfs. Bride, as other characters, are better developed here, and in this move is where is enlightened to viewer without loose ends. Thematic is already something different in Tarantino's filmography. A twin set that is absolutely worthwhile, full-of-action and full-of-story parts fits itselfs brilliantly.",
      "review_date": "2018-07-16"
    },
    {
      "review_title": null,
      "content": "Kill Bill Vol. 2 delivers a slightly less of a punch than Vol. 1, but it goes more in depth about the story aspect, and less on the Bride slicing the limbs off The Crazy 88.",
      "review_date": "2014-04-29"
    },
    {
      "review_title": null,
      "content": "Not as full on as the first- with less action and more talking- but the style and delivery is perfect in adding substance to the story and concluding it well.",
      "review_date": "2013-12-12"
    },
    {
      "review_title": null,
      "content": "Not as good as the first volume, since this volume was incredibly slow but does pick up a bit, but it has a fantastic conclusion at the end of the movie.",
      "review_date": "2014-08-16"
    },
    {
      "review_title": null,
      "content": "Un final perfecto, Kill Bill Vol 2 es mas dialogo que acción, pero eso no le quita la perfección, el guion es simplemente único y original, Quentin Tarantino me sigue sorprendiendo, la forma en la que escribe es tan admirable y entretenidaUn final perfecto, Kill Bill Vol 2 es mas dialogo que acción, pero eso no le quita la perfección, el guion es simplemente único y original, Quentin Tarantino me sigue sorprendiendo, la forma en la que escribe es tan admirable y entretenida que incluso los diálogos son mas divertidos que las secuencias de acción. Al igual que su primera parte, las escenas de acción son un homenaje a las grandes películas de Kung-Fu (Sobre todo a Bruce Lee) Junta las 2 partes y obtendrás un espectáculo de 4 horas único, divertido y espectacular.",
      "review_date": "2015-07-21"
    },
    {
      "review_title": null,
      "content": "It's hard to believe that Kill Bill was intended to be one big movie, because Volume 2 feels like a completely different film. There's less action and more backstory, character and emotion.\r And despite my love for the crazy violence ofIt's hard to believe that Kill Bill was intended to be one big movie, because Volume 2 feels like a completely different film. There's less action and more backstory, character and emotion.\r And despite my love for the crazy violence of Volume 1, all those things I mentioned that Vol. 2 exceeds are more important to making a great film in my personal opinion. And Tarantino manages to make this an emotionally memorable experience that I think exceeds the first film, with it's intricate style, characters and story. Nothing particularly original happens in this revenge, but it's done so well that it really doesn't matter.",
      "review_date": "2016-02-12"
    },
    {
      "review_title": null,
      "content": "A very good movie, I think that it was better than vol. 1 because it has more story than violence and the blood effects were better but I still think that the story is a bit simple and I dont like the music, but it's a good movie.",
      "review_date": "2016-04-21"
    },
    {
      "review_title": null,
      "content": "Отличный фильм. Особенно понравился отрывок с учениями у монаха.Сам же фильм делиться на две части: 1 часть интересная в стиле первой части, 2 часть поиск билла и отмщение. 2 часть самая скучная. Но так в целом рекомендуюОтличный фильм. Особенно понравился отрывок с учениями у монаха.Сам же фильм делиться на две части: 1 часть интересная в стиле первой части, 2 часть поиск билла и отмщение. 2 часть самая скучная. Но так в целом рекомендую",
      "review_date": "2018-06-29"
    },
    {
      "review_title": null,
      "content": "A huge change in pace from the first volume and that in turn makes it stand out less, but it still holds its own as an epic movieRating - 86%",
      "review_date": "2018-10-11"
    },
    {
      "review_title": null,
      "content": "An amazing sequel to vol 1. it loses points for not being as fast paced but it closed out Kiddo's tale perfectly. Also has one of my favorite fight scenes ever.",
      "review_date": "2017-10-14"
    },
    {
      "review_title": null,
      "content": "Straight up, the perfect sequel. In fact, I believe that this one may even be better than the first. Although this has different features to the first, the fact that it has less bloodthirsty action, and rather a greater storyline and acting,Straight up, the perfect sequel. In fact, I believe that this one may even be better than the first. Although this has different features to the first, the fact that it has less bloodthirsty action, and rather a greater storyline and acting, the two movies together are amazing.",
      "review_date": "2018-03-11"
    },
    {
      "review_title": null,
      "content": "Even though it was released only one year after the original Kill Bill this one is so much more mature and has a smell of quality missing from the original. The gore is toned down in favor or dramatic wellpaced action. As its predecessor thisEven though it was released only one year after the original Kill Bill this one is so much more mature and has a smell of quality missing from the original. The gore is toned down in favor or dramatic wellpaced action. As its predecessor this movie has valleys of calm moody scenes only to top it of with peaks of dramatic action. Dialogue is good and narrative pace is spot on aswell as cinematography.  Uma Thurman does an amazing job as the lead.",
      "review_date": "2017-11-15"
    },
    {
      "review_title": null,
      "content": "(94/100)So before reading this, I consider Kill Bill Vol 1 and 2 as one long epic. Quentin Tarantino's first attempt at an R rated blood spectacle went very well. I consider this movie after Pulp Fiction to be Quentin's best work. And the(94/100)So before reading this, I consider Kill Bill Vol 1 and 2 as one long epic. Quentin Tarantino's first attempt at an R rated blood spectacle went very well. I consider this movie after Pulp Fiction to be Quentin's best work. And the passion he has for directing shows in this awesome long movie. 4 hours of developed story and well choreographed action scenes. Quentin has such a unique style which I like so very much. I don't see why anyone (except for the Romance lovers out there) wouldn't like this movie.",
      "review_date": "2018-02-21"
    },
    {
      "review_title": null,
      "content": "with a completely different sequence from its predecessor, with dialogue, plot and extra characters. Kill bill vol.2 is as good as its predecessor-if not better than its predecessor in my opinion.",
      "review_date": "2018-10-09"
    },
    {
      "review_title": null,
      "content": "Well, what can I say about this film? It's definately good for a sequel, but not better (not even equal) with epic Vol. 1. Vol. 1 was archetype (like the manga anime sequence idea), more impressive, visually striking, more interesting, itWell, what can I say about this film? It's definately good for a sequel, but not better (not even equal) with epic Vol. 1. Vol. 1 was archetype (like the manga anime sequence idea), more impressive, visually striking, more interesting, it contained cool music tracks, it was faster, more fun to watch, action-packed, more frantic, the choreography of the fights and the cinematography were fantastic and last but not least, Uma Thurman's performance was better in 1. I can find more positive things in 1 rather than 2. Vol. 2 was a bit predictable and the dialogue scenes were boring and tiring. Also, I definately loved the vengeful and ruthless Bride, not Beatrix Kiddo's sensitive character driven by emotions. Also, Bill (David Carradine) really broke my nerves for some reason, he was an annoying character. The good points of this film was the whole chapter 8, the fight between Uma Thurman and Daryl Hannah and the music tracks. It looks more than drama/adventure rather than action film. It reminds mostly a western film rather than samurai. Overall, it was ok and decent but comparing to Vol. 1, I think it lacks visually beauty, action and suspence.",
      "review_date": "2019-02-04"
    },
    {
      "review_title": null,
      "content": "Amazing movie, director and actors. All the characters are interresting, the action scenes are awesome, and Taratino knows how to surprises the viewer. A reference.",
      "review_date": "2011-10-07"
    },
    {
      "review_title": null,
      "content": "Gory, unbelievably exciting and featuring fight sequences that will have you drooling on the edge of your seat, the concept is incredibly simple. 'KILL BILL'.\rDefinitely up there with 'Pulp Fiction' and 'Inglourious Basterds' as QuentinGory, unbelievably exciting and featuring fight sequences that will have you drooling on the edge of your seat, the concept is incredibly simple. 'KILL BILL'.\rDefinitely up there with 'Pulp Fiction' and 'Inglourious Basterds' as Quentin Tarantino's best film to date, it is an old fashioned horror/comedy/drama that is just so entertaining!",
      "review_date": "2010-10-04"
    },
    {
      "review_title": null,
      "content": "It's bigger, deadlier and much much better than Volume 1, which in itself was a fantastic film, but Kill Bill Volume 2 delivers a sucker punch in dramatic storytelling with wonderful homages to martial arts films of yesteryear, and this wasIt's bigger, deadlier and much much better than Volume 1, which in itself was a fantastic film, but Kill Bill Volume 2 delivers a sucker punch in dramatic storytelling with wonderful homages to martial arts films of yesteryear, and this was mastered without there being as much action as the first.\rRight off the mark, we need to remember that this is a continuation, that these two films were supposed to be one, so to recap, The Bride (Uma Thurman) is on a revenge mission to hunt out those who betrayed her, former colleagues of the Deadly Viper Assassination Squad, led by Bill (Dennis Carradine).\rThis time around we meet Budd (Michael Madsen) who is now living in a trashed out trailer and getting by as a bouncer, until The Bride shows up. We are also reintroduced to Elle Driver, the one-eyed assassin from the previous instalment, with a much bigger part to play this time around.\rVolume 2 confidently ties up all the loose ends of the first outing, the story is broader in scope to allow more of a human touch to the colourful proceedings, but still using past films to capture the true nature of the story.\rWhile not as violent as the original, there is much more dialogue in Volume 2, the fact that the whole 'saga' is in fact one film shows true balance to the story, The Bride at first is full of hatred and revenge, but now realises she has almost reached the end of the road, and this makes for much more interesting and intriguing scenes with The Bride and of course, Bill.\rQuentin Tarantino has now proved his ability to tell a compelling story through various body movements and the art of filmmaking and creating the perfect scene to capture that one defining moment, and that is where the cinematography exceeds in every level in this film.\rUma Thurman delivers another driven performance as The Bride, and yes, her real name is revealed in the film. Her continuing motivation to capture the essence of a character is what makes her a suitable lead, something which will always leave a lasting effect. Dennis Carradine is typically charming yet deadly as Bill, his references to comic books and how superheroes reflect human nature is genius, and shows the powerful dialogue that Tarantino can create.\rThe action scenes still do exist, while not is colourful, they are certainly memorable and beautiful to watch.\rmy advice is to sit and watch these two films as a whole, and to receive a true masterclass in filmmaking and how to put across a simple story for everyone else to be interested in.",
      "review_date": "2013-05-07"
    },
    {
      "review_title": null,
      "content": "I like Tarantina's films! I like Uma Turman and this film is amazing! Love it ! It is me favourit film!",
      "review_date": "2012-02-23"
    },
    {
      "review_title": null,
      "content": "This film is less of a sequel and more a continuation of the Bride's story. This one contains more philosophy and a sense of urgency leading to the final confrontation with Bill. Tarantino has succeeded in creating a masterful story and willThis film is less of a sequel and more a continuation of the Bride's story. This one contains more philosophy and a sense of urgency leading to the final confrontation with Bill. Tarantino has succeeded in creating a masterful story and will go down as one of my favorite sets of films.",
      "review_date": "2013-04-07"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nKill Bill Volume 2 is the second half of the adventurous and fun Kill Bill series. The humor(comedy) of this franchise is gone, the adventure is partly decreased, and the tone becomes more serious. It however makes up for it and we learn what the bride's name is, how the massacre is fully explained, and more character development for Budd, Elle, and Bill. It is really great and reveals shocking and interesting things we didn't know about in Volume 1. Amazing!",
      "review_date": "2017-11-06"
    },
    {
      "review_title": null,
      "content": "If, in 'Kill Bill Vol. 1', Quentin Tarantino made one of the bestmovies for people who love Japanese grindhouse, then in 'Vol. 2' hemade one of the best movies for people who love movies. Tarantino has\nconsistently been my favorite directorIf, in 'Kill Bill Vol. 1', Quentin Tarantino made one of the bestmovies for people who love Japanese grindhouse, then in 'Vol. 2' hemade one of the best movies for people who love movies. Tarantino hasconsistently been my favorite director and 'Kill Bill Vol. 2' is thegreatest of all his films to date. This isn't a sequel to 'Vol. 1', ashe didn't decide to split 'Kill Bill' up until just after he finishedshooting, it's simply the second half. 'Vol. 1' is an excellent,excellent film, but no where in the range of this one. I grinear-to-ear all the way through this movie.'Vol. 2' is Quentin's most visually beautiful movie yet (and themagnificent opening chapter, shot in gleaming black-and-white, isresplendent to a degree that is profound, as is the great sequence atPai Mei's ancient abode, shot in gloriously seventies-styleover-saturated greens and glaring whites), and it's where his flair forspaghetti-Westerns comes out the most. As in all of Tarantino's films,the dialogue is an unadulterated joy.This is nearly his least violent (and actually also almost his leasttalkative) film yet, and I've read both the original script and DavidCarradine's 'The Kill Bill Diaries', about all he saw of the making ofthe movies, and it's clear that many of Quentin's best decisions had todo with diminishing or removing the action. In place of the moreobvious strategy of showing us a detailed sequence of the Deadly ViperAssassination Squad gruesomely gunning down the people in the chapel,he decided no, pull back and let us just listen to a brief event from adistance, observing it in a kind of silhouette. And in place of Billfiring a warning shot at the Bride and holding her at gun-point whileshe walks towards a couch to seat herself, he decided Bill simplyregards her casually, his pistol just visible at his waist, of whichthey are both aware. In the earlier idea, all suspense would have beenspent with the warning shot. When Bill relates the tale of Pai Mei tothe Bride, he decided it would be more effective to let us use ourimaginations while listening to Bill's ponderous speech by thecamp-fire in the dark than to play seventies Kung Fu footage of Pai Meiin action over the monologue.The first time I saw the movie, the first big thing that struck me wasBudd. His is a great andtragic character, and Michael Madsen is a great actor, and hisperformance begins in a singularly perfect scene with Carradine whichshows us his indifference to, and acceptance of, his approachingprobable demise. And for a long stretch the Bride is forgotten, and wesimply follow Budd into the lonely strip club he tends bar at, gettinga taste of what his existence has become, of his disappointment andwithdrawal from life (the scene where he argues with his boss Larry andfinally relinquishes both his hat and his pride is worthy of applause).Every time I watch the scene of the Bride's sneak-attack on him, I ammore amazed by how exquisitely constructed the whole sequence is. Along, meticulous build-up ending in unexpected truncation is atrade-mark of Quentin's, in action as well as dialogue. What Budd does\nwith the Bride is endlessly fascinating to me in its brilliant,\nprimeval simplicity. This is the stuff of great myths.\n\nIn the last chapter the tone of the film changes from the grandiose,\nTarantinian adventure of the first four chapters and settles into an\nintimate dialogue between the story's two central characters (and one\nother, for a time), in which Quentin subtly and expertly simmers the\ntension and danger that exists between these two supremely deadly\nassassins. This section of the film is in keeping with an other\ntrade-mark of Quentin's, that of inserting elements of simplest,\nuttermost reality into an over-the-top, epic story. With Quentin's\nhelp, David Carradine produced a magnificent performance in\nthis film, as a man who is possibly even more laid-back than Carradine\nwas himself (and who delivers three great monologues), but who can be deeply, genuinely menacing.\n\n'Kill Bill Vol. 2' is the most joyful, the most exciting, the most\nglorious celebration of the cinema I've ever seen. It is Tarantino's\ndeepest and most emotionally powerful film by far (and the often\nover-looked sequence of the Bride slowly preparing herself before\nleaving a bed-room to face Bill is one of the very best in the film).\nIt has both the best and second- best uses of music I've heard in a\nmovie (if not more). The climax of the Bride's raggedly magnificent\nconfrontation with her wicked rival Elle evokes in me the emotion of\nsheer love. And the scene of the Bride's triumph over the designs of\nBudd has become my central image of the cinema. This is a movie that\nbursts with human life, and with its director's signature passion and\nlove of the movies. I can't tell you how many times I've put the D.V.D.\nin to look at a specific part, and then ended up watching the whole\ndamn thing again.",
      "review_date": "2011-01-05"
    },
    {
      "review_title": null,
      "content": "This movie took me by surprise because it was so different than the first one. However, that only made it better. This movie has such an impressive essence about it. Uma was very convincing and brilliant in this film. It is brutal andThis movie took me by surprise because it was so different than the first one. However, that only made it better. This movie has such an impressive essence about it. Uma was very convincing and brilliant in this film. It is brutal and unsympathetic in its nature. Among one of the best films ever. A true masterpiece.",
      "review_date": "2012-03-31"
    },
    {
      "review_title": null,
      "content": "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
      "review_date": "2017-12-30"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI think Kill Bill Vol. 1 had more action, more popular music themes and better fight sequences, although it lacked on emotion and plot. Vol. ll looked like a complete film, comparing to the first, that looked like we just watched the 1/4 of the movie. Nevermind, Tarantino has succeded in creating a masterful story with a few but interesting characters, amazing fight scenes (my personal favorite was Beatrix vs Elle fight), beautiful music themes, badass action sequences and... l am still waiting for a 3rd movie to come in theaters. All in all, I loved it, even if l still find Vol. 1 more enjoyable and entertaining.",
      "review_date": "2018-01-31"
    },
    {
      "review_title": null,
      "content": "(NOTE: This review covers only Vol. 2 of the Kill Bill Saga. For Vol. 1, see my profile page. For a complete overall score on the entire Kill Bill saga, see after this review)\rPart 2 of this elaborate revenge, murder rampage concentrates(NOTE: This review covers only Vol. 2 of the Kill Bill Saga. For Vol. 1, see my profile page. For a complete overall score on the entire Kill Bill saga, see after this review)\rPart 2 of this elaborate revenge, murder rampage concentrates more on the actual plot and less on the violence. Is that good thing? No, not at all. The violence and fighting sequences as well as the unique blend of  Asian cinema homages and cinematography are what actually kept Vol. 1 above 5/10 for me. However, for Vol. 2, the homages and unique style of Vol. 1 is almost completely non-existent (no, the training segment with Pai Mei does not qualify to a homage as its cliche' as hell and has been done hundreds of times in modern films), the action sequences are reduces to a few disappointing minutes, the actual movie itself is set in some of the most bland locales (as opposed to exotic locations of Vol. 1), and the characters...you just dont care anymore. The new characters dont really bring much to the table and are all uninspiring to the point of mediocrity. You can almost feel that Thurman herself as a character is losing steam as opposed to her great portrayal in Vol.1. And finally, they decided to focus on the plot, the weakest aspect of the entire saga. Well, I guess they have to. Imagine Transformers with barely any cool fight sequences and have Shia Lebouf and Optimus Prime talk for most of the film. This is like Vol. 2 - instead of more violent sequences in the unique style and soundtrack as pinpointed by Vol. 1, Vol. 2 decided to just throw all that in the bin and opted for a more quiet and ultimately, more lacking concluding film which, while wraps up Kiddo's tale (the final 'boss fight' just feels disjointed and lacks tension), is at the end of the day, becomes a cliche' drama rather than an action thriller. Dont watch this on drunk nights like Vol. 1, instead just read the wikipedia plot section. You're not missing anything by not watching it. Throwing away the elements which made Part 1 fun, Vol. 2 of Kill Bill is a mediocre, disappointing conclusion that feel like a Samurai warrior who basically used up all his strength for the first half of the fight while for the second half, decides to use a gun instead to finish his opponent. OVERALL: With Vol. 1 and 2 taken into considerable, Kill Bill feels disjointed with dramatic shifts to pace that just feels unnatural. Decent fight sequences, coupled with unique film styles and homages to Asian cinema make the first half of the saga enjoyable if you're feeling a little bloodlustful wheras you may be disappointed at the ending and concluding hour where the pace slackens and action is thrown out the window. Kill Bill as a whole with Vol. 1 and 2 combined receives a 6/10. A decent, intriguing piece of cinema that will divide audiences and is ultimately an enjoyable thriller for those after something more raw and intimate.",
      "review_date": "2012-12-14"
    },
    {
      "review_title": null,
      "content": "A lot better sequel then I expected. The story ended good and the acting was great as well. It was also a lot more interesting this time around as well. I enjoyed it a lot more then the first film.",
      "review_date": "2012-01-05"
    },
    {
      "review_title": null,
      "content": "Not so memorable as Kill Bill Vol. 1 for me, a bit touchy sometimes and naive at moments (e.g. the daughter's plot), thanks to Madsen and Carradine I found it really enjoyable. It's Tarantino ok, the references to westerns, noir, and kung-fuNot so memorable as Kill Bill Vol. 1 for me, a bit touchy sometimes and naive at moments (e.g. the daughter's plot), thanks to Madsen and Carradine I found it really enjoyable. It's Tarantino ok, the references to westerns, noir, and kung-fu movies are cool, but a bit schematic and dull to some extent.",
      "review_date": "2012-09-09"
    },
    {
      "review_title": null,
      "content": "I feel the same way about Kill Bill Vol. 2 as i did the first. Again no big deal with solid acting and slightly better action scenes. The ending though is way overdone. Please just Kill Bill already.",
      "review_date": "2012-03-30"
    },
    {
      "review_title": null,
      "content": "By going more in depth into \"The Bride\" 's story, Tarantino sacrificed what made the first part that good. The movie was very slow, the main character wasn't more likeable and the movie was just plain boring at times. A disappointing secondBy going more in depth into \"The Bride\" 's story, Tarantino sacrificed what made the first part that good. The movie was very slow, the main character wasn't more likeable and the movie was just plain boring at times. A disappointing second part to an amazing first part.",
      "review_date": "2017-11-23"
    },
    {
      "review_title": null,
      "content": "Kill Bill Vol2 is not nearly as imaginative or fun as the original. It does have some good moments, but the \"big\" fight between Bill and the Bride was sorely a let down and the movie itself drags on for way too long. We do get some good backKill Bill Vol2 is not nearly as imaginative or fun as the original. It does have some good moments, but the \"big\" fight between Bill and the Bride was sorely a let down and the movie itself drags on for way too long. We do get some good back story about the bride and how she killed Bill's other members. There are some good dialogue and a few good action scenes. But, the movie takes too long to get the end and by the end, there is not a lot left to care about. Why spend this much time building up to what was basically a revenge plot? I used to own these movies because people thought I would love them. I don't, but i know they are not bad movies either. I did like the first volume a lot better because of the throw back to old Asian action movies. Vol. 1 was innovative and fun. It was short on story, and character, but it was fun. This movie takes out the fun and imaginative points of the first one and instead gives us a drawn out too long wanna-be spaghetti western (you are better off with the Clint Eastwood man with no name trilogy), but it is good if you are a Tarantino fan.\rThis is not a bad movie by a long shot, but for me, it was a big disappointment.",
      "review_date": "2015-12-11"
    },
    {
      "review_title": null,
      "content": "It is hard to believe the good reviews this pretty but shallow teenage wet dream has had. This script is hackneyed and trite, the imagery no better than second rate comics, and the outcomes as predictable as **** A total yawn..",
      "review_date": "2015-11-13"
    },
    {
      "review_title": null,
      "content": "Though some of the dialogues were lengthy, and made me yawn a bit, everything just fell into place as the movie progressed to its climax. Kill Bill 2 is all about the emotional dilemma and conflicts that result to unimaginable consequences.Though some of the dialogues were lengthy, and made me yawn a bit, everything just fell into place as the movie progressed to its climax. Kill Bill 2 is all about the emotional dilemma and conflicts that result to unimaginable consequences. One of the best action movies ever made!",
      "review_date": "2016-04-17"
    },
    {
      "review_title": null,
      "content": "Slightly cleaner and organized than its prequel, but nevertheless its a messy film.",
      "review_date": "2011-09-21"
    },
    {
      "review_title": null,
      "content": "The best movie ever created.",
      "review_date": "2005-12-25"
    },
    {
      "review_title": null,
      "content": "Everything in the movie seems out of place right down the over exaggerated action scenes to the terrible story.",
      "review_date": "2009-07-19"
    },
    {
      "review_title": null,
      "content": "Highly overrated, ridiculously overlong, highly plagiarized yawner that makes little sense.  Stale and action-free from start to finish.  The first film was shoddy, but at least it was moderately ENTERTAINING! Tarantino at his absolute worst,Highly overrated, ridiculously overlong, highly plagiarized yawner that makes little sense.  Stale and action-free from start to finish.  The first film was shoddy, but at least it was moderately ENTERTAINING! Tarantino at his absolute worst, unless you count his performance in From Dusk Til Dawn...",
      "review_date": "2012-03-03"
    },
    {
      "review_title": null,
      "content": "Another bomb from plagiarism king Quentin Tarantino. If you're going to steal from other movies, why not steal the good scenes and write around them?",
      "review_date": "2006-09-28"
    },
    {
      "review_title": null,
      "content": "i know the two kill bills were originally intended to be one long movie but be that as it may, the second one did not do it for me. we went from seeing the slaying of the crazy 88 in the first movie to a three second chair fight against the i know the two kill bills were originally intended to be one long movie but be that as it may, the second one did not do it for me. we went from seeing the slaying of the crazy 88 in the first movie to a three second chair fight against the main villain",
      "review_date": "2007-09-05"
    },
    {
      "review_title": null,
      "content": "The first movie was all action, this one is all plot, and I realize they split them for, actually I don't know, probably just to maximize the profits for what is, essentially, a cheap kung-fu flick. Granted, the action, though rare, is The first movie was all action, this one is all plot, and I realize they split them for, actually I don't know, probably just to maximize the profits for what is, essentially, a cheap kung-fu flick. Granted, the action, though rare, is fantastically over the top, but the long close-ups, the 10 minute spans of silence while NOTHING happens, all of those \"Tarantino-isms\" just get tiresome after a while. These could have EASILY been abridged and combined into a single, 2-hour film, but it seems we got the \"Director's Cut\" by default, and ultimately it ends up being a waste of time and money. I gotta sit through 3 hours of paper-thin plot spread out over TWO films just to see a half-hour's worth of action? That sucks! I AM a fan of Quentin's work, but this is mostly just self-indulgent \"look how much time I wasted watching old, BETTER samurai flicks.\" Worth a rental, but after rewinding back over the action a few times, you've seen all you need to.",
      "review_date": "2005-11-25"
    },
    {
      "review_title": null,
      "content": "This is the first movie I had to give a 0. This movie was so bad. This movie was one of the worst I have seen. Kill BIll? Or kill the cast and crew?",
      "review_date": "2006-02-24"
    },
    {
      "review_title": null,
      "content": "pretty much like the first film . your nostalgia will affect how much you like this film . its a little slower paced then the first but fills in the story gaps . i liked this movie about the same as the first . its entertaining but doesntpretty much like the first film . your nostalgia will affect how much you like this film . its a little slower paced then the first but fills in the story gaps . i liked this movie about the same as the first . its entertaining but doesnt pull off the fun that sin city pulled off.",
      "review_date": "2010-08-23"
    },
    {
      "review_title": null,
      "content": "Quentin Tarantino is a HIGHLY overrated director. All his movies are over the top with no good storylines and stupid sequences with one liners. I really didn't like this movie that much. It was entertaining at times but there are lots ofQuentin Tarantino is a HIGHLY overrated director. All his movies are over the top with no good storylines and stupid sequences with one liners. I really didn't like this movie that much. It was entertaining at times but there are lots of better martial art flicks. This movie doesn't deserve to be on imdb's top 250 and neither does the first. Quentin Tarantino is not a genius he's just a guy with a sick mind who shows it to everyone. People may call him artistic I say he's full of sh*t. Any artist could just take a canvas and randomly start painting crap that's completely orignal on it people may like it but I say a real artist takes time to work on the details and everything.",
      "review_date": "2010-08-16"
    },
    {
      "review_title": null,
      "content": "Kill Bill Vol. 2. is about as engaging as Vol. 1. although while it has more substance than the last film it lacks the action. The fight scenes are few and far between and the dialogue scenes in-between while serving to flesh out theKill Bill Vol. 2. is about as engaging as Vol. 1. although while it has more substance than the last film it lacks the action. The fight scenes are few and far between and the dialogue scenes in-between while serving to flesh out the characters are dull in comparison to those in Pulp Fiction and Reservoir Dogs. When the action does come on it is either way too goofy or shallow and lacking in bite. Even when the action is fun it doesn’t come close to matching the climax of the first film. Kill Bill Vol. 2. still manages to be engaging but it doesn’t represent Tarintino at his best.",
      "review_date": "2015-08-25"
    },
    {
      "review_title": null,
      "content": "Although Kill Bill: Vol. 1 is greater movie than Kill Bill: Vol. 2, Kill Bill: Vol.2 more concentrates on revealing the shocking moment and half-like epic story rather than Kung-fu fighting or stylistic action.",
      "review_date": "2010-09-20"
    },
    {
      "review_title": null,
      "content": "Kill Bill: Vol. 2 isn't quite as fun as it's crazy predecessor and features nothing to rival the that film's climax, but it's still a great movie filled with memorable scenes and performances.",
      "review_date": "2016-05-29"
    },
    {
      "review_title": null,
      "content": "I feel as though Tarrantino's wasted his own and the actors talents. Unlike most of his movies the films talky scenes are boring and stupid. I loved the rest of his movies but Kill  Bill vol 2 just sucks.",
      "review_date": "2012-08-10"
    },
    {
      "review_title": null,
      "content": "It escapes from its silly setting and focuses on all plot. But even with one of the best performances of all time from Uma Thurman, Tarantino still can't escape from Kill Bills messy plot.",
      "review_date": "2013-03-09"
    },
    {
      "review_title": null,
      "content": "not much except for the greatest love scene ever. \"You've saved the kung woo heart exploder pincer move just for me?\"\r \"I'll just crawl over here and die now.\"\r two hours too late for the movie",
      "review_date": "2014-11-15"
    },
    {
      "review_title": null,
      "content": "I am going back and reviewing all Tarantino films i have watched in conjunction with Hateful 8 release. I found this film easier to watch as it had more of a focus on the dialogue of the film than the action sequences and it just seemed pacedI am going back and reviewing all Tarantino films i have watched in conjunction with Hateful 8 release. I found this film easier to watch as it had more of a focus on the dialogue of the film than the action sequences and it just seemed paced better. I still wasn't feeling too involved with the characters and was a bit ambivalent to the story probably because of its odd comic tone but i nevertheless enjoyed this film more.\r6/10",
      "review_date": "2015-12-30"
    },
    {
      "review_title": null,
      "content": "Quizás esta tenga poca acción comparada con la primera parte, pero tiene un mejor desarrollo y ritmo, lo que le da mejor apreciación y calidad",
      "review_date": "2020-05-17"
    },
    {
      "review_title": null,
      "content": "In this film, the second of two, the bride gets her revenge against Bill, the groom who nearly killed her in the day of their wedding. Directed and written by Quentin Tarantino, the film stars Uma Thurman and David Carradine.This movie isIn this film, the second of two, the bride gets her revenge against Bill, the groom who nearly killed her in the day of their wedding. Directed and written by Quentin Tarantino, the film stars Uma Thurman and David Carradine.This movie is the sequel of \"Kill Bill (Vol. 1)\", so the criticism I made for the first film almost fit perfectly in this second film. Tarantino thought both films as one. And I start by saying that I like some of the films that Tarantino has done, but I believe that Kill Bill was one of the worst of his career as a director.The film deserves applause for the performance of the actors, the good soundtrack and the good special, visual and sound effects. The main problem of this film is the non-linear narrative. It was a negative option because it makes everything more confusing than ever would be normally. Yes, because this movie is confusing and mixes film and filmmaking styles that have no apparent connection (it's rare to see a Japanese martial arts film with logical connection to the universe of American western). As I said to the first film, a person who knows nothing about this movie and never read anything about it, don't understand it. Luckily, this film can, after all, to frame the events in a more logical way than the first film, where scenes seem much more isolated from each other.The film's screenplay is interesting, although it has been virtually copied from another movie ( \"Lady Snowblood\"). But despite the basic idea is good (the bride betrayed by her groom, abandoned at the altar and nearly murdered in his own marriage), the way the film develops that is quite negative. The film does not explain Bill's reasons to kill the bride, which makes the situation seem far- fetched. On the other hand, the seemingly random way the film shows action scenes, western, or martial arts makes everything with a very forced and unreal appearance. Fans can say that its a satire, a tribute... say what they want. The film is still poor and far- fetched at the expense of those bad choices of the director.",
      "review_date": "2018-02-25"
    },
    {
      "review_title": null,
      "content": "The Bride continues her quest of vengeance against her former boss and lover Bill, the reclusive bouncer Budd, and the treacherous, one-eyed Elle. (8)",
      "review_date": "2021-08-19"
    },
    {
      "review_title": null,
      "content": "Loved it! It does not surprise me that some people don't though. Quentin T is an acquired taste. Loved the first one too! This guy makes movies the way I would, if I only could. He pulls no punches. Oh, and both movies had some great tunes!!!",
      "review_date": "2008-03-02"
    },
    {
      "review_title": null,
      "content": "Another beauty from a brilliant man. This movie is a psychological wonder. The ending was perfect because it mirrored the Bride and Bills warrior ability. This is why I love movies so much, and this is why I love Tarantino so much.",
      "review_date": "2008-08-10"
    },
    {
      "review_title": null,
      "content": "Though it wasn't blood splattering fun like the first, it is a great movie all its own and it ends up giving a great conclusion to the epic.",
      "review_date": "2009-03-19"
    },
    {
      "review_title": null,
      "content": "THIS is the kind of movie I want to see more of. Flawed, unpolished, and borderline inaccessible to half the population, but incredibly unique, ambitious, and memorable. Tarantino ignores the flat standards set out by hollywood and its hack THIS is the kind of movie I want to see more of. Flawed, unpolished, and borderline inaccessible to half the population, but incredibly unique, ambitious, and memorable. Tarantino ignores the flat standards set out by hollywood and its hack critics. This is not a \"good\" movie. This is not a polished movie. This is not a movie that recognizes, nor cares about, what fans of the first want to see. This is, purely and simply, a work of art in its rawest, most personal form. And it is incredible to behold.",
      "review_date": "2010-04-26"
    },
    {
      "review_title": null,
      "content": "[***SPOILERS***] This movie was absolutely amazing. Although without Volume 1 would not be half as great as we all hold it. Speaking of Volume 1, Volume 2 makes 10 times better. Since everything is finally explained, this movie has absolute[***SPOILERS***] This movie was absolutely amazing. Although without Volume 1 would not be half as great as we all hold it. Speaking of Volume 1, Volume 2 makes 10 times better. Since everything is finally explained, this movie has absolute greatness. Although there was less action and more feeling in this one, it was still filled with the fights. Especially the showdown between The Bride and Elle. One of the greatest parts of the movie was the part about snatching Elle's eye, and when Elle says \"I killed your master\". It was genius. Overall I give Kill Bill Volume 2 a 10 because I thought it was amazing.",
      "review_date": "2004-04-18"
    },
    {
      "review_title": null,
      "content": "Those ten minute scenes where nothing happens? When was this? Perhaps I was reaching for the popcorn or saying something to a friend when these ten minute scenes took place. Taranino is known for the energy in his films, and even though Kill Those ten minute scenes where nothing happens? When was this? Perhaps I was reaching for the popcorn or saying something to a friend when these ten minute scenes took place. Taranino is known for the energy in his films, and even though Kill Bill Vol. 2 (and also Jackie Brown) took on a more relaxed tone doesn't make them elegible for criticism such as yours evil D. And I quote: \"I gotta sit through 3 hours of paper-thin plot spread out over TWO films just to see a half-hour's worth of action? That sucks!\" Perhaps you should go back to watching Commando.",
      "review_date": "2005-12-20"
    },
    {
      "review_title": null,
      "content": "I agree with evil D. This was better than the first, (Thank God) but it was so slow. So slow...... It's trying to un-do the shallow-ness of the first. But, we spend more time learning about Bud than learning about the hero. Every scene I agree with evil D. This was better than the first, (Thank God) but it was so slow. So slow...... It's trying to un-do the shallow-ness of the first. But, we spend more time learning about Bud than learning about the hero. Every scene is overstuffed, ecspecially the part when Bill and The Bride are talking. I remember my mother saying something about the superhero speech being overdrawn. True, true.",
      "review_date": "2006-04-18"
    },
    {
      "review_title": null,
      "content": "7.6 Perfect sequel to a very cool movie. Alternately hilarious and excruciating. Pai Mei is a brilliant caricature.",
      "review_date": "2009-06-10"
    },
    {
      "review_title": null,
      "content": "Less action, more talking but it somehow lives up to the original's standards.",
      "review_date": "2009-07-27"
    },
    {
      "review_title": null,
      "content": "Like volume one, \"A truly beautiful and violent piece of filmwork from Quentin Tarantino\".",
      "review_date": "2006-02-19"
    },
    {
      "review_title": null,
      "content": "What's not to love about this movie? Fair enough, its not your type of film, but why even bother attempting to critisize the very elements that make is fantastic?? Tarantino, a self confessed comic book geek throws a comic book story at What's not to love about this movie? Fair enough, its not your type of film, but why even bother attempting to critisize the very elements that make is fantastic?? Tarantino, a self confessed comic book geek throws a comic book story at us on the big screen. Sharp, trademark, witty dialogue and adrenaline fuelled action scenes make this film two and a half hours of simple Tarantino fun. The Kill Bill franchise is one of a kind, and prehaps instead of 'know-all so-called film reviewers' condemning this film for its lack of realism and over-stuffed scenes, they should sit back and actually look at a piece of work that stands out brilliantly against the bleak and bland overly-used hollywood plot formulas. Great film. Great director.",
      "review_date": "2007-05-18"
    },
    {
      "review_title": null,
      "content": "I loved the first one, it was so amazing to watch a movie with iconic moments and swift action sequences. The first was intentionally designed to make you react on a gut level not a brain level. The problem here is that this film just goes I loved the first one, it was so amazing to watch a movie with iconic moments and swift action sequences. The first was intentionally designed to make you react on a gut level not a brain level. The problem here is that this film just goes on too long with so little material. Even the eventual showdown with Bill is a letdown and the samurai violence that the first one was great for has become joyless and depleted. This film is much different and probably owes more to the spaghetti western genre than the samurai/exlpoitation genre, but it fails at that to. Nothing is inconic, everything is forgettable. I would watch it once if you are dying to find out what happens, but after that, you'll have already forgotten why you cared. It was the journey that counted, and volume 1 was the better half of that journey.",
      "review_date": "2008-04-16"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWhen looking at Kill Bill: Volume 1, you look for a fun action movie, a stylistic revenge flick. You get that in Volume 2 as well, but the dramatic leanings of the film are much more evident. To take Volume 2 asa great movie is something that is easier to do than Volume 1, and it works. The highlight of the film, by a wide margin, was the finale scenes with Beatrix and Bill talking, their short battle, and coming to terms with Bill's death. David Carradine's acting was superb, and I fail to see how he was not nominated for an Academy Award for Best Supporting Actor the year this film was released. A great movie, plain and simple.",
      "review_date": "2013-12-17"
    },
    {
      "review_title": null,
      "content": "Such a ridiculous movie, just like the first part: There were so many cheap situations, especially the fights.. Who cares about women \"fighting\"? Did you notice also how often people were saying how beautiful the main character was? I findSuch a ridiculous movie, just like the first part: There were so many cheap situations, especially the fights.. Who cares about women \"fighting\"? Did you notice also how often people were saying how beautiful the main character was? I find her ugly btw. So these scenes were ridiculous for me also.The plot itself is unrealistic of course. Yes sure, a 50kg women is killing so many warriors, even male. Feminist fairy tale. Speaking of feminism. I like the revelation why Bill tried to Kill Beatrix. He did the right thing, he was the victim, not Beatrix.",
      "review_date": "2019-12-05"
    },
    {
      "review_title": null,
      "content": "It is good and enjoyable on one hand. On the other hand it is neither amazing nor as good as part 1 and maybe some parts drag on for to long. This might sound to negative as it also has its highlights, amazing scenes and a satisfying climax.It is good and enjoyable on one hand. On the other hand it is neither amazing nor as good as part 1 and maybe some parts drag on for to long. This might sound to negative as it also has its highlights, amazing scenes and a satisfying climax. Part 2 itself is again a mixture from revenge drama, martial arts movie (eastern), action movie, samurai drama and (spaghetti) western. It continues were the last movie ended. The bride has still 2 targets on her list before she can finally end everything with Bill. Short setup but also easier said than done as the targets are knowing she will come for them and are prepared. There are a few things that drag down my rating. One complain is that the fight scenes are not amazing enough. Again I repeat these are not bad but I expected more especially since the last movie set the bars higher. Something can be both good and a disappointment at the same time. Some parts of the movie are weaker and drag on for to long. I must remind that I have nothing against setting up characters even less if it is done in the show not tell style (One of the basic rules for movies). I think it misses the last push to wow me. There are however many good parts like the humor, good dialogues and the climax which is a good example how to subvert expectations in an awesome way. I like the flashbacks that gave more backstory and characterization to the characters and Pai Mei is just to enjoyable and awesome to not praise. Again the characters deliver a great performance without missteps. Uma Thurman as the bride is perfectly cast for this role and I say this is a flawless performance. David Carradine as Bill is such an interesting character and an antagonist you like. Gordon Liu as Pai Mei is the secret star of the movie. Michael Madsen does a great performance but is wasted at the end. Such a disappointment like getting a cake and drop it to the dirty floor before you had a chance to eat it. Lastly Daryl Hannah as Elle Driver again delivers. She is truly evil and an antagonist you love to hate. For the style, visuals and dialogue I praise Quentin Tarantino. You see clearly his effort and heart and soul put into the movie. It pains me not to give a higher rating for this reason. Overall I gave my final statement already at the beginning. It is a good movie not a great one. It delivers but does not shine or wow me. It is definitely worth watching because of the highlights but can be a disappointment too.",
      "review_date": "2021-03-05"
    },
    {
      "review_title": null,
      "content": "The two Kill Bill volumes were supposed to be one long movie, but they both feel like two completely different films. While Vol 1 is focused more on the action and violence, Vol 2 spends little time focused on these aspects. It focuses moreThe two Kill Bill volumes were supposed to be one long movie, but they both feel like two completely different films. While Vol 1 is focused more on the action and violence, Vol 2 spends little time focused on these aspects. It focuses more on delivering a profound and intense which manages to entertain as much as, or even more than, the action-heavy Volume 1.",
      "review_date": "2020-09-01"
    },
    {
      "review_title": null,
      "content": "The bride continues her solitary mission of revenge, in a second part better developed than the first, with dynamic fighting scenes, tributes to the martial arts genre and a teacher -Pai Mei- who makes the master Miyagi look like a mereThe bride continues her solitary mission of revenge, in a second part better developed than the first, with dynamic fighting scenes, tributes to the martial arts genre and a teacher -Pai Mei- who makes the master Miyagi look like a mere hobbyist. This without forgetting an emotional ending.",
      "review_date": "2020-07-19"
    },
    {
      "review_title": null,
      "content": "Kill Bill Volume 2 completes the story. 2 part contains less action, and more reveals the story. It is more thoughtful and contains memorable scenes. An excellent finale of the story, although the 3 part is in production.",
      "review_date": "2021-11-10"
    },
    {
      "review_title": null,
      "content": "Excellent SequelVol. 2 is violent, exciting, terrifically acted, and thrilling to the core.",
      "review_date": "2019-07-24"
    },
    {
      "review_title": null,
      "content": "It's hard to follow up a perfect flick like vol.1. Really no matter what you do its gonna be a tough disappointing and it was too me at least. That being said they are two completely different films. Where the first one was a bad ass martialIt's hard to follow up a perfect flick like vol.1. Really no matter what you do its gonna be a tough disappointing and it was too me at least. That being said they are two completely different films. Where the first one was a bad ass martial arts spectacular. This one is more story driven, comedic and western. Wi th h that said it's still a great movie. Picking up after the events of the first we witness the battles between the bride and elle as well as Budd and finally Bill. There are some surprising twists along the way as well as some insanely fun sequences. But for all the build up it ends up feeling a touch lackluster especially after the events of the first. I can definitely see what he was going for and I feel th ed film us mostly successful it just needed a touch more punch.Budget: $30MBox Office: $152.3M8.5/10",
      "review_date": "2020-07-12"
    },
    {
      "review_title": null,
      "content": "The end of the line, no more circles, no more juggling, this circus show has a speech for its last act.Kill Bill Vol. 2\n\nTarantino's second and final volume of this gore-y tape is a profound quest for balance. I cannot emphasize more on howThe end of the line, no more circles, no more juggling, this circus show has a speech for its last act.Kill Bill Vol. 2Tarantino's second and final volume of this gore-y tape is a profound quest for balance. I cannot emphasize more on how beautifully does this satisfying sequel carries the first one. If you were a bit squeamish in your first time, you will feel safe and more importantly enjoy this time- I'm talking about the film, The Film- with a neater narration in the driver's seat. Although I'd say that the writer and director Quentin Tarantino seemed a bit insecure about this volume. For he had kept all the cards hidden for this round. And hence, it could grow hefty for the viewers. But then you should never complain for too much substance.For stylizing all the choreography on the other hand is Uma Thurman. By this half, she has sunken her teeth well enough to scare you. Her underrated performance knocks you down not by those one liners- never by them, in fact- or cool action tricks but sorrow and regret in her eyes, in her revenge when she claims it. That baffling response is surprising and human, tricking us into believing her. The film also covers the training of Thurman's character which focuses on balancing the emotions.But I think it is the humble nature, the admiration that these so called \"bad guys\" have for the protagonist and the situation they find themselves in, is the actual nail in the coffin. Every kill, ever body that Thurman redeems tales something from her and us, and in order to portray that, Tarantino never rushes out the event. The calmness that these characters hold amidst the swooshing and whooshing of the cameras, never makes zero sense. The family in Kill Bill Vol. 2 that she returns to, that she is a part of, is familiar to us.",
      "review_date": "2019-09-12"
    },
    {
      "review_title": null,
      "content": "The first Vol had it's great scenes and all but for me this one is way better due to the hilarious acting of the Kung Fu Teacher the fact that the actors had those huge smirks on their faces showing just how much they loved playing over theThe first Vol had it's great scenes and all but for me this one is way better due to the hilarious acting of the Kung Fu Teacher the fact that the actors had those huge smirks on their faces showing just how much they loved playing over the top on this movie, unfortunately the ending was not one of the best and it just left me wishing it had a bigger climax.",
      "review_date": "2021-01-01"
    }
  ],
  "num_reviews": 138
}