{
  "title": "Man on Fire",
  "rating": 8.5,
  "release_date": "2004-04-23",
  "genre": [
    "Action",
    "Drama",
    "Thriller",
    "Crime"
  ],
  "summary": "Denzel Washington stars as a government operative/soldier of fortune who has pretty much given up on life. In Mexico City, he reluctantly agrees to take a job to protect a child (Fanning) whose parents are threatened by a wave of kidnappings. He eventually becomes close to the child and their relationship reawakens and rekindles his spirit.Denzel Washington stars as a government operative/soldier of fortune who has pretty much given up on life. In Mexico City, he reluctantly agrees to take a job to protect a child (Fanning) whose parents are threatened by a wave of kidnappings. He eventually becomes close to the child and their relationship reawakens and rekindles his spirit. When she is abducted, his fiery rage is unleashed on those he feels responsible, and he stops at nothing to save her.  (20th Century Fox)… Expand",
  "critic_reviews": [
    "Man on Fire, with a best-ever Denzel Washington, is the first (nonreligious) sure thing to hit the multiplex this year.",
    "By no means perfect - a twist in the tale overextends its already lengthy running time - but it is terrific fun.",
    "For what Man on Fire delivers, it's worth enduring Scott's hyperkinetic visual techniques.",
    "It's resolutely grim and rather predictable but very compelling, and it offers a commanding star vehicle for Denzel Washington.",
    "The dead-serious Man on Fire awakens a genuine sense of bloodlust in the viewer. This is a slick, big-budget, A-list production designed to stoke our basest impulses -- to make us long for, and cheer at, bloody, merciless vengeance.",
    "No one rises above the material, though, except for Walken, who looks pleased with the paycheck and the top-shelf tequila. As a shady lawyer, Mickey Rourke is smooth and funny, but recognizable only by his familiar purr.",
    "Washington's stoic persona here conceals a volcanic rage, and the cast of pros--including Giancarlo Giannini, Mickey Rourke and Rachel Ticotin--support him with relish.",
    "Ultimately more bleak and furious than most Hollywood tales of this sort. Man on Fire plays it out to the bloody end, like there’s no fire extinguisher in Mexico but for the oceans that hold its borders.",
    "Man on Fire, which starts off as a good example of super-glitz moviemaking, gradually turns into a movie on fire -- another helter-skelter, big-studio spending spree. Too bad. It could use a lot more of Walken, Fanning and some more honest drama.",
    "Not too many R-rated revenge pics depend on \"Uptown Girls'\" Dakota Fanning for the stronger scenes. Yet once the 10-year-old star exits the picture, Man on Fire starts blowing a lot of smoke.",
    "Employs superb craftsmanship and a powerful Denzel Washington performance in an attempt to elevate genre material above its natural level, but it fails. The underlying story isn't worth the effort.",
    "The film is always watchable, and the confrontations contain undeniable edgy excitement. But even if this weren't a remake, it would be a remake. Hollywood filmmakers have fished these waters so thoroughly that it's virtually impossible to land a big catch.",
    "One of the more absorbing and palatable entries in the rather disreputable \"Death Wish\"-style self-appointed vigilante sub-genre.",
    "The film as a whole, while possessing a kind of vicious beauty, feels as cold and as embalmed as a corpse.",
    "Intentional or not, Man on Fire's over-the-top evocation of Christian retribution goes a long way to making this otherwise standard revenge fantasy watchable.",
    "That there's moral ambiguity to his actions represents some sort of step up from the cinematic norm. Alas, Christopher Walken has very little to do as Creasy's best buddy.",
    "Where Quentin Tarantino's \"Kill Bill: Vol. 2\" radiates freshness and vigor, Man on Fire feels vaguely like something left over from the 1980s, when action heroes were one-note tough guys methodically picking off baddies.",
    "Scott swaddles this fundamentally straightforward revenge story in a jumble of bleary freeze frames, random changes of color saturation and film stock, jump cuts and stuttering montages, splashing text from some menacing word soup onto the resulting collage of chicly disturbing images.",
    "Despite its high craft level and Washington's participation in it, this movie's showy violence is finally as deadening as the over-emphatic violence in these kinds of films generally is.",
    "A schizophrenic outing from habitually hysterical director Tony Scott (True Romance, The Fan), Man on Fire is a movie of two unreconcilable halves.",
    "The first hour is sharply directed, character-driven drama that ranks with Scott's best work. Then he lapses into his usual mode - more a bombardier than an entertainer, filling the screen with sadistic violence and arbitrary plot twists. In all, a wasted opportunity.",
    "It is a good hour too long, although it does boast Christopher Walken.",
    "Seriously, someone needs to stage an intervention, sit Scott down, and tell him that repeated jump cuts, slow-motion shots, and fiddling around with the exposure don’t enhance the viewing experience.",
    "Scott apparently decided it was a good idea for his subtitles -- much of the film is in Spanish -- to shimmy across the screen, to fade in and out dramatically, and in general do even more to distract us.",
    "If your idea of a bargain is two bad movies for the price of one, then shell out for Man on Fire. And don't fret about that incendiary title because this thing is all fuse.",
    "Whenever the movie's point of view turns omniscient, and we're seeing events from the director's vantage point, Man on Fire becomes a blurry, shaky mess.",
    "On the plus side, the casting is superb - and the acting, too. Although the context is overwrought and the moviemaking over-the-top, Washington acts from the ticker out.",
    "Scott's latest exercise in assaultive excess nevertheless lingers for two and a half hours, like a drunken houseguest who won't leave.",
    "Man on Fire is as ludicrous as \"John Q,\" \"Virtuosity\" and \"Out of Time,\" yet substantially more violent, artificial, self-conscious and dull.",
    "This is a time-tested movie con, but rarely has it been deployed so contemptibly.",
    "This movie is a predictable, gruesome piece of business.",
    "The movie's mortal failing is echoed in the religious medal Pita gives Creasy in a gift of innocent, uplifting love: Finding heft or coherence within all the lugubrious agitation is a lost cause worthy of St. Jude.",
    "Not even within earshot of a masterpiece, Man on Fire, based on its ratio of production costs to quality alone, may prove to be the worst movie of 2004.",
    "Man on Fire is ponderous and bloated, dragging the Bible and Giannini into its swirling cesspool. Scott can't give the movie any real emotional weight. And Washington gives his first lifeless performance.",
    "It's dispiriting to see good actors doing smart, solid work with so much unadulterated garbage swirling around them. Scott's art is also death, and we, the audience, are the ones he's jabbing at with his ruthless paintbrush. It's about time someone told him where to stick it."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Powered with beautifully frenzied cinematography and poignant performances by Fanning and Washington, \"Man on Fire\" is a unstoppable train advancing to the audience with mighty, brazen force.",
      "review_date": "2011-09-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of Denzel Washington's greatest films. Second only to American Gangster and perhaps Training Day.",
      "review_date": "2008-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An amazing performance from Denzel Washington makes what would have been an all right movie, into a movie that will be memorable for time to come. This amazing true story of a mans love and retribution inspire and entertain to the end.",
      "review_date": "2013-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is absolutely perfect the art direction is the best ive ever seen, the acting is top notch and this is one of the most emotionally engrossing movie ive ever seen... i rarely get upset at a movie and this movie i was almost in This movie is absolutely perfect the art direction is the best ive ever seen, the acting is top notch and this is one of the most emotionally engrossing movie ive ever seen... i rarely get upset at a movie and this movie i was almost in tears at the end. Critics really did miss the boat... the only downfall was the length... but i cant find a scene to take out so i think the length was necessary.",
      "review_date": "2008-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Man on Fire is a pretty basic revenge tale, although I enjoyed the movie. I felt as if the movie did a good job at building the relationship between the two main characters, and took the needed time to do it. My largest complaint about theMan on Fire is a pretty basic revenge tale, although I enjoyed the movie. I felt as if the movie did a good job at building the relationship between the two main characters, and took the needed time to do it. My largest complaint about the movie is that it utilizes too many frame-effects for crucial scenes. The director was trying too hard to be artsy. Although the effects fit in certain scenes, it was over done.\r Plot: 7.5/10\rActing/Cast: 8/10\rScript/Dialogue: 8/10\rVisual Effects: 6/10\rSoundtrack: 10/10\rThemes: 8/10\r Overall, I would recommend this movie. It is worth a watch.",
      "review_date": "2014-11-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is an excellent film with outstanding performances. A lot of tension and unexpected turns",
      "review_date": "2018-03-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another master-class movie with Denzel Washington as the movie's biggest highlight. He plays as Crease,\ra skilled combatant entrusted with the task to protect a little girl; Pita. He is a force that should be feared; especially when youAnother master-class movie with Denzel Washington as the movie's biggest highlight. He plays as Crease,\ra skilled combatant entrusted with the task to protect a little girl; Pita. He is a force that should be feared; especially when you don't give him answers.\r It's clear that most professional critics are cynical  They see a man sadistically brutalising kidnappers for answers; I see a man doing the right thing. Those people were  criminals. Plus, if you were smart, you would realise that not once did he take pleasure in torturing his targets. In fact, he was more hesitant in doing so. He merely took the measures that were required. If someone you cared for; Pita in this instance, was taken away by these sick bastards, would you just try to talk to them for information? Treat them nicely? Don't  kid yourself, I'm sure you would result in brutality out of desperation.\r In saying that, Man On Fire is an excellent movie for its dramatic depth and moral.",
      "review_date": "2013-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "an amazing movie that critics under rate dont listen to them giving it average it was perfect buy this movie on blu ray you and see what you think ok",
      "review_date": "2013-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was way better than the critics gave it credit for! I think they are simply jealous of Tony Scott.",
      "review_date": "2009-03-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is awful, truly terrible.  It uses every cinematic gimmick known to man which only serves to make the film even worse.  Plus corny, melodramatic ham acting.  All these reviews gush about it because it isn't PC to be critical of aThis film is awful, truly terrible.  It uses every cinematic gimmick known to man which only serves to make the film even worse.  Plus corny, melodramatic ham acting.  All these reviews gush about it because it isn't PC to be critical of a film with Washington in it.  But it sucks.",
      "review_date": "2016-06-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\" Denzel Washington's performance is Action pack , fun the best film in his career \". It's obviously that Washington is the legend of acting  in all of his films which critics like it or not. I love it when Denzel is in one of his dramatic\" Denzel Washington's performance is Action pack , fun the best film in his career \". It's obviously that Washington is the legend of acting  in all of his films which critics like it or not. I love it when Denzel is in one of his dramatic action pack thriller's  Training Day , The Equalizer , Inside man , american gangsters , and Flight. Also good directing from Tony Scott. Denzel Washington made it happen and director Tony scott made it happen to. Grade A+",
      "review_date": "2014-09-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While it is predictable and generic, Man on Fire is a a fun and entertaining movie filled with great acting performances, impressive action sequences and a sad ending. If you like action movies or if you are a fan of Denzel Washington, youWhile it is predictable and generic, Man on Fire is a a fun and entertaining movie filled with great acting performances, impressive action sequences and a sad ending. If you like action movies or if you are a fan of Denzel Washington, you will undoubtedly appreciate this movie.",
      "review_date": "2018-07-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An amazing acheivement by Tony Scott. I dont know how in hell Man on Fire got a 47 average on metacritic, but I completely disagree. I am normally a hard reviewer, but this movie just blew me away. The presentation, the story, the visuals, An amazing acheivement by Tony Scott. I dont know how in hell Man on Fire got a 47 average on metacritic, but I completely disagree. I am normally a hard reviewer, but this movie just blew me away. The presentation, the story, the visuals, the acting, you name it... This is destined to be a classic Revenge movie. It's just that good!",
      "review_date": "2006-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I like movies that are unapologetically what they are supposed to be, and this is an anti-hero action movie done well. Denzel is a bad??? with a heart of gold reopened by a charming Dakota Fanning, and, when the inevitable kidnapping occurs, I like movies that are unapologetically what they are supposed to be, and this is an anti-hero action movie done well. Denzel is a bad??? with a heart of gold reopened by a charming Dakota Fanning, and, when the inevitable kidnapping occurs, Denzel does exactly what you'd hope he would - rips Mexico City apart.",
      "review_date": "2005-09-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "OK the acting was alright, the script, naaa, the story was not origanal. but this is the frist time i will give a film a 10 out of 10 because of the way it was shot. THIS MOVIE IS EYE CANDY. the use of color filters really fits the mood of OK the acting was alright, the script, naaa, the story was not origanal. but this is the frist time i will give a film a 10 out of 10 because of the way it was shot. THIS MOVIE IS EYE CANDY. the use of color filters really fits the mood of every seen, they way to light shines in your face, it's overwelming and Beautiful. even the subtitle were cool. yah that's right subtitles, instead of running along the bottom they pop up in ranbom spots. the directory of photogerphy for this film should be concidered an artist. if only all films were shot this way.",
      "review_date": "2006-02-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is one of my favorites. Tony Scott is a good director, who has an extremely large amount of potential, and while Man on Fire shows off his skills, i still feel Scoott hasn't quite made his masterpiece. Excellent movie, highly This movie is one of my favorites. Tony Scott is a good director, who has an extremely large amount of potential, and while Man on Fire shows off his skills, i still feel Scoott hasn't quite made his masterpiece. Excellent movie, highly reccommend it to anyone. Expect more, and better, from Tony Scott...just not Deja Vu.",
      "review_date": "2007-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good film. Entertains and don't look for logic. Also is not that violent. Dakota Fanning and Denzel rock.",
      "review_date": "2006-03-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Looking past the oddities of the editing (especially the subtitles) is easy enough when you see Washington do what he does with this great characer in this pic. People who cannot wrap themselves up in what Creasy is going through are not Looking past the oddities of the editing (especially the subtitles) is easy enough when you see Washington do what he does with this great characer in this pic. People who cannot wrap themselves up in what Creasy is going through are not strong enough to really look at their lives; how they are making decisions that may cause God not to forgive them almost daily. Sure, it's not pleasant to think about, but we are all men on fire at times. When you are crossed and know there is only one way to set things right, will you have the courage to do it? If you don't like this movie, the answer is no. Go lay back on the couch, have another Tums, and call your mommy. This film makes us ask ourselves a lot of questions like this, and the gutless need not apply. .",
      "review_date": "2006-04-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A feell good film with a twist! Senzel Washington shows just how diverse he can be, great!",
      "review_date": "2006-08-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Forget what the critics say, there profession is over-rated anyway becides there all a bunch of fat people with a few posh words. This movie is great to watch for a night in, unique, emotional, and realisticly, maybe.........probably true, Forget what the critics say, there profession is over-rated anyway becides there all a bunch of fat people with a few posh words. This movie is great to watch for a night in, unique, emotional, and realisticly, maybe.........probably true, meaning the methods of interrogation outside the law. My opinion along with everyone i know who has seen this movie, \" I regret that movie critics should professionally exist! \" :D 9/10 - high recommended.",
      "review_date": "2008-12-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of my top 10 favorite movies in the last 10 years. I am a pretty harsh judge of movies too. The only flaw that I can see with this movie is that it is drastically overstylized but I dont have too much of a problem with it. The This is one of my top 10 favorite movies in the last 10 years. I am a pretty harsh judge of movies too. The only flaw that I can see with this movie is that it is drastically overstylized but I dont have too much of a problem with it. The action is great, the suspense is great, the acting is very good. It has all the makings of a good action movie and makes me tingle every time I watch it because of the strong emotions in the movie. Denzel delievers a performance of a life time playing a burned-out ex-FBI agent. If I was going to watch an action movie with some substance I would definitely choose this one 8.6/10 The visuals are funky but they fit with the overly stylized music and plot.",
      "review_date": "2009-05-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very good film -- the critics missed the boat, perhaps because revenge movies are not PC.",
      "review_date": "2006-08-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I cannot believe some of the scores from the professional reviewers. Were they watching the same film! Okay the film has some flaws but was always watchable and had another very good performance from Denzel Washington and Dakota Fanning who I cannot believe some of the scores from the professional reviewers. Were they watching the same film! Okay the film has some flaws but was always watchable and had another very good performance from Denzel Washington and Dakota Fanning who is turning into an excellent actress. Some of the revenge killings may have seemed a little over the top and I'm not a great lover of Mr Scotts visual trickery which IMO derailed the middle segment of the film. However I cared about the characters and the relationship between Denzel seeking redemption and Dakota bringing a little light into his soul is very believable. The anger that he feels at the turn of events is and how he reacts because of his past as the only way he knows how. Altogether its an interesting blend of violence, emotion, humanity and also very heartwarming in places. It might not be a masterpiece but it was an excellent way to spend a couple of hours.",
      "review_date": "2007-07-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One half good redemption drama, one half SWEET epic revenge, and a touch of true, sacrificial heroism. 47? This movie could go for an oscar.",
      "review_date": "2005-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "John W. Creasy's masterpiece may well be death but Tony Scott's masterpiece is Man on Fire. This is a movie that makes you so upset and furious with the villains that you want to start smashing things. Then it unleashes a growling DenzelJohn W. Creasy's masterpiece may well be death but Tony Scott's masterpiece is Man on Fire. This is a movie that makes you so upset and furious with the villains that you want to start smashing things. Then it unleashes a growling Denzel Washington to do just that. I can't think of any other movie that uses extreme violence as a tool for such deep catharsis. That actually sounds impossible but Man on Fire is so well constructed that every bullet fired makes you want to shed another tear. Absolutely perfect.",
      "review_date": "2012-08-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very surprised that the critics gave such low reviews for a classic Denzel film.  Saw this a couple of weeks ago for the first time, was shocked I missed this.  Great plot and always nervous of what will happen next.",
      "review_date": "2011-07-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This has become one of my favouite movies of all time. From the great soundtrack, the awesome cinematography/editing and the performances of the actors this film ticks all the boxes. Dakota Fanning is unbelievably good for her age and DenzelThis has become one of my favouite movies of all time. From the great soundtrack, the awesome cinematography/editing and the performances of the actors this film ticks all the boxes. Dakota Fanning is unbelievably good for her age and Denzel lives up to his usual standard. The first half of the film is quite slow but it is required in order to create the backstory of the Creasey/Peta relationship. Once the action kicks in the film really takes off. If I had one criticism, which I'm finding hard, it's that the film could be more violent. The first act of revenge is the most violent so after that it's a bit of a letdown. The ending could have you in tears.",
      "review_date": "2011-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Creasy wants forgiveness for his violent life and then proceeds to hunt down and kill people in the most sadistic ways.",
      "review_date": "2020-03-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was a good story, and they could have done so much more with it. I found this movie to be quite slow and boring. The character development is terrible, a lot of the acting is poor, and the cinematography, just makes things that much moreThis was a good story, and they could have done so much more with it. I found this movie to be quite slow and boring. The character development is terrible, a lot of the acting is poor, and the cinematography, just makes things that much more confusing. I love Denzel Washington and when he teams with Tony Scott, it's usually magic, but they missed the mark in a big way on this one.",
      "review_date": "2013-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As always, Denzel Washington delivers, but where this movie fails is in the direction. The jarring effects shown at times is a major turn off and leaves the viewer wondering if it is worth it to go on. However, for an action movie, it isAs always, Denzel Washington delivers, but where this movie fails is in the direction. The jarring effects shown at times is a major turn off and leaves the viewer wondering if it is worth it to go on. However, for an action movie, it is pretty good and provides some good thrills and suspense along the way. Sure, it's not a cinematic masterpiece, but it's still entertaining and overly criticized by the critics.",
      "review_date": "2013-11-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beside the annoying editing and shaky-camera effect, Mr. Denzel's portrayal of a tormented man seeking revenge make this a worth watch.",
      "review_date": "2013-04-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Featuring a moving performance from both Washington and Fanning, \"Man On Fire\" proves to be a frenetic, violent, and engraining experience.",
      "review_date": "2012-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This truly is one of the most touching and best movies of all time!\rDenzel does a great job along with the rest of the cast. This movie made me ball. Lisa Gerrard does a excellent job with the music!\r I love this movie",
      "review_date": "2013-05-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Gritty, violent, and action-packed, Man On Fire showcases Denzel Washington's acting talent. Maybe it was a bit too violent, but it's an R-movie.\r The acting and cinematography was great. Reminds me of Taken.",
      "review_date": "2013-12-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "AWESOME movie this one has abit of age now but is still one of my favourite movies, Washington and Fanning do a fantastic job and it has a great story.",
      "review_date": "2015-03-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Denzel Washington & Dakota Fanning display an amazing performance, from the beginning to the end.  The music fits the atmosphere,  the dialogue can make you cringe, and or feel sorrow for the main characters. P.S -critics are stupid.",
      "review_date": "2015-06-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Should give a little contribution , knowing that Denzel Washington Dakota Fanning nanny is not fair , but it was a good movie plot , criticism is a fickle mother.",
      "review_date": "2015-07-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When people think of 'Man on Fire', they think of this 2004 film but some probably don't realise it's a \"remake\" of a less critically well received 1987 film.If asked which from personal opinion is better, it would be a hard choice. As anWhen people think of 'Man on Fire', they think of this 2004 film but some probably don't realise it's a \"remake\" of a less critically well received 1987 film.If asked which from personal opinion is better, it would be a hard choice. As an adaptation of the source material, author AJ Quinnell would choose this easily. It is easy to see why that is the case, there are more lines in this version lifted from the source material and more of the spirit is there, apparently Quinnell intensely disliked the 1987 film going as far to saying that he couldn't recognise any of what he wrote in there. On its own terms, it is not an easy pick. Both films are uneven but both films are also very worthwhile (yes, will admit to liking the 1987 film despite it not being a great film), they have a numerous amount of strengths but both have quite a few faults.Talking about this 2004 film, it's uneven with some things that stop it from being as on fire as its lead performances. As said above though there is a lot to like and enough to make it more than watchable. Visually, 'Man on Fire' has its moments. The locations are both stunning and gritty and there is evidence of a slick atmospheric stylishness and director Tony Scott providing a few inventive touches. The film is hampered quite severely however by Scott excessively going overboard on the visual style, too much of it is more gimmicky and self-indulgent than it is clever and imaginative which is a real shame.'Man on Fire' has a haunting and cool music score that really adds to the film and drives the action well. The script has wit and tension.Storytelling, like with the production values, is more problematic. It is very successful in the first half, the central chemistry between Denzel Washington and Dakota Fanning is truly heartfelt and beautifully written. Really liked that the care and trust were realistically gradual and not evident straight away. In the more action-oriented and thriller-like second half, the action is well-choreographed and suitably uncompromising, it's fun and suspenseful and it makes more consistent sense than the 1987 film.It is let down sadly by the pace being drawn out in places while the ending is more logical, more exciting and more emotional in the 1987 film, it's a bit of an illogical fizzler here. The film is sadly rather too overlong too by about twenty minutes, this could have been cleared up by tightening the pace in the second half.Denzel Washington excels in the lead role as does a charming and beyond her years mature Dakota Fanning. Their chemistry is one of the highlights of 'Man on Fire'. The supporting cast is more uneven, with a fun if underused turn from Christopher Walken and a strong Radha Mitchell but Mickey Rourke especially is wasted in a role little more than a throwaway. The villains too could have been more threatening. Scott's direction succeeds in the action and direction of the actors but is really messy visually.Overall, worthwhile but not the on fire film it could and should have been. 6/10 Bethany Cox",
      "review_date": "2022-03-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Truly an underrated movie, Man on Fire is great movie that is loved by fans but not so much by critics. Even thought the editing of Man on Fire looks odd, this movie does such a great job with the chemistry between Denizel Washington andTruly an underrated movie, Man on Fire is great movie that is loved by fans but not so much by critics. Even thought the editing of Man on Fire looks odd, this movie does such a great job with the chemistry between Denizel Washington and Dakota Fanning and characterizing Washington's character.",
      "review_date": "2015-11-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nCapable action/thriller based on the 1980 novel of the same name which was originally given a film treatment in 1987.\rDenzel Washington stars as John Creasy, a washed up and out of work, ex-military specialist whose background is somewhat shrouded in mystery. A borderline alcoholic, he approaches an old army buddy Paul Rayburn (Christopher Walken) who suggests he tout himself as a bodyguard in Mexico via his security firm. Creasy is reluctant, but understands he doesn't have any other real options for employment.\rCreasy is taken on the Ramos family. Husband Samuel (Marc Anthony), wife Lisa (Radha Mitchell) and their 9 year old daughter Guadalupe 'Pita' (Dakota Fanning).\r Creasy struggles to find his place, having led a solitary life for so long and having also fought against suicidal thoughts. His drinking and overt recklessness causes Samuel and Lisa to question their choice of hiring him. However, because his job is bodyguard to Pita, Creasy finds himself becoming more and more like a surrogate father, especially as Samuel is away a lot of the time on business. This manifests itself not just with the strengthening bond between Pita and himself, but Lisa (seeing that bond growing) begins to develop romantic feelings for Creasy that lead to an awkward moment where she makes a pass at him.\r Creasy begins to rediscover his own soul through Pita's unwavering belief in him, but also through helping Pita overcome the fears and anxieties she has within her own life.\rThis culminates in Pita winning a swimming competition due to Creasy's training methods, which help Pita to understand her shortcomings, but also that improvement comes from dedication to achieving goals.\r Creasy takes Pita to meet Paul and his Mexican wife, sharing stories and enjoying the moment. Pita gives Creasy a necklace with an image of St. Jude, the Patron Saint of Lost Causes, as she explains it to him.\rHowever, throughout this narrative, during the various car journeys that Creasy and Pita have had to take, there's been suspicious activity from a group of men in a white car, a car which Creasy and Pita have made a point of noticing.\r Things come to a head when, after a music lesson, Pita is abducted off the streets by a group of armed men, seemingly aided by the Police who had cordoned off the street at both ends. This is confirmed when two of the men Creasy takes out in the ensuing shoot-out are identified as cops.\rCreasy ends up being looked after in an animal hospital, now a wanted fugitive and cop killer. Paul arrives and explains that the abductors have demanded a $10 million dollar ransom, and Samuel will pay this from the insurance money he'll receive.\rThings don't quite go according to plan however, and Paul returns a few days later to announce that someone ambushed the 'drop'. More bullets and more death, except this time one of the victims was a close relative of the leader of the abductors... With the money stolen, and a death of a family member, the abductors announce they've killed Pita as a warning to others who might try to rip them off in the future.\r Creasy takes it upon himself to seek revenge. With the help of Mariana Guerrero (Rachel Ticotin), a local reporter, he tracks down one of the men responsible after finding Pita had noted down the license plate of the white car in her journal.\rMariana uses her sexual relationship with local AFI officer Miguel Manzano (Giancarlo Giannini) to obtain the information Creasy needs, but also to make sure that Creasy gets a fair run at the bad guys without any interference.\rIt's revealed, by Paul in a short conversation with Miguel, that Creasy is not a man to mess around with. That the people who abducted Pita, and anyone else involved via association, will undoubtedly end up dead. Paul explains that Creasy will deliver more 'justice' in a couple of days than the corrupt judicial/political/policing system could in 10 years......\r Man on Fire is a good, solid thriller. But it's let down by several things.\r For every good acting performance (Washington, Fanning and Walken are all phenomenal), there's a mediocre to just plain terrible one (Mitchell, in particular, is completely unbelievable in her role).\rBeyond that there's the camerawork. Like a lot of action films shot during the immediate aftermath of The Matrix trilogy, there's an almost insane amount of 'shaky-cam'. I know it's supposed to give the impression of something being filmed 'live action', but it makes certain scenes in the film unintentionally nauseating.\rAdd to this a running time of nearly 2 and a half hours(!!), which is at least 45 minutes too long, and you've got a bloated film that sags immensely during the 'set up', but it is (just about) paid off by Washington going into full on Grim Reaper mode!\r Ultimately, it's one of those films which has some truly great moments, moments people talk about during film discussions down at the pub. But overall, it's nothing that special.\r Hence the rating of 6 out of 10.",
      "review_date": "2016-04-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Man on Fire isn't the best Denzel Washington movie I've ever seen, but it does give that guy an effort for at least trying. Watch if you want, but don't expect much anyways.",
      "review_date": "2016-06-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "przeciętna naparzanka z Denzelem w roli głównej dostaje ode mnie +1 za Meksyk i +1 za to że jestem uzależniony od naparzanek",
      "review_date": "2021-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Tony Scott (QEPD) tal vez no era un director tan talentoso como su hermano Ridley. Lo que sí es cierto es que supo cómo hacer de esta historia lo más potable posible con el menor número de clichés. Si le hubieran editado unos cuantos minutosTony Scott (QEPD) tal vez no era un director tan talentoso como su hermano Ridley. Lo que sí es cierto es que supo cómo hacer de esta historia lo más potable posible con el menor número de clichés. Si le hubieran editado unos cuantos minutos al primer acto estaría un poco mejor.",
      "review_date": "2022-01-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Man on Fire isn't a bad thriller with drama elements featuring Denzel Washington. A simple linear plot, as in most films involving Washington. The plot is read literally from the first minutes, you should not wait for any twists in the film.",
      "review_date": "2022-06-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Disgraced former special ops officer is hired to protect a rich man's child. He grows to love her like a father and vice versa. Then she's kidnapped and he sets out to get revenge. Great cast. Denzel is always good. Dakota Fanning is smartDisgraced former special ops officer is hired to protect a rich man's child. He grows to love her like a father and vice versa. Then she's kidnapped and he sets out to get revenge. Great cast. Denzel is always good. Dakota Fanning is smart and adorable as the rich man's daughter. Christopher Walken is good but doesn't have much to do here. The film is split in two. The first half showing Denzel getting Redemption because a child has faith in him. The second half is all Revenge. Which of course we want to see, but it's far less interesting. I think it would have been better to see some pain and loss in his vengeance. But it's mostly just generic killing.",
      "review_date": "2019-06-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first fifty minutes or so of the movie is quite slow and is all about John's relationship with Pita, which could be seen as boring to some, if your only after the large special effects and action scenes but I think it is worth it toThe first fifty minutes or so of the movie is quite slow and is all about John's relationship with Pita, which could be seen as boring to some, if your only after the large special effects and action scenes but I think it is worth it to properly set the scene for whats to come, for the characterisation/development and to make you really root for John as he sets out to discover who was behind what happened. You can tell that John tried to keep a distance from Pita as not to get attached to her personally or to lose focus on his job to keep her safe and secure but it turns out that they form quite a bond as friends, with Pita often asking John about himself. Once the action starts, its quite suspenseful and there are some pretty impressive special effects, mainly explosion scenes as well as some brief black and white flashback scenes. It does become quite fast paced and the story isn't sacrificed for the action either, the plot thickens as John discovers more about the underground organisation behind many of Mexicos kindappings and there are some real twists in the plot, to keep the viewer guessing.The performances are all good, Dakota Fanning in particular, playing a very clued up little girl. The story is quite believable and gritty and although it is quite long at over two hours and ten minutes, it had enough suspense and action to keep me watching, indeed I found it quite absorbing, in such a way as that I was glued to the screen and I didn't feel that it was too unrealistic, that there was too much 'violence for violence sake' (as there is a fair bit of violence but it didn't seem overly excessive, given the plot).I thought that it was, at times, quite an emotional movie, in that you do care for, or about, the main characters. The lighting used at times (dark and grainy) gives a gritty feel that I thought worked quite well too.About the only downside (other than the slow start which might bore some impatient people perhaps) is that the ending may be seen as a bit too 'Hollywood' by some but I'll say no more about that, so I don't give too much away. Oh and also there are alot of Spanish subtitles too, so be aware of that too, if reading many subtitles in a movie really puts you off then this may not be for you, although thats not to say that there isn't English dialogue but the movie is set in Mexico... there is more English spoken than Spanish but there were still quite alot of subtitles. The subtitles themselves were shown on screen in a dynamic way with the words swooping onto the screen sometimes, rather than just appearing statically, at times.",
      "review_date": "2021-11-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A good story, well produced and on the top Denzel performs as always like a boss",
      "review_date": "2022-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Acción y emoción en México; tiene una trama decente y la actuación de Denzel Washington es muy buena; es recomendable.",
      "review_date": "2021-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "qwaszsxddevrvtghfhynjukmloppojoniniugtdrsawesctvyhinoihu,,,,,,,,,,,,,.........,,,,,,,,,,........,,,,,,●●●■■●",
      "review_date": "2021-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;",
      "review_date": "2021-06-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I think it's a pretty good movie. It released in 2004, and for some reason every movie and video game that came out between 2004 - 2006 had to have some piss yellow filter applied over the top of it. Movies from that time period in particularI think it's a pretty good movie. It released in 2004, and for some reason every movie and video game that came out between 2004 - 2006 had to have some piss yellow filter applied over the top of it. Movies from that time period in particular also had to all be edited so that every scene was glitched out, stuttery, and superimposed on itself multiple times.",
      "review_date": "2022-12-22",
      "source": "metacritic"
    }
  ],
  "num_reviews": 86
}