{
  "title": "Saw",
  "rating": 8.3,
  "release_date": "2004-10-29",
  "summary": "Obsessed with teaching his victims the value of life, a deranged, sadistic serial killer is abducting morally wayward people and forcing them to play horrific games for their own survival. Faced with impossible choices, each victim must struggle to win back his/her life, or else die trying.  (Lions Gate Films)",
  "critic_reviews": [
    "May be the best independent horror film to have come out since \"The Blair Witch Project.\" It's certainly better than \"Blair Witch\", and more fun, more gruesome, and more macabre. In a very delightful way.",
    "The filmmakers piece it together with almost clockwork perfection and deliver it with masterful misdirection, creating the most ingenious, eccentric and brazenly jaundiced psycho-thriller to come along in years.",
    "As good an all-out, non-camp horror movie as we’ve had lately.",
    "Wan's tense, grisly cinematic morsel won't go down easy. But once it hits bottom, Saw is oddly satisfying, though the gag reflex never entirely goes away.",
    "Saw is for hard-gore horror aficionados only.",
    "The slasher scenes, though relatively few, are amazingly evocative for such a low-budget movie.",
    "Horror fans will find plenty to shriek about. Everyone else should keep their distance.",
    "Boasts an undeniably original premise and clever plot machinations that lift it several notches above the usual slasher film level.",
    "Less a classical narrative than an ingenious machine for inducing terror, rage, and paralyzing unease.",
    "Saw is a gristle-cut B psycho thriller that would like to tap the sickest corners of your imagination. It has a few moments of nightmare creepiness, but it's also derivative and messy and too nonsensical for its own good.",
    "It's brutal horror, where anyone can die at any time, and gorehounds will love it. Average folks may find it too intense.",
    "Does a better-than-average job of conveying the panic and helplessness of men terrorized by a sadist in a degrading environment, but it is still not especially scary.",
    "Saw is so full of twists it ends up getting snarled. For all of his flashy engineering and inventive torture scenarios, the Jigsaw Killer comes across as an amateur. Hannibal Lecter would have him for lunch.",
    "It's gross as hell.",
    "With its toilet-bobbing and blood spurting and Elwes's fey, Vincent Price–like mugging, Saw succeeds in capturing something like Takashi Miike by way of William Castle. Happy Halloween, indeed.",
    "The film is a squeamish exercise, like watching a cruel child pull the wings off flies - especially the climactic scene, which is so gory it would turn a coyote's stomach.",
    "Wan's debut feature is a twisted, squirm-inducingly nasty bit of work, which isn't a criticism because that's exactly what he and cowriter Leigh Whannell had in mind.",
    "An efficiently made thriller, cheerfully gruesome, and finally not quite worth the ordeal it puts us through.",
    "Let's just say this: It's a lucky thing I wasn't shackled to my seat in the theatre during this movie. I'd be limping home.",
    "As long as Saw stays in that big, nasty bathroom, all we need to believe is the knot in our stomachs.",
    "Spoiled by its own insatiable desire for envelope-pushing flair; it’s wider-scoped when it should be intimate, splashy instead of subtle, icky but not scary.",
    "A story that's so ridiculous you'll at least be entertained by the outrageous plot contortions to come.",
    "Becomes exceedingly disgusting when it wallows in the psychological torture of a child, a no-no under any circumstances.",
    "What makes Saw so awful is that it starts with a clever premise and then completely blows it.",
    "Though dumber than a box of rocks, Saw forges ahead with the kind of conviction and energy that will keep bad-cinema junkies sitting bolt upright.",
    "A crude concoction sewn together from the severed parts of prior horror/serial killer pics.",
    "Saw has its moments, and most of them are brutal in the extreme, but ultimately it's one tremendous misfire that will either leave you laughing or, possibly, gagging. Not what I'd call a winning combination.",
    "But humans who live above ground, including horror fans, will find themselves only fitfully entertained and more consistently appalled.",
    "Where \"Seven\" seemed to radiate diabolical evil, Saw just radiates idiocy.",
    "A gore movie with no teeth.",
    "Promoted as \"the year's scariest movie,\" it's anything but.",
    "Sicko horror film from Australia, whose sadism is topped only by its absurdity."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This movie mentally abuses you and un till it makes you scream like a little child because of it's never suspected plot..it's making you shiver all over. I watched the last scene 5 times  when I watched this movie. ONE OF THE BEST MOVIES EVER MADE!!",
      "review_date": "2012-08-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "First in a long line of movies; Saw had an original Premise with a great story backing it. Jigsaw would never kill anyone but somehow make his \"victims\" do it themselves. Not so much a horror than it is a thriller or crime drama is this filmFirst in a long line of movies; Saw had an original Premise with a great story backing it. Jigsaw would never kill anyone but somehow make his \"victims\" do it themselves. Not so much a horror than it is a thriller or crime drama is this film because there really is nothing to be horrified of, just interested in. You never see anything gory happen at all so \"Torture Porn\" is a completely wrong thing to call the film. The acting was not so great but the actor gave a fairly decent performance. If someone is afraid to see the movie because of the gore they think is in it. Go see this one. It lacks the gore and has a very well written story.",
      "review_date": "2010-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great Movie! Ignore the reviews that say it sucks because they probably just couldn't handle this film! Getting sick of people that probably watched this movie for 30 minutes and give it a 2 because they  in their pants...\r9/10 because ofGreat Movie! Ignore the reviews that say it sucks because they probably just couldn't handle this film! Getting sick of people that probably watched this movie for 30 minutes and give it a 2 because they  in their pants...\r9/10 because of the amazing story and scary/thrilling moments\rPS: Also the sequels have a good story aswell",
      "review_date": "2013-11-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw is for me the best modern horror movie! It's interesting from start to finish, you can feel for the characters and it has a dark atmosphere. These things get unfortunately lost in the last sequels.",
      "review_date": "2014-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think its easily one of the greatest and original horror films of all time. It features a very interesting plot, the acting is good, and the horror is great. This is a must see horror film.",
      "review_date": "2012-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Let me start off by saying that I am not at all a fan of horror movies. But, \"Saw\" however, manaGed to convince me thAt it's different  in a good way. FroM start to finish, the movie is about two people being locked up in an abandonEdLet me start off by saying that I am not at all a fan of horror movies. But, \"Saw\" however, manaGed to convince me thAt it's different  in a good way. FroM start to finish, the movie is about two people being locked up in an abandonEd bathroom together, no clue where they are Or how they got there. Ofcourse, in decent moVie fashion, that is explained, and the closer you get to the end, the morE it'll surprise you. It pleasantly suRprised me, and as someone who is terrified by disgusting horror, I must say, this one felt quite unique.",
      "review_date": "2013-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This just goes to show that critics don't know crap. This is a great movie that kicked off a whole new wave of horror. How could you not like it? Well, I for one, loved it, and highly recommend it.",
      "review_date": "2014-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw, the directorial debut of James Wan, is an original horror/torture flick, that tries its best at stretching its tiny budget by captivating the viewers with a twisted plot and a surprising ending",
      "review_date": "2018-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSaw is one of the best franchise ever so much gore Spoiler Alert: when he cuts his foot off so he can escape Spoiler Alert: You find out how he escapes in Saw The Final Chapter I love the movies how Jigsaw grabs his victims and puts them in trapsThe Bit I hate is Spoiler Alert: The Detective Dies",
      "review_date": "2011-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm not a big fan of the genre but this time I was really impressed ... in a good way. The film is not based on torture (what will happen in the sequels) but is based on the psychology of the characters and the suspense without ever goingI'm not a big fan of the genre but this time I was really impressed ... in a good way. The film is not based on torture (what will happen in the sequels) but is based on the psychology of the characters and the suspense without ever going into the ridiculous. A final effect really at  and unexpected.",
      "review_date": "2012-09-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i do not understand why critics are hating saw , its fun a film its a classic with blood , crime and suspense. Its awesome saw is the top horror movie  of the century thats why Saw needed a sequel the franchise needed to keep the franchisei do not understand why critics are hating saw , its fun a film its a classic with blood , crime and suspense. Its awesome saw is the top horror movie  of the century thats why Saw needed a sequel the franchise needed to keep the franchise going without writer leigh whannell  and director James Wan there would be No saw. Grade",
      "review_date": "2014-10-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In this film, there are something that is not present in 99% of horror films – sense. In what sense? The idea is that why live if you live in the shuffle. Do not bring any benefit not just live. Acting is above all praise. All steeped in someIn this film, there are something that is not present in 99% of horror films – sense. In what sense? The idea is that why live if you live in the shuffle. Do not bring any benefit not just live. Acting is above all praise. All steeped in some despair, hopelessness, it makes worry about heroes.",
      "review_date": "2014-04-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n\"He doesn't want us to cut through our chains.... He wants us to cut through our feet.\"\r Oh my God, the horror! Although I mostly dislike blood and gore in movies, I really like the Saw movies. They are well thought out and always have a nice plot twist at the ending.\r The sequels in the Saw series are more about the booby traps but this one is really a psychological thriller which will stick to you for days after you watched it.",
      "review_date": "2015-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film- Saw is outstanding in terms of movie production and how the traps were set up. With the mystery and suspense in almost every scene, we could say Saw took the world by storm and gave us a little something that was different comparedThe film- Saw is outstanding in terms of movie production and how the traps were set up. With the mystery and suspense in almost every scene, we could say Saw took the world by storm and gave us a little something that was different compared to the other films. Tobin Bell is truly a wonderful actor, in fact, he was like my favorite actor in the Saw franchise. With his creepy-looking perspective in the film, we don't really know what he does or where he came from, yet we know one thing- He is a genius when it comes to setting up traps in a particular way, creating them  in a certain fashion. That is what I love about his character! He speaks the truth in pretty much everything, teaches people the value and understanding of life, and he is just inspiring to an audience who wants to appreciate life in a specific way. His voice over Billy the Puppet truly is a masterpiece. Furthermore, I shall say this, Saw is much better of a franchise than the Jaws film production. Each and every Saw film I've seen not only grabbed my attention, but it made me anticipate what is going to happen next!!! Great film! I applaud James Wan and Leigh Whannell for their hard work and dedication to make an interesting horror film! I just love this film.",
      "review_date": "2016-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIf you've never seen a Saw movie, forget everything you've heard about it being just torture porn, that doesn't start until the 3rd movie. The first one is not just a brilliant horror movie, it's an amazing movie all around.",
      "review_date": "2018-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw is a thriller at its finest...sort of. Though the film is essentially a horror film it has nothing to scare you with unless you have a fear of blood and manky bathrooms. The story of saw is simple, 2 men wake in a small dilapidatedSaw is a thriller at its finest...sort of. Though the film is essentially a horror film it has nothing to scare you with unless you have a fear of blood and manky bathrooms. The story of saw is simple, 2 men wake in a small dilapidated bathroom chained to the wall with a dead man in between them. One must kill the other before time runs out or both them and their families die. Throughout the film you learn about how the two men are connected more than they thought, about their home lives and about the person who put them in that room to begin with, the Jigsaw killer.\rThe story and considering how well shot the film is are the only thing to save it as the acting is pretty bad at the best of times but considering this was a fairly low budget film I can forgive. Saw is a must see for thriller/horror fans.",
      "review_date": "2012-10-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am a fan of various movie genres and Saw is the best ever made with the strongest twist which leads to a sarcastic laugh considering a rating of 4.6/10 from the critics! This is absolutely not right. Current IMDB user rating is 7.7/10 withI am a fan of various movie genres and Saw is the best ever made with the strongest twist which leads to a sarcastic laugh considering a rating of 4.6/10 from the critics! This is absolutely not right. Current IMDB user rating is 7.7/10 with above 180.000 ratings which does not quite comply with the \"experts\" of 4.6. A big gap in here. 265 critics 4.6 rating against 180.000 users 7.7 rating. What makes the critics in sooth?! Oh, yeah. Marlon Brando is not in it.",
      "review_date": "2012-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is **** gross!, it is **** bloody and all that **** I mean it is a great movie with a good plot and if you hate on it then your a **** I LOVE THIS **** MOVIE!",
      "review_date": "2012-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing film! If you love GORE then check It out!! If not, you still might like it too.",
      "review_date": "2020-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Perfection Nice movie feels good to see justice it has a really good meaning",
      "review_date": "2021-07-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Leigh Whannell and James wan show that you don't need to have a big budget to make a great movie SAW is brilliantly twisted basically  John Kramer kidnaps people who waste or don't value there lives and he puts them in traps",
      "review_date": "2020-08-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Grisly And BrutalSaw is clever, unique, bloody, scary, and outright horrifying.",
      "review_date": "2019-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love the plot and Saw's unique concept of being an independent splatter film. It is no doubt the best torture porn film series of all. The acting is not magnificent, but still considerably acceptable. And some of scenes are quite memorableI love the plot and Saw's unique concept of being an independent splatter film. It is no doubt the best torture porn film series of all. The acting is not magnificent, but still considerably acceptable. And some of scenes are quite memorable and worth watching if you are into gore and twist endings.",
      "review_date": "2011-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is definite to beat any upcoming torture films. This film has the depth of most movies and is really compelling making you want to watch it even if their is about 1 hr 32 minutes of brutal gore. But this movie still beats the BlairThis film is definite to beat any upcoming torture films. This film has the depth of most movies and is really compelling making you want to watch it even if their is about 1 hr 32 minutes of brutal gore. But this movie still beats the Blair Witch Project without a question.",
      "review_date": "2013-05-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw is a great thriller about Jigsaw who is a person who puts some missions to some people to show them the meaning of life. The first saw is a disturbing thriller about two people who are locked in a bathroom and they try to get out. It hasSaw is a great thriller about Jigsaw who is a person who puts some missions to some people to show them the meaning of life. The first saw is a disturbing thriller about two people who are locked in a bathroom and they try to get out. It has mystery and suspense and an ending that thrills the audience. It has some scary moments but saw doesn't want to scare the audience with Boo moments. It wants to put the audience in the position of that two people who are locked in the bathroom  The result is successful. A quality thriller which deserves the attention. And for the bad reviews? Screw them!",
      "review_date": "2013-07-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest endings to a movie of all time. Rivals the sixth sense.",
      "review_date": "2012-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love the Saw movies, and this by far the best film in the series overall. Although I think Saw II is more entertaining, and and better and more deaths, Saw, the original is still a classic, and paved the way for the infamy of Jigsaw, andI love the Saw movies, and this by far the best film in the series overall. Although I think Saw II is more entertaining, and and better and more deaths, Saw, the original is still a classic, and paved the way for the infamy of Jigsaw, and the deaths in the movies. 8/10",
      "review_date": "2013-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Though I tend to go for both older films (those made before 1970) and especially so when it comes to the horror/thriller genre, I saw parts 3 and 5 upon theatrical release (yes, I know it's really not right to see film series out of sequenceThough I tend to go for both older films (those made before 1970) and especially so when it comes to the horror/thriller genre, I saw parts 3 and 5 upon theatrical release (yes, I know it's really not right to see film series out of sequence but I simply don't care) and they were intriguing and decent, don't ask me why. Now that I both date a horror film aficionado and my 13-year-old son himself is one as well, I have decided to check out the contemporarily well-received original (I may decide now to see the entire series, and in order, but really who's to say?). Instantly, such trusted, bankable actors as Cary Elwes and Danny Glover give it credibility, just as Bette Davis and Joan Crawford gave such films as 'What Ever Happened to Baby Jane?' way back in days gone by. This was much better than I felt parts 3 and 5 were, by the way.",
      "review_date": "2016-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you are into psychological horrors, this might be the movie for you.",
      "review_date": "2008-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The stream of so-so sequels that followed it may have weakened its impact somewhat, but this original offering is a sick, slick whodunnit that's high on logic and (relatively) low on gore, with a twist that nobody saw coming.",
      "review_date": "2017-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nCool horror! I could not imagine that the main antagonist of the entire series just quietly lies silently disconnected on the floor, while the rest of the characters fight for life, and in the end everyone rips up a template from a suddenly revived corpse. \"The game is over\"",
      "review_date": "2020-04-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \ni just can't understand why the critics hated this movie. it is a mystery thriller. some people might not like this movie because of its gore but i was blown away in the climax. i do not wish to spoil the story. but this movie definitely deserves a lot more than this score. i give it a perfect 10.",
      "review_date": "2014-09-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Saw\" is a gruesome film that lacks the depth and development within the movie. However, the frantic, thrilling ride with a refreshing twist in the end scores the points for \"Saw\".",
      "review_date": "2011-09-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is phenomenal, and one of the best of all time. The label of \"torture porn\" is way off, and I don't see at all why it is labeled as such. To me, this really isn't much of a horror movie, than a crime drama.",
      "review_date": "2009-10-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Saw\", a low-budget horror movie, had well exceeded beyond my expectations. It's a different kind of horror film, one that you will have never imagine that it will be this way. However, to be honest, the plot is quite ridiculous.",
      "review_date": "2013-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a very intense and well made thriller. It's not too over the top, the characters are likeable, it's interesting and you actually care about about the main characters, because they feel very real. Overall, it's better than most horrorIt's a very intense and well made thriller. It's not too over the top, the characters are likeable, it's interesting and you actually care about about the main characters, because they feel very real. Overall, it's better than most horror thriller movies you'll find today.",
      "review_date": "2017-07-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you liked the Fight Club, you will Love this movie.",
      "review_date": "2005-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "uh...first of all...this isnt a horror film...its a snuff film...its not scarey, it just nasty...bad acting and stupid plot...as most snuff films have. However, if all you want to see is people getting killed, go to a search engine and type uh...first of all...this isnt a horror film...its a snuff film...its not scarey, it just nasty...bad acting and stupid plot...as most snuff films have. However, if all you want to see is people getting killed, go to a search engine and type :\"Snuff Films\".",
      "review_date": "2006-07-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is in no way perfect but its exciting and most importantly fun to watch. if you love movies were they have you think this is a movie to watch especially the sequels. I can almost garantee that you will enjoy this movie if you love This movie is in no way perfect but its exciting and most importantly fun to watch. if you love movies were they have you think this is a movie to watch especially the sequels. I can almost garantee that you will enjoy this movie if you love getting excited, disturb, and just plain out scared of what might happen next. I can't wait for Saw IV!",
      "review_date": "2007-10-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Although it is not wonderfull..horror films rarely are and this is definately one of the best recently. This is probably due to the twists which are, suprisingly, unexpected and unpredictable. Full of gore and physically sickening..but you Although it is not wonderfull..horror films rarely are and this is definately one of the best recently. This is probably due to the twists which are, suprisingly, unexpected and unpredictable. Full of gore and physically sickening..but you have to carry on watching. Appeals to the darker side of everyone.",
      "review_date": "2007-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hilariously bad, dull, and almost completely un-disturbing, un-thrilling, and un-scary. Very predictable and even the promised bloon n' gore is underwhelming. About the only thing to be said about it is that it's better than the sequels.",
      "review_date": "2007-02-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw figures most horror-goers don't care about characters, and so it leaps straight to doing inhumane things to them. It's an interesting inversion of the slasher movie; where Jason or Myers have teens running in terror, pursuing Saw figures most horror-goers don't care about characters, and so it leaps straight to doing inhumane things to them. It's an interesting inversion of the slasher movie; where Jason or Myers have teens running in terror, pursuing with some deadly weapon, here almost every character is trapped and subjected to some awful game. In fact, the killer is the only one who is really chased in Saw. It's gruesome soul is quite shocking, and its ending is one of the best (if bleakest) in modern horror. It would just be nice if we liked some of the characters before they were subjected to Jigsaw's mindgames (and bodygames), or if Jigsaw didn't preach at us quite so much - two problems the sequels neglected to fix. But for a stand-alone first picture, Saw is a stand out.",
      "review_date": "2007-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie isn't entertaining in the slightest, it is over-hyped and sick. Any level headed person will find this film disgusting and very unenjoyable",
      "review_date": "2007-04-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw is a good movie. But is pretty boring.",
      "review_date": "2007-09-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A depressingly predictable movie that will only appeal to those who like to see people being tortured. There really is nothing else to the movie.",
      "review_date": "2008-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm not sure what to think of all these reviews. Perhaps I'm too willing to suspend my disbelief and enjoy a good movie. I personally really liked Saw. It's a dark movie, dense in it's mood much like Seven. I liked it I'm not sure what to think of all these reviews. Perhaps I'm too willing to suspend my disbelief and enjoy a good movie. I personally really liked Saw. It's a dark movie, dense in it's mood much like Seven. I liked it because it made you experience what was happening rather than telling you so much. You wake up in a dark room with the characters. You know about as much as the characters do. personally I thought the acting was well done. All the character flaws were there for a purpose. If you're looking for a good thriller, go see this movie. Let go of your uber-analytical mind and have some fun.",
      "review_date": "2004-11-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Horrible movie. Some of the worst acting and dialogue I've seen in any movie ever. I suppose you might enjoy it if you don't care about that stuff.",
      "review_date": "2005-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was reallllly good, kinda reminded me of seven, definately not as good as \"seven\", i brought it down two notches because of the baaaad acting. and i mean baaaad. but other then that, it was really original.",
      "review_date": "2005-10-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The acting and writing in this movie aren't bad. They are hanging-your-mouth-open-in-wonder bad.",
      "review_date": "2006-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ridiculous movie. Keeps you in suspense throughout the entire film. This horror movie keeps you thinking and gets you connected to the actors. Eleven out of ten star for this great flick.",
      "review_date": "2006-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best horror movies i've ever seen. Though it's not scary it's plot is outstanding and it's twists and sick gore is amazing. It's good because like if you've seen one Friday the 13th you've seen One of the best horror movies i've ever seen. Though it's not scary it's plot is outstanding and it's twists and sick gore is amazing. It's good because like if you've seen one Friday the 13th you've seen them all but Saw keeps you intersted in what will happen next.",
      "review_date": "2006-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Better then the others (not saying the others were bad). But who ever thinks this movie is not good, then they need to get hit with a bat 3 times in the head... cause they obviously dont see the genius plot and i must admit it was kinda Better then the others (not saying the others were bad). But who ever thinks this movie is not good, then they need to get hit with a bat 3 times in the head... cause they obviously dont see the genius plot and i must admit it was kinda queezy, and later on in the movie you get to like watching ppl die in awesome ways. C'mon who doesnt like Mortal Kombat? Grand Theft Auto? The Suffering? So dont leave the movie half-way and think you can review it badly....watch the whole thing Wooses!",
      "review_date": "2006-10-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "SAW was excruciatingly boring. you may go ahead and watch the whole film... if you want to waste 2 hours of your whole life that you may never get back.",
      "review_date": "2007-12-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great story and music. In the same vein as seven.",
      "review_date": "2007-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While the plot is a unique idea, it's hampered by bad acting, and poor execution, it could have been great but the way they set it up just makes this movie mediocre, the ending however was fantastic, another complaint is that it's not scary,While the plot is a unique idea, it's hampered by bad acting, and poor execution, it could have been great but the way they set it up just makes this movie mediocre, the ending however was fantastic, another complaint is that it's not scary, it just has a tense atmosphere at times, all in all if your looking for an ok gory movie for a rental this is a ok choice just come expecting mediocrity.",
      "review_date": "2011-05-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSaw is the perfect movie for hardcore horror fans who want to see a good gory film, because Saw has more gore than a pig slaughterhouse. Seriously, I mean there's always someone bleeding profusely at some point of this film! Yet another reason fans of the genre will be enamored with Saw.\r Besides surpassing the average genre fare, Saw is intelligent. Unlike the usual slasher or gory pic, Saw's story is, for the most part, logically sound, although I put \"logically\" very lightly. Obviously, it's not every day you wake up in a dirty abandoned bathroom chained to a pipe! For what the film was, it made relative sense. At least, it made more sense than most of the other horror flicks I've seen. The story was engaging, and very compelling. There were a few gaps in logic and minor plot holes, but that's pretty standard for any horror movie. The real logical person in that situation would either find a way out in the first 5 minutes or give up and find a way to kill themselves. But a 5 minute movie where the main character dies in the first 5 minutes wouldn't sell at the box office, would it? So the filmmakers have to suspend logic in some places to move the story along, something most critics don't understand. That doesn't make the movie bad, because believe me, if the mentioned critic saw the \"5-minute Saw\" I talked about before, he/she wouldn't complain about the real film at all.\r Moreover, Saw actually had pretty decent acting. The characters were well-rounded, and this movie was a good kick-starter for the career of Leigh Whannell. Cary Elwes, who I've seen in Twister, Princess Bride, and Robin Hood: Men In Tights, turned his usual goofy character into a serious, dramatic role as Doctor Lawrence Gordon. Desperateness loomed in his eyes the whole film, as he had no idea what was to happen to his wife and child being held captive by an unknown man he thinks is \"The Jigsaw Killer\". Danny Glover, who almost always dies in a movie, (It seems he's almost surpassed Leonardo DiCaprio in movie deaths!) takes on a detective role as Detective Tapp, obsessed with finding the Jigsaw Killer after Jigsaw kills Tapp's partner, played by Ken Leung.\r This film was a good watch, especially if you like horror films, and will leave a bad taste in your mouth. But that was the point!",
      "review_date": "2013-10-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As rough-edged and unforgiving as the traps in it, Saw will get under your skin and holds the suspense like no other. It sets up the series well, but unfortunately none of the others live up to it.",
      "review_date": "2013-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "First, and absolutely the best part of this franchise. Unexpected end, and congratulations for making so interesting story with low budget.",
      "review_date": "2018-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Stupid. Pointless, Dull, Boring. Nothing to marvel here.",
      "review_date": "2006-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw is being mistaken for a gross-out horror. It's not. It's a crime-thriller with some unusual qualities.",
      "review_date": "2012-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw has some really clever ideas and it's a great torture film!\rIt's definitely not the best but if you are into those movies this is a MUST WATCH!!!!!",
      "review_date": "2013-05-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw has earned a place in the best horror movies, but I do not think the movie had a way is beyond. Traps are good and I hit a lot of psycho intelligence John Kramer, but does not give you 10 for one reason: the end was not very well, thatSaw has earned a place in the best horror movies, but I do not think the movie had a way is beyond. Traps are good and I hit a lot of psycho intelligence John Kramer, but does not give you 10 for one reason: the end was not very well, that leaves a lot of mystery and some disappointment due to the lack of character actors . My final opinion is that it is a good horror movie, but it was not what I expected: talent.",
      "review_date": "2014-03-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I do not like these kind of movies. Sadictic... If you like torture scenes you might have serious mental problems.............................................................................",
      "review_date": "2013-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie just proves that there are no decent horror movies out there. Like all the other horror movies, this movie isn't even scary. It's just a bloody, profane gorefest. Horror movies were meant to scare, but only The Exorcist has managedThis movie just proves that there are no decent horror movies out there. Like all the other horror movies, this movie isn't even scary. It's just a bloody, profane gorefest. Horror movies were meant to scare, but only The Exorcist has managed to give great scares.",
      "review_date": "2012-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A decent horror movie apart from... A plot that makes wicker baskets look water-tight, swiss cheese smooth, and rain during Monsoon unexpected. Shame, because it has some clever elements to it.",
      "review_date": "2009-11-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw certainly  has one of the best plots ever in a film. A common mistake made when Saw is the topic of discussion (I can't say that is very often) is that the gore is the main feature of the movie. While that does become quite true in theSaw certainly  has one of the best plots ever in a film. A common mistake made when Saw is the topic of discussion (I can't say that is very often) is that the gore is the main feature of the movie. While that does become quite true in the later episodes of the movie series, this does not quite apply to the first of the long series of psychiatric thrillers. Of course, it would be a lie to say there was no blood displayed in the film, some would say that there was a great deal of it, but it is the plot that would be remembered by any viewer. The low budget can be quite noticeable at times, however it is made up for with great directing and script, and a major twist that you won't forget. The only real problem with this is that you can watch a crime show on television anyday without having an hour and fourteen minutes, and chances are you will get better visual effects. Still, with that considered, it is a movie that is definitely worth watching.",
      "review_date": "2010-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After years of ignoring this series due to it being a poorly reviewed horror series I was finally persuaded by a friend to check it out. I found it to be a disgusting exercise in torture porn with a somewhat original premises. None of the After years of ignoring this series due to it being a poorly reviewed horror series I was finally persuaded by a friend to check it out. I found it to be a disgusting exercise in torture porn with a somewhat original premises. None of the performances are special, and there isn't much in the way of thrills. The story is a mess. There is a market for this stuff I guess, and it's definitely not me.",
      "review_date": "2009-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "These sorts of ultra gory horror movies seem to have an audience (as evidenced by the multiple sequels to in this Saw franchise) but I've never been a fan. Partly this is because these types of movies aren't particularly scary but mainly itThese sorts of ultra gory horror movies seem to have an audience (as evidenced by the multiple sequels to in this Saw franchise) but I've never been a fan. Partly this is because these types of movies aren't particularly scary but mainly it is the fact that watching people get killed in increasingly brutal and graphic ways isn't my idea of entertainment.\r I've often been told that Saw is one of the better examples in the genre but since I couldn't stomach any more than about twenty minutes I wouldn't know.",
      "review_date": "2014-02-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A decent , effective, bloody explosion. This mystery horror film is strong in violence and brutal content that makes it two bloody thumbs up. Gruesome and twisted, \"Saw\" is scary as hell.",
      "review_date": "2014-02-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I truly don't care that the metacritic score is 46, this movie will go down as a classic in the horror genre. It was a breath of fresh air in a genre that relies on remakes of it's heyday. The twists and turns at the end make for a trulyI truly don't care that the metacritic score is 46, this movie will go down as a classic in the horror genre. It was a breath of fresh air in a genre that relies on remakes of it's heyday. The twists and turns at the end make for a truly amazing thriller/horror/torture flick.",
      "review_date": "2012-02-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Now, before you read this, keep in mind I've seen all of the saw movies, and I'm a fan of the series. Now, onto the review: This movie was horrible. I know it's the first out of the seven movies, and it's explaining everything, but are youNow, before you read this, keep in mind I've seen all of the saw movies, and I'm a fan of the series. Now, onto the review: This movie was horrible. I know it's the first out of the seven movies, and it's explaining everything, but are you kidding me... no... just no.... boring, and useless. Some of the movie was okay, but  no... like, maybe twenty percent was okay, but the other eighty percent  big no.",
      "review_date": "2013-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Unexceptional, but worth seeing for the intensity it brings from the opening scene and never stops bringing.",
      "review_date": "2006-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "great plot and twist but terrible acting and dialogue has held this movie back... still deserves credit due to the fact that its a indie.",
      "review_date": "2006-07-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A solid thriller. Unique twist.",
      "review_date": "2005-10-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Interesting premise, but could have been much better had it not been spoiled by horrible acting and numerous stupid plot twists.",
      "review_date": "2005-10-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A well made thriller, good for horror fans. A bit overacted at times, but a good waste of an hour and a half. People should check out the superior sequels as well.",
      "review_date": "2008-01-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "No Saw movie can be a Saw movie unless you include the rest of the series. Very clever movie, but many weak spots and bad acting. But I will admit that I was into this series for a while. But one day I opened my eyes, and said \"What the fcuk No Saw movie can be a Saw movie unless you include the rest of the series. Very clever movie, but many weak spots and bad acting. But I will admit that I was into this series for a while. But one day I opened my eyes, and said \"What the fcuk am I doing??\"",
      "review_date": "2008-09-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gross, stupid, sadistic, dumb, boring, sick, disgusting. It truly deserves at least a \"36\".",
      "review_date": "2009-10-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I got so gripped and so excited and intrested and scared and spooked and grossed out and that's good. Amanda is easily the best character design ever. and it's so flippin scary",
      "review_date": "2009-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The only movie in the series worth a touch, but even then there are better horror movies out there.",
      "review_date": "2009-07-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I saw Saw 2 before i saw this one...still understood the story without seeing the first one...but even with Saw 1's crappy acting and bad dialouge it still has its scary moments and really sets the movie up for the much better sequel.",
      "review_date": "2005-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I did not find this movie to be the that good. the acting was horrible the twist wasnt even that great or big i dont see why everyones so blown away by it and i have a feeling that the second one is going to be even worse then this piece of I did not find this movie to be the that good. the acting was horrible the twist wasnt even that great or big i dont see why everyones so blown away by it and i have a feeling that the second one is going to be even worse then this piece of junk. i havent seen a good horror movie since the sixth sense that was a good horror movie with a good twist nothing worth seeing here not even the twist but i will give it a 2 because i think it had a good concept wish they just did more with it, it could have been a great movie.",
      "review_date": "2005-10-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best thriller for quite a long time, wonderful twist.",
      "review_date": "2005-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you haven't seen the movie, and have read previous comments like the one linking this film on the same level as fight club, and then watch the film with that comment in mind, you will be bitterly dissapionted, it was bollocks.",
      "review_date": "2005-10-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despite appearances from some high noted actors (Danny Glover, Cary Elwes) and some well placed blood and splatter for gore-hounds, Saw falters in the field of a coherent script, typical numetal-esque guitar riff soundtrack, and simple lapse Despite appearances from some high noted actors (Danny Glover, Cary Elwes) and some well placed blood and splatter for gore-hounds, Saw falters in the field of a coherent script, typical numetal-esque guitar riff soundtrack, and simple lapse in reason which will leave viewers shaking their head. Not to mention the \"twist-ending\" that doesn't really change anything really per-say throughout the film. I don't mind watching silly horror films and enjoying them, but films with a wee bit of logic for what's going on helps!",
      "review_date": "2006-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I looked forward to watching this movie after hearing the positive feedback from friends. However, I came to my own realization that this movie was just a seriously overrated, over-hyped movie that didn't deserve any good reviews. It is I looked forward to watching this movie after hearing the positive feedback from friends. However, I came to my own realization that this movie was just a seriously overrated, over-hyped movie that didn't deserve any good reviews. It is devoid of horror and puts actors such as Cary Elwes and Danny Glover in a bad light. I am so glad I waited until this movie came out on cable before I watched it.",
      "review_date": "2006-07-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great ideas, good story, lame actors. Could have been more if the cast could act. Watch it if you're a fan of \"funny\" horror movies.",
      "review_date": "2007-02-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really hate unintelligent horror flicks and this is a prime example of one. To be honest the story is quite engaging, despite the lacking element of surprise and real tension. But the conclusion is Sunday market standard and by then, you I really hate unintelligent horror flicks and this is a prime example of one. To be honest the story is quite engaging, despite the lacking element of surprise and real tension. But the conclusion is Sunday market standard and by then, you are passed caring. Sixth Sense it ain't!",
      "review_date": "2007-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Stupid pointless and sickening eben though all th Saw movies have awesome endings.",
      "review_date": "2009-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Two men wake up to find they're chained to pipes either side of a room without really knowing why. Clues are slowly revealed as they are part of some sadistic \"game\".Second time I've seen it & it's still a decent horror film. Clever in partsTwo men wake up to find they're chained to pipes either side of a room without really knowing why. Clues are slowly revealed as they are part of some sadistic \"game\".Second time I've seen it & it's still a decent horror film. Clever in parts but some of the acting is pretty bad.And Cary Elwes will always be Wesley in the Princess Bride for me.",
      "review_date": "2010-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "its a good they didn't use the word *torture porn*. as a matter of fact, this movie may not be excellent, but its just so perfect. a killer that doesn't kill people so he just create some traps and watches people die when they go into them.its a good they didn't use the word *torture porn*. as a matter of fact, this movie may not be excellent, but its just so perfect. a killer that doesn't kill people so he just create some traps and watches people die when they go into them. thats pretty clever. thats why this movie is a phenomenal.",
      "review_date": "2010-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most original horror films to come out in a long time and its actually good. Saw gives us something no horror film has ever given us before and I loved it. While the acting is solid and far from perfect, It is still an enjoyable film.",
      "review_date": "2011-11-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Criticised for being morally bereft and for starting the \"torture porn\" horror movie craze though the Saw series is, this first instalment has far more to it than you might immediately realise. While it's notorious for extreme gore, in SawCriticised for being morally bereft and for starting the \"torture porn\" horror movie craze though the Saw series is, this first instalment has far more to it than you might immediately realise. While it's notorious for extreme gore, in Saw you actually see relatively little, and it rarely feels like the two protagonists (Leigh Whannell and Cary Elwes) are being put through extreme torment for the sake of it - everything that happens to them is necessary for moving the plot along. Unlike the sequels, Saw really isn't a gruesome horror film, but is actually closer to an incredibly dark crime thriller. The Jigsaw Killer (Tobin Bell) rightly deserves his place in the movie villain hall of fame - he has a terrifying screen presence despite being only a disembodied voice for the majority of the film, and his character, a psychotic vigilante driven by a twisted moral code is far more layered and entertaining than the average film murderer. James Wan and Leigh Whannell's story is deceptively simple, but through several clever and unexpected plot twist and some fairly explicit political subtext, the narrative becomes memorable. Saw also offers you one of the most brilliant and shocking final scenes in film history, something none of the inferior sequels even came close to replicating. The set pieces are also far more effective and terrifying than any we see in subsequent instalments, chiefly due to the fact that they are kept strikingly simple, and the schizophrenic editing hides the goriest visuals, allowing your own imagination to fill in the blanks, which is always a reliable tool to fall back on in horror. The first act of the film is a little slow, and I will concede that the film's underlying message, if there really is one, about the failures of the American justice system and worldwide moral decline, is approached in a rather heavy-handed manner by the filmmakers. The biggest crime the film commits, though, is that it spawned so many underwhelming sequels. Still, in this first chapter of an increasingly tired and formulaic franchise packs a real punch thanks to some good writing, taught and tense plotting and an abundance of energy. Many compare the film unfavourably to Seven, but despite the undeniable similarities in plot, I'd take the stripped-back, far less pretentious Saw over David Fincher's over-compensatory effort any day.",
      "review_date": "2012-06-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Solid cast, Very interesting, and it ends in a way that you never see coming. Saw is easily the best horror film in the 2000s so far and is one of the greatest of all time. Only problem is it didnt look as good as it could have (yes I know itSolid cast, Very interesting, and it ends in a way that you never see coming. Saw is easily the best horror film in the 2000s so far and is one of the greatest of all time. Only problem is it didnt look as good as it could have (yes I know it was made on a small budget)",
      "review_date": "2011-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not sure how this one gets such a low rating. It was the best out of the Saw movies and a thriller-especially in this genre. I liked the fact I didn't know what was going to happen next and the original content of the horror (sort of speak).Not sure how this one gets such a low rating. It was the best out of the Saw movies and a thriller-especially in this genre. I liked the fact I didn't know what was going to happen next and the original content of the horror (sort of speak). Kinda corny though at times, I can admit. But I can still watch this flick to this day and be entertained.",
      "review_date": "2012-07-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very good horror/psychological thriller. There were a few bits and pieces which didn't make a lot of sense. What happened to Lawrence?? As a whole an enjoyable film, with some really intense scenes. Don't watch before you go to sleep!`",
      "review_date": "2013-02-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The original is in fact original, however does suffer from the cheese factor of most horror films. I was glad to see Danny Glover doing what he does best (playing a cop) and Shawnee Smithson returning to the horror genre.",
      "review_date": "2016-08-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Saw\" is a very grisly, brutal, intense, and unpredictable film. It's a lot more psychologically terrifying than physical. This film is said to be insanely gory, but it's really not. There's very little gore in comparison to other films like\"Saw\" is a very grisly, brutal, intense, and unpredictable film. It's a lot more psychologically terrifying than physical. This film is said to be insanely gory, but it's really not. There's very little gore in comparison to other films like \"High Tension\" or \"Martyrs\", but \"Saw\" is still a very morbid and gritty little movie. The acting isn't the best, but the cinematography is great. \"Saw\" is a lot more like a crime-thriller than a horror film, so if you like crime-style movies, I definitely recommend this.",
      "review_date": "2014-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis film seems kind of underrated. If you're sceptical about watching it because you think it'll be a slasher movie, think again. Admittedly, it's a little violent, but not unnecessarily so like the rest of the instalments. It's a very well-acted production, with clever twists - one of which was completely unforeseen. The story is kind of all over the place sometimes - we start off in Jigsaw's bathroom challenge, then constantly go back and forth between flashbacks. But it works most of the time.\rI have no such hope for the rest of the series - and I hope it's not continued. Maybe one, two, or three Saw films is OK, but no more than that.\r7/10",
      "review_date": "2014-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Saw Series  are  good movies. But this one I think is the worse nothing really happened unlike the others they actually moved around. That is why it is a 6/10.",
      "review_date": "2015-05-26",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 132,
  "genres": [
    "Mystery",
    "Thriller",
    "Horror",
    "Crime"
  ]
}