{
  "title": "Shaun of the Dead",
  "rating": 8.5,
  "release_date": "2004-09-24",
  "genre": [
    "Horror",
    "Comedy"
  ],
  "summary": "This \"rom zom com\" (romantic zombie comedy) follows the bloody funny adventures of underachiever Shaun (Pegg) and his best mate Ed (Frost) as they cope with a zombie invasion of North London and attempt to rescue Shaun's girlfriend Liz (Ashfield) and his Mum (Wilton).  It's going to be one hell of a weekend.  (Rogue Pictures)",
  "critic_reviews": [
    "Remarkably fresh and inventive.",
    "Takes the prize. It's a bloody hoot.",
    "The most original comedy from either side of the pond in years.",
    "A gleefully gory, pitch-perfect parody of George Romero's zombie films. But this isn't a movie about other movies. Shaun of the Dead stands on its own.",
    "Whatever you want to label this quick-paced crowd-pleaser, it is definitely one of the year's must-sees.",
    "The daffy, innately British joke that propels the cheeky U.K. comedy hit Shaun of the Dead is that although real zombies have risen up --  slacker wankers Shaun (Simon Pegg) and his best pal and roommate, Ed (Nick Frost), are too slack, wankerish, and blitheringly British to notice.",
    "It's bloody brilliant.",
    "Extremely funny, side splitting good time.",
    "Mixing horror and humor is no mean feat, but Shaun Of The Dead tightens throats in fear without making the laughs stick there in the process.",
    "In this truly retro horror flick, the heroes and heroines don't just quip over the action (though they do get off some funny lines); they're knee-deep in it, and scared sh------.",
    "By treating the genre as a joke, this satire, whose title plays off George A. Romero's 1979 golden oldie, \"Dawn of the Dead,\" yields ironic dramatic dividends.",
    "The movie's wonderfully original, fast-moving and funny.",
    "Pegg and Wright are out of their depth in the second half, when they try to engage the more disturbing elements of Romero's movies, but their disaffected slacker take on the genre is a welcome alternative to the usual bloodbaths.",
    "If the zombie genre steadfastly refuses to die, we can be grateful to Shaun of the Dead for breathing fresh, diverting life into the form, with subtle visual humor and a smart, impish sense of fun.",
    "Blast of fright and fun.",
    "Mines a great deal of its humor from the can't-be-bothered attitude of British culture, but the jokes survive the trip across the Atlantic mostly intact.",
    "This gory horror romp is a goofball medley of \"Dawn of the Dead,\" \"28 Days Later\" . . . , and Monty Python-style severed-limbs/blood-spurting sicko comedy.",
    "Pegg and director/co-writer Edgar Wright mix numerous references to other zombie flicks with hilarious bits of their own. The best has Ed and Shaun deciding which LPs can be used as ammo.",
    "Every moment... is a cleverly constructed live-action joke on aloofness: The world is ending, and these people are too self-centered to notice.",
    "I like the way the slacker characters maintain their slothful gormlessness in the face of urgent danger, and I like the way the British bourgeois values of Shaun's mum and dad assert themselves even in the face of catastrophe.",
    "Plays perfectly on two levels — it's a clever comedy, but disguised as a fun, dumb horror flick. A movie made to delight, and even accidentally enlighten, both the living and the dead.",
    "Its social satire is so dead-on.",
    "Offers a welcome riff on a well-worn horror standard.",
    "This is an unusual source of entertainment.",
    "It's worth sticking around for the coda too as it contains some hilarious and very politically incorrect suggestions as to how zombies might be put to work once they've been tamed.",
    "A classic example of a clever idea that could easily have run out of steam halfway. However, co-scripters Pegg and Wright structure it as a classic three-acter (set-up, journey, finale) with enough twists, character development and small set pieces to keep the comedy boiling.",
    "Pegg co-wrote the screenplay with the director, Edgar Wright, and together they have fashioned a smart, cultish, semi-disgusting homage to the fine British art of not bothering.",
    "The actors are all on target (particularly Penelope Wilton as Shaun's relentlessly cheery mum), and taken on its own shaky legs it's a wittier genre coda than \"Abbott and Costello Meet Frankenstein.\"",
    "Good, goofy fun, but given the attendant hype, there may be a danger of excessively high expectations from horror fans.",
    "The comic high point in Shaun of the Dead comes when Lucy Davis, from the great BBC sitcom \"The Office,\" teaches the band of survivors how to lurch like zombies so that they can pass among the undead.",
    "It's a grisly but sweet ode to friendship, love and the George Romero zombie trilogy.",
    "Both genuinely funny and authentically horrifying, it puts the average horror comedy to shame.",
    "Enjoys the weird distinction of being one of the year's funniest comedies and one of the best zombie movies ever made.",
    "For those who like their spoofs silly and their cartoonish gore vivid, Shaun offers some amusement."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This movie is bloody brilliant. Action-packed, hilarious and gory. The writing is funny, the acting is great, and the directing is superb. I highly recommend it.",
      "review_date": "2010-08-15"
    },
    {
      "review_title": null,
      "content": "This movie is a match made in Heaven, Zombies and comedy, it will surprise you how funny, but yet just as brutal as any other Zombie movie, I have to admit some of the emotional parts feel awkward amongst the jokes, but this is still a movieThis movie is a match made in Heaven, Zombies and comedy, it will surprise you how funny, but yet just as brutal as any other Zombie movie, I have to admit some of the emotional parts feel awkward amongst the jokes, but this is still a movie I highly recommend to fans of Zombies, and comedies in general, a fantastic movie.",
      "review_date": "2011-04-12"
    },
    {
      "review_title": null,
      "content": "Refreshing take on the zombie genre although the zombies are a bit overly stupid. (Although, who's to say that's not realism!) The gags are well done the humour well mixed with the gore, the acting is solid and overall a very enjoyable horror comedy.",
      "review_date": "2011-06-30"
    },
    {
      "review_title": null,
      "content": "This a great zombie film full of blood, guts and funny moments. It can be hard to pull of a horror and comedy all in one, but this film does it well. The film isn't scary, but the zombies do look freaky. An alright storyline and plot, andThis a great zombie film full of blood, guts and funny moments. It can be hard to pull of a horror and comedy all in one, but this film does it well. The film isn't scary, but the zombies do look freaky. An alright storyline and plot, and played well by the actors. The action scenes are good, mostly filled with comedy. It's violent, horrible and bloody, it's Shaun Of The Dead!",
      "review_date": "2011-10-22"
    },
    {
      "review_title": null,
      "content": "The first hour or so is great fun, but when the characters get barracaded in a bar for the climax, the movie flames out and becomes exactly what it has been making fun of. The actual ending is amusing, though. \"Player 2 has joined the game...\"",
      "review_date": "2006-01-20"
    },
    {
      "review_title": null,
      "content": "Best zombie take ever. Extra points for Queen music. Just Ridiculously Funny.",
      "review_date": "2007-04-21"
    },
    {
      "review_title": null,
      "content": "A truly amazing film by Edgar Wright and Simon Pegg. The storyline is easy to follow. The characters are very well thought up, and the acting is superb. Shaun of the Dead is both humorous and gory and the balance is well designed. TheA truly amazing film by Edgar Wright and Simon Pegg. The storyline is easy to follow. The characters are very well thought up, and the acting is superb. Shaun of the Dead is both humorous and gory and the balance is well designed. The editing, especially â",
      "review_date": "2010-11-05"
    },
    {
      "review_title": null,
      "content": "A comedy that is best shown with a group of friends on a boring Saturday night because it will soon turn into one with great laughter.  An innovative comedy that blends the horrors of a zombie apocalypse and makes it seem like in the event ofA comedy that is best shown with a group of friends on a boring Saturday night because it will soon turn into one with great laughter.  An innovative comedy that blends the horrors of a zombie apocalypse and makes it seem like in the event of breakout, life wouldn't be so bad.",
      "review_date": "2011-07-30"
    },
    {
      "review_title": null,
      "content": "An incredibly entertaining comedy that manages to keep my interest despite seeing it at least a dozen times. The fact that it still holds up after all these years tells you how good it is.",
      "review_date": "2013-04-01"
    },
    {
      "review_title": null,
      "content": "This is a great movie. The jokes are well timed and witty. The pacing is excellent and it seemed to me that the movie lasts shorter than it does. Simon Pegg is excellent and quite believable as a Shaun the hero. The movie is a realThis is a great movie. The jokes are well timed and witty. The pacing is excellent and it seemed to me that the movie lasts shorter than it does. Simon Pegg is excellent and quite believable as a Shaun the hero. The movie is a real refreshment in the Zombie genre.",
      "review_date": "2012-05-01"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead is a romantic zombie horror comedy movie about two men, one called Shaun and the other called Ed they are best friends, they like to stay home, lounge about drink coffee and play video games. Shaun wants to get back togetherShaun of the Dead is a romantic zombie horror comedy movie about two men, one called Shaun and the other called Ed they are best friends, they like to stay home, lounge about drink coffee and play video games. Shaun wants to get back together with his ex girlfriend. He soon finds out that a zombie apocalypse is happening and he starts getting worried about his family, friends and of course his ex girlfriend. This movie is very funny you will have a lot of laughs. I like it because it is a more comedic take on a zombie movie which hasn",
      "review_date": "2012-09-24"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead is hands-down one of the best movies of the 21st Century. Brilliantly funny and genuinely scary at points. Edgar Wright, Simon Pegg and Nick Frost are amazing.",
      "review_date": "2013-09-28"
    },
    {
      "review_title": null,
      "content": "A lighthearted zombie take. Wish there was more gun action. I'd like to see a zombie film where survivors fight off the zombies with assault rifles, miniguns, RPGs, etc, a starship troopers with zombie instead of aliens.",
      "review_date": "2006-03-24"
    },
    {
      "review_title": null,
      "content": "It's a dumb comedy. And mixed with horror. Just inventive! No movie like it. I had a good laugh, and a little scare. The music was just great!",
      "review_date": "2008-10-19"
    },
    {
      "review_title": null,
      "content": "Funny, touching, serious, and even at times scary. It hits all the best spots from the romantic comedy and zombie genres.",
      "review_date": "2008-02-27"
    },
    {
      "review_title": null,
      "content": "Will go down as the best horror comedy of all time.",
      "review_date": "2009-06-23"
    },
    {
      "review_title": null,
      "content": "Very good zombie movie. not so scary but there is enough humor and eye-candy for horror lovers too make it a memorable view.",
      "review_date": "2006-10-26"
    },
    {
      "review_title": null,
      "content": "This film joins the ranks of other such horror movie parodies/homages the likes of Young Frankenstein. I agree with George Romero when he said \"An Absolute Blast!\". This movie will forever remain a cult classic like the original Night of the This film joins the ranks of other such horror movie parodies/homages the likes of Young Frankenstein. I agree with George Romero when he said \"An Absolute Blast!\". This movie will forever remain a cult classic like the original Night of the Living Dead.",
      "review_date": "2006-02-25"
    },
    {
      "review_title": null,
      "content": "This is clearly the best zombie parody I have ever seen, it beats actual zombie movies by a long shot!",
      "review_date": "2007-05-15"
    },
    {
      "review_title": null,
      "content": "Perhaps what is so endearing about this film, aside from the ceaseless humor and the spatterings of fun gore, is the fact that the viewers find themselves sincerely attached to the characters and their plights...the film is able to leap from Perhaps what is so endearing about this film, aside from the ceaseless humor and the spatterings of fun gore, is the fact that the viewers find themselves sincerely attached to the characters and their plights...the film is able to leap from hysteria-humor to seriousness in a second when Pegg and his cohorts will it. A brilliant film that is actually quite a bit better than any other zombie film I've ever seen.",
      "review_date": "2008-04-13"
    },
    {
      "review_title": null,
      "content": "I think I laughed 3 times during this movie. The only thing that kept me watching was hoping it would get funnier. I thought it must get funnier because everyone had raved about this film; it never did. The best I can say was that it was OK. I think I laughed 3 times during this movie. The only thing that kept me watching was hoping it would get funnier. I thought it must get funnier because everyone had raved about this film; it never did. The best I can say was that it was OK. Hot Fuzz was much better.",
      "review_date": "2008-04-28"
    },
    {
      "review_title": null,
      "content": "I find Shaun of the Dead to be a wonderful satire of zombie movies, with witty humor and a hilarious plot line, yet it was still able to retain the traditional survivor-mentality. I think both Pegg and Frost played great idiot-saviors in the I find Shaun of the Dead to be a wonderful satire of zombie movies, with witty humor and a hilarious plot line, yet it was still able to retain the traditional survivor-mentality. I think both Pegg and Frost played great idiot-saviors in the film, and Moran's role as the resistor and eventually the next meal was hilariously stunning. He had it coming.",
      "review_date": "2009-06-27"
    },
    {
      "review_title": null,
      "content": "My favorite zombie movie of all time. Stays respectful to its inspiration through the hilarious parody.",
      "review_date": "2009-09-07"
    },
    {
      "review_title": null,
      "content": "Great humour, editing, soundtrack and all the subtilties.",
      "review_date": "2005-12-21"
    },
    {
      "review_title": null,
      "content": "I'm sorry but you'd have to be retarded not in some way to like this movie. It's witty, gory, all around intelligent portrayal of zombies in a city already populated by living zombies is brilliant.",
      "review_date": "2006-02-19"
    },
    {
      "review_title": null,
      "content": "This movie made me lough hard and often. Really good comedy.",
      "review_date": "2007-04-19"
    },
    {
      "review_title": null,
      "content": "Ever Since I saw Dawn of the Dead, I knew that horror movies had a spoof coming and Shaun of the Dead was that perfect spoof. And with the Zombie violence not too unbareable to watch, The movie really made you believe that it was really Ever Since I saw Dawn of the Dead, I knew that horror movies had a spoof coming and Shaun of the Dead was that perfect spoof. And with the Zombie violence not too unbareable to watch, The movie really made you believe that it was really happening, and these two slackers were actually saving their little town. Overall this was a hilarious movie, with some good action, and probably one of the best endings in movie history. It's a definite must see and if you want to see some Zombies eatin' some brains and a good laugh, watch this movie.",
      "review_date": "2007-04-25"
    },
    {
      "review_title": null,
      "content": "For a British film, Shaun of the Dead hits the spot, particularly as a lot of the horror movies have come from America, zombies in particular. Simon Pegg and Edgar Wright have written the film realistically and added in the homages and For a British film, Shaun of the Dead hits the spot, particularly as a lot of the horror movies have come from America, zombies in particular. Simon Pegg and Edgar Wright have written the film realistically and added in the homages and traits in a way that doesn't make it look too much like mass advertising or copying. Gore is bearable and the ending with the British Army culling the zombies has remained one of my all-time favourite horror movie scenes. While some of the jokes do not always appeal to all ages, the film largely increased my interest in the zombie genre. All in all, it makes a good homage and it's good to see Britain is capable of making good films after all.",
      "review_date": "2009-04-29"
    },
    {
      "review_title": null,
      "content": "Great movie. Like a mix of Spaced, Monty Python, Night of The Living Dead, and a Staurday with my friends while we LARP a zombie outbreak. Very funny. I like Brittish humour. I find it as the \"thinking man's\" humour. Watch the movie and Great movie. Like a mix of Spaced, Monty Python, Night of The Living Dead, and a Staurday with my friends while we LARP a zombie outbreak. Very funny. I like Brittish humour. I find it as the \"thinking man's\" humour. Watch the movie and you'll either love it, or hate it.",
      "review_date": "2005-11-14"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead is clever, witty, and just as inventive as it is funny. It took what the world knew as a horror spoof and turned it on its end. It shaped the way we look at the horror/comedy genre and will continue to be at the top tier ofShaun of the Dead is clever, witty, and just as inventive as it is funny. It took what the world knew as a horror spoof and turned it on its end. It shaped the way we look at the horror/comedy genre and will continue to be at the top tier of the genre until another film like it is made. An absolute romp from start to finish that leaves you satisfied, but wanting more. A must see for horror, comedy, or movie lovers of the like.",
      "review_date": "2013-07-27"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis has to be one the most original comedies in years. It mixes the genre of horror spectacularly with the comedy. With such a depressing subject which has been explored by people such as George A. Romero, it's not the first zombie comedy, but I do think it is the best. The lines are great, the irony is clever, and each scene leaves you with a smile. Edgar Wright is a brilliant director and I am a fan of his works that I've seen. What works in his movies is the characters are so realistic and you can immediately identify with them. An example would be Ed, he is such a jerk but he's the kind of friend you've known forever. I think everyone has had this type of friend in their life at one point or another. Edgar Wright also has great symmetry with his movies, such displayed early on with two near identical long takes, that are just beautiful to behold. Also nearly every line has a just payoff, making the dialogue also very clever. The comedy is hilarious, the characters are great, and the editing is fast-paced and brilliant which leaves this movie impossible to keep your eyes off.",
      "review_date": "2013-08-28"
    },
    {
      "review_title": null,
      "content": "It should be noted that this is the best Zombie film of the 21st century. It also should be noted that the superior quality of this film made Edgar Wright and Simon Pegg internationally noticed.",
      "review_date": "2014-01-20"
    },
    {
      "review_title": null,
      "content": "The most memorable zombie comedy to date, Shaun of the Dead is just as good now as when it came out 16 years ago. As the first entry in Edgar Wright's Three Cornettos trilogy, it establishes a lot of ideas and elements that carry through allThe most memorable zombie comedy to date, Shaun of the Dead is just as good now as when it came out 16 years ago. As the first entry in Edgar Wright's Three Cornettos trilogy, it establishes a lot of ideas and elements that carry through all three films. The movie is thought provoking, sad when it needs to be sad, funny when it needs to be funny, and gory when it needs to be gory. There are a few slow scenes in the film, but this is a must-see for any zombie or comedy fan.",
      "review_date": "2020-01-25"
    },
    {
      "review_title": null,
      "content": "This movie is a match made in Heaven, Zombies and comedy, it will surprise you how funny, but yet just as brutal as any other Zombie movie, I have to admit some of the emotional parts feel awkward amongst the jokes, but this is still a movieThis movie is a match made in Heaven, Zombies and comedy, it will surprise you how funny, but yet just as brutal as any other Zombie movie, I have to admit some of the emotional parts feel awkward amongst the jokes, but this is still a movie I highly recommend to fans of Zombies, and comedies in general, a fantastic movie.",
      "review_date": "2016-09-09"
    },
    {
      "review_title": null,
      "content": "Great film with lots of laugh and some action packed moments. Is a zombie film that at the same time honors and make fun of the strongholds of the zombie genre. The directing of Wright is, as always, superb. The cast is quite good and theGreat film with lots of laugh and some action packed moments. Is a zombie film that at the same time honors and make fun of the strongholds of the zombie genre. The directing of Wright is, as always, superb. The cast is quite good and the jokes are always funny.Is not the funniest of the Cornetto Trilogy (The award goes to Hot Fuzz) but is still a solid, well executed and hilarious film.",
      "review_date": "2017-09-15"
    },
    {
      "review_title": null,
      "content": "A fantastic mix of romantic comedy, zombie movie homage and social commentary portrayed through excellent writing and direction and helped along by the strength of the personality of the stars.",
      "review_date": "2018-02-10"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead probably shouldn't work. It aims to be funny, dramatic, exciting, and totally brutal all at once. But it does work. Every element works like gangbusters, never feeling disjointed. It's brilliantly directed by Edgar Wright inShaun of the Dead probably shouldn't work. It aims to be funny, dramatic, exciting, and totally brutal all at once. But it does work. Every element works like gangbusters, never feeling disjointed. It's brilliantly directed by Edgar Wright in his feature debut. It's edited in such a way that's full of energy and cuts all fat from the edges. The cast sells the comedy and the drama. The action is tense, and you truly feel as if the characters are in danger. You care if they live or die.Wright and his co-writer Simon Pegg (who also stars in the film) clearly love the zombie genre, and they play around with its conventions in wonderfully hilarious ways, without ever making the film feel like a parody. The attention to detail is astounding. I've seen it countless times, and I discover something new with every viewing. An absolute blast from start to finish, this is one of the best zombie movies ever made.",
      "review_date": "2017-09-04"
    },
    {
      "review_title": null,
      "content": "Absolutely hilarious British comedy, and honestly the best of its type. This is definitely one of my all time fave movies and will give anyone a good belly laugh. It does have some emotional moments throughout but is mostly just an awesomeAbsolutely hilarious British comedy, and honestly the best of its type. This is definitely one of my all time fave movies and will give anyone a good belly laugh. It does have some emotional moments throughout but is mostly just an awesome zombie comedy.",
      "review_date": "2018-02-18"
    },
    {
      "review_title": null,
      "content": "Comedy zombie movie. Great characters, hilarious jokes, fun.I highly recommend it.",
      "review_date": "2018-12-15"
    },
    {
      "review_title": null,
      "content": "No one!!!!!!!!!!!!! Ever!!!!!!! Beats!!!!!!! SHAUN!!!!!!!!!!!!!!!!!!!!!!!!!",
      "review_date": "2019-05-07"
    },
    {
      "review_title": null,
      "content": "Shaun Of The Dead is honestly a masterpiece and a half, the plot is honestly great. It's about this man called Shaun (Simon Pegg) we can tell from the start of this movie he's not a very brave character and he get's talked over a lot but thatShaun Of The Dead is honestly a masterpiece and a half, the plot is honestly great. It's about this man called Shaun (Simon Pegg) we can tell from the start of this movie he's not a very brave character and he get's talked over a lot but that later changes when the zombies start to appear.Also, throughout this movie we get to see the character of Shaun change from how he once was and it's done so well. The other characters throughout this movie are also great especially Ed (Nick Frost) he's a very hilarious character from start to finish and so is Shaun throughout this movie.The chemistry which Shaun and Ed have throughout this movie is honestly great, it's nicely displayed when they're either murdering a bunch of zombies together or just having some banter together in a pub, either way the two of them have got some great chemistry with each other throughout this movie.Finally, the movie's got some very cleverly done fight scenes but oh my god, they're very brutal, very gory and very bloody but they're amazingly well done. Also, the love interest which Shaun has got for Liz (Kate Ashfield) is built up very well and it's honestly great.Overall, Shaun Of The Dead is honestly a masterpiece and a half. The movie's got a great plot, brilliant and funny characters, a great love interest, bloody and gory fight scenes, the dialogue is honestly great and so is the acting from all the cast, it's honestly worth the watch.",
      "review_date": "2020-07-31"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead is a very good movie. the plot is very good and the characters are unforgettable. One of the best comedies ever made.",
      "review_date": "2020-09-22"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead has to be one of the funniest movies ever made. Simon Pegg and Nick frost make for an awesome comedic duo, as also seen in Hot Fuzz.The movie manages to give laughs, as well as being somewhat frightening and touching atShaun of the Dead has to be one of the funniest movies ever made. Simon Pegg and Nick frost make for an awesome comedic duo, as also seen in Hot Fuzz.The movie manages to give laughs, as well as being somewhat frightening and touching at points.9/10, great piece of art!",
      "review_date": "2010-10-13"
    },
    {
      "review_title": null,
      "content": "Other than the \"Simon Pegg+Nick Frost\" performance combo, \"Shaun of the Dead\" throws in humor, a humor that applies to every kind of problems we have; politics, life, love and so on. A zombie movie that is humorously scary to watch.",
      "review_date": "2011-09-10"
    },
    {
      "review_title": null,
      "content": "One of the best zombie movies ever. The death parts were very funny!",
      "review_date": "2006-10-31"
    },
    {
      "review_title": null,
      "content": "Great British zombie horror comedy that I ever seen. Everyone is hilarious and they have the funniest catchphrases.",
      "review_date": "2011-03-11"
    },
    {
      "review_title": null,
      "content": "British humour at it's best.  What kind of person couldn't adore such awesome characters mixed in with the most dangerous situation known to humanity.  I still can't believe that there is red on reviews.  sex on a disc!",
      "review_date": "2011-11-06"
    },
    {
      "review_title": null,
      "content": "An amazing film starting off an amazing film series. This film is perfect, and the best in the trilogy. The humour is great, and the action sequences are also great. The character development is good. There are so many little touches in theAn amazing film starting off an amazing film series. This film is perfect, and the best in the trilogy. The humour is great, and the action sequences are also great. The character development is good. There are so many little touches in the films you may not notice, which make the film completely perfect, and in my opinion, the best film ever made.",
      "review_date": "2014-02-10"
    },
    {
      "review_title": null,
      "content": "Unbelievably funny.  I saw this just a year ago and screamed in laughter.  These actors were so funny and had great comedic timing.  It is bloody even for the TV version so for R, you are probably in for some gruesome scenes.  The storyline,Unbelievably funny.  I saw this just a year ago and screamed in laughter.  These actors were so funny and had great comedic timing.  It is bloody even for the TV version so for R, you are probably in for some gruesome scenes.  The storyline, even if it is a spoof of the classic \"Dawn of the Dead\"  was original and brilliantly written.",
      "review_date": "2011-03-02"
    },
    {
      "review_title": null,
      "content": "Simon Pegg, Nick Frost and Edgar Wright could be described as the new Three Stooges, having given us so many wonderfully funny treats each year. However, their 2004 \"romzomcom\" shot them to stardom and single-handedly managed to reviveSimon Pegg, Nick Frost and Edgar Wright could be described as the new Three Stooges, having given us so many wonderfully funny treats each year. However, their 2004 \"romzomcom\" shot them to stardom and single-handedly managed to revive British horror. Shaun is a young man working in an electrical store has a rocky relationship with his mum, his girlfriend Liz is on the verge of dumping him and his best mate Ed is a complete slob who spends his days on Shaun's couch playing videogames and drinking beer, When he finally decides to get off his feet and sort his life out, a zombie invasion takes place but Shaun merely sees it as another obstacle. When he rounds up his family and friends and takes them to his local pub to try and survive the night. A real treat for all fans of British comedy and at the same time a gorefest that harkens back to the days of Peter Jackson's Braindead. Bloody brilliant.",
      "review_date": "2011-05-02"
    },
    {
      "review_title": null,
      "content": "i found this film very entertaining there was lots of goo humor in it and a little drama as well and i enjoyed every minute however i am not going to say it was perfect there were flaws but i have never actually seen any movie that is perfecti found this film very entertaining there was lots of goo humor in it and a little drama as well and i enjoyed every minute however i am not going to say it was perfect there were flaws but i have never actually seen any movie that is perfect in every way",
      "review_date": "2011-05-21"
    },
    {
      "review_title": null,
      "content": "Each time I watch this I find it funnier and funnier, and its bloody funny to begin with. Has to be in everyone's top 10 movies.",
      "review_date": "2009-10-03"
    },
    {
      "review_title": null,
      "content": "The first of a \"Cornetto Trilogy\" from friends and regular collaborators Edgar Wright and Simon Pegg, Shaun (Pegg) is a bored and routine thirty something who spends too much time at the local pub, the Winchester, with his best friend EdThe first of a \"Cornetto Trilogy\" from friends and regular collaborators Edgar Wright and Simon Pegg, Shaun (Pegg) is a bored and routine thirty something who spends too much time at the local pub, the Winchester, with his best friend Ed (Nick Frost) who doesn't do a whole lot with his life, Shaun's girlfriend Liz (Kate Ashfiled) is annoyed at his lack of focus and believe that Ed is holding him back. They sit and play video games, Shaun goes to work and is made fun of by his much younger colleagues, while also going through his life in sort of auto-pilot mode of repeating the same at ions day in and day out. The excellent refreshment of the film stems from what is really a subplot, that lead have risen as zombies and are eating the living, yet the constant bickering of these three, along with Liz's friends Dianne (Lucy Davis) and David (Dylan Moran) takes centre stage as they attempt to come up with plans at every turn in an attempt to get through a situation. The dark humour is particularly well written from Pegg and Wright, who also directs the film, his fast-paced and energetic style of filming adds heightened tension to otherwise menial scenes, these are definitely callbacks to zombie films of old, they need to get to a safe haven, which Shaun and Ed believe to be the local pub of course, is it so wrong to sit in relative comfort and drink free booze until an apocalypse blows over?  The human element feels grounded and doesn't give way to too much zombie time, we get various situations of such routine where we even see Shaun walk to the shop and back without even noticing the people around him where zombies, it was funny, but it also showed a message of just how familiar people will be that we don't even notice change right in front of us. The witty britishness of it all is particularly fresh, a cup of tea will fix everything, while even in the most frightening of circumstances, jokes bar regulars and dead people not being your real dad can still hold a dark sense of comic relief, especially in a time of zombie overkill in the film industry, no pun intended. We have chemistry and urgency with the characters to get the point across, Pegg and Frost are the perfect duo, no matter how much Shaun wants to change, he can't say no to his best friend. Its a relief to see a different sort of apocalyptic film that centres much more on the people involved and how it affects their routine, especially in a hilarious and witty way.",
      "review_date": "2013-10-22"
    },
    {
      "review_title": null,
      "content": "Not anywhere as funny as I thought it should be. From all the reviews, I thought it would be clever, but it was on the level with dumb sex comedies with the addition of zombies. Couldn't stand the characters and it was rushed and lame Not anywhere as funny as I thought it should be. From all the reviews, I thought it would be clever, but it was on the level with dumb sex comedies with the addition of zombies. Couldn't stand the characters and it was rushed and lame that they all die within ten minutes. ",
      "review_date": "2006-02-13"
    },
    {
      "review_title": null,
      "content": "Everybody's gone wild about this zom-com, and I'm not loving it. Nick Frost and Simon Pegg have been in a few movies together, and I haven't liked any of them. Maybe there's something wrong with me, but like I said, I'm not loving it.",
      "review_date": "2012-11-15"
    },
    {
      "review_title": null,
      "content": "I really couldn't get into this movie. I know it's a comedy, but I didn't feel like laughing at any poiny in this movie. I mean, I enjoyed the movie's plot, but the genre is where this movie falls short.",
      "review_date": "2014-12-01"
    },
    {
      "review_title": null,
      "content": "I am not quite sure how any one person can sit through even ten minutes of a film such as this, let alone watch to whole darn thing. 'Shaun of the Dead' deserves no rating higher than what i have chosen to rate it, and believe anyone whoI am not quite sure how any one person can sit through even ten minutes of a film such as this, let alone watch to whole darn thing. 'Shaun of the Dead' deserves no rating higher than what i have chosen to rate it, and believe anyone who actually feels like this film is worthy of production, should reconsider their life choices.",
      "review_date": "2011-11-18"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead is a tasteless, disgusting piece of work with very little redemption or justification for all its gore. It's plot points are stupid and hypocritical, the characters are some of the most annoyingly stupid people I've everShaun of the Dead is a tasteless, disgusting piece of work with very little redemption or justification for all its gore. It's plot points are stupid and hypocritical, the characters are some of the most annoyingly stupid people I've ever seen on a screen, and the movie feels decidedly incompetent. One of the worst movies I have ever seen.",
      "review_date": "2014-06-19"
    },
    {
      "review_title": null,
      "content": "After the first hour the movie lagged. The movie drew me in though at the beginning literally being too funny to fathom how they imitated the horror genre.",
      "review_date": "2011-11-01"
    },
    {
      "review_title": null,
      "content": "This is a fairly entertaining movie... but i personally see no purpose so for me this is a pointless story, waste of money and a waste of our time rating this over the well-deserved rating of... 5",
      "review_date": "2011-01-12"
    },
    {
      "review_title": null,
      "content": "Overrated clap-trap that has amazingly found its way into the consciousness of self-proclaimed geeks, nerds and other cretins and subsequently opened the floodgates for the current spate of zombie-obsessed pop culture rubbish. Film isOverrated clap-trap that has amazingly found its way into the consciousness of self-proclaimed geeks, nerds and other cretins and subsequently opened the floodgates for the current spate of zombie-obsessed pop culture rubbish. Film is entertaining enough upon first viewing but after the first half hour you don't exactly need powers of clairvoyance to guess what's going to happen next.",
      "review_date": "2011-08-15"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead was a real surprise for me. I never really expected to enjoy a zombie movie this much, but I did. Now the film is not great, but it is very entertaining. Simon Pegg, Nick Frost, and Kate Ashfield, are all very good in theirShaun of the Dead was a real surprise for me. I never really expected to enjoy a zombie movie this much, but I did. Now the film is not great, but it is very entertaining. Simon Pegg, Nick Frost, and Kate Ashfield, are all very good in their roles and their chemistry is great. The direction from Edgar Wright is smart and assured. The script is also very good and is loaded with witty dialogue and laughs. The laughs are ultimately the king here, as without the comedy, this one is alright. The thrills and excitement during the zombie sequences are good and certianly very intense, but at times, it can get a bit too gory. There are a few scenes that come to mind particular as being particularly gory and very much over the top. While the humor and thrills are good, I do wish they had toned down that aspect a little. I get that there will be gore in a zombie movie, but this one went overboard in some scenes, which was too bad. Luckily, however, the whole package is solid and very well done. As my first Edgar Wright film, it was a nice introduction to him.",
      "review_date": "2014-08-28"
    },
    {
      "review_title": null,
      "content": "Possibly my favourite movie ever! I can not say enough about how great this movie is. Everything about this movie is fantastic! Everyone should at least see this movie once.",
      "review_date": "2014-01-29"
    },
    {
      "review_title": null,
      "content": "shaun of  the dead is not as bit as funny as i thought but the fact that its zom com it is funny watching simon pegg and nick frost killing zombies . but it is a okay film",
      "review_date": "2014-03-11"
    },
    {
      "review_title": null,
      "content": "I thought that Shaun of the Dead wouldn't be my style, I seriously thought I would hate it. But no...I loved it. Some parts do drag, especially the beginning which took a little too long to get going, but I loved the film's deadpan andI thought that Shaun of the Dead wouldn't be my style, I seriously thought I would hate it. But no...I loved it. Some parts do drag, especially the beginning which took a little too long to get going, but I loved the film's deadpan and offbeat style and effortless mix of undergraduate humour and hardcore horror. If you love blood and gore, you have found your match with Shaun of the Dead, and if you love offbeat and sophisticated humour delivered in a deadpan way you have also met your match. The cinematography is innovative and unique, the music just adds to the atmosphere, the screenplay is extraordinarily clever and hilarious and the story is original and well constructed. Another strong asset is the cast, Simon Pegg is just wonderful, and Nick Frost is hilarious. Then we have great actors like Penelope Wilton and Bill Nighy who are terrific as Barbara and Phillip. Overall, just a great film, although it is a one-joke concept it actually works. 9/10 Bethany Cox",
      "review_date": "2022-03-24"
    },
    {
      "review_title": null,
      "content": "¿Who says the walking dead is not laughing matter? See to learn what may happen when a natural born loser and his only friend becomes the unusual heroes in the middle of a zombie apocalypse. Lots of gags with the typical British recipe.",
      "review_date": "2019-12-04"
    },
    {
      "review_title": null,
      "content": "I find this movie a bit perplexing. I have given it a 7 out of 10 rating, yet last night (Halloween) I sat and watched this movie twice in a row, one after another. The second time I watched the movie set on Zombie-O-Meter. So I probablyI find this movie a bit perplexing. I have given it a 7 out of 10 rating, yet last night (Halloween) I sat and watched this movie twice in a row, one after another. The second time I watched the movie set on Zombie-O-Meter. So I probably should give it a higher rating yet I can't seem to find it in me to do so right now. It does have some graphic gore, yet it is also a funny movie at times. I might be able to give it a higher rating if I was a bigger fan of Gore and zombies. The Undead is just not the most appealing aspect of moviedom for me.",
      "review_date": "2010-11-01"
    },
    {
      "review_title": null,
      "content": "Shaun is generally a nice guy but drives his girlfriend mad with his lack of ambition and insistence on spending every evening in the local pub. When London suddenly comes under attack from zombies Shaun realizes that, with the help of bestShaun is generally a nice guy but drives his girlfriend mad with his lack of ambition and insistence on spending every evening in the local pub. When London suddenly comes under attack from zombies Shaun realizes that, with the help of best friend Ed, it is his time to shine.\r Shaun of the Dead is basically a spoof of the zombie movie genre but, unlike the terrible Scary Movie franchise; it shows a genuine understanding and love of the movies in which it spoofs. Featuring a great cast of British comic talent it is far funnier than the majority of comedy movies to come from this country (the duos attempts to imitate a zombie are simply hilarious).\r Not lacking in gore and violence fans of horror films will find just as much entertainment as comedy fans in what has rightly become a cult classic.",
      "review_date": "2014-04-12"
    },
    {
      "review_title": null,
      "content": "I Have Nothing Negative To Say About This Movie At all. It Is The Perfect Movie For Me! It Has 3 Of My 4 Favourite Genres! Action, Horror and Comedy! (Its Only Missing sci-fi, Oh Wait, No it isn't! ZOMBIES!)",
      "review_date": "2011-08-05"
    },
    {
      "review_title": null,
      "content": "Plenty of gore, but it's all played for laughs. Simon Pegg is a terrifically comic actor and always knows how to make people laugh. Despite the panic-stricken individuals running around aimlessly, this film has a tight zombie-romance-comedyPlenty of gore, but it's all played for laughs. Simon Pegg is a terrifically comic actor and always knows how to make people laugh. Despite the panic-stricken individuals running around aimlessly, this film has a tight zombie-romance-comedy edge to it and some of the killings are just hilarious. It doesn't need to be sophisticated, which it isn't, but it doesn't reduce it to slapstick and toilet humour either. This film enters straight through the middle instead. Although it had zombies in it, there was a lot of comedy because most things were played for laughs, but there were a few horrific moments. Makes Shaun's monotonous life much more exciting and probably anyone else's life as well. Take control of your life, like Shaun - even if it includes the zombie apocalypse.",
      "review_date": "2012-07-24"
    },
    {
      "review_title": null,
      "content": "This is the best mix of beer and blood I have ever tasted. \"Shaun of the Dead\" has some great comical moments and yet it has been made with lots of professionalism like this was a serious gory horror movie they were making. Because of this,This is the best mix of beer and blood I have ever tasted. \"Shaun of the Dead\" has some great comical moments and yet it has been made with lots of professionalism like this was a serious gory horror movie they were making. Because of this, through its seriousness, the movie becomes perhaps even more hilarious and really delivers. Both the fans of the (British) comedy-genre and the fans of mainly 'Zombie' movies and other gory horror-movies, will be entertained by this movie. I Actually don't watch any zombie movie... but I really really enjoy this one... Very entertaining from start till it run out of gas...",
      "review_date": "2011-11-20"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead is hilarious at times but also inconsistent and contrived.",
      "review_date": "2019-05-30"
    },
    {
      "review_title": null,
      "content": "One of my all-time favorites.\r This movie puts tongue firmly in cheek then has a zombie bite it off.\r Wit, social commentary and geeky references galore make this a fun movie to watch with some mates.",
      "review_date": "2013-08-22"
    },
    {
      "review_title": null,
      "content": "It pushes the horror-comedy formula to new grounds, all the while being intelligent, funny, and occasionally emotional -- however sometimes too much so.",
      "review_date": "2012-12-29"
    },
    {
      "review_title": null,
      "content": "Both hilarious and gory Shaun of the Dead is both a successful comedy and zombie movie. Great acting by the entire cast and impeccable writing and directing by Edgar Wright.",
      "review_date": "2013-07-26"
    },
    {
      "review_title": null,
      "content": "Shaun of the dead : It's often said that the true character of a man is only revealed in times of dire crisis, and for likable, lovelorn loser Shaun (Simon Pegg), that moment of reckoning came when the dead rose from their slumber to feast onShaun of the dead : It's often said that the true character of a man is only revealed in times of dire crisis, and for likable, lovelorn loser Shaun (Simon Pegg), that moment of reckoning came when the dead rose from their slumber to feast on the flesh of the living. A hapless electronics store employee who spends most of his spare time downing pints at the local pub with his roommate, Ed (Nick Frost), Shaun's life seems to fall apart when he is dumped by his girlfriend, Liz (Kate Ashfield), and his obnoxious stepfather, Philip (Bill Nighy), shows up to berate him for not being more attentive to his caring mother Barbara (Penelope Wilton) -- especially since he forgot to send flowers for her birthday. Things take a turn for the worse when the dead return to stake their claim on the Earth, and though the chaos that follows threatens to swallow up all of England, it's up to Shaun to keep his cool and prove himself once and for all by successfully rescuing Liz and his mother. With his trusty roommate by his side, nothing -- not even the living dead -- can stand between Shaun and the two most important women in his life.\rOverall it",
      "review_date": "2012-10-16"
    },
    {
      "review_title": null,
      "content": "Every time I see this movie, I break out into laughter. This is one of the smartest, quirkiest, funniest movies I have ever seen.  This is the best british film I have ever seen, and is one of my all time favorite movies.",
      "review_date": "2013-05-04"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead is the perfect picture of what friends and passion mixed with a healthy dose of pure comic talent can do. Shaun of the Dead is clever, funny, witty, and in the end; heartfelt.",
      "review_date": "2015-07-26"
    },
    {
      "review_title": null,
      "content": "A must watch. One of my all-time favorite movies.....................................................................................................................................................................................",
      "review_date": "2013-06-18"
    },
    {
      "review_title": null,
      "content": "Great film. The comedy was great yet it wasn't too funny so as to shadow out the horror theme of the movie. Simon and nick are great comedic actors. Absolute British classic.",
      "review_date": "2013-07-16"
    },
    {
      "review_title": null,
      "content": "Shaun of The Dead is another zombie-apocalypse flick, but that stands on its own as an entertaining, funny and a somewhat action-packed everyday adventure in a changed world. Team Pegg-Frost (Simon Pegg & Nick Frost) continues to impress onShaun of The Dead is another zombie-apocalypse flick, but that stands on its own as an entertaining, funny and a somewhat action-packed everyday adventure in a changed world. Team Pegg-Frost (Simon Pegg & Nick Frost) continues to impress on the big screen, and the greatest aspect is just that, including dialogs, story and cinematogrophy. But it lacks a greater editing, and combined with the fact that it tries to be serious and a comedy at the same time (in a way that could have looked better), is it not as \"amazing\" as the critics. It also lacks long-term action, and a perhaps longer ending. But it still manages to embrace a few laughs here and there. Recommend it.\r 7/10",
      "review_date": "2015-08-10"
    },
    {
      "review_title": null,
      "content": "A surprisingly well-orchestrated zombie movie with smart and hilarious comedy from Wright and Pegg. One of the most ingenious zombie films of the 2000's, and quite possibly the best. Zombie films do not particularly grow more refined with ageA surprisingly well-orchestrated zombie movie with smart and hilarious comedy from Wright and Pegg. One of the most ingenious zombie films of the 2000's, and quite possibly the best. Zombie films do not particularly grow more refined with age at all, this being the best exception.",
      "review_date": "2014-01-09"
    },
    {
      "review_title": null,
      "content": "Wow, what an incredibly funny and entertaining movie! The fact that people don't find this movie hilarious boggles my mind! If you haven't seen this movie yet, go watch it! You're missing out if you don't.",
      "review_date": "2013-09-08"
    },
    {
      "review_title": null,
      "content": "It was somewhat funny. It did have good acting, which is what makes really good movies good. With the script going good for a zombie film, I don't think it could have gone any better.",
      "review_date": "2013-11-29"
    },
    {
      "review_title": null,
      "content": "Brilliant movie and beyond entertaining as far as Zombie movies are concerned.  Nick Frost and Simon Pegg are sublime together and they make this movie a must see.",
      "review_date": "2013-09-30"
    },
    {
      "review_title": null,
      "content": "This film is an utterly remarkable. I am not a keen fan of the zombie genre due to many of them having pathetic plots. World gets infected  lone group of survivors  full bloody massacre. I may be contradicting myself, because this movie has aThis film is an utterly remarkable. I am not a keen fan of the zombie genre due to many of them having pathetic plots. World gets infected  lone group of survivors  full bloody massacre. I may be contradicting myself, because this movie has a similar story line, but its because of Simon Pegg and Nick Frost`s onscreen chemistry, its superb use of British humor and Edgar Wrights kinetic direction that makes the film \"awesome\".",
      "review_date": "2013-11-16"
    },
    {
      "review_title": null,
      "content": "Cleverly written and cast perfectly, Shaun of the Dead is one of the rare parody movies that actually work. And by work, I mean knock it out of the park. Shaun of the Dead is fun, gory, and witty with a few feels that come along for the ride as well.",
      "review_date": "2014-05-07"
    },
    {
      "review_title": null,
      "content": "This comedy/horror is one of my favourite movie of all-time with is horror/comedy/action scenes.The story is just not original but the result is there and that is what it takes to make a good movie.",
      "review_date": "2014-04-19"
    },
    {
      "review_title": null,
      "content": "Simon Pegg, Edgar Wright and Nick Frost are the ultimate dream team;  'Shaun of the Dead' is hilariously acted, intelligently directed (using Wright's signature short clips sequence) and well written.  The characters are believable and thereSimon Pegg, Edgar Wright and Nick Frost are the ultimate dream team;  'Shaun of the Dead' is hilariously acted, intelligently directed (using Wright's signature short clips sequence) and well written.  The characters are believable and there are even one or two genuinely scary moments.\r This film must be watched by all comedy-horror fans.",
      "review_date": "2014-07-18"
    },
    {
      "review_title": null,
      "content": "i love this film. it's hilarious with amazing writing and acting, edgar wright is really selling himself as an amazing director and writer and this film along with the other films in the cornetto trilogy will be what he is remembered for. fori love this film. it's hilarious with amazing writing and acting, edgar wright is really selling himself as an amazing director and writer and this film along with the other films in the cornetto trilogy will be what he is remembered for. for the love of god if you haven't seen it go and see it now it's an excellent parody of romantic comedies and zombie movies and one of my all time favourite movies",
      "review_date": "2014-12-12"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n'The Winchester?' Pegg delivers a spellbinding and hilarious performance in this horror movie spoof. The Zombies are well designed and rely on subtle approaches rather than blatant violence to creep up on the audience. The plot was sound as the dialogue, typically blunt Midlands slang stirs the emotions. A feast of humour, irony and just outright Zombie hunting. 4 stars",
      "review_date": "2014-12-03"
    },
    {
      "review_title": null,
      "content": "Simon Pegg and Nick Frost, along with director Edgar Wright of \"Spaced\" fame tackle feature films in 'Shaun of the Dead' a romantic comedy, with zombies...or a \"RomZomCom\" which this is marketed as...\r The movie focuses on a typical, loserSimon Pegg and Nick Frost, along with director Edgar Wright of \"Spaced\" fame tackle feature films in 'Shaun of the Dead' a romantic comedy, with zombies...or a \"RomZomCom\" which this is marketed as...\r The movie focuses on a typical, loser living in a small flat named Shaun (Pegg), he lives with his best friend Ed (Frost) and his housemate, Pete (Peter Seranfinowiz) who is always stressed that they don't live in the house properly, nor do they contribute and their living conditions are intolerable.\r Shaun is quite happy being with his girlfriend, Liz (Kate Ashfield), but she doesn't see him as a serious boyfriend, since he doesn't know that much about her, nor does he make any of the effort in their relationship. Obviously, since this is \"Shaun of the Dead\", zombies seem to invade the streets of London, and it seems that Shaun and Ed are the only survivors, they must rescue Liz, Shaun's mother (Penelope Wilton), and his step-father, Phillip (Bill Nighy) who he doesn't get along with.\r The movie moves at a fast-paced, and the comedy does keep it alive, and that's because writer and director Edgar Wright keeps the jokes fresh and balanced. The timing is perfect too, and that's thanks to the terrific chemistry that Pegg and Frost have together. There are also serious moments aplenty, and that's where you start to care for the characters even more, they are more than just some comedic archetypes.\r 'Shaun of the Dead' is a gut-busting, hilarious and sometimes, effective drama with the comedy beats for a good Friday night movie.",
      "review_date": "2016-05-13"
    },
    {
      "review_title": null,
      "content": "Нормальный фильм.Мне нравится английский юмор, чёрный английский юмор. Пример тому сериал \"Переростки\".Но этот фильм заставил улыбаться не так уж и много. Порой было довольно скучно. Но всё таки есть пара интересных моментов и достойныеНормальный фильм.Мне нравится английский юмор, чёрный английский юмор. Пример тому сериал \"Переростки\".Но этот фильм заставил улыбаться не так уж и много. Порой было довольно скучно. Но всё таки есть пара интересных моментов и достойные шутки.Итог: Неплохая комедия, для ценителей чёрного английского юмора.",
      "review_date": "2017-02-20"
    },
    {
      "review_title": null,
      "content": "Shaun of the Dead is a spoof, but at the same time, it's a semi-serious horror movie. It's also an homage to George Romero's Dead series (Night of the Living Dead, Dawn of the Dead, Day of the Dead) and a societal commentary. Admittedly, withShaun of the Dead is a spoof, but at the same time, it's a semi-serious horror movie. It's also an homage to George Romero's Dead series (Night of the Living Dead, Dawn of the Dead, Day of the Dead) and a societal commentary. Admittedly, with so many choices on the menu, director Edgar Wright cooks some of them better than others. But the bottom line is simple: Shaun of the Dead may not be consistently scary (in fact, it's almost never scary), but it is consistently funny (if you have a slightly warped sense of humor) and never loses its audience.\r Perhaps the best way to describe the film's comedy is to call it \"British humor.\" Don't expect a gag-a-minute affair like Scary Movie, or a TV sit-com approach. Shaun of the Dead's niche is much closer to the one occupied by Evil Dead 2 (and its sequel, Army of Darkness) and Tremors. Those movies understood what makes a good horror movie, then had some fun with the premise, neither taking it too seriously nor utilizing contempt in its ridicule. In order to make a truly effective parody of a genre (or, in this case, a specific sub-genre), it is first necessary to have a heartfelt appreciation for the serious efforts that exist. Shaun of the Dead isn't camp. It's not a movie that's unintentionally laughable. This is supposed to be funny, but I wonder if much of the comedy will be lost on those who haven't spent a fair amount of time watching screen zombies.\r Dawn of the Dead used the zombies as metaphors for consumers. In Shaun of the Dead, the shuffling, slack-jawed creatures are stand-ins for those of us who have become so desensitized to life that we're existing in a vacuum of routine. In terms of character arc, Shaun of the Dead is about Shaun's freeing himself from the cycle. Of course, it takes a zombie invasion for this to happen. If the dead had stayed in their graves, he would still be playing video games with Ed and bemoaning Liz's defection to a more energetic lifestyle.\r There were times when, while watching George Romero's zombie movies, I had to stifle laughter. Cheesy moments abound, although die-hards will deny this. Wright reproduces many of those instances here, but with a difference. In the Dead movies, we're laughing at the film. In Shaun, we're laughing with the director. I won't pretend that Shaun of the Dead is the be-all and end-all of horror comedies. It has plenty of problems, not the least of which is that the horror elements are largely unconvincing (although there is plenty of gore). While there are numerous opportunities to laugh, the movie doesn't always go for the easy joke. Wright wants us to like and identify with Shaun, and there are two things that facilitate this aim: a few surprisingly poignant scenes and a solid \"everyman\" performance by lead actor (and co-screenwriter) Simon Pegg that elevates Shaun above the level of a caricature. Shaun of the Dead is a movie that one might not expect to work at first glance, but, for those who don't mind a little laughter with their zombies (or perhaps it should be the other way around), this is an unusual source of entertainment.",
      "review_date": "2015-04-24"
    },
    {
      "review_title": null,
      "content": "There's something sharp and attractive about the chemistry between Nick Frost and Simon Pegg that means anything that puts them together becomes immediately likeable.  Shaun of the Dead was my first instance of this.  Before I saw this film,There's something sharp and attractive about the chemistry between Nick Frost and Simon Pegg that means anything that puts them together becomes immediately likeable.  Shaun of the Dead was my first instance of this.  Before I saw this film, I was unfamiliar with the TV show \"Spaced\", which apparently let viewers in to the beauty of the Pegg-Frost partnership.  Upon viewing this film, however, I immediately went online to watch every single episode.  Despite being a film about a zombie apocalypse, Shaun of the Dead is a relatable picture; it's a film about romantic, familial and social love, and the obstacles that prevent each of them from blossoming.  The film could function perfectly well without the zombies and would probably be just as funny, but the inclusion of the undead only makes for a fantastic comedy piece that is one of the rare movies that has actually managed to make me laugh out loud.  With fantastic, sometimes unorthodox directing by Edgar Wright and an absolutely stellar cast, I can think of few qualms about this film that prevent it being one of the finest British comedies of the century.",
      "review_date": "2015-05-27"
    },
    {
      "review_title": null,
      "content": "Great movie, cult classic. If you like comedies and especially zombie comedies then this is perfect for you.",
      "review_date": "2019-12-17"
    },
    {
      "review_title": null,
      "content": "Here a great movie zombie apocalypse, with a touch of romantic comedy , might not sound like Warm Bodies , but has a good comic and apocalyptic style.",
      "review_date": "2015-12-03"
    },
    {
      "review_title": null,
      "content": "This movie is a match made in Heaven, Zombies and comedy, it will surprise you how funny, but yet just as brutal as any other Zombie movie, I have to admit some of the emotional parts feel awkward amongst the jokes, but this is still a movieThis movie is a match made in Heaven, Zombies and comedy, it will surprise you how funny, but yet just as brutal as any other Zombie movie, I have to admit some of the emotional parts feel awkward amongst the jokes, but this is still a movie I highly recommend to fans of Zombies, and comedies in general, a fantastic movie.",
      "review_date": "2016-04-18"
    },
    {
      "review_title": null,
      "content": "I love how an actually hilarious attempt to be based on \"(BLANK) of the Dead\" line is better than House of the Dead, a movie based on the Sega game. It always gets me to think logic once again. Shaun of the Dead never runs out of laughs or scares.",
      "review_date": "2016-04-26"
    },
    {
      "review_title": null,
      "content": "Funny British humour, easy movie.  The first half of the movie was interesting (brilliant mockery of everyday zombi-like attitudes of people) but the second half dragged (the classic Zombie attacks).I watched it very late..16 years after hisFunny British humour, easy movie.  The first half of the movie was interesting (brilliant mockery of everyday zombi-like attitudes of people) but the second half dragged (the classic Zombie attacks).I watched it very late..16 years after his relase and maybe that has had an impact on my experience.Best viewed in English dub even if yor'not a native English speaker (with subtitles if needed)",
      "review_date": "2021-01-06"
    }
  ],
  "num_reviews": 134
}