{
    "title": "The Bourne Supremacy",
    "rating": 8.7,
    "release_date": "2004-07-23",
    "genre": [
        "Action",
        "Adventure",
        "Mystery",
        "Thriller"
    ],
    "summary": "The Bourne Supremacy re-enters the shadowy world of expert assassin Jason Bourne (Damon), who continues to find himself plagued by splintered nightmares from his former life. The stakes are now even higher for the agent as he coolly maneuvers through the dangerous waters of international espionage - replete with CIA plots, turncoat agentsThe Bourne Supremacy re-enters the shadowy world of expert assassin Jason Bourne (Damon), who continues to find himself plagued by splintered nightmares from his former life. The stakes are now even higher for the agent as he coolly maneuvers through the dangerous waters of international espionage - replete with CIA plots, turncoat agents and ever-shifting covert alliances - all the while hoping to find the truth behind his haunted memories and answers to his own fragmented past.  (Universal Studios)… Expand",
    "critic_reviews": [
        "A conventionally heightened series of escapes and clashes and hide-and-seek gambits, yet the way the film has been made, nothing that happens seems inevitable -- which is to say, anything seems possible. There's a word for that sensation. It's called excitement.",
        "This is high-speed action realism carried off with the dexterity of a magician pulling a hundred rabbits out of a hat in one graceful gesture. The crowning flourish is an extended car chase through the streets and tunnels of Moscow that ranks as one of the three or four most exciting demolition derbies ever filmed.",
        "Spy movies just got thrilling again.",
        "Rarely does pop come with such sizzle.",
        "As a piece of craft, and with the exception of \"Harry Potter and the Prisoner of Azkaban,\" it's miles beyond any studio film this summer.",
        "The sequel is simply a tour-de-force of thriller filmmaking.",
        "Close to perfect example of an expertly designed and executed thriller.",
        "Trumping its predecessor with a tauter plot, a lower body count and just as many edge-of-the-seat jolts.",
        "Taut, tightly paced and thrilling, with some of the best chase sequences -- whether by foot, taxi or Jeep -- in recent memory.",
        "Greengrass has a fine sense of pacing, keeping events moving. It's rarely hard to guess what's going to happen next, but events unfold with such gusto that there's barely time to notice that.",
        "If you've forgotten the kick you get from watching a globe-trotting, butt-kicking, whiplash-paced action movie done with humor, style and smarts, take a ride with The Bourne Supremacy.",
        "Delivers the expected adrenaline-driven thrills with a fresh eye and a refreshing attitude.",
        "The action sequences are expert studies in controlled chaos.",
        "Goes through its airport-thriller paces with dazzling kinetics and style.",
        "Plot matters more here than spectacle; the film's real climax involves no demolition, but rather two characters in a room quietly discussing devastating events in their past.",
        "The Bourne Supremacy builds on and exceeds the original, delivering, quite simply, one of the finest big-budget thrillers in years.",
        "Achieves an assaultive intensity that adds a level of visceral excitement to car chases, mano-a-mano showdowns -- even simple conversations. It's a style that takes some getting used to -- the images flit by at near-subliminal speeds -- but proves tremendously effective.",
        "That the director, Paul Greengrass, treats the material with gravity and uses good actors in well-written supporting roles elevates the movie above its genre, but not quite out of it.",
        "Directed by Paul Greengrass, the unflinching eye behind \"Bloody Sunday,\" The Bourne Supremacy not only lives up to the promises of the novel by Robert Ludlum, but in many ways manages to improve on the first film.",
        "The strapping Damon's lived-in performance makes us happy to follow Bourne wherever he may go.",
        "The way Greengrass lets you feel the violence is impressive. Most movie heroes punch through armies without scraping their knuckles, but Bourne's a believable wreck by midpoint.",
        "Solid summer entertainment set in a recognizably real world.",
        "The action is confusing at first and the hyperventilated editing style at times goes beyond the pale, so pic ultimately emerges as an erratic but not unworthy sequel to its gritty, genre-invigorating predecessor.",
        "Supremacy is, minor quibbles aside, a worthy successor to “The Bourne Identity.”",
        "Over all, though, the picture fires on all pistons. The globetrotting's a good time-I can't think of another spy film that's featured as delightful an assortment of seamy international undersides.",
        "Putting it mildly, this style of shallow, panting composition isn't the way I’d like movies to go, but, of its kind, The Bourne Supremacy is incredibly skilled--much more exciting than its predecessor.",
        "All herky-jerky camera movements and no pussyfooting around with the interior lives of these characters.",
        "Supremacy has thrills, but without Potente's presence, it loses its soul.",
        "A serviceable thriller - no more, no less.",
        "Like its various post-Cold War European locations, the film remains chilly and distant. \r\nEvery time you feel like you're finally grabbing hold of something involving, the picture once again spins frustratingly out of reach.",
        "The loss of the first film's hurtling who-am-I? story engine is keenly felt, and too much time is spent observing the characters get on and off planes, trains, and automobiles.",
        "A refreshing alternative to the hypertrophied spy thrillers in which exaggerated action sequences, over-the-top super-villainy and high-tech gadgetry trump character and plot.",
        "In Supremacy, Damon is left to play basically one droning, humorless note, which, unfortunately, he does with his eyes closed.",
        "This time it's just chasing, fistfighting, and shooting. A disappointment from the director of \"Bloody Sunday.\"",
        "Almost everything that made \"The Bourne Identity\" refreshing -- the wit, the irony, the suspense, the novelty of its premise -- is gone in The Bourne Supremacy, and what's left is the spectacle of Matt Damon, with perfect posture and senses primed like a cat, making his way through a routine action thriller.",
        "The movie is mostly a series of frenetic clashes, dubious near misses and car chases. It lacks the human interest and snowy splendor of the first movie, directed by Doug Liman.",
        "What’s missing here is the amnesiac hook that made \"The Bourne Identity\" such a sleeper hit.",
        "I had some trouble with the plot, but I'm not the only one -- so did the screenwriter."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "There is one thing I appreciate about The Bourne movies more then anything else about them. And that is that they exist not only to make money, but to be a good movie. There are a lot of action franchises, such as Pirates of the Caribbean andThere is one thing I appreciate about The Bourne movies more then anything else about them. And that is that they exist not only to make money, but to be a good movie. There are a lot of action franchises, such as Pirates of the Caribbean and Sherlock Holmes, that only exist to make money. They can be entertaining, but there's not a lot of thought put into them. The Bourne series tries to be a good movie, and they, for the most part, succeed. Of course, the two films I've seen thus far in the trilogy have not been without flaws. Far from it really. But they are entertaining, at the bare minimum, they have a plot, and well-defined characters. The Bourne Supermacy, like it's predecessor is not perfect, but it's trying. The Bourne Supremacy still contains the key plot elements from the first film: Jason Bourne is trying to learn more about his past, there's a plot to find and kill him, and utter confusion for both parties. The twist is that Bourne is being assumed for a crime he didn't commit (the murder of two agents). Once again, the similarities to the 90's The Fugitive are present, but I've delved into that in my previous review of the first film. In short, The Fugitive does a much better job. The Bourne Supremacy sports believable acting, much like the first. Action movies are famous for laughable dialogue and stiff acting, but The Bourne Supermacy has neither. Matt Damon performs very well for this episode in the Bourne trilogy. The rest of the actors also perform well, but it's pointless to compliment each actor individually. The action is considerably better in this sequel than in the original. Also, there are some very good chase scenes (there were chase scenes in the first, but they were quite dull to be honest), even though some of the automobiles seem a little too indestructible. There's even some well-needed emotion that wasn't present the last time around. The score, however, is less than satisfactory. The percussion is much too loud and overpowering, often annoying. Some of the instrument choices are questionable (including one instrument that we hear twice that resembles the belch of an obese couch potato), and many of the themes feel a little lost. Also, there are some jarring similarities to the superior Pirates of the Caribbean score. Also, the girl we see sleeping with Bourne at the beginning of the film is Marie from the first film. I tell you this, because I would not have recognized her if my companion had not told me so. Her hair is blonde, she looks different (she's wearing more makeup) and she even SOUNDS different. It doesn't make too much of a difference, though, because she dies within twenty minutes of the film's opening. And this brings up a major flaw of this movie: Bourne doesn't have a partner. In one respect, this works better because now Bourne is free to move at his own pace. However, this gives Bourne a little less personality, and it makes certain parts of the film feel a little empty. One scene at the beginning is near a stand with tons and tons of Lays brand potato chips, all the labels facing the screen. It would be hard to believe that there wasn't some sort of pay-off here. Also, there's a completely unnecessary scene that occurs in a club. There are some skimpily dressed women and it just feels so thrown in. This scene was literally added just for male appeal, and it disgusts me that this was thrown in just because guys like to see half-naked women. Really? It's unnecessary and tasteless. I digress. Lastly, The Bourne Supremacy doesn't feel completely connected to the first film. That's not to say it contradicts the first, but I feel confident that someone could watch The Bourne Supermacy with no knowledge of the first film and completely understand what was going on. The Bourne Supremacy is just as good as the original, and maybe just a bit better. There's problems to be sure; irritating score, unnecessary club scene, and the fact that the seeing the first film isn't even necessary for viewing this sequel. But the fantastic cast, great action and chase scenes, and some actual emotion more than make up for it's shortcomings.",
            "review_date": "2012-04-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Supremacy improves upon its original with great acting, and a good plot. It also follows Paul Greengrass' typical directing style; action, tension and unfortunately, too much shaky cam.",
            "review_date": "2013-12-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Parts of the film are good but it never really draws you in the way the first film did. More running and chasing in this film and a lot less hand to hand combat (which made the first film so good imo) in the action sequences. The plot is okParts of the film are good but it never really draws you in the way the first film did. More running and chasing in this film and a lot less hand to hand combat (which made the first film so good imo) in the action sequences. The plot is ok but it doesnt explain much, if anything really. Overall it was an ok film that never reachs the next level that its so close to reaching.",
            "review_date": "2012-01-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A rare sequel that actually improves upon the original. The Bourne Supremacy duplicates everything that was right about The Bourne Identity, and improves upon it by making the story easier to follow.",
            "review_date": "2013-01-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The second of a great trilogy, Supremacy is just as thrilling and fresh as the first movie and revisits the same kind of storyline, now in different countries.",
            "review_date": "2013-09-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Supremacy reigns supreme.\rWith the sequel to the amazing spy thriller, The Bourne Supremacy just doesn't quite match the original. An equally great plot with equally great action, but doesn't quite reach the standards of suspense;The Bourne Supremacy reigns supreme.\rWith the sequel to the amazing spy thriller, The Bourne Supremacy just doesn't quite match the original. An equally great plot with equally great action, but doesn't quite reach the standards of suspense; although still very successful.",
            "review_date": "2013-11-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I liked it better than the first one. Since the beginning it develops an adrenaline line of action. Non expected at the beginning, but it only gives it more energy for what´s coming.",
            "review_date": "2014-03-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The second of a great trilogy, Supremacy is just as thrilling and fresh as the first movie and revisits the same kind of storyline, now in different countries.",
            "review_date": "2016-04-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Supremacy is a rip-roaring juggernaut of a movie. It totally outclasses it's predecessor in every conceivable way, ratcheting up both the action sequences and the film's emotional core to thrilling levels. With superb acting, anThe Bourne Supremacy is a rip-roaring juggernaut of a movie. It totally outclasses it's predecessor in every conceivable way, ratcheting up both the action sequences and the film's emotional core to thrilling levels. With superb acting, an excellent script and thunderous set-pieces, The Bourne Supremacy should be held as a textbook example of how to do a sequel right.",
            "review_date": "2012-07-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Seemed like a great movie. I'm not really sure, because I had to look away through much of it or squint one eye shut to try and stem the nausea that the shaking, frentetic camera views inspired. Who thought this was a good way to film a Seemed like a great movie. I'm not really sure, because I had to look away through much of it or squint one eye shut to try and stem the nausea that the shaking, frentetic camera views inspired. Who thought this was a good way to film a movie? This artsy-fartsy director should be banned from any future filmmaking. Even the quiet moments in the movie when two people were just talking, the camera was moving and zooming in and out like the cameraman was smoking crack. I was looking forward to this third installment of the Bourne series, but by the end of the film I was looking forward to some Pepto Bismol. Complete waste of time and money, in my opinion.",
            "review_date": "2007-08-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Supremacy continues the franchise and has great acting and a nice story.",
            "review_date": "2018-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Man, the movie's still has the same intensity, same action sequences, same stupidity, and the same plot. I wonder if the movie might become something like the James Bond Franchise...",
            "review_date": "2011-09-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I wouldn't take any extremist sides, but overall the story was fairly straightforward (which is a blessing for this kind of genre), and yes, while the camera could indeed induce nausea, it was a very obvious character of the film I wouldn't take any extremist sides, but overall the story was fairly straightforward (which is a blessing for this kind of genre), and yes, while the camera could indeed induce nausea, it was a very obvious character of the film itself. Natural/ambient light should be the prerequisite for every film made. Unrealistic car chases coupled with insane walk-aways are unforgivable, but tight, choreographed fisticuffs were passable as the real deal. A bit of a quick-ending wrap up made it somewhat hurried, but characters remained true, and almost a bit stereotyped (unbeatable Bourne, bumbling crony, maiden-in-distress, et al.). A solid mediocre rating.",
            "review_date": "2007-09-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is absolutely horrible. The first one was great. This one was an insult. Frankly, I'm downright outraged that this one got a better metcritic score, because it is utter garbage. There is very little actual action. 3/4 of the This movie is absolutely horrible. The first one was great. This one was an insult. Frankly, I'm downright outraged that this one got a better metcritic score, because it is utter garbage. There is very little actual action. 3/4 of the movie is just footage of Matt Damon walking really fast and looking beihind him. Seriously. And when ther actually IS something that SHOULD be interesting, you can't see it because whenever there's a fight, the first thing they do is kick the epileptic camera man in the balls. If you like faked, boring \"suspense,\" see this movie. If you like action movies, or liked the first one, for the love of God stay away from this crap.",
            "review_date": "2006-05-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not as good as Identity, but still thrilling and a worthy follow on. I was hoping for more action, given that it's shorter, but the plot is good enough to keep it interesting.",
            "review_date": "2012-08-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie had an average plot to it, OK twist, nothing mind-blowing, and acting was OK as well. The problem I have with this movie is the camera. The camera angles changes almost every 3 or less seconds, and the action scenes I just had toThe movie had an average plot to it, OK twist, nothing mind-blowing, and acting was OK as well. The problem I have with this movie is the camera. The camera angles changes almost every 3 or less seconds, and the action scenes I just had to look away from, they didn't have any steady shots, and a major problem with holding the camera still. To be honest i almost made me sick of watching.",
            "review_date": "2012-08-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not quite as fresh and intriguing as its predecessor or its sequel, but still a brilliant film which you can watch over and over without getting bored.",
            "review_date": "2013-10-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Jason Bourne (Matt Damon) is living in India when he is framed by Russian agent Kirill (Karl Urban) for the theft of millions from the CIA. Kirill begins to pursue Bourne, intending to assassinate him -- but while Bourne and his girlfriend,Jason Bourne (Matt Damon) is living in India when he is framed by Russian agent Kirill (Karl Urban) for the theft of millions from the CIA. Kirill begins to pursue Bourne, intending to assassinate him -- but while Bourne and his girlfriend, Marie (Franka Potente), are on the run, a shot meant for him kills her instead. Vowing revenge, Bourne sets out to prove his innocence and bring the culprits to justice, but he has to evade CIA head Pamela Landry (Joan Allen), who is convinced he is guilty. A well-made sequel that delivers the thrills. I'll give The Bourne Supremacy an A-.",
            "review_date": "2018-08-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is the perfect sequel to The Bourne Identity and is mandatory for fast-action fans.",
            "review_date": "2006-03-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not as good as Identity, but still pummels Bond into a puddle.",
            "review_date": "2005-08-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pretty darn great! action-packed, good cast, interesting story line, all-around great action film. :-) grade: 9.3",
            "review_date": "2006-01-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Camera action made me sick. It was like the cameraman was trying to rollerblade on gravel and kept falling and turning and jerking. I understand why they did it that way, but it didn't work for me. I'd give it a 9 if not for the Camera action made me sick. It was like the cameraman was trying to rollerblade on gravel and kept falling and turning and jerking. I understand why they did it that way, but it didn't work for me. I'd give it a 9 if not for the \"creative\" camera motion.",
            "review_date": "2007-08-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie probably could have been much, much better. The camera simply sucked, saying that it made the experience more \"real\" and that it's \"creative\" is a load of crock. All that it does is give me a headache, a stomache ache, and no This movie probably could have been much, much better. The camera simply sucked, saying that it made the experience more \"real\" and that it's \"creative\" is a load of crock. All that it does is give me a headache, a stomache ache, and no idea what the hell is going on. Another poor feature of the movie was it's lack of humor. Identity had a perfect balance of humor and action, which fit well with a character slowly uncovering his past and incredible abilities. In this movie, suddenly bourne is a master at what he does. He no longer discovers himself, he no longer makes jokes. He's become a flat character by comparison.",
            "review_date": "2007-08-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I frankly don't get how people review movies on this site. I've seen the most preposterous of comments on movies that are straight out excellent. The Bourne Supermacy follows what Bourne said in the first movie. He threatens I frankly don't get how people review movies on this site. I've seen the most preposterous of comments on movies that are straight out excellent. The Bourne Supermacy follows what Bourne said in the first movie. He threatens Treadstone by saying they won't know what's coming until the counter-strike is finished. That promises a fast-paced movie ON THE START. Plot-lines that were VERY obvious seem to be so oblivious to others that they decide to pluck their thought-motor out and call it a day. If some complain about the camera movement, well to them I would answer: \"How would you imagine yourself in a fight?\" ... Exactly. When you're in a fight like Jason gets into, you don't see everything around you. It's a fast-paced blur without conscience. Everything becomes instinct. And this is what this movie is about: Instinct. Instinct of survival. If the movie is too fast for you, try watching it in slow-motion.",
            "review_date": "2006-12-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the most boring movie of the three where I could have expected something more than that. The action thrill scenes are lesser than the last movie.",
            "review_date": "2012-08-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Bourne & girlfriend now living in India, assassin comes after him, tragedy, goes after the CIA to find out what's going on.Not as good sequel to the excellent Bourne Identity which does have it's moments but seems to lack something that theBourne & girlfriend now living in India, assassin comes after him, tragedy, goes after the CIA to find out what's going on.Not as good sequel to the excellent Bourne Identity which does have it's moments but seems to lack something that the first one had.Decent cast once again adding Joan Allen & Karl Urban to its roster & Brian Cox is the stand-out this time appearing a lot more.Thought it got a bit stupid towards the end too with the silly car chase.",
            "review_date": "2010-09-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Altogether more suspenseful, more concise, more intriguing, and more emotional than its predecessor, Bourne Supremacy is a step up from the usual generic thriller and benefits from a stellar performance by Matt Damon.",
            "review_date": "2011-09-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not quite as intriguing as its predecessor or it's sequel, but still amazing. It does feel a bit more drawn out. Overall, however, it's well worth watching over and over.",
            "review_date": "2011-09-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Another excellent Bourne film, equal to the first in every way. Highly thrilling and engaging.",
            "review_date": "2019-04-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Supremacy is a well-made follow up to Identity in terms of action and suspense; however, its plot lacks in development, and, similar to most sequels, does not fully meet the standards the first film created.",
            "review_date": "2012-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First off, I would give this a 9.25 out of 10. Action sequence are even better. It's just awesome. Acting is good. Damon delivers again. Story continues, and it's still good. Score is still good. Overall, this is great sequel following theFirst off, I would give this a 9.25 out of 10. Action sequence are even better. It's just awesome. Acting is good. Damon delivers again. Story continues, and it's still good. Score is still good. Overall, this is great sequel following the first one that's better in every way.",
            "review_date": "2012-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Better than the original, The Bourne Supremacy is the rare sequel that takes what the original did well and improves upon it. Matt Damon is still dynamic as the titular Jason Bourne. The action can be a little hectic, which is what holds thisBetter than the original, The Bourne Supremacy is the rare sequel that takes what the original did well and improves upon it. Matt Damon is still dynamic as the titular Jason Bourne. The action can be a little hectic, which is what holds this one back a bit, as it can be hard to follow during the action sequences. It can also get a little bogged down in the details like all spy flicks, but all the same, this is a very good action spy thriller. Director Paul Greengrass certainly knows what he is doing and knows how to tell a good story. The film is thrilling, the score is good, and the cinematography has moments of absolute brilliance (the shot of Bourne walking to his car in snow covered Russia comes to mind). Overall, The Bourne Supremacy is a good film that manages to entertain in spades even if it does nothing different from other spy films.",
            "review_date": "2015-11-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Jason Bourne is a great character and it's great to see him develop over the two movies. As for the action, the shaky-cam many complain about really is as distracting as they say. Overall a very good sequel though.",
            "review_date": "2012-08-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "[2/4 The Bourne Legacy Marathon]\r The Bourne Supremacy [2004]\r\n\r\nThey're not subtle with the shaky cams here. Scene with Bourne targetting Joan Allen with a sniper on the building was a highlight. I have to confess though, these films are[2/4 The Bourne Legacy Marathon]\r The Bourne Supremacy [2004]\r They're not subtle with the shaky cams here. Scene with Bourne targetting Joan Allen with a sniper on the building was a highlight. I have to confess though, these films are well-made, but the Bourne films are just not working for me. It dosen't engage me, despite the quality of it.",
            "review_date": "2012-08-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In 2004 film \"The Bourne Supremacy\" is the Paul Greengrass-directed sequel to the acclaimed Doug Liman film \"The Bourne Identity\". The story follows the amnesiac titular character (Damon) as he attempts to find out more about his past as aIn 2004 film \"The Bourne Supremacy\" is the Paul Greengrass-directed sequel to the acclaimed Doug Liman film \"The Bourne Identity\". The story follows the amnesiac titular character (Damon) as he attempts to find out more about his past as a black ops agent for the CIA. One of the things I noticed first about this film was the film's shift in aesthetics. Though Director Paul Greengrass' use of hand-held cameras has often come under considerable disagreement from some critics and fans, I feel that this aspect of the film really sort of adds to the intensity of a lot of the action and dialogue sequences. While the camerawork may have changed, there are certain things about the film that stayed close to what made the first movie so successful. For one, Matt Damon's performance is once again terrific, and with his portrayal, the audience really gets to see some sides of Jason Bourne that they might not gotten to see in \"Identity\". John Powell's score is really well done, as it uses all of the themes from \"Identity\", but develops upon those themes so that we feel as though we are watching a different chapter in Bourne's life. Tony Gilroy's screenplay contains really compelling and entertaining dialogue and a very interesting adaption of Robert Ludlum's story. The action sequences are spectacular as well, for they once again showcase Jason Bourne's incredible ability to overcome immense odds with the skills he learned in the CIA. All in all, I felt that \"The Bourne Supremacy\" was a worthy installment in the \"Bourne\" franchise that upped the emotion and action to an impressive degree.",
            "review_date": "2012-11-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Certainly not as good as the other two in the trilogy, but this is still a really good action thriller in its own right. Great locations and awesome action sequences.",
            "review_date": "2013-06-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Supremacy was much better than Identity on many levels. First of all, the plot was significantly deeper, secondly, the characters also had more depth than the first.  There was much more emotion shown in Supremacy's characters and were wellSupremacy was much better than Identity on many levels. First of all, the plot was significantly deeper, secondly, the characters also had more depth than the first.  There was much more emotion shown in Supremacy's characters and were well acted. The movie ended with all questions answered, which was appreciated, not saying the first one did.",
            "review_date": "2013-08-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In my opinion, The Bourne Supremacy is probably the weakest movie of the series. The acting is still good, the story is still interesting and the fight scenes are still well made. It's not a bad movie, it's even really far from that, it'sIn my opinion, The Bourne Supremacy is probably the weakest movie of the series. The acting is still good, the story is still interesting and the fight scenes are still well made. It's not a bad movie, it's even really far from that, it's just not on-par with the others.",
            "review_date": "2016-07-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Continuation of the history of the our glamorous rambo....Everything is very predictable and boringSo dumb and predictable main villainMost situations the hero resolves with the help of magic and his teleport.... Fairy tail",
            "review_date": "2018-04-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Better than the first movie, but just as forgettable.A similar tempo with similar set pieces.Still feels like Bond's little brother",
            "review_date": "2020-04-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nJason Bourne and Marie lead a serene life in a coastal town in India. The bliss ends suddenly after someone tries to frame Bourne for CIA deal gone wrong. \"Bourne Supremacy\" sets dynamic pace from the beginning. The storyline isn't as original and surprising as in \"Bourne Identity\", but it's a solid spy movie. No exaggeration. When I watch it I feel like I'm watching real, credible spy agency operation.\r The cinematography and fast cuts are a slight disappointment. In some fights and chases the scenes are too short, too jumpy. And I get it, I accept SOME shaky camera work in action sequence. But a calm conversation? Two people talking and I'm almost getting motion sickness, because the cinematographer can't keep a persons face in the frame. Other than that, the film is superb. Easily among my \"top 10 ever\". The casting team did a marvelous job. Matt Damon IS Jason Bourne. I'll always see Ward Abbott when I see Brian Cox. Joan Allen is not my favorite actress, but does very believable performance as Pamela Landy. Karl Urban became one of best cinema villains. His coldness fits the mood of the whole movie. A few years earlier I thought Karl Urban would always be Eomer from \"The Lord of the Rings\". Nope. Karl Urban is Kirill, the cold-blooded FSB hitman. And Marton Csokas, the Munich asset also performs brilliantly.\r I've seen the movie a few times. Maybe five. Every time I rewatch it I'm amazed how good a film can be without over the top CGI effects. Believable weapons, realistic explosions, brilliant hand-to-hand combat (Munich fight is one of best cinema fights EVER) and the Moscow car chase, damn, those cars crashing in the Volga taxi, the cars in the tunnel and the final crash inside the tunnel - WOW. My favorite movie car chase. Ever. There are some slight deficiencies about manual gear handling or survivability of head-on crash in a Volga (rrright), but other than that the chase is excellent.\r The soundtrack is very pleasant. Quite similar to the first movie. The general setting and filming locations provide immersively gloomy atmosphere. Cinematography is quite good if you forget about the shaking. Gripping action sequences and general fast-pace make it a very entertaining film. Highly recommended!",
            "review_date": "2015-08-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Supremacy improves upon its original with great acting, and a good plot. It also follows Paul Greengrass' typical directing style; action, tension and unfortunately, too much shaky cam.",
            "review_date": "2014-11-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie, good plot, good action, interesting throughout, one of memorable movies from last decades in action genre.",
            "review_date": "2019-12-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The rare sequel that improves on the original, The Bourne Supremacy might also be the best movie in the franchise. It has a great emotional arc, and adds more gravitas to the character of Jason Bourne. The action scenes are amazingly done,The rare sequel that improves on the original, The Bourne Supremacy might also be the best movie in the franchise. It has a great emotional arc, and adds more gravitas to the character of Jason Bourne. The action scenes are amazingly done, with a fast-paced plot that's packed with tension. In short, The Bourne Supremacy is a non-stop thrill ride that delivers glorious action and compelling emotional drama.",
            "review_date": "2016-07-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you wish an action movie sequel can live up to expectations, then this is the movie for you. Like it's predecessor, The Bourne Supremacy is able to deliver a fun, exciting, and entertaining movie.",
            "review_date": "2015-11-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Supremacy is an improvement of the first installment in the Bourne franchise. This 7 feels more like a raised score, but its rounding system makes it look like a 7.",
            "review_date": "2016-04-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Supremacy is an amazing action movie with great casting, performances, writing, and brilliant sequences. The plot is intriguing throughout and the ending car chase is one of my favourite action sequences ever created. A must watch.",
            "review_date": "2016-08-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Jason Bourne is still on the move, now to find who killed his girlfriend and who framed him by murder. This episode has the right amount of thrills with spectacular chase sequences in Goa (India), Naples, Berlin and Moscow. For whom shallJason Bourne is still on the move, now to find who killed his girlfriend and who framed him by murder. This episode has the right amount of thrills with spectacular chase sequences in Goa (India), Naples, Berlin and Moscow. For whom shall stay in home due COVID-19.",
            "review_date": "2020-03-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Good continuation of story about Jason Bourne. The plot in difference from the first movie became really more interesting, development of characters is observed here. Though a part of the movie which occurs in Russia raises only a smile. IGood continuation of story about Jason Bourne. The plot in difference from the first movie became really more interesting, development of characters is observed here. Though a part of the movie which occurs in Russia raises only a smile. I didn't see such \"cranberry\" long ago.",
            "review_date": "2018-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A great sequal. This adds a lot to the original, and a lot of better things! The actors are great, and proves it in the first 5 minutes. It continues the story in a great way.",
            "review_date": "2017-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Supremacy is a much stronger take and visceral vision in the hands of Paul Greengrass who, even though makes the sequel quite shaky and passive, offers up moments of real character emotion and high-caliber craft that makes us truly believe.",
            "review_date": "2019-07-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is the expected sequel to \"Bourne Identity\". Despite having another director (the first was directed by Doug Liman and this was directed by Paul Greengrass), the script was secured by the same author, Tony Gilroy, which contributedThis movie is the expected sequel to \"Bourne Identity\". Despite having another director (the first was directed by Doug Liman and this was directed by Paul Greengrass), the script was secured by the same author, Tony Gilroy, which contributed decisively, I don't doubt, to the feeling of unity I got when watching both. In fact, the points of contact between the two stories are evident in the way they marry and harmonize, forming a homogeneous whole.In this film, Bourne is in Goa (an Indian city with a strong connection to Portugal), where he ends up being chased and sees his girlfriend die. From there, he understands that something is up, and that he has returned to being a target to shoot down for the CIA, for whatever reason he doesn't know. Of course, he's been the target of a very well-crafted plot at the highest levels of the organization, and he's going to have to flee and defend himself as they try to kill him. Most of the film consists of pure action, with mind-blowing chases, shooting and tension: in an effort not to displease those who liked its predecessor, the film offers more of the same. Despite that, I felt that there was an effort on the part of the script to put more emphasis on the story told, and to give us a good story, not just an excuse for endless action scenes. For me, that's enough to make this movie even more interesting than the first one.Matt Damon continues the good work he started on the franchise's initial film, even managing to develop his character further and work on it better. If I found what I saw in the first film uninteresting, I am pleased to see a general improvement in the actor's work, and also in the material he was given to work with. Joan Allen was excellent at bringing to life Pamela Landy, the director of the CIA who, despite leading the effort to hunt down Bourne, will also try to understand her motives and understand the reasons that drive him to act. She is charismatic and effortlessly grabs our attention. Julia Stiles, back in the role of Nicky, a hypothetical love interest from Bourne's past, is equally happy in her work. Brian Cox and Carl Urban are also very good. In this film, it is Franka Potente who loses out, with her character disappearing from the scene.Technically, it's a film equivalent to its predecessor, with high production values and a lot of money involved. The pace is intense and things are happening very fast, so you need to be attentive, or you will miss important details. The film is once again located almost entirely in Europe, cleverly taking advantage of European filming locations in Moscow, Berlin and Naples, with a brief visit to the so Portuguese Goa, in India. The cinematography is discreet but elegant, except for the shaky footage of a series of very concrete scenes. The editing also has moments when it doesn't seem to be at its best, with several scenes out of order and successive cuts. The film continues to have many intense action scenes, with frequent use of good special effects, visuals and sound, and stunts for the most dangerous scenes.",
            "review_date": "2021-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best bourne movie ever,literally unsurpassable, my personal reference if you search a really good spy/action movie",
            "review_date": "2019-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nGreat sequel!it was intense and thrilling.the music was phenomenal and amazing,the acting was great the new Member for investigation was amazing and the Russian villain was bad-ass,and Matt he was iconic.the story was great continuation of last one and screenplay was good although the smoothness and calmness like 1st one was missing but it was little dark and thrilling,the action scenes were awesome although the shaky cam was fast specially at the last car chase it was little overdone but it felt intense.the starting was good with the Goa stay and the flashbacks then the chase scene it was awesome but the death of Marie was sad and heartbreaking,the killing in Berlin and the setup was amazing,the whole investigation and slow build-up for the twist and surprises was awesome,the previous agent's fight at house was great and the blowup.the sniper stalking scene was great with the sudden surprise face zoom it was awesome at ending too while a call,the crowded meet was brilliant technique for undercover and the twist reveal was mind-blowing although little hints were pointing at it.the whole flashbacks returning with the hotel raid and then the bourne meet with the real killer of old mystery it was amazing with the tape thing and later the suicide was like checkmate.the chase at last was intense with the shootout and the mall scene,the arrest of the group leader was satisfying,the conversation with the daughter of killed parents by bourne was sad and dark,the ending reveal of his true name was amazing end.the whole movie was intense and thrilling ride with mind-blowing turns its an amazing sequel!",
            "review_date": "2020-06-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This used to be my least favorite of the first three, but seeing it again for the third time, I realize how much better than the first one it is. It's better paced and less dated. I never hated Marie, but her absence does speed things up.ItThis used to be my least favorite of the first three, but seeing it again for the third time, I realize how much better than the first one it is. It's better paced and less dated. I never hated Marie, but her absence does speed things up.It might have been a bad idea to watch this with a headache though.While the film's use of shaky cam and quick cutting is infinitely better than most other action movies of the time (especially during the amazing climactic car chase) it's definitely not as well done as in the third one (the fight with the magazine is pretty bad).Karl Urban is the series' best villain.",
            "review_date": "2020-10-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is how you make an action thriller. This is tough to be beaten. An absolute Masterpiece ❤️",
            "review_date": "2022-10-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "They should have left him alone. Now they messed up and killed Jason Bournes girlfriend. As he goes on a deadly rampage of revenge, he's remembering more memories.",
            "review_date": "2022-12-11",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 96
}