{
    "rating": 9.7,
    "release_date": "1988-02-23",
    "num_reviews": 230,
    "genres": [
        "Drama"
    ],
    "summary": "Young Salvatore Di Vita (Salvatore Cascio) discovers the perfect escape from life in his war-torn Sicilian village: the Cinema Paradiso movie house, where projectionist Alfredo (Philippe Noiret) instills in the boy a deep love of films. When Salvatore grows up, falls in love with a beautiful local girl (Agnese Nano) and takes over as the Paradiso's projectionist, Alfredo must convince Salvatore to leave his small town and pursue his passion for filmmaking.",
    "reviews": [
        {
            "content": "One of my all time favorite movies. Get out the tissues. It is poignant. A view of life in Italy after the war.",
            "review_date": "2023-03-25",
            "source": "rt"
        },
        {
            "content": "I am fascinated by this film. On the one hand, I think that the first two hours of the film are a lovely look into a slice of life of what living in Sicily looked like in the 40s-50s, the third act is a disappointing mess that leaves the viewer wishing that they had just stopped the movie at the two-hour mark.",
            "review_date": "2023-03-08",
            "source": "rt"
        },
        {
            "content": "This film is incredible. It is hard to put into words just how emotional and effecting this work of art is. At once a gorgeous ode to film itself, it is also an ode to love and the friends we make along the long road of life. Although some decisions may seem dubious, they were made with love and hope in mind.",
            "review_date": "2023-02-21",
            "source": "rt"
        },
        {
            "content": "If you're into history and you just happen to decide on whether you want to watch \"Cinema Paradiso\" or \"The Lover\" 1992 film, watch \"Cinema Paradiso\" first, particularly for cinema nostalgia enthusiasts for the \"Golden Age of Hollywood\" from a place that is far away from that as Italy. A lot of \"The Lover\" is a sadist's wet dream, the protagonist's family is abusive and very dislikable and the protagonist is more of a cardboard cut-out rather than a character you can sympathize with. Everyone in \"Cinema Paradiso\" is much more likable in comparison and the plot points are actually emotionally well-conveyed. I personally prefer the director's cut of \"Cinema Paradiso\".\n\nThere were points in both movies that made me cry (particularly the director's cut version of \"Cinema Paradiso\"), which is rare for me.\n\nEdit: I have to admit that if you're not a mega-movie fan, the film is quite a bit of a chore to watch. Toto stops being as sympathetic as a teen while everyone else around him is forced to prop him up as a result, especially Alfredo, his mother, and Elena (the latter two in the director's cut). The first time watching this was fine, this and the director's cut, but something tells me that I would be bored to death if I had to watch this in whole again, even the director's cut.",
            "review_date": "2023-01-06",
            "source": "rt"
        },
        {
            "content": "Better film than The Fabelmans, that's for sure.",
            "review_date": "2022-12-29",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso restores faith in the format, with its care-free, calming nature. A film about the art, but more importantly, the relationships we build from it. A remarkable ode to cinema",
            "review_date": "2022-12-19",
            "source": "rt"
        },
        {
            "content": "A true classic film that is a treatise about the love of cinema fostered between a young child and his unwitting mentor. All performances are spot on, however, Tornatore breaks your heart with the endearing relationship between Alfredo and young Salvatore. A masterwork that should be followed by another incredible, unforgettable Tornatore film, Legend of 1900. Both scores were beautifully composed by Ennio Morricone. \n\nSuggestion: Avoid the unnecessary Director's Cut, adds nothing and takes away the underlying longing and elusive aura of the original story.",
            "review_date": "2022-11-04",
            "source": "rt"
        },
        {
            "content": "This Film has everything you need. Great Drama, Great Love story, Great Performances and mainly Great Music Score. I sobbed like a baby watching this one. Definitely Top 5 Dramas for me.",
            "review_date": "2022-09-23",
            "source": "rt"
        },
        {
            "content": "It's an touching and excellent film, Cinema Paradiso, 1988 coming-of-age drama...Nuovo Cinema Paradiso (Italian) \n\nUnder director-writer-co producer, Giuseppe Tornatore...",
            "review_date": "2022-09-22",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso us a wonderful heart warming film. Youll laugh youll cry youll reflect. The ending is magical.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "The peak of Italian Cinema.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "One of my favorites movies of all times!",
            "review_date": "2022-08-16",
            "source": "rt"
        },
        {
            "content": "What a magnificent love letter to cinema!  This film will take you on a rollercoaster of emotions, it's warm, charming, funny and sad. The director's cut features storylines that take you on a bit of wild goose chase and add nothing to the film, so thank goodness for the 124 minute international release. It's an absolute must see and one of my all-time favourites.",
            "review_date": "2022-08-08",
            "source": "rt"
        },
        {
            "content": "A joyous celebration on the power of nostalgia. Showing the lost connection of what the movies used to be before television sets, where people would unite to cry and laugh through the magic of movies. A charming relationship between Toto and Alberto is saturated in humour and love, but a sad outlook on the trap of nostalgia from Alberto. He sees Totos potential and what he can achieve, if he stays stuck being a film projectionist and his small town he would never go on to share his passion with the world. It's a sad sacrifice for Alberto to never see his best friend again, but he gives up what he wants so Toto an go on and achieve greatness. Through Totos drive to be great and do Alberto proud he never settles down, through pain of his lost love stopping him from finding fulfilment. In a incredible ending, Now Salvatore watches Albertos last gift to him. Perfectly packaging what nostalgia is, a memory of innocence and love. Passionate kisses shining through the cinema screens taking back Salvatore to a place of wonder. subtlely It shows the other side of nostalgia, a pain at what's loss, simpilar  times that won't ever be recaptured again. A stunning showcase of nostalgia, lost love and the power that cinema can have on people, An incredible piece of art.",
            "review_date": "2022-04-30",
            "source": "rt"
        },
        {
            "content": "As a big lover of film, I am still kicking myself for not seeing this masterpiece any sooner. To me, Cinema Paadiso is one of the best films of the 80s and also the most moving, particularly in the final hour.\n\nI have seen many visually stunning films, and Cinema Paradiso is up there as one of the most visually ravishing films I've seen. The cinematography and editing are outstanding, and the scenery still looks gorgeous with an epic feel to it. Cinema Paradiso, alongside The Good, The Bad and the Ugly and Once Upon a Time in the West, also contains one of Ennio Morricone's most haunting scores and it is also one of my favourites of his.\n\nCinema Paradiso is immaculately directed, has an touching, beautifully-written and honest script and a rich, compelling story that while it has an elegiac feel moves swiftly by draws you right in until the ending, which breaks my heart still after 5 times of seeing it.\n\nThe characters are very well defined, particularly Alfredo, and the acting is outstanding with Salvatore Cascio, Enzo Cannavale, Marco Leonardi and especially Phillippe Noiret particularly impressive. All in all, a masterpiece. 10/10 Bethany Cox",
            "review_date": "2022-03-30",
            "source": "rt"
        },
        {
            "content": "\"The Crying Game\" by Giuseppe Tornatore. 4/10",
            "review_date": "2022-03-24",
            "source": "rt"
        },
        {
            "content": "My favorite movie. Avoid the extended cut. It adds nothing of value to the movie.",
            "review_date": "2022-03-20",
            "source": "rt"
        },
        {
            "content": "Con esta película, simplemente me enamore del cine; si quieres sentir mil sensaciones, ver suspenso, drama, comedia y más... Esta película es la indicada.",
            "review_date": "2022-01-19",
            "source": "rt"
        },
        {
            "content": "While it does get randomly sidetracked in a few parts with Toto's story arch, what makes this movie stand out is that one should not be ashamed or discouraged to follow their dreams and, more specifically, have a love for movies (like so many of us do)! Ennio Morricone's score and the scenes filled with emotion make Cinema Paradiso an grand reflection of the passion that people hold for movies and the art behind them!",
            "review_date": "2021-11-25",
            "source": "rt"
        },
        {
            "content": "Sure, you can talk about cinematic love letters to film itself being low-hanging fruit, but when that clip of The Firemen of Viggiù begins to glide across the wall before projecting out to the town square, it's magic. \n\nThe depiction of film and the way people interact with it is so enticing in Cinema Paradiso; the spectacle, the fun, the way we bond not only with the characters on the screen but those around us that we share the experience with. It's so kind and pure in fact, that it really makes the later subplots - Salvatore's adolescence, military service, and even his first love (which is no small part of the runtime) - feel generic and a bit shallow. But Tornatore's sincere discussions on the transient nature of life told with the evolution of film and a touching, genuinely endearing father-son dynamic between Salvatore and Noiret's Alfredo transcends all. \n\nGet yourself a father figure who loves you enough to put you on a train and tell you to never come back. (4/5)",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "Nostalgia and all that is fine. It's just not my type.",
            "review_date": "2021-10-07",
            "source": "rt"
        },
        {
            "content": "I watched Giuseppe Tornatore's 2h35 Director's Cut, and loved it just as I loved the original theatrical release.  If ever a movie transmitted the power of movies over us, this is it.  And it is epic, even grandiose in its ambition.  It has three love stories (young love, surrogate father, love of cinema), plus social history (the evolution of life in post-war Italy's recovery).  All this against a backdrop of deep respect and affection for the people of this little town.  In this aspect the film is another pillar in one of Italy's great cinematic traditions, respect for everyman.   The Director's Cut is not necessarily better than the original, but it does take us deeper into the romanticism and nostalgia that permeates the original.  One of the amazing things for me about this film is that Tornatore figured out how to make excess work.  For example, I love Ennio Morricone's score, but began to be annoyed after hearing the common refrains too often.  Then, magically, I grew to embrace them again, and it felt as if I were luxuriating in a perfect bath after an exhausting and tense day.",
            "review_date": "2021-10-03",
            "source": "rt"
        },
        {
            "content": "With one of the greatest scores in film history, this movie brings us touching themes and characters and a story we can all enjoy.",
            "review_date": "2021-09-19",
            "source": "rt"
        },
        {
            "content": "A great movie about the coming of age for a boy and his mentor at the cinema!!!!!",
            "review_date": "2021-09-08",
            "source": "rt"
        },
        {
            "content": "without doubt, it is a classic, people's simplicity, innocence and love for the film",
            "review_date": "2021-08-07",
            "source": "rt"
        },
        {
            "content": "The high point of the movie is the story; wonderful written. The directions is also pretty good, having good film editing. The ambientation is incredible, specialyl the music, and the performances are good too (even when some should have been better).\nNuovo Cinema Paradiso is a really good movie, not even close of being a masterpiece, but having the right to be a classic film.",
            "review_date": "2021-06-09",
            "source": "rt"
        },
        {
            "content": "🇮🇹  Giuseppe Tornatore's 1990 Academy Award winner for Best Foreign Film. This classic follows a filmmaker recalling his childhood and his adolescence when he fell in love with the pictures at the cinema of his native Sicilian village and formed a deep friendship with the cinema's projectionist. This movie is a lovely celebration of films intertwined with nostalgia and sentimentality, which manages to be very funny as well. All those feelings conveyed are successfully intensified with the incredible Maestro Ennio Morricone's powerful score and in a certain way, it takes us back to our own discovery of the magic of cinema.",
            "review_date": "2021-05-17",
            "source": "rt"
        },
        {
            "content": "Giuseppe Tornatore's \"Cinema Paradiso\" is an ambitious, heartfelt and nostalgic love letter to the power of the movie-going experience. With his second Oscar-winning feature, Italian filmmaker Giuseppe Tornatore crafted a passionate tribute to the art of Cinema that holds up today as a modern cinematic classic. Using gorgeous cinematography, Tornatore draws viewers into the lifelong friendship between a young boy and film projectionist in 1940's Italy. From captivating close-ups to extraordinary establishing shots, the cinematography keeps viewers immersed in the film's period setting. Tornatore showcases extraordinary control of craftsmanship over the production design, locations and musical score, utilizing these components to create an unforgettable cinematic experience. Tornatore's screenplay is also sensational, and effectively employs a nonlinaer flashback structure to tell the life story of an Italian filmmaker. It is hard to not praise the phenomenal performances from the cast. Salvatore Cascio delivers one of the greatest child performances ever as the young Toto. With mesmerizing expressions, he conveys the childlike curiosity, naivete and passion of a young boy that finds solace in Cinema in troublesome times. Philippe Noiret is equally remarkable in the role of an elderly film projectionist that forms an everlasting bond with his child assistant. In one of his finest roles, Noiret instills humanity into an aging senior with regrets on his life. The final, most unforgettable standout in the cast is Jacques Perrin. As the adult version of Salvatore, he brings heartfelt emotion to the movie during its final act. Although \"Cinema Paradiso\" is undeniably an unforgettable Italian drama, ultimately it is not a flawless movie. If there's a minor drawback to the film, it suffers from an extended running-time. At nearly three hours, the director's cut is slightly overlong. Towards the end, there are times when the final act starts to drag and test the viewer's patience. Nonetheless, movie lovers will definitely enjoy \"Cinema Paradiso\" and so will movie-goers seeking old-fashioned entertainment. At a time when Cinema has become a dying art-form, it's reassuring to be reminded of the magic of the movie-going experience by one of Italy's greatest filmmakers.",
            "review_date": "2021-04-28",
            "source": "rt"
        },
        {
            "content": "All time classic. A MUST-SEE. The beauty of cinema portrayed in the most artistic way possible. My personal favorite movie because of its elements of friendship, cinema, and love makes it an amazing film.",
            "review_date": "2021-04-20",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso is more than a tribute to cinema – it is a tribute to love and nostalgia and community and passion and, perhaps most importantly, life itself.  Set in a small Italian village shortly after the end of WW2, the film follows the relationship between the local cinema's projectionist and a young boy who immerses himself in the movies and dreams of one day being a projectionist.  The characters are nicely defined, the score is beautiful, the cinematography is great, and the performances from the leads are wonderful. If one can ignore the fact that most of the humor in the film falls a bit flat, Cinema Paradiso is a rewarding experience filled with touching life lessons and possibly the most appropriate and touching final scene ever committed to celluloid.",
            "review_date": "2021-04-15",
            "source": "rt"
        },
        {
            "content": "No idea who this movie is for, it's childish but there is nudity and profanity.",
            "review_date": "2021-04-13",
            "source": "rt"
        },
        {
            "content": "For many reasons, maybe my favourite movie. Music, love for cinema, relationships, mother's love, reality of life and many more.",
            "review_date": "2021-03-25",
            "source": "rt"
        },
        {
            "content": "Classic must-watch - nostalgia and tears and love, mysteries of movie magic and life all set in a picturesque village in Italy!",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "More than an ode to Cinema, ‘Nuovo Cinema Paradiso' succeed in delivering a truly love story that is surrounded by enormous heart. Epic. Classic. Masterpiece.",
            "review_date": "2021-03-14",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso isn't just a coming-of-age drama that examines friendship and romance… it's a celebration of the silver screen at its finest. It highlights the sensation all cinephiles experience when they sit in a darkened room in front of a larger-than-life screen. Tornatore captures that moment in time when the images and sound wash over you and transport you to a magical place. Cinema Paradiso simultaneously encourages laughter and tears but most importantly will make you appreciate the love of those surrounding you.",
            "review_date": "2021-03-07",
            "source": "rt"
        },
        {
            "content": "A tender story about friendship and dreams.",
            "review_date": "2021-03-01",
            "source": "rt"
        },
        {
            "content": "Jesus Christ they really wanted to persuade you to watch the movie there at the beginning by showing all the awards the movie was nominated for and won. The camera movements and are very elegant and sweeping. The musical score is grand and sentimental in nature, sweeping and magical. The priest and the little boy at the beginning were hilarious. So interesting how the priest is the one who censors out something as natural as kissing, an act of love. Such lively and animated characters. Reminds me so much of Fellini's characters and how much life they have in them.\n\nIt seems like film and pictures is all this kid has in his life. His dad is off at war and his mom has this somberness and sadness about her probably due to the fact that she doesn't know if her husband is ever coming back. But he's a pretty cute and funny kid, he's got spirit. Interesting how they would show important news of what's going on right at the beginning to inform everyone of what's happening. It seemed like the cinema was more than just a place to watch movies, it was a communal ritual where the whole town would go to find whatever it is they were looking for. Whether if it was a place to take a nap, a place to be informed, a place to be entertained and have a laugh or just a place to escape from the harsh realities of life.\n\nI love how Alfredo is looking out for the boy, almost like a father figure. Alfredo is a magician, the wizard of projections. The way he reflects the projection from the inside of the cinema to the outside wall so that the people in the square could watch as well, was pure magic. I actually teared up at how beautiful that moment was. It's interesting how the priest of the town acts as kind of the law, the man, the machine. Wow the whole tone of the movie changed when the cinema started to burn down; so haunting and devastating. Paradise lost in a sense. But that quickly turned around when Ciccio, the Sicilian who won the lottery, bought the to a completely rebuilt the whole cinema from the ground up and gave it to the people. Not gonna lie, I teared up again during that moment. Very beautiful.\n\nOh my god, I can't believe Alfredo became blind. How fucking sadly ironic is that. Wow, what a line from Alfredo: \"Progress always comes too late.\" Ever since he lost his vision, he's become this wise philosophical poet with the things he says and his words. Kind of like Yoda. Hmm, Toto seems to be putting more importance and caring more about Elena than the cinema and running the projector. Which I guess is normal for a boy his age. He's experiencing love for the first time. Man, Elena is so beautiful.  So sad to see when Toto comes back home and the cinema is in ruins. So beautiful that ending; Alfredo ended up splicing all the kiss scenes together he promised he would give to Toto when he was just a child. \n\nThis movie was fucking hilarious but also very sweet and sentimental. Really heartwarming and beautiful. Surprisingly nostalgic and magical in every sense. But also sad and quite heartbreaking; highlighting the darkness and cruelness that is life and having to grow up, realizing that life isn't as magical as it is in the movies. Heartbreaking in the way how we wish our lives turned out one way, but realizing it turned out another way. This movie is a love letter to movies and cinema but it's also kind of a shout out to Federico Fellini in a way. This movie made me really think about my life and contemplate on the things I've done in my life. That's how you know a movie is powerful and impactful. This movie made me realize how important it is to leave home. Life is about change and experiences, it's about moving on, but also remembering and holding on to those sweet and beautiful memories and every once in a while thinking about them. If this movie doesn't make you tear up, you're not human and/or you're soulless. Absolute masterpiece! This has become one of my favorite movies ever.",
            "review_date": "2021-02-20",
            "source": "rt"
        },
        {
            "content": "A must for all film on the big screen lovers! A near perfect homage to cinema, but also to growing up and growing apart. Exelent actors of all ages gives a credible portret of a small Italia village in the post WW2 Europa.",
            "review_date": "2021-02-05",
            "source": "rt"
        },
        {
            "content": "This is in my TOP 5 list of all-time favorite movies!",
            "review_date": "2021-01-27",
            "source": "rt"
        },
        {
            "content": "\"Cinema Paradiso\" is a beautiful film that celebrates the love of movies. As someone who considers film to be his passion, I definitely felt the emotional weight of this story. I think anyone who feels love for cinema will find something they can relate to in it. The movie does have a slightly more interesting first half but the whole package still packs a punch by the time it ends. I thought this was a sweet movie with a fascinating story that uses flashbacks very effectively. In addition to celebrating cinema, the movie also showcases a completely lovable friendship with its two lead characters. Overall, this is a movie made for movie lovers, and as one myself, I definitely think it is worth checking out.",
            "review_date": "2021-01-25",
            "source": "rt"
        },
        {
            "content": "This was my favorite picture when I was a kid, when I first saw it I was around 10 years old and the feelings that provoked on me where life changing",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "Cinema on it's maximum expression",
            "review_date": "2021-01-14",
            "source": "rt"
        },
        {
            "content": "Simply one of the most moving stories of all time, a masterpiece and the score is sensational.",
            "review_date": "2020-12-18",
            "source": "rt"
        },
        {
            "content": "It's wonderful! It fills you up with so many emotions. If you truly love and appreciate film, you must watch!",
            "review_date": "2020-12-16",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso has a haunting beauty and elegance. It stays with you like an old, old girlfriend you could not quite reach.",
            "review_date": "2020-11-19",
            "source": "rt"
        },
        {
            "content": "it is the greatest movie of all time, I cant think of a movie that can even get close to cinema paradiso, it has the best ending of all time and thats also my favorite sean of all time, and thats the truth ruff.",
            "review_date": "2020-10-30",
            "source": "rt"
        },
        {
            "content": "Grossly overrated.  Mawkish, overly sentimental, predictable, overwrought, silly, boring.  What else could I add?",
            "review_date": "2020-10-28",
            "source": "rt"
        },
        {
            "content": "I watched the shorter version and have been told not to watch the longer director's cut, glad I didn't watch the longer one which I guess butchers it. This movie is extremely self-aware and does an incredible job bridging the relationship between films and real life. Art imitates life and we see how films change over time as social norms do as well like with sex and technology. The second half wasn't as strong, but it had a lot of good wisdom saying things like films are different than life, real life is much harder and that when you're young the world is at ur feet and that when u go back home after years it may only be ghosts left. The first half makes u fall in love with the main character and the ppl in this small town in Italy. There is something so charming about those little towns in Europe and the sense of community that has been somewhat lost in American culture. You can tell Italy is a more religious country. The little boy and his father-son rship with Alfredo is amazing. I also loved the first sweet romance story, that like Alfredo fable ends in heart ache. You wonder what has happened in his adult life, altho the film touches on it lightly many questions still. The score is amazing and this film will make u tear up a few times. This film def leaves an impression, as I'm sure the town does on Tito. Any cinephile must see.",
            "review_date": "2020-09-24",
            "source": "rt"
        },
        {
            "content": "A thoughtful movie about growing up in a small town where the only escape for the people from their poverty and their drab lives is twice a week in the glamour of the silver screen. Ultimately the beat up, but friendly cinema house cannot survive TV and its death is the climax of the film. \n\nThis is not fiction as it's message is how, as adults,  we all have to abandon nearly all our fairytale visions of the future and how finally we all have to settle for the compromises of real life.",
            "review_date": "2020-09-04",
            "source": "rt"
        },
        {
            "content": "A classic, powerful film with strong themes of nostalgia, coming of age, fantasy, and romance.  I recommend watching the directors cut, as it adds more layers to this masterpiece.  The score is amazing as well!",
            "review_date": "2020-07-13",
            "source": "rt"
        },
        {
            "content": "I thought it was Pretentious and boring.",
            "review_date": "2020-07-12",
            "source": "rt"
        },
        {
            "content": "Yeeeeah.  I can see why this is considered a classic because it definitely gives off a sense of optimism and youthful charm, but I just didn't find myself drawn to what was going on or emotionally invested/attached for the most part in the characters.  It has GOOD characters and heartfelt performances, and it being a love letter to movies comes across clearly.  Salvatore's young adult chapter was more interesting for me then that of his childhood(which in and of itself was funnier however).  Salvatore's middle-aged chapter in the final act, however, ended with no meaningful revelation and didn't reveal anything truly sobering.  I'm sorry but montages of on-screen film kisses and an innocent, youthful musical score aren't enough to draw me in and sweep me off my feet.  Well made movie and certainly majestic, but not one I intend to revisit.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "I probably watched this four years in a row for four years of high school Italian class, this is the first viewing since 2009. Movie lovers love movies about the miracle of movie-making — Cinema Paradiso focuses on the evolution of literally showing the film (and the dangers that used to exist) and how movie theaters themselves impacted their audiences and communities. Moreover, it is a film about the mentor-mentee relationship between Salvatore (Salvatore Cascio, Marco Leonardi, Jacques Perrin, depending on age) and Alfredo (Philipe Noriet), no matter how much the latter wants the former to do anything else with his life. I loved that this film didn't pursue the love-story between Salvatore and Elena (Agnese Nano), which is where it logically felt like it would go. Notable scenes are when a Neapolitan wins the lottery in the Sicilian town and a bystander shouts \"It's always the Northerners who have all the luck!\" demonstrating that location is always relative, when Alfredo plays The Firemen of Viggiù on the side of a building across the piazza (especially when a resident comes out onto his balcony), and when Salvatore is walking down the narrow street on New Year's Eve, after countless, fruitless hours waiting outside of Elena's home, and glass is thrown from the windows and the fireworks are exploding in the background. Memory is a funny thing, as I could've sworn that when Salvatore returns to his hometown of Giancaldo, a famous film director, he purchases the decrepit cinema and restores it… oh well. That might have made a good ending, even a Hollywood ending but reflecting on what we did get, I don't think it could've been better. Getting to see all of those obscene clips (it's mostly just kissing) that the church ordered be literally cut out of the films along with Salvatore, one final screening from Alfredo, was the perfect ending. Bravo.",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "A simple but moving story about growing up and how the world you knew as a child can only be found as traces in the present.",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "The movie that I will always remember! 😊",
            "review_date": "2020-05-28",
            "source": "rt"
        },
        {
            "content": "Fantastic story of the love for film art. Another memorable soundtrack by Ennio Morricone.",
            "review_date": "2020-04-25",
            "source": "rt"
        },
        {
            "content": "Another foreign masterpiece and one of Italy  best.",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "Beautifully made. Every film lover needs to see this.",
            "review_date": "2020-04-03",
            "source": "rt"
        },
        {
            "content": "Wanted to love it, but I genuinely thought it was boring and lacked plot. Of course, it's a classic, so I came in biased TOWARDS the film, so it says a lot that I didn't really enjoy it.",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "An Classic, a Masterpiece!",
            "review_date": "2020-03-03",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. If you want to understand Italy, watch it.",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "Probably the best movie ever made",
            "review_date": "2019-12-10",
            "source": "rt"
        },
        {
            "content": "It´s the ultimate love letter to the magic of movies and young love. Made with obvious dedication and passion, beautifully directed, with a simple but effective story that will touch everyone. Boasting Great preformances (especially Philippe Noiret) , and adding a terrific main theme by Andrea Morricone that makes up for an unforgettable ending. \nCinema Paradiso is fantastic.",
            "review_date": "2019-09-28",
            "source": "rt"
        },
        {
            "content": "absolutely beautiful. magnifico!\nhaving seen malena before already, this film is in line with the style of giuseppe tornatore, nostalgically presenting sicilia as a place like paradise, and also discussing sexual enlightenment in teenage years of a man's life. of course, this film is really romantic and idealistic, on how salvatore's childhood passion became his career for life and how he had been in love with the first girl he ever dated all those time (similar to renato in malena), which is becoming less and less possible in the present day dating culture, but well we still need a bit of unrealistic romantic imagination in the enough cold and brutal reality; the realistic aspects of the film also exist, for example salvatore and elena were separated and alfredo decided that for him because he needed career advancement (always hard to keep both career and relationship); they also didn't get back together in the end, and not having a \"happily ever after\" ending maintained the depth this movie has. on a personal note, i could relate to much that this movie has expressed from the experiences of myself and my friends. homeland, nostalgia, teenage curiosity on romance and sex, changes and things that are constant, growing up, the dilemma between rome (faraway place, career achievement, adulthood) and sicilia (home, family, relationship, teenage years) - these are topics that humans will always try to express through artforms, they're so complicated, but they're exactly the things that make our lives worth living.",
            "review_date": "2019-09-25",
            "source": "rt"
        },
        {
            "content": "Most people cry just thinking about it.",
            "review_date": "2019-09-02",
            "source": "rt"
        },
        {
            "content": "I adore it! Pure, deep feelings!",
            "review_date": "2019-07-28",
            "source": "rt"
        },
        {
            "content": "This is a highly charming, nostalgic, sentimental drama which is a love letter to cinema. The nostalgia and sentiment might be excessive for some. I thoroughly enjoyed this 1988 film which won the Oscar for best foreign langauge film. I have seen both the original theatrical version and the longer director's cut version. The longer director's cut version does not add anything more meaningful to the original theatrical version in my opinion. \"Cinema Paradiso\" has one of the best ever endings in the history of cinema. ",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "Reviewed 5.12.19  As a cinefile and a sucker for well-earned sentimentality, this should be my movie.   And it has its moments, beautiful vignettes expressing the impact of films on the Italian citzenry of a post-WWII town.  Philippe Noiret, as Alfredo, showing his sleight of hand by masterfully reflecting a projection of a movie down into the town square.  Noiret won a BAFTA for Best Actor for his inspired performance.  And of course, there's the famous final scene when Toto receives what Alfredo willed to him, a gift like no other.  Moments like these, and a cast of goof-ball characters delivering silly bits throughout, is reason enough for its 1989 Best Foreign Film win at the Academy Awards.\n\nBut for a movie based on a passion, an ode to film, it allows the secondary love story to unravel in a dither. Life's little moments can't be saved, but for on celluloid.  I get it, but what moved the crowds inside the Cinema Paradiso was love.  In this way, the whole doesn't equal the sum of its parts.  The directors cut, which is the original film that director Giuseppe Tornatore was forced to cut 48 minutes from prior to its international release, does resolve the love story, but not without seriously altering its message.  \n\nCinema Paradiso breathed life back into foreign film productions.  That alone makes it a notable landmark.  But on its own merits, it's an uneven cult film, and I'm a sucker for those too.",
            "review_date": "2019-05-15",
            "source": "rt"
        },
        {
            "content": "Amazing film of love and growing up. Cant fault it. Beautiful cinematography and music to match. Always a favourite",
            "review_date": "2019-03-21",
            "source": "rt"
        },
        {
            "content": "Con la versione piu' estesa di quasi tre ore il film prende tutto il suo tempo per raccontare una storia carica di emozione che racchiude numerose e diverse tematiche. Tra queste, completamente evitata nella versione cinematografica, una storia d'amore incredibilmente potente ed intensa che si chiude con un finale che lascia molti spunti su cui riflettere. La nostalgia e' uno dei temi piu' ricorrenti e viene gestita in modo eccellente attraverso le modalita' narrative, che separano la storia in tre diverse fasi della vita del protagonista. Il risultato e' un film denso e carico di significato che merita assolutamente tutti i riconoscimenti ed il successo generale che ha avuto.",
            "review_date": "2019-03-19",
            "source": "rt"
        },
        {
            "content": "Good movie.  Worth seeing if you have the time.",
            "review_date": "2018-12-29",
            "source": "rt"
        },
        {
            "content": "Touching movie about the positive influence cinema can have a person's life with an outstanding score.",
            "review_date": "2018-12-01",
            "source": "rt"
        },
        {
            "content": "The one movie that everyone who loves the cinema MUST see! Heart-warming, funny, sad, and entertaining- all rolled into one!",
            "review_date": "2018-12-01",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso is a film about the joy of watching movies and how they can influence the way we think and dream. When you watch little Salvatore Cascio sitting there, looking in awe and wonder at the big screen, it’s hard not to feel the magic of cinema. I’ve had a lifelong love of movies just like little Salvatore, so I could identify with him throughout this story. The wide range of classic films that feature in Cinema Paradiso are wonderful and it was fun to try and identify all the different clips they showed. It was also interesting to see the inner workings of the projection booth and how those changed through the years of his life. It’s sad to see how censorship had dictated what all the people in that small Italian town could see on screen, but that was a superb setup for the finale of this story. The friendship between Salvatore and Alfredo was wonderful and had some good unexpected moments. It provided the heart of Cinema Paradiso and I appreciated that emotional connection in the story. However all the other relationship aspects of the story felt weak to me. There was a romance that drove a portion of the plot and that never felt as powerful to me as they were trying to make it, and the mother-son relationship wasn’t handled well either. The most unfortunate thing was that the framing device prepped us to know in advance how certain things would end. I have a general distaste for framing sequences unless they are handled just right, because I never want the end of the story at the beginning. It sucked some of the emotional impact out of the final scenes because we know from the beginning that Alfredo has just died, and in this case it also spoiled another moment of drama in the film that I won’t spoil here. Cinema Paradiso is a beautiful film and has a number of scenes that feel almost like they were tailor-made to be shown in montages of great moments. This is the kind of movie that people complain about winning Oscars because it’s Hollywood fawning over movies that show a love for Hollywood. But it didn’t feel like Cinema Paradiso was pandering or trying too hard most of the time. There was an honest joy and love for film in this movie to the point that it seemed the director, Giuseppe Tornatore, might have been telling his own story. I did enjoy Cinema Paradiso, but it never had me completely under its spell. I wasn’t as invested in the emotion of the story as I wanted to be. Even though the characters and relationships spoke to me, it felt like something was missing to make it click for me. But I’d still recommend Cinema Paradiso to film fans because it is such a well-made movie about movies. ",
            "review_date": "2018-11-20",
            "source": "rt"
        },
        {
            "content": "Tender, moving, beautiful.",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "This film was almost good.",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "A marvelous score and solid performances can't save Cinema Paradiso from a wonderful tale of friendship and a love for cinema to becoming over-sentimental banality, rushing toward the end-skipping over story development and losing its emotional effect.",
            "review_date": "2018-10-06",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso is an intimate, yet epic in quality film that features a highly memorable, moving ending and a phenomenal, very charming first half. The romance in the second half is underwritten and hasty, but the characterization is strong, the attention to detail is superb and the film offers a glimpse into the everyday lives of Italians during the late 40s and onward while particularly showcasing that period's unprecedented importance and power of cinema.",
            "review_date": "2018-10-03",
            "source": "rt"
        },
        {
            "content": "A true cinematic gem!",
            "review_date": "2018-08-02",
            "source": "rt"
        },
        {
            "content": "The movie could have been benefited way better from the sweet and nostalgic friendship between young Totò and Alfredo, instead  Giuseppe Tornatore focused more than he should have on what is going on inside Cinema Paradiso. That being said, The earliest parts of the movie are the most magical, and you won't appreciate the first act unless you watch the reach the end of the movie.\n\nThe second and the third act are less magical, and not very original, but they are narratively stronger than the first, and have wonderful messages presented by fantastic performances from Marco Leonardi, as Teenager Totò, and Jacques Perrin, as Adult Totò. Also, Philippe Noiret's performance as Alfredo is one of the most poignant, and iconic performances in film! \n\nEnnio Morricone's score will hit you right in the feels, it's his best, IMO.\n\nYou'll get nostalgic feeling only from the movie. Simply, because Cinema Paradiso isn't like any movie I've ever seen, because it's like life!\n\n(8.5/10)",
            "review_date": "2018-07-16",
            "source": "rt"
        },
        {
            "content": "2018-6-23 This is the first time I didn't feel bored or fall asleep while watching an old movie. Heard that there are 2 versions. Make sure you watch the shorter version. The music is very beautiful too. Love this.",
            "review_date": "2018-06-30",
            "source": "rt"
        },
        {
            "content": "A classic and powerful story. Though I still get confused why Alfredo (Philippe Noiret) is such a charming old man and able to influence every important characters in the movie. Bittersweet ending, I wish that Salvatore 'Toto' Di Vita and Elena would be together again, forever.",
            "review_date": "2018-06-23",
            "source": "rt"
        },
        {
            "content": "Surprisingly emotionally affecting film. Story of nostalgia, role models and young love. One man is challenged never to look back because all he'll find is ghosts but somehow those ghosts have such a grip on him that even if he doesn't look back, he's always haunted by the romantic innocence of his youth, making the present and the future dispensable. A beautifully crafted film, wonderfully shot.",
            "review_date": "2018-06-20",
            "source": "rt"
        },
        {
            "content": "One of my all-time favourite movies.",
            "review_date": "2018-05-02",
            "source": "rt"
        },
        {
            "content": "This is about as close to a PERFECT film as anything I've ever seen! It is just as superb as when I saw it in the theater in the 80's.  Marvlous.",
            "review_date": "2018-04-18",
            "source": "rt"
        },
        {
            "content": "It wasn't as good as I was hoping for, but I thought Cinema Paradiso was a pretty enjoyable movie that is a nice tribute to the movies.",
            "review_date": "2018-03-10",
            "source": "rt"
        },
        {
            "content": "I will pretend that the director's cut does not exist, so that leaves us with nothing less than a delightful masterpiece, which is impossible not to like.",
            "review_date": "2018-03-01",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso is an old ode to movie-watching and why people go to them today",
            "review_date": "2018-01-28",
            "source": "rt"
        },
        {
            "content": "A great example on how meaning and content are the most important features of any kind of artform.",
            "review_date": "2017-12-26",
            "source": "rt"
        },
        {
            "content": "A simple and elegant feel-good story about friendship, the magnetic pull of cinema, and boyhood. Like much of Italy's great cinema, there is a robust quality to the film; it carries its weight with lightness and ease. It's a joyous film that revels in the heights and the depths (but mostly the heights) of the human experience, and the reason why movies seem to have become a permanent part of it.",
            "review_date": "2017-12-21",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 6.5\n\nUna de las declaraciones de amor más bellas al cine. A pesar de tener ciertos clichés que en mis tiempos los detesto, la esencia de la película tocará los nervios de todos los amantes del cine.",
            "review_date": "2017-12-19",
            "source": "rt"
        },
        {
            "content": "It doesn’t get much better than this! Yes it’s overly sentimental and a little clunky here and there but for anyone who has had a lifelong love affair with the movies I defy you not to cry at that amazing ending!",
            "review_date": "2017-11-30",
            "source": "rt"
        },
        {
            "content": "A tapestry full of art and culture !",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "Almost impossible for me to accurately review this film, instead of watching the 85min Theatrical release I somehow manged to watch the Directors cut which goes on for over 3 hours.  By the time I was sat there thinking 'bloody hell this drags on a bit' it was too late.  I'd imagine this a is a real heartfelt treat, and maybe at some point in the future I'll revisit the correct version.  Trust me, do not watch the longer one.",
            "review_date": "2017-09-05",
            "source": "rt"
        },
        {
            "content": "2.5/5 stars\n\nI went into this with high expectations and was pretty disappointed.   There were definitely a few charming sequences, but there were just as many sequences that I totally didn't understand or get.   And, overall, I am not sure I understood the whole point of the movie.  It seemed to jag in different directions and I can't really say what the point was.   \n\nBummed I didn't enjoy it more.",
            "review_date": "2017-07-04",
            "source": "rt"
        },
        {
            "content": "The history of cinema is a party. The experience of attending a movie theater has usually become an everyday fact that often involves only entertainment, live with loved ones, and spend a while that will leave on you an emotional imprint. At the end, it is going back to reality. With the course of this exercise that has become so repetitive, we forget that, like theater, dance and even literature, cinema has evolved so much. Not only from the process of realization, but also how we perceive and transmit it. Even more than forgetting, we may simply not know how the historical sequence of witnessing a movie has been. Here in America the ritual of doing it could be summed up in that we go to the movies, we sit down to watch the product and then we retire at the end of the reproduction. On the other hand, in India, watching a tape involves dancing and not stopping laughing and singing.\n\nThese differences between yesterday and today and the here and there are marked in \"Cinema Paradiso\", which honors the not so remote past of attending the cinema and testify it as today is no longer done. Giuseppe Tornatore, with a free exercise of adapting theatrical techniques to his project, manages to recreate a successful environment of an Italian village that after the second world war suffers from a slow recovery, where problems due to lack of money accentuate the life of the majority of its inhabitants. The title, as can easily be identified, refers to the cinema not only as a paradise as it is the marvelous place where night by night various great films of the time are relayed, but rather works as an outline to the social phenomenon of watching the movie, to react and play with it and to be able to interact with the rest of the spectators through these actions, turning every moment into a collection of events with all sorts of meanings. The experience of the cinema does not go back in the individual experience, but in the collective one.\n\nThis text analyzes only the original version of \"Cinema Paradiso\", since in 2002 Tornatore releases an extended and edited version of the same film that many acclaim as one of the best in the cinema. Better or not than the first version, it is important to analyze the first one in isolation, to rescue the most relevant points of the film before getting involved with the second one. The story places Salvatore (Salvatore Cascio) as a kid who lives solely with his mother, and who studies at the local elementary school, but is also an altar boy in the local church, where he spends his afternoons supporting a hilarious and highly conservative priest at the masses of this church - from this first scene we are filled with tender and beautiful images that make us realize the flow of the film as one that keeps a theatrical style to move - the father goes to Cinema Paradiso during the nights. It is the only cinema in town, and he sits to watch with momentum and admiration the tapes prepared by Alfredo. (Philippe Noiret) Only the priest is able to authorize their reproduction. He makes a bell ring every time there is a kiss because for him, every scene of that kind must be cut out.\n\nSneakily, Salvatore attends this cinema. He does so because the priest denies him entrance, but with audacity and innocence, the child manages to squeeze where Alfredo is to witness how the magic of cinema is projected night after night. Although his relationship at first does not seem to work, as Alfredo insists that the child cannot enter the place, time allows them to get along well to the point that Alfredo allows him not only to get in, but he also teaches how the mechanisms work to play a movie from the cinema booth. Soon, they reach a captivating friendship.\n\nWhat enriches and makes this project so special is the perspective in which cinema is seen within the cinema. While it might sound very boring to watch a movie of people watching more movies, what Tornatore generates is a voracious achievement of creating spaces capable of tracing a person regardless of their time, location, or social stratum towards a bubble of audiovisual mosaics, which abound in references to classic European and North American films of the time. There are dozens of films that are mentioned and from which are shown brief fragments, and what is more fascinating is the fact of spending so much time capturing and evidencing the impressions of the people with everything they contemplate. From their looks of astonishment to their reactions of spontaneous and energetic response.\n\nThe film is essentially divided into two. The first part talks about Salvatore and his foray into the cinema thanks to Alfredo. All this characterized by the gift of Tornatore to put his magic as a base for the quality of the plot. The second part, which is marked by a disastrous event for the characters, offers a twist in which everything seems to become a melodrama in which much of what is achieved decreases in intensity but does not succumb and ruin the film after all.\n\nWhat gives value to this film is to speak about our ability to create links with people and with the things that we want. Although this is tried to be destroyed and forgotten, the past in one way or another will return to adjust the slopes that have gone blank. \"Cinema Paradiso\" acts to conquer the public and insist that thanks to the spectators, the seventh art achieves its final mission. Those who come to this cinema really marvel at what they see. They feel scared, they laugh, they spit, they cry, they complain, they cause and they boo - and this is the everyday situation.\n\nSalvatore as a young man (Marco Leonardi) falls in love for the first time, and Alfredo will be a guide for him. Circumstances will make the young man to leave, and after a while without returning to his hometown, the new Salvatore (Jacques Perrin) will be forced to reconnect with what he left and now different things must be faced. Thanks to an Italian soundtrack that with effervescence raises and vibrates this adorable and delicate piece of film, every movie lover shall reproduce it and judge it at least once with the simple aim of letting go. Its end is spectacular and full of memories. This is a tribute to the cinema and thanks to its intimate and unforgettable appeal, what one must do is to be captivated by the smiles and tears that this will provoke on you, arising the encounter of a warm but changing game between romanticism, innocence and occasional oddity that is polished to reward not only what some do for this art, but also those who appreciate it, that is, all of us. 87/100",
            "review_date": "2017-03-29",
            "source": "rt"
        },
        {
            "content": "Love it. One of the best Italian movies ever.",
            "review_date": "2017-02-26",
            "source": "rt"
        },
        {
            "content": "As a film lover how could I not pick this as my favorite movie.",
            "review_date": "2017-02-20",
            "source": "rt"
        },
        {
            "content": "Sebuah film masterpiece yang luar biasa indahnya, brilliant, dan sempurna. Mungkin kata-kata tersebut tidak cukup mampu menggambarkan film ini. Karena begitu baiknya mungkin. Ini adalah sebuah klasik nostalgia yang akan mengumbar sebuah kebahagiaan, cinta, hingga kesedihan dan duka dari kenangan masa lalu yang tak terlupakan.",
            "review_date": "2017-02-16",
            "source": "rt"
        },
        {
            "content": "Una pelicula sensacional. Tiene ese encanto que, en ciertos momentos, regalan las obras realizadas por directores italianos. Te hacen reir, te hacen creer en el amor, te hacen llorar... te hacen vivir la película. La banda sonora del maestro Ennio son 3 cerezas para un mega pastel que se preparo muy bien con los distintos ingredientes. Especialmente, un excelente desarrollo de personaje y un guión que puede poner emotivo hasta al hombre más fuerte. Película indispensable y altamente recomendada.",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "Cute film with lots of heart",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "fantastic film. small and yet large in scope. a love letter to a bygone age of cinema but that is secondary to the wonderful friendship of Toto and Alfredo",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "Beautiful, beautiful film.",
            "review_date": "2017-01-01",
            "source": "rt"
        },
        {
            "content": "(Regarding the American cut, not the bloated, mean-spirited original version.) Cinema Paradiso is a beautiful coming-of-age story involving nostalgia and a love of the movies. We get to know the characters in a small town in Sicily, and are transported in time and space.",
            "review_date": "2016-12-05",
            "source": "rt"
        },
        {
            "content": "'Cinema Paradiso' is a thoroughly engaging film about possibilities, missed opportunities, and the love of a man for the child he never had.  If that's not enough for you to watch then view it for the performance of Philippe Noiret.  Noiret plays the de facto father of Salvatore a young boy who lost his dad in the war. Their relationship is the heart of a film that has one of the best scores ever penned.  It's a classic.  If you're going to watch a foreign language film, this is the one.  Final Score: 9.8 of 10",
            "review_date": "2016-11-26",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 6.5\n\nUna de las declaraciones de amor más bellas al cine. A pesar de tener ciertos clichés que en mis tiempos los detesto, la esencia de la película tocará los nervios de todos los amantes del cine.",
            "review_date": "2016-11-12",
            "source": "rt"
        },
        {
            "content": "One of the great movies of all time.",
            "review_date": "2016-10-31",
            "source": "rt"
        },
        {
            "content": "Finally saw this after hearing about it for years. It was charming, but I did not think it was a big deal. Maybe it hasn't aged well.",
            "review_date": "2016-10-17",
            "source": "rt"
        },
        {
            "content": "Touching, funny, and all-around well-made, Cinema Paradiso is simply a classic.",
            "review_date": "2016-09-23",
            "source": "rt"
        },
        {
            "content": "Captures through an inherently sympathetic lens the communal nature of film and the power of nostalgia. Funny, evocative, and sad at the same time, and ultimately a hugely moving work.",
            "review_date": "2016-09-08",
            "source": "rt"
        },
        {
            "content": "Flat out, the most moving, enjoyable film I've evar seen.  The ending fade, where the screen blurs depicting Toto's tears, is nothing less than a genius level bit of film-making.  And, as is usually the case, the Morricone score is outstanding.  It's impossible to rate this film as high as it deserves.",
            "review_date": "2016-08-18",
            "source": "rt"
        },
        {
            "content": "What a beautiful nostalgic italian movie. Italian movies can be so unique, like this one.",
            "review_date": "2016-08-02",
            "source": "rt"
        },
        {
            "content": "Stands unchallenged as the best movie on the influence of  cinema in our life!",
            "review_date": "2016-07-31",
            "source": "rt"
        },
        {
            "content": "Just Watched this classic again. Brilliant",
            "review_date": "2016-07-27",
            "source": "rt"
        },
        {
            "content": "A nostalgia driven film made all the more enchanting with a beautiful score by Ennio Morricone. Contrary to most reviews, i believe the 3 hour version is much more well rounded and exceeds the shortened version in terms of the Director's vision for the film - not the time length - which some audiences find hard to sit through.",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "Since our childhood cinema has been part of our lives, we were absorbed by it from the beginning and we did not remove anyone, no matter which generation we belong to, whatever our favorite genres, although some movies we like and others disappoint us, passionate about cinema, excites us and makes us happy, what better way to explain if not seeing this colossal masterpiece and ultimate love letter to cinema.",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "This is about as perfect a movie (about movies) that one can imagine.  Driven by a brilliant script, great acting, haunting soundtrack and neorealism, it brilliantly evokes so many emotions including drama, comedy, passion, sadness, tragedy, nostalgia and love.  It is presented as a flashback to an earlier time where the cinema was the centre of cultural entertainment in postwar Sicily,  The viewer never doubts that this is a real story unfolding before them, and it is nearly impossible to hold back tears during this film, especially as it culminates and ties together so perfectly at the end.  Ennio Morricone's theme song helps to stir so many emotions evoked despite the few words spoken to summarize the protagonist's feelings at the end.  A true modern classic of Italian cinema.\n\nLet this film be a test to separate the sound film reviewers from the lightweights.  I truly believe that any person who can come to post a negative review of this film is an utter fool of cinema.  They should return to the pool of manufactured Hollywood commodity product and never return to international cinema.",
            "review_date": "2016-07-17",
            "source": "rt"
        },
        {
            "content": "Masterfully capitalizes on the feeling of nostalgia but comes up just a bit short in taking advantage of the great potential of its different storylines in terms of overall coherence and balance.",
            "review_date": "2016-07-05",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso never gets old. The more of life you go through the more poignant the movie becomes.",
            "review_date": "2016-06-20",
            "source": "rt"
        },
        {
            "content": "Magic on the screen. Relatable, hopelessly romantic. Great pacing of the plot.",
            "review_date": "2016-05-19",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso is an extremely touching film about the relationship that a boy has with the town's projectionist.  Salvatore is a mischievous young boy who develops a passion for cinema.  The film's projectionist Alfredo mentors the boy and becomes a surrogate father to him.  It engages wonderfully with themes of community, growth and nostalgia.  There is very strong emphasis in remembering where you came from.  One thing I didn't like though was the love story they gave Salvatore.  I felt that this was contrived and unnecessary.  it didn't add anything to the plot.\n\nRead my full review here: http://goo.gl/vtbGiX",
            "review_date": "2016-05-04",
            "source": "rt"
        },
        {
            "content": "Fantastic cast, sweet story.  The dubbed version is not as good as the original.",
            "review_date": "2016-05-03",
            "source": "rt"
        },
        {
            "content": "A fine story superbly told through a very focussed Art House production.",
            "review_date": "2016-04-28",
            "source": "rt"
        },
        {
            "content": "A true classic that reminds us what movies be.  One of my all time favorites.",
            "review_date": "2016-03-05",
            "source": "rt"
        },
        {
            "content": "Anyone who is in love with movies, will most likely fall in love with Nuovo Cinema Paradiso.  It's extremely irresistible for anyone with a passion about movies, this may be a cornball celebration of the art and social history of cinema, but it's also a thoughtful memoir of more innocent days, when pleasures rarely came cheaply or instantly, with one of the best movie endings of all time. Cinema Paradiso is a special romance movie, it isnt about the romance between Toto and Alfredo, it also isnt about the romance between Toto and Elena, no it's about the romance between Toto and the Movies.\n\nNothing more needs to be said.",
            "review_date": "2016-03-01",
            "source": "rt"
        },
        {
            "content": "Perfectly portrays why I love films. I like 'Inglorious Basterds' even more now (if that's even possible)",
            "review_date": "2016-02-08",
            "source": "rt"
        },
        {
            "content": "sweet, tender, happy and sad by times, one of my all time favourites",
            "review_date": "2016-01-30",
            "source": "rt"
        },
        {
            "content": "I know this is a classic of world cinema, and adored by many, but I found it slow and sentimental. Your granny may love it. But those used to contemporary European Cinema may prefer something a bit edgier.",
            "review_date": "2016-01-29",
            "source": "rt"
        },
        {
            "content": "amazing. my childhood memory of this movie will never leave me. great from start to finish. a real tear jerker.",
            "review_date": "2016-01-23",
            "source": "rt"
        },
        {
            "content": "Ese final fue excelente :D :')",
            "review_date": "2016-01-08",
            "source": "rt"
        },
        {
            "content": "\"Cinema Paradiso\" is quite an achievement in movie history that boasts a lot of nostalgia and a delightful storyline while paying homage to classic films that broke down barriers in filmmaking. Not only does it show the importance of how movies have evolved, it also gives a heartwarming tale about friendship with an ending that will for sure touch every emotion you have inside.",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "A touching story about the power of film and the love that comes with it.",
            "review_date": "2015-12-15",
            "source": "rt"
        },
        {
            "content": "One of my all time favourites. And the soundtrack by Ennio Morricone is simply genius.",
            "review_date": "2015-12-06",
            "source": "rt"
        },
        {
            "content": "My last film at Camelview, ending it with a classic.",
            "review_date": "2015-12-06",
            "source": "rt"
        },
        {
            "content": "Un muy personal canto de amor al cine y a la vida que le acompaña pero que consigue agradar a la mayoría de espectadores que conservan un gran recuerdo, lo que la hace más meritoria aún, aunque el mayor tesoro es un final difícil de superar.",
            "review_date": "2015-12-02",
            "source": "rt"
        },
        {
            "content": "A nice tale of nostalgia, set in Italy in the 40s & 50s, it follows Salvatore/'Toto' (Cascio as a child/Leonardi as a teenager/Perrin as a adult) as he falls in love with the local cinema, and how the projectionist, Alfredo (Noiret) guides him in the absence of his father. It's great to see some of the old black & white footage, especially of Chaplin & Keaton and is funny that they had to cut out kissing scenes - shows how much times have changed. Toto the kid is cute and mischievous, but means well and is far more likable than when he becomes a teenager/adult. Great ending, but once we leave behind kid Toto, the film becomes less fun. Follow your dreams!",
            "review_date": "2015-12-01",
            "source": "rt"
        },
        {
            "content": "Oh my. This movie is so over the top wonderful. This is the first time I've sought out a forum just so I could get this off my chest. I can't believe it has taken me this long to see this movie. \n\nAnyone who is enchanted by a great movie will understand. This is a movie about movies, a movie about life. There is no fairy tale, no moral point to be made, just a fine story, a life lived, engaging characters, and a genuine, heartfelt love of movies. \n\nI only wish I could have seen it in a cinema.",
            "review_date": "2015-11-03",
            "source": "rt"
        },
        {
            "content": "whimsical, beautiful and romantic tribute to the art of cinema and the beautiful complexity of life... loved it",
            "review_date": "2015-10-29",
            "source": "rt"
        },
        {
            "content": "The soundtrack alone is mesmerizing.  Somehow glad I didn't watch the extended version.",
            "review_date": "2015-10-11",
            "source": "rt"
        },
        {
            "content": "85%\nSaw this on 2/9/15\nGood, but did not meet the high expectations that I have reserved for it. Cinema Paradiso is more about romance and a film theater and not about films, I frankly expected to see a film about films. The acting is good, the drama is good, but there could have been more story to it and more emotions and less romance.",
            "review_date": "2015-09-02",
            "source": "rt"
        },
        {
            "content": "Very nice to see life through the eyes of a passionate little boy and how he grows up an we as an audience follow him throughout all of it.",
            "review_date": "2015-08-27",
            "source": "rt"
        },
        {
            "content": "So mesmerizing, captivating, and moving that it's almost magical, \"Cinema Paradiso\" will make you cry with how good it is.",
            "review_date": "2015-08-16",
            "source": "rt"
        },
        {
            "content": "Notable for its look at the art/exhibition of film through the eyes of one young boy from the sticks of Italy, this coming of age story shows how that love ultimately leads to his attainment of a better life. It's a fun and relatable story for anyone who grew up loving -- and continues to love -- movies, and recognizes film's influence on their lives. \n\nWhile visually beautiful and chock full of fascinating social commentary, the film doesn't completely gel for me tonally. Like fellow Italian, Sergio Leone often tries, director, Giuseppe Tornatore seems hell-bent on fusing overly goofy imagery, slapstick, and potty humor with often dire, depressing content or overly-saccharine schmaltz. Roberto Benigni seems to be the only Italian that can make this type of mixture work (see Life is Beautiful). \n\nAll kidding aside, there have been plenty of films that can accomplish this to great effect, but this just isn't one of them. Maybe there's something I'm losing in translation, but I either can't take the film's emotional scenes seriously or I can't laugh at its humor in light of its awful implications for the characters, or can't give props for a joke because it follows a manipulative moment of sappiness.    \n\nAlso off-putting is the film's use of completely ADR'd (dubbed) dialogue. No, I don't mean a re-dub in English. I viewed a subtitled copy. I'm referring to what appears to be a soundtrack made up exclusively of post-produced audio. Perhaps this was due to a technical limitation of Italian cinema at the time (only 1980s?), or (more than likely) is in keeping with Italian production techniques. Whatever it is, the dialogue comes across very goofy, stilted, and even completely out of synch at times. In many cases it even seems as if actors have been completely replaced on the film's soundtrack. Am I nitpicking? Maybe. But this is very distracting -- adding slight comedy where it doesn't belong.  \n\nVisually, this is a well-directed/photographed film. The story itself is often cute, funny, heartwarming, and deep. Not to mention, it's also extremely nostalgic. [I also enjoy the transitions between child and grown-up Salvatore's life.] But, for me, these feelings and tones don't gel very well at all. It's as if Bugs Bunny directed all of the depressing scenes, Michael Bay directed the schmaltzy ones, and David Lynch directed the comedic moments. No, directed by David Cronenberg! ...or Ingmar Bergman. I dunno. Someone depressing.",
            "review_date": "2015-08-16",
            "source": "rt"
        },
        {
            "content": "Very sweet Italian film about a boy who falls in love with movies, and later in life falls in love with a girl. It was sort of slow to get into, but in the end, I loved it! \"Life isn't like in the movies. Life... is much harder.\" It's currently on Netflix Instant. :)",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "Du grand cinéma italien !",
            "review_date": "2015-07-18",
            "source": "rt"
        },
        {
            "content": "Uma homenagem ao cinema!",
            "review_date": "2015-07-07",
            "source": "rt"
        },
        {
            "content": "Delightful. If you don't cry ... You're dead inside. \nBeautiful, moving and simply wonderful. \nGreatest film ever? If you understand passion and love, then yes. \nExtended version a must.",
            "review_date": "2015-06-21",
            "source": "rt"
        },
        {
            "content": "All these years, I thought I had seen this, but no, what a great romantic treat!  Real proof that cynics shouldn't be allowed in theatres.  The ending just about knocked me out.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "Giuseppe Tornatore's classic drama is two films in one; and two great ones at that. \nThe first is a love letter to cinema itself, exploring one child's fascination with film, charting changes in the medium, and calling out to that forgotten first-time cinemagoer inside us all. The second is a self-aware romance, wearing its heart, homages and cliches on its sleeve. \nAs a complete and charming whole, Cinema Paradiso offers a stern reminder of the aspects of real life and real love which are, and aren't, cinematic. Movie magic at its finest and most universally relatable, the film speaks to anybody and everybody who's ever fallen in love, been to the cinema or fallen in love with the cinema itself.",
            "review_date": "2015-05-22",
            "source": "rt"
        },
        {
            "content": "Wonderful, emotional movie.\n\nThe story of growing up, discovering what you love (with a bit of help along the way)...and not looking back.  Simple yet powerful story, well told.\n\nNot perfect - a bit uneven at times.  Some events are overdramatised and some scenes are less consequential than the attention given to them.  Plus, the apparent moral of the story (Alfredo's philosophy) is possibly not such a great philosophy.\n\nHowever, you will easily forget the flaws once the movie is over.  The final few scenes are incredibly moving. Filled with nostalgia and genuine sentimentality.\n\nOne of the greatest movies of Italian cinema.",
            "review_date": "2015-04-18",
            "source": "rt"
        },
        {
            "content": "A powerful nostalgia imapct.",
            "review_date": "2015-04-14",
            "source": "rt"
        },
        {
            "content": "Best movie of all time.",
            "review_date": "2015-04-02",
            "source": "rt"
        },
        {
            "content": "An amazing, emotional and beautiful portraiture of everything that is good in the world.",
            "review_date": "2015-03-24",
            "source": "rt"
        },
        {
            "content": "An undisputed classic of the italian cinema, the way in which the story is told is very beautiful and original. Cinema Paradiso is a real masterpiece. 9.5/10",
            "review_date": "2015-03-17",
            "source": "rt"
        },
        {
            "content": "Cheesecake Factory-portioned sentimentality, with a side of sentimentality.",
            "review_date": "2015-03-05",
            "source": "rt"
        },
        {
            "content": "if you only watch one Italian film this is the one to watch",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "It would be a crying shame for me to not mention how far this hits home for me, especially when it's my dad -- who saw the film in 1990 and was moved to tears by the end of the film -- who recommended the film to me.",
            "review_date": "2015-02-04",
            "source": "rt"
        },
        {
            "content": "A near perfect film that stays with you for days, even  weeks after. A poignant tale of love and nostalgia. As you watch it, extra layers appear that add to the richness of the story telling. The soundtrack by Morricone is also to die for.",
            "review_date": "2015-01-13",
            "source": "rt"
        },
        {
            "content": "One of the few movies on my list that didn't have what I consider to be an A-list actor in it (obviously being a foreign film).  I don't have many foreign films on my list, but this one just got to me.  The camera work was exquisite in this film - a lot of slow panning...and every scene is fully examined - there is no rushing.  The pacing is a little slow, but deservedly so, and I never felt the slightest bit bored.  The musical interludes are perfectly matched and never overpower the dialogue, and the acting is stronger than I thought it would be going in.  Most of all, this movie simply tears at the heartstrings, and does so perfectly.  There are some good specs of humor in this film, but it is mostly a deeply strong and emotional nostalgic rememberance.  The ending is not at all surprising, but it's absolutely apropo to wrap up the film.  I don't know if they ever released a dubbed version - I certainly hope not as I saw the subtitled version.  Deserves a rewatch in the very near future.\n\nGrade = 8.5/10",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "**124 minute Theatrical cut**\nA love letter to cinephiles, the perfect Italian-set love story takes place in a cramped projection booth in a Sicilian cinema, and there isn't a buxom brunette anywhere in sight (well, downstairs maybe). This sauntering chronicle of a boy's love for cinema as he is mentored by a local projectionist should quiver the lip of any true-blue movie-lover. Cinema Paradiso has charm, and wit, to melt the chilliest heart. The blossoming friendship of young tyke Salvatore and grumpy projectionist Alfredo will surely entrance anyone not won over by cross-eyed priests and eccentric villagers, while the final kissing montage will devastate the hardest of hearts, and remind you why you love cinema in the first place. Some friendly advise though, avoid the bloated extended re-release at all costs",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "25 yrs later watching with my daughter. Still one of the greats.",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "An splendidly enchanting story led \"Cinema Paradiso\" to its power and depth of friendship, love and affection, made it's emotional, charming and maybe magical, even with a bit romanticism and humor. That package is unforgettable, moreover the ending.",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "Such a beautiful slice-of-life story of loss, changing times, nostalgia, passion and love in every messy, yet ultimately beautiful configuration. There is an element of lost childhood that anyone, universally, can cry and mourn.",
            "review_date": "2014-12-13",
            "source": "rt"
        },
        {
            "content": "(For the bloated cut that's on Netflix)",
            "review_date": "2014-12-13",
            "source": "rt"
        },
        {
            "content": "It felt a bit long in the middle but I loved this movie.  Not much else I need to say.",
            "review_date": "2014-12-10",
            "source": "rt"
        },
        {
            "content": "It is my favourite movie! Top ten movies in the history! Beautiful story! The acting, directing, storytelling, photography, music, everything is well-done, especially the music!",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "Muy conmovedora la historia y la relacion entre Alfredo y Salvatore, es una historia muy linda que hasta salis alegre del cine. La banda sonora es increible, y las actuaciones tambien. Un 8.8",
            "review_date": "2014-11-09",
            "source": "rt"
        },
        {
            "content": "Tornatore delivers once again a near masterpiece of film making and probably one of the most beautiful love letter to cinema. a film filled with beauty, memories of cinema and filled with passion and love like we rarely have the opportunity to see it today in modern films. This film reminded me of my own early passion for films and my curiosity towards film making. The characters are very well written and even though the film is quite long, it remain a fascinating piece of cinema like only Italian directors know how to do. This is the kind of classic film one must have seen if they want to call themselves film buffs. Wonderful from start to finish.... a story that will stay with you long after the light is back and the final generic is done.... Il cinema e como la vitta , la vitta e como il cinema....",
            "review_date": "2014-11-03",
            "source": "rt"
        },
        {
            "content": "A beautiful meditation on cinephilia and the power of film.",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Anyone has any tiny bit of romantic ideals left in his bone would want to see this movie, again and again.    * When the cinema play the horror movie, everyone cover their eyes, only one man no fear and looking for a lady.      * The kiss clips of the end    * this is my square. this is my square.",
            "review_date": "2014-10-26",
            "source": "rt"
        },
        {
            "content": "In the esteemed traditions of Neorealism and Italian comedy, Cinema Paradiso finds an excellent balance between humor and nostalgia to become an endearing love letter to cinema. Though the melodrama can be excessively sugary and sentimental, there is pathos and poignancy in the relationship between Alfredo (played impeccably by Philippe Noiret) and young Salvatore.",
            "review_date": "2014-10-13",
            "source": "rt"
        },
        {
            "content": "Incredible - a love ballad to films, poignant and wistful. From a critic's review - \"When it is done well, film tells us what it means to be alive and what the purpose is of our existence. Cinema brings us to the altar of sorrow and joy, loneliness and communion, bitter vitriol and love.\"",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "A nostalgic and sentimental look at a childhood ruled by films, that unfortunately loses it's footing in the second half.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso is a great movie where nothing happens.",
            "review_date": "2014-09-14",
            "source": "rt"
        },
        {
            "content": "Utterly and completely magical paean about the art of filmaking , centering on the relationship between a middle-aged projectionist and a precocious kid, approximately age 9. A must-see film if there ever was one.",
            "review_date": "2014-09-05",
            "source": "rt"
        },
        {
            "content": "I imagine this was far more effective back when it came out. It's a bit cheesy now. \nI appreciated seeing how people viewed movies when they first came out, though. It was a much bigger experience back then. And, sadly, the presentation of movies was often influenced by ultra-prudish religious leaders. No kissing! So bizarre. \nI didn't see this as being all that romantic. The relationship was barely even there. \nNot a bad movie. Just another overrated one.",
            "review_date": "2014-08-24",
            "source": "rt"
        },
        {
            "content": "Nostalgia for the win :)",
            "review_date": "2014-08-22",
            "source": "rt"
        },
        {
            "content": "An absolute must see for the cinephile in all of us! A joyous celebration of film!",
            "review_date": "2014-08-19",
            "source": "rt"
        },
        {
            "content": "Very lovely film, in so many ways",
            "review_date": "2014-08-16",
            "source": "rt"
        },
        {
            "content": "I'm kind of with the Guardian reviewer  who finds the kid (and his teenage successor) somewhat annoying and unbelievable as precursors to the later director. Having waited 25 years to watch this movie, I'm pretty unimpressed.  Compared to Fellini, it is sappy rather than nostalgic, and completely predictable. I suppose if the movie clips were ones I knew personally, I might have had a very different experience of it.  I think the central role of Toto was woefully miscast two times out of three.  First kid was implausible as a ten year old and had no redeeming characteristic other than persistence.  His next incarnation was almost without personality and had no resemblance to the actor playing the man he would become-- either in features or physicality.  His becoming a renowned director has no plausibility since we never see him as anything but a mostly indifferent observer.  The best you can say about him is his love for Alfredo.  Not what I would call a masterpiece.",
            "review_date": "2014-08-13",
            "source": "rt"
        },
        {
            "content": "I've fallen into the trap.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "This italian gem of a movie, is non other than a wonderfull and emotionel experience about the magic of cinema. \n\nBrilliantly written, directed and acted. Se it and be reminded on how magical movies can be :)",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "very powerful movie!",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "The movie is a great homage to innocence, romance, life and, above all else, movies.",
            "review_date": "2014-07-10",
            "source": "rt"
        },
        {
            "content": "Seems like I cannot help but love movies about loving movies.  Cinema Paradiso is simply beautiful.  Like an older version of the more recent Hugo, this film shows you that movies show you dreams and can inspire you to make your own.  Young Toto gets inspired by his at first reluctant mentor Alfredo (Philippe Noiret) and becomes involved with working at the Cinema Paradiso.  Alfredo sees that Toto can move onto big things with film.  Toto battles his own interests with a love for a girl.  Alfredo urges Toto to go pursue his dreams which takes him away from his hometown.  This film ends with Toto making peace with the decisions of his past and it gives closure to his special relationship with Alfredo.  Noiret is superb as Alfredo, who serves as the film's emotional core.  Movie lovers, I invite you to fall in love with Cinema Paradiso.",
            "review_date": "2014-07-08",
            "source": "rt"
        },
        {
            "content": "Cute and nostalgic. It's not that exciting or enthralling. It does tug on your emotions, but not enough to be a great movie.",
            "review_date": "2014-07-05",
            "source": "rt"
        },
        {
            "content": "Rating: 9.0 out of 10.",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "Amazing. this movie is too good\nI love the memorable characters, it's dark and heart warming humor, the beautiful sets and everything else\nIt really is a classic",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "Very close to a 100%.",
            "review_date": "2014-05-09",
            "source": "rt"
        },
        {
            "content": "Although I admit that I did not immediately like Cinema Paradiso, it is a very good film that tugs at your heart strings. That ending was just perfect.",
            "review_date": "2014-05-09",
            "source": "rt"
        },
        {
            "content": "A bit soap opera at the end, I have to admit, but still the poetic one.",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "Basically three movies in one (for the extended version, at least) Such a tremendous experience!",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "The only reason why the rating is not higher is because I saw a shorter re-release version, so I haven't really seen it in its entirety. What I have seen though, is incredibly powerful, and so easy to relate to for those who care so much about cinema, like myself.",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "I don't know which words should I use to describe it: Beautiful or magnificent?",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "Que Hermosa Experiencia Es Verla En Pantalla Grande =)",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "Por algo es una obra maestra ! Un clÃ¡sico imperdible !",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "solo 200 mil USD? en taquilla en los esto unidos???",
            "review_date": "2014-04-03",
            "source": "rt"
        },
        {
            "content": "A masterpiece and a really touching story...a movie lovers heaven.",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "9/10 As an Italian and film-geek, I cannot possibly fail to fall in love with this movie. It is on the surface a movie about love for cinema and life, but has so many more intertwining, complex and most importantly powerfully poetic layers that probably only an Italian can fully comprehend, it won me over immediatly. The themes that keep coming into this movie were some of the most insightful portrayal of human character and more-so Italian population and country I have ever witnessed. The feelings it manages to put you through are as powerful as the reflection you will mature from it. The way in which the movies seen in the film reflect and deepen the movie itself is brilliant, clever film-making. I don't think this is a perfect movie beacuse of some minor flaws on pacing and emotions, but it definetly is a great one.",
            "review_date": "2014-03-25",
            "source": "rt"
        },
        {
            "content": "Alfredo, é belíssimo!",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso [1988] Something heavy and significant hidden in its simplicity and pure bliss. 8/10",
            "review_date": "2014-03-16",
            "source": "rt"
        },
        {
            "content": "A masterpiece of contemporary cinema.",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "5stars... Enough said",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "Primeiramente, uma belíssima e encantadora história sobre amizade e maturidade, que sobressai-se ao indicar a importância da redescoberta do passado para a construção de um presente mais estável e promissor. Concomitante a essa aprendizagem, temos uma tocante e inspirada ode ao Cinema, o qual é considerado como potencializador de uma existência mais ilustrada, fantasiosa e, por fim, feliz - e é maravilhoso perceber que o próprio filme acaba comprovando sua grande tese, visto que as únicas horas de duração já proporcionam em nossas vidas verdadeiros rios de emoções, poesias, retratos, lágrimas e risos. Grande direção de Giuseppe Tornatore, excelente elenco (com destaque para o simpático Philippe Noiret e para o encantador Salvatore Cascio) e belíssima trilha sonora. Em suma, por mais que isso soe batido, um filme obrigatório para todos os amantes da 7ª arte!",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "Oh, good holy God. I don't know if it's because I've been watching some great movies recently, or if the cynicism I gained from Man of Steal Your Money has worn off... but this is the second 10/10 I've handed out in the past two weeks. Jesus, that's not normal. But honestly, if I didn't give Cinema Paradiso a 10/10, I doubt that I'd be able to live with myself, because this movie made me cry like a baby. I don't expect anyone to take this review seriously, because I was completely manipulated by this shamelessly sentimental movie... still though, you can't argue with the results. It combines movies and nostalgia, two things that, when put together, will strike a chord with me no matter what. Exception: Hugo.\r\n\r\nCinema Paradiso is the story of a young boy named Salvatore living in a small town in Italy in the mid-20th century. He has a love of movies, and constantly sneaks in to see them at the local theater. The projectionist, Alfredo, acts as a father figure to Salvatore, giving him parts of the celluloid, advice, and a safe place to come to and enjoy movies. Okay, why not just shoot my fucking cat right in front of me? This is a shameless attempt to tug at the heartstrings of all the cinephiles in the audience. It completely captures the magic of movies in every aspect possible, from the old, classic theater building, the audience's reactions to the films, the priest censoring the movies as they come in, the movie being played outside on the wall of a house... this is why people watch movies.\r\n\r\nSo besides being a movie about movies (and therefore driving all movie junkies nuts), what else does Cinema Paradiso have going for it? Well, it's funny. It's just endlessly, endlessly funny. I don't know of many other movies that can bill themselves legitimately as \"You'll laugh, you'll cry\" (besides 50/50), but Cinema Paradiso easily can. You wouldn't expect a foreign-language movie to elicit belly laughs from international audiences, but it really does. This movie is effortlessly charming from beginning to end, and if you don't laugh at least once, you are a cynical butthole who shouldn't be watching movies. By the way, Cutler, you said in your review that I wouldn't like this movie. Change that shit. It is God.\r\n\r\nThe final sequence is hopelessly manipulative, but if you've been fully sucked into it by then, you won't have a problem with it. I fully understand the complaint that the end of this movie is schlocky and overly sentimental-- it is-- but it has earned its nostalgia. It actually gets you attached to the characters before reeling you in, unlike Up, which started off with nostalgic crap and didn't bother defining the characters whatsoever. Cinema Paradiso saves the weakest part for last, for better or for worse, and even though it is immensely flawed, it still is one of the most powerful cinematic experiences of all time. Martin Scorsese, fuck you for ripping this off with Hugo, the worst movie ever made. If it were possible, I now have even less respect for that complete load of ass. Cinema Paradiso is Hugo done right, with characters we actually care about, who are portrayed by legitimately good actors, speaking good dialogue which serves a memorable and powerful story. What more could you possibly ask for?\r\n\r\nFinal Score for Cinema Paradiso: THE COVETED DIEGO TUTWEILLER 10/10 STARS!!! Again, don't take my word for it, I was swayed by the movie lover within me. I've always said that if you're too emotionally manipulated by a movie, you shouldn't expect people to take you seriously, and I stand by that. I wholeheartedly understand people who disliked this film for its pretentiousness, its sentimentality, or its overly romantic story. But it's good to know that those people (cough cough Cutler cough cough) make up only about 3% of the movie-watching population. Anyway, experience this movie as soon as you can. It's spectacular.\r\n\r\nPS-- If this film had different RT pages for it and the director's cut (the way it is for dozens of other films such as Donnie Darko or Apocalypse Now), it would have 100%. Fact.",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "*THE OFFICIAL BETTER THAN JUNO SEAL*\r\n\r\nWell, maybe I was in full fanboyism when I first gave it the score of 9/10.  I was wrong.  Don't get me wrong!  Giuseppe Tornatore's Cinema Paradiso (or Nuovo Cinema Paradiso) is a good film.  Definitely better than a lot of the schlock that comes out now-a-days.  However, while the first two acts are amazing.  When Salvatore becomes a teen, the film just falls apart.  I'm sorry, but this film easily went from a cinema loving film, a love note to cinema, to just becoming a sappy romance story with little meat.  I mean, there's nothing wrong with romance films (Hey, my favorite film of all time is a romance film).  But I just was expecting much more than what I got.  This is a classic case of hype really killing a film.  It's a shame too because I was enjoying the first half.\r\n\r\nNuovo Cinema Paradiso is in short, a tribute to film in general.  The story follows the life of a boy named Salvatore, who lives in a small town in Italy.  He works as an altar boy and goes to Catholic school, but he has no interest in either of those.  What he does have an interest in is the art of cinema.  He sneaks into his local movie theater, where he watches the uncut version of the film.  Then, on release day, nearly everyone in town gathers to watch the censored version.  Salvatore (or Toto for short) is so enticed that he sneaks into the projector room, where he meets Alfredo, the man in charge of running the film.  Alfredo teaches Toto the ways of cinema and Salvatore grows up to become a well known film director.  Most of the film is based on Tornatore's life experiences as a child, and how he grew up to become a director.\r\n\r\nNow, I'll start off with the things I loved about this film.  First off, the film is excellently shot.  Tornatore creates wonderful angles for us to enjoy this experience, and he incorporates archival footage of the films Toto watched as a kid.  There's a magical flare that is present throughout the first half, giving us what cinema is truly about: a graceful, majestic art.  The first half is easily the more charming half as well.  It features likable characters, witty dialogue, and some very humorous moments within it.  I can't tell you how much I laughed at that crazy lunatic who runs people out of the town square.  The film is also marvelously acted.  You know, I've never watched a child actor with half as much charm and charisma than Salvatore Cascio has when he plays the young Toto.  The rest of the supporting cast is great as well, including Philippe Noiret (RIP) as Alfredo.  Then....the final act comes in.\r\n\r\nThe final act is not necessarily bad, but it's just a little too sappy.  Whereas the first act focused on Toto as a child and when he learned the art of film, the second act focuses more on his love.  The humor also noticeably dies down as well, causing this uneven tonal shift.  It hurts the movie a lot and really slows down what could've been the best film ever.  Cynical retards *cough*Diego*cough* may be turned off by this rather sappy romance.  But for me, I really didn't mind it.  It's just too reminiscent of......The Notebook(Gosling's 4th worst film after Drive, Only God Forgives, and All Good Things)  However, the acting is still just as great, even though only 2 actors were added.   \r\n\r\nOverall, the film was basically killed by the hype, in my honest opinion.  The first two acts are easily the better half, and the last one dissolves into The Notebook.  I can't believe that such a great film can have such a weak ending.  However, if you look past the cheesy romance, you will find the true gems of this film.  It's well acted, features great acting, and is nostalgic.  Even though I didn't live in the 50s, the film does make me reminisce of a time in which I did not exist.  It's sweet and enjoyable, with a great sense of humor, though it can be a tad much (Those boys were jacking off in the theater) (o_0)....Anyways, it's a good, not great film, and should be watched by any film lover....except the Cynical Bastard aka Diego Tutweiller/Garcia.",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "Not only the best foreign language film i've ever seen, but also the most touching heartfelt i've ever seen. Immediately after viewing this it automatically became one of my favorites.",
            "review_date": "2014-02-02",
            "source": "rt"
        },
        {
            "content": "Finally got around too seeing the Italian classic that is Cinema Paradiso and I must say that I was completely blown away by how the film traded a big and significant plot for a nostalgic and detailed portrayal of a man's life. The film starts with successful filmmaker, Salvatore Di Vita, receiving the news that his former hometown's old biograph-projectionist has passed away. After receiving the news, he takes a nostagic look back at his youth. Remebering his childhood in Sicilly, his early fascination with cinema, his bond with the projectionist Alfredo and his first love with a young woman named Elena.\r\n\r\nIt's kind of difficult to decide what I should start praising this film for. The film is simply perfect and I can't wait to see the original directors cut which adds about an hour. The soundtrack contains some of Ennio Morricone's best work and the filming locations paint an even more beautiful picture of Sicilly than The Godfather films. Non-linear storytelling is quite common, but I can't think of any film that have utilized it in quite this fashion and jumps back and forth between different points of a man's life in this manner. We get to follow the character Salvatore in three different points of his life, as a child, as an adolescent and as an adult. Salvatore as a child is brought to life by Salvatore Cassio, I recently stated that I consider Judith Vittet's performance in City of Lost Children to be the best child actor's performance I've seen, but after watching Cinema Paradiso I'm torn between Cassio and Vittet. The adolescent Salvatore is played by Marco Leonardi and the adult Salvatore is played by Jacques Perrin. These three actors bring an incredible consistency to the character with some very fine acting and also brings the same consistency to the dynamic between them and the astonishingly gifted veteran actor, Philippe Noiret, who plays Alfredo the charismatic projectionist of Cinema Paradiso and Salvatore's only father figure.\r\n\r\nHow director Guiseppe Tornatore is able to create the feeling of nostalgia when portraying a time I wasn't a part of and a place I never visited escapes me, but a big factor might be that he uses every movie-lover's nostalgia towards cinema and fascination with movies to create this heartfelt Italian masterpiece. Cinema Paradiso is an unforgettable feat which incorporates a broad variety of the emotions a person might go through in their life into the story and from Salvatore's perspective the viewer gets to experience joy, friendship, passion and love, but also sorrow, loneliness, longing and heartbreak. Undoubtedly this is one of the grandest and most sentimental coming of age films ever created.",
            "review_date": "2014-01-18",
            "source": "rt"
        },
        {
            "content": "I believe The Guardian voted this their favourite film of the 1980's and I quite understand why. It's a sweet, sentimental nostalgia fable about a young boy who grows up helping the cinema projectionist at his small villages cinema and the friendship they form from the late 1930's onwards.\nAt two & a half hours, this is possibly the longest foreign language film I've ever seen, but it ticks by quite nicely due to a good screenplay, great performances and a beautiful music score by Ennio Morricone.\nA love letter to classic film and a must watch for film buffs.",
            "review_date": "2014-01-15",
            "source": "rt"
        },
        {
            "content": "If you watch the full length feature, it's 1 hr 58 min of Paradise for Cinema Lovers...",
            "review_date": "2014-01-10",
            "source": "rt"
        },
        {
            "content": "Everything in here is just about damn near perfect.",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "A beautiful coming of age story, as told through the magic of movies.",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "A beautiful classic. Feel-good and romantic. A wonderful homage to the cinema.",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "An emotional, nostalgic film about growing up in cinema. If you're a cinephile looking for an evocative film, look no further.",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Great film. Would totally recommend",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "Nostalgic with some taste of innocence view to immortals of old time cinema.Boccato cardinale.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "A masterpiece of cinema.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "Cinema Paradiso is one of the finest films for film fans that I can possibly think of. It's director Giuseppe Tornatore's love letter to cinema and to his childhood, but it's also one of the most endearing and entertaining films I've ever seen. The story concerns a young Italian boy who becomes obsessed with films at the theater in his neighborhood and a projectionist who takes the boy under his wing and teaches him the tools of the trade. As the boy grows, the times change, people get hurt, people find love and people grow apart, which all plays into the ending of the film, which I don't want to spoil. Caution though, you may want to keep plenty of Kleenex on hand. It's a beautiful film with an incredibly moving score by Ennio Morricone. If you have yet to see this gem, I highly recommend that you do so right away.",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "I really don't know I've never seen this before - wonderful !",
            "review_date": "2013-12-23",
            "source": "rt"
        },
        {
            "content": "a perfect exapmle of a instant classic from 1988 feels more like 40's cinema",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "A very sweet and unapologetic movie. Like the magnificent score, it's shameless in its sentimentality and nostalgia. There is such a tremendous affection for movies here (nicely summed up in the end). Yet, this sentimentality works because we see the majority of the film in flashback. It's in our hero's memory. The death at the beginning sparks the memories of his own life, almost as if it were a movie. And his life is all about watching movies. The actual theatre called Cinema Paradiso is at the center of the town as well as our protagonist's life, not to mention, the movie itself. It's the center of everything. It's a metaphor for the church. \n\nAfter all, post-WWII, movies were more than just entertainment, they helped us understand what we went through. Both what we did wrong and what we did right. The church metaphor is so crucial in this film. It's about people coming together - communion. Cinema is the secular version of the church. The body and blood of Christ are supposed to be transcendent, like a movie. Film transcends the ordinary world by appearing on the silver screen. In fact, the Italian translation of Diva and Devo are Diety (Goddess) and Man (God-like). So, movie stars are like bread and wine. Audiences identify with the divine in the fandom and love of celebrities. \n\nInteresting to note, that right from the first shot, loneliness and singularity are addressed. Throughout, we get the feeling of a love lost or an absence and void. The little allegory about the man who waited 99 nights is a reference to the love that can never be as good as we imagine it to be. Like the love in a movie, it's a dream. So unconsummated love is what it always comes back to. Just like the illusory nature of movies. A beautiful and bittersweet sentiment.",
            "review_date": "2013-12-10",
            "source": "rt"
        },
        {
            "content": "The. Best. Movie. I. Have. Ever. Watched.",
            "review_date": "2013-12-10",
            "source": "rt"
        },
        {
            "content": "I balled my eyes out. The little kid really makes you fall in love with him as he grows.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "I balled my eyes out. The little kid really makes you fall in love with him as he grows.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "The original cut has become an instant favourite. The film is sweet but not saccharine; the characters are all lovable and memorable, and while it is more a rose-tinted look back at a certain time rather than anything resembling real life, it is still nostalgia of the highest order, that displays a genuine love of cinema. A classic that pays homage to the classics that came before it.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "It was a wonderful movie.",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "Este es el tipo de películas que mas me gustan. Historias simples, cotidianas, donde una buen cuento basta, sin necesidad de apelar, o a efectos especiales, o a tramas entrampadas, etc. Un clásico del cine italiano que consolidó el cine internacional en los Óscar. Muy recomendable. Es quizás la banda sonora más magistral del gran Ennio Morricone.",
            "review_date": "2013-11-08",
            "source": "rt"
        },
        {
            "content": "No film has ever been as successful as Cinema Paradiso in portraying the nostalgia and power of cinema. This is the story of a man who, after hearing the death of a man named Alfredo, is brought back to the days of his youth in a small Sicilian town where Alfredo used to be a projectionist in the local cinema. Tornatore is a spectacular filmmaker - the cinematography in his films is always superlative sometimes to the point of distraction. But here, in Cinema Paradiso, everything works to perfection. The photography and complex but tasteful camera movements heighten the poetry and softness of the central storyline of the friendship between Toto and Alfredo - that has since gone on the record as one of the most touching in cinema history. The character of Alfredo, memorably interpreted by Philippe Noiret, is practically magical juxtaposing his small town wisdom with Hollywood philosophy by constantly quoting the movies. Furthermore, Cinema Paradiso is incredibly entertaining, perfectly balancing lough out loud comedy with heart breaking drama in a poignant and delightful infectious mix. An invaluable added bonus is added by Ennio Morricone, established music genius, with one of his greatest compositions of all time. By paying tribute to film classics, Cinema Paradiso becomes a classic in its own right. A wonderful spectacle of celluloid brilliance, the overall feeling is that this film may have silently inspired more generations of cinephiles and filmmakers than many dare to openly admit.",
            "review_date": "2013-11-04",
            "source": "rt"
        },
        {
            "content": "More like 75%.\r\n\r\nThough it's overly sentimental at times, Cinema Paradiso succeeds as a comforting and nostalgic look back at the magic of cinema.",
            "review_date": "2013-10-29",
            "source": "rt"
        },
        {
            "content": "Magical film for movie buffs! I recommend this film if you enjoyed other films like Hugo and The 400 Blows.",
            "review_date": "2013-10-29",
            "source": "rt"
        }
    ]
}