{
    "rating": 8.5,
    "release_date": "1988-06-21",
    "num_reviews": 230,
    "genres": [
        "Comedy"
    ],
    "summary": "Down-on-his-luck private eye Eddie Valiant (Bob Hoskins) gets hired by cartoon producer R.K. Maroon (Alan Tilvern) to investigate an adultery scandal involving Jessica Rabbit (Kathleen Turner), the sultry wife of Maroon's biggest star, Roger Rabbit (Charles Fleischer). But when Marvin Acme (Stubby Kaye), Jessica's alleged paramour and the owner of Toontown, is found murdered, the villainous Judge Doom (Christopher Lloyd) vows to catch and destroy Roger.",
    "reviews": [
        {
            "content": "A great, great film by director Robert Zemeckis. A classic in every sense of the word! A-",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is a classic, do not get me wrong, it is just that I personally think that Disney could have changed a few things and made this into a masterpiece that it could most definitely have been. This movie is funny, the toons are all funny in their own way, and it just is a great film for the family to all see.",
            "review_date": "2023-04-10",
            "source": "rt"
        },
        {
            "content": "Movie was great Had it had good comedy",
            "review_date": "2023-04-05",
            "source": "rt"
        },
        {
            "content": "This will be remembered as Bob Hoskins best movie! I think the plot of a detective that hates toons because one killed his brother is very interesting!",
            "review_date": "2023-04-01",
            "source": "rt"
        },
        {
            "content": "Innovative for its time, combining cartoon and real life in this comedy action thriller is a must see!",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "Aside from some moments, this is an excellent film",
            "review_date": "2023-02-14",
            "source": "rt"
        },
        {
            "content": "Avatar maybe the current flag bearer,  but Roger Rabitt is the ground breaker for animated movies. Like no other feature movie, before or after, it ticks all boxes and more.",
            "review_date": "2023-01-24",
            "source": "rt"
        },
        {
            "content": "I love this movie it is one of the best movies i have seen",
            "review_date": "2023-01-13",
            "source": "rt"
        },
        {
            "content": "Muy buena y entretenida.",
            "review_date": "2022-12-18",
            "source": "rt"
        },
        {
            "content": "All time classic! Must have seen this movie 50 times and always enjoy watching!",
            "review_date": "2022-10-19",
            "source": "rt"
        },
        {
            "content": "A gritty film noir mystery for the parents that's got cute animated characters for the kids.\n\nDirector Robert Zemeckis' live-action neo-noir mystery and animated family comedy Who Framed Roger Rabbit (1988) is a real creative and funny movie. Zemeckis' direction is imaginative and skillful with deft craftsmanship and a loving tribute to Looney Tunes and old Disney cartoons alike besides all the old film noir mysteries. Zemeckis brings cartoons to life and lets people become animated characters in their own right. Zemeckis is strangely the perfect director for Roger Rabbit as he plays the mystery totally seriously with intrigue and style, then allows for the cartoons to be absurd and playful for the comedy.\n\nRichard Williams' animation direction is exciting, adorable, hilarious, provocative, and highly imaginative. His animators are so skilled at recreating older animated cartoons like I grew up watching reruns of on television that it's amazing. The way the practical effects blend with hand drawn animation has never been executed more realistically before or since green screens and computer animation. Who Framed Roger Rabbit is a groundbreaking milestone of hand drawn animation and crafty live-action direction for a thoroughly entertaining hodge podge of ideas. Richard Williams deserved that special Oscar Award for his animation efforts within Who Framed Roger Rabbit.\n\nProducer Steven Spielberg oversaw the script and with directorial credits like Spielberg's, you know he paid attention to all the references to old Hollywood like Chinatown or The Maltese Falcon. Writers Jeffrey Price, Peter S. Seaman, and Gary K. Wolf imagines a world of living cartoons mingling with human adults. It's all gritty film noir detective stuff with sleazy people, swear words, and voluptuous women. I don't know how this got made, but surely adults and children will love it for generations to come. I used to dismiss this as a silly concept, but it's quite brilliant. Mashing up old film noir picture aesthetics with old Hollywood, Disney, and Warner Brothers cartoons with sheer whimsy in mind.\n\nEditor Arthur Schmidt somehow splices animated cartoon footage together with live-action footage with Bob Hoskins. It's all so slickly cut that you never question the toons living in this world. Schmidt earned that Oscar for Best Editing. He even keeps the run-time down to a brief 104 minutes. Dean Cundey's cinematography uses all sorts of shadows, angles, and hideaways to keep the tone and visual style of Roger Rabbit like it's a film noir picture.\n\nBob Hoskins is excellent as the grumpy and disillusioned detective Eddie Valiant. His alcoholism and gruff performance show off his disdain for toons like the film noir detectives of old having a hatred of criminals or women or whatever. Christopher Lloyd is both funny and terrifying as the erratic and violent Judge Doom. He's a truly unsettling villain in all his slow movements and hysterical behavior. Joanna Cassidy is very charming, funny, and likable as Valiant's girlfriend Dolores.\n\nCharles Fleischer is insane as the chaotic cartoon bunny named Roger Rabbit. He's got a fun rapport with Bob Hoskins that works wonders for their unlikely buddy cop dynamic. Fleischer goes all in on being obnoxious as Roger to the point where it circles back to being actually endearing and funny. Kathleen Turner pulls off the breathless whispery voice for Jessica Rabbit's sultry speaking voice, while Amy Irving delivers an enchanting and soft singing performance as Jessica Rabbit's vocals. Lou Hirsch is rough and brutish as Baby Herman.\n\nI loved hearing Mel Blanc voice Bugs Bunny, Daffy Duck, Porky Pig, Tweety Bird, and Sylvester the Cat. Joe Alaskey is great as a frustrated Yosemite Sam. Wayne Allwine's Mickey Mouse voice is adorably squeaky. Tony Anselmo and Clarence Nash are both wonderful as a sputtering Donald Duck. Mae Questel sounds cute as Betty Boop in a sweet tribute to her character and era of cartoons. I liked seeing the Fantasia characters too from the brooms to the hippo.\n\nProduction designers Elliot Scott and Roger Cain create shady bar and nightclub sets for that sleazy atmosphere. Art direction from Stephen Scott and William McAllister creates stark city streets and cute plush looking animated cityscapes for Toon Town. Set decorators Roy Barnes, Robert R. Benton, Peter Howitt, and Lynn Christopher adorn every studio office, bar, and apartment with lavish cartoon movie posters and old Hollywood glamour.\n\nComposer Alan Silvestri really nailed the 1940's style jazz music throughout Roger Rabbit. I like how old timey and charming his musical score sounds for the cartoon segments. Silvestri's score is as vibrant as the colors are lush. Joanna Johnston and Linda Henrikson's costumes look cool with that trenchcoat and pinstripe suit look on all the guys. Of course, Jessica Rabbit's sparkling red dress is dazzling to look at as it is fitted to Jessica's absurd curves. Peter Robb-King makes all the men look more cartoony and grisly, while Dolores looks lovely in her old fashioned diner and bar dresses.\n\nIn short, there's tons of humor and charm herein Who Framed Roger Rabbit with some darker themes and scary sequences for thrills of all kinds. There's really no other film like it as Space Jam does not even look this great anymore.",
            "review_date": "2022-10-04",
            "source": "rt"
        },
        {
            "content": "It was awesome watching this movie after so many years and I couldn't believe how much of it I remembered. For a movie from the 80's it held up extremely well and it was enjoyable once again.",
            "review_date": "2022-10-03",
            "source": "rt"
        },
        {
            "content": "One word, outstanding! i loved this when I was a kid. I'm 16 now and i still love it. The live action with the animation was perfectly blended, and I was howling with laughter at the beginning. The story is perfect, about a rabbit framed for a murder, when he suspects his wife of cheating on him. Bob Hoskins was brilliant as the melancholy drunk private eye, while Christopher Lloyd has great fun as the very scary villain. I would never have guessed the ending in a million years, totally unpredictable, and quite scary too. The real stars were the toons. Some of the funniest scenes were with them, like Eddie in ToonTown, and the weasels were a blast. reminded me of the Untouchables, actually. I didn't know for ages, that Kathaleen Turner voiced Jessica Rabbit, wow that woman is beautiful. Turner voiced Jessica brilliantly. in conclusion, a hugely satisfying part animated comedy, that both kids and adults will love. 10/10 Bethany Cox",
            "review_date": "2022-09-21",
            "source": "rt"
        },
        {
            "content": "A wonderfully crafted film with a setting that is  a love letter to the golden age of cartoons mixed in with film noir. It's funny when appropriate and serious when it needs to be. Most stunning is when you think through the unimaginable challenges it took to create this film technically and with IP licensing. A true delight.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "7 years ago-Ahead of it's time, hilarious ode to cartoons.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "My Favorite Live Action Animated Movie of All Time. Eddie Valiant is one of my favorite heroes of all time and Bob Hoskins does incredible actually \"Looking AT\" the toons and making you believe this world. This is the perfect blend between comedy, action & Noir and one of the most technically ambitious films I've ever seen. Also one of the most memorable villains i have ever seen as well. The most incredible scenes are the ones where the toons/real people interact with objects from the others world. This is something to this day you barely see in CGI live action movies, only having the characters talk and look at each other and never actually interacting with each other. Also many will give a behind the head  shot to hide the fact the actor is looking through the character. That is never done once here and it is phenomenal. Truly a an amazing achievement with exquisite attention to detail in every frame.",
            "review_date": "2022-08-08",
            "source": "rt"
        },
        {
            "content": "Straight up masterpiece that never gets old!",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "Easily the best Live action Disney Movie with Animation that puts many Animated projects today to shame.",
            "review_date": "2022-05-25",
            "source": "rt"
        },
        {
            "content": "\"Who Framed Roger Rabbit\" is one of the best movies ever made. I'm not exaggerating. Spectacular as a comedy (absolutely all the jokes work) and solid as an investigation movie, the film is led by one of the best pairings in cinema's history: Eddie Valiant, made by Bob Hoskins, a private investigator who hates cartoons; and Roger Rabbit, voiced by Charles Fleischer, a toon bunny who is the perfect junction of almost every main character of a protagonist from a cartoon made in the 1940s. I love Roger Rabbit, seriously; for me, he's easily in the top 5 best protagonists. The film satirises everything and everyone, it has elements of a noir film, jokes with Disney, Warner and even MGM, and especially (and essentially), the essence of cartoons. Jessica Rabbit is a fantastic example of a Femme Fatale (possibly the most famous noir archetype): seductive, mysterious and intelligent, and voiced \"sexily\" by Kathleen Turner. She steals her scenes and not because of her physical lines. And Christopher Lloyd, who is unrecognisable, is the perfect villain for this type of approach, but I can't say anything more without spoilers. His goons, the weasels, make only one joke, that works every time. In my review of \"Passing\" (2021), I said that movie was the period film that seemed to have been made at the time it takes place. Well, \"Roger Rabbit\" is at least at the same level. We already have coloured films at the end of the 40s (the film takes place in 1947, and \"The Wizard of Oz\", for example, is from 1939), and the interaction between humans and cartoons (who also look like cartoons made in the 40s) have also been made on that time (The Three Caballeros in 1944 and Song of the South in 1946, both from Disney). The film has deservedly won three technical categories at the Academy Awards (Sound Editing, Visual Effects and Film Editing), but I really think its biggest triumph is that it never loses its comic tone at the same time it never takes away the credibility of the investigation plot, merit shared between the director (Robert Zemeckis) and the screenwriters (Jeffrey Price and Peter S. Seaman).",
            "review_date": "2022-05-24",
            "source": "rt"
        },
        {
            "content": "Classic! A must watch!!",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "Amazing. Just amazing.",
            "review_date": "2022-05-21",
            "source": "rt"
        },
        {
            "content": "I enjoy the classic movie Who Framed Roger Rabbit and so much cameos of Disney and Warner Brothers Studio of Cartoon so yeah.\nI love it.",
            "review_date": "2022-05-20",
            "source": "rt"
        },
        {
            "content": "Groundbreaking film, really love it, forgot about it's existence until I gave it a re-watch, amazing stuff and amazing cartoon-human interactions",
            "review_date": "2022-05-03",
            "source": "rt"
        },
        {
            "content": "its a very good movie i loved it they have a great live action in this movie roger is a pretty fun character.I love the animation of the other cartoon characters they are great i love the office guy he was great i love the story its freak fun i love jessica rabbit shes fun and yes its a pretty awesome film i'm proud of this film for making it i watched the benied the scenes and they said it was hard for the cop guy.i do have problems the villain is so bland like a tough pick he makes no sense and the movie is confusing some times because they have BUGS BUNNY AND MICKEY IN THE SAME PLACE i was like WHAT?????????????????but its a awesome film kids should not watch does but pretty awesome its a 8/10 film i loved it.",
            "review_date": "2022-03-21",
            "source": "rt"
        },
        {
            "content": "An all-time classic that not only provide memorable moments with the performance of Bob Hoskins and the lively characters, but the way it delivers an entertaining and captivating story that makes efficient use of combining animation with live action.",
            "review_date": "2022-03-21",
            "source": "rt"
        },
        {
            "content": "One word, outstanding! i loved this when I was a kid. I'm 16 now and i still love it. The live action with the animation was perfectly blended, and I was howling with laughter at the beginning. The story is perfect, about a rabbit framed for a murder, when he suspects his wife of cheating on him. Bob Hoskins was brilliant as the melancholy drunk private eye, while Christopher Lloyd has great fun as the very scary villain. I would never have guessed the ending in a million years, totally unpredictable, and quite scary too. The real stars were the toons. Some of the funniest scenes were with them, like Eddie in ToonTown, and the weasels were a blast. reminded me of the Untouchables, actually. I didn't know for ages, that Kathaleen Turner voiced Jessica Rabbit, wow that woman is beautiful. Turner voiced Jessica brilliantly. in conclusion, a hugely satisfying part animated comedy, that both kids and adults will love. 10/10 Bethany Cox",
            "review_date": "2022-03-14",
            "source": "rt"
        },
        {
            "content": "This is one of the greatest hybrid films. I think it deserves a sequel! ðŸ˜€",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": "Pure entertainment, excellent editing, catching jazz soundtrack. Who framed Roger Rabbit is able to combine genuine slapstick comedy with a mysterious noir story. Must-see! My rating: 9,5/10",
            "review_date": "2022-02-24",
            "source": "rt"
        },
        {
            "content": "ROGER RABBIT remains as strange and amazing as when it was first released. It probably shouldn't work, but it totally does. A remarkably unique and inventive film.",
            "review_date": "2022-01-10",
            "source": "rt"
        },
        {
            "content": "I'm not sure if you can really call this a kid's movie seeing as it's filled with murder, alcohol, sexual innuendos, and capitalism (gasp!), but it sure is a hell of a lot of fun for adults. It seems firmly aimed at those of us who grew up on Looney Tunes and Disney (which is me, luckily), but I'm pretty sure a cartoon novice could still find a lot to enjoy here.\n\nI spent most of the film in awe of how well the cartoons interact with the live actors. It's legitimately impressive how much chemistry a noir detective can have with a cartoon rabbit, but they've really pulled it off. The cartoon props feel exactly as out of place as they're supposed to, but not in a jarring way. However (and this is a minor complaint), near the end of the film I noticed several instances where it seemed like the animators might have forgotten to overlay the cartoon version of the props on top of the real ones? Eddie makes a point of having a cartoon gun in one scene, and then in the next scene it's just a regular, if kind of clunky-looking, gun. It's a bit of a shame because it took me out of what was otherwise a clever and engaging film.\n\nThere are some surprisingly deep themes here and they mesh well with the light-heartedness of the cartoon cameos. The script is satirical and goofy in just the right way. All of the voice actors are great and Christopher Lloyd steals every scene he's in with his comically evil Judge Doom.\n\nWho Framed Roger Rabbit is just a really fun, unique movie that everyone will enjoy.",
            "review_date": "2021-11-16",
            "source": "rt"
        },
        {
            "content": "This classic of American cinema was released under Disney's Touchstone Pictures and produced by Steven Spielburg. Spielburg's name was basically how this movie got made and I'm afraid it was lightning in a bottle that will, sadly, never happen again. Starring Bob Hoskins as a private detective that must help a cartoon character named Roger Rabbit clear his name for murder. The library of characters that appear in this movie is astounding! Easter eggs are everywhere which makes the movie rewatchable. In fact, when rewatching this movie for this review I saw a Bugs Bunny cameo that I never noticed before. How they did the effects for this movie is fascinating and it is noticeable that a lot of love went into this film. The story is fun, the jokes land and many of them are very intelligent. The animation is great and works well within a live set. Can't recommend this enough!",
            "review_date": "2021-11-14",
            "source": "rt"
        },
        {
            "content": "Completely revolutionary work from Zemeckis, who pushed the bar here so he could continue pushing today.",
            "review_date": "2021-11-10",
            "source": "rt"
        },
        {
            "content": "Tech advances do make up for the fact that it is frenetic, overdone, needlessly sexualized, and sickeningly violent. The original cartoons of the 40â€™s had charm. Roger Rabbit is annoying and flat.",
            "review_date": "2021-10-28",
            "source": "rt"
        },
        {
            "content": "MiscelÃ¢neas desenhos e realidades nem sempre me encantam, mas essa, com ar de mistÃ©rio policial, me encantou, o detetive ranzinza e o coelho chato, beirando o insuportÃ¡vel, se tornou uma mistura divertida e atraente, como Jessica Rabbit, um pouco longo, final disperso, mas muito fofinho e engraÃ§adinhoâ€¦",
            "review_date": "2021-08-31",
            "source": "rt"
        },
        {
            "content": "I heard high praise as to how this movie revived the early twentieth century great animation, how all the old time toons were brought in together in a single movie, how it combined well with live action as well. This may all be true.\n\nBut the star of the show, Roger Rabbit, was awful. He was completely irritating. He kept jumping around, he kept talking so fast I couldn't understand what he was saying, after five minutes I simply couldn't stand him and I turned the movie off. No wonder he didn't stay in the public eye for long, except among cartoon animal enthusiasts.",
            "review_date": "2021-08-28",
            "source": "rt"
        },
        {
            "content": "It is a tremendous knockout in live-action and animation blending with a cast of fresh originals with familiar faces, a surprisingly involving crime drama plot, and an exuberant amount of top tier talent firing on all four-cylinder fronts. \n\"Who Framed Roger Rabbit\" is in a pioneering class of its own and remains untouched in its filmmaking achievements.",
            "review_date": "2021-08-21",
            "source": "rt"
        },
        {
            "content": "No toon can resist the old shave and a haircut routine. This is a classic fun movie. ",
            "review_date": "2021-08-04",
            "source": "rt"
        },
        {
            "content": "It was an amazing movie, considering how they made that in the 80's. It felt much like Mary Poppins and Space Jam. I loved how they added many iconic cartoon characters such as Betty Boop, Dumbo, Mickey Mouse, Daffy Duck, Donald Duck, Bugs Bunny, and much more. For me, the movie is not really suited for 10 and below, considering how there are violence and foul words in the movie.",
            "review_date": "2021-07-25",
            "source": "rt"
        },
        {
            "content": "Based on the 1981 novel Who Censored Roger Rabbit? by Gary K. Wolf, this movie is from a time before crossovers and meta-based films like the latest Space Jam and Ready: Player One. It was incredibly mindblowing as a teen to watch this movie on the big screen and see Bugs Bunny and Mickey Mouse actually having a conversation.\n\nWhat's even better is that it has a film noir mystery at its center with Bob Hoskins as Eddie Valiant*, a down on his luck private investigator dealing with his hate of animated characters known as Toons which actually exist in this alternate universe.\n\nAt the time, this was the most expensive animated film ever made, but Walt Disney Studios chairman Jeffrey Katzenberg believed that live-action and animation together would save the cartoon department at Disney.\n\nPlus, the studio brought in executive producer Steven Spielberg and his production company, Amblin Entertainment, who would get creative control and most of the box office, leaving Disney to keep merchandising rights.\n\nSpielberg went to work getting other studios to lend their characters to the film, getting most of the Warner Brothers characters to appear but sadly failing to get Popeye, Tom and Jerry, Casper the Friendly Ghost or any of the Terrytoons.\n\nWith live action directed by Robert Zemeckis and animation by Richard Williams â€” along with the skills of Dean Cundy as cinematographer, Arthur Schmidt as editor and hundreds of artists making all the animation** â€” this film stands out as nearly the final chapter on traditional animation***.\n\nEisner and Roy E. Disney, vice chairman of The Walt Disney Company, felt the film was too sexual, but Zemeckis had final cut privileges (and Williams disliked Disney so much that he based his animation studio in England so they could not interfere). That's why this was a Touchstone Pictures release instead of Disney.\n\nEven today, Zemeckis claims that Disney will never make any of the proposed sequels, telling Den of Geek, \"The current corporate Disney culture has no interest in Roger, and they certainly don't like Jessica at all.\" He also claimed that a sequel**** wouldn't be on Disney+ as there are no princesses in it. There were, however, some animated shorts that came out after the film: Tummy Trouble proceeded Honey, I Shrunk the Kids, Roller Coaster Rabbit played before Dick Tracy and Trail Mix-Up was in front of A Far Off Place.\n\nInstead of a detailed summary of the plot of this film, I suggest you view it for yourself. However, I will share that I absolutely love Joanna Cassidy as Eddie's strong and capable love Dolores and Christopher Lloyd is beyond outstanding as Judge Doom. And I think it's amazing that early versions of the script had The Toon Patrol weasels as Stupid, Smart Ass, Greasy, Wheezy and Psycho, created to be inversions of Snow White's Seven Dwarves Doc, Grumpy, Happy, Sleepy, Bashful, Sneezy, and Dopey).\n\nCharles Fleischer was so dedicated to his role as Roger that he dressed up on set and did his lines. And man, has any voice ever been better for a cartoon noir girl than Kathleen Turner (and Amy Irving for the singing voice)? And any movie where a cartoon baby gruffly says, \"I got a thirty-year-old lust and a three-year-old dinkyâ€¦\"\n\nOne last fact: When Eddie takes Roger Rabbit into the back room at the bar and Dolores is sawing their handcuffs, the lamp on the ceiling bumps and swings. That's all animation that was added to give the scene something extra. All of those shadows were drawn. That's why the phrase \"bump the lamp\" is used at Disney even today when people say they need to go the extra mile to make something special, even if no one notices it.\n\n*Test footage has Peter Renaday as Eddie Valiant, Paul Reubens as Roger Rabbit and Russi Taylor as Jessica Rabbit. Other actors who were almost Eddie include Harrison Ford, Chevy Chase, Bill Murray, Eddie Murphy, Robin Williams, Ed Harris, Charles Grodin, Robert Redford, Jack Nicholson, Sylvester Stallone, Wallace Shawn and Don Lane.\n\n**Post-production lasted 14 months and all of the animation was made with cel art and optical tricks instead of CGI.\n\n***It's also the last time Mel Blanc would voice Bugs Bunny, Daffy Duck, Porky Pig, Tweety Bird, and Sylvester the Cat.\n\n****You have no idea how badly I want to see Roger Rabbit: The Toon Platoon, a movie where Roger would have entered World War II and met his real father, Bugs Bunny.",
            "review_date": "2021-07-17",
            "source": "rt"
        },
        {
            "content": "As a child I loved the live acton mixed with the cartoons in this fictonal world where all my favorite childhood cartoons were real and lived in a magic land next to Hollywood Called Toontown!\n\nBut as a Horny Gay teen, I loved the sight of The Late Great Bob Hoskins, shirtless! He was what we in the gay community would call a DaddyBear. I didn't even know he was british till I was older and saw him in \"The Long Good Friday\" which I also reccomend to my fellow Hoskins fans out there, but turns out he was a British Bear! Hot!!! \n\nAnd Christopher Lloyd aka (Doc Brown from Back To The Future) is at his Villinous best as \"Judge Doom\" His charater still gives me nightmares!\n\nAlso Jessica Rabbit is a ferice and fabulous creature! (Voiced by Kathleen Turner) I love that one line of her's \"I'm not bad, I'm just drawn that way...\"\n\nThis is a great film for any turner classic movie fans who like those old Bogart movies where he plays a gumshoe! It's your classic 1940s Detective Movie, with a splash of color!",
            "review_date": "2021-07-11",
            "source": "rt"
        },
        {
            "content": "Still holds up after 33 years.",
            "review_date": "2021-06-29",
            "source": "rt"
        },
        {
            "content": "Groundbreakingly clever and a ton of fun.",
            "review_date": "2021-06-11",
            "source": "rt"
        },
        {
            "content": "Loved this film...groundbreaking, hear felt ,and exciting story line, lovable characters.",
            "review_date": "2021-06-03",
            "source": "rt"
        },
        {
            "content": "Cult classic. Entertaining of who done it. Way ahead of its time in the technical aspect of the Physical effects and blending Animation and live-action on-screen.\nFun for the whole family!",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "I absolutely love this movie, Who Framed Roger Rabbit is a freaking classic. Charles Fleischer as Roger Rabbit is the perfect casting. Bob Hoskins is so awesome in this movie. Even the villain, played by Christopher Lloyd Is awesome. I loved the story, the music and even the animated characters. I am going to give Who Framed Roger Rabbit a: A+",
            "review_date": "2021-03-17",
            "source": "rt"
        },
        {
            "content": "This is actually a really good film. Great effects and story!",
            "review_date": "2021-02-12",
            "source": "rt"
        },
        {
            "content": "Lost the number of times I watched this masterpiece as a child.\n\nWas the time to see it in superior image quality.",
            "review_date": "2021-02-02",
            "source": "rt"
        },
        {
            "content": "Still a great movie. Love the way that all cartoons looks really interacting with real people",
            "review_date": "2021-01-27",
            "source": "rt"
        },
        {
            "content": "I love everything about it- the story, the acting, the characters, the screenplay, the humour and the song Why Don't You Do Right.",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "The things that Walt Disney and Amblin Entertainment did to produce \"Who Framed Roger Rabbit\" have still not been matched in more than 30 years.",
            "review_date": "2021-01-04",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is an awesome and unique movie that combines drama, comedy and animation together. I really enjoy this movie from the animation to the performances of Bob Hoskins and Christopher Lloyd. Overall, Who Framed Roger Rabbit really out a ton of effort with every single detail.",
            "review_date": "2020-12-24",
            "source": "rt"
        },
        {
            "content": "I love humans, and I love cartoons, so I really love this movie.",
            "review_date": "2020-12-16",
            "source": "rt"
        },
        {
            "content": "great film, not sure why people made fun of it during production.",
            "review_date": "2020-12-02",
            "source": "rt"
        },
        {
            "content": "Is there a better film?\nSouth Park, and this film are the top of the peak.",
            "review_date": "2020-11-30",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit's mystery is definitely the weakest part of the movie. However, everything else is so expertly crafted (especially the blending of live-action and animated characters) that they more than make up for the mystery.",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "I love this movie so much. It's just so beautiful I want to die.",
            "review_date": "2020-11-18",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is the greatest!",
            "review_date": "2020-11-13",
            "source": "rt"
        },
        {
            "content": "This comedy classic was really good. Bob Hoskins, Christopher Lloyd, Charles Fleischer, Kathleen Turner, and the rest of the cast did a fantastic job in this movie. The plot to the movie was entertaining, thrilling, and goofy. This is the greatest movie with cartoon characters and real people. If you haven't seen this movie yet, check it out sometime. It's a must see.",
            "review_date": "2020-10-30",
            "source": "rt"
        },
        {
            "content": "The perfect animated movie of all times",
            "review_date": "2020-10-05",
            "source": "rt"
        },
        {
            "content": "A unique spin on Hollywood tropes. Everyone should watch this.",
            "review_date": "2020-09-08",
            "source": "rt"
        },
        {
            "content": "As a kid back in 1988 I was already blown away. And now, many years later, I still am.  Hoskins is great and totally immersed in the story. The way Roger interacts and empathises with him is beyond comprehension. Especially when you realise he's just a hand drawn character. The special effects are so flawless that you'll totally forget it's all just smoke and mirror's from the minute till the last.",
            "review_date": "2020-09-02",
            "source": "rt"
        },
        {
            "content": "I dont need to write anything. The movie stands on its own.",
            "review_date": "2020-08-28",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is one of my favorite animated movie the story and animation is great It was funny and made more for adults because of drinking a baby smoking some sexual stuff and language but I love it 10/10",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "Although Roger Rabbit has been a character that the Disney company has almost completely buried and forgotten, for a long time he was an important part of the company and was very well represented within the Disney parks, and this was thanks to this movie. This movie is legendary because it was one of the first movies to combine real actors with cartoons, and the actors in the film were pretty good as well as the animated characters had excellent voices. And although it is not totally for children, I will recommend it forever because I think it is one of the best Disney movies of all time.",
            "review_date": "2020-08-06",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is a brilliant comedy/animated movie, the plot is great and so are the characters. The characters throughout this movie are never boring but they're hilarious even the side characters in this movie are as well. \n\nAlso, I loved the chemistry which Roger Rabbit (Charles Fleischer) and Eddie (Bob Hoskins) have throughout this movie, I thought it was very well built up and their characters are very well developed throughout this movie. \n\nFinally, the villain who is called Judge Doom (Christopher Lloyd) is honestly a fantastically dark villain from start to finish which I really liked. \n\nOverall, it's a brilliant movie. It's a movie which I'd not like to see a reboot of because I think it wont be as good as this one was. \n\nAlso, I liked seeing the different animated cartoon characters throughout this movie swearing at each other especially the part with Donald Duck and Daffy Duck, that's honestly class.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "I'm not sure who the intended audience was but it wasn't me.",
            "review_date": "2020-07-12",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit not only holds up well today, it's still stunning with how good the toons are integrated into the real world. An absolute must see film.",
            "review_date": "2020-06-27",
            "source": "rt"
        },
        {
            "content": "If u grew up on Sandwiches and Rental Movies than you know why..",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit, originated by Gary K. Wolf, directed by Robert Zemeckis, and produced by Walt Disney & Steven Spielberg, was every Looney Tunes & Disney fans dream! The story was loads of fun, but the characters are what really stole the show! Every character had their own appeal, and creative edge, that brought this movie to unbelievable heights. I could've watched all these BRILLIANTLY animated characters do aimless stuff for 3 hours, never mind watching a decently structured movie for an hour and fourty minutes.\n\nThe screenplay by Jeffery Price, Peter S. Seaman & Gary K. Wolf was appealing to all ages. Though this movie was super silly, and over the top, it had somewhat of a structure due to the witty, yet humorous script.\n\nFor a 1988 movie, this film was so colorful, and visually beautiful! The cinematography, animations, & effects won two Academy Awards for Best Visual Effects & Best Film Editing. The art directors did a fantastic job of blending the animated characters, to the real people, with the addition of the silly props.\n\nOverall, if you love the Looney Tunes & Disney characters, this movie is right up your alley, and a must watch!",
            "review_date": "2020-06-17",
            "source": "rt"
        },
        {
            "content": "I have probably watched roger rabbit over 15 times because of amazing ness this movie is. Of course in a review you never want bias and I usually never try but today is the day my rule is broken, I am personally a sucker for 2d/rubber hose animation, so naturally this movie gave me chills of joy! Not only are the characters so unapologetically cartoony, but the actors fit the 1940s noire to a T. And although fitting except movie tropes may be bad this movie knocks it out of the park. Definitely my favorite Disney movie of all time and one of my all time tops",
            "review_date": "2020-05-22",
            "source": "rt"
        },
        {
            "content": "I watched this many times as a kid, and recently it was a pleasure to rewatch it with my 10 year old daughter.  It's exceedingly well done between the live action and the classic looking animation.  The special effects are excellent.  As I was watching, I made the observation that aspects of the directing and musical score were reminding me of Back to the Future.  I was then surprised to find out that this was directed by Robert Zemeckis, the man who directed Back to the Future.  I even think there's a scene that was filmed in the same exact location.  There's also no doubt that Christopher Lloyd's presence also created a feeling of familiarity.   In any case, this is still very entertaining and has held up really well over the time since it was made.  I'd say that in its own right, this is certainly a masterpiece.",
            "review_date": "2020-05-18",
            "source": "rt"
        },
        {
            "content": "A fantastic animation classic.",
            "review_date": "2020-05-12",
            "source": "rt"
        },
        {
            "content": "If you like classic cartoons and detective movies, then you will love this one. After all it is a Robert Zemeckis film. This movie will forever be a great one and even after all these years, it still holds up well. I don't see it fading away from movie pop culture.",
            "review_date": "2020-05-11",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is more than just a technical marvel, as it seamlessly blends live action with animation in a way that stands far above any other attempt. It's also an engaging story with iconic characters. Despite the goofy premise, this film has a heart and a sense of realism. If you haven't seen this one yet, give it a chance, p-p-p-please?",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "A groundbreaking, imaginative and entertaining film, with a revolutionary mix of live-action and animation, well done pop culture references, and a funny and charming story.",
            "review_date": "2020-05-07",
            "source": "rt"
        },
        {
            "content": "In un mondo dove gli esseri umani convivono con i cartoni animati, il coniglio Roger Rabbit viene accusato di aver ucciso il presunto amante della moglie, cantante procace e seducente. Lui si rivolge all'agente Valiant. Sotto certi punti di vista il film Ã¨ geniale e rivoluzionario e affascina subito per la sua storia intrigante da noir. Rimane una pietra miliare e un capolavoro. Non si dimenticheranno mai le forme di Jessica Rabbit.",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "Not only is it hilarious in it's primary story, as well as revolutionary animation and compelling and funny characters, but it's also filled with absolutely hilarious moments with our favorite animated shows, making Roger Rabbit  the best Animated movie of the 80s",
            "review_date": "2020-04-09",
            "source": "rt"
        },
        {
            "content": "This movie is pretty solid and its fun",
            "review_date": "2020-04-03",
            "source": "rt"
        },
        {
            "content": "Used to have this on VHS as a kid.  Loved it.",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "beautiful film and a lot of fun that can be watched by everyone but in my opinion it is especially for adults and teens more than for children, because they are faced with so many themes that are not much for children, despite this the film is very enjoyable by everyone becausethere's comedy a bit for all ages",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "Innovative in it's time and still holds up to today entertaining with an excellent cast",
            "review_date": "2020-02-25",
            "source": "rt"
        },
        {
            "content": "Lots of fun and super entertaining in a movie that isnâ€™t afraid to push its pg rating with a hefty amount of adult jokes and a touching story.",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "This movie is a classic. I rewatched this a couple years ago and it still holds up very well. The characters are memorable and the story is well thought out.",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "For the time it was the most amazing special effects I'd ever seen.   It was a blast to watch.   We still watch it once a year.   Our daughter watched it for the first time about 8 years ago and she was amazed.   Good movie.",
            "review_date": "2020-02-12",
            "source": "rt"
        },
        {
            "content": "Great classic !!!!! This is a funny action comedy crime that you can watch over and over again throughout the years you will laugh every time....ðŸ˜‚",
            "review_date": "2020-01-07",
            "source": "rt"
        },
        {
            "content": "Though the character personalities can waver back and forth in annoyance, it works out in the end with the charisma that is the pioneering animation within live action.",
            "review_date": "2019-12-27",
            "source": "rt"
        },
        {
            "content": "Loved this movie!!!!",
            "review_date": "2019-12-24",
            "source": "rt"
        },
        {
            "content": "Simply put, Who framed Roger Rabbit is not only one of the best films ever made, but a shining example of what hollywood can achieve when it gets out of its own way and creates.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "I was hesitant to watch this movie at first, but when I did I wasn't disappointed. The toon like coloring matched surprisingly well with the noir mystery setting. The acting was great and hilarious, with Christopher Loyd playing a menacing villain.",
            "review_date": "2019-11-24",
            "source": "rt"
        },
        {
            "content": "The mix of live action and animation was groundbreaking and the performances were exceptional. The plot is good and the nostalgia factor is a thing of beauty.",
            "review_date": "2019-11-13",
            "source": "rt"
        },
        {
            "content": "This is a great movie. Man. I miss Disney's old classics back then. Now Disney makes live action Remakes which their Remakes are awful. ",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "One of the greatest films every made. The directing, writing and visual effects are superb. Not many films these days take note of all the techniques Rodger Rabbit perfected. 5 stars aren't enough for this masterpiece, watch it if you haven't yet",
            "review_date": "2019-09-23",
            "source": "rt"
        },
        {
            "content": "Extremely fun. Blends together two completely different genres of film with surprisingly well done special effects.",
            "review_date": "2019-09-11",
            "source": "rt"
        },
        {
            "content": "Amazing movie for its time and still a great movie to watch.",
            "review_date": "2019-08-25",
            "source": "rt"
        },
        {
            "content": "Even though this movie is more than 30 years old, it's still one of the greatest movies of all time, with an original story with twists that nobody would ever see coming.",
            "review_date": "2019-08-20",
            "source": "rt"
        },
        {
            "content": "Highly entertaining movie filled with wild toons doing crazy things. The story was interesting and its awesome to see both looney tunes and Disney characters on the big screen at the same time. ",
            "review_date": "2019-08-19",
            "source": "rt"
        },
        {
            "content": "Its an original idea that had great scenes, and believable characters. The movie took a lot of risks that paid off in the end. Very imaginative and very well written.",
            "review_date": "2019-07-13",
            "source": "rt"
        },
        {
            "content": "A film well ahead of its time with some superb live action animation sequences mixed in with real-time performances. The script and dialogue are a little bit sloppy at times but keep a look out for some familiar animated stars throughout.",
            "review_date": "2019-07-09",
            "source": "rt"
        },
        {
            "content": "lying bunny silly loony bunnies",
            "review_date": "2019-06-01",
            "source": "rt"
        },
        {
            "content": "This cult classic might not have aged as well as I would have liked, but it's still a good movie to see once in a lifetime.",
            "review_date": "2019-04-20",
            "source": "rt"
        },
        {
            "content": "Quien engaÃƒÂ±o a Rogger Rabbit es la vision innovadora de un Robert Zemeckis arriesgado e increiblemente perfeccionista, la entretenida historia recreada en Live accion animada hace que este magnifico clasico sea una propuesta innovadora para la historia del cine animado.",
            "review_date": "2019-03-11",
            "source": "rt"
        },
        {
            "content": "Likable characters, and blend of animation and live action that still amazes today, Roger Rabbit is a classic family film any and all generations should see.",
            "review_date": "2019-02-12",
            "source": "rt"
        },
        {
            "content": "A rare time where you will see Mickey Mouse and Bugs Bunny grace the screen together is a hilarious film that holds up to this day. Well the technology doesn't hold up as well given the vast improvements  over the decades but it is still  a testament to live action mixed with animation.",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "The best fantasy comedy movie ever made! With the best movie quote ever spoken: \"I'm not bad. I'm just drawn that way.\"",
            "review_date": "2019-01-26",
            "source": "rt"
        },
        {
            "content": "Not a movie for young children at all. Not appropriate.",
            "review_date": "2019-01-21",
            "source": "rt"
        },
        {
            "content": "Toons and life action meet in a way not even CGI does right sometimes!\nClearly standing out in an era that had animation movies struggling, it's adult enough to be properly enjoyed by all audiences, and it tugs all the right nostalgia strings to spark a longing for old-school animation.\nThere's a death, danger, a goofball, a bitter detective and one of the most curvy and seductive leading lady's ever to have been \"drawn that way\", so what's not to love?",
            "review_date": "2019-01-20",
            "source": "rt"
        },
        {
            "content": "Groundbreaking film, not only for the incredibly well made mix of animation and live action but for a great story behind it.",
            "review_date": "2018-12-24",
            "source": "rt"
        },
        {
            "content": "Classic from Disney the is unique, funny, and even creepy (thanks to Judge Doom).",
            "review_date": "2018-10-25",
            "source": "rt"
        },
        {
            "content": "Well acted, creatively original, and best of all beautifully animated! Who Framed Roger Rabbit is a true classic to those who admire the golden age of animation. From Robert Zemeckis great directing, to Richard Williams amazing animation, This film is truly a ground-breaking masterpiece.",
            "review_date": "2018-10-15",
            "source": "rt"
        },
        {
            "content": "Was laughing too hard and I thought it was kind of like a kid movie.... ðŸ˜‚",
            "review_date": "2018-09-10",
            "source": "rt"
        },
        {
            "content": "It's been around so long now,  it's hard to appreciate how groundbreaking it was on first release. I remember being blown away by it. \n\nIt's stood the test of time for me. It doesn't awe me anymore, but it still makes me smile.",
            "review_date": "2018-09-01",
            "source": "rt"
        },
        {
            "content": "it was very traumatizing for our brains to mix movie and cartoon...",
            "review_date": "2018-08-24",
            "source": "rt"
        },
        {
            "content": "Best Movie Looney Toons And Disney Characters and real world all in one",
            "review_date": "2018-08-12",
            "source": "rt"
        },
        {
            "content": "Saw this movie 20 years ago and it sucked",
            "review_date": "2018-07-12",
            "source": "rt"
        },
        {
            "content": "I found the film funny and entertaining",
            "review_date": "2018-07-08",
            "source": "rt"
        },
        {
            "content": "This Is A Well Made Interesting, Fun, Funny Movie. It Deserved The attention It Had Got. If You Have Free Time Go See This Movie.",
            "review_date": "2018-06-30",
            "source": "rt"
        },
        {
            "content": "This is a great movie from the start. Iâ€™m still a little shocked how they havenâ€™t changed the rating to PG-13 yet but this is still an absolute masterpiece with all the characters being memorable and lovable, the story being clever, and the chemistry between the cartoon and live action characters makes it feel like the cartoon characters are actually there! I recommend this to ANYONE 10 or older because this is a MUST watch! But it may not be suitable for anyone younger then 10 or 11.",
            "review_date": "2018-06-30",
            "source": "rt"
        },
        {
            "content": "Groundbreaking Animation and Visual Effects, Every Toon is Represented in their Truest form, Deep Character Moments that resonate, Instantly memorable lines, A true Masterpeice of Filmmaking.",
            "review_date": "2018-05-19",
            "source": "rt"
        },
        {
            "content": "The greatest crossover of all time, I loved the complex story, and I just enjoyed it all the way through",
            "review_date": "2018-03-24",
            "source": "rt"
        },
        {
            "content": "I could watch this movie 100th times, and never get tired of it.",
            "review_date": "2018-03-18",
            "source": "rt"
        },
        {
            "content": "Mickey Mouse & Bugs Bunny appear on screen together & speak to one and other. Nuff said.",
            "review_date": "2018-03-07",
            "source": "rt"
        },
        {
            "content": "Visually fun and whacked out loud, this frantic (and decidedly not kid-friendly) post-war Hollywood noir gets points for innovation, but not from characters and a plot that are just plain silly (appropriately enough).",
            "review_date": "2018-03-05",
            "source": "rt"
        },
        {
            "content": "A  Very Very Good Movie A Masterpiece",
            "review_date": "2018-02-19",
            "source": "rt"
        },
        {
            "content": "In interesting tale and the first i know of to brink Toons and Humans into the same world.",
            "review_date": "2018-02-13",
            "source": "rt"
        },
        {
            "content": "one of the worst movies i have ever seen",
            "review_date": "2018-01-07",
            "source": "rt"
        },
        {
            "content": "One of my all time favorite movies ever made. I love the mix of live-action and animation. Who Framed Roger Rabbit is extremely funny and entertaining. The writing and story were fantastic. The acting performances and voice over performances were stupendous especially Bob Hoskins, Charles Fleischer, Kathleen Turner, Christopher Lloyd, and Joanna Cassidy. Also the animation and visual effects were spectacular.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit: With geoundbreaking special effects and a grand refreshing story, Who Framed Roger Rabbit is a top notch classic, that has enough charm and style to sometimes over compinate its cartoonish antics.",
            "review_date": "2017-11-25",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit, directed by Robert Zemeckis, is a lighthearted semi-animated family film. What it lacks in story development, it compensates for with its upbeat energy and colorful--at the time, groundbreaking--animation, forming a better than average, entertaining watch. Set in the late 1940s, Who Framed Roger Rabbit takes place in a universe where cartoon characters live in the live action world, residing in Toon Town. Detective Eddie Valiant, a human character played by Bob Hoskins, searches for clues behind the murder of Toon Townâ€™s owner, Marvin Acme. Because his wife is photographed playing pattycake with Acme (which in the film is considered an affair), Roger Rabbit is the main suspect. Knowing Roger is innocent and that Judge Doom, the obvious villain, is up to no good, an adventure pursues to save Roger and the entire toon race. The film, while enjoyable, is not without its flaws though. The tone and genre of the film is still a mystery to me. Jokes that suggest pattycake is sex make the film seem like a pure kids film with lots of innuendos. But the violence and language used at other times makes it seem more like an satire for adults. Despite its PG rating, Valiant literally says â€œson of a bitchâ€ at one point. In that, itâ€™s a little confusing who the intended target audience was. On a separate note, the story was very predictable. Things are set up without any subtlety and it sort of takes the fun out it every now and then. For example, at the beginning of the movie, it is very clear that Valiant hates toons. His backstory and reasoning behind this could have made his character more unpredictable. But within the first 10 minutes of screentime, a side character explains that his brother was killed by a toon only for another scene 10 minutes later to tell us the same thing only for yet another scene 40 minutes later to say the same thing yet again. If the first two instances, or at least the first, were taken out, his character arc would be a little more interesting. Also, his prejudice against toons would have been much more effective if they were shown, once again, in more subtle ways like when he gets defensive about associating himself with them. But instead, he spends the first half of the movie making forced, snarky remarks about toons to himself. As a result, watching his transformation is just more boring and unbelievable. There is honestly almost nothing that shows Valiant and Roger actually bonding. And there is genuinely no motivation or lead up for him quitting alcohol. He just looks at his bottle toward the end and without any influences from others in the entire duration of the film, decides to pour it all out. Again, if this really is a kids film, perhaps Iâ€™m being a little too critical. Regardless, I am disappointed with the film considering how much praise it got. Nonetheless, Who Framed Roger Rabbit is harmless. The summation of itâ€™s flaws is not what it did, but what it could have easily done better. But for most audiences, the film will be an easy-to-please, feel good experience.",
            "review_date": "2017-11-16",
            "source": "rt"
        },
        {
            "content": "Love this movie always a classic",
            "review_date": "2017-09-17",
            "source": "rt"
        },
        {
            "content": "What can one say I loved this movie especially when they entered Toonland, chased by the evil cartoon.  But I do not want to say anymore except\n\"Pattycakes Pattycakes Pattycakes....",
            "review_date": "2017-08-14",
            "source": "rt"
        },
        {
            "content": "While not being exactly being the deepest Disney film, this film takes you on a ride and is enjoyable from beginning to end.",
            "review_date": "2017-08-10",
            "source": "rt"
        },
        {
            "content": "This is one of the best animated films of all time. with animation and acting that makes it look real and great story everyone should go see this fun movie.",
            "review_date": "2017-08-07",
            "source": "rt"
        },
        {
            "content": "It's hard to say what I love most about \"Roger Rabbit\"-is it the deconstruction of film noir, the genre's usual chiaroscuro replaced here with the brightest color palette possible? is it the pungent critique of suburban sprawl and the acceleration of pedestrian life? For all its sophistication as a work of nostalgia and technical achievement, what stands out most still today is simply Jessica Rabbit, the femme fatale drawn to be drawn to.",
            "review_date": "2017-07-21",
            "source": "rt"
        },
        {
            "content": "One of my favorites, a movie that wasn't aware of its own comic / cartoon limitations and became the most compelling murder mystery of the late 1980s, not to mention a satire, a visual effects masterpiece and a great comedic peak of the 20th century.  Personal favorites?  Hard to choose from between Christopher Lloyd going against type and playing a ghoul, Jessica Rabbit's uncomfortably sexy moments that made you second guess what the hell you were watching, and just the nostalgic novelty of watching \"retired\" cartoon characters update you on the continuing saga of their lives.  It's hard to find a movie that's both a sentimental favorite, as a proverbial child looking forward to Saturday morning cartoons, as well as a movie that's nuanced enough for adults.  The fact that you forget the technical wizardly within minutes of the credits, it's an ode to Zemeckis' talent.",
            "review_date": "2017-07-12",
            "source": "rt"
        },
        {
            "content": "Well animated, funny, and well acted, Who Framed Roger Rabbit? has aged like fine wine.",
            "review_date": "2017-06-23",
            "source": "rt"
        },
        {
            "content": "The originality of this movie alone make it worth the watch.",
            "review_date": "2017-06-19",
            "source": "rt"
        },
        {
            "content": "Love this movie. There really hasn't been another movie like it. Still holds up in 2017",
            "review_date": "2017-05-14",
            "source": "rt"
        },
        {
            "content": "10 out of 10:\n\nSmart, funny, fast paced, and a great way to bring animation to the live action world, Who Framed Roger Rabbit still remains as an influential film that inspired others to make their own versions.",
            "review_date": "2017-05-13",
            "source": "rt"
        },
        {
            "content": "Honk! Honk!  Here comes Benny the Cab, we're racing through ToonTown -- along the way is Mickey, Goofy, Donald, Daffy, Bugs, Pepe, Yosemite, Dwarves, Dumbo, Broomsticks, and so many more.  For the first time ever, we're seeing Disney and Warner Brothers characters in the same film, and oh my what a funtastic treat more delectable than a bowl of colorful sweet candy.  Also, though not the first time, we are seeing the most sophisticated blend of live action and cell animation, the likes of which Gene Kelly and Jerry, or Pete's Dragon couldn't dream of.  \r\n\r\nThe film happens to be about a conflict between toons and humans, a slight allegory to racial tensions amongst people.  A toon, legendary film actor Roger Rabbit, is accused of killing a person -  that's about as sensitive as a black man killing a white woman.  Private Investigator Eddie Valiant is tasked with the job of finding out whether or not any of it is true.  A conspiracy against Rabbit begins to unveil that has us suspecting several players, including his wife Jessica, and the man who tasked Valiant to begin with.  But it's clear there's one man in town who hates toons above all else, Christopher Lloyd's phony toothed, wild eyed Judge Doom.\r\n\r\nThe film maintains consistent whimsicality, even with darker story points, like Eddie's dead brother killed by a falling piano!  Jokes about extramarital affairs are treated not with sex, but a game of Patty Cake, which has Roger bawling in despair.  Yet there's no shortage of sexuality either; Jessica Rabbit is the ultimate cartoon sex symbol.  One memory that stuck out in the long span between viewings was the violent third act in which Doom gets flattened by a cement roller, only to reveal he can outlandishly pump himself back up - then we see those crazy googly eyes, and we learn he's been a toon all along, the \"I hate my own kind\" villain.  Again, everything is done with a slapstick sense of humor so that violence amongst humans looks similar to a cartoon.\r\n\r\nAlong the way we're treated to delightful cross-promotional pairings, such as Daffy and Donald Duck on the dueling pianos, or Mickey Mouse and Bugs Bunny sky diving beside free-falling Valiant.  Most of the famous voice actors are reprising their roles, including the legendary Mel Blanc (Daffy, Tweety, Bugs, Sylvester, Porky), credited with 1,142 works, just one year before his death.  Nobody is dancing around the rights here, we feel the total authenticity of these characters, thanks in part to Steven Spielberg's solid communication with Warner.  It's as special as seeing any great ensemble cast, which is pretty incredible when you think that only our imagination makes them real.  The end ensemble of the cartoon universe is very special for any enthusiast.  To some it will just be a bunch of drawn up nonsense, to others it's a symbol of unity and breaking the borders of ownership.",
            "review_date": "2017-05-03",
            "source": "rt"
        },
        {
            "content": "Time to suspend your disbelief and take a wild and wonderful ride into a world of superbly blended cartoon animation and live action that is a joy from start to finish.",
            "review_date": "2017-04-11",
            "source": "rt"
        },
        {
            "content": "This is a really good movie and at the same time classical",
            "review_date": "2017-04-01",
            "source": "rt"
        },
        {
            "content": "Where else can you see 2 ducks duel on pianos.",
            "review_date": "2017-03-30",
            "source": "rt"
        },
        {
            "content": "Wonderfully done animation at the beginning. Makes me want to watch Pinky and the Brain for some reason. Miss those 90's cartoons. I love the combination of real life actors and cartoons. Haven't really seen done like this. I love the set designs and how particular each location looks like.\n\nThe concept of cartoons living and breathing in the same world as humans is very interesting. It makes for a lot of creative ideas. Jessica Rabbit is one hot fox. That judge in the black gown, is one vicious dude.\n\nIt's kind of an interesting little dark skit when the bullets tell Valiant they haven't seen him in 5 years. I take this as he might've wanted to kill himself at one point.\n\nOnce he goes into Toon Town, things start getting a little bit more interesting.",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "A great family comedy, which is still fantastic to watch today. I'm still waiting for the sequels to come or more films featuring Roger Rabbit  with his \"P-p-please\".",
            "review_date": "2017-02-25",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is a film that blends elements of mystery and humour with excellent results. An alcoholic detective who doesn't work for anthropomorphic cartoons after one killed his brother who has to find the man who killed a famous inventor and prove the innocence of a rabbit who is the no. 1 suspect because of his poor acting fearing that his wife was having an affair and killing the guy as a result. Sounds like a complex story, right? Actually, it's pretty easy to follow for kids ages 8 and up. The mix of live action and animation is pretty groundbreaking and actually seems to have been able to stand the test of time. Bob Hoskins pulls off a great performance as Eddie Valiant, Christopher Lloyd makes for an appropriately sinister villain and the titular character will entertain the kiddies. Oh, and let's not forget the seductiveness of Jessica Rabbit. Come on, you probably had a \"thing\" for her before. Robert Zemeckis did a bang up job of this and to this day remains a classic that will be remembered for its technical innovation.",
            "review_date": "2017-02-21",
            "source": "rt"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-02-18",
            "source": "rt"
        },
        {
            "content": "Genius idea for a movie and genius movie, funny and clever all in one.",
            "review_date": "2016-12-19",
            "source": "rt"
        },
        {
            "content": "Il film si presenta come un perfetto noir ambientato a fine anni '40. Il secondo motivo di interesse, e che rende unico questa pellicola, Ã¨ la commistione tra personaggi reali e cartoni animati.\nIl film gira bene e secondo me Ã¨ un film da vedere.",
            "review_date": "2016-12-09",
            "source": "rt"
        },
        {
            "content": "Way before it's time another classic.",
            "review_date": "2016-11-18",
            "source": "rt"
        },
        {
            "content": "A truly good movie, really memorable characters and an irresistible charm in this sort of nostalgic flick, where Disney, Warner Bros. and other toons do amazingly funny crossovers! This is a movie to see!",
            "review_date": "2016-11-12",
            "source": "rt"
        },
        {
            "content": "A classic film that I have never seen, until now.  I can see why it is one of Bob Hoskins's best roles and why it was so groundbreaking at the time.  Well written, funny and deserving of the praise.",
            "review_date": "2016-11-06",
            "source": "rt"
        },
        {
            "content": "I don't think I have seen this movie since college. I thought it was a bit of a disappointment when released. The first 2/3 of the movie is better than I remember. It kind of falls apart in the last 1/3, imo. Bob Hoskins is great though.",
            "review_date": "2016-11-05",
            "source": "rt"
        },
        {
            "content": "An incredibly well animated, acted, written comedy with an intriguing, silly, story that'll keep you entertained throughout. A must watch.",
            "review_date": "2016-10-18",
            "source": "rt"
        },
        {
            "content": "This movie's remarkable.",
            "review_date": "2016-10-03",
            "source": "rt"
        },
        {
            "content": "Bizarrely entertaining. Who thought mixing and matching like this can actually be interesting?",
            "review_date": "2016-09-10",
            "source": "rt"
        },
        {
            "content": "it has literally everything - good acting, good animation, interesting story, good for all ages. AMAZING",
            "review_date": "2016-09-08",
            "source": "rt"
        },
        {
            "content": "This movie to me makes perfect sense and has a wonderful story line, I also have to give this movie an A+ for it's special effects because adding in all of the cartoon characters and interactions and effects could not have been easy but this movie made it seem so real, beginning to end this movie captured my interest with all of its characters both human and animated being played amazingly.",
            "review_date": "2016-09-06",
            "source": "rt"
        },
        {
            "content": "From beginning to end, this is nothing less than a fantastic movie. The characters are great, the story is fun and exciting, the visuals still hold up extremely well to this day, and the film's universe is a brilliant one. It's just a perfect movie that should come highly recommended for anyone.",
            "review_date": "2016-08-14",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit blends the humans and cartoon characters wonderfully!",
            "review_date": "2016-07-27",
            "source": "rt"
        },
        {
            "content": "Movie is very forgettable.",
            "review_date": "2016-07-14",
            "source": "rt"
        },
        {
            "content": "Creative and imaginative and a it also shows a bit more on the adult side of a cartoon, which also makes it hilarious.",
            "review_date": "2016-07-07",
            "source": "rt"
        },
        {
            "content": "Best animated film ever!",
            "review_date": "2016-06-17",
            "source": "rt"
        },
        {
            "content": "One of the most influential films ever made, in my opinion, 'Roger Rabbit' cleverly blends live-action and animation. Even though the mixing of actors with animated characters has been done before this, the movie was a great technical achievement, along with the first 'Toy Story', which was released seven years later.",
            "review_date": "2016-06-08",
            "source": "rt"
        },
        {
            "content": "With groundbreaking animation and amazing visuals, Who Framed Roger Rabbit is hugely creative, fun and funny comedy neo-noir animation movie and one of the greatest animations of all time.",
            "review_date": "2016-06-05",
            "source": "rt"
        },
        {
            "content": "I just don't like this kind of blend but this movie should take credit for being the first one to try it. Robert Zemeciks is a director who always dare to step into an unknown territories. He was also the first to use motion capture in movies in \"The Polar Express\". And lately he recreated New York city his 3D feature \"The Walk\".\nThis movie had some good ideas and interaction between its characters but the framework in which everything occurs is simply inappropriate. It should be a family-friendly movie as it contained animation and would be viewed by younger audience no matter what the rating was but the story contained implication of sex, consuming alcohol and smoking cigarettes. Not to mention the detective/ murder story line in which it was wrapped with. Jessica was a character created to diminish females and sexualize their bodies. Not even suitable to be viewed by adults for instance. I really do not understand how such a movie could simply get an PG rating unless there is a preconceived plan to create a horny, ill mannered new generation.",
            "review_date": "2016-05-05",
            "source": "rt"
        },
        {
            "content": "Groundbreaking, innovative, and supremely entertaining. My favorite film of all time.",
            "review_date": "2016-05-03",
            "source": "rt"
        },
        {
            "content": "An investigator must solve a murder in a world where cartoon characters live among humans. This classic is a throwback to the days of Dick Tracy type characters.",
            "review_date": "2016-04-27",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is a truly remarkable film that was both way ahead of its time and strongly reminiscent of films from our past. Every time I watch this movie I marvel at how well they blend the cartoon animation with the live action. Yes, you can see the disconnect between the two if you're analyzing it closely, but the movie is so entertaining you kind of forget. Also the cast of actors are so good that you genuinely feel there's someone there when they are really just talking with thin air. Then there's the story which feels like it was plucked straight out of a classic film noir. There's a private detective who takes a case that results in murder, he suspects a femme fatale, and has to piece together the clues before his client gets murdered as well. Honestly, if you take away the living cartoons you could almost see Humphrey Bogart starring in this thing. Speaking of which, Bob Hoskins is delightful in the lead role. I think he does a good job of displaying anger and frustration with his life, and his interactions with Roger are great. I love Christopher Lloyd as Judge Doom also, but I kind of wish his performance was a little more subtle because he is so obviously evil from his very first moment on screen that you kind of feel like he's up to something from the beginning. Luckily there are still surprises that get revealed in the end so it never mattered all that much to me. I think the only real problem I ever had with this movie is that the cartoons give the illusion that this might be a kids movie, so I saw it when it first came out and I was still a bit young for that. Between the adult themes that permeate most of the film, and the scary ending I was terrified. But for adults I think Who Framed Roger Rabbit is a winner that still holds up well today.",
            "review_date": "2016-04-19",
            "source": "rt"
        },
        {
            "content": "Technical marvel that was ahead of its time. A movie masterpiece. Bob Hoskins and Christopher Loyd are brilliant.",
            "review_date": "2016-03-27",
            "source": "rt"
        },
        {
            "content": "Well scripted, well plotted, well acted. What's there not to like? Redolent of the California of the late '40s, which also inspired \"Devil in a Blue Dress\" and \"True Confessions.\"",
            "review_date": "2016-03-25",
            "source": "rt"
        },
        {
            "content": "Pretty genius filmmaking for it's time, with the mix of animation and real world and real actors.  The storyline and humor aren't the greatest, but the nostalgia factor, seeing Disney and other famous cartoon characters throughout, in a rather risquÃ© film (comparatively speaking, of course, to the cartoons themselves), is nice to see.  One of the more classic 80's flicks.",
            "review_date": "2016-03-24",
            "source": "rt"
        },
        {
            "content": "A charming film noir with dazzling visuals",
            "review_date": "2016-03-06",
            "source": "rt"
        },
        {
            "content": "I didn't see this 1980s movie during its original release when I was a child, so I don't have the same nostalgic feelings towards it many reviewers may have.  However, seeing it now for the first time, I think it holds up pretty well.  It takes place in the 1940s and does an amazing job of imagining a world where real people and cartoons live side by side.  It's even more impressive considering how much work was put into a film like this that came before computer animation.  It's strange to think there probably won't be a film like this ever again.  \nThere are cameos galore of numerous old school cartoons.  I didn't realize this was the one and only time Disney and WB characters have appeared together on screen.  Bob Hoskins's character is a good point of view character for the average viewer.  He's a little cynical of the cartoon characters (and they clearly can be grating at times, especially Roger Rabbit himself), but he comes to accept and care for them as the story progresses.  I don't think the film is for everyone, but if you're a lover of old school films and cartoons, I think you'll find something to love here.",
            "review_date": "2016-03-06",
            "source": "rt"
        },
        {
            "content": "UPDATE 4/22/16 A breakthrough in animation and visual effects of it's time. But now, it is a bland, predictable buddy-cop movie with a bouncing, ear-piercing Bugs Bunny/Daffy Duck clone. \n\nI'm sorry, I know people love this movie and it has a place in movie history, but I just couldn't get into this film. I thought the Roger Rabbit character was irritating, I couldn't stand him at times. And the whole \"cartoon\" aspect was hammered down, just like Almost Famous. I know this film was made for a younger audience, but it could have been more twists and turns to make the movie stand out from every other buddy-cop film on Earth.\n\nDespite the flaws, this movie isn't awful, it just wasn't that good. And it does have bright moments, even from Roger occasionally. Most of the live-action actors did a good job, like Bob Hoskins and Christopher Lloyd. And the blending of 2-D animation and live-action is glorious, and like I said, a vital piece of both film and animation history.\n\nI said it once, I'll say it again, Cool World is the better flick.",
            "review_date": "2016-02-20",
            "source": "rt"
        },
        {
            "content": "A technological wonder. But also, funny, smart, well-scripted and acted. Overall, an impressive contribution to film-making.",
            "review_date": "2016-02-08",
            "source": "rt"
        },
        {
            "content": "A brilliant contribution to animated - and non-animated - film-making. An impressive technological achievement, brilliantly funny, smart and actually moving.",
            "review_date": "2016-02-08",
            "source": "rt"
        },
        {
            "content": "This movie is great. From the amazing acting on Bob Hoskins part to the bizarreness of the setting, as well as, well ALL of the toons involved, it works up to be an visually stunning epic adventure.",
            "review_date": "2016-01-28",
            "source": "rt"
        },
        {
            "content": "It's really awesome seeing my childhood together in a noire style",
            "review_date": "2016-01-27",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is an innovator movie in cinema's industry, but despite its originality this movie suffers from a predictable narrative and boredom.",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is an innovator movie in cinema's industry, but despite its originality this movie suffers from a predictable narrative and boredom.",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "This was my first proper watch of 'Who Framed Roger Rabbit?' start to finish and now I fully appreciate why it is considered a classic. Despite having already seen 'Space Jam' countless times, the interaction between live-action and animation still amazed while the constant loony behaviour on show will spark fond memories that take you back to the glory days of cartoons.",
            "review_date": "2015-12-21",
            "source": "rt"
        },
        {
            "content": "Would this be the only time where golden cartoons meet together? For now, yes. Might as well just take the ride to the cartoon world instead of just waiting on ahead.",
            "review_date": "2015-12-18",
            "source": "rt"
        },
        {
            "content": "An innovative mix of live action and animation that is fun and imaginative, but it's too zany and chaotic for my taste. I love the adult humor and the climactic set piece is a lot of fun. Of all the human actors in the film, the one that's having the most fun is Christopher Lloyd, playing a sinister villain that reminisces the main villain from Raiders of the Lost Ark. Who Framed Roger Rabbit is often too frenetic, but it never loses its sense of fun at any point.",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "I've always loved this movie \nBrings back the kid in me lol",
            "review_date": "2015-10-24",
            "source": "rt"
        },
        {
            "content": "Amazing combination of 2D animation and reality filming. This one is easily the best out of those kinds of movies out there that I know of (the only other one being Space Jam). Well directed, a great cast of people animated and real, a good overall look/attitude that doesn't feel much like a childish \"cartoon\", and an in-depth and complex story for a film about a rabbit from Toon Town. Disney and Looney Toon fans rejoice, as this is what I would consider a one hit wonder that happens to also include Spielberg in the making. The drawn out characters in real life settings were expertly done especially with the lighting and the shadowing. When it comes to putting animated characters in a real life world and vise versa in an interesting and engaging story, Who Framed Roger Rabbit is a gold mine of that type of genre such that it exists. I'm actually quite surprised that there isn't really any other movie like this one aside from Space Jam. This flick shall remain a rather large classic for 2D animation fans and for the people who just love animation in general in just about any time zone (like myself). There's nothing non-eye-catching about it for the most part.",
            "review_date": "2015-10-22",
            "source": "rt"
        },
        {
            "content": "Smart, funny and highly entertaining. Who Framed Roger Rabbit is a great and innovative combination of mystery, comedy and fantasy with Bob Hoskins at his very finest",
            "review_date": "2015-09-12",
            "source": "rt"
        },
        {
            "content": "really funny movie from 1988 that has some of the best visual effects of yesteryear and i think that this movie is really funny, Roger Rabbit is hilarious!\nWho Farmed Roger Rabbit? gets an A",
            "review_date": "2015-09-10",
            "source": "rt"
        },
        {
            "content": "I love Jessica Rabbit and the mish mash of characters. I watch it from time to time on Bluray. I thought it's a valuable addition to my collection.",
            "review_date": "2015-09-01",
            "source": "rt"
        },
        {
            "content": "This is such a classic movie and it is all because of Robert Zemeckis, who I believe is without a doubt one of the all time best story tellers of all time; and that is what makes him an amazing director. The man behind such acclaimed films such as \"Forrest Gump,\" and \"Flight,\" really has outdone himself with this instant classic of a movie. Bob Hoskins is great in his most memorable role as private eye Eddie Valiant. There are moments I thought because of his performance that I wondered if they ever offered the role of Eddie Valiant to Robert DeNiro because I think he would of been incredible in the role, but I guess because of the money they probably used for the animation, they probably couldn't afford  him being the very demand able and talented actor DeNiro is, but either way, Hoskins does a very fine job in the movie. But for me the real draw is Christopher Lloyd as Judge Doom who I think should have been nominated for best supporting actor for his performance because it takes a real intense and authentic type actor like Lloyd to pull off such a terrifying and yet intense performance. But of course we all know that Roger Rabbit is really the star of this movie as he is the one who really brings in the laughs for this movie and whether your a comedy guy or not, you gotta admit...this is one damn entertaining movie.",
            "review_date": "2015-08-13",
            "source": "rt"
        },
        {
            "content": "A timeless classic, even though Jessica's knockers are a bit distracting in some of the scenes!",
            "review_date": "2015-08-07",
            "source": "rt"
        },
        {
            "content": "Absolutely Brilliant.",
            "review_date": "2015-07-30",
            "source": "rt"
        },
        {
            "content": "Another no brainer 5 star motion picture. Such an amazing movie for its time.  You're almost thankful they never tainted the legacy of this movie with a tepid sequel. Robert Zemeckis really knocked this one out of the park and just think of all the cartoon porn he created with Jessica Rabbit?",
            "review_date": "2015-07-20",
            "source": "rt"
        },
        {
            "content": "I gave this movie a A",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "Cartoons were never that relatable until this movie.",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "it's hard to determine who was the best part of this movie since it is just so great in every way. it was ahead of it's time why can't we have movies like this anymore?",
            "review_date": "2015-07-05",
            "source": "rt"
        },
        {
            "content": "RIP Bob Hoskins you wonderful man",
            "review_date": "2015-06-28",
            "source": "rt"
        },
        {
            "content": "one of my favorite movies ever",
            "review_date": "2015-06-23",
            "source": "rt"
        },
        {
            "content": "Still such a blast!  Just a perfect mixture of elements.",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "Hilarious and visually dazzling!  It's perfect!   A+",
            "review_date": "2015-06-11",
            "source": "rt"
        },
        {
            "content": "A Classic that deserves a lot of praise for it being a very great family friendly film except for a few unsettling moments for younger children.",
            "review_date": "2015-06-06",
            "source": "rt"
        },
        {
            "content": "Los efectos siguen siendo asombrosos, combinado de una forma perfecta la animaciÃ³n y acciÃ³n real, uno de los mejores papeles de Bob Hoskins y Christopher Lloyd y una direcciÃ³n magistral.\nHacen una de las mejores pelÃ­culas en mi consideraciÃ³n.",
            "review_date": "2015-06-05",
            "source": "rt"
        },
        {
            "content": "This definitely deserves to be acclaimed.",
            "review_date": "2015-06-05",
            "source": "rt"
        },
        {
            "content": "A work of sheer movie magic, but not the type of magic that can be expressed in words or music; this has to be seen to be felt or believed! It's enchanting, fun, and endlessly entertaining from the word 'go'.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "So inventive and fun, it still holds up excellently today. A great movie!",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "Combining live action and animation, it's a riotlessly funny comedy full of classic cartoon cameos.",
            "review_date": "2015-05-18",
            "source": "rt"
        },
        {
            "content": "This movie will make the whole family laugh!",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "91% on my Tomatometer.",
            "review_date": "2015-05-13",
            "source": "rt"
        },
        {
            "content": "Who Framed Roger Rabbit is the most greatest live action movie ever created in animation history. This shows you that the directors can do whatever they want and I don't mean that in a bad way, I love this movie so much. It has comedy, action, mystery, all that you would want. This movie does push the limits of a PG rating just a little bit, but I love this movie and think it is the best live action film in the world.",
            "review_date": "2015-05-10",
            "source": "rt"
        },
        {
            "content": "This a very fun movie to watch and even works as an interesting noir flick.",
            "review_date": "2015-05-03",
            "source": "rt"
        },
        {
            "content": "One of the more creative movies of the 80's,it's wicked fun while the visuals are spectacular....one of 88' best.",
            "review_date": "2015-04-15",
            "source": "rt"
        },
        {
            "content": "Zany, over-the-top fun with special effects that still impress to this day.",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "I love roger he's so funny",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "The Toons look like they belong to the world in the movie more than CGI does today. It actually has weight to it. Look at Jessica Rabbit when she's singing in the night club. The scene where she pinches the guys cheeks. I mean, they look like cartoons and CGI does look significantly more real and detailed, but I'm talking about the contact between the Toons and the physical world. Amazing. I'm not a big fan of the story, though. I give this four stars because of the illusion of actual contact. And because the animated short film at the beginning is without a doubt the funniest cartoon I've ever seen. I think it's called \"Tummy Trouble.\"",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "Ahead of it's time, hilarious ode to cartoons.",
            "review_date": "2015-03-11",
            "source": "rt"
        },
        {
            "content": "Q: Is this a great movie?\nA: Yes.\nQ: Should kids be watching it?\nA: Heck no!\nQ: Did I learn this the hard way?\nA: Also yes.\n\nPppppplease! Do I need to say anymore?",
            "review_date": "2015-03-09",
            "source": "rt"
        },
        {
            "content": "Paved the way for every animated picture since then. Timeless in its originality.",
            "review_date": "2015-03-05",
            "source": "rt"
        },
        {
            "content": "Some films are making new tech while making the film, this would go into that category, blenging cartoon into the real world. This film is right up there with Star Wars, Close Encounters, ET and Toy Story by creating new materials for the world of film.",
            "review_date": "2015-02-21",
            "source": "rt"
        },
        {
            "content": "Innovation at its best!!!!!",
            "review_date": "2015-02-21",
            "source": "rt"
        },
        {
            "content": "Robert Zemechis (I probably spelled his name wrong) will always be one of my favorite directors. So will Stephen Spielberg, even though he acted as producer in this movie. To have those two talents bring classic Warner Brothers and Disney characters in the same movie and blend them with live-action in a expert and entertaining way is pretty freaking awesome! Not to mention this movie has a great story and fun characters. It also may be the best live-action/Animation hybrid movie. It's a must-see.",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "This is a very entertaining movie with an amazing mixture of live action and animation.",
            "review_date": "2015-02-10",
            "source": "rt"
        },
        {
            "content": "The eye-popping colours and detailed animation make it hard to look away.  A childhood favourite that should be seen by everyone at least once.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "Fun. Visual. Soulish.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "A classic mix of animation and live action that still holds up today and hasn't been bettered. It's still amazing to see the Warner Bros toons mixing with the Disney ones and wrapping it all up in a film noir storyline was an inspired idea. Hoskins also does an amazing job making you believe he actually sees Roger throughout. It must have been incredibly difficult to pull off! Adults and children will still enjoy this film (the end with Doom is still quite scary) and the fact that they haven't really repeated this trick again shows how unique the whole thing is.",
            "review_date": "2014-12-31",
            "source": "rt"
        },
        {
            "content": "Toontown at it's finest. The late great  Bob Hoskins saves the day and finds his love for toons again, having to clear  Roger of the murder of Marvin Acme the owner of toontown. If you enjoy cartoons as they were then you'll love this movie.",
            "review_date": "2014-12-25",
            "source": "rt"
        },
        {
            "content": "This is the greatest hybrid movie of all time, and also one of my favorite films of all time.\nStory: 10/10\nAnimation: 10/10\nCharacters: 10/10\nTotal: 10/10",
            "review_date": "2014-12-17",
            "source": "rt"
        },
        {
            "content": "This film has great sense of energy and fun about it which makes for pleasant viewing it is a movie for all of the family to enjoy",
            "review_date": "2014-12-12",
            "source": "rt"
        },
        {
            "content": "It was so awful it was good.",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "ilmesest eka leffa joka sekotti animaation ja nÃ¤yttelemisen",
            "review_date": "2014-12-08",
            "source": "rt"
        },
        {
            "content": "All your favorite cartoons are in a single unique film, hybrid of live action and animation. Thrilling and entertaining, \"Who Framed Roger Rabbit?\" succeeds in every aspect.",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "As a kid, I didn't watch cartoons that much. Oh sure, I watched a bunch of disney movies, and I watched my fair share of tom and jerry, but I never actually watched Disney animated shows or even Warner Bros. Maybe it's because I read books a lot of times, but I'm not sure. However, you don't need to watch a lot of cartoons to fall in love with this movie. The story is great, but the actual mystery isn't that mysterious. I mean, take one glance on the poster and guess who the villain is. The writing however is fantastic, giving these characters tons of personality and having some real funny jokes for both adults and kids. You know the writing's good when they can make you laugh at how a character died. But it does have some swearing and sexual innuendos, so beware. As you may have already known, this movie is praised for its technological achievements, and yeah, it's really great. The animated characters aren't just standing there, they touch, grab, slap, and even kiss human characters and objects. I remember there's a scene of Jessica Rabbit peeking out of a window, and it's so impressive, especially at that time. The characters are wonderful. Even though cliches, they still have some personality and depth to mix them up. I found that even though Roger Rabbit had an annoying voice I still rooted him on because I found him to be pretty awesome. I mean think about it, he's a rights activist who still wants to make people happy and is a great husband. The acting is great, and you have to be a great actor to take all of this seriously. But they do. They punch, kiss, touch and choke the animated characters as much as they talk with them. The voice actors of the toons aren't bad either, giving the characters depth just by talking. But I think the real strength of this film is that it shows all of these animated characters we love are in the same universe. Donald Duck and Daffy have a piano battle, Droopy and Goofy could have an conversation(which they don't, sadly), and most obscure of all, Mickey Mouse and Bugs Bunny are parachuting together. Doesn't that sound like a weird but amazing fanfiction? Well that could happen in this world, and it's a world many kids wished for, including me. And it doesn't show recent cartoons, they show cartoons from the beginning of cartoons, like Felix the cat and Betty Boop, and so adults can get nostalgic as well. Who Framed Roger Rabbit is a wonderful love letter to our childhood, but it isn't just nostalgia that makes it grand. Add in a great plot, characters, and innovative animation, and you'll get one of the greatest movies of all time.",
            "review_date": "2014-11-24",
            "source": "rt"
        }
    ]
}