{
    "rating": 9.1,
    "release_date": "1989-10-13",
    "num_reviews": 70,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "Judah (Martin Landau) is a philandering eye doctor who wants to preserve his marriage, and his dangerous brother Jack (Jerry Orbach) comes up with what appears to be the only viable solution. Certain that his mistress (Anjelica Huston) is about to tell his wife (Claire Bloom) about his affair, Judah agrees to Jack's murderous plan. Twinned with Judah's tale is that of Cliff Stern (Woody Allen), a documentary filmmaker whose problems, which involve love and art, are tame but funny.",
    "reviews": [
        {
            "content": "The 80s were arguably Woody Allen's most creative decade, consistently pumping out quality films, including the likes of Hannah and Her Sisters, Broadway Danny Rose, Zelig, The Purple Rose of Cairo, and, to cap the decade off, Crimes and Misdemeanors.  The latter film, which continues his exploration of existential angst, brings to light the fact that good is not always rewarded and evil is not always punished.  As with most of his movies, the cast is stellar (Alan Alda, Martin Landau, Anjelica Huston, Mia Farrow, and more), the writing is brilliant, and Allen's direction, as always, is thoughtful and well-staged.  While Crimes and Misdemeanors may not be his best film, it is certainly close to the top of the list.",
            "review_date": "2023-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this is one of Woody Allen's best movies, and features a top-notch performance by Martin Landau.",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen made good films during late 70s to 80s. And this is another watchable one of those. I like more his earlier films though. Martin Landau, Jerry Orbach and some other supporting actors delivered engaging performances.",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crimes and Misdemeanors (1989) offers perhaps the most complex study of the relationship between film and reality in all of Woody Allen's work, not excepting the lighter treatment of the theme in The Purple Rose of Cairo (1985). In Crimes and Misdemeanors, film and reality interact on multiple levels ranging from the commercial to the philosophical. They also interact through a blend of genres that includes the noir crime drama, romantic comedy, social satire, and the documentary. Along the way the film enthusiast is treated to a dazzling variety of interwoven film clips from Hollywood genre films, darkly humorous newsreel footage of a blustering Mussolini, and arresting talking head interviews with fictional philosopher Louis Levy (played by Martin S. Bergmann, the renowned clinical psychologist and author of The Anatomy of Loving). Allen uses these film-within-film conceits to dramatize a central Dostoevskian (and 20th century) theme: the consequences of a god- absent universe. ",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Total Dramedy executed ever so brilliantly by Woody Allen. And like the title implies, it contains a nice tale of crime & morality as well. And quite simply put, one of Allen's best films. Martin Landau & Alan Alda command the screen, while Mia Farrow plays hers very low-key. Like Alda says, Comedy is Tragedy plus Time. Give this gem a spin along with Allen's Match Point like another mentioned. Great film.",
            "review_date": "2022-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sam Waterston ... as an NYC criminal? My days of watching Law & Order on daytime TV cry out in agony!\n\nA blending of deeply introspective themes from classical literature (particularly Dostoevsky and his classic, 'Crime and Punishment') with Woody Allen's neurotic mannerisms, Crimes and Misdemeanors is a stylistic shift from the comic writer-director's earlier work, focusing more prominently on its moral commentary than on including frequent jokes. It's certainly in your face as to its intentions - casting comparisons between the struggles of the relatively upright Cliff Stern (Allen) and the commercial and personal successes of both Landau's Judah (an outwardly refined physician who eventually agrees to have his mistress murdered to preserve his lifestyle and public image) and Alda's Lester (a pseudo-intellectual and skeezy show business professional with a base perspective on entertainment and the big office to show for it). In the contrast with the latter, there are more shades of traditional Allen screenplays - Cliff fretfully tries to pursue cinematic artistry but finds himself unemployed and losing his love interest to a tone-deaf and slightly oafish Lester with funny remarks galore (Alda plays the character particularly well); in the case of Judah, the same themes are revisited with much darker implications, including the loss of a human life for another's peace of mind, and the ultimate preservation of Judah's mental stability despite his terrible act and initial devastation. It's an interesting duality that's presented, a tackling of the same social trend (the lack of morality/sincerity ultimately paying off in modern society) in two contrasting ways.\n\nNow, the film certainly his distinctiveness from the prior films in Allen's filmography, but its tougher texture does make it a bit more difficult to swallow; more somber, less outwardly enjoyable. Still strong and entertaining, but be warned that it's not the director's typical rapid-paced joke parade, instead it's a bit of a genre extension. (3.5/5)",
            "review_date": "2022-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Awesome movie, simply wonderful! Match Point 16 years before",
            "review_date": "2021-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whilst not a fan of the whole Woody Allen schtik I will admit that this was a more watchable effort with some good, dark dynamics.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Centers on 2 characters of Woody Allen and Martin Landau who are eventually going to cross paths.",
            "review_date": "2021-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece of a film. A magnificent exploration into morality, guilt, and life from a tragic and comedic perspective.",
            "review_date": "2020-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the 6th Woody Allen film I've watched and I have to say it is the one I liked the most so far (Annie Hall and Manhattan were among the other five so a high bar was set). It is curious how I believe I have not seen any trully happy couples in any of his films but, in a way, almost all of them talked about love and relationships. In Crimes and Misdemeanors the usual analysis of individuals and their interaction with each other is combined with a slightly more traditional plot, which at moments even brought the taste of a thriller. The great Woody Allen sense of humor is here as usual, the characters are really well built, the creative directing is also present and the flow of the movie is once again a big highlight.\u2028The film centers on two characters, Judah and Cliff. Judah is a successful physician who has a perfect life on the surface but has been losing his sleep as Dolores, his mistress, is not dealing well with their break up. He seems to still have feelings for her but his fear of damaging his prestige as a high-society righteous man with the perfect family seems to speak louder. He is lost and anxious through most of the film and you can feel that on your skin. After he finds a way to deal with his situation, a new internal conflict arises, bringing up feelings about religion and the existence of God. The constrast between the two main characters starts with the fact that Cliff is an unsuccessful documentary director who has a marriage on the verge of its end. He too is finding comfort and love with someone other than his wife but in this case it is only starting and possibly won't even materialize.\u2028The two stories evolve together but meet only in the end, in a very smooth way. More than trying to get any morals or messages in all of these imperfect relationships, I believe what is that it was mostly a really well built film that grabs your attention 100% of the time. Woody leaves his print at several points. First in the great sections of other movies illustrating similarities with the story being told. Also in the scene of Judah talking to the human representation of his conscience, which is just outstanding. Finally, in the excerpts from speeches of a philosopher being studied by Cliff, which fit perfectly by describing the complex relationships of life, love and religion.\u2028The story is funny at some points and intense in others, he directing adds a perfect rhythm to it and the deepness of feelings and relationships just makes you think about the movie several hours after it is over.",
            "review_date": "2020-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Allen film I found nothing to get enjoyment out of.",
            "review_date": "2020-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my book, Allen's best film.",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As Woody showed his strong interest in Dostoevsky, several motifs were hidden in this piece, which developed into three of his later works: \"Match Point\" (2005), \"Casandra's Dream\" (2007) and \"Irrational Man\" (2015). The two storylines are separated but connected. The smart transitions of either the movies showing in the theatre or the footage and voiceover of the documentary really make the narrative structure much richer. Not to mention the clever lines and the cinematic look.",
            "review_date": "2020-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes Woody Allen is capable of balancing his wry but zany sense of humor with very dark subject matter. This is possibly the most notable example as he grapples with questions about morality and faith usually only explored with depth by Russian novelists and playwrights. It is no surprise that this is considered one of his best films as it shows him actually committing to telling a dark and tragic tale and following it through to it's disheartening and bitter ending. This film does not have the issues that Allen's weaker films do as it doesn't just feel like a group of relatively funny jokes with a vague plot fashioned around them.\n\nRespected ophthalmologist Judah Rosenthal, Martin Landau, is viewed as a good man by his devoted wife Miriam, Claire Bloom, and the various members of his wealthy social circle. His position in society and relationship is threatened when his mistress of two years, air hostess Dolores Paley, Anjelica Huston, decides that she wants to reveal their affair to his wife and have them discuss who he will choose to be with going forward. He wants to end their affair as she becomes increasingly clingy and threatens to reveal details about questionable financial dealings he made in the past while he believes revealing the affair would permanently damage his relationship with his wife. When pushed he has his brother Jack, Jerry Orbach, use his connections to the mafia to have her murdered and feels a great deal of guilt afterwards but his crime is not discovered and is misattributed to a drifter who committed other crimes. Meanwhile documentary director Cliff Stern, Woody Allen, mocks his brother-in-law, shallow television executive Lester, Alan Alda, when hired to direct a documentary about him while chasing Lester's employee Halley Reed, Mia Farrow, despite being married.\n\nThe film is famous for it's ending which refutes Dostoyevsky's ‘Crime and Punishment' by stating that somebody can get away with murder and continue to live as a normal, happy person who is not destroyed by their guilt. This is a horrifying thought as we want to believe that human morality is somehow intrinsic and any person who is not ‘insane' understands that killing somebody for their own gain and facing no punishment for it is unthinkable. We feel sympathy for a reprehensible man in this film because he goes through the motions of feeling guilt and even has a born again moment but he makes no real attempt to atone for his sins and is able to continue living his life as a man loved by all around him. He is not weighed down by the thought of this woman losing her life as a result of his selfish desires and does not value honesty and real emotion in the relationships he has with his wife and the people who look up to him.\n\nAll of this is complemented by the character of Stern's other brother-in-law rabbi Ben, Sam Waterston, who is a morally pure man but faces punishment in the form of loss of his sight. Seeing the example of a man who encouraged him to do the right thing facing a permanent disability may have encouraged Rosenthal to continue going down his immoral path as he will not be rewarded for good deeds and if he does the right thing he may be doubly punished. Allen plays with our minds cleverly in this film as we expect Rosenthal to get caught as almost every man or woman who commits a ‘perfect murder' in a film noir does but the simultaneous emptiness and relief of not getting caught does not cause him pain but allows him to move on with his life.\n\nHe also smartly lets us come to care about Paley before she is murdered as flashbacks to the beginning of their relationship have a hopefulness to them that makes her inevitable murder emotionally devastating. Landau and Huston have a convincing chemistry as they run along the beach together and discuss his sexual prowess and for a moment you begin to believe that they really could make it together. Then we jump back to the present and see how it has all come crashing down and it is disheartening to see a man destroy the dreams of a mistress he has clearly been leading on while seeming self pitying and smug. His editor Susan E. Morse deserves most of the credit for this as she drops these flashbacks in without disrupting the flow of the film and adds important subtext to other scenes.",
            "review_date": "2020-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a big fan of almost every single movie of Woody Allen but this movie has some scenes that I never forget. They have kept in my memory like as words in a stone.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Allen's intuition has barely gone off track, he is to-the-point, sharp and poetic in his steps.\n\nCrimes And Misdemeanors\n\nAllen's crime drama too is a love story. He just can't help it. And you cannot hate that about him. It is simply inspirational and adorable. The writer and director Woody Allen is one romantic fellow. He can and does romanticize the idea of murdering someone. That foreplay of God that he imparts on us as wisdom and practicality that zaps you like a lightning bolt, is his version of making sense out of a narration. And no one writes like him. So what if there is a character similar to him, always, running around the screen. No one has produced these many avant-garde ideas so exceptionally and convincingly that his filmography starts calling itself out for a specific taste.\n\nA sense of humor is a second thing, the sense of romance should be your priority when you jump in on his train of thought. There is an incoherent rush through the film. Either accelerated by subtle humor or self-mockery or intense drama or plot moving forward with an incredible pace. Either way, the film keeps you at the edge of your toe, instead of being calm and present. It is present for it thinks a lot.\n\nEach character is told to decide repetitively on the screen. Which makes you, the viewer, understand, empathize and even nod to the decisions they would go for or lead towards. By then, it wouldn't matter what they choose to do or be. The journey, the pain, the pressure that they make \"punish\" themselves with redeems their credit points in front of our eyes. It is a story that is far from gangster genre no matter how familiar their action grows. Crimes And Misdemeanors also gets the \"close calls\" right and like no one. What they do, what he has done, is that he didn't keep any.",
            "review_date": "2019-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Woody Allen so it's obviously going to be interesting.  And this picture is no different.  Some really great stuff here",
            "review_date": "2019-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jesus Christ it's incredible how full of himself that one director is talking his ideas into his recorder. There's some pretty good dark humor in this. The setup to that one bound-up sex story was great. I love how the movie goes from one character's story and problems to the others in a very smooth fashion.\n\nI can't even imagine a person in real life who acts this pretentious and full of himself as Alan Alda does in the movie. I think that dinner table scene with his past relatives was insightful as hell. \n\nThis is a deeper movie than what is initially seen. It's a philosophical and life take on what is right and wrong, what needs to be done and what could have happened. I'm going to have to watch this movie again. ",
            "review_date": "2019-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps his BEST film.",
            "review_date": "2018-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen this 3 times (once every 10 years or so) since it came out. A very disturbing and funny and compelling movie.",
            "review_date": "2018-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing fancy; the situations are realistic and presented in a well crafted film. I especially loved the editing and minimal usage of music; I believe Woody can bring up any genes he wants and blends it well with humor.",
            "review_date": "2018-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crimes and Misdemeanors is one of the better Woody Allen films with an odd structure as its dramedy part and crime storyline are too different from each other, but the acting is strong across the board with the standout one being deservedly Oscar nominated Martin Landau, the crime storyline is excellent, the ending is terrific and the movie features typically strong, interesting dialogue from the director.",
            "review_date": "2018-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here's a film that really gets you thinking about your time here on earth and what it means to exist. It's one of the most moving movies of its kind; caused me to break down in tears.",
            "review_date": "2018-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "#woodyallenretro Podcast Project\n\nArguably woodys greatest drama tackling the morality and consequences or lack there of .. of murder - another well acted and executed movie overall - having the mix of a serious dark moral think piece and a romantic comedy mixed in one film does feel a bit off even though they are meant to play a contrast of sorts - but this still does not hinder the stellar performances, particularly from Woody himself, Martin Landau and Alan Alda \n\nThis movie certainly stands out for its realism and honesty - we can clearly see this was the building blocks which was to later become the even more stellar Match Point - never-the-less this one is a high point in Woodys filmography without a doubt!",
            "review_date": "2017-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of Woody Allen's strongest films and its about the entire question of debating morality and the thoughts within a moral man.",
            "review_date": "2017-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Its only at the end when the films true meaning dawns on you\".  A slow builder and not nearly as quirky or humorous as compared with Woody Allens other \"greats\" such as Annie Hall  or Hannah and her sisters. Nonetheless, Allen has delivered an engaging film, setting his usual existential themes against the back drop of 2 seemingly connected characters. The ending scene is one of his best. I would only criticise the somewhat sleepy first half, which whilst entertaining, pales when compared to scenes from Woody Allens other films.",
            "review_date": "2017-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It plays out ad two separate films. The Martin Landau segment has echoes of Hitchcock all over it. Landau is superb as the cheating philanthropist.  \n\nThe other storyline sees a typical awkward unlucky in love Allen deliver some quality one-liners in his pursuit of Farrow. As the plot unfolds the director delivers a moving and touching performance.  \n\nI'm not too sure,  if the meeting of the two story's protagonists worked but everything leading up to the finale is great.",
            "review_date": "2017-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Behind all the crimes and misdemeanors are the unresolved question of theodicy -- is there a God care enough to exercise justice in our lives?  Woody Allen is a skeptic leaning toward the No.",
            "review_date": "2016-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"- You will notice that what we are aiming at when we fall in love is a very strange paradox. The paradox consists of the fact that, when we fall in love, we are seeking to re-find all or some of the people to whom we were attached as children. On the other hand, we ask our beloved to correct all of the wrongs that these early parents or siblings inflicted upon us. So that love contains in it the contradiction: The attempt to return to the past and the attempt to undo the past.\"",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Allen's nihilistic and misanthropic \"Crimes and Misdemeanors\" is the atheistic remake of Dostoyevsky's \"Crime and Punishment,\" with the change of intent obviously present in the switch of title. Allen's statement here is a film that is utterly hopeless and believes that each human's individual choices make what their life is, that some choose to believe in God despite the lack of truth in that idea to get by in their life, some choose to love their family or their friends, etc. It essentially boils down to the existential belief that there is no meaning in life except what you make of it. But I do not fault the film for only having an untruthful philosophical message, I also in general found it to be a rather paltry Allen film besides its pretentious facade. I's generally unfunny and not involving dramatically. All of the characters are either despicable or pathetic, and all of Allen's most grating tendencies are not diluted here. I believe the majority of people who give this film a high rating enjoy it for the questions it asks and the \"wise\" sounding conclusions it reaches, but as someone who's very focused on philosophy I found its posturing dull and hollow.",
            "review_date": "2016-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long boring movie.  Not funny in any part",
            "review_date": "2016-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen most of Woody Allen's recent films and figured it would be worth checking out some of his older films and this one was on HBO the other day. I liked this film quite a bit and it was fairly original and unique. The two parallel stories were quite a bit different, but I thought it was very smart how they worked together and were different. Overall I liked this older Woody Allen film and will watch more of his older films soon.",
            "review_date": "2016-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost 'too' interesting.",
            "review_date": "2016-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "M-F-O\n\n8.6\n\n[Woody Allen]",
            "review_date": "2016-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I haven't been inside of a woman since I visited the Statue of Liberty.\"\n\nThis movie gets 4 stars for that line alone. The rest is a wonderfully acted piece of the usual Woody Allen middle class/middle aged crisis dramedy that we've come to expect. Not one of his all-time bests but a solid effort all around.",
            "review_date": "2015-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really good ensemble piece even if the ensemble as a whole isn't Woody Allen's best collection of characters. Of course, Allen is a delight to watch with his charm and timing. Alan Alda is great as a narcissistic producer and Martin Landau does good work (although surprising he was the performance that earned an Oscar nomination) but the performance that blew me away and trumped everyone else was Anjelica Huston. This is the best performance I have seen from Huston and even though she did deservingly earn an Oscar nomination for Enemies, a Love Story that same year (1989), I think this performance would have been more deserving to be nominated for if not both. It's well written like most of Allen's films and has a great capture of New York City like most of Allen's films.",
            "review_date": "2015-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before \"Match Point,\" Woody Allen made this slightly more enjoyable film about murder and morals. \"Crimes and Misdemeanors\" is complex and finds a balanced blend of comedy and drama.",
            "review_date": "2015-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Our favorite neurotic little elf bounced back from a series of stinkers and picked up a pair of Academy Award nominations for Crimes and Misdemeanors, which found him writing, directing, and starring alongside Martin Landau in a rather pensive drama that interweaves the stories of an adulterous ophthalmologist and a struggling filmmaker for whom love and romance are fraught with difficulty... and the perfect murder. It's Hitchcock meets Woody Allen, with all of Allen's trademarks; once again marrying the dissection of urban Manhattan's inhabitants with an arsenal of lampooning dialogue. Shifting the mood from dark to comedic to social satire with seamless aplomb, Crimes and Misdemeanors is a sophisticated, ambitious, dark meditation on murder and guilt that still manages to be uproariously funny.",
            "review_date": "2015-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alternately very dark and very light, this dazzling masterpiece from Woody Allen is one of his very best.",
            "review_date": "2015-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A surprisingly dark philosophical study of human nature. One of Allen's best films.",
            "review_date": "2015-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen. ...You either love him or hate him. I don't think I need to say much more than that. Regardless, a genius film. A perfect, well balanced mix of comedy & drama that never takes itself too seriously. And personally speaking, a fave.",
            "review_date": "2015-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Allen's best pictures; a multi-faceted gem. Landau is superb as the conflicted anti-hero, and Allen is perfect as the good-natured loser, undone by the world around him.",
            "review_date": "2015-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen masterfully explores the threshold line that separates faith from reason, the sacred from the profane. Betrayal, murder, theft, envy, anger, greed etc. All sins are mixed in a whirlwind of ideas and real life lessons. Although simple aesthetically, Crimes and Misdemeanors can take a philosophy class and intelligence in just one hour and thirty minutes.",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a lot of philosophy talk in this movie. Most scenes work, but not all. Like when buddy is having a flashback and he sees his family. You're thinking it's going to be heart-warming and all that, but they get into an argument about religion and Hitler and ethics while buddy is standing in the corner watching it teary-eyed. I'm not sure if that scene was intended to be funny but I laughed. Woody Allen is great in this. So is Landau but his story is completely different from Woody's with some pretty heavy themes. The whole experience is like listening to a Cure album. Happy one second, sad the next, then happy, then pondering the meaning of life, and sad again...",
            "review_date": "2015-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Take from this is crime does pay once it clears your soul.",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My husband and I fell in love at first sight.  I should have taken a second look.\n\nA business man has found a way to extort money and becomes under the gun when he breaks off contact with his mistress and she threatens to reveal all his secrets.  The business man will need to hire some muscle to take care of his mistress.  Meanwhile, a married documentary director begins falling for a new friend in his life and a love affair of sorts begins.\n\n\"You have to confess the wrong and hope for understanding.\"\n\nWoody Allen, director of Manhattan, Midnight in Paris, Love and Death, Shadows and Fog, Radio Days, Bananas, Small Time Crooks, The Purple Rose of Cairo, Zelig, Annie Hall, and Broadway Danny Rose, delivers Crimes and Misdemeanors.  The storyline for this picture is very intricate and well done.  The stories are unpredictable and the acting was very good.  The cast includes Woody Allen, Martin Landau, Anjelica Huston, Alan Alda, and Sam Waterston. \n\n\"It's a fundamental difference in how we see the world.\"\n\nI recently DVR'd a slew of Woody Allen movies off cable and found this picture on EPIX.  This was fairly solid and I enjoyed watching the film unfold.  This was an entertaining Allen gem, maybe not his best work, but definitely worth a viewing.  I recommend giving this drama a shot.\n\n\"I gave up things for you.\"\n\nGrade: B",
            "review_date": "2015-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is on my top ten list. A must see.",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I've gone out the window.\"",
            "review_date": "2014-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A typical Woody Allen movie. It has the opening jazz song, the old film references, the characters you can't stand, the mediocre vibe, and everything else you've seen before. (First and only viewing - 12/2/2014)",
            "review_date": "2014-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review:\nThis is your typical Woody Allen movie which deals with troubled relationships and finding love, but he cleverly added an intense love affair which makes the movie interesting. The whole murder plot was put together great and all of the characters put in a great performance. It isn't a whodunit, like Manhattan Murder Mystery, but it shows how a simple affair can turn horribly wrong. Woody Allen didn't have to include the love affair between him and Mia Farrow, but it does lighten the movie, even though it doesn't end to well for his character. It does feel like two completely different movies in one, which is why the title fits the film perfectly. Watchable!\n\nRound-Up:\nMartin Landau was brilliant in this film. He brought intensity and emotion to his role which made the whole situation between him and Huston believable. Alan Ada and Mia Farrow act the same in all of Woody Allen's movies so there performances wasn't that surprising, and I much preferred the toned down version of Woody Allen's acting which made the film bearable. Anyway, this is a watchable movie which shows that Woody Allen can write and direct other genres except for comedy.\n\nBudget: $19million\nWorldwide Gross: $18.2million\n\nI recommend this movie to people who are into there Woody Allen movies about a man who tries to break an affair and a struggling director who falls in love with a co-worker. 6/10",
            "review_date": "2014-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, so Woody Allen had talent at one point and it shows in Crimes and Misdemeanors. With subtle humor, compelling drama, and very good character development, Woody Allen has crafted what's easily his best movie.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film, from Woody Allen, is unlike most of the other films I've seen of his. Hardly romantic at all, it instead was more of a drama/thriller. It's not my favorite film he's done, but it has a great screenplay and good performances.\n\nOn a side note, at times I was distracted because many story elements reminded me of another Woody Allen movie, Match Point (2005), and while it was mas made decades later, I saw it prior to Crimes and Misdemeanors and therefore was shocked how similar the two were.",
            "review_date": "2014-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good, but i long for the days when Allen made such great comedies.",
            "review_date": "2014-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Woody Allen comedy like no other. And it is a masterpiece for sure.",
            "review_date": "2014-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well made typical Woody fare, but kind of limps through the finish line.",
            "review_date": "2014-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty and thought provoking little masterpiece.",
            "review_date": "2014-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another genius piece of art from Woody Allen.  He successfully mixes comedy and suspense to produce a near perfect film.",
            "review_date": "2014-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great one from Woody Allen. This is like a psychological thriller while maintaining his usual comic elements. Recommended.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely top-tier Woody Allen. The writing, acting and directing are first-rate, as he finishes off another of his artistic purple patches. I'm not an Alan Alda fan in the slightest simply because he's so good at this slimy, know-it-all persona that he once again carries off so effortlessly here. An essential watch for all cinephiles, and worth a purchase and rewatches for Woody Allen enthusiasts.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the other Woody Allen great that I've been looking for, after watching Midnight in Paris and Annie Hall a few years ago, the rest of the Woody Allen works I've seen have ranged from near awful to very good. But none have been great, like Crimes and Misdemeanors. The Woody Allen scenes were consistently hilarious, crammed with witty one liners, and priceless moments. My favorite is when Woody Allen shows the final product for the documentary he's been making for and about his smug brother in law, in which he clips in a roaring Mussolini. Which is another unique aspect this film accomplished, in it's modern recreations of black and white movies, showing clips of the scene getting recreated moments after-usually at a theater. \n\nThe more dramatic Martin Landua plot didn't put me in a solemn mood, that Woody Allen was trying to create. This is the one aspect of this film that didn't get accomplished in my viewing experience. The dilemmas were gripping, and the spiritual flashbacks were intriguing, but I lacked empathy in these scenes. I even felt more towards Woody Allen in his envy towards his brother-in-law, and his desire for Halley (Mia Farrow). Both stories cover a different stage of an affair, with much different results, and begs the question of which one got it better.\n\nThe film editing is stellar, done by Susan E Morose, and Woody Allen directs another awesome comedy",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moral to the story, from Professor Louis Levy: \"We're all faced throughout our lives with agonizing decisions, moral choices.  Some are on a grand scale.  Most of these choices are on lesser points.  But, we define ourselves by the choices we have made.  We are in fact the sum total of our choices.  Events unfold so unpredictably, so unfairly, human happiness does not seem to have been included in the design of creation.  It is only we, with our capacity to love, that give meaning to the indifferent universe.  And yet, most human beings seem to have the ability to keep trying and even to find joy from simple things, like their family, their work, and from the hope that future generations might understand more.\"",
            "review_date": "2014-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy crap is this a good movie. I cant believe I have only seen this one time and I have seen Halloween 3 like ten time.",
            "review_date": "2013-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen's 1989 effort focuses primarily on two very different, yet slightly intertwined, stories.  The first features Martin Landau as a successful ophthalmologist who fears his well established life may be threatened by a woman he had an affair with, who is now threatening to tell his wife.  He turns to his shady brother and makes a dark decision that effects him profoundly.  The other is a lighter story involving Woody Allen as a documentary filmmaker who takes a job documenting his brother-in-law, who he finds to be a pompous phony.  While working on the project he falls for a producer played by Mia Farrow.  It's strange how these stories shouldn't seem like they'd fit well together, yet they somehow do...and the film is really enjoyable with a great lead and supporting cast. I really do enjoy Woody Allen films.",
            "review_date": "2013-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the best film of the eighties. Certainly my favorite.",
            "review_date": "2013-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woody Allen at his best and bleakest. Highly enjoyable and well written. Martin Landau and Alan Alda highlight the cast besides Allen himself. Highly recommended",
            "review_date": "2013-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well..no body told you that life is fair!",
            "review_date": "2013-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Woody Allen delight, a diptych of two moral conundrums, Laudau, a well-off ophthalmologist who ultimately gets away with the murder of his badgering mistress (Huston), meanwhile a frustrated documentary filmmaker (Allen) flunks to win his love interest (Farrow) over a pretentious showbiz magnate (Alda).\n\nFor Laudau's story, one can easily sniff out the comparability of Allen's later London-based MATCH POINT (2005, 7/10), the other women are merely dispensable in favor of wealth, social status and ostensibly stable matrimony. In this film, its main concern is the struggle within, the general moral conscience Vs. the guilt or the sin, and out of left field, it is the latter eventually prevails, with the trappings of a comfortable life, the murder becomes a petty snippet in his memory and time can put everything back into an equilibrium, it is beyond any religion's absolution. Landau delivers one of his best performances in his lengthy career, an outright leading role (again, shamefully the category fraud push him into supporting group in the Oscar race), a hypocrite sleekly justifies his selfish and heinous behaviors with superfluous paddings, a despicable person so full of life with mocking caricature and a tint of self-reflection, everyone has his or her own unsurmountable hurdle in reality, luckily the preponderance is able to rein the yardstick. Anjelica Huston breaks her lofty stereotype, to overplay an unreasonable mistress who is too desperate to shore up her wanting sense of security, as vexing and halfwitted as she is, her denouement is too much a punishment. \n\nAs for Allen's romantic entwinement with Farrow and his doomed marriage, it brims with casual wisecracks and addicted cinema-goings, but the scene-stealer is Alda, whose character is blatantly based on the late writer Larry Gelbart, utters bon mots like, comedy is tragedy plus time; or if it bends, it's funny, if it breaks, it isn't. He is snobbish and lewd to everyone's eyes, yet he walks off with Allen's soul mate. Woody Allen is rehashing the same old self, and Mia Farrow refrains herself as an out-of-his-league dame, who speaks highly about her unrealized ambition in order to reject a man trapped in a dead wedlock, yet subservient to the mogul's courtship, it all boils down to the point of a woman's self-deceptive blindness towards material needs, with a collateral damage to her unsuccessful suitor. So in both stories, the female characters are less glamorous and adorable here, not to mention Allen's sister's icky sex encounter in the bedroom. \n\nThe film is mostly brisk under the accompany of a jazzy score, and its debate on moral structure is a cogent one and could be a reference to all the contemporary marital or relationship mishaps, even the religious mumble-jumble has an epiphany on those non-believers.",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        }
    ]
}