{
    "rating": 9.7,
    "release_date": "1989-02-09",
    "num_reviews": 30,
    "genres": [
        "Drama",
        "Crime"
    ],
    "summary": "A telekinetic Gypsy teen (Davor Dujmovic) joins a band of thieves on the outskirts of his Yugoslav village.",
    "reviews": [
        {
            "content": "It's unusual for me these days to watch a movie and not look at the time. I didn't check the time during this movie. An irregular and universal experience to watch.",
            "review_date": "2023-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "🎵 It's the Time of the Gypsies\nWhen the Love Runs High 🎵 \n\nThis is only the second film I've seen from Serbian director Emir Kusturica (after Underground), but a pattern is starting to emerge in his work stylistically, focusing on tragicomic magic realism and stories driven through character interaction as much as plot. Time of the Gypsies is nominally about the evolution of a single character, but is representative of a larger social community (its idiosyncrasies, charms, and struggles). The writer-director really comes into his own with the way he integrates very human interpretations to both individual people as well as his storytelling - Davor Dujmović's Perhan is not a perfect individual by any means, but that does not make his suffering any less empathetic. Simultaneously, the screenplay is constantly genre-hopping with the shifts in tone, bouncing back and forth between pure drama and surprisingly visual comedy. All the while there is the consistent possibility that the surrealism introduced at the beginning of the film will wind its way back to the front of the camera, imparting a degree of unpredictability. \n\nDid Kusturica inspire Hideo Kojima to include the cardboard box as a disguise in the Metal Gear Solid series? We can only guess, but I like to think that yes, the Japanese game developer has a soft spot for Serbian cinema that he wanted to reference in his stealth action series. (4/5)",
            "review_date": "2022-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the saddest movie ever made? but a masterpiece nonetheless.",
            "review_date": "2018-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly different, but I loved it.",
            "review_date": "2018-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great work from Kusturica. A powerful story, great characters and that touch of weirdness and magic that he can dose so well in many of his movies. For me his magnum opus is \"Underground\" but this dark comedy-drama got closer then I would have imagined. Goran Bregovi? and his music, of course, is always part of the equation!",
            "review_date": "2018-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like every film by Kusturica I've seen, Time of the Gypsies gives me a warm feeling I can't explain. Of course, the music of Goran Bregovic is also responsible for that. The plot may not be innovative but it still is a beautiful story with vivid characters.",
            "review_date": "2016-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Time of the Gypsies does have a lack of focus and is undone by its epic scope with some of the subplots and themes being rushed, but it is still such an immensely unique and interesting experience not only in its characters and story, but also in its mix of genres and amazing visuals. It is uneven, but nonetheless pretty good and containing many powerful scenes.",
            "review_date": "2016-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So boring and hard to follow",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly magnificient. Greatness like this is very rare.",
            "review_date": "2013-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very original tragical-comical drama story that speaks directly to the human soul.",
            "review_date": "2013-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "two hours twenty minutes of genius. Yugoslavian version is 4 hours 30 minutes. I only wish I could find it.",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal film! One of my favorite foreign movies of all time",
            "review_date": "2012-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this by a chance reccomendation. Instantly became one of my 3 favourite movies.\nWent on to watch other  Kusturika movies, and this is his best.\n\nA strong character movie, often chaotic, a gypsy village live on emotions and impulse, all seek to get one over on each other. Jockeying for position in an often surreal tale that uses dark humour and strategic pulls on your heart strings to take you ion a very original ride. Certainly worth your time.",
            "review_date": "2012-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dramatic comedy on the life of a young gypsy travelling between the Balkans and Italy learning to deal in a world of crime.",
            "review_date": "2012-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visual feast.......sumptuous.....a moving human drama!!",
            "review_date": "2012-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kusturica is one of my favorite directors and this is one of his best films\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nVery good! Good story and setup",
            "review_date": "2012-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kusturica is one of the great but overlooked filmmakers of recent times, and this is one of his best works. The story might be the usual rags-to-rich-gangster arc but what made this movie was the sheer inventiveness of the filmmaking. The photography was out-of-this-world brilliant, where I could've just stared at every frame. The characters all had their little (or not so little) bizarre tics to them, and Kusturica gave the entire film an aura of surrealism that made the experience unique. It was really the strangeness of the movie that made the most impact on me and elevated the drama. It also made for a lot of humor. As pure (intentional) comedy, it was as funny as anything out there, but the moments of sadness also rang true. The cast was uniformly excellent, even the main character's naive love interest, who is certainly not the most accomplished thespian but actually used that to her advantage to communicate innocence. Others have called it overly challenging and dramatic, but I think it was very fun to watch as pure entertainment as well, with the same sort of quick pace as, say, late period Scorsese.",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kusturica is one insane and obsessive genius. His visionary talent provided a giant, epic and complete work of art with brilliant metaphysical tendencies and challenging viewing standards, very defying by the time. No words can describe its universality: just challenge yourself, throw yourself in and be totally absorbed.\n\n98/100",
            "review_date": "2011-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is no ordinary movie, if u wanna see something very very special...go for it. A very unusual movie with probably non professional actors with some hilarious acting and humor..... terrific job on the life of Gypsies. must see movie.Great comedy/drama.\n\nIMDB rating :8.1\nMy rating :9/10",
            "review_date": "2011-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A remarkable original movie by Emir Kusturica, the music is astonishing and the atmosphere is depressing yet entertaining, it was truly a different movie, a long one but not a boring one.",
            "review_date": "2011-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah, the grief. No sadder movie ever made! Still: you'll love it",
            "review_date": "2011-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant movie with an amazing soundtrack!",
            "review_date": "2011-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Immerses one in its cultural milieu, creating a coming-of-age story that includes themes of loyalty and revenge in a very specific place.  It's that specificity that makes the film noteworthy, even as it goes on too long and has some inconsistencies.",
            "review_date": "2010-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not the best movie of Emir Kusturica but still beautiful",
            "review_date": "2010-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Kusturica's masterpieces.",
            "review_date": "2010-09-14",
            "source": "rt",
            "lang": "en"
        }
    ]
}