{
    "rating": 0.0,
    "release_date": "2009-11-06",
    "num_reviews": 75,
    "genres": [
        "Action",
        "Adventure",
        "Crime"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Violent and riveting prison movie with outstanding performances and fine direction",
            "content": "Tense and intriguing Spanish thriller mostly located into a prison with exception some flashbacks about private life of protagonist (Alberto Ammann) along with his wife (Marta Etura) . Good film that shows realism and truth without falling into the clichés of the genre . This powerful and very well directed prison movie contains thought-provoking drama , thrills , chills , suspenseful and lots of violence . With an excellent cast , including sensational acting from the magnificent starring Alberto Ammann as a prisoner in a desperate attempt to survive the ordeal , suffering an emotional brutalization who causes an explosion of violence and of course a perfect Luis Tosar who steals the show as tough and violent Malamadre . The tale of two men on different sides of a prison riot , the prisoner nicknamed Malamadre (Luis Tosar) leading the rebellion and the young warden caught in the revolt named Juan Oliver (Ammann), who poses as an inmate in a desperate attempt to survive the violent events . The first day when Juan begins working on his new job as a prison warden , is caught in a prison riot . He then decides to impersonate another prisoner to save his life and to end the revolt . Later on , terrible deeds happen and fury and revenge emerge . As Juan trapped in a world that does not belong and forgotten his fateful fate , erupts into an explosion of self-defensive violence showed on some breathtaking scenes .This exciting picture results to be an intense thriller that packs tension , straightforward intrigue , sober drama, and lots of violence . The film contains thrills and chills and is quite entertaining because being a laborious and intriguing suspense tale full of twists and turns . In the picture there are violence , drama , tension and a little bit of action in the final confrontation . The story contains a statement about inmate's mistreating , despair , betrayal and a strong criticism of the ruling class, unable to control a dangerous situation . Most part of the movie takes place into four walls of the jail involving and executing the preparatives of strict conditions demanded by the inmates . Highlighting the newcomer actor Alberto Ammann , giving a lesson in how he is able to withstand the weight of the flick and stand up to a great actor like Luis Tosar , making a memorable work as dreaded Malamadre , without falling into the prison movie clichés . Furthermore , an excellent support cast as the nasty informer Carlos Bardem (Juan Bardem's brother) and Antonio Resines as sadist and corrupt warden who uses unthinkable brutality . This is a perfectly realized and superbly crafted film . Interesting and thrilling screenplay by Jorge Guerricaechevarria (Eloy De Iglesia's usual screenwriter) though full of offensive stereotypes and not faithful to deeds . Appropriate cinematography by Carlos Gusi (Torrente, Box 507) who photographs splendidly the cold interiors from Zamora prison . Adequate and atmospheric musical score by Roque Baños (Fragiles, Machinist, Sexy beast, 800 bullets). The motion picture was stunningly directed by Daniel Monzon , a former cinema reviewer , he undertakes a skill and fascinating filmmaking with some sensationalist touch though is also intensely manipulative against prison guards ; this is his main big success . He previously directed fantasy (Heart of warrior) , comedy (Biggest robbery never told) and suspense (The Kovak box). Rating : Good , better than average. The film will appeal to prison genre buffs and Luis Tosar fans.",
            "review_date": "2010-10-04",
            "lang": "en"
        },
        {
            "review_title": "Great Spanish Jail Thriller",
            "content": "A Spanish thriller based on the eponymous novel by Francisco Pérez Gandul.Cell 211 tells the story of a riot inside a dangerous ward, just when a new prison officer is having his introductory visit to the same. By chance, he sees himself locked in with the rioters and, to survive, he assumes, a new identity as a prisoner.Although the story is not especially original, the characters and the script are very good, the situation is completely believable within the Spanish social and jail context, and the end is not as predictable as you might expect. Moreover, the movie is unpretentious and fresh, which makes it even more enjoyable.The acting is very good by all the cast, but especially by Luis Tosar as Malamadre, by Alberto Ammann as Juan Oliveras, and Antonio Resines as Prison officer Utrilla.A very entertaining Spanish thriller with very good acting, that won 8 Goyas (Spanish Oscars) in 2009.",
            "review_date": "2011-02-14",
            "lang": "en"
        },
        {
            "review_title": "\"Straight to the bone\"",
            "content": "Greetings from Lithuania.So so. It's been a long time, when i last time saw a film about prisons. Maybe it was \"The Shawshank Redemption\", i truly can't remember. I think, there isn't much films these days about \"true\" prison life (i still didn't saw \"Un prophète\"). Now, the thing i want to say is that i can't remember any other \"prison\" movie, except \"The Shawshank Redemption\" and \"Midnight Express\",but now, i'll always remember \"Celda 211\" (Cell 211-international title). This film goes \"straight to the bone\". Really great cinematography, excellent job by director (two thumbs up to Daniel Monzón), unbelievable acting - still can't believe that these guys aren't real prisoners. This film has it all. The only reason i saw this film, is that i watched \"Agora\", another great film from Spain, and was really surprised, when i heard, that \"Agora\" was overwhelmed at Goya Awards by some \"prison drama\". Now i can say, that \"Celda 211\" is the best film from Europe in long time - and i don't say this very often.Go and watch this film, You won't be regretting.Gran película and bravo to Spain!",
            "review_date": "2010-03-15",
            "lang": "en"
        },
        {
            "review_title": "Raw, real, incomparable",
            "content": "This movie likens that of a gemstone- raw, real, unique, crafty and incomparable. I watched this movie, my first Spanish movie in cinema, with English subtitles and frankly, i was impressed. Though now the only regret i have is not mastering the language before the show. If only i could pay more attention to the movie instead of the translated words running at the bottom.This is a story of a prison guard, Juan Oliver (played by Alberto A) who decided to go to work one day before he actually begins to 'make an impression'. What awaits him later is a riot, which forced him to be locked in Cell 211 after suffering an injury to his head. He knows the only way to live is to be one of them, and so he acted as an inmate. But until when can he keep it to himself? He has to make peace with the rest of the inmates and gain the trust of their 'leader' Malamadre (played by Luis Tosar) as they take hostage of high profile, terrorist-prisoners. He later learns an ugly news of his pregnant wife outside prison and his life is never the same again.This movie plays around the humanity of man and how corruption and distrust can affect a man's freedom and ultimately, his life. There were moments in the show. Obviously, the prison riot. The police riot scene later was well delivered straight to its core, which led to the falling domino pieces in the movie. The turning point of Juan's character was when he received the news about his wife. Fine acting by all the cast with amazing characterization, awesome cinematography and directing at every scene!The development of the plot is great, at points where it creates suspense left me on the edge of my seat. The blossoming relationship between Juan and Malamadre is well crafted, and believable- that i don't see in many other movies these days. It felt like Caesar in Rise of the Planet of the Apes.Walking out the cinema, i was left to ponder at many questions with respect to the show. Why was Juan left in Cell 211 at the first place? As if a curse is cast to the cell. It will be interesting to watch the Hollywood remake of the movie in two years time and i hope it does remain to its authenticity. Definitely award-worthy, it accentuates prison drama at its best- pulling heartstrings despite its violence and vulgar language.My cinematic experience has truly broadened. And i am sure yours will too after watching this movie.",
            "review_date": "2011-11-15",
            "lang": "en"
        },
        {
            "review_title": "Spectacular - One of the Best Films about Prison",
            "content": "The family man Juan Oliver (Alberto Ammann) leaves his beloved pregnant wife Elena (Marta Etura) at home to visit the prison where he will start working on the next day as prison guard to make a good impression. During his tour with the guards Armando Nieto (Fernando Soto) and his partner, a stone falls on his head and he faints. The two guards carry him to the empty cell 211, but out of the blue, there is a riot led by the dangerous Malamadre (Luis Tosar) and Juan is left behind by the two guards. When Juan awakes, he pretends to be a prisoner to survive and is forced to meet Malamadre. The leader Malamadre uses three political inmates from ETA as hostages to negotiate with the authorities and Juan helps him to write the terms of the negotiation. Meanwhile Elena finds that there is a rebellion in the prison and heads to the spot trying to get information about Juan. When the situation outside the prison is out of control, the SWAT and violent chief of the guards José Utrilla (Antonio Resines) beat the crowd and Elena is wounded by him. When Juan discovers what had happened with his wife, he becomes closer to Malamadre and changes his behavior taking the side of the inmates. Movies about prison are usually engaging, but \"Celda 211\" is spectacular and one of the best films about prison. The dramatic screenplay is realistic, with a story of friendship and pain using the background of the environment of a prison and ETA in Spain, and the tight direction is supported by top-notch performances. The unknown actress Marta Etura is so gorgeous and sweet that increases the impact of her incident. My vote is eight.Title (Brazil): \"Cela 211\" (\"Cell 211\")",
            "review_date": "2010-09-27",
            "lang": "en"
        },
        {
            "review_title": "Brilliant story about friendship, corruption, and codes that are more valuable and important than labels and uniforms.",
            "content": "Guerricaechevarria does it again, writing a brutal story of loyalty, friendship and guts. The acting is great, well directed and well filmed. The characters are extremely real and believable. In the end, everyone shows it's real face. Ethics and Character are put in a first plane, leaving uniforms, social class, education and every possible label behind. For some, it's every man for itself, and for others, it's justice or death. This movie is extremely violent but not at a physical level, and delivers pure emotions throughout it's whole plot. It'll keep you at the edge of your seat for two hours, and leave you thinking about it for days.",
            "review_date": "2010-01-17",
            "lang": "en"
        },
        {
            "review_title": "Sheer Perfection.",
            "content": "Simply a masterpiece. The script solid as a rock, no fissures in it no matter from which side one looks at it. The actors as good as to make to seem incredible that the acting profession has reached such superb levels of artistry. When one is watching this film, from the very first scene --almost unbearable to watch-- one is caught completely in it and from then on, one is on a ride at the edge of the seat, holding one's breath till the very end. I was dumbfounded at each scene. How could they have obtained such impeccable choreography with that enormous amount of actors (the whole prison population) that are on screen almost in every scene like the Chorus in an opera?The prison riot and the one outside of the prison walls, with the relatives of the prisoners and the police force, seem to have been taken from a real newsreel, not a staging done with actors, but then, every single scene seems taken from a documentary, so perfect is the acting, the direction, the editing. Sound track, lighting, etc. perfect. Impossible to find fault with this movie. A jewel.",
            "review_date": "2011-06-16",
            "lang": "en"
        },
        {
            "review_title": "Excellent and fiercely tense prison film",
            "content": "Concerning a rookie guard who must pose as a prisoner once a full scale riot breaks out, Cell 211 is an absolute gem. Fiercely tense with a cracking pace, an edgy sense of urgency and some ugly scenes of brutality, it's also got some great and believable performances as well as some rather poignant scenes, as bonds are made between prisoners and our protagonist gets to see things from their perspective. Yet the last thing Cell 211 is is generic. It has some refreshingly genuine left field unexpected twists and developments that keep you pretty much hooked, from its attention grabbing opening scene to its blistering conclusion. It also does a great job of keeping you in suspense as to whether or not our protagonist will be discovered, with the viewer left under no illusions what will happen to him if he is.It's also got some very decent production values and mercifully refrains from that awful jump cut editing during the more chaotic prison scenes.But best of all is its sheer unpredictability as trust me- after the hour mark, you really won't be sure how things are gonna turn out and will be hooked all the more.Overall a great film and highly highly recommended. See it now, you'll be glad you did. 9/10, Sheer class from Spain.",
            "review_date": "2011-07-18",
            "lang": "en"
        },
        {
            "review_title": "Unpredictable and Intense Prison Thriller",
            "content": "I believe there is a prison sub-genre of movies. This is the best I have seen in this sub-genre and is very close to the French \"Un Prophete\".The action starts immediately and the characters are build through out the movie. There are a few flashbacks, just to cool off the action momentarily. Luis Tosar as the leading prisoner is just amazing, his voice is so unique. This thriller is so intense, but without a sea of blood or extremely violent scenes, just amazing dialogs, acting and especially plot. The prisoners are not presented as bodybuilders full of tattoos, but exactly as they are in real life.Everything is happening so fast, just as needed to trap your eyes and mind, like only a handful Hollywood films. Only few scenes out of the jail, just to add to the intrigue and last a couple of minutes each.Finally I want to write about unpredictability, which is my first concern when I watch modern cinema: no actions or dialogs can be predicted, so different with the typical Hollywood scheme. Carlos Bardem pretends that he is an inmate; one can say that he will be discovered at the very end; but even so, this happens so suddenly and at a moment that it doesn't make any difference.10 out of 10 and highly recommended.",
            "review_date": "2010-04-06",
            "lang": "en"
        },
        {
            "review_title": "Jail time",
            "content": "Juan Oliver is a decent man. Having just found a job as a prison guard, he wants to inspect the place where he is to begin working a day before he is to report for work. Juan and his pregnant wife, Elena, are expecting a baby, something both are looking forward to. As Juan is being shown an area of the jail, a loose piece of construction falls on his head. The two guards showing him around are startled as a riot sounding bell is rung. They cannot leave the injured fellow worker lying on the floor. Knowing cell number 211 is empty, they decide to take Juan there while they go for help. That is the basic premise of this Spanish award winning film we recently watched on a DVD format. The story of an innocent bystander landing among hard core criminals is something no one has to experience. Juan, who has been given the basic training realizes he must act quickly if he is to survive. Throwing away his belongings that might incriminate him is a must, even down to minimal details as no shoe laces or his ring.What follows is a prison drama where Juan gets caught, trying to pass as another inmate with mixed results. Malamadre, the leader of the prisoners is not at all convinced of Juan's story, but he sees in Juan a good ally who always makes sensible decisions as to how to act with their demands. Juan, in turn, sees what prisoners must endure in that close environment where men lose their dignity.Directed by Daniel Monzon, the film offers relentless action as the rioters demand to be recognized, a long losing battle make the men confront the cruel authorities enforcing the prison rules. The screenplay was based on a novel by Francisco Perez Gandul, with a screen adaptation by Mr. Monzon and Jorge Guerricaechevarria. The action never decreases as it builds momentum to the unexpected climax when all hell breaks loose.Luis Tosar gives one of his best performances as Malamadre. His criminal is a muscular man who has spent most of his life inside. Opposite him is Alberto Ammann, an Argentine actor who is a revelation to us, never having seen him acting before. They are supported by a good group of actors that lend credibility to the story. This is not a film for the fainthearted viewers. The violent nature of the rioting that takes place is sometimes too much to watch.",
            "review_date": "2012-01-19",
            "lang": "en"
        },
        {
            "review_title": "Great movie!",
            "content": "This is a great movie mainly for two reasons: 1. The script is not a typical Hollywood storyline. It's very realistic and powerful.2. The performances of all actors are superb. In contrast to Hollywood movies, the actors in this movie are not models who decided to move to the film business but real actors.Fortunately, there are still cinema people who do not see movies as commercial products for sale with the purpose of bringing enormous profit to the producers but rather works of art. There is still hope for cinema.",
            "review_date": "2010-04-19",
            "lang": "en"
        },
        {
            "review_title": "A prison film with a twist... And powerful",
            "content": "Prison films have been made in several countries and there are basically 2 kinds of them: heroic actions usually organised by innocently sentenced, and depressive gloominess and violence among the prisoners (often gang- related). In this Spanish highly acclaimed film, the two dramatic (although of different volume) triggering events occur at the same time: the to-be guard Juan is put into a cell, and the managerial inmate Malamadre gets loose and starts a huge riot inside the prison. The events followed are intense, dramatic, with twists and turns and mostly unpredictable - the ending included. The cast is evenly strong as well, all main actors got a Goya nomination and 3 of them won (Luis Tosar, Alberto Ammann, Marta Etura); the latter is virtually the only female visible apart (= not in the crowd). Probably for men only, but a catchy experience.",
            "review_date": "2013-02-06",
            "lang": "en"
        },
        {
            "review_title": "Enthralling, a must watch for everyone",
            "content": "This movie is one of the best prison movies I've ever seen. It starts with a chaos in prison but as the story unveils and unfolds it becomes more and more compelling. Throughout the movie, there is an atmosphere of tension and that tension has been kept till the end.You are kept on the edge continuously. There is a feeling that something's going to happen at every moment and the filmmaker have been successful in making a good movie.Whenever I view a movie, I always try to learn something out of it. This movie helps you learn a lot about the very human nature, the insecurities and the desperate measures every sane (non-criminal) person can resort to in tough circumstances. I am a huge fan of Spanish horror movies. Their horror movies are very intelligent. But after seeing this movie I've become fan of not only Spanish horror but the overall Spanish movies. This movie is a must watch for Prison movie lovers, but I can assure you that this film will be liked even by non prison movie lovers.",
            "review_date": "2011-09-06",
            "lang": "en"
        },
        {
            "review_title": "Exactly what i was expecting, only to have the rug pulled from under my feet. Very good.",
            "content": "Cell 211 is an interesting prison drama with some strong performances and plenty of tense moments. The story centers around Jaun, a prison guard visiting his new place of employment who is unfortunate enough to find himself caught in the middle of a prison riot. An unfortunate turn of events leads to Juan being locked inside the jail with the inmates. He quickly realises it's adapt or die, and assumes the identity of a prisoner to ensure his own survival. The film has some very good performances and like many gritty prison dramas, come excessive violence that'll have you wincing away. The early themes of the film revolve around loyalty and earning respect, bit deeper into the film it becomes more about survival. Juan is put into situations where it appears no-one is on his side and taking matters into his own hands seems to be the only way out. There were times during the film when i thought i could predict exactly how Cell 211 was going to play out. Having seen my share of prison themed dramas over the years, it's all to easy to see where a film might lead in the final third. I'm happy to say that Cell 211 set itself up in what i thought was a predictable way, but that in the end, and to it's credit, i was surprised by how it played out. A strong film with commanding performances. 8/10",
            "review_date": "2012-06-22",
            "lang": "en"
        },
        {
            "review_title": "Everybody in the whole cell block was dancing to the jailhouse rock!",
            "content": "You may always wake me up to go and watch a Spanish thriller. I don't know, but there's something about their style which makes the thrillers much more grim, realistic and unsettling. Two terrific recent examples are \"King of the Hill\" and \"Backwoods\". Although neither of them features a very original basic concept, they are almost genuine throwbacks to the era of 70's exploitation film-making, what with their raw atmospheres and massive amounts of uncompromising violence. This was pretty much what I expected from \"Cell 211\" as well, but this brand new Spanish prison thriller even features a compelling and highly intellectual script with a handful of ingenious ideas and unpredictable plot twists. This is a politically engaged and harshly satirical drama that simultaneously critics the prison system, government and economic recession in Spain. In order to make a good impression at his new job as a prison warden, Juan Oliver visits the facility on the day before he's supposed to start, to get a tour and introduce himself to his new colleagues. Wrong time and place, as Juan becomes injured when a piece of wall comes tumbling down the ramshackle building. His soon-to-be colleagues put him to rest in the empty cell 211, but before the can return with medical support, there's the outbreak of a severe prison riot. The uprising, initiated & led by the charismatic and fierce Malamadre (who has his name tattooed in the back of his neck), is aimed at the media in order to make the malpractices within the prison walls public and all convicts entrenched themselves in the cell block where they keep the heaviest cases. Malamadra knows how to grab the media's attention and cause political nervousness, as he has three Basque terrorists hostage and threatens to kill them. Juan awakens amidst the mad-raving convicts with his anonymity as his sole advantage. He pretends to be a new inmate arrival, sentenced for murder in the first degree, and wins the sympathy of Malamadre. Meanwhile, outside the prison, Juan's pregnant wife heard the news reports and anxiously hurries to the prison. \"Cell 211\" mostly benefices from its authentic claustrophobic ambiance, marvelously detailed character drawings and contemporary accurate social statements. The convicted criminals perhaps come across as nihilistic scum, but in fact they run a well-structured and respectably effective little organization and their goals are actually even modest and understandable. Especially Malamadre, the seemingly brute and feared leader, is really a rational and \"likable\" character in comparison to some of the prison superiors and sadist wardens. \"Cell 211\" remains suspenseful and involving from the first minute until the very last, thanks to a couple of totally unexpected and truly shocking surprise twists that haunt your thoughts even long after leaving the cinema. Daniel Monzon (\"The Kovak Box\") assures a solid direction and the performances of the entire cast are terrific. Some performances are even close to phenomenal, like Luis Tosar's portrayal of Malamadre and Antonio Resines' unthankful role as the veteran guard Utrilla. Highly recommended and definitely worthy of all the awards that it won already in its home country!",
            "review_date": "2010-05-01",
            "lang": "en"
        },
        {
            "review_title": "BADASS",
            "content": "All I can say is Luis Tosar is such a badass here. The tension of this film builds up as the plot heats and gives more interesting moments.",
            "review_date": "2020-04-03",
            "lang": "en"
        },
        {
            "review_title": "good but far fetched",
            "content": "This film had me hooked right up to the point where Juan Oliver takes the walkie talkie radio to make contact with the outside.. there was no gain for him to take that risk at that early stage and letting things take their natural course would have been the more realistic alternative Silly things like this often need to happen in movies to make them exciting but I feel that the story could have been written more intelligently instead.. there was a lot to work with at this point including the ETA hostages who never really drove the story and felt more like a side plot Then the ex prison guard donning the old uniform and the pregnant wife getting beaten to death outside etc, and the believability factor really started to disappear Saved by some very good central performances, this movie could have been better",
            "review_date": "2012-10-21",
            "lang": "en"
        },
        {
            "review_title": "Good flick",
            "content": "Good movie, well worth seeing.Great idea for a movie, apparently the Yanks are going to remake it.I think that will be good too, if they polish this movie up well, it will be even better.New scariest movie prison dude ever in the halfwit enforcer.Fair bit of action, pretty tense at times, even the wife or girlfriend will enjoy it as it's very easy to follow, even with the subtitles.Not for kids, but there is nothing in here teenagers haven't seen before.Got to fill in some more lines ffs. Is that enough?",
            "review_date": "2012-01-14",
            "lang": "en"
        },
        {
            "review_title": "You will not get out of here alive.",
            "content": "You know going in that this will be a good film because Hollywood has grabbed it and will remake it.Aside from that, it really is an excellent prison drama. Some may find it a bit violent, so if you are squeamish, just wait for the Hollywood version. The film was penned by Jorge Guerricaechevarría, who wrote the well regarded Live Flesh with Pedro Almodovar. It won 25 awards and had another 19 nominations.The highly regarded Spanish actor, Luis Tosar (Mondays in the Sun, Take My Eyes) leads an impressive cast that includes Alberto Ammann, Marta Etura, and Javier Bardem's older brother, Carlos.Tense, dark, bloody, and exciting.",
            "review_date": "2011-12-06",
            "lang": "en"
        },
        {
            "review_title": "Con air meets The last castle. Good prison movie.",
            "content": "Cell 211 has some refreshingly genuine unexpected twists and developments that keep you pretty much hooked, from its opening scene to its conclusion. Seen it 5 years back. Saw it again last week. The action starts immediately and the characters are build through out the movie. There are a few flashbacks. Luis Tosar (Sleep tight, Miami vice) as the leading prisoner is just amazing, his voice is so deep. The lead actor Alberto Ammann acted well. This thriller is so intense, but without blood or extremely violent scenes. It has good dialogs, non predictable climax, its actually quite different. The whole movie is intense, there is no time for to be bored. The acting is good, direction by Daniel Monzón (The Kovak Box) is good, editing was perfect.",
            "review_date": "2016-06-22",
            "lang": "en"
        },
        {
            "review_title": "Superb prison action thriller you just know Hollywood's going to go and re-make",
            "content": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning Juan Oliver (Alberto Ammann) has arrived for his first day of work at a tough, run down old prison and is just started being taught the ropes before a riot erupts and the inmates, lead by the vicious, domineering Malamadre (Luis Tosar) take control of the facility. Juan skilfully integrates with the convicts, posing as one of them and gaining their trust while using a single security camera to communicate with the authorities on the outside and keep them up with what's going on. But as events wage on, the conduct of the law enforcers on the outside starts to become even worse than that of the villains inside, and Juan finds himself gravitating more toward them and their cause.You can't look to Hollywood for really decent, original, high concept ideas these days. The best you can expect them to do is regurgitate some decrepit old franchise and try and give it a more modern, trendy spin or else do a glossed over, sanitised re-make of a really great foreign film, such as this. From the opening scene where a despairing inmate slits his wrists in some water in a sink and right to the end, Cell 211 hits hard and pulls no punches, delivering a tense, brutal and cruelly true slice of prison drama that works wonders.Director Daniel Monzon creates a genuinely suspenseful and atmospherically tense tale that really locks you in the pressure cooker and turns the heat up high. The film never strains the viewer's sense of credibility and events play out just as they conceivably would in real life. It also has an air of relevance and timeliness about it. What with riots against authority breaking out in streets and cities across Europe at the moment, it highlights a group of people feeling oppressed and ignored, trapped in an outdated, squalid pit with terrible conditions and questionable conduct by authority figures when dealing with it. Those aren't my personal sentiments, just a point of view that could be considered, especially when the good guy finds himself pushed toward the vicious cons and sees them as more sympathetic than the authorities that pushed him away.Thanks heavens there's also fantastic performances to balance everything else out. In the lead, Ammann is wonderfully convincing as the good guy on the inside, who starts out with good intentions but finds being on the 'right' side doesn't always pay off, while Tosar walks away as the best actor, mesmerising from the first scene he's in as the camera follows him from the back of his head, and he maintains this commanding, unnerving presence through out. Antonio Resines is also commendable as a guard with a temper problem who proves the pushing point to Juan's change of sides.Once again, foreign cinema has shown the Hollywood giants how it should be done and, sadly, you just know they'll go and try and put their big, clever slant all over it. And it won't be half as good. ****",
            "review_date": "2012-02-12",
            "lang": "en"
        },
        {
            "review_title": "high tension prison film",
            "content": "Juan Oliver shows up a day early for his prison guard job. He gets a tour when he gets hit on the head. He's unconscious and brought to rest in cell 211. At the same time, the inmates revolt and break free. Juan is abandoned in the lock cell. When he wakes up, he has to pretend to be an inmate as he develops a relationship with riot leader Malamadre. The rioters find 3 Basque ETA prisoners and the political implication explodes. The prison genre is a well-worn path. This one manages to create something new. The tension is unrelentingly high. Juan is so exposed that the story never lets up. It's a great cat and mouse game as well as an intense thriller.",
            "review_date": "2016-08-23",
            "lang": "en"
        },
        {
            "review_title": "An afternoon treat",
            "content": "This review was made following the afternoon screening at Cambridge Film Festival (September 2010):I generally endorse what's been written, and also rate this as an afternoon treat, one that, sadly, so few were there to enjoy. Yet the screening's resultant intense hush was electric (and generated considerable tension that popcorn doesn't!).People should see this when they can, as its strengths will dilute greatly on DVD, probably however huge one's home cinema - it's rightly intended to be seen sensing a sea of others witnessing it. (I spotted a source, helpfully identified by Ric, but couldn't catch usual disclaimers about 'persons and events' - I could easily have expected some 'true-life' origin (maybe the book had one?).)* * * * *What I will do, without trying to detract from the film's impact, is to wonder whether it would, in purely psychological terms, bear watching twice (although checking detail missed can be a motive to do so): NATALIE, a completely different type, still 'works', despite knowing what happens. Would CELL 211?For anyone who hasn't seen operational prisons (I've twice visited clients there, one on half-a-dozen occasions), it's all too easy to think that we know what they're like, but, as with much of life (what it's like in the Crown Court?), we tend, unless something brings us there, to know them only from self-perpetuating visual material - of which this film necessarily now forms part.(In the private prison, I felt even more unsure of getting out again, as 'Calzones' - nicknamed through having no underclothing - tellingly does when the first door clangs behind him: I had to be electronically finger-printed, which turned out to be so that I could prove to them to let the visitor free at the end!)So, yes, there are clichés, but we may not necessarily know which are tired myths, which inevitably underpin prison-dramas. Riots do happen in prisons (I was early reminded of HUNGER), and so does all varieties of violence, including rape.(Prisoners sometimes take off the roof and use tiles as missiles, as well as preventing being stormed that way. Authorities usually starve inmates of access to t.v. - for obvious reasons, if they want to negotiate freely.)Here, the rioting started looking genteel (archive footage was not used and cf. HUNGER) - maybe that is accurate, but I wondered whether it could have been choreographed, and even shown better not in direct view, but via the CCTV. (And that CCTV proves capable of seeing anything!)These things apart, where this powerful and, at times, so highly paced film (it was often impossible to concentrate on thinking such things) let me down most was understanding how Calzones, a man (really 33?) spooked by a door and by being injured, had the nous and, moreover, guts / strength to do what he does. Sure, he has much motivation, but why has he suddenly no nerves, and knows all about psychology / criminology?We learn that he has no forces (police) background, so does he really just read a lot of prison fiction?!",
            "review_date": "2011-06-25",
            "lang": "en"
        },
        {
            "review_title": "Cell 2-1-One hell of a film...",
            "content": "This film has to be the perfect beginning for me writing reviews. Led to the local independent cinema due to a power cut at my flat, I had no idea of any synopsis or prior reviews. The opening scene of this film was one of such sheer sickening brilliance, my somewhat weary eyes were opened and it got me thinking - Would I ever get sucked into a Hollywood blockbuster this quickly? I highly doubt it. Gripping is not a word I would use to describe this film. It just isn't a strong or bold enough word. Enthralling may do a better job. With the script as strong as it was, obviously being well adapted from the novel, mixed in with some very intelligent performances, this film has me questioning my choice of cinema visits over the last 2 years. As with most good films, the director has done a fantastic job of allowing the film to flow seamlessly throughout. A breath of fresh air such as this will get your film sinuses flowing freely once more and your mind blown wide open for genre selection. Also, a great big thank you to my local cinema showing this film well after it's release.",
            "review_date": "2011-08-16",
            "lang": "en"
        },
        {
            "review_title": "Sheer cinematic perfection",
            "content": "Hard-hard-hard hitting ! Edge of the seat thriller. And the climax, could not have been better. Movies like Cell 211 come by once in a decade or so. Superb direction, extraordinary acting, rock solid script, impeccable camera-work. Cell 211 had all the makings of a Blockbuster.The direction by Daniel Monzon is flawless. The way he built the story from the beginning kept me involved from scene 1 where the first inmate of cell 211 cuts himself. Mr.Monzon has to be a visionary to shoot the scene the way he did. The script is really-2 honest & no time was wasted with anything else. The movie came straight to the point - new guard, riot, Calzone inside - buckle up Dorothy coz this is going to be one hell of a ride! The thrill and action was nicely mixed up with the bedroom scenes of Calzone with his wife. It made me experience the passionate side of Calzone and source of his motivation to get out. Later, this also became the source of his anger and madness when he cuts up the guard who killed his wife. The build up had to be perfect to make me feel the sadness and anger which Calzone was feeling. I could almost feel myself cutting up that guard as I was so angry - how could he kill a harmless pregnant women? I really liked the fact that Mr.Monzon kept the script honest to what he wanted to convey - no distractions. He had only a handful of characters who he wanted to focus on and only they formed the primary part of the script - shows the vision of the screenplay writers & in this case, the director as well (Mr.Monzon did both).The sets consumed me into the movie from the moment the riot broke out - the whole place trashed, rioting outside, whole movie shot within the prison. Its a unique style of direction when a movie is shot within a closed compound/room. I feel the whole intent is to make the viewer experience the movie as if he is himself there. The feeling is made real with hand-held camera-work and not standard industry crane-work all the time. Cell 211 had this quality. As I said, the movie stuck to the director's vision.The actors gave it all. The two protagonists, Luis Tosar & Alberto Ammann, were outstanding. Luis is an accomplished Spanish actor and won many awards for his performances in Spanish films (acted in Miami Vice, 2006). The support actors did their part to perfection - I think Mr.Monzon extracted exactly what he wanted from his acting crew.All in all, Cell 211 is an amazing thriller and a great work of Spanish cinema. Definitely a keeper. I rate this 9 out of 10.",
            "review_date": "2012-11-20",
            "lang": "en"
        },
        {
            "review_title": "\"Cell 211\"",
            "content": "The first day on a new job can be a struggle at the best of times but for trainee prison guard Juan Olivier (an excellent Alberto Ammann) it turns out to be a complete nightmare. Eager to make a good first impression, he turns up a day early for a guided tour of the facility. He soon gets a closer look than expected after his colleagues are forced to abandon him in the titular cell during the onset of a full-scale riot. Thinking on his feet, he dumps his visitor's pass into the toilet and poses as an inmate in hope he will be able to survive until the SWAT team arrives. The ruse works. But when his quick thinking attracts the attention of prickly prison daddy Malamadre (Luis Tosar) it's clear he is one wrong decision away from being shanked in the neck with a sharpened spoon.It's a simple set-up, but while never straying far from the genre blueprint, director Daniel Monzan packs in enough twists and turns to keep the tension mounting. There's a nod to domestic politics in a subplot involving ETA terrorists but the focus is chiefly on the battle of wits between Juan, Malamadre and the corrupt prison officials attempting a cover up job as they each try to manipulate the situation to their advantage.As tough and mean as a lifer in solitary, CELL 211 is a morally ambiguous tale in which it's impossible to separate the innocent from the guilty regardless of which side of the bars they are on. 5 out of 5Cambridge Film Festival Daily",
            "review_date": "2010-09-29",
            "lang": "en"
        },
        {
            "review_title": "Tense",
            "content": "Good prison movie has to be relentless and raw. The constrained environment of concrete and prison bars easily makes even a movie viewer claustrophobic. \" Cell 211\" is exactly that kind of movie. Smart, tense and above all unpredictable. There are twists and turns, but the good kind, logical and connected with the story. There is a sense of immense danger and you can almost smell the sweat and metallic whiff of spilled blood. And there is good, realistic acting, without fake superheroes. Just real people some good, mostly very bad, and the adrenaline pumping and overtaking the viewer. Excellent prison movie, rough and deftly avoiding tired clichés.",
            "review_date": "2013-07-07",
            "lang": "en"
        },
        {
            "review_title": "Great movie!",
            "content": "Awesome movie which brings us into the life of normal average policeman with pregnant wife. This movie amazingly shows us, how can our life change in just one second. He lost everything in that moment when his new coleague has left without him. But he was smart. He didn't give up and he tried his best. He was so brave that he could look right into Malamadres eyes and tell him whatever he wanted to. He thought that staying stuck in prison was the biggest trouble he had. But it was only the beginning of that nightmare. Excellent movie with strong story and exciting plot. Viewer is hoping during the whole movie but this is not expectable end. As I said, in that moment, Juan Oliver looses everything he had. Life of his wife, his child and at the end his very own life. And the worst is that he couldn't do a single thing to change it. He had to watch how his life is shipwrecked in front of his eyesAnother masterpiece by Jorge Guerricaechevarría. Just amazing.",
            "review_date": "2011-12-20",
            "lang": "en"
        },
        {
            "review_title": "Wow! Hard-hitting prison drama!",
            "content": "A totally unique type of prison drama, realistic, gritty and super impressive!Like none you've seen before.",
            "review_date": "2018-05-27",
            "lang": "en"
        },
        {
            "review_title": "Thank You Monzon",
            "content": "I'm one of those guys who's movie watching selection mostly consists with Hollywood movies and I rarely stumble into movies which are not in English or not in my mother language. And i don't really know why it doesn't happen more often (maybe once a month), because these high rated \"foreign\" movies are real treat. And this one was no exception.This was one of these movies: when you look at the trailer and think, \"ok this is maybe watchable\" and when you are finished you think \"how the hell i haven't seen this before\"I'm writing this so called review 5 minutes after seeing this movie, so i cant be very informative, because i'm still thinking about it (in a good way).But all i want to say is that if you don't mind reading subtitles (unless you understand Spanish) you'r really gonna enjoy this movie, i did and it's not everyday when i could recommend a movie.",
            "review_date": "2012-02-05",
            "lang": "en"
        },
        {
            "review_title": "Great idea for a prison movie",
            "content": "This is a very well done prison movie and although they had a low budget, they managed to pull off a memorable movie. It kinda reminded me of the movie \"Felon\" which is also a great prison movie. I like these kind of stories where the protagonist is caught up in a situation way beyond what he is prepared for even if it's by accident (as long as it has a good enough script). And this movie flourishes in so many manners, it's not a entirely believable movie and some parts psychologically doesn't make a lot of sense. But it's still enthralling and enthralling from start to finish, and you can tell despite the low budget they did the best with what they had. The plot is about when a prison riot starts and things just go haywire, but one of the inmates is actually a prison officer that gets caught in all the chaos. And needs to act and prove he is one of the inmates in order to survive. This story and direction is actually quite intriguing because I heard stories to people trying to act crazy and sadistic or keep up a front in order to survive in the prison environment. And it's just cool to see how a inmate does the things he does in order to prove he is one of them. The acting is also good for the most part and when it comes to the plot, it makes twist and turns that I just didn't really see coming. Especially the climax, it's actually quite different from most Hollywood movies. A bit more intensity, chemistry, development between the two main characters and if it was a bit more cleverly crafted this would have been one of the best prison movies out there. Sure it borrows certain elements from other prison movies, but it has far enough originality that makes it really stand out from the rest. My only main complaint is the parts with the protagonist and his wife drama (it just isn't done very well and seems to drag when it comes to the momentum of this story). This is still a enthralling and for the most part entertaining prison movie that keeps building when it comes to it's momentum until the unexpected climax.8/10",
            "review_date": "2014-05-28",
            "lang": "en"
        },
        {
            "review_title": "Best Prison Riot Movie",
            "content": "Well-executed script. Good actors, amazing direction, great plot development. Malamadre seemed to have one of the best sense of brotherhood in the prison and the actor who played the part made it really believable. There were parts that he had me feeling scared as well. Until the end I was kind of believing that Elena might still be alive but she was not mentioned again after. The movie had me cheering for Juan and also for the prisoners in some parts. But most of the time my heart was hanging on each scene. It was heartbreaking.I am definitely listing this as one of my favorite foreign films. I have never enjoyed watching a prison drama like this before. This film truly deserves an award.Note: This is my first film review. I was really amazed by the film that I wrote this right after watching it.",
            "review_date": "2012-10-07",
            "lang": "en"
        },
        {
            "review_title": "A decent prison movie",
            "content": "Cell 211 is a movie about a soon to be prison guard named Juan who becomes trapped inside a prison when a riot breaks out. He lies about his real identity and soon becomes best friends with the prisons tough guy. The movie is full with clichés and is often too far fetched. Juan seems to know everything and says all the right things at the right time, which becomes really annoying at one point. His girlfriend is pregnant (extra drama), and her parts in the movie are just horrible. Why the F does a pregnant girl attend a demonstration? And of course she gets hit, and of course it's one of the guards that beats her and of course this gets taped with his face clearly shown, and of course one of the prisoners gets this video on a mobile phone and shows this to Juan. I mean jeez... I could go on, there are many other situation which are so bad, so I was really surprised to see that this movie got a 7,6 rating (at the time of writing this). Oke it's not all bad, Juan's acting was pretty good and some parts were really suspenseful. I liked the first part were it was dubious if the prisoners would believe Juan's story - which was a turning point in the movie.Although I like prison movies, this is a very forgettable one and I would not recommend it to my friends. Too bad, I went in with high expectations (maybe this was the problem).",
            "review_date": "2013-06-05",
            "lang": "en"
        },
        {
            "review_title": "very good!",
            "content": "I was just looking for a good thrilling film to watch and I chose Cell 211 among others that appeared in a list. And I wasn't mistaken: this film is what really thriller should be, it keeps in suspense throughout viewing. Excellent actors play and crew's work cannot be overlooked. Original plot and some Spanish spirit spices up this movie and makes you look at a screen expecting what would occur in the next frame. IMHO, this film is not typical jail-film shooted before (at least I did not see one) and thus it is worth watching for everybody. It is a very good variant of a pastime, you will not regret :-) Also, As I read somewhere, a American version of Cell211 is going to be shooted.. So... IMHO: I am sure now that American version will not gain as much pluses, rating and positive reviews. Hope I am mistaken.. Good luck! :-) Happy viewing!",
            "review_date": "2011-08-04",
            "lang": "en"
        },
        {
            "review_title": "Riveting Prison Riot Drama.",
            "content": "My Rating : 7/10I love prison dramas and 'Cell 211' satisfies as a fast-paced, entertaining and thrilling watch.It's the characters that make this special as their carefully created with plenty of good banter back and forth with equally nasty scenes between them.Looking for a thrilling movie based in a prison? This Spanish gem has you covered!",
            "review_date": "2019-08-21",
            "lang": "en"
        },
        {
            "review_title": "Well acted, well made, shame about the plot holes",
            "content": "Several other reviews have covered it well.The acting is good. The camera-work is very good and takes you in to the prison and makes you feel that you are seeing things from a prisoner's eye view.The actors are generally a little too nice and smooth to be mistaken for real hardened criminals, but that's forgivable for a modest movie that needs people who can act.The real problem is the plot holes, Sometimes things happened that made me what to scream out \"No it wouldn't be like that\". The problem for me is that by halfway through I had lost connection with the movie and found myself watching it just out of general interest; I no longer believed in what was happening.But I still give it high marks for general entertainment. Hopefully those involved will make something better next time.",
            "review_date": "2013-02-04",
            "lang": "en"
        },
        {
            "review_title": "Magnificent and moving",
            "content": "Magnificent and moving story of a conscientious recruit who shows up at the prison the day before he starts working so he can get familiarized. Instead he is accidentally locked in with the population when a riot takes over the place. He has only himself to rely on. He convinces the inmates that not only is he one of them but one they should listen to. Beautifully wrought tension, humanity, and lack thereof.",
            "review_date": "2020-05-27",
            "lang": "en"
        },
        {
            "review_title": "A film that impressed me deeply",
            "content": "A film that impressed me deeply, without the bustle and noise of Hollywood, Europeans show their charm with their own style. Prisoners can also radiate the glory of humanity, hiding behind the high walls of the system are all machines.",
            "review_date": "2019-02-22",
            "lang": "en"
        },
        {
            "review_title": "Pulsating prison drama",
            "content": "'Cell 211' or 'Celda 211' as it was originally titled is one of the best prison based movies I have seen. This is a very well made film that does a great job at building tension and keeping the viewer absorbed through new developments and twists.The film will keep you guessing and wondering what the inmates and Juan Oliver, the man stuck in the middle of it all, will do next. The film moves at a frantic pace and I struggle to recall a movie with such relentless tension and drama.Overall, a very well made prison film that does a great job at keeping the viewer absorbed.",
            "review_date": "2016-11-22",
            "lang": "en"
        },
        {
            "review_title": "What happens when you get caught up between right and wrong?",
            "content": "Cell 211 tells you a gripping tale of how a new prison guard, Juan Oliver, gets thrown in the front line of two warring philosophies: government officials trying to keep peace and order against mistreated inmates with nothing left to lose but their time in jail. What started out as a day for Juan Oliver (Alberto Ammann) to make an impression at his new job became a matter of life and death in a den full of savage criminals. Will he ever make it out alive and see his pregnant wife, Elena? Notorious prison war leader Malamadre, translates as \"Bad Mother\" in English, starts the revolution as he successfully takes the keys from an unknowing guard, freeing all the prisoners on the block. Juan's first day at work is supposed to be for tomorrow but he went an unlucky day ahead for a tour. This ends up with him getting injured from falling concrete while the prisoners take over. Left by the guards in the infamous Cell 211, Juan realizes his situation and the adrenaline for survival kicks in. When discovered and taken out to meet Malamadre, Juan lies and makes the inmates believe that he is but another criminal serving time.Quick-witted and smart, Juan navigates his way into unknown territory playing on the side of the prisoners as they turn the crisis into a hostage situation. The cell block holds members of the 'terrorist' group ETA (Euskadi Ta Askatasuna) and Malamadre uses this opportunity as a means for bargain. This brings the crisis to national attention instead of a localized one and the media experiences a blackout from what is truly happening inside the prison.Juan Oliver has to prove his worth as a new part of the group while posing undercover and trying to get his chance to escape. But he can't do this if he has Apache (Carlos Bardem), a snitch, watching his back all the time. How long can Juan keep his secret amidst a sea of the country's most wanted criminals? Let's just say, he knows how to deal with danger very well, having been in odd jobs before landing the prison route.Sharp, intense, and suspenseful, Cell 211 will keep you at the edge of your seat while making you cringe on specific gruesome scenes. It doesn't shy away from obvious character development ad consistency as you continue to root for Oliver and his attempts to free himself from the testosterone filled atmosphere. While focused on the thrilling and suffocating scenario, the flick also tackles the idea of trust and friendship. As the situation gets out of hand, a newly formed alliance is tested as Juan begins to question which side he is really on.Versatile actor Luis Tosar cements his reputation in this high-tension flick, playing the vicious yet sarcastic skinhead Malamadre. He has the ability to display several shades of his character in one scene through gestures and delivery of lines. Newcomer Alberto Ammann does not disappoint as he is able to take on the panic of being stuck in a life-threatening situation onto the screen. Marta Etura's presence increases the drama and tension of film, earning her a win for Best Supporting Actress. Based on their performances in the film, it is no doubt that the flick is deserving of its 8 wins in the Goya Awards (the Spanish version of the Oscars). Director Daniel Monzón has created a film that is sure to leave a lasting impression. I am eager to see more films from him in the future.Cell 211 is a highly suspenseful, Stockholm Syndrome inducing prison drama that will keep you juggling sides with what is LEGAL and what is RIGHT.",
            "review_date": "2013-09-19",
            "lang": "en"
        },
        {
            "review_title": "An excellent Spanish Thriller. Don't miss it.",
            "content": "Set in a Spanish prison. A riot breaks out, leaving a new guard on the inside where all the action is. His quick thinking to pretend to be a new prisoner saves his life for now... But the mayhem is only just beginning.The two main players, Malamadre (Luis Tosar) as the top dog inmate and Juan (Alberto Ammann) as the young newbie guard act their parts extremely well. The other prisoners and guards are also believable. Prison is definitely not somewhere I want to go! The movie is raw and realistic with the different fractions within the prison jostling for their position. The guards may not be any better than the prisoners. But it's also a movie about love, friendship and loyalty. Don't let the fact it's subtitled put you off. You won't even realise your reading it and will be gripped to your seat for two hours. You don't need megabucks of special effects and well known actors to have a great movie. Just a good story well acted. Any Hollywood remake is not going to be nearly as good as the original. So don't miss this one.",
            "review_date": "2014-01-27",
            "lang": "en"
        },
        {
            "review_title": "Not bad, but I wasn't quite convinced",
            "content": "\"Celda 211\" is very well paced and directed by Monzón, and Luis Tosar gives one of the best performances of his already impressive career; but other actors do not fare quite as well (Antonio Resines, for example, is clearly miscast in a role that demanded someone much more brutal and unsympathetic), and, more importantly, at certain points the story hinges on increasingly implausible turns of events in order to move the plot forward, which in the end left me with a feeling of skepticism and detachment. I suppose they are the kinds of things that work on the written page (the film is based on a novel), but just don't translate well to the realism and immediacy of the screen. Not quite as good as I was hoping then, though it still stands out among Spanish filmic output.",
            "review_date": "2010-01-24",
            "lang": "en"
        },
        {
            "review_title": "Cell 211",
            "content": "Richard Pena, Program Director of the Film Society of Lincoln Center, kicked off the Opening Night of the 18th edition of Spanish Cinema Now series at Walter Reade Theater by calling to the stage actors, directors and dignitaries who were in attendance for the New York premiere of Cell 211.Ignasi Guardans Cambo, General Director of the Spanish Film Institute (ICAA) of the Ministry of Culture, compared the Spanish Cinema Now series to an introduction of \"this years harvest.\" A fine analogy considering the honest effort, time, sacrifice, teamwork and small miracle in tilling a harvest .The Director of Cell 211, Daniel Monzon, closed out the casual pre-screening ceremony by expressing his warm appreciation for the opportunity to screen in New York City, the setting of King Kong, the movie that inspired his career.Cell 211 opens with a scene of of detailed action. Before any introduction to characters, we meet pain and suffering. A provocative first round.Juan Oliver, played by Alberto Ammann, is starting a job as a prison guard. He decides to show initiative by going to the prison a day early for a lay of the land. He \"kisses\" his beautiful and preganant wife goodbye and heads to work.Be careful of how you make a first impression and who you choose to make it on.Juan's tour of the prison facility takes a turn for the worse and, as Monzon puts it, he is put through \"the worst things a human can go through, in 30 hours.\"The action and motivation in Cell 211 hangs on plot and role reversal. In the end the bad man is \"more noble than then guardians of law\" said the director. Monzon was asked during the post-screening Q&A if he hoped the movie would affect change in the Spanish prison system. \"I should be so pretentious.\"Portraying elements of the prison experience with truth and honesty was important to the filmmaker. Time was spent with infamous prisoners during the development process, filming took place in a functioning prison and extras were actual prisoners. \"I don't know,\" said the director when asked on how he was given such access. \"Seduction.\"Alberto Amman, in his first film acting role, puts in a solid performance. Monzon spoke of a conversation that he had with the novice actor in which Ammann said he felt he was \"cheating\" alongside proved actors like Luis Tosar, who humanizes the portrayal of the violent Malamadre. Monzon directed Ammann to harness that feeling as it fed directly into his character's mode of survival.The entire cast is up to task in Cell 211, including Carlos Bardem, Javier's brother, who plays a slippery jailhouse thug.Check out Cell 211 showing today at Walter Reade as part of Film Society of Lincoln Center's Spanish Now series. Don't fret if you cant get tickets. IFC announced earlier in the day that it will distribute the film through Festival Direct VOD program and the Director \"hopes for some theatrical relaease, too.\"The movie is ripe for remake and Richard Pena said as much in his introduction of Cell 211. Don't expect a solid remake. Watch the original.Below is a link to Cell 211's Spanish language websitehttp://www.celda211.com/and a link to information on the Film Society of Lincoln Center's Spanish Cinema Now serieshttp://filmlinc.org/wrt/onsale/spanish09.htmlRC",
            "review_date": "2009-12-05",
            "lang": "en"
        },
        {
            "review_title": "A very well made Spanish prison film",
            "content": "Based on a novel by Francisco Perez Gandul the Spanish film Cell 211 was critical hit around the world and already set to become a cult hit. This is even more impressive because Daniel Monzon's career as a writer/director was weak before that.Juan Oliver (Alberto Ammann) is a man in his early thirties with a pregnant wife Elana (Marta Etura) who about to start a job as a prison guard in Zamora, Spain. He ends up getting caught up in a prison riot led by an infamous criminal Malamadre (Luis Tosar) and Juan has to pretend he is a new prison. Juan shows his intelligence, working with Malamadre and acting as a inside man for the authorities. But events also have politically dimension when Malamadre makes three ETA terrorists their hostages and SWAT can not just go in because it could affect the Basque government.On the DVD cover in the UK Total Film describe Cell 211 as Die Hard meets A Prophet: I do not think that is correct. I see Cell 211 more as a interesting thriller set in during a prison riot. Monzon made a very fast paced film that does not hold back with the violence, its starts with a man slitting his own wrists. The prison feels real, a tight concrete structure that was delaying and a under resourced. Monzon uses a lot quick camera movements to enhance the tension and gives Cell 211 a little more a raw feel. It works particularly well in the enclosed environment. Monzon knows how to craft set pieces like the riots inside and outside the prison. I really like Roque Banos' percussion heavy music that was very fitting for the film particular when Monzon had to ratchet up the tension and the stakes.There are great performances from the two leads. Tosar reminded me very much of John Malkovich's character in Con Air, both looking the same and have both are the leading of a prisoner revolt. But whilst Malkovich played his character a highly intelligence blockbuster villain, Tosar's character was simply a man with decent brain but he simply a man who ruled with an iron fist. He was willing to use violence means of controlling people and only allows something to happen if it has a greater benefit. Ammann is was very strong, playing a character with knowledge and intelligence, someone who is resourceful and does what he needs to do to survive. He was a very talented actor and shows he has real range, I certainly would like to see him in more films, whether it is in Spanish or English speaking roles. The supporting actors were too were very strong throughout, from the nice prison guard (Fernando Soto) to the negotiator (Manuel Moron) to even the characteristically evil guard Utrillo (Antonio Resines). Ammann also had real chemistry with Etura and they felt like a real couple.Cell 211 is not perfect, there are moments that felt force or contrived and some that it voyaged into fantasy then reality. It took an accident for Juan to be caught up in the riot and he ends up being at the centre of the riot despite only being in prison for one day to the being of the leading figures in. I also believe that if a guard or anyone is killed the prison would send in SWAT or the riot squad as soon as possible.A interesting possible plot would have been that riot leaders were split and that Juan tries to exploit it so he could escape or end the riot. Or another possibly could have been Juan trying to keep low during the riot and find a way out.Cell 211 is a more mainstream film because of its plot and style. This is a prison film that people are usefully interested and it is a very well, entertaining film. It certainly has a feel of a Hollywood film and Paul Haggis is already planning a remake.",
            "review_date": "2012-01-12",
            "lang": "en"
        },
        {
            "review_title": "Great!",
            "content": "Just like i saw somewhere, exactly what i expected! A story about the new guard in prison who are pretending to be a prisoner becuase he locked up with prisoners when they are trying to get good life in there because they now they cant be free from there. Very sad end for me, really good movie!",
            "review_date": "2019-07-15",
            "lang": "en"
        },
        {
            "review_title": "A desperate attempt to survive an agonizing ordeal could make you do what you can't even imagine!",
            "content": "Cell 211 is a beautifully crafted prison drama which has a plot not easy to foresee and which surely leaves you in suspense till the end. It's easy to compare the movie to the Academy Award nominee \"Un prophète\" but I believe that shouldn't be the case. The director of \"A prophet\",Jacques Audiard claims his movie aims at \"creating icons, images for people who don't have images in movies, like the Arabs in France\". I would not want to spoil the fun for those who have not seen \"Un Prophete\" yet so let me just put it this way: In \"A Prophet\" you see a greenhorn prisoner climbing the stairs of a veneer of respectability by taking advantage of all the racial hate and struggle around him. Celda 211 is a whole different take on the prison life. Juan Oliver (Alberto Ammann) is supposed to start his work as a prison officer that day. He has apparently done a few odd jobs before.In his own words :\"First a slaughterhouse,now a prison.\" During the introductory tour of the prison he passes out because of some material that fell down from the ceiling. Instead of taking to a infirmary they rush him to the vacant cell 211 where one of the prisoners had cut his wrists because he couldn't take the pain anymore. Something that starts like a small revolt changes the life of this guy forever. While many of the movie aficionados have heard of Oscar nominees \"El secreto de sus ojos\" and \"Un Prophete\" it seems like this movie has not been rated enough. For me it was as good as maybe a lot better than Un Prophete. The acting is great. The cinematography is really convincing. This is a great story of loyalty,friendship and cojones!The movie thoroughly deserves all the Goya Awards it got!",
            "review_date": "2010-04-27",
            "lang": "en"
        },
        {
            "review_title": "Punch in the stomach",
            "content": "I like it. Though hard to digest because of the absurd situation that ends up in almost a Kafka situation. Almost too absurd to be true..but in the end the only difference between fantasy and reality is that fantasy has to be logic. And this one lacks of logic. The pregnant woman that goes in the middle of the demonstration in front of the prison, the unexperienced policeman that cheats on the though guy, the end of the movie in which the police enters in the prison though it satisfied all of the request..I don't know... Anyway, I liked the European taste it gives. The prison from Zamora is different from all of the prisons you have seen in the American movies. A tough sense of reality.",
            "review_date": "2010-04-25",
            "lang": "en"
        },
        {
            "review_title": "Imprisoned",
            "content": "Accidental undercover could be another title of this. It is made clear early on, who's who and this is a good thing for the movie. Bringing the outside \"world\" into the prison is great. And it also is a good thing that this is not as clichéd as a US Remake probably will be. The characters are very well drawn and you get shades of gray thrown into the mix here too.While it mostly plays inside the walls, we also get glimpses into the outside world, which isn't necessarily better than the guys who are inside the walls. A movie that does criticize as much as it does entertain and is good with both those things.",
            "review_date": "2014-08-05",
            "lang": "en"
        },
        {
            "review_title": "Great film, Highly recommended",
            "content": "Cell 211 was out together so well, It had you constantly thinking and waiting for something huge to happen next. I highly recommend this to other viewers for it's elaborate plot, and amazing actors. I was never once bored of this film it constantly feeds you something to keep you on the edge of your seat. Even if you do not like subtitles this is a great film that will not let you down. The main thing I enjoyed about this movie is the character choices, Malamadre is one of the best criminal in my opinion he fit the role to it's perfection as did Juan with his quick thinking and acting made this the amazing movie that it is.",
            "review_date": "2013-04-29",
            "lang": "en"
        },
        {
            "review_title": "Rough and entertaining...",
            "content": "Do not shy away from \"Cell 211\" just because it is a Spanish movie. \"Cell 211\" is a very entertaining movie that kicks off in high gear from the very beginning and never slows down. It is a good and interesting story that is accompanied by some strong acting performances.The story is about Juan Oliver a prison guard starting a new job at a prison. He shows up for work a day early to show initiative, loyalty and to show a good example. But Juan showed up on the wrong day, as he steps into a vicious prison riot that will have all of Spain in an uproar.Prison movies tend to follow a fairly generic guide of how to make a movie, and \"Cell 211\" does follow that guide as well, but it does manage to step out of this mold and go one step further. The storyline is driven by a well-written story that sinks into you and carries you along for a great ride. But it is also helped very nicely by the acting talents.While the tone is rough and cold, you can't help but get attached to the storyline and characters, because it is all so nicely put together and executed on the screen.Luis Tosar (playing Malamadre) and Alberto Ammann (playing Juan) were both phenomenal in this movie, both on their own but also opposite one another.\"Cell 211\" is a surprisingly good prison movie that you have to watch if you enjoy the prison movie genre. And put aside any fear of foreign language films you might have, because this one is well-worth spending 108 minutes on.",
            "review_date": "2015-12-27",
            "lang": "en"
        }
    ]
}