{
    "rating": 8.7,
    "release_date": "1935-04-22",
    "num_reviews": 290,
    "genres": [
        "English"
    ],
    "summary": "After recovering from injuries sustained in the mob attack upon himself and his creation, Dr. Frankenstein (Colin Clive) falls under the control of his former mentor, Dr. Pretorius (Ernest Thesiger), who insists the now-chastened doctor resume his experiments in creating new life. Meanwhile, the Monster (Boris Karloff) remains on the run from those who wish to destroy him without understanding that his intentions are generally good despite his lack of socialization and self-control.",
    "reviews": [
        {
            "content": "This is my favorite Frankenstein movie. The blind man scene was beautiful, Dr Pretorius was great and Henry Frankenstein well played by Colin Clive. I would call this a masterpiece.",
            "review_date": "2023-03-23",
            "source": "rt"
        },
        {
            "content": "Con esta secuela concluye el argumento de la novela original y Karloft sigue dando lo mejor de si como el monstruo de Frankenstein. Al igual con la película anterior, esta presenta momentos inolvidables e iconicos como la famosa frase del monstruo \"Fuego malo\" o la iconica apariencia de la novia del monstruo. El único detalle es que este film mas que ser de horror, se orienta mas al humor negro.Esta película es una de las mejores secuelas que se hicieron y James Whale pudo continuar el resto de la novela a su estilo de una buena manera. Tanto esta como su predecesora son películas dignas de ser consideradas clásicos de oro y obras maestras del cine. Mi nota para esta película es un 9/10.",
            "review_date": "2023-03-09",
            "source": "rt"
        },
        {
            "content": "One of those rare instances where the sequel exceeds the original. As good as Frankenstein is, I prefer this one slightly more.",
            "review_date": "2023-02-25",
            "source": "rt"
        },
        {
            "content": "Bride of Frankenstein is one of those rare sequels that is actually comparable in quality to the original.  Basically a continuation of Frankenstein from four years earlier, it turns out that Dr Frankenstein (Colin Clive) and his monster (Boris Karloff) somehow survived the fire that destroyed the castle at the end of the film.  The good doctor is blackmailed by another mad scientist into creating a partner (Elsa Lanchester) for the monster, at which time the fun begins.  The production qualities that made the first film so effective are evident in the sequel – effective lighting and camerawork, some beautiful sets, and lots of crackling-good sound effects.  It's a shame that the bride's appearance is so brief, but that's a minor quibble about an otherwise excellent movie.",
            "review_date": "2022-11-04",
            "source": "rt"
        },
        {
            "content": "For being so old it still holds a story. And effects still not that bad almost comparable to watching a 80s movie. Classic movie.",
            "review_date": "2022-10-25",
            "source": "rt"
        },
        {
            "content": "for some reason i thought the bride was gonna be in more than 2 minutes of the entire film, bahaha. i think the beginning of this film was really clever, actually, so 3 stars for that. the rest of the film was just \"meh\" for me. it's an alright watch, i feel like it's a classic you can't pass up, but it's pretty forgettable.",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "One of those rare sequels that is up to par maybe even better than the original and one of the greatest tragedies of all time",
            "review_date": "2022-10-05",
            "source": "rt"
        },
        {
            "content": "Why is the bride only in like five minutes of the movie?",
            "review_date": "2022-09-10",
            "source": "rt"
        },
        {
            "content": "The first perfect horror sequel it includes elements from the book not touched on in the previous film. The ending is really risky for the time.",
            "review_date": "2022-06-04",
            "source": "rt"
        },
        {
            "content": "I love the first Frankenstein, it was shocking and enthralling despite the complaints of it being dated and slow. Maybe so but I still love it. The Bride of Frankenstein is a wonderful sequel to an already wonderful film, and surpasses it technically I feel. Even if the acting is a little forced in the beginning scene, with the exception of Elsa Lanchester, that is such a minor flaw compared to how good and enjoyable this film was. If you ask me Bride of Frankenstein is one of the greatest achievements in the history of horrordom.\n\nFirst of all, it is extravagantly produced. The sets are really imaginative, the cinematography is beautiful and the costumes are extravagant. Along the way I noticed two improvements compared to the first film. One is that Bride of Frankenstein is faster in pace, and two the music score is more haunting and melancholic here, Franz Waxman was the perfect choice for composer. Bride of Frankenstein also has some really effective scenes, the ending was very well done as was the unveiling of the bride to the sound of wedding bells and the miniature people in the bell jars, but I found the scene between the monster and the blind hermit especially touching. James Whale's direction is innovative just like in the first film, and the script is also very good and adds to the atmosphere. The acting is excellent, Colin Clive is very good once again as the eccentric Henry Frankenstein, and Ernest Thesiger gives a genius turn as Doctor Pretorious. Valerie Hobson is alluring and sympathetic as Elizabeth, occasionally overdoing it with the hysteria but she was fine overall, while Elsa Lanchester is good as Mary Shelley but electrifyingly beautiful as the bride. Once again though, Boris Karloff gives the finest performance, his towering presence and frightening look ensures for some scares, but he is very poignant as well, as his monster only wants to fit in and is rejected by everybody.\n\nOverall, a wonderful sequel, and not to be missed! 10/10 Bethany Cox",
            "review_date": "2022-04-25",
            "source": "rt"
        },
        {
            "content": "7/10 charming, striking",
            "review_date": "2022-02-19",
            "source": "rt"
        },
        {
            "content": "Universal Studio in the height of the Hollywood Studio System was famous for three things that kept it in the black besides those famous studio tours that survive to this day. The Deanna Durbin musicals, the Abbott&Costello comedies and those great Gothic horror films with Dracula, The Wolfman, The Mummy and most of all Mary Shelley's Frankenstein. Those sets were used over and over again, you can recognize them if you're a real student of the genre.\n\nAlthough some have criticized it, I rather like the beginning of Bride of Frankenstein in a Regency drawing room where the creative minds of Lord Byron, Percy Shelley, and Mary Shelley are meeting. Of course the subject gets around to how she would continue the story, it just can't end right there. So while Gavin Gordon as Byron and Douglas Walton as Percy Shelley listen, Elsa Lanchester as Mary Shelley starts to tell about the further doings of her characters.\n\nOf course Colin Clive as Victor Frankenstein thought dead when he was brought out of the ruin, turns out to be alive, but in need of medical attention. The monster is also not dead, he's been put together even stronger than an ordinary human. As is first two victims he kills the parents of the little girl he killed in the original Frankenstein film.\n\nWhile Clive is recuperating at home under the care of his wife played here by Valerie Hobson, Clive receives a visit from his former teacher and mentor who originally aroused his interest in experiments along this line. Ernest Thesiger is Doctor Praetorious, a scientist whose reputation is more dubious than that of Frankenstein. He's been experimenting with bringing people back to life and he shows his little creations to Frankenstein. What he describes sounds a lot like cloning Mini Mes as Doctor Evil did. But DNA was not heard of back in the early 19th century.\n\nHe thinks they ought to combine there efforts and create a female back from the dead to be a mate for the Frankenstein monster. Who knows if the big guy gets a little something something at home, maybe he won't have quite such a bad attitude. When the monster after wreaking havoc again on the countryside is finally back in the Frankenstein laboratory, he insists on a 'friend' for himself. It's a real mess that Clive has gotten himself in again.\n\nBride Of Frankenstein with that incredible climax when the monster tries to court his bride will still give you frights for weeks on watching it. The Gothic horror atmosphere that James Whale created on the Universal sets is still capable of creeping one out.\n\nBoris Karloff did not repeat his monster role after this and Colin Clive died in 1937 before the next Frankenstein film was made. Still the cycle may have been the most successful of all the Universal monster franchises. It certainly my favorite of all of them.",
            "review_date": "2021-12-19",
            "source": "rt"
        },
        {
            "content": "Very campy, contrived plot, overacting all over the place and yet... it all is greater than the sum of its parts.  Very enjoyable to watch, with possibly the earliest \"twist\" ending in film history.",
            "review_date": "2021-12-01",
            "source": "rt"
        },
        {
            "content": "Classic horror film, that while technically dated in some storytelling techniques, remains a landmark in cinema.  The cast is superb across the board, though a little campy, with Boris Karloff once again giving a brilliant performance as the Monster, both menacing and heartfelt.  Behind the camera, James Whale delivers a more layered story than the previous one, with the Monster neither a victim nor hero (he kind of does both good & bad, showing he's actually human).  Plus, the make-up effects are outstanding, in more so in modern HD, so off the gruesome details.  All in all, a classic in the truest since of the word.",
            "review_date": "2021-11-07",
            "source": "rt"
        },
        {
            "content": "What a strange departure. Where the original Frankenstein was simple but direct, lean and effective and memorable for the right reasons, Bride of Frankenstein is forced, meandering and overproduced.\n\nDisregarding the ending of the initial adventure is a bad way to start, especially when that moment was such a key part of what made the story so powerful. Here, after a long dalliance in Mary Shelley's parlor(?!) and a rapid recap of the saga so far, we learn that creature and creator have each miraculously survived near-certain doom, and neither appears to have learned from their mistakes. I say this because both are almost immediately right back at it, doing the same crap that delivered them to death's doorstep in the first place. For a mindless monster, that can be forgiven (though Bride quickly transforms him from a stumbling hulk of raw emotion to a speaking, stogie-smoking antithesis), but Doc Frankenstein had effectively denounced his own actions when last we saw him. And why should I buy in for the epic conclusion this time, knowing how permanent the last one turned out to be? You just erased it an hour ago!\n\nStill, the chase to replicate the mad doctor's one-off experiment is a catchy catalyst; the potential of a mate for the lonesome creature a tempting tease. The giant's passing friendship with a blind priest is strong material, if far too fleeting and simplistic. There are several such effective flashes, glimmers of potential amidst all the oddball distractions and broken promises, but they're entirely unrefined and unrealized. Worst of these offenders is the bride herself, who exists more as an idea than a legitimate character. After so much anticipation, it's tough not to feel deflated when she springs to life for all of five minutes at the very end and then fizzles out like a wet firecracker. Efforts are made to conclude the story with profundity once again, but this time the lesson is less organic and nuanced. A blunt, strained farewell for a gaudy, pointless sequel.",
            "review_date": "2021-10-22",
            "source": "rt"
        },
        {
            "content": "A must see movie about the Bridge of Frankenstein!!!!!",
            "review_date": "2021-09-07",
            "source": "rt"
        },
        {
            "content": "Really high expectations coming off the original, but didn't quite meet the standards I had. Wasn't a bad film at all, just wasn't the best.",
            "review_date": "2021-07-27",
            "source": "rt"
        },
        {
            "content": "This is the greatest sequel of all time, and one of the truly great horrors from, who else, Universal. Part of it's wonderfulness is James Whale just having a laugh; having been made to do a sequel, he just has fun with it. How else to explain Ernest Thesiger? The little homunculi? But Elsa Lanchester gives great Bride!",
            "review_date": "2021-03-24",
            "source": "rt"
        },
        {
            "content": "The Bride of Frankenstein is truly a wonderful spectacle of horror cinema. Its ideas and themes of humanity and redemption, along with an extraordinary story and characters make this the absolute greatest horror movie sequel ever made.",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "A sequel that had a greater impact than the original, despite the fact (or maybe because of it) that there are also elements of parody in it.",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "Its predecessor may have been a major force in the establishment of the monster genre, but The Bride of Frankenstein is a major improvement in almost every way, integrating technical effects and cinematography that were far ahead of most of its contemporaries, even in a genre that has historically encouraged experimentation. The film operates well both superficially and as a vehicle for more nuanced interpretations, particularly in its treatment of morality, religion, and, interestingly enough, sexuality and the taboo, skirting censorship through the excesses of horror. Among the greatest of the classic monster films with elements that provide it with a more secure position in film history than most of its era. (4.5/5)",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "Loved this film! So many off the wall, humorous characters. The story does focus more on Frankenstein, than the bride. Boris Karloff wonderful as the creature who wants to enjoy what life has to offer.",
            "review_date": "2020-12-23",
            "source": "rt"
        },
        {
            "content": "Bride of Frankenstein continues the right where Frankenstein (1931) left off, it is goofier than the original, and not as scary. The ending happens so abruptly. Reasonably entertaining old-school horror",
            "review_date": "2020-10-28",
            "source": "rt"
        },
        {
            "content": "it is a very good old film that is worth watching only that the film is in black and white that ends up making you sleepy.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "Nice pacing. Some might find it boring due to it's age, but recommended if you want to watch a bit horror history.",
            "review_date": "2020-10-21",
            "source": "rt"
        },
        {
            "content": "Electric camp performances and terrifying horror premise!\n\nJames Whale's horror comedy The Bride of Frankenstein (1935) is the beginning of tongue in cheek horror movies. It's peak camp for fans of the genre. Whale sarcastically answers critics of Frankenstein's (1931) abrupt ending with a new spin on The Monster entirely. This movie is a compendium of the origins of every bit of pop culture references to Frankenstein until Mel Brooks' Young Frankenstein. \n\nWhale delightfully opens The Bride of Frankenstein with Elsa Lanchester, Douglas Walton, and Gavin Gordon playfully framing this narrative as Mary Wollstonecraft Shelley, Percy Bysshe Shelley, and Lord Byron. This meta humor sequence is both riveting dramatically with an eerie stormy night atmosphere and wonderful with its self aware humor. It spells good omens for the proceeding picture. Mary Shelley's writing is timeless and gives birth to this new Frankenstein creation of her novel and script writer William Hurlbut. It's fitting that Elsa Lanchester plays both Mary Shelley as well as Frankenstein's Bride because she's truly married to The Monster.\n\nBoris Karloff is great and expressive as the now sympathetic Frankenstein's Monster. He demonstrates Shelley's moral wish that men not pretend to be God because he is an unloved creation, treated horribly by all, thus he turns to violence against his creator. The Monster lives with no guidance until he meets a kindly old blind man played so affectionately by O.P. Heggie. Karloff really sells learning to speak and finding simple joys in the small things in life. You root for him by the end. Elsa Lanchester is excellent and fun as The Monster's Bride. I do wish we saw more of her, but she serves her purpose in The Bride of Frankenstein's shocking finale.\n\nColin Clive is excellent as the regretful and reluctant Dr. Frankenstein. Valerie Hobson is wonderful and empathetic as Baroness Elizabeth Frankenstein. I must mention the outstanding campy performance from Ernest Thesiger as Doctor Pretorius. His crazed ramblings and wild scream really sell this mad scientist akin to Dr. Frankenstein as his new foil. Una O'Connor is just hilarious as the hysterically yelling Minnie. Dwight Frye is fun also Karl too. \n\nTed J. Kent cuts together all manner of acting footage and special effects in a succinct 75 minutes. John J. Mescall's cinematography features gorgeous black and white lighting, wide shot framing, and striking close-up shots, with atmospheric fog galore. What's not to love? Franz Waxman's score is very pretty and surprisingly bright for such a dreary tale. He contributes to the camp factor tremendously. Vera West's costumes are nice for all the period outfits, but The Bride of Frankenstein's white wedding dress is particularly dazzling. Jack Pierce's Frankenstein make-up is legendary, but his big hair with white strips hair highlights for Frankenstein's Bride is iconic.\n\nIn all, The Bride of Frankenstein may be the better overall film than James Whale's Frankenstein.",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "It's entertaining enough if you're wanna look at old campy monster films during the Halloween season while exploring the origins of the iconic household reference.",
            "review_date": "2020-10-16",
            "source": "rt"
        },
        {
            "content": "The 1931 Frankenstein is a horror classic, and remains one of the greatest cinematic metaphors for discrimination and prejudice in history. The 1935 follow up, which is often called one of the best sequels of all time, felt to me like a big step down. Most of the film consists of long scenes of dialogue which could easily be trimmed down, and the plot is all over the place. The original was meandering at times but was mostly coherent and had no problem getting its points across. Bride Of Frankenstein jumps all over the place, and at times is just flat-out nonsensical. At the end of the original the town form a mob to kill the Monster, and seem very pleased with themselves when they believe they have. Here, when they discover the monster is still alive, they once again form a mob, but this time they tie him up and drag him off to jail. Why don't they try killing him again, especially since he's stuck in the prison for about 2 minutes before breaking out again and running off? I had no problem with him talking, and I think if the film had centred more on his attempts to fit in with the society that hates him, I would have been more interested. But the films spends so much time trying to create its titular bride, and when she does finally appear the film ends about 5 minutes later. Her and the monster barely share a scene together, and then the credits role. She has an iconic looks for sure, but there's virtually no reason for her to be there. I can't say I agree that it exceeds the original, and given the choice, I'll choose the first one every time.",
            "review_date": "2020-10-16",
            "source": "rt"
        },
        {
            "content": "The Universal marketing campaign for this should have done the same trick as MGM did with Garbo, but with the tagline \"Frankie Talks!\"",
            "review_date": "2020-10-09",
            "source": "rt"
        },
        {
            "content": "It's aged about as well as your great great great grandma. This is film is dead. Boris tried hard but he's as bad as all the other melodramatic parts in this film.",
            "review_date": "2020-10-06",
            "source": "rt"
        },
        {
            "content": "It really is the cream of the crop for the old Universal flicks. It's everything you heard it is. Sure the bit with the tiny people is a bit too goofy, but besides that it does everything you'd want from a sequel, hitting stronger dramatic beats, and having an even sharper sense of black humour. All the while giving the monster an even more tragic journey. This is how sequels ought to be done. They don't get much better.",
            "review_date": "2020-09-30",
            "source": "rt"
        },
        {
            "content": "One of the greatest films ever made. The whole film, and especially the ending, is very emotional and well directed as well. It holds up extremely well!",
            "review_date": "2020-09-17",
            "source": "rt"
        },
        {
            "content": "Great atmosphere, as well as great direction from James Whale, make this film and an iconic performance from Boris Karloff reinforce this making this film a classic.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "Not as good as the original but still a lot of fun.",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "is a revolutionary film, although it seems that it has aged badly with time",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "4.5/5.  An excellent sequel that is both fun and thoughtful.",
            "review_date": "2020-03-15",
            "source": "rt"
        },
        {
            "content": "Best of the Universal monster films.",
            "review_date": "2019-11-23",
            "source": "rt"
        },
        {
            "content": "Bride of Frankenstein is one of the rare sequels that begins mere seconds after the prior movie ended. In fact, it overlaps the final scene of Frankenstein a little bit. My memory of the original film was a little hazy, because I thought the Doctor died at the end, but it didn’t take me long to get back up to speed with this story. I think the interesting thing about these classic monster films is that they feel so stripped down and streamlined. Because the plot points are so familiar, I kind of expect each scene, and there is little else beyond those expected scenes because the runtime is a mere 75 minutes. What I was looking forward to with Bride of Frankenstein was seeing something unfamiliar and exploring where the story would go next. Strangely, though, this largely felt rote as well. It’s a relatively simple film about the original monster terrorizing the countryside while the doctors work to make him a mate. I expected more interaction with the Monster’s Mate, but she doesn’t come to life until the last few minutes. I never got a solid grasp on why these doctors thought that making a bride for the monster was a good solution, particularly because the monster is still going to be ostracized, killed, or imprisoned because it has murdered people. Yet I get the feeling it’s something Doctor Pretorius wants to do simply to see if it can be done, and he’s the driving force of the film. He totally fits the profile of a classic “mad scientist” while Doctor Frankenstein is more restrained now. My favorite moments in the film were actually some of the side stories that are somewhat tangential to the main plot. I loved the Monster’s friendship with the blind man. That whole sequence was delightful. I also found it fascinating when we got to see the results of Doctor Pretorius’s experiments. I would never say the main plot was boring or bad, but it just lacked excitement for me. I almost felt like I was watching a movie go through the motions until it reached an inevitable conclusion. It is the kind of film I can appreciate for what it was at the time, but I simply can’t manage to be wowed by it today.",
            "review_date": "2019-11-21",
            "source": "rt"
        },
        {
            "content": "Absolutely stunning! \"Bride of Frankenstein\" is just a seminal film on so many levels - and just so good! The acting, the sets, the story, the direction and all to the dramatic final show down! We've all seen the mad science scene so many times that its become such a used up trope that you forget how groundbreaking this was for 1934. And all executed near flawlessly! Yes, the film seems campy and dated at times, but those are very rare moments. And yes, you can't help thinking of Mel Brooks' \"Young Frankenstein\", but to me that is just further affirmation of what an absolute classic this film is. The continuity from the original film is extremely well done. And the character of Dr Pretorius, played outstandingly by Ernest Thiseger, was genius. All the other actors fully get in to their roles led by Colin Clive as Dr Frankenstein, Valerie Hobson as his fiancee, Una O'Connor as the cut-up Minnie, and - of course - the standout turns by Boris Karloff and Elsa Lanchester as the monster and his bride. Phenomenal film!!!",
            "review_date": "2019-11-08",
            "source": "rt"
        },
        {
            "content": "If you get really scared, run to the cemetery to hide!",
            "review_date": "2019-11-01",
            "source": "rt"
        },
        {
            "content": "I prefer the original. This one is no doubt more polished in technical terms and direction, and the sequence with the blind man is excellent. However the over-acting was amplified here and certain elements like Dr. Pretorious's miniature experiments were just bizarre and out of place instead of scary. I wasn't a fan of how 'the bride' doesn't appear until the last 5 minutes either, only to be killed off quickly. Good enough sequel, but I prefer its predecessor.",
            "review_date": "2019-09-26",
            "source": "rt"
        },
        {
            "content": "Good movie but you have to ignore the over the top acting.",
            "review_date": "2019-06-07",
            "source": "rt"
        },
        {
            "content": "Mary Shelley reveals the main characters of her novel survived: Dr. Frankenstein, goaded by an even madder scientist, builds his monster a mate.\n\nUniversal intended to make a sequel to the monsterously successful film (Universal's policy was to use the same crew for the next film, which is why production was delayed four years, waiting for the director to become available again). \n\nIt has been noted, but the original 1931 FRANKENSTEIN should be seen first, as this one picks up the storyline where FRANKENSTEIN left off. Considering the combined running time of about 140 min, both films can easily be watched back to back. \n\nThe story sets off with a clever prologue between Mary Shelly (a short but great performance by Elsa Lanchester who also plays The Bride) and Lord Byron, who asks her to continue the tale of Dr. Frankenstein. \n\nWith almost the same cast including Colin Clive as Henry Frankenstein and Boris Karloff as the creature, Whale takes us to a mythical world where gods and monsters are alive and temptation can be deadly.\n\nEnter Dr. Pretorious, as an admirer of Frankenstein's work, he is decided to create his very own creature for his evil purposes; but first he must convince Henry to work with him. The creation will be a female version of the monster, since Pretorious has convinced the creature that all he needs is a partner.\n\nThe acting is superb, with the addition of Elsa Lanchaster in a double role as Mary Shelley herself, and Pretorious' creation; Ernest Thesinger as Dr. Pretorious clearly steals the show as the mad scientist who tries to change the world. His performance makes us to be both horrified and attracted to him. He is the Mephisto of Frankenstein, a seducing tempter whose only concern is his own good.\n\nWhale's Direction is outstanding and the expressionist influence is notable through the film, giving it a very special look that sets the mood for the story.\n\nA masterpiece in its own right, this movie is a MUST see. Monsterpiece!",
            "review_date": "2019-05-11",
            "source": "rt"
        },
        {
            "content": "This big tree to \"Frankenstein\" shrub.",
            "review_date": "2019-03-23",
            "source": "rt"
        },
        {
            "content": "Suffers from its era's horrendous habit of soapy overacting, but does a remarkable of job of conveying the humanity of the monster.",
            "review_date": "2019-03-04",
            "source": "rt"
        },
        {
            "content": "A sequel done right, more of the material that makes the source material so iconic, the actors back in their classic roles, and special effects that amaze even today makes it an essential watch next to the original.",
            "review_date": "2019-02-19",
            "source": "rt"
        },
        {
            "content": "Considering I found the original Frankenstein film fairly mediocre, and I really couldn't stand the book, I was surprised how much I enjoyed Bride of Frankenstein.  It's a natural progression while still hitting a lot of the same highlights of the first, but its emotional strengths work so much better.  The lead of the film is very much the creature, and you really feel for him.  His primary drive in the film is just to find a friend, and every time he loses his chance to get a friend you genuinely feel bad for him.  The ending is a genuine downer, but it really works and nails in the message.  The imagery is great, the black and white visuals looking positively gorgeous, and the whole thing moves at a brisk pace never losing my attention.  One of the best in the Universal Monster catalogue.",
            "review_date": "2018-11-02",
            "source": "rt"
        },
        {
            "content": "Bride of Frankenstein is a very early example of why Hollywood shouldn't do sequels for great standalone films. This movie is so bad that it undercuts the legacy of the original Frankenstein movie. It turns the monster from a menacing threat to bumbling fool and it features plot points that make absolutely no sense. And when the Bride finally appears, she's not worth the wait. Universal shouldn't have tried to add to Mary Shelley's story.",
            "review_date": "2018-10-24",
            "source": "rt"
        },
        {
            "content": "This is actually the most one-of-the-kind in the genre at a surprisingly remarkable level when the horror became reversal with the initial, misunderstanding focus going through a very well-written sympathetic direction that not only standardized a structure for a sequel but also the structure of an empathetic monster creature film rather than a first-glanced horror flick. (B+)\n\n(Full review TBD)",
            "review_date": "2018-10-20",
            "source": "rt"
        },
        {
            "content": "James Whales follow up to his 1931 classic has some great development in The Monster and serves as further proof of the actors worth from the original and retains its thick atmosphere, but unfortunately decides to go for a more comedic storyline that feels somewhat forced, thus losing the creepy, disturbing themes of the original.",
            "review_date": "2018-10-01",
            "source": "rt"
        },
        {
            "content": "Didnt find it to be as good as the first one, but its still groundbreaking nonetheless.  You can easily see how this wouldve been scary in the '30s (83 years ago!!!).  The acting is again superb.  The plot is beautiful again, but theres too much similarity to part 1.",
            "review_date": "2018-09-20",
            "source": "rt"
        },
        {
            "content": "Masterpiece, which exceeds its excellent predecessor!",
            "review_date": "2018-08-22",
            "source": "rt"
        },
        {
            "content": "Possibly one of the best of the old Universal Monster movies. Showing the growth of Frankenstein's monster into a more fully fleshed out character. The relationship he builds with the blind man is truly amazing. It shows that we are not all what is on the outside. The heart of the monster can be tamed when treated with respect and courtesy. The Bride makes her triumphant appearance towards the end of the film and is truly amazing in her entrance. She upstages everyone else is just a minute or two of screen time. ",
            "review_date": "2018-08-21",
            "source": "rt"
        },
        {
            "content": "Todo un clásico del cine de terror de la Universal, y para muchos la mejor de todas estas películas de los 30 y 40. \n\nSin lugar a dudas la obra magna de James Whale, al mismo tiempo terrorífica, graciosa y enternecedora.\n\nEscuchad nuestro episodio dedicada a ella, que no tiene desperdicio...\n\nhttps://www.ivoox.com/terror-no-tiene-podcast-episodio-50-audios-mp3_rf_27581956_1.html",
            "review_date": "2018-08-17",
            "source": "rt"
        },
        {
            "content": "Needless to say, this film is a true classic of cinemas. I wouldn't mind if Hollywood wanted this film redone one day, but perhaps the studios should just keep it basic. A film like this reminds us that a good story is the strength of a film. We don't need cars flipping and helicopters crashing all the time in order to make a classic film come to life.",
            "review_date": "2018-08-16",
            "source": "rt"
        },
        {
            "content": "Great film. one of the few sequels that surpasses its' original. I loved Lanchester and Thesiger in this classic.",
            "review_date": "2018-06-22",
            "source": "rt"
        },
        {
            "content": "Commonly viewed as the best of the Frankenstein films, to me it lacked the genuine nature of the first and almost came across as a parody.",
            "review_date": "2018-06-18",
            "source": "rt"
        },
        {
            "content": "A beautiful horror movie that also makes you think and feel about the nature of man. The Monster is such a sad and sympathetic character. He is a character that did not wish to be born and is thrust into a world that he does not understand and that does not understand him. He longs for compassion and friendship and yet just when it's in his grasp it is gone. Frankenstein's monster is one of the best characters on film and is best done in this film.",
            "review_date": "2018-05-27",
            "source": "rt"
        },
        {
            "content": "Dramatic, emotional and actually touching, Bride is a powerful film that manages to be superior to the first one.",
            "review_date": "2018-05-01",
            "source": "rt"
        },
        {
            "content": "In my opinion, Bride Of Frankenstein is one of those sequels that is far better than the original. From the cinematography to strong characters, The monster in this film is the best portrayal of Karloff's career, balancing pathos with excellence. The expressionism is great from the woods to the castle, even the special effects have aged incrediblely well. The score was nominated for an Oscar and it shows through every scene it fits perfectly. From all around complex characters, amazing score, amazing cinematography and special effects make this my favorite film of the 1930s, I give it 10/10.",
            "review_date": "2018-03-17",
            "source": "rt"
        },
        {
            "content": "Making the choice to borrow a considerable amount of information from the book like it's predecessor was a stroke of genius,  And more or less highlighting The Monster this time around was brilliant.  Except the latter (The Monster's story), does ultimately detriment the story, because it does make's the B & W Classic slightly more rigid and uneven.",
            "review_date": "2018-03-12",
            "source": "rt"
        },
        {
            "content": "how beautifully dramatic..\n\nBride Of Frankenstein\n\nIt does seem redundant to re-open a tale that was both justified and satisfied and it is always a risk to mess with the originality of it which is why for the most of the time the sequels doesn't work as the expectations are way too high but somehow they have managed to cleat out all of these problems and it is equally just as good as the first one was. James Whale keeps it smart and uses his fame and the legacy of it perfectly and squeezes out the best from all of it. Boris is as always amazing in it and this time it seemed like more of his show and he gets enough range and stage to perform what he did on The Frankenstein in a small time; if you remember that girl that he kills while playing with her, similarly he has another encounter in here with a blind man which is the highlight of the movie. Bride Of Frankenstein is fast pacing, to-the-point and exhilarating with a gripping screenplay and has a stellar performance to mesmerize the audience.",
            "review_date": "2018-02-01",
            "source": "rt"
        },
        {
            "content": "I would have liked more screen time for the actual bride, but BOF manages to surpass the first film in some areas.",
            "review_date": "2018-01-11",
            "source": "rt"
        },
        {
            "content": "A crazy, unique, classic horror film, this is proof that a sequel can be better than the original.",
            "review_date": "2017-12-29",
            "source": "rt"
        },
        {
            "content": "A meditation on dismissal, desolation, quest for affection, toying with creation, life, death, acceptance and grief, it's a great achievement in itself. Also, the cinematography and direction are marvellous but while thematically it's powerful, it fizzles on other grounds and for today's age looks campy at best which sadly is a immense drawback in itself.",
            "review_date": "2017-11-28",
            "source": "rt"
        },
        {
            "content": "I give this a 98/A+.",
            "review_date": "2017-11-21",
            "source": "rt"
        },
        {
            "content": "Love Death... Hate Life!",
            "review_date": "2017-11-17",
            "source": "rt"
        },
        {
            "content": "There are some disturbing ideas worthy of deeming horror, but they're spread amidst a far more studio-controlled, campy set of fanfare schticks, which greatly detract from the somber, cogitative experience of the original.",
            "review_date": "2017-10-30",
            "source": "rt"
        },
        {
            "content": "'The Bride of Frankenstein' is a bit of a morality tale about hubris where good and evil are clearly there, but both shaded, Karloff's monster having gained the depth and humanity that it has in Shelley's novel and hasn't in 'Frankenstein'. But this sequel is also a horror flick which mixes its black wizardry feel to its tones of gothic art, reusing the sculptural décors of the first movie. Moreover, if some may be frustrated by its little length and time spent with the bride, I found the end to be a skillful call to the sequel 'Son of Frankenstein'. On the whole, it's easy to see why this is a classic of the horror genre and the strength of Whale's camerawork and of the wicked visuals is outstanding.",
            "review_date": "2017-10-22",
            "source": "rt"
        },
        {
            "content": "Solid and more refined than the original Frankenstein, Bride of Frankenstein is superior in almost every element. Not just in fact its extremely entertaining from start to finish. The new characters are great and mesh extremely well with the cast of the first film. We rediscover the humanity of the monster much more in depth this go around and highlights to not always judge by what we see.",
            "review_date": "2017-09-10",
            "source": "rt"
        },
        {
            "content": "Though this sequel to the 1931 original is better than the first film it is unfortunately let down by a big flaw in a relatively faultless film. That flaw is towards the end of the film where the titular Bride of Frankenstein is only onscreen for the final five minutes of the film and does absolutely nothing despite all the build up leading to her arrival which makes the ending unsatisfying and a big let down. The rest of the film is great though with a solid cast, a nice introduction, love the fact it is interwoven into the finale of the last film while also expanding upon what made that film great and simultaneously exploring new themes, the score is decent and the production is even better. It also has a real fun and camp tone to it and it ramps up the action and violence of the previous film to new and hilarious heights.",
            "review_date": "2017-08-17",
            "source": "rt"
        },
        {
            "content": "Outdoing the original, one of the best films I have ever seen",
            "review_date": "2017-01-08",
            "source": "rt"
        },
        {
            "content": "10 out of 10:\n\nThe Bride of Frankenstein takes away a lot of terror, but replaces it with a lighthearted film that still has an eerie setting and great costuming.",
            "review_date": "2016-10-10",
            "source": "rt"
        },
        {
            "content": "The Bride of Frankenstein has been deemed one of the greatest horror sequels as it improves a lot from the original from effects to character",
            "review_date": "2016-10-08",
            "source": "rt"
        },
        {
            "content": "Bride of Frankenstein is a very respectable sequel which is once again very well crafted, directed and acted but also more emotional and faithful to its source material this time around. The eponymous bride is very memorable as is Dr. Pretorius and the second half is phenomenal, but the first half is dragging, the editing is very mediocre leading to a rushed and abrupt ending and the film was too campy for my taste. It's a good film in its own right, but much inferior to the original.",
            "review_date": "2016-10-04",
            "source": "rt"
        },
        {
            "content": "Boris Karloff does such an amazing job at still remaining creepy when chained to a wall. The bad things about this movie is that the \"Bride\" is only in it for a minute. The rest of the movie is a weird plot line. Like why did Frankenstein talk, and why is there small people in bottles? All these problems, and more await you in this odd sequel.",
            "review_date": "2016-10-01",
            "source": "rt"
        },
        {
            "content": "Its incredibly more campy than the original, but it makes up for it with greater emotional complexity and technical prowess.",
            "review_date": "2016-09-19",
            "source": "rt"
        },
        {
            "content": "A sequel which improves on the original!",
            "review_date": "2016-08-17",
            "source": "rt"
        },
        {
            "content": "Still a very successful film, but not as masterful as the first one\nI give it a 94%",
            "review_date": "2016-07-26",
            "source": "rt"
        },
        {
            "content": "This is the sequel to the original Frankenstein movie.  A lot of people think this is a better movie than the original.  I don't think so.  The original was a pure horror story.  This one tries to be funny.  If you want to watch a funny Frankenstein movie watch Mel Brooks' Young Frankenstein.  It spoofs both of the first two Frankenstein movies.  This movie starts in 1816 with Mary Shelley telling her original story.  She changes the ending of the first movie to have Dr. Frankenstein and the monster survive the mob attack even though this was not in the original book.  The movie then skips forward to the 20th century.  Somehow early 19th century characters could see into the future and predict mid 20th century technology.  After the supposedly dead Dr. Frankenstein revives and the monster escapes and begins to roam about the country side.  A mysterious arrives to see Dr. Frankenstein and shows him these miniature people he has created and is keeping in glass jars.  After this new character finds the monster, he befriends him and the two of them pressure Dr. Frankenstein into creating a mate for the monster.  The movie then moves back to the castle lab where the Bride of Frankenstein is created.  When the female monster is terrified by the male monster there just happens to be a self-destruction lever that the monster finds.  As Dr. Frankenstein and his wife escapes the castle the monster pulls the lever and kills everyone in the castle as it collapses.",
            "review_date": "2016-05-22",
            "source": "rt"
        },
        {
            "content": "A classic. Though owning much to redoing scenes from the original.",
            "review_date": "2016-04-30",
            "source": "rt"
        },
        {
            "content": "Still, good Horror Classic film. With compassion, for the monsters bride, My point, is monster film is on par with the original.",
            "review_date": "2016-03-07",
            "source": "rt"
        },
        {
            "content": "Good sequels are the hardest pictures to make. \"The cat is out of the bag.\" If you've seen the original film, you know the theme of the sequels. No big surprises. IMO, only a few sequels were better than the original. \"Dawn of the Dead.\" \"Godfather II.\" And the over the top \"Texas Chainsaw Massacre II\" and \"Death Wish 3.\" \"The Bride of Frankenstein\" is the best of all of the above. The worst: Every sequel to \"Jaws.\"",
            "review_date": "2016-02-04",
            "source": "rt"
        },
        {
            "content": "-IGNORE THIS \"OUT OF FIVE\" RATING\n4/4\nBrilliantly campy (and subtle) sequel to FRANKENSTEIN is an even better film, and a movie going must. With an eccentric Dr. Pretorius indulging plan to give monster a bride(!) Dr. Frankenstein refusing to help the wicked idea. Never a dull moment; powerful, technically dazzling, striking on every level, with mesmerizing sets and thunderingly effective final sequence inside castle. Rightfully regarded as classic, and one of the greatest films ever made. Sequel: SON OF FRANKENSTEIN.",
            "review_date": "2015-12-04",
            "source": "rt"
        },
        {
            "content": "Sad and frightening, Karloff's performance is unnerving in its deep longing for purpose and understanding in a world that hates him for simply existing.",
            "review_date": "2015-11-02",
            "source": "rt"
        },
        {
            "content": "Amazing effects and production value for 1935.  The ending is abrupt, but the scene in the blind man's cabin is iconic and summarizes the Frankenstein mythos in ten minutes.",
            "review_date": "2015-11-01",
            "source": "rt"
        },
        {
            "content": "What is there to say...a classic that must be watched!",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "There are some dramatic and powerful scenes in this classic horror film. Featuring solid performances, good cinematography, lighting and music, this movie is a great achievement in the genre. 1001",
            "review_date": "2015-10-08",
            "source": "rt"
        },
        {
            "content": "I guess he's not her type.",
            "review_date": "2015-08-14",
            "source": "rt"
        },
        {
            "content": "Good Movie Good Classic",
            "review_date": "2015-07-15",
            "source": "rt"
        },
        {
            "content": "As laughable as this film is, it is still a great sequel to the previous film.",
            "review_date": "2015-06-30",
            "source": "rt"
        },
        {
            "content": "Another great edition to the Frankenstein franchise.",
            "review_date": "2015-06-06",
            "source": "rt"
        },
        {
            "content": "extraordinarily campy with horrible lines like, \"excuse me but im blind.\" did like the gloomy atmosphere with black n white working really well for this film. great cinematography of castles and woods and the costumes were great for the time. the main issue is this film is very much shallow and short. Bride of Frankenstein hardly receives any screen time also which was frustrating. One of those films that is so bad its good The acting is so overdone its fun. Worth a watch on Halloween with kids or friends.",
            "review_date": "2015-05-20",
            "source": "rt"
        },
        {
            "content": "A fantastic sequel! I was impressed by the voiceover narration and the scenes from the original being included. Really good way to start out a sequel. It had a strong story! Although I do find the title to be a little misleading, but that doesn't really matter, I guess. One thing that I, and every other horror film viewer, know is that horror movies are notorious for having characters who, in their terrorized state, make the worst decisions possible- and this film is no exception. There were so many characters who were constantly making stupid mistakes and causing unnecessary harm to others/themselves. And they never learn.\" New information? Bad outcome? Who cares! Let's do the same thing over again!\" That was a little frustrating, but what can ya do? *shrugging emoji*\n\nFascinating characters, new and old. Great character development with the monster. Amazing effects!! AMAZING, can't believe what they managed to do in 1935. Really impressed by their creativity and innovation in story-telling techniques. Great angles, a wide variety, including some very Beautiful, elaborate sets, and impressive props. A great score complementing the film, wow.\n\nSuper creepy, thrilling, and very entertaining. Gotta suspend your disbelief many times regarding the mortality of the characters. I'm sure it was just due to a more modest audience's standards, but to a viewer in 2015, the violence is silly. Any deliberate killing was done with minimal effort and in a way that obviously wouldn't actually kill anyone, but when serious injuries occur they heal rapidly, miraculously.\n\nDefinitely a good watch. I recommend it. Don't know if I'll ever watch it again and or own it, but it's a fun one!\n\n8/10\n\nBye love you",
            "review_date": "2015-03-31",
            "source": "rt"
        },
        {
            "content": "A true Horror classic. Make a point to see it. Very scary.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "The peak of the Universal Horror films.  A wonderful mix of horror and comedy.  I must say ... I cannot stand Una O'Connor and her shrieking, over the top performance is too much for me.  That said, she's not in enough of this film to ruin it for me.  I'm also not a fan of the really silly, unnecessary prologue.  But Karloff surpasses his performance in the original and creates a complex, moving character.  Colin Clive, who was a bit of a weak point in \"Frankenstein\", is much better here.  Ernest Thesiger is simply incredible.  A masterpiece.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "After The Monster (Boris Karloff) is presumed dead in the windmill fire, Henry Frankenstein (Colin Clive) vows to make a fresh start in life with his new wife Elizabeth. (Valerie Hobson) But when Henry's former mentor, Dr. Pretorius (Ernest Thesiger) and the Monster himself kidnap Elizabeth, the only way Henry can save her is to grant his former creation one wish, a Bride (Elsa Lanchester) of his own...\n\nTaking unadapted elements from Mary Shelley's novel that revolve around the subplot of the Monster wanting a bride could have ended up being an unfocused mess, due to the newly enforced Hays Code passing restrictions on the Horror genre at the time. But returning director James Whale and screenwriter William Hurlbut manage to craft a excellent sequel, with it's more complicated and emotional themes revolving around the Monster's struggle for acceptance and a friend is perfectly represented in the scene in which the Monster befriends the blind hermit. (O.P Heggie)\n\nKarloff himself, despite being against the idea of the Monster talking, gives one of the best performances in his career as a more intelligent Monster, while despite not being on screen for a majority of the film, Elsa Lanchester kills it in her three minutes of screentime as the cat-like Bride.\n\nOverall, Bride of Frankenstein, alongside having the most large and impressive visual effects and cinematography produced by Universal at the time, deserves it's status as James Whale's magnum opus, thanks to it's willingness to get people emotional and invested into a Monster's search for humanity in a cruel world and it's huge cinematic scope.",
            "review_date": "2014-11-09",
            "source": "rt"
        },
        {
            "content": "As far as sequels go, \"The Bride of Frankenstein\" is great, however, I felt like I wanted more of the bride than what was delivered. Instead of having the entire film build to that one climatic moment, it should have happened earlier on and then have added more suspense to whether or not it would work out. I felt a bit let down with this sequel. Boris Karloff actually improves on his acting from the first and makes you feel for him in every moment throughout this film, and I will say that is the one aspect that was done better, emotion. The character of Frankenstein's Monster has much more to do here, but nobody else seems to be as motivated as he does for finding his mate. Overall, it is a great classic film that is definitely rewatchable, but the original is the true marvel. \"The Bride of Frankenstein\" is great!",
            "review_date": "2014-10-26",
            "source": "rt"
        },
        {
            "content": "Definitely recommend for fans of the original.   The monster talking wasn't appealing to me at first but this wouldn't have worked without it.   The bride is hot and creepy at the same time.  If only I was a monster in the '30s.  I would so hit that.",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "This James Whale masterpiece just gets better with each viewing. Every facet of the movie, from script, direction, acting, score, cinematography, and production, is world class. Not to be missed.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "This is the Universal classic and monster movie by which all other monster movies should be rated. Atmospheric, ghoulishly funny and poignant, it's suitable for all ages and all ages will derive something from it. Karloff is at his peak here, the framing story gives some slight historical context and Ernest Thesiger steals the show!",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "Commonly viewed as the best of the Frankenstein films, to me it lacked the genuine nature of the first and almost came across as a parody.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "Building on the excellence of the first film with more wit, vision, and pathos, the Sequel of Frankenstein continues the Grand Guinol tradition of its classic forebear while upping the creative ante, gifting filmgoers with the greatest monster movie of all time. Still working from Mary Shelly's  novel (the film even brilliantly provides an introduction with Shelly, her lover, and Lord Byron discussing the story's development), the creature gets imbued with the power of speech while visiting a blind hermit while trying - but failing to the screams of many - to be accepted. It's possibly the most human of monster movies, soliciting sympathy for a patchwork man who didn't ask to get made. Searching for companionship, he demands a mate and visionary director James Whale demands full creative control. Atmospheric to an unforgettable degree, the film proves even more Expressionistic than the last chapter without qualifying as Expressionism. Technically, even beyond lighting and sets, Bride of Frankenstein's set design and scope is an absolute technical marvel. \n\nIn this unrated horror classic, Dr. Frankenstein (Colin Clive) becomes forced to tempt fate once again when the monster (Boris Karloff) and an equally mad scientist (Ernst Thesiger) demand a suitable mate (Elsa Lanchester) for his creation.\n\nOf course, it helps to have such epically great players. In an age when cast and crew return for a second or tenth go-round without question, Bride's revolutionary status seems less than groundbreaking. But Colin Clive and Boris Karloff develop their already fascinating characters further under Whale's specific direction to great effect. Most importantly, this macabre masterpiece winningly employs a great degree of humor, dipping its toes into camp without becoming campy. \n\nBottom line: Monster High",
            "review_date": "2014-09-22",
            "source": "rt"
        },
        {
            "content": "A monster and his beloved dead bride!",
            "review_date": "2014-08-28",
            "source": "rt"
        },
        {
            "content": "Ignore the cheesy choreography, 'graphics', and among other outdated things that make movies good today...\n\nAnd this is honestly a good movie.",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "I enjoyed the film plenty a great sequel to the original. It continued the story well my only complaint is that the bride of frankenstein did not come out until the end.",
            "review_date": "2014-07-08",
            "source": "rt"
        },
        {
            "content": "Human soul can always be more terrifying than a monstrous outlook.",
            "review_date": "2014-06-01",
            "source": "rt"
        },
        {
            "content": "The Bride is really a background character compared to the singular complexity of Karloff's monster that continues to capture the complexity and frustration from Shelley's original work. A classicly Gothic treat for horror cinema fans.",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "After the instant success of Frankenstein (1931), Universal Pictures wanted a sequel, and they got Frankenstein's director James Whale back, and they worked together on finding a suitable plot. Pitches and ideas came and went, but they returned to a passage from Mary Shelley's book that was never adapted for the first film, and that was the genesis for this film, which is a very compelling film. After the events of the first film, Dr. Henry Frankenstein (Colin Clive) and his Monster (Boris Karloff) are seemingly killed, but they weren't. They survived, but only just. Frankenstein is nursed back to health by his fiancée Elizabeth (Valerie Hobson), during his recovery, Frankenstein is visited by old mentor Doctor Septimus Pretorius (Ernest Thesiger), who wants to help him create a new monster. Meanwhile, the original monster has taken refuge at the house of an old blind hermit (O. P. Heggie), who teaches the monster human feelings and emotions. Meanwhile, Frankenstein and Pretorius create a female version of the monster... This one has more heart and feelings over the original film, and it's actually a more compelling and original film too. It has some good scares for it's day, and Whale created not one but two iconic movie monsters with this film, and it's a doomed love story as well, tragic as well as compelling in equal measure.",
            "review_date": "2014-05-01",
            "source": "rt"
        },
        {
            "content": "(80%)\nStill very enjoyable, Karloff is hands down the best on-screen monster of all time, and the general quality is high making a solid horror classic. The tragic element of the monster is well realised adding more interest and bite. An unmissable classic.",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "The Bride of Frankenstein hasn't aged magnificently, but it still counts as one of the classic Frankenstein movies and one of Karloff's best.",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "James Whale's Bride of Frankenstein is surely even more odd, over-the-top, visually exciting, and terrifying than its 1935 release, because we are more conscious of its undertones of macabre and violation.",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "Better than the original.  Karloff is amazing.  The creature is really made human and sympathetic here.  Your heart breaks at all his attempts to be loved and his constant rejection.  The only scene I can complain about is the patently absurd display of the evil scientist's little people.",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "A great horror movie",
            "review_date": "2014-03-06",
            "source": "rt"
        },
        {
            "content": "Campy and delightful, \"The Bride of Frankenstein\" introduces humanity (and possibly homosexuality?) to the previously evil monster to fantastic results.",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "Empire, T2, X2, the rare sequel that surpasses it's classic predecessor. Bride of Frankenstein was the first to do this. An interesting and fun opening featuring a character based on author Mary Shelly telling her husband and Lord Byron that there is more to Dr. Frankenstein's tale than they know. And indeed the first movie ends halfway thru where the book would be. Boris Karloff is even better this time around as director James Whale outdoes himself in this amazing monster movie. Nearly 80 years later, it still holds up.",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "Whale returns to his Frankenstein with this amusing sequel that has an even campier, deliciously wrier humor and offers more depth to Karloff's Monster, while everything is also more complete here (despite gaps in logic), including a score that was missing in the original movie.",
            "review_date": "2014-01-24",
            "source": "rt"
        },
        {
            "content": "On par with the first film.",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "I don't care for this film.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "Yes, Bride of Frankenstein is an improvement over the solid original. Yes, upon re-evaluating, one can see the clever undertones, inventive humor, and subtle emotions. And yet, I just can't bring myself to fully embrace this movie. \"Bride\" has an rushed air to it; the film shoves Victor Frankenstein into the movie and does nothing with him and captures the Monster only to have him escape mere seconds later. The elements of a great classic are here, but \"Bride\" can't quite tie them together.",
            "review_date": "2013-12-22",
            "source": "rt"
        },
        {
            "content": "It was the director that drew me into Bride of Frankenstein - an openly gay, theatrical Brit with one helluva taste for film and just enough sophistication to elevate the campy horror films of his time into something both deep and enjoyable.\nIt's a horror movie, but Bride hardly is scary. It's funny, and quirky, and sexual in ways that maybe most of the censors at Universal didn't pick up when they released this film.\nBride was successful when it released and it still is today. James Whale really made a gem here.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "The greatest sequel of all time.",
            "review_date": "2013-11-25",
            "source": "rt"
        },
        {
            "content": "Far superior to the first Frankenstein movie, which I was not impressed with. Effectively creepy atmospheric touches make this one of the best classic monster movies I have seen. (First and only viewing - 11/3/2013)",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "- You don't mean...\n- Yes! We'll create... a woman! That should be ... interesting!",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "An absolute gem, possibly even better than its predecessor. A contender for the best Horror (or any) movie of all time.",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "A sequel that not only matches the original, but manages to surpass it.  With a more fleshed out characterization of The Monster, and intriguing antagonist who plays well as Victor's (well with regard to the inexplicable name change in these films then it's Henry's) \"Dark Side\" of sorts, a story with more meat to it,and a tone/spirit closer to that of Mary Shelley's masterpiece it places itself among the ranks of both the greatest sequels and horror films ever made.",
            "review_date": "2013-10-28",
            "source": "rt"
        },
        {
            "content": "wow. so amazing. loved this classic",
            "review_date": "2013-10-27",
            "source": "rt"
        },
        {
            "content": "I am totally going to blaspheme here and say that I liked the end of this better than the novel. The monster winds up being so much more of a decent guy than Frankenstein. And it keeps the main theme that man should not play the part of God. Even the monster gets that at the end. I also LOVED the two scenes with the blind man and the monster. And I feel it was one of the best sequels I have seen. I liked how they reminded me of what had happened in Frankenstein, it has been a while since I saw it. My two complaints are the comic relief maid and the tiny manchens made by Dr. Frankenstein's mentor. They bugged me.",
            "review_date": "2013-10-26",
            "source": "rt"
        },
        {
            "content": "(Movie King Quick Review)\r\n\r\nThe Bride of Frankenstein, directed by James Whale, is the classic sequel to Whale's classic horror film Frankenstein, which helped define the horror genre in that decade. In the sequel, Frankenstein's monster (Boris Karloff) is \"back\" from the dead, and while he continues to scare people around and occasionally kill, he's also lonely and wants a friend. He comes across villainy Dr. Pretorious (Ernst Thesiger), where they both force Dr. Frankenstein (Colin Clive), by means of kidnapping fiancée Elizabeth (Valerie Hobson), to create a bride for the monster. Elsa Lanchester plays The Bride in possibly the most famous scene of the movie. She also plays Mary Shelley, the real author of the story, in the opening scene of the film. \r\n\r\nCall me crazy, but in my mind, Bride of Frankenstein is the greatest horror film of all-time, and is better than it's predecessor, which is rare for a sequel from the 1930's. Why did I love this film? Well, it combines horror and creeps (Pretorious's miniature figures and the look of The Bride (I really want to know who designed her hair; it's amazing)), comedy (the entire role of Una O'Connor as the maid), emotional detail (the monster's longing for a friend and his small encounter with the blind priest), and unlike the first which lacked a score, Franz Waxman's eerie score provides the sounds that I wanted for the original. Boris Karloff is awesome as the monster, and is even moving in a couple of places, which makes me root for the monster even more. His makeup is phenomenal and creates his greatest role ever. He would play the monster one more time in 1939's Son of Frankenstein.\r\n\r\nBride of Frankenstein is an incredible sequel, outdoing everything impressive in the first one, and James Whale has created without a doubt, the most essential horror film of all-time.\r\n\r\n\"Alone, bad. Friend, good.\"",
            "review_date": "2013-10-26",
            "source": "rt"
        },
        {
            "content": "Great character actors, gorgeous lighting, classic sets. The ending is rather abrupt to modern storytelling sensibilities but perfectly appropriate to the story. \n\nJust immerse yourself and enjoy the pinnacle of Universal Horror.",
            "review_date": "2013-10-22",
            "source": "rt"
        },
        {
            "content": "Turns everything that was good about it's predecessor into a joke.",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "Turns everything that was good about it's predecessor into a joke.",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "Often touted as better than the original, I'd probably posit that it's about the equal. The pacing, especially in the final act, after the Bride becomes \"alive\" is a little rushed. But this film is certainly more surreal than the first (WTF is up with those miniature figures in the jars?) and there's still a lot of delicious pathos and social satire throughout...especially in the undeniable highlight of the film, when big Franky invites himself into a blind hermit's secluded house, learns about music and smoking, and makes a friend at last. These ten minutes make the film, really, and are surely Mr. Karloff's most defining, tragic, beautiful moment.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "Excellent performances.",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "Finally saw this for the first time.  I know, I'm lame.",
            "review_date": "2013-10-10",
            "source": "rt"
        },
        {
            "content": "Although as much a comedy as a horror, it is in fact the best of the Frankenstein movies as well as the inspiration for Mel Brooks' reinterpretation. The director was sharply reprimanded by a screening patron for his constant chuckling. The final 15 minutes alone are worth the price of admission.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "The sequel to the 1931 hit, it turns out Frankenstein (Boris Karloff) actually survived the fire that was thought by the townspeople to have killed him. He is now on a mission to cause even more destruction and despair among the townspeople. Oddly, the scientist who created the monster tries to lure Frankenstein back with a new gigantic female version of himself. However, Frankenstein has other love interests of his own in the human population. I would say this is an example of a haunting, fascinating, well filmed movie from the 1930`s, a decade that produced a few very effective horror films. Karloff is fine in the title role, though mainly is script only consists of \"RARRRR!\" Slightly blurry in terms of photography at time, but an iconic watch.",
            "review_date": "2013-09-25",
            "source": "rt"
        },
        {
            "content": "Frankenstein itself is properly horror, but Bride of Frankenstien explores the implications of the reanimated -- in particular, the humanity of the Monster.  For that reason, I will always think of it as a special science fiction film.",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "Occasionally a sequel is better than the original movie and this is certainly the case here. Boris Karloff, Ernst Thesiger and Elsa Lanchester are the stand outs in this captivating look at the plight of the existing Monster and the creation of a new one.",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "\"The Bride of Frankenstein\" es una de esas secuelas que supera a la original porque en vez de reciclar la historia, la continúa y lleva a lugares inesperados y emotivos. Boris Karloff, como el monstruo, crea una actuación icónica llena de sentimiento (solo vean la secuencia con el ciego, que anhela tener a un amigo). \n\"The Bride of Frankenstein\" inicia con una secuencia meta, con el poeta Lord Byon y la autora Mary Shelley contando su idea para la secuela a \"Frankenstein\". Resultando en, quizás, la mejor película de la serie de monstruos de Universal.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "Loses half a star for the regularly annoying (though only in Whale's horror films; elsewhere she was quite appealing) Una O'Connor, but otherwise a flawless film, beautifully lit, brilliantly executed, and one of those rare examples of a sequel surpassing the original.",
            "review_date": "2013-08-01",
            "source": "rt"
        },
        {
            "content": "\"The Bride of Frankenstein\" is a sequel that's just as good as the original, if not even better at times. While it shows that the sequel wasn't planned from the early scenes of retroactive continuity and the fact that the original novel is completely forgotten as a film it really works. The story introduces a villain that's delightfully diabolic and proves a great foil for our hero Henry Frankenstein, the special effects are spectacular, the monster gets a lot of character development and becomes more than just a mindless brute, the film has a lot of funny moments and there are some touching, intellectual points raised as well.\nHere's a basic outline for the story: At the end of the last film, a mob of torch-wielding villagers chased Frankenstein's monster into a windmill after it killed several people and abducted its creator. The monster and Henry Frankenstein confronted each other at the top of the windmill and in a moment of real humanity, it saved the doctor. The windmill burned to the ground and the monster was assumed dead. When the sequel begins however, we learn that the monster fell into the flooded basement of the windmill and survived. It is spotted by a witness but no one believes Minnie (I don't blame them, she's incredibly irritating in every Universal Film). The monster wanders the wilderness, trying to make friends but is constantly shunned by everyone that it meets. That is until it befriends a blind man living by himself in the woods. The Hermit takes care of the monster and teaches him to speak, teaches him about music and even shows him how to smoke. The two become friends until two wandering hunters expose the monster and drive him away from his new home. Meanwhile, Frankenstein meets with Dr. Pretorious, a scientist who has also searching for a way to create artificial life. Through blackmail, Pretorious convinces Frankenstein to work with him. Pretorious and the Monster accidentally meet in a crypt and the two decide to force Frankenstein to create a mate for the monster, hence the title of the film. Now Frankenstein is caught between two adversaries, one a diabolic mad scientist eager to play God and the other, his own creation demanding a companion to end its loneliness.\nThe new addition to the franchise, Dr. Pretorious (Ernest Thesinger) is a fantastic antagonist. He is really diabolical and resorts to any means to get what he wants, be it blackmail, bribery, theft or even murder. He is completely at ease with dwelling in crypts, manipulating people and there's even some implications that he deals in black magic. When Dr. Frankenstein was playing God in the first film and creating life, it felt like the man was just so excited about his discovery that he was disregarding all safety and ethical points. When Dr. Pretorious is discussing creating life, it's like he is defying God and wants to prove that he is on a higher level than other humans by creating man (or woman) in his own image. He sees everyone as beneath him and only really has respect for Frankenstein because the man has knowledge that he wants. He also has a sense of humour so you kind of like the guy. Throughout the film he's got two notable lines that really show off his sense of humour. The first is when he and Frankenstein are getting ready to discuss Pretorious' creations. Pretorious claims that gin is his only weakness, but later when the meets the monster, he claims that cigars are his only weakness. It's a funny set of lines and it implies that the character's rationalizes his decisions regardless of what they are every time.\nDirector James Wale wisely decides to give the monster a lot more character in the movie. No longer is the monster wandering around just terrorizing people without any understanding of what's going on. Now, it's looking for a friend and has gained real intelligence. It understands that fire is painful, that people can drown if they fall in water and that its physical appearance, which has become significantly worse because of the burns it suffered while in the windmill, makes other people afraid of it. When the creature learns to talk, it gets some funny and touching moments as it befriends the Hermit. You see it enjoying music, cigars and food, it learns to recognize what it likes (for example later when it sees Pretorious it decides to approach him and ask for a cigar and drink) and even has a moment where it sheds a tear when it feels sad. Combined with the fact that throughout the film its burns heal and it yearns for a mate (or a friend) it becomes clear that Boris Karloff's character is very much alive and not just a re-animated corpse. You see that it has hopes and dreams, but also feels desperation and anger after being treated so horrendously by the people around it. \nDoctor Frankenstein returns but in this film he is a changed man. After seeing the destruction that was caused by experiment run amuck, he's reluctant to create life again but is too scared to go to the police or attempt to fight back. He just wants to get back to his life but feels some genuine guilt because he did not take responsibility for the creature he created. It was tormented by everyone (including his assistant) and lashed out at the world. He knows however that there is good in the creature and understands that it can be reasoned with yet feels too helpless to do so.\nOne aspect that needs to be discussed while reviewing the film is the religious aspect and symbols. \\During a scene where the monster is captured by villagers, it is tied to a pole in a fashion that reminds you of a crucifixion. This automatically makes you think of Jesus Christ, but the two figures are polar opposites. Christ was born as the son of God from a woman, was crucified and then came back to life as humanity's salvation. The monster was created from man without God's aid, is resurrected from the dead before being crucified and spreads terror wherever it goes. However, a scene where the Hermit admits that he has \"prayed many times to God to bring him a friend\" implies that it is divine intervention that brings these two misfits together. Because of his handicap, the old man is unable to judge people by their appearance and welcomes the monster in his home with open arms. He thanks God for taking pity on him and bringing him a friend, while the monster is grateful to find someone who will finally accept him. It's a touching scene, implying that even the lowliest, most hated creatures have a place in society and that there is someone out there that will accept them for who they are. As the scene fades, a crucifix behind the two characters is highlighted and \"Ave Maria\" is heard in the background. This sequence brings a whole new meaning to Dr. Pretorious' previous toast \"To a new world, of gods and monsters!\" While when you see it the first time around, it is clear that he is referring to himself and Frankenstein as the gods. They are able to create life at a whim and their creations are the monsters. However, after seeing the creature compared to Jesus Christ and after seeing it as a gift from the heaven, sent to the hermit as a sympathetic misfit, it appears that the monsters are Pretorious and Frankenstein. There are even some suggestions that Pretorious is a demonic character and not a man at all, with his mocking references to the Bible, (\"Leave the charnel house and follow the ways of nature - or of God, if you like your Bible stories\"), his obscure method of creating life and a scene where he is seen dining in a crypt. This aspect of the film alone will generate countless discussions and it's been a delight to analyze and re-watch certain excerpts of the film just to see the different comparisons.\nPretty much everything you liked in the first film is back. You get a mad scientist lab that is just as elaborate, Boris Karloff and Colin Clive are back as the monster and his creator, you get the angry torch-wielding mob but the movie pushes these even further. The laboratory is more elaborate and we get to see more of the monster creation process when it comes to the bride, the mob sequences are longer and you get to see them really confront the creature and both Karloff and Clive get to expand on their characters. There is no hunchback helper but instead we get another scientist, so it's a fair trade. The film also contains many humorous moments and while some of the jokes have been lost in the generations since the film has been released, there are no sequences that will leave you scratching your head wondering what the characters are talking about. Because modern horror films were built on the Universal Monster movies, most audiences will not be frightened by this entry but the jokes still ring true today. Yes there are some sequences that are dated (the rubber bat in the cave might have been the best they could have done in 1935 but in 2013 it just looks silly) but the film still fires on all cylinders and you'll quickly forget the flubs because of the strength of the story and the multiple layers contained in the film.\nNot only is \"Bride of Frankenstein\" a landmark in filmmaking, but it's genuinely impressive today. The sequences in the mad scientist laboratories don't get much better than they do here and the parts where Dr. Pretorious shows off his creations are spectacular. The film is still funny, still touching and on the implications about science running amuck are still relevant and disturbing. You'll be surprised how well it has aged and it has the added bonus of being a film that you can show to children, discussing with them the importance of not judging people on their appearance while you discuss the religious implications with your grown-up friends. Forget the fact that this is a black-and-white film that's nearly 70 years old, it stands the test of time and you'll be delighted to have seen it. It easily overcomes its flaws and earns its 5 star rating. It's a must-see movie if you're a fan of horror or just a fan of movies.(Dvd, June 9, 2013)",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "Stunning! Boris Karloff returns to his role and this time he's at his best. everything about this film is memorable from Mary Shelley at the beginning to the bride of the monster at the end.",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "Much better than the original, the monster speaks, for one. Nice intro with Mary Shelly, and an interesting title; was this a mistake, or deliberate. The bride of Dr Frankenstein plays a critical role in the film but I suspect that the bride of the monster, who plays a very minor part, is the intended subject.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "Quite the improvement over a decent first one.",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "Monster sequel 4.5/5",
            "review_date": "2013-06-23",
            "source": "rt"
        },
        {
            "content": "One of the few sequels that i loved more than the original.",
            "review_date": "2013-06-21",
            "source": "rt"
        },
        {
            "content": "The Bride of Frankenstein (1935) starts where the previous film (Frankenstein- 1931) left off.  We see both Dr. Frankenstein and his creation die, but this film seemed to tell more of a story and Boris Korloff does another great job in this film.  Frankenstein talks (or grunts) more in this film, and just like the previous film, this is another great horror flick to add to your universal collection.",
            "review_date": "2013-06-17",
            "source": "rt"
        },
        {
            "content": "Awesome in every way!",
            "review_date": "2013-06-17",
            "source": "rt"
        },
        {
            "content": "5/5 * \nPossible better than its predecessor, The Bride of Frankenstein advances upon its themes while being all the better frightening.",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "The very best of the Universal Horror films.",
            "review_date": "2013-05-25",
            "source": "rt"
        },
        {
            "content": "A wonderful, cinematic feat as beautiful in its visual presentation as it is in its touching tale of the human condition as represented by Dr. Frankenstein's repulsive monster, who has become more 'human' than in the first installment.",
            "review_date": "2013-05-22",
            "source": "rt"
        },
        {
            "content": "Following the magnificent and mesmerizing directing piece of Frankenstein. Its follow up stretches new territory from Whale's sense of  humor displayed in different styles. The concept of allowing the monster to speak a little is fairly new and concerning and yet doesn't plague the whole film. To set the record straight this is not the story of the Monster and his Bride, its the story of how the Bride was invented and how the Monster grew after the events that faded from the first film. Elsa Lanchester however few minutes of screen time she had at the end is outstanding and worth looking back on especially for coming of age actresses wanting to start off in the buisness",
            "review_date": "2013-05-18",
            "source": "rt"
        },
        {
            "content": "The Bride of Frankenstein may be the  best of the classic horror movie era of the 1930s and 1940s. Directed by James Whale and featuring Boris Karloff reprising his role as the Monster, it is a continuation of the classic Frankenstein story, with the creation of a bride for the Monster. Although only on screen for five minutes at the end, Elsa Lanchester is wonderful in the role of the Bride. It has scenes that are touching, frightful, and humorous. A highly entertaining classic.  It's one of the most wonderfully crafted films in cinema history and is easily lauded as Whale's best work.\n\nFor some reason Whale decided to have the Monster learn a few words and phrases since the original film.  I don't know if this was to demonstrate that the Monster was a living, evolving being, but it only  brief moments of comic relief and didn't deter from the overall them of the film.\n\nThe memorable sequence of bringing the  Bride to life is unequalled - even the original scene in Frankenstein pales in comparison. The presentation of the birth of the Bride is stunningly iconic, as is her unforgettable shock hairstyle which stood up and hinted that the electricity had shocked her to life. Her darting movements and childlike expressions were hilarious. \n\nThe Bride of Frankenstein is just another proof that they really don't make movies like they used to. In the 1930s there was no high tech anything, so directors had to rely on story telling and pure movie craftsmanship. Lighting techniques that have been studied by film makers for years, fine sound editing, sets that have been copied by countless modern day set directors, exceptional makeup and of course over the top acting. Who else could make you feel sorry for a monster longing for companionship but Boris Karloff?  To quote Jerry Seinfeld: \"There's something about a monster in a blazer.\"",
            "review_date": "2013-05-18",
            "source": "rt"
        },
        {
            "content": "With spectacular visuals, a great villain, and the monster being able to talk, Bride of Frankenstein is undeniably superior to the original.",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Just one word CLASSIC",
            "review_date": "2013-04-29",
            "source": "rt"
        },
        {
            "content": "A lean, briskly paced Golden-age horror film featuring beautiful set design and solid performances.",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "This is a perfect film as well.  People say that the Godfather Part II is the best sequal of all time, and I'm not trying to suggest otherwise (i don't feel like going there here and now), but to those who are convinced of this should give this film a chance.  I don't feel that Bride is superior to Frankenstein, but i do suspect that this could be the best sequel of all time.  I only suspect this though. i haven't quite made up my mind yet.  More to come.",
            "review_date": "2013-04-16",
            "source": "rt"
        },
        {
            "content": "Creo que pierde mucho de el ambiente tétrico y serio del filme. pero Whale hizo un filme tan cercano a la perfección como el primero. Con un nuevo villano que hace palidecer al Doctor Frankenstein y aún un excelente desarrollo en el Monstruo, está vez no solo sentimos empatía con el: Reimos y lloramos con el. La imagen de la novia es icónica pero dudo que la gente haya siquiera visto la primera, así que de esta solo pasa por el colectivo pop de la sociedad. Pero vale verla, comentarla, analizarla y sobre todo disfrutar de un filme hecho con tanta dedicación y pasión que influye en un sinnúmero de cineastas.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Even though 1931's \"Frankenstein\" was neatly wrapped up at the end, killing off the doctor and his monster, Universal intended to make a sequel to the monsterously successful film (Universal's policy was to use the same crew for the next film, which is why production was delayed four years, waiting for the director to become available again).  Director James Whale wasn't crazy about making a sequel, and with \"Bride of Frankenstein\", he chose to have the monster speak (something Karloff was set against).  The film begins with Mary Shelley and Lord Byron discussing the \"complete\" story of Frankenstein, the one never heard before.  Of course the Doctor and the monster survived the fire at the wind mill, and as the doctor rested and recouped, the monster continued to reek havok on the villagers, exacting revenge upon them.  That is, until he meets an old blind hermit who takes him in, and teaches him to speak.  Doctor Frankenstein, meanwhile, is visited by a Doctor Pretorius, a scientist who, like himself, is in the business of creating life.  But whereas Frankenstein does it by piecing together old bodies, Pretorius creates life from scratch (the flaw being that they're little miniature people).  Pretorius wants to combine his work with Frankenstein's so that they might create a race of manmade people, and proposes that they work together to create a mate for the creature.  \n\nThe film is a contrivance to be sure, but the uncomfortable creepiness of the monster is still there.  In Mary Shelley's book, Frankenstein's monster was literate, capable of thought and feeling but evil because it had been created not by God, but by man and therefore was without a soul.  In the film version of Frankenstein, the Creature is a failure of science, an aberration of nature, a sub-human.  It's horrific by nature of it's existence.  We may feel pity for it, but we cannot suffer it to live.  \"We belong dead!\" screams the monster in it's horror, it's horror of self-awareness.  Every fiber of it's being screams out for death, and yet it exists in spite of mother nature and God himself.  Even the brief respite bought from friendship and food and wine can't satisfy.  For the creature, life is only pain.  And yet, it clings to it in spite of itself.  It's one of the great mysteries of the monster, of \"Frankenstein\", and life in general.  For some, \"life is pain\", for the rest, we can only shield ourselves from it's inevitable conclusion.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "One of the few sequels to really surpass the first film on all levels. James Whale's use of tracking shots and self parody are really ahead of its time which makes this film feel timeless in a sense.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "So Frankenstein gets a sequel because the original was a hit. You can tell they had a bigger budget for this one with new sets and effects. Most people might not like that the monster talks in this one but I think it actually helps the movie move along better than the first.  The story is peppered with a bit more humor and a bit more drama and it really helps. I actually like this one a bit better than the original.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "Up to par with the first Boris Karloff version but the goofy little mini scene derailed a few moments for me. Still, everything that was cool about the first is similar in this.",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "My third favorite film of all time. Everything about this movie is fantastic.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "This is the perfect example of a great film. The symbolism, Art Direction, acting, directing, and score is nothing short of pure perfection. This sequel is better than the original film. We really get to know the Monster better than ever.",
            "review_date": "2013-03-12",
            "source": "rt"
        },
        {
            "content": "95%\n\n\"Made me from dead. I love dead. Hate living.\"-Frankenstein's Monster (Boris Karloff)",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "By far the best sequel to a film I've ever seen. Frankenstein was just okay to me. I get that it's a classic but it just didn't do anything for me. Bride of Frankenstein was astonishing. So ahead of its time visually and the special effects were probably very innovative as well. The scene where the monster meets the blind man in the woods will probably be one of my favorite cinematic scenes for the rest of my life. I was nearly in tears.",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "One of those rare sequels that is actually worthy of its predecessor.  Karloff returns as the monster, and Clive as Frankenstein.  Karloff adds more personality to the Monster, while Clive reluctantly obliges his monster with a Bride.  A fantastic, simple, yet original work of cinematic art.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "My favorite classic horror movie.",
            "review_date": "2013-02-20",
            "source": "rt"
        },
        {
            "content": "An epic monster movie that continues the story of Frankenstein's Monster.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Not as good as it's predecessor but still a brilliant film. What the first one had that this lacked was the effect of polarizing emotions in single scenes. It just didn't have as big an impact on the viewer as the first.",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "The first one is a horror masterpiece. This sequel is a good follow up but it is obvious that it heads for more camp and silliness. Still, Karloff is so iconic as The Monster and the final 10 minutes is exciting. The Monster's last line pretty much sums up the two movies.\n\nGrade: B+",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "one of my favorite 'sequels' ever same director same cast and oh those silver streaks in elsa lanchester's hair.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "The 100% critics review is well deserved, and the 13% of users who didn't enjoy this movie need to hand in their 'film fan' cards, NOW. \nBeautifully directed, Amazing cinematography and lighting, and effects that still stand up today - take the shot with the miniature 'creations' in the foreground while our 2 scientists talk; today that would be CGIed and not look half as good. \nAlso; Karloff. Anything I could say about Karloff's performance would be redundant. \nBoF is one of those rare sequels that surpasses it's amazing predecessor.",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "It's great! Although, it's more about Frankenstein than his bride; and it ends rather strangely.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "Although not a horror film, this movie is one of the best films from the 30s. Holds up EXCEPTIONALLY well.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "One of the best parts of the film is the opening scene with the fictional portrayal of the author (the versatile Elsa Lancaster in dual roles) giving an exposition of the novel's themes.\n\nGreat to have the two leading roles reprised, just a shame that Mrs. Frankenstein and the Mayor were portrayed by new actors. EE Clive seems to be no relation to the star of the film.  Watch also for Una O'Conner, Dwight Frye (in a new role), John Carradine (yes, his sons were actors), and a young Billy Barty (Yes, that one!) as the baby. Billy claims to be about 11 when this film was shot, but some film buffs think he was as much as 10 years older!",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "The original Frankenstein might have been good in 1931, but it 2012 it was boring and stupid, more of a comedy act, and this is worse.",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "very dated for younger viewers",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Meh.  The whole dancing doll thing was out of nowhere, the opening with the author was unnecessary, and it was essentially the first cheesy slasher movie sequel with a lame reason for the monster coming back and an increased body count.  A classic, but not something that holds up really...",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "James Whales skillfully blends classic horror and comedy in this sequel that is rather more entertaining and eventful than the first film. Top notch sets and special effects, plus a lively Franz Waxman score put production values well ahead of previous Universal monster flicks. It goes without saying, special mention must go to Boris Karloff's now spirited performance as the monster. Scene between the monster and the blind man is superb. Dr. Pretorious' little people in jars is too incongrously silly.",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "WOW This movie is incredible and I thought that the first film was amazing, this one is a lot better than the original. With the stylish direction from James Whale and the INCREDIBLE art direction as well as amazing costume/makeup/sets etc makes The Bride Of Frankenstein the BEST universal monster film on display.",
            "review_date": "2012-12-15",
            "source": "rt"
        },
        {
            "content": "A good sequel of Frankenstein 1931 film.",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "seen it & own it! =0)",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "This movie is amazing. It combines comedy, parody, horror, and drama together in the right combination. The era when the movie came out helps a lot too. Multiple/mix genre like this wouldn't fly today.",
            "review_date": "2012-12-06",
            "source": "rt"
        },
        {
            "content": "Not as great as the first but spices things up enough to make this a classic.",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "Unlike the prequel, this sequel to the classic 1931 movie Frankenstein is far from being a cinema pull, the long wait till we see the Bride and the disappointing climax after seeing her made the movie for me seem like a waste, as my anticipation for a great meeting between the two monsters was less than 7 minutes, and ended in a tragedy.\n\nI must admit it seemed to me like the studio just wanted to milk the franchise, as the story itself was not strong and the screenplay was less than appealing.\n\nThe movie follows immediately from where the last movie stopped; Frankenstein (1931) ended with the burning of the monster in a barn, and the throwing down Frankenstein from the top of the barn. Frankenstein survived the fall, and the monster survived the fire. The movie has some Christian spiritual undertone and Christian imagery could be found throughout the film. There is also a scene of the Monster trussed in a cruciform pose.\n\nThe movie is based on a subplot from the 1818 novel Frankenstein by Mary Shelley and the Frankenstein monster was played by Boris Karloff in the film (and also the prequel) and the Bride was played by Elsa Lanchester and in the movie she was credited as The Monster's Bride _ _ _ _ _  ?. \n\nThe movie's plot has our lead Henry Frankenstein (the monster's creator: note the monster is not named Frankenstein but the name caught on as Frankenstein was the name of the man who made the monster) abandoning all his plans to create life and desired to retire and be with his new wife but those plans changed when he got a visit from his old mentor Dr. Pretorius who too had been working on creating life but needed Frankenstein's touch to make for himself a female Frankenstein.\n\nThe movie was directed by English director James Whale, who was successful in the direction of the first movie Frankenstein, and the next success The Invisible Man (1933). James was called to work on this movie because of the way he pulled a success of the first.\n\nThe movie's makeup artist Jack Pierce, who did the makeup of the Frankenstein monster in the first movie, modified the appearance of the monster to show the after effects of the mill fire which the monster sustained in the first movie, as the movie progressed you will notice that the wounds were fading off to indicate healing. Another thing to notice in the movie is the monster's inability to move his left hand. \n\nThe monster's bride makeup was also co-created by Pierce while the director Whale was the one responsible for the Bride's iconic hair style.\n\nI will stand to say this is not as great a classic as the first but it can be a good watch.\n\nwww.lagsreviews.com",
            "review_date": "2012-11-29",
            "source": "rt"
        },
        {
            "content": "Shows how man is the true monster.",
            "review_date": "2012-11-17",
            "source": "rt"
        },
        {
            "content": "It really IS as good as they say.",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "For 1935, it's good.  For 2012, is still pretty good.",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "Masterpiece. Elsa as the Bride is outstanding as is Karloff.",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "A definite great movie. The only problem is that you only see The Bride for 2 minutes, then the movie ends... What?",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "Having wanted to move on from Frankenstein's monster director James Whale initially refused to be involved in the sequel but later agreed taking on the project as a comedy. Audiences, nonetheless, often hold THE BRIDE OF FRANKENSTEIN in higher regard than its neatly sutured predecessor.",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "This is definitely a satire that transcends time!",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "Probably my favorite Universal monster movie.",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "The opening scene portraying author Mary Shelly conversing with Percy Shelly and Lord Byron sets the film up to be wittier and more satirical film than the original classic. While this is generally the case, (most apparent during the unusual, and unusually touching, scene between the monster and an old blind man,) the flick often fizzles in spouts of sequel-itis. Instead of advancing the story or pushing the characters to new territory, the filmmakers generally settle with cheap shock-and-awe to outdo the original film. On a final note, the monster's mate had disappointingly-little screen time.",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "Good movie sequel.  I had never seen this movie before.  I went to see Fathom Events' double feature of Frankenstein & Bride of Frankenstein.  Not what I was expecting at all.  This is a good classic horror film.  It was not nearly as good as the original.  I liked the sequel of the story of Dr. Frankenstein's monster, but I did not see the point of making a bride.  I understood that she was created for Frankenstein's monster, but if everyone thought that the monster was such a menace then why create another monster that could have the same possibility of becoming a menace?  I can recommend this movie only if you've already seen Frankenstein, loved that movie, and are looking forward to continuing the story.",
            "review_date": "2012-10-26",
            "source": "rt"
        },
        {
            "content": "Alone: Bad. Friend: Good!",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "So Frankenstein gets a sequel because the original was a hit. You can tell they had a bigger budget for this one with new sets and effects. Most people might not like that the monster talks in this one but I think it actually helps the movie move along better than the first.  The story is peppered with a bit more humor and a bit more drama and it really helps. I actually like this one a bit better than the original.",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "For me better than the first.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "Commonly viewed as the best of the Frankenstein films, to me it lacked the genuine nature of the first and almost came across as a parody.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "Saw it in theaters and it was even better than the first, in my opinion.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "After watching this film so many years later, I find many good things about the film and a couple of VERY bad things about it.  This film is to me the very first B movie.  The original Frankenstein was a tremendous horror film.  The first sequel The Bride of Frankenstein has some superior plot lines, taken from the original story and opening with a scene of the author Mary Shelley continuing the Frankenstein tale, we see a sympathetic Henry Frankenstein.  A man injured and recovering from the events in the first film.  The monster played by Boris Karloff is a true character in this film.  He develops, he is hated and he is chased and feared by all who see him.  While he is still a sympathetic monster he is also frightening in his rage.  The flaws in this film are the unforgettable clowns like Minnie (Una O'Connor) who portrays a quite buffoonish semi-comedic maid, whose character would be better suited for an Abbott and Costello film or the Three Stooges than a macabre serious film like this.  Dwight Frye plays Karl, another cartoonish figure similar to his performance as Renfield in Dracula.  He tries to be creepy but he's actually just a plot device.  The writing of the film is not as strong as I wish it.  But some actors really do a fine job.  Ernst Thesinger plays Dr. Septimus Pretorius in a memorable fashion, a man with intentions and a cruel streak who coerces an unwilling Dr Frankenstein to create a female monster.  There is a slow build up to the pay off scene showing the bride.  And then instantly the movie ends rather abruptly.  It seems there were too many limitations on the imaginations of the writers to take this story anywhere.  The entire film seems expository setting us up with character and plot to get to a finally which is memorable mostly for its brevity.  My take on it is this film could be best enjoyed if you were to watch both films consecutively.  James Whale did what he could with the script and the cast. But sadly the film just doesn't work, it is not genuine in the emotions of many of the characters.  The Burgormeister, the maid, the hunchbacked sidekick, they are unexplained and unexplored, they take away from the film. Colin Clive and Valerie Hobson as classic and graceful.  Boris Karloff is menacing and has a pathos that is felt, but he is awkward and not as fearful as he could be.  The best scene in the film involves the time he encounters the blind hermit beautifully played by O.P Heggie, but the scene is so incredibly condensed that it cannot ring true, it is almost a stage play scene.  The single shot technique makes an incredulous and unbelievable new friendship evolve from hello, have some food, we're best friends now go to sleep.  One of the drawbacks to films of the era was the difficulty of pacing scenes like this.  But the actors did a very good job of trying to sell it.  The special effects are really not worth mentioning, the costumes were interesting the sets were grand the lighting was good for its day and the music appropriate. Overall there were multiple messages being sent.  That it is not good for man to be alone.  We all fear it.  We are afraid of losing loved ones, and not being accepted.  True evil can come in the form of a rowdy mob, or vengeance, or coercion, or in simple rejection.  I do not reject this movie.  It aimed high and misfired.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "The absolute best film of its era and genre.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "A rare occasion where the sequel is even better than the original so much fun.",
            "review_date": "2012-10-22",
            "source": "rt"
        },
        {
            "content": "Not as great as the first but spices things up enough to make this a classic.",
            "review_date": "2012-10-20",
            "source": "rt"
        },
        {
            "content": "According to most film scholars, there is a subtle layer of \"homosexuality, necrophilia and sacrilege\" in this film. And they're probably right. However, even without deconstructing the movie, \"The Bride of Frankenstein\" is still a fantastic film, full of tragedy, pathos, and VERY Big Ideas. An improvement over it already phenomenal predecessor.",
            "review_date": "2012-10-20",
            "source": "rt"
        },
        {
            "content": "A surprisingly heartbreaking film.",
            "review_date": "2012-10-20",
            "source": "rt"
        },
        {
            "content": "As good as the first",
            "review_date": "2012-10-19",
            "source": "rt"
        },
        {
            "content": "The first fifteen minutes were a disaster. This film misses more than it hits on its many attempts at humor (I just hate Una O'Connor) but it's still a good movie. The music is great as are the performances, with many memorable scenes and images.",
            "review_date": "2012-10-18",
            "source": "rt"
        },
        {
            "content": "Probably the first sequel to be clearly better than the first.",
            "review_date": "2012-10-18",
            "source": "rt"
        },
        {
            "content": "Frankensteini pruut - üllatavalt kuum (või on mu maitse lihtsalt niivõrd nihestunud)...",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "1931's Frankenstein Is One Of My Favorite Films Of All Time.",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "My favorite classic horror movie by far. Enough has been said about this movie over the years that I can't add anything more. If you haven't seen this, and you love classic cinema, this is a must see.",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "The Frankenstein story continues in The Bride of Frankenstein.  The series gets a little meta as the storyteller joins the story with Mary Shelley revealing a horrifying second chapter to her tale; where Frankenstein's colleague, Dr. Pretorius, blackmails him into continuing his experiments to create life by making a mate for the Monster.  The film does a fairly good job at continuing the story, thought the plot's a bit thin and there are some continuity issues.  But once again the film is able to deliver some iconic and powerful scenes, and continues to address controversial topics.  The Bride of Frankenstein is a well-crafted and suspenseful tale of horror that has become a masterpiece.",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "I didn't really find this scary as I thought the monster was rather sweet! I kind of got a bit bored towards the end, but as it was so short it did not outstay its welcome. For the time it was made, I'm sure it was quite revolutionary.",
            "review_date": "2012-09-28",
            "source": "rt"
        },
        {
            "content": "Good: Great scenery, good acting, explores Frankenstein's monster more, creates the iconic character Frankenstein's bride, good dialogue, powerful scenes, very fun, shocking ending, there was a good amount of metaphors within.\nBad: I was hopeful to see more interaction between Frankenstein and bride, but I can see why Whales made the decision he did and can respect it. \n\nBride of Frankenstein is one of the few sequels I have seen in my life that may actually surpass its predecessor, Frankenstein. Both are almost even, although I believe this will come out slightly on top. I found this movie to be quite the adventure that kept me very entertained throughout. I noticed that the scenery is one of the better aspects of the movie, a rare thing that I notice and commend in a film. My favorite scenery moment is when Frankenstein is within the forest, the scene is stunning. Particularly in the last major forest scene where it is desolate, and the trees look like telephone poles. The acting is very good overall, especially from Boris Karloff as Frankenstein. There are some classic over the top old movie shrieks from women as they see the monster travel, which is really adds to the fun atmosphere of the movie. Bride of Frankenstein continues to explore the character of Frankenstein's monster. He furthers the amount of sympathy felt for this misunderstood monster. One of the most powerful scenes, which will surely be the first that I think of when I reminisce about this movie, is when the monster travels into a home in the forest. I won't go into detail about this scene for those of you that have not seen it, but it is a very sad and sweet moment. The dialogue and writing is done very well, there were no awkward moments. One thing I love about this movie is that overall it is fun. I'm not sure if it was scary at the time, but now it seems silly, with a few good moments of sympathy thrown in. I also found it interesting while listening to audio commentary afterwards to find that many scenes had a deeper meaning, and that there were many hints to other meanings to things. People have noticed today that that one of the characters is hinted at to be a homosexual, and I can completely see what they mean with a quote that he says being translated that way. Although I have found that people seem to take this too far (Frankenstein is a bisexual?). Whether Whales, an openly homosexual man, did these things on purpose, or just out of the subconscious creativity of a gay man, or maybe these things meant nothing and people are reading too much into it we will not know. \n\nI was thinking that the bride of Frankenstein's monster would be in the movie more, but she is only featured for a matter of minutes! I can see why this direction was taken after looking back, but I found this one of the more surprising elements of the movie. Especially so because the movie is named after her! The ending was very strange, at least to me, for how the movie was going. While the rest of the movie was overall fun, I found the ending extremely depressing. It could be that back when the movie was scary it would have fit, but to me it was just a huge swing of emotion. Do not misunderstand however; despite this quick change in mood I found it nevertheless to be a stunning and powerful ending. This leaves me wishing to watch the next, although I have a sinking feeling it will not be as good. But then again, I thought the same about this film, and look at what I say now! I suggest this to anyone, as this is a large piece of cinema history.",
            "review_date": "2012-09-23",
            "source": "rt"
        },
        {
            "content": "The most famous female of classic horror staggers off the slab in the film that inspired much of Mel Brooks's Young Frankenstein.",
            "review_date": "2012-09-20",
            "source": "rt"
        },
        {
            "content": "I was no older than 10 when I saw this, and I had such a crush on Elsa Lanchester (I know, you don't have to say it).",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "Naturally this is seen as the cinematic classic it is, but you can see in this film the increasing humor and lack of seriousness that caused its downfall (when paired with Abbot and Costello)",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "The monster smokes dope",
            "review_date": "2012-09-08",
            "source": "rt"
        },
        {
            "content": "Its incredible how well James Whale's horror classic has aged. The greatest Frankenstein movie made is technically astonishing even to this day and  Boris Karloff is both frightening and emotionally touching as Frankenstein's monster. Perhaps the greatest universal horror movies ever made.",
            "review_date": "2012-09-08",
            "source": "rt"
        },
        {
            "content": "This is a great sequel! I love that it, to me, has some comedic lines. Or maybe its just my brain because I LOVE Young Frankenstein? :)))",
            "review_date": "2012-09-02",
            "source": "rt"
        },
        {
            "content": "I found the Bride of Frankenstein more enjoyable than Frankenstein. To give the monster a friend he creates a Bride who when sees him lets out an ear piercing shriek. Very enjoyable as a classic universal masterpiece and is truly not to be missed by any horror fan.",
            "review_date": "2012-08-23",
            "source": "rt"
        },
        {
            "content": "The best horror film ever made! Astonishing performances by Karloff and Clive! The reviving of the bride is one of the most memorable scenes in the history of horror films.",
            "review_date": "2012-08-22",
            "source": "rt"
        },
        {
            "content": "One of the greatest sequels ever. Not only does it manage to be as great as the original, but it just may be even better. Karloff is incredible.",
            "review_date": "2012-08-18",
            "source": "rt"
        },
        {
            "content": "Of all the great Universal monster movies, \"Bride of the Frankenstein\" is absolutely the best.  \"Bride\" is filled with so much imagination that it's become James Whale's masterpiece.  Its social and religious satire is very effective, with scenes like the monster tipping over the statue of a bishop and it being tide up on a stake by the locals, resembling the passion of the Christ.  For these scenes to be passed by the \"Christian League of Decency\" in 1934 is amazing. The action, especially in Dr. Frankenstein's laboratory is incredible.  It stands up even to today's production standards. if there is any weakness in the movie, it's probable the over posturing of Dr. Septimus Pretorius.  Don't get me wrong, I loved the character, by sometimes his actions are quite absurd (the experiments in the glass jars comes to mind). This is a classic movie that I would suggest to anyone.",
            "review_date": "2012-08-17",
            "source": "rt"
        },
        {
            "content": "Although not quite as satisfying as its iconic predecessor (1931's 'Frankenstein'), this venture is an entertaining offering with stellar performances from its cast. Boris Karloff and Colin Clive are in top form, as is the lovely Elsa Lanchester (playing the title character as well as author Mary Shelley in the opening scene). 'Bride of Frankenstein' may suffer from leaving the Monster's Mate until the last ten minutes and not giving her much to do, but it's a handsomely produced experience nonetheless.",
            "review_date": "2012-08-11",
            "source": "rt"
        },
        {
            "content": "I enjoyed this more than the first film. Some of the camera work was fantastic, especially during the \"making of the Bride\" scene. Shame we got to see so little of her though, i would have liked to have seen her character explored more.",
            "review_date": "2012-08-09",
            "source": "rt"
        },
        {
            "content": "The Bride of Frankenstein reunites James Whale, Colin Clive and Boris Karloff for a sequel that often overshadows its predecessor in popularity, especially when Halloween rolls around. The over-the-top exuberant recreation of \"the Bride\" intensify's the films setting. The cinemaography and artistic flare for choosing odd angles our pleasing to the eye and unforgettable like no other Horror film before its time.\n\nUltimately this would be Jame Whales final film, and most remember masterpiece of the 1930's. Is still relivent and loved by Horror Enthusiast, Its astonishing how if this film was released today it would be considered a supernatural drama/ comedy. Whales work evolutionised and put forth a plateform for Horror films to come. He and Karloff will forever be immortalized.",
            "review_date": "2012-07-18",
            "source": "rt"
        },
        {
            "content": "James Whale, Boris Karloff & Colin Clive Re-unite In Bride Of Frankenstein. Although It Ruins The Ending Of The First Film, This Sequel Again Shows That Frankenstein's Monster Is Not Actually A Terrible Being. But Like A Misunderstood Child, Rejected By The Public Just Because He Looks Different. The Childish Side To Karloff's Character Can Be Seen Especially In The Scene With The Blind Hermit. There Is A Long Suspenseful Build-Up To The Revealing Of The Monster's Bride, Only To Be Blown Up Shortly After. But Once Again James Whale Does A Fantastic Job At Directing, Just As Karloff's Performance Is Top Notch. This is one of those rare instances where the sequel is said to be superior than it's original & in many ways it is.",
            "review_date": "2012-07-07",
            "source": "rt"
        },
        {
            "content": "This was strangely magical and creepy with a heart hidden within itself.",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "The first moments of the film are incredibly original & give you a feeling of a narrative....then on.\nThe movie(for me,atleast) is better than the original.\nA must watch for all fans of the B&W era.",
            "review_date": "2012-06-29",
            "source": "rt"
        },
        {
            "content": "A great ol' black and white horror that surpasses the original.",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "your wife hates you get drunk with a blind guy!",
            "review_date": "2012-06-01",
            "source": "rt"
        },
        {
            "content": "awsome, just awsomne!",
            "review_date": "2012-05-31",
            "source": "rt"
        },
        {
            "content": "A true classic. Even better than the original. Ernst Thesiger practically steals the show with his flamboyant and macabre Dr. Pretorius. A must see, if not own, for any true horror fan.",
            "review_date": "2012-05-08",
            "source": "rt"
        },
        {
            "content": "If it weren't for that completely useless and silly maid character this film would be perfect. It has all of the best elements of the original Frankenstein with some added parts from the book. Standout here would be The monsters interactions with the blind man. That has always been one of my favourite moments in media because it goes to show just how judgemental those who see can be, and that everyone is deep down a person. The film is also enjoyable due to the evolution of the Monster as a legitimate character. It has feelings, and is becoming more in tune with his human brain. Then the addition of the insane villain Dr. Pretorius and you get a near perfect monster ensemble. The only downfall of the film is the goofy nurse, and the somewhat sloppy beginning. Yet a single tear from the monster shows emotion and triumph.",
            "review_date": "2012-05-06",
            "source": "rt"
        },
        {
            "content": "Frankenstein. Friend.",
            "review_date": "2012-05-04",
            "source": "rt"
        },
        {
            "content": "Perfect! \nShe's alive,she's alive....",
            "review_date": "2012-04-29",
            "source": "rt"
        },
        {
            "content": "it was scary to me when i was little",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "really enjoyed this one had some humour and a good story behind it",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "it was scary to me when i was little",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "Timeless, It's become more of a legend than a film... Gothic horror at it's best!!",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "I like this better then the first. My favorite is Dr. Pretorius & Minnie. The little people that Dr. Pretorius makes are great FX for the time.",
            "review_date": "2012-04-20",
            "source": "rt"
        },
        {
            "content": "Alone, bad... Friend, good...",
            "review_date": "2012-04-16",
            "source": "rt"
        },
        {
            "content": "When the director calls the script for a sequel to his original masterpiece a load of crap, you know you can't be on to a good thing. However, that's exactly what James Whale said when he first read the screenplay for the sequel to his iconic Frankenstein. Now, continue reading the history books and you'll discover that Whale was extremely unwilling to go ahead with the picture unless it was done under his terms. Which is great and a wonderful sense of understanding that a job is only as good as the effort you put into it. Good for you Whale.\r\n\r\nThe problem is, for me, Bride is a bit of a mess. Broad strokes of comedy sit uneasily next to scenes of pathos and horror. After the Monster (Boris Karloff) brutally kills two people, the murders are immediately followed by a scene in which a villager spies and, subsequently, runs from the Monster in a way that would have made Benny Hill blush.\r\n\r\nThere's also scenes that make no real sense as to their belonging. Responding to an invitation from Dr Pretorious, his ex-mentor, Frankenstein (Colin Clive) is introduced to the doctor's new experiment. Pretorious, played with camp glee by Ernest Thesiger, joyfully pulls jar after jar out of his bag. Each one containing a miniature person, ranging from Henry VIII to the Devil. It's all so completely bewildering, you wonder what it's relevance could be. In the end, it just seemed to be a long preface to Pretorious saying 'You know what? We should make another creature! How awesome would that be?'. Well, words to that effect anyway.\r\n\r\nThe film does have its good points. The titular monsters played by Karloff and Elsa Lanchester are skillfully done. Lanchester plays the Bride with twitchy limbs and hype-screaming, making her seem almost reptilian. It's a shame that the Bride's arrival and departure is so short.\r\n\r\nBride could really have done with a bit of trimming, which is unusual for a film that is only 70 minutes long. It takes at least nine minutes to get to the actual as we have to make do with a bizarre conversation between Shelley, Byron and Shelley as they discuss the events of the first film. It's truly a lesson in overacting and I cringed through most of it.\r\n\r\nSo, when Whale made the big call about the script all those years ago, it's a shame he didn't stand by his guns a bit longer.",
            "review_date": "2012-04-14",
            "source": "rt"
        },
        {
            "content": "This is an absolute masterpiece of cinema. I sat enthralled with this story as it took me from thrills to comedy to terror. James Whale conjured a brilliant framing device with the Mary Shelly / Lord Byron / Percy Shelly scene adding more to the dreaded tale of Frankenstein and his Monster. What an absolute joy it was to see Boris Karloff's performance as he moved us to carrying about him. FRIEND.. GOOD. Jack Pierce's make-up is again astonishing, even better this time around. The addition of mad scientest #2, Ernest Thesiger as Doctor Pretorius was tremendous. He was the worst creature in the film, but an absolute riot as a complete loon. I didn't care from the screeching maid towards the beginning, but I suppose it keep the film on a lighter footing as to not be so heavy handed and dark as the first film. When the film ended I was hurt... I wanted MORE !! This, for me, will go down as a true classic and a favorite film. WE BELONG DEAD !!",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "Believe it or not, this surprisingly, supposed horrific film has dark comedy to it; you can also see that much of the film (Young Frankenstein) borrowed a good portion of it's scenes from this classic black & white Universal Pictures production... The best thing about this flick is that the monster played by Boris Karloff, actually talks and scares the shit out of his presumed bride, simultaneously scary and funny too!!!\nI wish I had this in my collection!",
            "review_date": "2012-04-06",
            "source": "rt"
        },
        {
            "content": "Better sequel than the original Frankenstein for the one reason that they included a musical score in this one.",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "The Bride of Frankenstein reunites James Whale, Colin Clive and Boris Karloff for a sequel that often overshadows its predecessor in popularity, especially when Halloween rolls around. The problem that I have with it is that it kind of ruins the first film in a way, which is a problem most sequels seem to have. The monster being dead at the end of the first film only to be alive in the second one makes the impact of that film less satisfying. Karloff himself was also unhappy with the direction it took at times, citing that it was silly for the monster to be talking so much. The other problem that I have is that there's this enormous build-up for the final scene of seeing The Bride, only to be blown up in an explosion not long after. It's anti-climactic and doesn't give the film any real power. However, the scenes with the blind hermit, the visual effects and the overall style are very good and add to the story a bit more. It's just a shame that it puts a bit of a tarnish on the original after seeing it.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "This is an absolute masterpiece of cinema. I sat enthralled with this story as it took me from thrills to comedy to terror. James Whale conjured a brilliant framing device with the Mary Shelly / Lord Byron / Percy Shelly scene adding more to the dreaded tale of Frankenstein and his Monster. What an absolute joy it was to see Boris Karloff's performance as he moved us to carrying about him. FRIEND.. GOOD. Jack Pierce's make-up is again astonishing, even better this time around. The addition of mad scientest #2, Ernest Thesiger as Doctor Pretorius was tremendous. He was the worst creature in the film, but an absolute riot as a complete loon. I didn't care from the screeching maid towards the beginning, but I suppose it keep the film on a lighter footing as to not be so heavy handed and dark as the first film. When the film ended I was hurt... I wanted MORE !! This, for me, will go down as a true classic and a favorite film. WE BELONG DEAD !!",
            "review_date": "2012-03-27",
            "source": "rt"
        },
        {
            "content": "A horror classic.  Still very entertaining today, 77 years after its release.  The special effects and cinematographic techniques were probably quite innovative for 1935 and don't feel cheap or tacky by today's standards.\n\nMovie could have been longer though.  Given half an hour more, director James Whale could have explored several emotional and human relationship issues he raised in the movie.  Instead, the ending is quite abrupt.",
            "review_date": "2012-03-23",
            "source": "rt"
        },
        {
            "content": "Considering the movie was made in 1935, this horror flic is very entertaining if not terribly thought-provoking. Dr. Pretorius as the demented but unruffled \"Doctor Death\" is particularly amusing. L",
            "review_date": "2012-03-18",
            "source": "rt"
        },
        {
            "content": "One of the best Frankenstein movies ever.",
            "review_date": "2012-03-16",
            "source": "rt"
        },
        {
            "content": "Classic horror is the best. This had a great plot. The plot was also told in a good manner, even thought it has a short time length. It was beautifully paced. I just wish that the film was longer. There are many extra scenes that they could have added. The writing was also good and funny. Yes, their was dialogue that was just hilarious. This is a classic horror film so it's not really scary but back then it must have been a nightmare. That was some nice makeup on Frankenstein and his bride. Why didn't the bride get more screen time? They should have also made this a romance. Romantic horror, you don't see that every day. If you like classic horror films then you should watch this.",
            "review_date": "2012-03-12",
            "source": "rt"
        },
        {
            "content": "About as good as the first film, and in some ways better. There are many fun moments with the characters, and some oddly weird scenes. The Bride's appearance is short, but classic. Some of the best cinematography yet in the Universal Monster series.",
            "review_date": "2012-03-11",
            "source": "rt"
        },
        {
            "content": "I'm a real sucker for stories about misunderstood monsters, so it shouldn't come as much surprise that this is one of my favorite movies. James Whale directs this story about a mad scientist (Ernst Thesiger) who coerces Henry Frankenstein (Colin Clive) into creating a female companion to the original monster. Meanwhile, this monster (Boris Karloff) is wandering the countryside alone and gets subjected to all the cruelties and all-too-scarce kindnesses that color the human race. As a whole, The Bride of Frankenstein is a bold, occasionally bizarre, and well-made film that surpasses the good qualities of its predecessor.",
            "review_date": "2012-03-09",
            "source": "rt"
        },
        {
            "content": "Continuing events from the classic original, more a set up for the bride as she appears at the end, but good stuff going on here with the monster, and frankenstein himself, fits in with the original nicely",
            "review_date": "2012-03-03",
            "source": "rt"
        },
        {
            "content": "A Fantastic film. The Monster is more present in this film and is very enjoyable to watch. Boris will always be the best Frankenstein as far as I'm concerned. Elsa Lanchester is very Haunting and beautiful as the bride, yet her hissing is very eerie. If you love Horror movies this is a must see.",
            "review_date": "2012-02-26",
            "source": "rt"
        },
        {
            "content": "One of James Whales most perfectly realised movies. What distinguishes here is the low horror content and the high level of parody and macabre humour.",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "This is one of the stupidest movies I have ever seen. Yet, it's almost as powerful and meaningful as the first one!",
            "review_date": "2012-02-13",
            "source": "rt"
        },
        {
            "content": "A vast improvement over the original.  All the characters are flushed out more, including the Monster itself!  One of the best sequels to ever be made.  Sure it's old, and not scary by today's standards, but it is a true classic and something I have to watch every October.",
            "review_date": "2012-02-03",
            "source": "rt"
        },
        {
            "content": "I actually really liked it. The special effects were extremely impressive for 1936, Boris Karloff did an amazing job as The Monster, supporting actors and other roles were great actors,and the scene with the blind man for some reason really touched me. The whole friend idea I guess. I reccommend.",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "Better than the original. Also this was the inspiration for Young Frankenstein. one of the best parodies ever.",
            "review_date": "2012-01-28",
            "source": "rt"
        },
        {
            "content": "Really is one of the greatest movies of all time. Deserves to be among the ranks of Citizen Kane or Sunset Boulevard.",
            "review_date": "2012-01-21",
            "source": "rt"
        },
        {
            "content": "nem folytatÃ¡s. ez a befejezÃ (C)s!",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "One of my favorite films of all time, and certainly the best of the Frankenstein series, this  film brilliantly mixes humor, horror, and pathos. The title however, is a little misleading, the \"bride of frankenstein\" only really appears in the last five minutes (ironic considering she's now considered something of a horror icon), so if you watch the film for her, prepare to be majorly disappointed.",
            "review_date": "2012-01-18",
            "source": "rt"
        },
        {
            "content": "this film has no point what so ever! who the heck would like this sorry piece of crap! the bride shows up at the last 5 minutes of the movie! i freaking hate this movie! the original was a genius classic of monster films! and they ruin this movie! the monster sucks in this movie! why? he talks, he smokes cigars, he drinks wine! he's such a wuss! this movie sucks! don't watch it!",
            "review_date": "2012-01-17",
            "source": "rt"
        },
        {
            "content": "One of the best horror sequels ever made; I'd even go as far as to say one of the best flat out sequels ever made. \"Bride of Frankenstein\" came 4 years after the success of the 1931 original and reunited director James Whale with actors Boris Karloff and Colin Clive. Karloff returned as the Monster and Clive was back as Dr. Frankenstein. In this movie they decide to create a bride for the Monster. Throughout the whole movie the Monster is just trying to find his place in the world, but is unable. There is a now classic scene (thanks to \"Young Frankenstein\") in which a blind man offers his friendship to the Monster not realizing who he is (until some hunters come in and realize who he is). The scene is awesome because for one it's the first time we hear the Monster speak (\"Friend, good!\") also it shows a different layer of the Monster we've never seen before.\n\nColin Clive is back as Dr. Frankenstein and he gives a great performance again. This movie was made 2 years before his untimely death in 1937 at the age of 37. Along for the ride this time is Elsa Lanchester who has double duty playing Mary Shelley in the opening of the movie and as the Monster's Mate at the end of the movie. The Bride herself is one of the most recognized characters in film history, with her \"shock\" hair due and the white lighting bolt streaks going up it. As being so recognized, she is on screen for less than 5 minutes! The Bride has always been one of my favorite of the Universal Monsters and yet she gets almost no screen time!\n\nAlong with the great performances this movie has some fantastic quotes, just like the original. The best being \"We belong dead!\" as spoken by the Monster at the end of the film. Also, I'd like to add that the music score to this movie is awesome as well. At a time when a lot of movies were just using stock music or classical music as their score, this one went all out with an original score.\n\nThis would be the last time James Whale and Boris Karloff would work together on a Frankenstein film. A few years later Karloff would don the costume for one last time as the Monster in \"Son of Frankenstein\", a movie I have yet to see, but I've heard is one of the best too.",
            "review_date": "2011-12-25",
            "source": "rt"
        },
        {
            "content": "loved it, I  want it on DVD, It was better than what I expected, It starred Boris Karloff as the Monster and Elsa Lanchester as Mary Shelley/The Bride, I thought it was a good movie, I loved it",
            "review_date": "2011-12-20",
            "source": "rt"
        },
        {
            "content": "I wish I had those little people inside of those bottles. They looked so nice.",
            "review_date": "2011-12-19",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2011/12/bride-of-frankenstein.html",
            "review_date": "2011-12-10",
            "source": "rt"
        },
        {
            "content": "One star for the monster's tears after making a friend, two stars for the climactic scene of the movie where the bride comes to life.  The rest is rather unmemorable and more comic than suspenseful.",
            "review_date": "2011-12-10",
            "source": "rt"
        },
        {
            "content": "\"The Monster Demands a Mate\"\r\nExceptional! Bravo! , Greatest of all Frankenstein film. It's rare for a film to have a sequel which is way better than the original one or had the same level of appreciation!. One of my favorites of all time!",
            "review_date": "2011-12-07",
            "source": "rt"
        },
        {
            "content": "I appreciated how the movie ties into the original Frankenstein movie by picking up right where the last one left off making a seamless transition. The monster gains more depth in this film, which is a good thing, and although the motives to create the bride were a little forced, it works well enough. The scene with the blind man is actually quite heartwarming and is an iconic movie moment to remember. The finale is an unexpected magical moment that is both sad and heartfelt. Overall this movie may be more effective than its' predecessor.",
            "review_date": "2011-12-03",
            "source": "rt"
        },
        {
            "content": "one of the best sequels ever made",
            "review_date": "2011-11-23",
            "source": "rt"
        },
        {
            "content": "For the sequel to his runaway smash treatment of Frankenstein, James Whale ramped up the camp factor producing a masterful mixture of comedy and macabre. Karloff and several other cast members returned to reprise their roles from the the first movie but they were memorably joined by Elsa Lanchester in the duel tole of Mary Shelley and The Bride, Una O'Connor as Minnie and the completely OTT Ernst Thesiger  as Dr. Pretorius (a scene stealing character and performance). There's some fantastic camera work which set the standard for horror films for decades to come. It is a movie that is imbued with madness and yet manages to find time to give us some touching and subtle moments as well. None more so than the classic scene between Karloff's monster and the blind peasant who befriends him. \nI am constantly astonished at the economy of the story telling of these Universal horror movies. They manage to pack more into just over an hour than many modern films do in twice that length by giving the focus to fast plot and good characterisation and I love them for it. \nThere are faults. As with the first movie, the story seems to be set in a 19th century where characters wear 1930's fashions and use more electricity than the National Grid but these quibbles are easily forgiven thanks to the sheer quality of this hard to beat classic.",
            "review_date": "2011-11-21",
            "source": "rt"
        },
        {
            "content": "according to 1935 the movie was 2 horror.",
            "review_date": "2011-11-15",
            "source": "rt"
        },
        {
            "content": "One Of The Worlds Greatest Horror/Thriller Movies!",
            "review_date": "2011-11-13",
            "source": "rt"
        },
        {
            "content": "One of my favourite classic horror films",
            "review_date": "2011-11-13",
            "source": "rt"
        },
        {
            "content": "4 aÃÃ,Â±os despuÃ (C)s de su primer Frankenstein, James Whale fue capaz de superarse con esta mÃÃ,Â­tica secuela. En cierto modo, La Novia de Frankenstein corrige el dislate argumental del tercio final de su antecesora, acercando mÃÃ,Â¡s la pelÃÃ,Â­cula al espÃÃ,Â­ritu de la obra de Mary Shelley y dotando de una mayor complejidad a la criatura. Pero no sÃÃ,Â³lo eso: las aportaciones apÃÃ,Â³crifas (El Doctor Praetorious y el prÃÃ,Â³logo en Villa Diodati) acaban de redondear una cinta que acentÃÃ,Âºa el aroma macabro (y su traducciÃÃ,Â³n al expresionismo fÃÃ,Â­lmico) de su hermana de 1931. Karloff llevÃÃ,Â³ al monstruo a cimas de patetismo inalcanzables y a Elsa Lanchester le bastaron un par de minutos para alcanzar el estatus de icono inmortal.",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "Another one of those rare sequels that outshine their predecessors. Also directed by James Whale 'The Bride of Frankenstein' manages to delve deeper into the characters from the original film. Again Karloff gives his all as the Creature who longs for acceptance.",
            "review_date": "2011-11-07",
            "source": "rt"
        },
        {
            "content": "As great as the original film is, the sequel \"The Bride of Frankenstein\" is an improvement in almost every way.  While the first film certainly gave you some sympathy for the doctor's creation, this film allows Karloff to give an even stronger performance as an emotionally wounded, shunned creature just looking for acceptance.  His fragmented sentences and eternal look of sorrow really bring the tragedy of his existence to life.  His  final actions also show a growth in the character, and the fact that he allows one of the very people who shunned him to survive his actions shows he in many ways is less of a monster than the human characters in the film.  The story is framed as well, being retold as a story by Mary Shelley, played by Elsa Lanchester (who also plays the Bride in the film's finale), and I liked that element of the story as well as it honors the origins of the tale.  Of the many classic Universal horror flicks, I would say this is probably the best cinematically (second would be the Invisible Man for me, which is kind of an overlooked gem at this point) and it made for the most rewarding viewing experience for me among the films from that era.",
            "review_date": "2011-11-05",
            "source": "rt"
        },
        {
            "content": "Classic and campy. The humor is fantastic.",
            "review_date": "2011-11-03",
            "source": "rt"
        },
        {
            "content": "This is definately my favorite of the sereis. Clive and Karloff bothe give great preformances and makes you feel for the characters, even the monster. dr. Pretoreous is one of the best villains on screen and possibley the best mad doctor portrayed in a motion picture. check it out cause its epic.",
            "review_date": "2011-10-31",
            "source": "rt"
        },
        {
            "content": "I think this is actually a better movie than the original. As far as sequels go, this is a must for classic horror fans!",
            "review_date": "2011-10-30",
            "source": "rt"
        },
        {
            "content": "The first Frankenstein movie, although shocking in its time, now seems clichÃ (C) and rather laughable. Bride of Frankenstein is a huge step forward, with a touching and chilling atmosphere, a great storyline, impressive editing techniques and some memorable performances. A horror classic, and the polar opposite of its predecessor - it definitely still holds up.",
            "review_date": "2011-10-30",
            "source": "rt"
        },
        {
            "content": "Not quite as good as the original, but still classic. Having the monster speak was definitely a mistake, though.",
            "review_date": "2011-10-30",
            "source": "rt"
        },
        {
            "content": "this is really something... lol Really funny, odd, really sad and touching, enjoyable to see some of the of-course-he-would-say that moments. really entertaining (and, yes: scary too!) film",
            "review_date": "2011-10-29",
            "source": "rt"
        }
    ]
}