{
  "title": "Cinderella",
  "rating": 7.4,
  "release_date": "2015-03-13",
  "genre": [
    "Adventure",
    "Drama",
    "Fantasy",
    "Romance",
    "Family"
  ],
  "summary": "The story of Cinderella follows the fortunes of young Ella whose merchant father remarries following the tragic death of her mother. Keen to support her loving father, Ella welcomes her new stepmother Lady Tremaine and her daughters Anastasia and Drisella into the family home. But, when Ella's father suddenly and unexpectedly passes away,The story of Cinderella follows the fortunes of young Ella whose merchant father remarries following the tragic death of her mother. Keen to support her loving father, Ella welcomes her new stepmother Lady Tremaine and her daughters Anastasia and Drisella into the family home. But, when Ella's father suddenly and unexpectedly passes away, she finds herself at the mercy of a jealous and cruel new family. Finally relegated to nothing more than a servant girl covered in ashes, and spitefully renamed Cinderella, Ella could easily begin to lose hope. Yet, despite the cruelty inflicted upon her, Ella is determined to honor her mother's dying words and to \"have courage and be kind.\" She will not give in to despair nor despise those who abuse her. And then there is the dashing stranger she meets in the woods. Unaware that he is really a prince, not merely an employee at the Palace, Ella finally feels she has met a kindred soul. It appears as if her fortunes may be about to change when the Palace sends out an open invitation for all maidens to attend a ball, raising Ella's hopes of once again encountering the charming \"Kit.\" Alas, her stepmother forbids her to attend and callously rips apart her dress. But, as in all good fairy tales, help is at hand as a kindly beggar woman steps forward and, armed with a pumpkin and a few mice, changes Cinderella's life forever. [Walt Disney Pictures]… Expand",
  "critic_reviews": [
    "As a picture that celebrates one of the greatest archetypes in literature while freshening countless familiar details, I doubt it can be bettered.",
    "With his live-action retelling of Cinderella, director Kenneth Branagh accomplishes a wonderful bit of spellwork: He manages to de-toxify Disney’s flagship fairy tale without overcorrecting away its prettiness, sincerity, or charm.",
    "Nearly a century after that black-and-white cartoon short, and 65 years after a “classic” animated feature that missed the mark, Disney finally got Cinderella right — for now and, happily, ever after.",
    "As pure of heart as its heroine, Cinderella floats across the screen like a gossamer confection, full of elegant beauty and quiet grace.",
    "Like all of Branagh's films, even some of the bad ones, Cinderella is practically Wagnerian in its ambitions — it's so swaggering in its confidence that at times it almost commands us to like it. But it's also unexpectedly delicate in all the right ways, and uncompromisingly beautiful to look at.",
    "Cinderella is a wonderfully realized family feature that retains the strengths of its source material while at the same time updating it for today's audiences.",
    "Like its titular fairy tale heroine, Cinderella is sincere, not an ironic bone in it.",
    "The world didn’t need yet another Cinderella story, but the one we got is one of the best versions ever put on film.",
    "With no sheen of reflexivity, and no in-jokey admission of its hokiness to hide behind, can this non-ironic un-re-invention possibly work? Actually, yes it can, and does surprisingly well, by approaching the story with a sincerity and sweetness that defy cynicism, and by casting Cate Blanchett.",
    "Loving and lavish, Kenneth Branagh’s take will please traditionalists more than revisionists, but there’s enough here to enchant both young and old.",
    "Screenwriter Chris Weitz embraces both the magic and the humanity of the classic fairy tale. He underlines the virtues of kindness and courage in a heroine right out of the pages of a traditional storybook, who gradually reveals the qualities of a self-possessed modern girl.",
    "Mention must be made of James’ guileless turn as Cinderella. Like the beautiful crystalline-blue ballgown worn in the film’s centerpiece section (you can’t take your eyes off it; it literally dazzles), she looks as if she’s lit from within.",
    "There’s a lot to like about director Kenneth Branagh’s gorgeously fanciful tale.",
    "It's hard for any actor or director to pull off love at first sight, but Branagh is lucky enough that James and Madden have just enough genuine on screen chemistry to make you at least want to believe it's possible.",
    "Although James and Madden are no Fred and Ginger when it comes time for the fabled ball, her breathy swoons and glitter-splashed décolletage and his personable imperviousness bode well for the couple's future.",
    "With its vibrant sparkle and enchanting visuals, Cinderella almost makes you believe in magic.",
    "Cinderella — the new, live-action Cinderella, that is — is an attempt by the Mouse House to revive one of Walt’s oldest fairy-tale adaptations with care and class and modernity and timelessness.",
    "Still, you can’t fault a family entertainment extravaganza too much if it actually goes out of its way to integrate the ensemble of a fairy tale in an Old World European setting with a diverse array of supporting players. Branagh deserves an extra bravo just for that. And we mean it sincerely.",
    "Branagh's regular composer, Patrick Doyle, delivers a persistent dribbling stream of forgettable mood music, and that's too bad; most of the scenes are acted so well, you don't want anything competing with them.",
    "Blanchett manages to project the idea that there’s more to this woman than mere banal evil. Cinderella may well be the heroine of this story, but if you wanted someone to have a few drinks with, you’d pick her stepmother in a heartbeat.",
    "The fizzy cocktail combination of Blanchett’s cartoonish hauteur and Branagh’s visual razzle-dazzle and confectionary sets (courtesy of the legendary Dante Ferretti) manages to take a tale as wheezy as Cinderella and make it feel almost magical again.",
    "Count Cinderella as a dazzling dream of a movie from director Kenneth Branagh, who can leap from the Bard (Henry V) to the boffo (Thor) with no apparent sweat.",
    "Every generation gets a new one, and this time, replete with computer graphics and singing mice, Kenneth Branagh has created a live-action fairy tale that pulls out every stop and spares no expense.",
    "Disney’s new live-action version is for the most part beguilingly good, even though it’s no replacement for the studio’s 1950 animated classic.",
    "It's beautiful to behold and wears its magic on its well-appointed sleeves, daring the audience to crack wise.",
    "A delightfully clear-eyed adaptation of Charles Perrault’s fable of goodness triumphing over adversity, which brings psychological depth to characters like Cate Blanchett’s magnificent, believable stepmother.",
    "Indeed, there is barely a frame of Branagh’s film that would cause Uncle Walt to finger his mustache with disquiet.",
    "Though this Cinderella could never replace Disney’s animated classic, it’s no ugly stepsister either, but a deserving companion.",
    "The result is more of an illustrated storybook of a cherished classic than a living thing in its own right.",
    "A retrograde fantasy with the depth of a dressing-up box, but it’s spirited, genuinely funny and played to the hilt by an excellent cast.",
    "An enchantment, plain and simple. And while it won't make many forget Disney's iconic animated version, it certainly joins it as one of the more enjoyable re-tellings of this classic tale.",
    "Branagh, working from a script by Chris Weitz, gives the film emotional heft. James’ performance — never saccharine, often staunchly independent — makes the story’s more regressive elements float away.",
    "Despite Blanchett's resplendent performance and the comforting assurances that are inherent with any excursion into the reliably innocuous Disney universe it's tough to overlook the fact that there's something depressingly antiquated about Branagh's dazzling fairytale and its regressive sexual politics.",
    "Very little is out of place in Branagh’s do-over, but that’s almost a problem: there’s a feeling, throughout, of going perfectly through the motions. The film is all smoothly-operated crane shots, excellent hair, gleaming teeth. Originality is the glass slipper it never even tries on.",
    "It’s all very sweet and harmless, though you can’t help wishing that Cinders got her happy ending for more than being kind to her digital mice and weathering a lot of crap with a never-ending smile on her face.",
    "Branagh and Weitz stick lovingly to the legend throughout; and while it might have been nice to see the new-model Cinderella follow Frozen’s progressive, quasi-feminist lead, the film’s naff, preserved-in-amber romanticism is its very charm.",
    "This Cinderella is achingly old-fashioned, with scant humor, a regressive heroine and godmother effects that aren't special.",
    "Clothed in a colorful mishmash of historical fashions and scored to sweeping strings, the movie is like an antique cut-crystal vase: gorgeous, fragile, empty.",
    "The curious thing about this new Cinderella is that every old and familiar element is done beautifully.",
    "Mr. Branagh’s ascension into big-budget studio directing largely remains a mystery, and there’s little in Cinderella beyond its faces and gowns that captures the eye or the imagination.",
    "This Cinderella is all dressed up with nowhere very interesting to go.",
    "In the quest to purge this Cinderella of anything sly or post-modern, though, the filmmakers have eliminated any wit or distinction, making this a pre-modern disappointment.",
    "For all its gossamer, gauze, filigree and refinement, Cinderella drags when it should skip as lightly as its title character when she’s late getting home from the ball.",
    "Most of Cinderella’s costuming and production design takes a “glitter first, taste second” approach that embodies the film’s cotton-candy style of filmmaking: a heady sugar-rush in the moment, but empty and a little nauseating over the long haul.",
    "The filmmakers cut the film to emphasize the story's familiar plot points, rather than highlight any instances of personal visual artistry.",
    "The pre-teen girls this is intended for have a right to expect more laughs, broader villainy and more fun. This time out, the glass slipper doesn’t fit.",
    "Cinderella is so scrubbed of personality, it’s not even worth calling a mess."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Very good movie, it depicts exactly how I imagined it as a child. The acting, sound, animations, visuals, all was good!\rCouldn't wish for a better movie.",
      "review_date": "2016-06-23"
    },
    {
      "review_title": null,
      "content": "It wasn't earth-shattering by any means but it was a pleasant and fun adaptation of the Cinderella story. A good amount of humor and it was fun seeing Helena Bonham Carter as the fairy god mother play a different role than her typical dark character.",
      "review_date": "2015-03-28"
    },
    {
      "review_title": null,
      "content": "A sumptuous, impeccably mounted re-envisioning of the fairy tale classic, Kenneth Branagh's \"Cinderella\" occasionally struggles with its pacing, but the sheer elegance and dazzling, atmospheric quality of the film successfully obscure anyA sumptuous, impeccably mounted re-envisioning of the fairy tale classic, Kenneth Branagh's \"Cinderella\" occasionally struggles with its pacing, but the sheer elegance and dazzling, atmospheric quality of the film successfully obscure any minor flaws.",
      "review_date": "2015-04-27"
    },
    {
      "review_title": null,
      "content": "A great remake of the original, in live action. The story is a classic, and doesn't change, and that is what I hoped for. The actors are amazing and feel like the characters. My only complaint was it was very short.",
      "review_date": "2017-05-29"
    },
    {
      "review_title": null,
      "content": "I have seen many adaptations of the story Cinderella including the animated version, but out of all of them this one topped the list because of how well crafted it is and the acting roles were spot on from beginning to end. Disney really tookI have seen many adaptations of the story Cinderella including the animated version, but out of all of them this one topped the list because of how well crafted it is and the acting roles were spot on from beginning to end. Disney really took the time to put effort into making this one of their successful live action versions of an animated film! Only nitpick I will give it is the pacing is a little off but other then that I truly enjoyed this very much!",
      "review_date": "2017-10-20"
    },
    {
      "review_title": null,
      "content": "Not changing plot, keeping everything classic, no overblown cgi as in all modern adaptations. Yet manages to stand on its own, beautifuly made retelling of this sweet fairytale.",
      "review_date": "2018-02-19"
    },
    {
      "review_title": null,
      "content": "I'm a senior citizen, single, no grand kids to accompany me, just me. My mom took me to see the Disney animated classic in the 50's. It has held a beautiful place in my heart ever since. I've seen many adaptations over the decades. None haveI'm a senior citizen, single, no grand kids to accompany me, just me. My mom took me to see the Disney animated classic in the 50's. It has held a beautiful place in my heart ever since. I've seen many adaptations over the decades. None have ever matched this. This non-animated version for me was spectacular visually, moving, romantic, and sparked the flames in my heart from this legendary fairy tale I've held since I was seven. Could not have been done better!",
      "review_date": "2015-03-13"
    },
    {
      "review_title": null,
      "content": "This movie was delightful from start to finish. I read a critic review that stated \"Same old fairytale\". Exactly, and so wonderfully done. This movie teaches goodness and thinking of others, which is refreshing in the self serving world thatThis movie was delightful from start to finish. I read a critic review that stated \"Same old fairytale\". Exactly, and so wonderfully done. This movie teaches goodness and thinking of others, which is refreshing in the self serving world that we live in. It is filled with beautiful scenery and well cast. I think both male and female, young to old will enjoy this movie.",
      "review_date": "2015-03-14"
    },
    {
      "review_title": null,
      "content": "Spectacular Faithful Version of the 1950 Animated Classic\rEverything in the movie is almost flawless from the way it is executed. The sets are heavy in detail and period. The production design is strikingly stunning. The costumes (by theSpectacular Faithful Version of the 1950 Animated Classic\rEverything in the movie is almost flawless from the way it is executed. The sets are heavy in detail and period. The production design is strikingly stunning. The costumes (by the Academy Award-winning designer Sandy Powell) are elegant especially the glass slipper. And the score (by other Branagh regular Patrick Doyle) is rousing. Almost, there is nothing to criticize here since this is a faithfully accurate adaptation.",
      "review_date": "2015-03-13"
    },
    {
      "review_title": null,
      "content": "I like how this movie follows a lot like the original play, it doesn't fall out too much. However, I thought that the movie was just plain mediocre. I expected more as it has high ratings, but the scripts and story line were very predictable.I like how this movie follows a lot like the original play, it doesn't fall out too much. However, I thought that the movie was just plain mediocre. I expected more as it has high ratings, but the scripts and story line were very predictable. It could have been better, in my opinion, by giving more dramatic lines and seriousness in the scenes. The only thing that attracted me was their wardrobe clothing; sad to say.",
      "review_date": "2015-03-16"
    },
    {
      "review_title": null,
      "content": "What a stunning achievement! Long I had felt transported by a movie and this one exactly does that, whether it's told a million times before. You'd be a heart of stone not to be taken by its wonders. Simply magical!",
      "review_date": "2015-03-14"
    },
    {
      "review_title": null,
      "content": "I don't know why this movie is best rated than \"Maleficent\". They could have added more plot twists, and less lame and cheesy scenes... Besides that, it is an ok movie to watch just one time in your life, and if you don't get bored enough toI don't know why this movie is best rated than \"Maleficent\". They could have added more plot twists, and less lame and cheesy scenes... Besides that, it is an ok movie to watch just one time in your life, and if you don't get bored enough to watch something that follows exactly the same story that you heard a thousand times.",
      "review_date": "2015-09-14"
    },
    {
      "review_title": null,
      "content": "What I enjoyed most about the latest \"animation to live-action\" treatment, is that Cinderella is a relatively straightforward telling of the timeless story. While Alice in Wonderland and Maleficent were re-imaginings, Cinderella is retoldWhat I enjoyed most about the latest \"animation to live-action\" treatment, is that Cinderella is a relatively straightforward telling of the timeless story. While Alice in Wonderland and Maleficent were re-imaginings, Cinderella is retold respectfully for the new generation.  I genuinely believe that Disney did something right with their latest live-action film. While most people were probably expecting a sword-wielding action hero, I'm happy that Disney treated their most beloved character with the uttermost care and respect. The story of Cinderella is very personal to each person who has felt like the underdog, but managed to rise like a Phoenix from the ashes in the end. If Walt Disney were alive today, I'm sure he would be proud to see his most treasured little savior be retold to the new generation in a beautiful and charming way. Bravo!",
      "review_date": "2015-03-13"
    },
    {
      "review_title": null,
      "content": "Absolutely loved this movie!   My husband also raved about the show even though he was ambivalent (at best) going in.  The story is sweet.  And, the costumes and movie sets are amazing.  Every actor is perfectly cast and the special effectsAbsolutely loved this movie!   My husband also raved about the show even though he was ambivalent (at best) going in.  The story is sweet.  And, the costumes and movie sets are amazing.  Every actor is perfectly cast and the special effects are seamless.  The only complaint is that with the previews and the Frozen short and the movie, the experience runs a little long for the little ones, so they start to get a bit antsy at the end.  Yet, it is a wonderful, relaxing, romantic movie - what's not to love???",
      "review_date": "2015-03-15"
    },
    {
      "review_title": null,
      "content": "The movie is not that bad as I thought it would be.It's not just like Maleficent that has dark take on the story.It is still Cinderella But now it is now live in action that kids would enjoy.It is really faithful to the animated classic.TheThe movie is not that bad as I thought it would be.It's not just like Maleficent that has dark take on the story.It is still Cinderella But now it is now live in action that kids would enjoy.It is really faithful to the animated classic.The Jokes are kind a out of place or awkward.It is an accurate representation of A Disney animated movie that we grow up with and now is now live in action but their are some twist  they do in some situations compared to the animated movie but all in all it is still a Cinderella movie that again kids especially young girls might enjoy.I don't know if adults would enjoy too.",
      "review_date": "2015-03-13"
    },
    {
      "review_title": null,
      "content": "Have courage and be kind indeed - add mediocre and twee to the equation and that sums up this very disappointing film. I expected at least a bit more from this Downton/Game of Thrones mash up, but the cast could not save this film from theHave courage and be kind indeed - add mediocre and twee to the equation and that sums up this very disappointing film. I expected at least a bit more from this Downton/Game of Thrones mash up, but the cast could not save this film from the poor dialogue, lacklustre plot and lack of depth to any characters. This is a carbon copy, albeit prettier, of the original Disney film, with less singing. The costumes are the only redeeming feature, spectacular in their design, and I woudn't be surprised if they win awards. Otherwise, in a post-Frozen era, the film fails to engage the audience and it feels archaic, with no attempt to redress the glaring issues with the story for a twenty first century audience. 3.21/10",
      "review_date": "2015-07-12"
    },
    {
      "review_title": null,
      "content": "Sir Kenneth Brannagh's classic glossy, stately fare is given a fairytale twist in \"Cinderella,\" a well-meaning and enjoyable piece that's fun for the whole family.",
      "review_date": "2015-03-14"
    },
    {
      "review_title": null,
      "content": "Its pretty and .... hmmm... well it sure is pretty.\rThe actors are above average... and did i mention it was pretty?\rThis movie had me watching my clock after 20min to see if it was soon done.",
      "review_date": "2015-05-01"
    },
    {
      "review_title": null,
      "content": "This Cinderella remake offers nothing new and plays the retelling way too safe. However, it is still a decently enjoyable time at the theater with great performances, beautiful visuals, and that classic Disney magic.",
      "review_date": "2015-03-19"
    },
    {
      "review_title": null,
      "content": "Cinderella takes a classic Disney film and very much like the Stepmother and Stepsisters due to Cinderella’s dress rip it of all its grace and beauty but unfortunately, there is no fairygodmother to save it. Cinderella is a soulless cashgrabCinderella takes a classic Disney film and very much like the Stepmother and Stepsisters due to Cinderella’s dress rip it of all its grace and beauty but unfortunately, there is no fairygodmother to save it. Cinderella is a soulless cashgrab and it shows through the needless padding, lack of subtlety, and poorly written characters. The film goes the route of the Hobbit trilogy dragging tiny pieces of the original out to excessive lengths with the two minute prologue lasting a whopping 25 minutes. Cinderella quiet resolve is thrown out the window as the narrator talks the audience through her character and the villain loses her quiet intensity. The acting from Cate Blanchett and Helena Bottom Carter is good and the visuals are grand and impressive at times especially during the ball scene but the film does nothing to justify its exsistence or give me any reason to watch this verison when there is a perfectly good version. The Frozen short before this was meh but it was way better than this turd. Unless you are a little girl or a die-hard Disney fan save your money all you are doing is encouraging more lazy live action films that butcher classic timeless stories. It saddens me that we live in a world where a studio will make terrible unoriginal films and they will be a success to this extent. Please prove me wrong on the next round as I can’t bear to sit through another snorefest.",
      "review_date": "2015-03-22"
    },
    {
      "review_title": null,
      "content": "A retelling of the classic fairytale. It doesn't add anything new to the story, but the classic charm and magic of the tale still make it worth watching it all unfold again. Whether it be for the first time or the hundredth.\r The romance,A retelling of the classic fairytale. It doesn't add anything new to the story, but the classic charm and magic of the tale still make it worth watching it all unfold again. Whether it be for the first time or the hundredth.\r The romance, humor, and all around sweetness make it a delightful and charming movie. Everything looks gorgeous. The costumes and special effects bring the magic to life. The whimsical nature of the animated movie is expertly captured. It shows that the magic fairy tales can be brought to life in live-action film just as well as they can be in animated films.\r I have to give praise to the movies fantastic cast. With actors from Game of Thrones being present among them we really could expect nothing less than excellent performances all around. Some might have preferred some new twists to the tale, but the romantic and god-hearted nature of it still make it a joy to watch even if many of us have seen it before. It's a wonderful adaption that can make for a perfect family movie.",
      "review_date": "2015-10-11"
    },
    {
      "review_title": null,
      "content": "After the success of last year’s ‘Maleficent’, both commercially and artistically, another fairy tale gets the revisionist treatment although with far less success. This Cinderella lacks any sense of originality, magic or wonder and is aAfter the success of last year’s ‘Maleficent’, both commercially and artistically, another fairy tale gets the revisionist treatment although with far less success. This Cinderella lacks any sense of originality, magic or wonder and is a disappointingly prosaic affair. The finger must be pointed fairly and squarely at director Kenneth Brannagh whose direction is by turns both lack lustre and uninspired. Early scenes of Cinderella enjoying time with her father are painfully saccharine and set the tone for the rest of the movie in which composer Patrick Doyle is unfortunately complicit. His cloying score must be one of the worst of his career and never comes close to equalling the brilliant work he has done in collaboration with Brannagh before on films like ‘Much ado about Nothing’.\rThe cast also, in the main, offer limp or insipid characterisations. Lily James and Richard Madden, as Cinderella and the prince respectively, are desperately lacking any chemistry together and it is ultimately left to Cate Blanchett as the wicked stepmother and, in particular, Helena Bonham Carter as the fairy godmother to keep any interest alive. Eventually even their amusing moments are engulfed by the dull proceedings and the sea of treacle that drowns any initial enthusiasm an audience may have. Ultimately, It is left to the visuals to provide almost all the enjoyment, and in this area the production design excels as do Sandy Powell’s beautiful costumes. These two branches of film making are the true stars of what is otherwise a very safe and ordinary adaptation of a classic fairy tale that deserved a lot better.",
      "review_date": "2015-04-02"
    },
    {
      "review_title": null,
      "content": "Cinderella is a pretty movie and pretty disheartening that Disney would perpetrate such archaic notions upon our female youth. To be brave and kind cannot mean to be a door mat to unworthy beings. And parents who show good judgement cannotCinderella is a pretty movie and pretty disheartening that Disney would perpetrate such archaic notions upon our female youth. To be brave and kind cannot mean to be a door mat to unworthy beings. And parents who show good judgement cannot lose it if they need to remarry. And of course, if the shoe fits wear it- but your waist must be a size two. At least they showed no discrimination when seeking out the fair maiden even though one was quite sure of her age, size and color. And how evil must her fairy godmother be to give her only a taste of the good life after all that suffering. Why at midnight must everything go back to usual - except for the glass slippers ?  How convenient. If only the prince need not try on the shoe. It would have made a world of difference.  Remake your classics-  but remember - for once upon a time is not now. And I won't forgive you.",
      "review_date": "2015-03-24"
    },
    {
      "review_title": null,
      "content": "The only thing that's interesting about this movie is the visual effects. Other than that, the story is incredibly boring and pathetic. Cinderella is a pushover, who allows her stepmother and stepsisters to abuse her. This film basically saysThe only thing that's interesting about this movie is the visual effects. Other than that, the story is incredibly boring and pathetic. Cinderella is a pushover, who allows her stepmother and stepsisters to abuse her. This film basically says to young girls that it's okay if you're poor, if you're hot and nice, then some rich guy will rescue you. Lame. I really wanted to see Cinderella have some more attitude. I wanted her to rebel against her **** of a stepmother. Yeah, right. She just kept letting them walk all over her again and again and again. I don't remember being so irritated by Cinderella's passiveness in the original. Here, in this remake, it felt like Cinderella had more of a choice and she chose to be bullied. Is there something \"courageous\" or \"kind\" about letting yourself be abused? Hell no.",
      "review_date": "2015-03-14"
    },
    {
      "review_title": null,
      "content": "This adaptation of the classic fairy-tale doesn't really present us with anything new compared to the previous versions; this is not necessarily a bad thing, although it becomes one if the sticking to the traditional storyline isn't backed upThis adaptation of the classic fairy-tale doesn't really present us with anything new compared to the previous versions; this is not necessarily a bad thing, although it becomes one if the sticking to the traditional storyline isn't backed up by some new element, be it the mood, the character development, the cinematography, the soundtrack; anything, really. Unfortunately, despite the accurate choice of locations (whose beauty is nevertheless helped by CGI), the 2015 Cinderella doesn't add any, contributing nothing to the history in film of this story. In other words, the cartoon version of 65 years ago is still the better telling of the fairy-tale.\r As I said, the cinematography and \"embellishment\" of scenery is to be applauded, especially the prince's castle I'd say,  but some things Disney can't ever get right in their live-action, and those are, for instance, costumes, which in this movie look cheap. Another thing they just can't swallow is the original ending of the original fairy-tale, in all its gory madness, which they still refuse to put on film.\r What's also strange to see is how critics have deliberately lowered their standards, maybe to condescende to the industry... I notice how \"A Cinderella Story\" from 2004, which was bad but at least an original adaptation, earned a meager 25, while this new Cinderella, while being essentially on the same level, gets a 67, providing it with a very underserved green background.",
      "review_date": "2015-06-19"
    },
    {
      "review_title": null,
      "content": "My god it was so bad! Instead of giving it a little twist, something that wasn't almost exactly like the animation. Cate Blanchett and HB Carter were good.....they were the only ones. An hour and a half that I will never get back. So,so bad.",
      "review_date": "2015-06-20"
    },
    {
      "review_title": null,
      "content": "Disney has created a lush, but somewhat lackluster live action version of the classic fairy tale. Lily James glows with kindness and beauty in the title role, while Richard Madden make a dashing Prince Charming. Cate Blanchett brings oldDisney has created a lush, but somewhat lackluster live action version of the classic fairy tale. Lily James glows with kindness and beauty in the title role, while Richard Madden make a dashing Prince Charming. Cate Blanchett brings old world elegance as the stepmother without adding much evil charm. Director Kenneth Branagh has emphasized the earnest emotional content, but it's really the visuals where this film shines: Dante Ferretti's art direction and Sandy Powell's exceptional costumes are simply gorgeous. There's not a lot of personality or comic relief in the cast, but the sincerity of the performances keeps it involving. NOTE: The animated short before the feature is a new song from the \"Frozen\" sisters.",
      "review_date": "2015-03-15"
    },
    {
      "review_title": null,
      "content": "I was distracted by all the small waists, including Cate Blanchette who is way over 40. Beyond that, the movie really moved. I loved the scenery, the diversity of the kingdom, and the main characters all had background stories, unlike theI was distracted by all the small waists, including Cate Blanchette who is way over 40. Beyond that, the movie really moved. I loved the scenery, the diversity of the kingdom, and the main characters all had background stories, unlike the usual Cinderella story. Maybe not oscar-worthy, but visually entertaining.",
      "review_date": "2015-03-15"
    },
    {
      "review_title": null,
      "content": "Sumptuous retelling of the classic fairy tale is well acted and contains a lot of enthusiasm. Fun for the whole family, despite essentially telling the same story all over again.",
      "review_date": "2015-05-30"
    },
    {
      "review_title": null,
      "content": "Kenneth Branagh’s revamped Disney fairytale CINDERELLA is the first movie I watch from 2015. A faithful adaptation of the household fable and an eye-catching costume/production pageant. While two leads Lily James (from DOWNTON ABBEY, whereKenneth Branagh’s revamped Disney fairytale CINDERELLA is the first movie I watch from 2015. A faithful adaptation of the household fable and an eye-catching costume/production pageant. While two leads Lily James (from DOWNTON ABBEY, where also outputs McShera, who plays Drisella, one of Cinderella's step-sister) and Richard Madden (from GAME OF THRONES, with his fellow alumnus Anozie, as his loyal Captain) are relatively unknown as for cinema-goers, Cate Blanchett singlehandedly upstages everyone as Cinderella's wicked stepmother without tampering the original gusto.\r to keep reading my review on my blog, google: cinema omnivore, thanks!",
      "review_date": "2015-03-23"
    },
    {
      "review_title": null,
      "content": "It is good that the movie's story held true to the original, but it was also the only movie I have ever fallen asleep at. I have seen this exact story 10 times already, and this movie is nothing special.",
      "review_date": "2015-06-28"
    },
    {
      "review_title": null,
      "content": "Everyone has their own opinion.  I had reservations going in. But, I thoroughly enjoyed this rendition.  It was visually stunning, beautifully acted, and true to the story.  Not many surprises, but who cares?  It's Disney.  Gorgeous to lookEveryone has their own opinion.  I had reservations going in. But, I thoroughly enjoyed this rendition.  It was visually stunning, beautifully acted, and true to the story.  Not many surprises, but who cares?  It's Disney.  Gorgeous to look at and Lily James is a treasure.",
      "review_date": "2015-03-16"
    },
    {
      "review_title": null,
      "content": "Probably the best live-shot Cinderella I've seen.\r Disney has done it again. Everybody knows Cinderella story and what this film gave was as it is with the help of modern CGI works. When I heard about the Disney's live-shot version isProbably the best live-shot Cinderella I've seen.\r Disney has done it again. Everybody knows Cinderella story and what this film gave was as it is with the help of modern CGI works. When I heard about the Disney's live-shot version is getting ready, I had a serious doubt, but not anymore. Nowadays, the filmmakers know how to pull it off a big budget movie with ease. Especially from Hollywood, if one market fails, it will raise in another as the recent example was 'Age of Extinction'. I am glad this movie met a great success despite it was not a surprise material as a story, but was as the quality of product.\r The movie runs nearly for 100 minutes, that does not feel too long as the narration had a wonderful pace. Everything was awesomely handled by the director of 'Thor'. It's a new era of the live-shot movies, which borrows the stories from the fairytales, folklore and classical animations. Recent 'Maleficent' was one of the great examples and this film as well enters the book of triumph.\r Lily James was very good, I haven't seen her much, because she's kind of a new actress in the spotlight. She's cute and adorable, I love to see her in many movies in the future. While Cate Blanchett, I never had any disbelief in her and she delivered it perfectly. An ideal movie for a family to watch at the weekend. I think children would love it, so at least watch it for them, with them.\r 7/10",
      "review_date": "2015-07-30"
    },
    {
      "review_title": null,
      "content": "This cotton candy remake of the original Disney cartoon is clearly for very young children. Its sickly sweet message of kindness and courage is brow-beaten into the audience. Overall it is well made, however it is so quickly paced there isThis cotton candy remake of the original Disney cartoon is clearly for very young children. Its sickly sweet message of kindness and courage is brow-beaten into the audience. Overall it is well made, however it is so quickly paced there is not enough time to be invested in any of the characters.",
      "review_date": "2015-03-29"
    },
    {
      "review_title": null,
      "content": "Cinderella is a brilliant modern rendition of a classic tale. The acting is superb. The visuals, including the scenery and the costumes, particularly Cinderella's majestic blue butterfly gown are magical. A film to see by all. Cinderella,Cinderella is a brilliant modern rendition of a classic tale. The acting is superb. The visuals, including the scenery and the costumes, particularly Cinderella's majestic blue butterfly gown are magical. A film to see by all. Cinderella, bravo, masterfully done!",
      "review_date": "2015-03-23"
    },
    {
      "review_title": null,
      "content": "This is by far the best Cinderella adaptation I've seen. It was raw, powerful and magical with a sophisticated kind of cheesy. With the top-notch CGI, everything in the film seemed so much more surreal and extraordinary. I think I was more inThis is by far the best Cinderella adaptation I've seen. It was raw, powerful and magical with a sophisticated kind of cheesy. With the top-notch CGI, everything in the film seemed so much more surreal and extraordinary. I think I was more in love with the film as a whole than just the prince. It may have been a love story but it was definitely much deeper than that. \"Have courage and be kind\" was a repeated moral that I thought was a great message to have ingrained on our young audience's mindset. Bravo.",
      "review_date": "2015-04-08"
    },
    {
      "review_title": null,
      "content": "Ok so I must say i really didn't know how this movie was going to go but o m g was  I suprized I fricking loved this movie Sheir joy from start to finish good action full of heart and even a little humor perfect for all ages makes u trulyOk so I must say i really didn't know how this movie was going to go but o m g was  I suprized I fricking loved this movie Sheir joy from start to finish good action full of heart and even a little humor perfect for all ages makes u truly Beleive in magic and happy ever after I am a grown man and took my sister to this we both loved it enchanting Disney action magic at its best",
      "review_date": "2015-04-07"
    },
    {
      "review_title": null,
      "content": "Like it’s protagonist, Kenneth Branagh’s live-action adaptation of the Disney animated classic Cinderella proves to be little more than a dull, vapid mess covered up by a sparkly blue dress, and no amount of computer-generated mice, slapstickLike it’s protagonist, Kenneth Branagh’s live-action adaptation of the Disney animated classic Cinderella proves to be little more than a dull, vapid mess covered up by a sparkly blue dress, and no amount of computer-generated mice, slapstick pumpkins, or good old fashioned Bonham Carter charm can save it. Once again, director Branagh shows that the only thing he does better than Shakespeare is soulless CGI spectacle.\rEveryone is familiar with the Cinderella story, and being that this particular iteration makes no effort to diverge from the tried-true fairy tale anyway, this critic shall not waste any time in summarizing it. To be brief, heroine Ella – Cinderella being a derogatory nickname cooked up by her endlessly irritating stepsisters – is left in the care of her heinous stepmother after both of her parents contract a horrible case of plot device and die. There is a prince, a fairy godmother, a slipper, and a happily ever after. The entirety of the story is narrated incessantly by Helena Bonham Carter’s Fairy Godmother character, and while I do not mind listening to the sound of Ms. Carter’s lovely voice for two hours, this demonstrates the film’s absolute obliviousness to the tenant of “show, don’t tell.”\rTo Branagh’s credit, it must not be easy to craft a sensible film while working off of such a droll script – under the pen of Chris Weitz, esteemed writer of such masterpieces as The Golden Compass and The Nutty Professor II – while simultaneously being wrung through the dread corporate machine that is Disney. Still, the composition of this film displays a surprising level of incompetence. People slide down doors in despair, slippers can be shattered by stepmothers but left unscathed by a tumble down the stairs, and the characters seem to feel the need to babble incessantly about their feelings.\rOur Cinderella is here a blubbering, counter-feministic clod who spends an inordinate amount of time either weeping or pining over her man. Lily James embodies the very image of a breathless, exhaustingly optimistic idiot with her constant empty smiles and flighty gestures. Ella lives her life under her mother’s dying tenant to always “have courage and be kind,” which evidently translates to “be a cheerful and willing servant to your abusive stepfamily.” Thus Ella is enslaved not only by her wicked stepmother, but by her blood mother as well. Ella puts blind loyalty to authority figures over her own happiness and well-being, thus becoming a perfect role-model to young women.\rSpeaking of wicked stepmothers, Cate Blanchett as the evil Lady Tremaine lends a subtlety and nuance to the role that might be compared to that of a bull in a china shop. Of course, how else can the audience tell that the stepmother is bad if she doesn’t follow every act of over-the-top, wanton cruelty with a smirk and a malevolent chuckle?\rThe film’s saving grace comes, unsurprisingly, in the form of Helena Bonham Carter, whose light and incredibly fun portrayal of Ella’s Fairy Godmother makes for a very watchable ten minutes in the middle of the film. Carter fills the screen with her presence and certainly woke this critic out of his near-catatonic state of boredom, even making Weitz’s trite, wooden dialogue feel clever.\rOf course when it comes down to it this was a spectacle movie, and on that end it lived up. The use of CGI animals was obvious and often unnecessary – I’m sure that they still make real deer, Mr. Branagh – and the magic of the movie was unfortunately limited to the Fairy Godmother’s standout scenes in the middle, but the effects were nevertheless detailed and fun to watch. The film was an absolute parade of lovely costumes designed by Sandy Powell, especially the endless supply of bizarre yet beautiful outfits worn by Blanchett. Patrick Doyle’s score was grandiose and seemed to be struggling to carry the emotional weight of the film, as the actors clearly weren't making any effort to do so.\rIn all, this is a largely forgettable flick that trudges on through an uninspired and clichéd retelling of a story that has been told far too many times already. Without any fresh offerings or inspiring role-models, even children are sure to be unimpressed by this obviously mechanical piece of cold corporate cash-in.",
      "review_date": "2015-03-14"
    },
    {
      "review_title": null,
      "content": "Another offering in a recent string of live-action adaptations of Disney classics, Kenneth Branagh's Cinderella manages to (barely) avoid feeling completely devoid of distinction, though it is still marred by a stifling loyalty to it'sAnother offering in a recent string of live-action adaptations of Disney classics, Kenneth Branagh's Cinderella manages to (barely) avoid feeling completely devoid of distinction, though it is still marred by a stifling loyalty to it's hallowed source material.\r Two things save Cinderella from the fate of lifelessness so often met by remakes of revered works: (1) The holistic embrace of an innocent, almost naive method of presentation, an approach that makes the proceedings feel intrinsically, and subversively, pure, and (2) an ensemble cast that lends surprisingly decent performances across the board (Lily James and Cate Blanchett deserve particular distinction).\r There are a few other elements of Cinderella that propel it ever so slightly beyond mediocrity. The dialogue is thankfully not entirely dumbed down for younger audiences, instead the screenplay is a verbose flutter of an almost Shakespearean vernacular (what more could we expect from Branagh?). There is also the production design and costuming, a bright confection of color and pageantry that invades nearly every scene of Cinderella and makes the picture at least visually stimulating.\r However, the aesthetic design ITSELF remains pretty run-of-the-mill. There are no stylistic risks or visual flourishes that deviate enough from the norm to make sitting through Cinderella on mute little more than simply palatable. Cinderella doesn't escape groan inducing familiarity either, with nearly every scene playing out with ENTIRE predictability. Some slight additions to the story only momentarily change the direction of the plot or, worse so, wind up feeling like needless detours transparently existent to avoid a xerox effect.\r There is also the nagging issues of the original story itself. Cinderella has always been, though colorful, resplendent, and respectably un-corruptible, a tale as devoid of legitimately engaging conflict as Disney's works have ever been. Cinderella is a sympathetic lead figure, and the injustice she endures from her step-mother is given new depth in this retelling, yet the tale still paints the evils of cruelty regrettably one-dimensionally, a move that feels hazardously old-fashioned and one Disney as a whole has been prone to make recently (the term I would use is 'risk-less reinvention').\r By no means an experience entirely worth rehashing, Cinderella still surpasses expectations enough to BARELY recommend, and only as a reluctant viewing with the family or a small child. And it goes without saying that the decades old animated entry is the superior version.",
      "review_date": "2015-04-04"
    },
    {
      "review_title": null,
      "content": "Açıkçası masalları sevmem. Sisteme insan yetiştirmek için hiyerarşi ve aristokrasiye saygıyı ve onların yaptıkları her haltı kabullenmemiz gerektiğine dair altta yatan bir çok metni çocukların aklına sokmaya yarayan bir aygıt olarakAçıkçası masalları sevmem. Sisteme insan yetiştirmek için hiyerarşi ve aristokrasiye saygıyı ve onların yaptıkları her haltı kabullenmemiz gerektiğine dair altta yatan bir çok metni çocukların aklına sokmaya yarayan bir aygıt olarak görüyorum. Ancak yönetmeni Kenneth abimiz olunca bakmaktan kendimi alamadım. Masalların senaryo sıkıntısı çeken Hollywood'a yeni bir soluk getirdiği çizgi romanlarla beraber bir gerçek olsa da yapılan çizgi film uyarlamalarını çok sevdiğimi söyleyemem. Bu film ise en azınızdan ailecek seyredilebilir bir yapıda. Abartmadan ( perili bölümü saymazsak ) kaçınmaya çalışmış yönetmen ve senarist. Ancak yine de kendini tekrarlayan ve vasat olmaktan öteye gidememişler. Yine de ortalama bir not vermenin daha uygun olduğuna karar verdim. En azından yönetmenin yüzü hürmetine...",
      "review_date": "2015-06-25"
    },
    {
      "review_title": null,
      "content": "I must have seen the film at least five times in theatre and two times on Blu-ray. I loved this film. This was a breath of fresh air after unremarkable films like Alice In Wonderland, Wizard of Oz and Maleficent (partly). Thank god this wasI must have seen the film at least five times in theatre and two times on Blu-ray. I loved this film. This was a breath of fresh air after unremarkable films like Alice In Wonderland, Wizard of Oz and Maleficent (partly). Thank god this was the best anime to live action transformation from Disney. Plus, Cate Blanchett, Lily James and Helena Bonham Carter were amazing in their roles.",
      "review_date": "2015-09-30"
    },
    {
      "review_title": null,
      "content": "Great cast, great music, good animation through out the movie. Blanchett was amazing as always. I think Blanchette be an amazing Maleficent, They should use her in all Disney movies!!!!!?  Lily James is just fresh, natural , girly and did aGreat cast, great music, good animation through out the movie. Blanchett was amazing as always. I think Blanchette be an amazing Maleficent, They should use her in all Disney movies!!!!!?  Lily James is just fresh, natural , girly and did a great job. Great chemistry between Cinderella and the prince. I enjoyed it very much, and I gave wonder woman and Aquaman a 2 rating!!! It’s a fairytale story, didn’t disappoint.",
      "review_date": "2019-09-25"
    },
    {
      "review_title": null,
      "content": "The story to Cinderella is cheesy and predictable if you've seen the animated Cinderella once again made by Disney. Hardly anything new was added to this Cinderella story.",
      "review_date": "2016-01-08"
    },
    {
      "review_title": null,
      "content": "To me it's mediocre. Lily James doesn't look much like Cinderella, but it's a decent movie. A nice retelling of the original. And I wish the dress & hairstyle were like the original.",
      "review_date": "2016-12-31"
    },
    {
      "review_title": null,
      "content": "I did not particularly like this Cinderella adaption. If you want to make a live action movie of one of the most original stories of all time you better make it excellent. Unfortunately the acting in this movie is forced, the script isI did not particularly like this Cinderella adaption. If you want to make a live action movie of one of the most original stories of all time you better make it excellent. Unfortunately the acting in this movie is forced, the script is somewhat cringe worthy and the cinematography is lacking.",
      "review_date": "2017-11-15"
    },
    {
      "review_title": null,
      "content": "Cinderella contributes a more fleshed out villain to go with this lovely live-action remake that provides gorgeous costumes, beautiful visuals, and splendid performances incorporated in its sweet sense of sentimentality.",
      "review_date": "2020-05-20"
    },
    {
      "review_title": null,
      "content": "Best Cinderella movie ever. Of course i watch newest version from this year 2021 is also great, but this is the best!",
      "review_date": "2021-10-02"
    },
    {
      "review_title": null,
      "content": "Whats most refreshing about this retelling of Disney's Cinderella is just how straight Branagh and co play it. Resisting the temptation to update the story or take a revisionist view of the material we are left with a beautifully crafted,Whats most refreshing about this retelling of Disney's Cinderella is just how straight Branagh and co play it. Resisting the temptation to update the story or take a revisionist view of the material we are left with a beautifully crafted, handsomely mounted fairytale that will delight children new to the story and charm adults raised on the original animated film. Cast to perfection this version should stand the test of time and become a classic in its own right",
      "review_date": "2015-07-16"
    },
    {
      "review_title": null,
      "content": "I can't hate on this movie, it's Cinderell-y! after all. But it could have been much better -- hey, SNL\"s live-action Bambi was better.\rUnfortunately, what should have been the best part -- the clothes! Was the worst. Didn't like Ella's bigI can't hate on this movie, it's Cinderell-y! after all. But it could have been much better -- hey, SNL\"s live-action Bambi was better.\rUnfortunately, what should have been the best part -- the clothes! Was the worst. Didn't like Ella's big debut ballgown which was a real letdown...nor the evil step-sisters dumb costuming, didn't even like the fair god-mum's cheesy wedding-ish look.\rNo matter how many times the movie dialogue tried to tell me the glass slipper was comfortable, I kept wishing they'd gotten manolo blahnik to design this. So clunky and ugly!\rCate Blanchett's evil step-mom started out kind of interesting but soon devolved into a Joan Crawford parody, along with her dreadful 1940s costumes. What was up with that?\rMy two main complaints were: getting hit over the head a zillion times with the moral of the story, be kind and courageous, captain. And, the over the top CGI. The story would have been way more affecting if the palace were a believable castle, out in the countryside, not some ridiculous disney mega-manse.\rI'd have liked it if Branaugh has gone with a grittier, more realistic style.\rThe prince, Derek Jacobi's king and Cinderella were pretty good renditions of these characters. HBC as the fairy god-mum was just OK, kind of meh.\rNo complaints about the basic storyline, no feminist rant here, it was a different time and place and at least Branaugh's Cinderella got to ride a horse.",
      "review_date": "2015-04-04"
    },
    {
      "review_title": null,
      "content": "I don't think Disney could have done a better job at retelling the classic tale of Cinderella. Everything is done brilliantly in keeping to its classic roots and at the same time updating it to a new era. It short and sweet and  guided alongI don't think Disney could have done a better job at retelling the classic tale of Cinderella. Everything is done brilliantly in keeping to its classic roots and at the same time updating it to a new era. It short and sweet and  guided along with a magnificent score.",
      "review_date": "2015-06-18"
    },
    {
      "review_title": null,
      "content": "Cinderella hits all the marks. It has big production, a lively score, and likable characters that make this an enjoyable movie for all ages. It was pretty much exactly as I expected.",
      "review_date": "2015-10-18"
    },
    {
      "review_title": null,
      "content": "You may know the story, but that does not prevent Kenneth Branagh's take on Cinderella from being anything less than a truly magical and wonderful experience. Featuring a lush and beautiful score, phenomenal costume design, breathtaking artYou may know the story, but that does not prevent Kenneth Branagh's take on Cinderella from being anything less than a truly magical and wonderful experience. Featuring a lush and beautiful score, phenomenal costume design, breathtaking art direction, tremendous special effects, and wonderful cinematography, Cinderella is an elegant fairy tale for the whole family. Branagh knows how direct a good adaptation and does so once more with his take on Cinderella. Though it does not diverge from the original story at all, the film is still a compelling take thanks to the fantastic technical aspects and great performances from Lily James, Richard Madden, and Cate Blanchett. Ultimately, you will either like or not like Cinderella. If you do not enjoy the source material, odds are you will not like the live action version either. However, if you are willing to believe in magic, then Cinderella will hopefully fulfill your wishes and deliver that magical experience you crave.",
      "review_date": "2016-01-22"
    },
    {
      "review_title": null,
      "content": "This one did something different, but not enough, original was better, but the best version. I rather watch the original than this one.",
      "review_date": "2018-07-21"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI was interested, but not to excited to watch this. After watching it I loved it. Loved the actress as she really sold herself to be that character.If only shes half as nice in real life she would be great to meet. This version of Cinderella teaches you more details about the story. It also sends great messages to be kind witch this world seriously needs. You can`t even go out for a drive without seeing 5 jack asses on the road. This lived up to the magic in Disney fairy tales.",
      "review_date": "2016-01-17"
    },
    {
      "review_title": null,
      "content": "This is a story we've seen told many times by many different people. While this film overachieves based upon it's concept, it missed an opportunity to make a real play at our nostalgia by being a musical. In my opinion, this is whereThis is a story we've seen told many times by many different people. While this film overachieves based upon it's concept, it missed an opportunity to make a real play at our nostalgia by being a musical. In my opinion, this is where 'Cinderella' misses its shot at greatness despite likable performances from its leads.",
      "review_date": "2015-11-28"
    },
    {
      "review_title": null,
      "content": "Kenneth Branagh's retelling of Cinderella is an old-fashioned treat, with gorgeous visuals and great storytelling more than making up for its tendency to remain safe.",
      "review_date": "2016-08-27"
    },
    {
      "review_title": null,
      "content": "Kenneth Branagh's Cinderella is a dazzling rendition of a classic tale - a retelling which feels both traditional and fresh. It is a down-to-earth and authentic affair, faithful to the original and free of cynicism, and none of the magic isKenneth Branagh's Cinderella is a dazzling rendition of a classic tale - a retelling which feels both traditional and fresh. It is a down-to-earth and authentic affair, faithful to the original and free of cynicism, and none of the magic is lost in the translation from animation to live action. This is a flawless construction, with an outstanding quality of production design and attention to detail. It is also perfectly cast - Lily James, Richard Madden, Helena Bonham Carter and Cate Blanchett suit their roles down to the ground. I was truly and pleasantly surprised by this film.",
      "review_date": "2015-03-28"
    },
    {
      "review_title": null,
      "content": "Very good !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "review_date": "2022-09-08"
    },
    {
      "review_title": null,
      "content": "Thoroughly enjoyed the movie.  Since we all know the story, I didn't expect much, but was pleasantly surprised at how it came out.  The actress who played Cinderella was perfect for the role.  :}",
      "review_date": "2015-03-28"
    },
    {
      "review_title": null,
      "content": "High budget beautiful visuals transport you to a world of colour and magic. Replaces any sense of reality and depth for good ol' disney cheesy fantasy fun times with a dash of pathos. The excellent cast deliver memorable performances. InHigh budget beautiful visuals transport you to a world of colour and magic. Replaces any sense of reality and depth for good ol' disney cheesy fantasy fun times with a dash of pathos. The excellent cast deliver memorable performances. In combination with a moving soundtrack this movie tells its story well. Marred only by pacing issues that affect the flow of story telling at points.",
      "review_date": "2018-01-20"
    },
    {
      "review_title": null,
      "content": "This movie is a live-action Disney movie done correct, though some extra content is added in it still keeps the charm and magic of the original animated classic. The extra origins and background stories helped you get to know the roots ofThis movie is a live-action Disney movie done correct, though some extra content is added in it still keeps the charm and magic of the original animated classic. The extra origins and background stories helped you get to know the roots of characters and how they became who they are, such as the wicked stepmother, the prince, Cinderella's mother and father, and even how Cinderella got her name in the first place. This movie has comedy, outstanding CGI, and interesting reimagined characters. Who knew that Cate Blanchett could bring such a new life to a classical Disney villainess and make her young, hot, comedic, but still cruel. And who knew that the director of Thor can bring to life yet another iconic story character to life in an amazing way. A must see Disney movie for all ages to enjoy.",
      "review_date": "2015-05-25"
    },
    {
      "review_title": null,
      "content": "Initially, I had no interest watching this movie. Because when I watched the trailer, it’s didn’t leave a strong impression on me. But I heard some good reviews about the movie so I decided to see the movie.\r Cinderella is an okay movie forInitially, I had no interest watching this movie. Because when I watched the trailer, it’s didn’t leave a strong impression on me. But I heard some good reviews about the movie so I decided to see the movie.\r Cinderella is an okay movie for me. It’s a movie that I won’t watch again. However, among the live action remakes that Disney is doing right now, Cinderella is Disney’s best live action remake effort so far even though Alice in Wonderland is my favorite over Maleficent and Cinderella. It’s because this remake effort recaptures the happy, light spirit of the original Disney classic of the same name instead of making it dark and a bit gritty than usual for Disney’s taste which is attempted in Alice in Wonderland and Maleficent.\r The plot and the characters in Cinderella are quite one-dimensional which is understandable given its fairy tale status in its source material. That is probably why I couldn’t enjoy the movie more than I want to. However, the humor does not feel forced and it’s a bit light-hearted unlike Alice in Wonderland and Maleficent.\r Despite their characters’ being one dimensional, the cast performances from Lily James and Richard Madden as the titular character and Prince Charming are marvelous to watch. But my favorite cast performer is Cate Blanchett who plays Lady Tremaine. While her character still feels one dimensional, Blanchett elevated her character and became the most interesting character in the movie.\r My favorite part of the movie was the direction from Kenneth Branagh. His direction was also my favorite part of Thor so I want to see him again directing the third Thor movie which I am optimistic that he will given Cinderella’s success. The visuals and the cinematography was stunning and beautiful to watch and that attributes positively to Branagh’s directing.\r Overall, Cinderella is not the movie I would watch again but it gives me a good taste in my mouth with stellar cast performances from Lily James, Richard Madden and Cate Blanchett, excellent directing from Kenneth Branagh and stunning, beautiful visuals and cinematography.",
      "review_date": "2015-04-07"
    },
    {
      "review_title": null,
      "content": "I'll be honest; I love the original CInderella. It's one of my favorite Disney movies, so I was a little apprehensive of seeing a live-action remake after seeing what they did to Maleficent. From someone who loves the original story so much,I'll be honest; I love the original CInderella. It's one of my favorite Disney movies, so I was a little apprehensive of seeing a live-action remake after seeing what they did to Maleficent. From someone who loves the original story so much, they did an excellent job updating it. The new Cinderella is a fresh and witty remake on a classic movie that doesn't try to make any subversive twists or attempt to be some fantasy action flick. The story itself is largely the same, although with a little more emphasis on the stepmother and stepsisters, which makes this movie a very traditional fairy tale while still adding a new layer to the story. There's a lot to like in the new Cinderella, especially if you know and love the original.",
      "review_date": "2015-04-02"
    },
    {
      "review_title": null,
      "content": "4/5★Will Cinderella mark the end of subversive and what might be called the 'Nolanesque' style of movie making? Has Kenneth Branagh exemplified a way to modernize classic tales without trying to make them about gritty and tortured antiheroes4/5★Will Cinderella mark the end of subversive and what might be called the 'Nolanesque' style of movie making? Has Kenneth Branagh exemplified a way to modernize classic tales without trying to make them about gritty and tortured antiheroes in an attempt to modernize them? It worked for Batman but TMNT was a misfire.\rCinderella is a good, if slightly boring film, with an excellent cast and outstanding performances by Cate Blanchett and Lily James. The costumes are beautiful, the prince handsome and the girl charming: Are we witnessing a return of the romance to Hollywood or was Disney just being respectful of the enduring legacy of one Fairytaledom's most beloved characters? Only time will tell.\rVerdict: Watch.",
      "review_date": "2015-06-23"
    },
    {
      "review_title": null,
      "content": "I will be the first to say that I am not a fan of the original 1950s classic. I appreciate it for what is it but I could never get into it and I will also say that this live action adaptation of the classic story improves upon many elementsI will be the first to say that I am not a fan of the original 1950s classic. I appreciate it for what is it but I could never get into it and I will also say that this live action adaptation of the classic story improves upon many elements that the original lacked. The characters are given more development and the title character is given more screentime than the mice. This film looks absolutely beautifully, Cate Blanchett is absolutely great in this movie and stays true to the original source material. This is a really fun movie!",
      "review_date": "2015-04-19"
    },
    {
      "review_title": null,
      "content": "Despite some major changes on the plot (meeting Prince Charming before the party, for instance) and a superficial story, Cinderella is an extremely well made film, with stunning visual effects, costumes and art direction. Performances workDespite some major changes on the plot (meeting Prince Charming before the party, for instance) and a superficial story, Cinderella is an extremely well made film, with stunning visual effects, costumes and art direction. Performances work pretty amazingly, specially Blanchett as the evil Lady Tremaine and the convincing couple played by Madden and James. If you enjoyed Disney's animation 50 years ago you will love this one too. Branagh capted all the magic and love of this classic.",
      "review_date": "2015-03-23"
    },
    {
      "review_title": null,
      "content": "This new version of Cinderella is a very straight retelling of the classic fairytale in line with the Disney animated version.  Disney clearly goes to great lengths in the movie to hammer in their version of things as canonical, particularlyThis new version of Cinderella is a very straight retelling of the classic fairytale in line with the Disney animated version.  Disney clearly goes to great lengths in the movie to hammer in their version of things as canonical, particularly maintaining the colour scenes and costuming to bring the cartoon to life.  One of the best things I can write about this movie is just that it's visually stunning throughout.  It does a wonderful job of bringing the animated magic to live action scenes, and everything about the costumes, sets, backgrounds, all of it are always gorgeous.\r Notable departures from the animated version include Helena Bonham Carter's Fairy Godmother and the depth of the representation of the prince.  Carter's Fairy Godmother is perhaps the only part of the movie that isn't played straight--she's delightfully haphazard about it, as if she isn't quite sure how she's going to pull this thing off.  It ended up being charming and funny to watch, and it was probably my favourite part of the movie, particularly in combination with the fun special effects to show the transformations.  I liked that the transformed animals retained so many of their animal traits as people--it contributed to the feeling that the Fairy Godmother was only just managing to transform them, and provided some nice visual humour.\r The prince's story departed in that you get some back story of his situation at the palace, why he's having the ball to find a princess to marry, and the pressures that he's under.  Robert Madden did a good job of making a living character out of the Prince, who doesn't even get a name in the original animated feature if I recall correctly.  It was nice that Disney attempted to flesh out the story and breathe some romance into the fairy tale.  He had conflicting motives and desires and it was interesting to see that play out.  However, I don't think it ultimately worked, in part because there didn't seem to be a lot of real chemistry between the two lovers.  Lily James' Cinderella was just so unfailingly nice that she didn't seem like a full character in the way that Madden's prince was.  She has moments of despair, but not moments of doubt; without any kind of internal struggle to match the prince's, she just wasn't as interesting.  Cate Blanchett's evil stepmother was also a bit too-dimensional, but Blanchett is just so good at that perfect stepmother smirk that I think I'd forgive her anything.\r That said, the movie did what it set out to do.  It recreated Disney's animated feature in gorgeous live action with magic special effects, a charming cast, and beautiful sets and costumes with a solid, straight retelling of the classic fairytale.",
      "review_date": "2015-03-21"
    },
    {
      "review_title": null,
      "content": "At first, I was not necessarily convinced that a Cinderella live action film would be interesting but Kenneth Branagh at the director's chair & Cate Blanchett as the stepmother made me rethink my position. The project became less of a sillyAt first, I was not necessarily convinced that a Cinderella live action film would be interesting but Kenneth Branagh at the director's chair & Cate Blanchett as the stepmother made me rethink my position. The project became less of a silly little film with these two on board.\r Cinderella was a beautiful film, very tasteful, colorful, touching and classy. It's a very different Cinderella but it had the spirit of the animated film. The stepmother, Cinderella herself, and the prince were different, they had more substance, they multidimensional and that’s mostly true for the stepmother and the prince. They are not filling up space, they were more than just window dressing the Cinderella show. The stepmother made more sense, you could actually understand how she came to be that b*tch in Ella’s life. The prince is no longer a pretty boy whose name no one bothers to mention, he’s a character with hopes and dreams, and sliver of personality to make him interesting. They even played off the fact that a girl confined to the attic, who likes talking to animals is a bit weird - cute weird but weird still -, which made the movie feel real while managing to keep the magic and the wonder intact.\r The ensemble cast really elevated the film, they embodied the characters we came to know and love but portrayed them in quite a unique way. @wornoutspines",
      "review_date": "2015-04-14"
    },
    {
      "review_title": null,
      "content": "Overall Cinderella was an alright movie. Sadly it didn't hit a lot of notes for me. It really didn't feel like Disney to me it felt bland and semi boring compared to the original. But it was far from bad it was really just a forgettableOverall Cinderella was an alright movie. Sadly it didn't hit a lot of notes for me. It really didn't feel like Disney to me it felt bland and semi boring compared to the original. But it was far from bad it was really just a forgettable journey that didn't go out of it's way to be a truly magical movie.",
      "review_date": "2017-03-26"
    },
    {
      "review_title": null,
      "content": "If you seen the original Disney Cinderella or you already know the story pretty much you already seen the 2015 version because this one doesn't do anything different.\r The story to Cinderella is about Ella's mother who dies but Ella'sIf you seen the original Disney Cinderella or you already know the story pretty much you already seen the 2015 version because this one doesn't do anything different.\r The story to Cinderella is about Ella's mother who dies but Ella's father remarries and, in order to please him, she does everything to open herself up to the new family. But when her father dies suddenly, her step-mother and sisters waste no time in turning her into their personal servant, rechristening her \"Cinderella\", as she is always covered in ashes after cleaning. Even with the cruel treatment, she lives by her mothers words to have courage and treat everyone kindly. A chance encounter in the forest will turn her life around - even the meddling of her wicked step-mother cannot stop her destiny.\r Cinderella is a story that's been re-done over and over again, maybe it's because the story is so good that it's timeless and nobody will never get sick of it, or maybe it's just Disney wanting money and this is they way of getting it. I think I was like everyone else where I first heard about another Cinderella movie then the first teaser trailer came out and I wasn't hooked at all. Until I came across the critics reviews of the movie giving such high and positive ratings that give me a second thought and I give in a watched it anywhere and it turned out...okay but nothing great as people are putting out to be.\r Lily James did a great job playing Cinderella and who ever cast her as Cinderella did a top notch casting. People may have not seen her from anywhere but some may remember her from the boring TV show Downtown Abbey, but I first sawed her from the 2012 movie Fast Girls and I know nobody has not heard of that film which is fine because the movie is pretty forgettable. But anywhere she did good in the movie and I can a bright future ahead for her.\r Cate Blanchett as the villain worked in a couple scenes where shes not over the top at times with the cliche laugh that a villain should do, but it's not a cool or a funny laugh it's just a cartoon laugh that took me out of the movie, but let's put that a side and talk about the rest of her performance. Cate Blanchett played the evil stepmother so well that I actually hated her more than the original. She give so much into her character to be the biggest b*tch on the planet and I got to give her a big well done for playing a cold women.\r The production Design and the custom designs are the icing on the cake in this movie, because it looks amazing and beautiful and I know it's early to say but when the 2016 Oscars come around again it should get a nomination for those two because it totally deserves it.\r Now for problems: Have you every got that feeling when you see a movie that you liked it but your never ever seeing it again well that's this movie. I will never watch this movie again, because it has nothing to re-visit.\r The movie doesn't really do anything new or original, no it's the same story and that's why I feel this movie doesn't need to exist and it's kind of pointless and unneeded.\r Cinderella 2015 version is overall a mediocre okay movie.",
      "review_date": "2015-03-23"
    },
    {
      "review_title": null,
      "content": "This isn't the first time that Disney has done a live-action remake of a classic animated film...nor is it the first time we've seen a \"Cinderella\" story adapted to the big screen. As we all know, Tim Burton's 'Alice in Wonderland' (2010) andThis isn't the first time that Disney has done a live-action remake of a classic animated film...nor is it the first time we've seen a \"Cinderella\" story adapted to the big screen. As we all know, Tim Burton's 'Alice in Wonderland' (2010) and 'Maleficent' (2014) were complete misfires as they either didn't stay true to the original, or the execution of their stories were flawed in many aspects.\r There were many reasons for me to dislike this \"Cinderella\" remake, as it feels like a cash-grab (which it still kind of is) and there is no reason for it to made or seen.\r Lily James from 'Downton Abbey' plays the title role and packs more dimension and personality than we've seen before. She makes her character easier to relate to and she is more than just a damsel.\r Cate Blanchett is Tremaine, the evil stepmother, and as expected, she gives a menacing performance.\r Aside from telling you the main story, which you've seen before, nothing has changed...we do get a glimpse of Cinderella's childhood, including seeing her mother (Hayley Atwell) and father (Ben Chaplin) as they raise her. This is exclusive to the movie as it shows what really happened to her mother, and her father gets more than just two lines of dialogue like we've seen in previous adaptations.\r The movie is told like a traditional fairy-tale, we hear Helena Bonham Carter as the Fairy Godmother narrate the story as Cinderella goes through childhood to being a young adult.\r Richard Madden ('Game of Thrones') plays the prince who meets Cinderella before the ball, which is the only thing different to the original adaptations, but doesn't ruin the entire story.\r While 'Cinderella' (2015) may not be the most modern or pro-feminist movie that we've seen in recent years, but the elaborate production design and well-acted cast make this movie a breeze and the fact that Disney didn't rely on some modern twists is refreshing as it doesn't butcher the story.\r On a side note: Walt Disney Animation Studios has also released the short film 'Frozen Fever' which follows Elsa (Idina Menzel) and Kristoff (Jonathan Groff) trying to surprise Anna (Kristen Bell) for her birthday, but things don't go according to plan as Elsa's cold causes chaos.\r The short film relies on slapstick, physical humor and features a new song \"Making today a Perfect Day\" which isn't quite as catchy as previous songs, but if you have children, they will be entertained for a good seven minutes.\r 'Cinderella' (2015) may not be groundbreaking, but it's better than most remakes.",
      "review_date": "2015-07-27"
    },
    {
      "review_title": null,
      "content": "Even though I liked the animation a bit better, I still found this movie very entertaining. It had a lot of great moments and showed  more of Ella's back story. It's a little more complicated than the animation too. The animation was shortEven though I liked the animation a bit better, I still found this movie very entertaining. It had a lot of great moments and showed  more of Ella's back story. It's a little more complicated than the animation too. The animation was short and quick and it had all the moments, but spent only a little time on those moments that it had. This movie spends more time on the moment's that happen and the moments don't really have as much feeling to them as the animation which is a disappointment because since this movie is longer, it needed more feeling. Otherwise, this version of Cinderella delivers on a good note with solid acting and even though this movie had it's flaws, it's entertaining and worth the watch",
      "review_date": "2015-04-23"
    },
    {
      "review_title": null,
      "content": "I thought the movie was very beautiful made and the actors and actresses picked for the movie was top notch. I really appreciated Cate Blanchett was superb in her role as the Stepmother, perfect in playing evil and uncaring.\r The movie hadI thought the movie was very beautiful made and the actors and actresses picked for the movie was top notch. I really appreciated Cate Blanchett was superb in her role as the Stepmother, perfect in playing evil and uncaring.\r The movie had everything the animated movie did but with more emotion and story to every character. loved the movie!",
      "review_date": "2015-03-22"
    },
    {
      "review_title": null,
      "content": "Spectacular update to a Disney classic. Settings are visually stimulating and simple...not overly exaggerated.  This modern version really ties together with the original storyline yet fills in some of the gaps not given in the 1950s classic.Spectacular update to a Disney classic. Settings are visually stimulating and simple...not overly exaggerated.  This modern version really ties together with the original storyline yet fills in some of the gaps not given in the 1950s classic.  Nicely done!",
      "review_date": "2015-03-22"
    },
    {
      "review_title": null,
      "content": "I cannot commend this movie enough. It was a magical delight that even brought a tear to my eye more than once. As a disney lover I was both excited and sceptical on the making of this movie and I had extremely high expectations that it metI cannot commend this movie enough. It was a magical delight that even brought a tear to my eye more than once. As a disney lover I was both excited and sceptical on the making of this movie and I had extremely high expectations that it met utterly! Lily James and Richard Madden are perfect as Cinderella and Prince Kit, their chemistry was unquestionable and they remained true to the characters we have all known and loved for many years! It had all the key moments and elements from the 1950's animated classic and was revamped with some new additions to the story line (Not to drastic or off the original plot), just enough to make it exciting and unpredictable. I loved the addition of Prince Kits background and life and what he though of Cinderella as their romance progressed. Their first meeting was one of my favourite scenes, also the Ball. The costumes and sets were just spectacular, I want that blue ball gown! Helena Bonham Carter as the fairy godmother was also another perfect match made in movie heaven, what a talented and refreshing actress. She blossomed, as did Cate Blanchett as the Step Mother, so much emotion. I loved the silliness of the stepsisters, I think it showed that apart from cruel, they were immature which kept them from being overly aware to their cruelty towards cinderella.\rI can't explain enough, I feel like the right words are not coming to me. I am proud of this movie, I feel like it has been done justice and I feel there is no room for negativity or criticism in such perfection. If you are a real Disney fan, this will be one of your top movies for many years to come I am sure. I cannot wait till its released on DVD so I can watch it over and over.\rIm 23 years old and I absolutely adore disney movies and I have been so fond of the live action remakes. Into the woods I will say I found a little disappointing, and so led me to be a little worried about how this version of Cinderella was going to be played out, and Im so incredibly happy with how they did so. I cannot wait till I have children and they can grow up watching this movie, becoming the classic to them as the 1950's one is to me.\rBeautiful.\rMesmerising.\rMagical.\rEnchanting.\rEmotional.\rBreathtaking.\rHeartwarming.",
      "review_date": "2015-03-29"
    },
    {
      "review_title": null,
      "content": "This is such an amazing fairy tale movie, I felt like I was living the best moment in my life while I was watching it. All the plot and the script was simply perfect, everything happened when it had to happen. The design of the clothes andThis is such an amazing fairy tale movie, I felt like I was living the best moment in my life while I was watching it. All the plot and the script was simply perfect, everything happened when it had to happen. The design of the clothes and the set were all like if you were actually living there with all the characters of the story. The romance of the movie was like the sweetest piece of cheesecake, and there was comedy too. This movie is really one of the best of Disney, they have to be proud of this. My congratulations to the director, the actors and all the whole team involved in this. This is just...\r Magic Disney!",
      "review_date": "2015-04-01"
    },
    {
      "review_title": null,
      "content": "I know this movie has been made several times, but this time it's captivating.The colors are breathtaking. The acting was wonderful. I will buy the dvd when it comes out and will watch it many times.",
      "review_date": "2015-04-17"
    },
    {
      "review_title": null,
      "content": "As a Disney lover i thought for a family movie Cinderella was good not great not compared to Maleficent. But i will say graphics and story was on point.",
      "review_date": "2015-04-18"
    },
    {
      "review_title": null,
      "content": "I saw the animated version as a child so when I heard this one was being made I was so excited! I absolutely love fairytales and Lily James' performance was outstanding.  She brought the spirit of Cinderella to life in a fresh view: HaveI saw the animated version as a child so when I heard this one was being made I was so excited! I absolutely love fairytales and Lily James' performance was outstanding.  She brought the spirit of Cinderella to life in a fresh view: Have courage and be kind.",
      "review_date": "2015-08-05"
    },
    {
      "review_title": null,
      "content": "\"Cinderella\" was a live-action adaptation of the Cinderella, was very good, at first was well moved, then continued intermittent, agile at the same time and the other somewhat slow but most was very agile, performances Were good, the\"Cinderella\" was a live-action adaptation of the Cinderella, was very good, at first was well moved, then continued intermittent, agile at the same time and the other somewhat slow but most was very agile, performances Were good, the costumes, history, special effects, and stage, were incredible, this was the inspiration for Disney to make more live-action films especially, the films of their princesses.",
      "review_date": "2017-04-17"
    },
    {
      "review_title": null,
      "content": "The classic animated movie in live action form. That's what this movie basically is, but with rounded corners. The whole story has more body while it still remains the elegance and magic of the original. Cate Blanchett is outstanding as theThe classic animated movie in live action form. That's what this movie basically is, but with rounded corners. The whole story has more body while it still remains the elegance and magic of the original. Cate Blanchett is outstanding as the stepmother. She shines with venom.",
      "review_date": "2015-09-06"
    },
    {
      "review_title": null,
      "content": "I just watched this movie on Disney Channel and it's so good! A very good adaptation of an iconic Disney film. Also, the actress is super beautiful. The acting and special effects are really good also.",
      "review_date": "2017-03-15"
    },
    {
      "review_title": null,
      "content": "This is my favorite fairytale of all time and I really enjoyed watching it. The whole movie was beautiful.\r Watch it here for free: https://www.primewire.ag/watch-2759959-Cinderella-online-free",
      "review_date": "2015-09-21"
    },
    {
      "review_title": null,
      "content": "My mother studied to be an actress. She noted to me after viewing this movie that according to what she had learned about the theatre, the movie was successful because it's main idea was very easy to get: \"Have courage, and be kind.\" ApartMy mother studied to be an actress. She noted to me after viewing this movie that according to what she had learned about the theatre, the movie was successful because it's main idea was very easy to get: \"Have courage, and be kind.\" Apart from all of the Disney image, which is very pretty, I think I agree with her that the movie seems much more coherent than many I have seen. I hope Mr. Branagh continues to direct movies like this one that are more quiet and relate a main idea that is not aimed at the \"intellectual level of a chimpanzee,\" as my mother would say. How about a movie that addresses the differences between good and bad theatre? Or a movie about a well known historical figure, but made in the style of this movie so that it tells a story and is something the entire family can enjoy and understand.",
      "review_date": "2015-10-03"
    },
    {
      "review_title": null,
      "content": "It was one of the best Cinderella movies with good acting by young actors ....\rone of the most important thing about movie was it's great special effects ...",
      "review_date": "2015-12-29"
    },
    {
      "review_title": null,
      "content": "This new version of Cinderella may not show the same magic as the original, but it has the same familiar spirit, the same pretty and sweet princess that Disney chose for the princess icon of its universe. With an interesting story-telling andThis new version of Cinderella may not show the same magic as the original, but it has the same familiar spirit, the same pretty and sweet princess that Disney chose for the princess icon of its universe. With an interesting story-telling and good interpretations, this film becomes one of the bests of the year.",
      "review_date": "2016-05-22"
    },
    {
      "review_title": null,
      "content": "Cinderella Kenneth Branagh is a great surprise. We expected a similar film to its original, but Branagh's film works as a tribute to the movie 1950. Cate Blanchett is excellent in the role of wicked stepmother and Helena Bonham Carter wasCinderella Kenneth Branagh is a great surprise. We expected a similar film to its original, but Branagh's film works as a tribute to the movie 1950. Cate Blanchett is excellent in the role of wicked stepmother and Helena Bonham Carter was another hit for the Fairy Godmother.",
      "review_date": "2016-04-24"
    },
    {
      "review_title": null,
      "content": "Ever After will always be my favorite rendition of Cinderella but this one was pretty good as well. loved the CGI and it kept my attention regardless of the fact that it's an overdone story.",
      "review_date": "2016-05-15"
    },
    {
      "review_title": null,
      "content": "Good RemakeThis remake of the 1950 classic is satisfying, well written, and a lot of fun.",
      "review_date": "2019-12-16"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is 3rd favorite live-action remake of a Disney movie, one of my top 10 favorite Disney movies of all time, and one of my favorite movies of all time. The costumes were spectacular especially on Lily James, Helena Bonham Carter, Cate Blanchett, Sophie McShera, Holliday Grainger, and Richard Madden. The acting from Cate Blanchett, Lily James, Helena Bonham Carter, Richard Madden, Holliday Grainger, Sophie McShera, and Nonso Anozie was outstanding. The makeup and hairstyling was excellent especially on Helena Bonham Carter, Lily James, Cate Blanchett, Holliday Grainger, and Sophie McShera. The set designs were terrific especially the castle and the house that Cinderella and her family lived in and later Lady Tremaine, Drizella, and Anastasia. Also the musical score was great. A for sure A+ movie to me.",
      "review_date": "2019-08-19"
    },
    {
      "review_title": null,
      "content": "they're all looking at you..Cinderella They had their chance to excel at creating fine details and utilize them well, just as Disney does but this one was a complete swing and a miss. Cinderella, obviously has a good concept and storylinethey're all looking at you..Cinderella They had their chance to excel at creating fine details and utilize them well, just as Disney does but this one was a complete swing and a miss. Cinderella, obviously has a good concept and storyline with enough material to feed the audience for around 100 minutes which was ruined by loose writing and direction on petty and childish things and rely completely on the actor's performance for the character development which shows the lack of responsibility behind the stage. Kenneth Branagh seems distracted as always for he focuses on his younger audience and leaves out witty and complex things that he could have easily approached for. The lead cast is not capable to carry on herself a scene let along the whole movie resulting into weak performances no matter how hard the supporting cast may try, it just wouldn't factor in. Cinderella lacks a better caretaker, smart writing, a good performance and acting skills to make it up to the major league.",
      "review_date": "2018-02-17"
    },
    {
      "review_title": null,
      "content": "This movie has been very poorly understood by the public. Unlike previous films, which seek to rewrite traditional fairy tales or watch them from new perspectives (\"Maleficent\", \"Ever After\", or even the animations \"Brave\" or \"Tangled\"), thisThis movie has been very poorly understood by the public. Unlike previous films, which seek to rewrite traditional fairy tales or watch them from new perspectives (\"Maleficent\", \"Ever After\", or even the animations \"Brave\" or \"Tangled\"), this film is the live-action version of the fairy tale in its more traditional version. Therefore, we know the whole story and very little has been changed or added. Any problem? Not for me. I usually like original versions more than any contemporary re-interpretations, but it seems that fairy tales have gone out of style.One of the criticisms I saw was the Cinderella's passive attitude: the girl was educated under values of kindness and generosity (something our current society no longer knows) and isn't willing to abdicate these principles in adversity. Maybe she think that would betray her mother's memory. For our society, which treats the dead as unknown and the living even worse, such submission and servitude is unacceptable! The oppressed must revolt! Cinderella shouldn't serve the tea, she should take that teapot and stick it in her stepmother's throat! Or should she kick her feet and whine, saying \"I don't do it, I'm sick of it\"? If you are reading this and you're also think that Cinderella should revolt, then you're one more who has totally forgotten what a fairy tale is. A fairy tale is not about reality or what we do. It's about moral values and what we should do. And the moral teaching conveyed by this tale is that biblical passage \"turn the other cheek\", that you must have heard in Sunday School if you have frequented it. Cinderella's tale is entirely about this! She had the courage to silently endure her suffering and to forgive those who hurt her and, in the end, her reward was to fall in love with a prince and change her life. Her stepmother's punishment didn't delay: she ended up punished, but not by the person she most offended. Moral of the story: love your enemy and forgive, you will have the reward, sooner or later.Well, the movie is great and is absolutely true to the original fairy tale, including with regard to costumes and sets, which are beautiful. Unfortunately, CGI is too obvious. I would have preferred realistic sets in proper locations rather than the green screen, which should be used with more caution. I have seen some criticism about the large neckline of Cinderella's dress but, in the historical period in which the tale was set (19th century), the ball dress were usually very low-cut. But don't complain! We see women with even fewer clothes on our streets today and we find it natural! Lily James and Cate Blanchett are the main actresses of the film and it is their work (as stepmother and stepdaughter) that supports the whole plot. Blanchett, unsurprisingly, shone with her usual charm, and the veiled but venomous malice she had bestowed on her character. James is an actress I didn't know but I liked to see, having done her work quite well. It's a young actress, surely this movie isn't going to be the movie of her life, but she left a promise of talent that may come to blossom. Helena Bonham Carter and Stellan Skarsgård also enter the film in supporting roles that their talent makes it seem easy.This movie will easily please all those who want to watch a movie with the original Cinderella story. It's absolutely the same as the book our grandparents used to delight our childhoods. However, if you've gotten tired of it and prefer a modern version of the story this movie is not for you.",
      "review_date": "2018-07-21"
    },
    {
      "review_title": null,
      "content": "Nope! This is not the one we expected. I'm not saying that it's bad. It's so so.",
      "review_date": "2018-06-18"
    },
    {
      "review_title": null,
      "content": "VIOLENCE The stepsisters, not the leading lady, compete/bicker with each other, sometimes in a joking way (not directed to the lead Cinderella, although they do think she’s “mad” and a “half-wit”) to the point where they are threatening toVIOLENCE The stepsisters, not the leading lady, compete/bicker with each other, sometimes in a joking way (not directed to the lead Cinderella, although they do think she’s “mad” and a “half-wit”) to the point where they are threatening to “scratch your eyes out”, push each other into dangerous places, dash brains out. This is as bad as it gets. Cinderella also gets trapped inside a pumpkin that dashes onto a rock (she’s fine), and her carriage almost goes over the edge of a cliff. Her step-family ripping her dress was mean too. A cat chases mice—but it does not dominate or steal from the storyline. All of this peril is in the cartoon version as well, so if they can handle that they can handle this. The stepmother also suddenly breaks an object in a moment of anger. But it’s questionable if any of this justifies a PG rating. SEX/NUDITY Cleavage but only during the ballroom scene which was pretty typical for the time, and the stepsisters at home as they are in their underclothes getting ready for the ball. The prince takes Cinderella into secluded places to be alone with her, not even palace guards can supervise—but you are there the whole time and nothing happens unless you count him putting her shoe back on as sexy; it’s more of would this be safe with how little she knows of him? The stepmother calls a mysterious princess a “vulgar young hussy”, and a stepsister calls Cinderella “Cinderwench”. A little shocking compared to the cartoon but not enough to be PG. LANGUAGE Other than what I just mentioned, I don’t recall any outside the stepsister’s rudeness to each other. CONSUMERISM—Not really other than the typical desire from the step-family (not the lead) to have more things than others, a sort of thing you’d expect if you watched other versions. Cinderella stands out from others in this. EXAMPLE IN THIS REGARD: Cinderella herself is satisfied with the simple things in life and is a great example, but her fairy godmother insists on making her fashionable and will not allow her to “ruin the whole look”. Cinderella says “nobody will be looking at my feet” and even she and the prince exchange looks over the glass slippers like they are kind of over-the-top, but oh well. DRINKING, DRUGS: There is a party and you might assume people are drinking, but it’s brief, you’ll probably notice the gambling more—but it's doubtful your child will take much notice. There’s far more substance use in older G movies. SO WHY IS IT RATED PG? Probably for the use of French and old language—you see this in Jane Austen movies and it works hard to have a historical feel. It’s not for the content, the stepmother isn’t physically abusive or as mentally tormenting as the stepmother in Ever After. Cinderella’s escape probably shocks adults more than kids. I didn’t like the burp by the godmother though.",
      "review_date": "2022-11-10"
    },
    {
      "review_title": null,
      "content": "Lily James is the most disappointing:her performance is so rigid. This retelling lands at the bottom of all the previous ones due to the realism killing the sense of magic the magic this story is usually known for.",
      "review_date": "2022-07-05"
    },
    {
      "review_title": null,
      "content": "Movie review- CinderellaThe story starts with a girl lived with her father stepmother and her stepsisters. She’s hard working in the house. One day everyone went to join the party in the palace but Cinderella can’t go with everyone. She wasMovie review- CinderellaThe story starts with a girl lived with her father stepmother and her stepsisters. She’s hard working in the house. One day everyone went to join the party in the palace but Cinderella can’t go with everyone. She was crying in the kitten, suddenly her old dress turned into a beautiful dress. So she hurries to join the party. Then the prince asks her to dance. When she was dancing slowly with a prince in the palace, immediately time turn to 12 o’clock Cinderella ran to cart very fast and she loses a shoe in the palace. Finally, the prince found the owner of shoes is Cinderella and prince marry Cinderella. It’s a kind of fairy tales story. I’m totally hooked on this story. it’s a happy ending and easy to follow. At the end of this story, a prince married to Cinderella and live with each other forever.",
      "review_date": "2019-04-01"
    },
    {
      "review_title": null,
      "content": "Movie review: Annabelle It’s about the ghost always haunted at her house. They were staying in their house and hiding this story. One day, the group of students and their teacher visited this house. They saw the doll ghost. After that, OnlyMovie review: Annabelle It’s about the ghost always haunted at her house. They were staying in their house and hiding this story. One day, the group of students and their teacher visited this house. They saw the doll ghost. After that, Only one student she wanted to know the room because it is so strangely. When she opened the room, she felt so scare and the door is slam by someone. One more thing, this movie so predictable because the character (the girl who walk in this room) will be run out. Finally, I really like horror movie, It’s a bit scare but it can make me feel good when I messy with something.",
      "review_date": "2019-04-01"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThere was a big celebration in the Royal Palace. The king chose the best wife. She really wanted to enjoy this celebration but she struggled a lot because of her stepmother. She got a nervous but a good fairy helped her to change into new clothes instantly. She walked into the Royal Palace gracefully. Eventually, she can dances with her prince easily and everybody is jealous.",
      "review_date": "2019-03-25"
    },
    {
      "review_title": null,
      "content": "Ella and her parents live a humble but happy life until her mother falls ill. Ella promises to follow her mother's dying wish: to have courage and be kind. Years later, Ella's father marries Lady Tremaine, who has two unpleasant daughters,Ella and her parents live a humble but happy life until her mother falls ill. Ella promises to follow her mother's dying wish: to have courage and be kind. Years later, Ella's father marries Lady Tremaine, who has two unpleasant daughters, Drisella and Anastasia. Ella's father leaves on business, and Lady Tremaine reveals her cruel and jealous nature, pushing Ella to give up her bedroom to the stepsisters and move to the attic. When Ella's father unexpectedly dies, Lady Tremaine dismisses the household staff to save money and forces all their chores on Ella. Seeing Ella's face covered in cinders after sleeping by the fireplace, her step-family mockingly dubs her \"Cinderella\".Distraught, Ella rides off into the woods where she happens to encounter Kit, the crown prince, hunting. He hides that he is a prince and instead introduces himself as a palace apprentice. Ella and Kit take a liking to each other, but they part without him learning her name. The King discovers he has little time left to live, and urges Kit to take a princess as his bride at the upcoming royal ball. Kit persuades his father to also invite every eligible maiden in the kingdom, hoping to see Ella again.On the night of the ball, Ella tries to join her step-family, wearing her mother’s old gown that she has refashioned, but Lady Tremaine and Drisella tear it to shreds and leave without her. Ella runs into the garden in tears and meets an old beggar woman, who reveals herself to be Ella's Fairy Godmother. She magically transforms a pumpkin into a carriage, mice into horses, lizards into footmen, and a goose into the coachman. She then transforms Ella's ripped gown into a beautiful ballgown, complete with a pair of glass slippers. As Ella departs, the Fairy Godmother warns her the spell will end at the last stroke of midnight, and casts a final spell to prevent Ella's stepfamily from recognizing her.At the ball, the entire court is entranced by Ella. She dances with Kit, much to the chagrin of the Grand Duke who has already promised Kit to Princess Chelina of Zaragoza, which Lady Tremaine overhears. Though surprised at Kit's true identity, Ella and the prince bond. Before Ella can tell Kit her name, the clock chimes midnight and she flees the palace, losing one of her slippers. Pursued by the Grand Duke and his men, Ella manages to escape home before the final stroke of midnight; the spell dissipates and everything reverts back to its true form. Ella hides the remaining slipper under her bedroom floorboards.The King dies, but not before giving his son permission to marry Ella. Now King, Kit issues a royal proclamation professing his love for the “mystery princess” and requests she present herself. Ella hurries to retrieve the glass slipper to prove her identity, only to find it with her stepmother. Having deduced that Ella is the mystery princess, Lady Tremaine attempts to blackmail Ella to make her head of the royal household and find respectable husbands for her stepsisters, in exchange for giving Ella's hand in marriage to Kit. Ella refuses, and Lady Tremaine smashes the slipper and locks Ella in the attic. She brings the shattered remains of the slipper to the Grand Duke, who agrees to make her a countess and secure marriages for her daughters in exchange for keeping Ella hidden.The Grand Duke and the Captain of the guards lead the search for the mystery princess by trying the slipper on every woman in the kingdom, but it refuses to fit anyone. At the Tremaine estate, the shoe fits neither stepsister; the company prepares to depart, but hear Ella singing Lavender's Blue. The Grand Duke urges them to leave, but Kit, who has secretly accompanied them, commands the Captain to investigate. The slipper fits Ella, and she and Kit promise to accept one another for who they truly are. As they leave, Ella forgives her stepmother. Soon after, Lady Tremaine, her daughters, and the Grand Duke leave the kingdom, never to return.Ella and Kit marry and become the kingdom's most beloved monarchs, ruling with the same courage and kindness that Ella had promised her mother, and live happily ever after.",
      "review_date": "2020-05-25"
    },
    {
      "review_title": null,
      "content": "Visually it looks stunning and nothing looks out of place and that is half the problem. Any sense of joy or personality has been sucked out of this fairytale.",
      "review_date": "2021-02-01"
    }
  ],
  "num_reviews": 147
}