{
  "title": "Paul Blart: Mall Cop 2",
  "rating": 2.6,
  "release_date": "2015-04-17",
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "summary": "Security guard Paul Blart heads to Las Vegas to attend a Security Guard Expo with his teenage daughter Maya (Raini Rodriguez) before she departs for college. While at the convention, he inadvertently discovers a heist - and it's up to Blart to apprehend the criminals. [Sony Pictures]",
  "critic_reviews": [
    "If anything, Paul Blart: Mall Cop 2 ups that sadness quotient, spending much of its opening proving that just because these movies are stupider than \"Observe And Report\" doesn’t mean they have to be less cripplingly depressing.",
    "It’s not that the film is particularly loathsome, or that Blart is an overweeningly horrible character. What rankles is that he’s barely anything at all; a stereotype of a stereotype; a half-remembered punchline; a stomach with a moustache and wheels. As you watch the film, it’s already forgotten.",
    "To his credit, director Andy Fickman (“The Game Plan,” “Parental Guidance”) keeps the inanity moving apace and there are a few chuckles to be had courtesy of the supporting cast. But, as is so often the case with big, star-driven studio laffers, “Cop 2” needed several more spins in the comedy punch-up machine before cameras rolled.",
    "Paul Blart: Mall Cop 2 does all it was created to do: exist.",
    "Is it never funny? No, it’s not never funny. It’s just not funny nearly often enough.",
    "Sequels are cynical by nature, but this one, with its casino product placement ad and director Andy Fickman apparently checking his text messages instead of trying to punch the limp gags into shape, is purely a paycheck. James may not deserve better, but the kids they’re pitching this to do.",
    "In the past, James at least had likability on his side. He was a big, lumbering oaf, the ideal drinking buddy. But there’s an arrogance to the way he treats people here, particularly a gorgeous hotel employee he’s convinced is in love with him, that renders him strangely unsympathetic.",
    "You won’t find much offensive in Kevin James’s slick, innocuous vehicle Paul Blart: Mall Cop 2. You won’t find much prompting an emotional reaction in general, so familiar are the jokes and situations. If Mr. James’s character thinks of safety first, so does this movie, to its extreme detriment.",
    "Nobody was expecting much from Paul Blart: Mall Cop 2, but did it have to be this unimaginative and lifeless?",
    "Nothing aired by WikiLeaks could possibly be more destructive to Sony’s reputation than the release of Paul Blart: Mall Cop 2, the sort of movie that goes beyond mere mediocrity to offer possible evidence of a civilization in decline.",
    "While the original was no classic, it had a few mild laughs and the plus-sized actor displayed a certain buffoonish charm. Such is not the case with this painfully unfunny, slapdash follow-up in which the title character is so relentlessly obnoxious that you'll be cheering for the villains.",
    "Given that it comes courtesy of Adam Sandler’s production company Happy Madison... it’s no surprise that Paul Blart: Mall Cop 2 is a lazy, witless, laugh-free experience. But even by their standards, this is a slog to sit through, so glacially paced that at times it achieves an almost zen-like level of anti-comedy.",
    "The humor level in the film is so moribund that it doesn’t even inspire groans or eye-rolling; instead, it figuratively puts its hands on your shoulders and pushes you deeper into your theater seat until you’ve been completely subdued by all the nothingness it has to offer.",
    "What’s most dispiriting about this garbage burger is its nonsensical characterization of Blart himself.",
    "James' everyman appeal is stretched to the limits here, like that polyester shirt he wears.",
    "Think of the worst movie you’ve ever seen – a movie that didn’t make you laugh, didn’t make you cry, didn’t move you or change you in any way besides giving you the desperate urge to flee the theater. Think of a movie that was a massive waste of your time and money. Hold that title in your mind. Paul Blart: Mall Cop 2 is worse than that."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I went to the movie theater to cheer up with my favorite funny man Kevin James, this movie only assured the fact that i should kill myself  sooner. Next time i see a Kevin James movie, i am bringing a noose.",
      "review_date": "2015-04-18"
    },
    {
      "review_title": null,
      "content": "Wait, the movie was trying to be serious? I doubt it, this is one of the most critically panned movies ever made, and I don't blame them. This is the definition of godawful.",
      "review_date": "2015-04-17"
    },
    {
      "review_title": null,
      "content": "People appear to have it out for this movie. Either that or the producers of Paul Blart Mall Cop 2 have p***ed someone off so bad they've hired people to astroturf.\r Seriously, this movie is not a 2.3/10 -- if you think it is, you clearlyPeople appear to have it out for this movie. Either that or the producers of Paul Blart Mall Cop 2 have p***ed someone off so bad they've hired people to astroturf.\r Seriously, this movie is not a 2.3/10 -- if you think it is, you clearly haven't seen enough movies to know what a 2.3/10 movie looks like.\r This movie's more like a 5 or 6 out of 10, but I'm giving it a 10/10 to counter-balance all the haters.",
      "review_date": "2015-07-01"
    },
    {
      "review_title": null,
      "content": "Without any doubt one of the dumbest movies i've ever seen. I liked the first part when it came out but i thank God i didn't go to the theaters for this one. I'm not surprised to see the low scores and i hope colubmbia pictures won't makeWithout any doubt one of the dumbest movies i've ever seen. I liked the first part when it came out but i thank God i didn't go to the theaters for this one. I'm not surprised to see the low scores and i hope colubmbia pictures won't make another one.",
      "review_date": "2018-07-20"
    },
    {
      "review_title": null,
      "content": "This is the exact same movie as the first one, except with an even shoddier script, even more generic characters, and even lamer jokes. But hey, at least it's in Vegas!",
      "review_date": "2015-10-15"
    },
    {
      "review_title": null,
      "content": "Paul Blart: Blah plot. Art? Pah! Abort.\r That is the extent of my concise and witty review, but apparently we have to have 150 characters to post a review. Which, incidentally, is more emphasis on character development than Paul Blart has.Paul Blart: Blah plot. Art? Pah! Abort.\r That is the extent of my concise and witty review, but apparently we have to have 150 characters to post a review. Which, incidentally, is more emphasis on character development than Paul Blart has. Bazinga. OK, that should fill up the requirement nicely. Goodbye, Internet people.",
      "review_date": "2015-04-18"
    },
    {
      "review_title": null,
      "content": "No Idea why people love it but this movie is much worst than Grown ups 2 or maybe just like Grown Ups 2.\rthe jokes are forced out and so damn stupid.The trailer looks good I  gave it a chance but I was terribly wrong the movie didn't doNo Idea why people love it but this movie is much worst than Grown ups 2 or maybe just like Grown Ups 2.\rthe jokes are forced out and so damn stupid.The trailer looks good I  gave it a chance but I was terribly wrong the movie didn't do anything much to make me laugh it is a pain to watch it.They try too hard to make the audience laugh but it didn't work but there's some jokes that make me chuckle but nope it still hate this movie.The movie is forgettable and horrifically bad.",
      "review_date": "2015-05-09"
    },
    {
      "review_title": null,
      "content": "Have you ever thrown up in your mouth? Remember when your grandfather soiled his 'depends' and how embarrassed everyone felt for him? Remember when you put down your most beloved pet? Blart 2 is worse than that. Sequels seek to make money,Have you ever thrown up in your mouth? Remember when your grandfather soiled his 'depends' and how embarrassed everyone felt for him? Remember when you put down your most beloved pet? Blart 2 is worse than that. Sequels seek to make money, there's some weird justice when you go to see a sequel...you never get over your first meth high... you're always chasing it. Thinking of going to see Blart 2? Save your money and go on line and google 'Meth addicts before and after'. The after will be you coming out of 2. Just say no.",
      "review_date": "2015-04-20"
    },
    {
      "review_title": null,
      "content": "Kevin James had it coming. Paul Blart: Mall Cop 2 is an abomination of fart jokes, clumsy writing and a cheesy plot. The whole movie is a joke. It was created so that our favourite mall hero, Paul Blart's 'Epic Saga\" could be continued. IKevin James had it coming. Paul Blart: Mall Cop 2 is an abomination of fart jokes, clumsy writing and a cheesy plot. The whole movie is a joke. It was created so that our favourite mall hero, Paul Blart's 'Epic Saga\" could be continued. I enjoyed the first movie, better than that knock off Seth Rogen comedy, Observe and Report. See, Mall Cop 1, was not only funny, but it was more appealing to a wider audience, it was clean, and proved to us that comedies don't need swearing to make their point clear, example: Observe and Report. The sequel just kills my love for Kevin James and Paul Blart. Blart has lost his charm over the years, and boy, it shows, CRYSTAL CLEAR. So yeah, it's terrible, ignore it at all costs, make sure your kids don't force you either. Mall Cop 2 is like a really bad Kevin James movie, add that to a really stinky sock and add a stupid motor scooter to it, equals to a sequel. In about another 6 years, Blart will be back, but this time in a MENTAL WARD. That should have been the location where Director Andy Fickman should have gone when making this movie. Kevin James lost even the 1.2 % of respect I had for him, he is a goddamn president in Pixels! Pixels looks appealing, but it can be ruined, HINT: Adam Sandler and Kevin James together. Overall, this is a piece of horsesh*t, if you didn't figure out already, and yes, it should be panned by critics of how absurdly bad it is. Fu*k you Kevin.",
      "review_date": "2015-04-18"
    },
    {
      "review_title": null,
      "content": "I love Kevin James, but who honestly thought it was a good idea to half-ass a second Mall Cop movie?  The first movie was passable at best.  The premise isn't terrible, it's just the execution of everything from the script to the directing isI love Kevin James, but who honestly thought it was a good idea to half-ass a second Mall Cop movie?  The first movie was passable at best.  The premise isn't terrible, it's just the execution of everything from the script to the directing is so \"blah\".  Kevin James should look for better roles.  Taking jobs like this just to remind people he is still around comes off as more of a black mark on his record than credible experience.",
      "review_date": "2015-04-18"
    },
    {
      "review_title": null,
      "content": "An utter waste of money, time, acting talent and room for better movies. The director, actors, producers and Columbia pictures can only hope that the world forgets about this flop soon",
      "review_date": "2015-04-26"
    },
    {
      "review_title": null,
      "content": "If you want to laugh read the reviews, after watching this  movie I realized I was  robbed  ten bucks for the ticket, robbed over an hour of my life, and of my sanity. I seen the movie yesterday and couldn't write a review until today due toIf you want to laugh read the reviews, after watching this  movie I realized I was  robbed  ten bucks for the ticket, robbed over an hour of my life, and of my sanity. I seen the movie yesterday and couldn't write a review until today due to me being temporarily retarded. I would recommend going to a nursing home visiting Elderly senile people rather than seeing this movie.  it would be much more entertaining and free. I love king of queens, but this dude just can not make a funny movie and I feel bad saying that. If I honestly had to rate it I would rate it a one finger up!!  that would be my middle finger",
      "review_date": "2015-04-28"
    },
    {
      "review_title": null,
      "content": "WHAT THE **** This movie is beyond **** it's a ****ing travesty. Not funny,Kevin James being Kevin James and being too boring. I feel sorry for anyone who had the experience this.\r0/10",
      "review_date": "2015-04-19"
    },
    {
      "review_title": null,
      "content": "Aptly name Paul Fart Mauled Cop, just the ads alone get a big fat zero, too bad he can't get Leah Remini to do one with him. Because by himself and out of his stand up shows, he sucks. That laughter he hears is one gets from people seeing himAptly name Paul Fart Mauled Cop, just the ads alone get a big fat zero, too bad he can't get Leah Remini to do one with him. Because by himself and out of his stand up shows, he sucks. That laughter he hears is one gets from people seeing him naked, the line comedy isn't pretty is right but it doesn't have to be uglier than a snaggled toothed mangy dog.",
      "review_date": "2015-04-19"
    },
    {
      "review_title": null,
      "content": "I really don't need to say anything...this is one of the worst movies ever made! This movie is pure s**t! This is even worse than the first one and that is really hard to do. Poor Kevin James, i you know that you can do a lot better...",
      "review_date": "2015-04-19"
    },
    {
      "review_title": null,
      "content": "They should make ISIS terrorists watch this movie on repeat until they cough up the information. I think that is enough to explain the absolutely abhorrent film this is.",
      "review_date": "2015-04-19"
    },
    {
      "review_title": null,
      "content": "Mario! Link! Samus! Pikachu! All of your favorite Nintendo characters are back, along with plenty of new faces, in the fourth entry in the beloved Super Smash Bros. series. With Super Smash Bros. for Wii U, parties of players can battle eachMario! Link! Samus! Pikachu! All of your favorite Nintendo characters are back, along with plenty of new faces, in the fourth entry in the beloved Super Smash Bros. series. With Super Smash Bros. for Wii U, parties of players can battle each other locally or online across stages inspired by classic Nintendo home console games. With a variety of control options and amiibo compatibility, the timeless Super Smash Bros. battles come alive.\r In a major first for the franchise, a special mode lets eight players fight simultaneously in local multiplayer. This Wii U-only option lets players compete on even larger stages to accommodate all the characters; traditional 4-player stages are included as well as the 8-player levels. This Wii U game offers many new modes and different ways to play that keep players coming back for more, including Smash Tour, Special Smash Mode, Coin Battles, Stamina Matches, Classic Mode, All-Star Mode, and Event Mode. Fans of the Nintendo 3DS game can immediately benefit from the fruits of their smashing labors by importing their custom 3DS fighters, equipment, costumes and hats. Players can also tap in their Amiibo figures, which can gain levels to become stronger and add equipment as they gain experience through battling.",
      "review_date": "2015-05-10"
    },
    {
      "review_title": null,
      "content": "The parts with Paul Blart being fat were the best. If I could give it a 15/10, I would. Better than the first with more finesse and comedic value. True cinematic masterpiece.",
      "review_date": "2015-06-21"
    },
    {
      "review_title": null,
      "content": "Can't say this surprised me.  The first one wasn't very good so why make a sequel, answer it's Happy Madison.  This film is the definition of unneeded.  F",
      "review_date": "2015-07-18"
    },
    {
      "review_title": null,
      "content": "this movie is about as good as having a dog take a dump in your mouth whilst you are sleeping. There is nothing good about this movie. It's not even memorably bad either, it's not even so bad it's good. The movie is just an absolute pile ofthis movie is about as good as having a dog take a dump in your mouth whilst you are sleeping. There is nothing good about this movie. It's not even memorably bad either, it's not even so bad it's good. The movie is just an absolute pile of awfulness.",
      "review_date": "2015-04-22"
    },
    {
      "review_title": null,
      "content": "Like every other sequel. They're bad. The first Paul Blart mall cop was okay. This one is just a mess. Every scene felt like they tried so hard. I respect Kevin James and all I could say that this could be one of the worst movies of 2015.Like every other sequel. They're bad. The first Paul Blart mall cop was okay. This one is just a mess. Every scene felt like they tried so hard. I respect Kevin James and all I could say that this could be one of the worst movies of 2015. Sorry Kevin but you should try next time. Hopefully Pixels the movie would at least be good.",
      "review_date": "2015-04-17"
    },
    {
      "review_title": null,
      "content": "If you barely enjoyed the first film for its wafer-thin plot line, slapstick humour and character development, then you might like to skip the sequel - the wafer just got thinner. However, if you found something chronically and bizarrelyIf you barely enjoyed the first film for its wafer-thin plot line, slapstick humour and character development, then you might like to skip the sequel - the wafer just got thinner. However, if you found something chronically and bizarrely amusing about an overweight man segwaying his way round a shopping mall, with the same jokes played out over and over again, then you might find its worth a look. Sometimes if you crush a joke often and hard enough you get a few diamonds, and whilst I wouldn't want this particular franchise to go on forever, there are moments of genuine absurdity that had our family of four (with children aged 13 and 8) laughing out loud.\rOk, it's not a classic, but neither was the original, and although the bar was set pretty low, we all enjoyed this film more (and obviously far more than the critics!). Sometimes you just have to set all sense of reason, portionality, even humour, to one side, and see what you feel about a film like this - we came out feeling 'good'. Don't ask how or why, just see it and find the answers for yourself.",
      "review_date": "2015-04-18"
    },
    {
      "review_title": null,
      "content": "This was the biggest piece of **** ive seen in my life. After this movie was over I attempted suicide and then beat my wife brutally. Kevin James is fat.",
      "review_date": "2015-04-27"
    },
    {
      "review_title": null,
      "content": "The first half is of a totally depressed Blart, with a few depressing \"jokes\".  The is followed by a bunch of slapstick jokes and what someone thought was funny.  Not!  Don't waist your time.",
      "review_date": "2015-07-05"
    },
    {
      "review_title": null,
      "content": "When the jokes fall flat,  and the gags don't work also when James falls down they aren't funny! that's what you get when you watch Paul Blart: Mall cop. Star/co-writer Kevin James doesn't know how to time a joke or set up one, the jokes areWhen the jokes fall flat,  and the gags don't work also when James falls down they aren't funny! that's what you get when you watch Paul Blart: Mall cop. Star/co-writer Kevin James doesn't know how to time a joke or set up one, the jokes are flat,cheap and stupid. There is no plot! in the first one the action sequences suck  (the worst  i seen).It is hard to feel for  the character when the character is a jerk and poorly written.James tries no matter how hard he tries to make the audience satisfied, picture James in a race no matter how hard he pleases the everyone he fails yo finish the line to please the movie goers. The action sequences suck in this one even more, Sony reopens an unfunny  franchise that producer Adam Sandler's production  gets to ruin with sappy humor. Grade D-",
      "review_date": "2015-04-28"
    },
    {
      "review_title": null,
      "content": "Blart 2 was better than the first; it had more laughs. It was much better than Birdman, so it should win an Oscar.  Either critics don't see the movies, or they don't have a clue to give a fair rating. I look at the audience reviews to see aBlart 2 was better than the first; it had more laughs. It was much better than Birdman, so it should win an Oscar.  Either critics don't see the movies, or they don't have a clue to give a fair rating. I look at the audience reviews to see a movie. Blart 2 is black humor, which I like; I had a lot of laughs, and so did the people in my theater. Screw the professional critics; especially those that gave Birdman any stars. Why don't the people who gave this movie a bad review, go see Birdman; the critics loved it?",
      "review_date": "2015-04-26"
    },
    {
      "review_title": null,
      "content": "This monstrosity basically sums up Kevin Jame's career. If people would just stop paying Kevin James money to keep making movies he would simply go away.",
      "review_date": "2015-05-12"
    },
    {
      "review_title": null,
      "content": "Absolute comedic genius to a ludicrous degree. Criminally underrated masterpiece, which I wish would be able to continue into an ultimate climax in the hopefully inevitable third.\r God speed you magnificent bastard.",
      "review_date": "2015-05-27"
    },
    {
      "review_title": null,
      "content": "This was a lot better than I expected. A 13/100 is definitely too harsh. Kevin James was really good and I'd recommend it if you go for this sort of thing.  Overall a fun movie.",
      "review_date": "2015-09-10"
    },
    {
      "review_title": null,
      "content": "This movie was a big disappointment to me. I really enjoyed the first one, and I thought that I would enjoy this one too, but it was largely unfunny. There were a couple of parts that made me laugh, but they were all in the trailer. InThis movie was a big disappointment to me. I really enjoyed the first one, and I thought that I would enjoy this one too, but it was largely unfunny. There were a couple of parts that made me laugh, but they were all in the trailer. In retrospect, the only funny parts in this were either in the trailer or were recurring gags from the first movie. Six years is just too long for a sequel. As was proven by other recent delayed sequels (Sin City and 300), some movies are just right were they were, and this was one of them.",
      "review_date": "2015-04-18"
    },
    {
      "review_title": null,
      "content": "I liked the part where he was fat and a cop and on a Segway and was a mall cop it was very funny I liked it because it was funny and made me laugh so hard because the jokes were good and it made me cry too at the sad parts. It was good.",
      "review_date": "2015-04-23"
    },
    {
      "review_title": null,
      "content": "This movie is so smelly, it made me feel like i needed to change my pants. I am no baby paul! why you movie make me feel like I Blart my pants?!?! Not cool! u Are a cop!? why you no help me?!? is this ferguson?? No! this is movie theetre! IThis movie is so smelly, it made me feel like i needed to change my pants. I am no baby paul! why you movie make me feel like I Blart my pants?!?! Not cool! u Are a cop!? why you no help me?!? is this ferguson?? No! this is movie theetre! I hat u! blarto mc blart fart ! Makes sense why ur name rime wit fart! and shoping cart! or k mart! K mart sucks! so do u blart!",
      "review_date": "2015-04-23"
    },
    {
      "review_title": null,
      "content": "This is officially the worst movie I've ever seen at the cinema. From the incredibly bad jokes, to the poor and embarassing acting, and the dull and uniteresting storyline, everything in Paul Blart Mall Cop seems like it's been done by a 5This is officially the worst movie I've ever seen at the cinema. From the incredibly bad jokes, to the poor and embarassing acting, and the dull and uniteresting storyline, everything in Paul Blart Mall Cop seems like it's been done by a 5 year old. It's ridiculous that these types of movies are even being done in this day and age. Horrible.",
      "review_date": "2015-05-01"
    },
    {
      "review_title": null,
      "content": "Ok def spam on this review!\rBoth of these  douche bags  have the same content!\ralso they have like no  reviews wtf  is  this?\r\n\r\nApricot123 Apr 24, 2015\r\n10\r\nThe scenes where Paul Blart Mall Cop was on the segway were comedic gold! PaulOk def spam on this review!\rBoth of these  douche bags  have the same content!\ralso they have like no  reviews wtf  is  this?\r Apricot123 Apr 24, 2015\r10\rThe scenes where Paul Blart Mall Cop was on the segway were comedic gold! Paul blart is one of those movies you might have to see twice! invite the family because they will enjoy this light hearted film..\rThe movie was very silly, yet made us and the theatre laugh continuously. The young daughter has the best expressions as her father overcompensates in his mall cop role. The movie won't win any awards, but it is very entertaining. Collapse",
      "review_date": "2015-05-17"
    },
    {
      "review_title": null,
      "content": "This movie is probably the worst comedy ever. All the jokes were flat, and the movie was way too long. Very boring and stupid, and is almost the exact same thing as the original.",
      "review_date": "2015-05-17"
    },
    {
      "review_title": null,
      "content": "The continuation of the first part is horrific.\rThey cook after the same recipe, however, the ingredients are old. The story is even worse like in the predecessor and the rest is not better.\rWhy he only does to himself this mud??",
      "review_date": "2015-05-01"
    },
    {
      "review_title": null,
      "content": "My 9 year old wanted us to see this and I am glad we did.  We laughed through the whole thing.  Action packed and funny.  Better than the first one.  Loved it!.",
      "review_date": "2015-04-18"
    },
    {
      "review_title": null,
      "content": "The movie was very silly, yet made us and the theatre laugh continuously. The young daughter has the best expressions as her father overcompensates in his mall cop role. The movie won't win any awards, but it is very entertaining.",
      "review_date": "2015-04-19"
    },
    {
      "review_title": null,
      "content": "Movie of the dern year, Guiness material here, Kevin James is so dern dank and the acting was suspenseful and the comedy was Well performed! 10/10-frostfyre422",
      "review_date": "2015-06-17"
    },
    {
      "review_title": null,
      "content": "The scenes where Paul Blart Mall Cop was on the segway were comedic gold! Paul blart is one of those movies you might have to see twice! invite the family because they will enjoy this light hearted film..\rThe movie was very silly, yet madeThe scenes where Paul Blart Mall Cop was on the segway were comedic gold! Paul blart is one of those movies you might have to see twice! invite the family because they will enjoy this light hearted film..\rThe movie was very silly, yet made us and the theatre laugh continuously. The young daughter has the best expressions as her father overcompensates in his mall cop role. The movie won't win any awards, but it is very entertaining.",
      "review_date": "2015-04-24"
    },
    {
      "review_title": null,
      "content": "I'd say it before and I'll say it again. Critics love to hate sequels, but people (including myself) don't give a rat's ass what they think. I know every critic love to hate movies produced or starred by Adam Sandler, big deal. Audiences andI'd say it before and I'll say it again. Critics love to hate sequels, but people (including myself) don't give a rat's ass what they think. I know every critic love to hate movies produced or starred by Adam Sandler, big deal. Audiences and kids will certainly love Paul Blart Mall Cop 2 even if you just can't get a laugh bag. If you want to see why try up Cinemascore or something else. I know the jokes were the same as the first, but Kevin James is still my favorite actors that Adam Sandler just created. Stop with the bulls**t and go see this movie.",
      "review_date": "2015-04-17"
    },
    {
      "review_title": null,
      "content": "It seems like just about every unnecessary comedy sequel tries was too hard to get laughs by creating scenarios that are more absurd, louder, and more obnoxious than the previous film. That's not to say obnoxious can't be funny, but \"PaulIt seems like just about every unnecessary comedy sequel tries was too hard to get laughs by creating scenarios that are more absurd, louder, and more obnoxious than the previous film. That's not to say obnoxious can't be funny, but \"Paul Blart: Mall Cop 2\" is the perfect example of why it most often isn't.\r It all seems cheaply made so the larger scale and the settings don't look all that great. The script is simple and not really funny despite the fact that the writer(s) have tried to wring the concept for every joke they can. Where the writing stumbles the most though is with \"Paul Blart\" himself. In the previous film he was a sad sack that was ultimately likable enough to root for. Here you can't do that as he is just obnoxious. Something he is completely oblivious to.\r As far as jokes go it's not a funny movie. Outside of a particularly amusing hallway brawl I never laughed. One or two stupid one-liners got a slight chuckle from me, but overall the movie isn't even amusing. It relies way too much on dumb humor and repeating the same, unfunny \"fat person moves in goofy ways\" joke over and over again. If you are looking for laughs then look elsewhere.\r As a matter of fact no matter what you are looking for you should look elsewhere. \"Mall Cop 2\" might not be the utter abomination so many would like you to believe, but it's still a bad movie. One that's almost completely devoid of laughs and charm. It is strangely watchable in a mindless sort of way, but if you aren't laughing then what's the point? This is a comedy after all.\r I give \"Paul Blart: Mall Cop 2\" a 4.5/10.",
      "review_date": "2015-08-01"
    },
    {
      "review_title": null,
      "content": "Its not THAT bad.  Its like a dumb Adam Sandler comedy, which I always like.  Im not expecting an Oscar performance, just a dumb movie to laugh at, which it does.  Its definitely not a \"good\" movie, but if you like Kevin James or Adam SandlerIts not THAT bad.  Its like a dumb Adam Sandler comedy, which I always like.  Im not expecting an Oscar performance, just a dumb movie to laugh at, which it does.  Its definitely not a \"good\" movie, but if you like Kevin James or Adam Sandler humor (I think Sandler is producer) you WILL like it somewhat.  (Not sure what people were expecting.)",
      "review_date": "2015-08-09"
    },
    {
      "review_title": null,
      "content": "Paul Flarp Mall Blarp is the best commercial ever made. Running for an astounding 94 minutes, Blarp is a riveting feature starring Kevin James as boredom in an advertisement for a vegas hotel. As a bonus, when you spend money on your ticket,Paul Flarp Mall Blarp is the best commercial ever made. Running for an astounding 94 minutes, Blarp is a riveting feature starring Kevin James as boredom in an advertisement for a vegas hotel. As a bonus, when you spend money on your ticket, a part of your soul goes to hell to feed the infernal machine. Everybody wins!",
      "review_date": "2015-04-26"
    },
    {
      "review_title": null,
      "content": "Empty and very hollow sequel that's nothing to its far superior original which in itself was boring and appealed to people of low standards. Devoid of laughs and any since of good taste and film making.",
      "review_date": "2015-05-21"
    },
    {
      "review_title": null,
      "content": "Completely trashes the first. Takes, beats it up, and throws it on the ground to make room for this film trash. Fans of the first will likely enjoy the second, but for the rest It's all to familiar.",
      "review_date": "2015-05-22"
    },
    {
      "review_title": null,
      "content": "I'm not going to lie, I enjoyed the original Paul Blart: Mall Cop, I thought it was fairly funny and I thought this was going to be more of the same. The film is so terribly written, it basically reverses all the things Paul Blart achieved inI'm not going to lie, I enjoyed the original Paul Blart: Mall Cop, I thought it was fairly funny and I thought this was going to be more of the same. The film is so terribly written, it basically reverses all the things Paul Blart achieved in the first film. Kevin James tries so hard to be funny in this movie but it just isn't working here. I can't see how anyone can really like this film which is sad. This is a movie that just did not have to happen and they could've made a better effort, the whole film just seems lazy.",
      "review_date": "2015-06-27"
    },
    {
      "review_title": null,
      "content": "I watched this and would have left, but then I wouldn't have been able to write this. The first movie wasn't that good, but at least it was partially funny, this one had almost no funny moments, and has tons of other issues. The plot isI watched this and would have left, but then I wouldn't have been able to write this. The first movie wasn't that good, but at least it was partially funny, this one had almost no funny moments, and has tons of other issues. The plot is another ripoff of Die Hard, the movie is way too silly, it's downright stupid, and it suffers from sporadic pacing.",
      "review_date": "2015-04-22"
    },
    {
      "review_title": null,
      "content": "Okay so your telling me that Dredd doesn't have a squeal but Paul Blart dose...life can be unfair sometimes.\r The story is about the hero mall cop Paul Blart has been accepted an invitation to the Security Guard Exp in Las Vegas. He takesOkay so your telling me that Dredd doesn't have a squeal but Paul Blart dose...life can be unfair sometimes.\r The story is about the hero mall cop Paul Blart has been accepted an invitation to the Security Guard Exp in Las Vegas. He takes along daughter Maya in order to spend more time with her before she heads to college. But nothing can be easy and when Blart learns about a heist about to go down, he does everything in his power to stop it.\r The first Paul Blart: Mall Cop I thought was pretty terrible and not that funny, I haven't spoke to anyone who liked the first film so why the hell is they a squeal? maybe for money well if that's the case that back fired as this movie failed at the box office so that's money down the f**king drain. Damn you HollyWood for producing movies like this only for money and nothing else just to insult your auditions who went out of they way to pay and see your movie.\r The whole running joke in the movie is fat Kevin James falling over or getting hurt by many different things around him and my god dose this movie repeat it. That is bad and lazy writing right there when your only joke is that. Is that what you could think of seriously?.\r The acting from everyone was bad even Kevin James just did the stick in the mood \"Hey I'm Kevin James\", acting like in every movie he's been in. I know Kevin James is better than this and I actually like the guy in real life and I'm not here wanting him to fail, no I want him to pick roles were he's not just playing Kevin James in his past movies.\r Paul Blart is a mall cop and you think his in the mall all through out the movie, nope most of the movie his far away from the mall and he's in Vegas and he still wears the uniform and drives around in that stupid electric mall cop scooter. This movie sucks in so many ways that it sucks out the sense of humor and the lack of intelligence when it comes to it's characters and storytelling.",
      "review_date": "2015-04-23"
    },
    {
      "review_title": null,
      "content": "I'm genuinely not sure that any amount of marijuana can save this comedic oil spill. An actual mall cop could've produced, and starred in, a significantly better film...Paul Blart has saved the day one too many times",
      "review_date": "2015-05-27"
    },
    {
      "review_title": null,
      "content": "Plart Gart Smart Blart 3: The Awakening was the best movie I've seen since Grown Us 7{good thing master Kevein James is such a great comical Guennis! I laffed until I( started bleeding to death, and went to the hospital! Such fun movie!",
      "review_date": "2015-06-17"
    },
    {
      "review_title": null,
      "content": "I would rate this 12/10 unfortunately I can only rate 10. This fantastic piece of cinematography has changed my outlook on life. I finally left my lonely dark sodden bedroom to become half the man Paul Blart could ever be. I left my wifeI would rate this 12/10 unfortunately I can only rate 10. This fantastic piece of cinematography has changed my outlook on life. I finally left my lonely dark sodden bedroom to become half the man Paul Blart could ever be. I left my wife after assuming she was only in love with me because she wanted a visa. Also I arranged to have my mum killed by a passing Milk Van, because safety never takes a holiday. Always bet on Blart xxx.",
      "review_date": "2015-08-18"
    },
    {
      "review_title": null,
      "content": "I was very impressed by this film, indeed! The movie presented itself as a lighthearted comedy but I saw through that to the milky nougat inside. The relationship between Paul and his wife was very dark and I saw parallels to my own. I willI was very impressed by this film, indeed! The movie presented itself as a lighthearted comedy but I saw through that to the milky nougat inside. The relationship between Paul and his wife was very dark and I saw parallels to my own. I will never forget Paul Blart mall cop 2.\r This may have been Kevin James's best work yet. What a national treasure.",
      "review_date": "2015-10-10"
    },
    {
      "review_title": null,
      "content": "The best anime i have ever watched. Amazing characters, amazing plot, some of the most pant-wetting hilarious jokes i have ever heard. Paul Blart: Mall Cop 2 is by far the best movie ever",
      "review_date": "2016-09-06"
    },
    {
      "review_title": null,
      "content": "One of those movies that is meant to be funny on the basis that the lead actor is overweight. This is the ultimate generic movie, but it is not offensive sans you are not left with mental scarring, so I feel it deserves a few marks.",
      "review_date": "2015-07-21"
    },
    {
      "review_title": null,
      "content": "Nothing more than a lazy attempt to make a movie. Don't know if it was intended to make you laugh or cringe but the film is beyond garbage. At least the Wynn Hotel had a nice advertisement.",
      "review_date": "2015-07-09"
    },
    {
      "review_title": null,
      "content": "Destination Las Vegas!One of the worst week for me as most of the of films I've seen were not up to any good. Okay, fine, the first part was decent. I thought a little refresher, somewhat funny too, so on such scenario, anticipating aDestination Las Vegas!One of the worst week for me as most of the of films I've seen were not up to any good. Okay, fine, the first part was decent. I thought a little refresher, somewhat funny too, so on such scenario, anticipating a sequel is common, but this is not what I wanted. After seeing this, I come to realise that the sequel was a bad idea. Seems funny, but no impact. In fact a little boring to see the same old comedy tricks again. Especially mocking a fat man is too offensive at the present era. So the hashtag on body shaming would go viral on social media.They did not get a decent story. Even the film characters, including the villains were too old fashioned. Even this film had made in the 90s, might have not received well too. The concept of going vacation-come-convention, we had seen this before, are not we! Yeah, Paul after his short marriage and losing mother, he and his daughter heads to Las Vegas. Being watchful father and meeting his old friends, the adventure begins, when some criminal activity is going on behind the conference. His plan to save his daughter, as well as thwart the crime are the remaining focus of the film.I felt for a character like Paul Blart, casting Raini Rodriguez as his daughter was a little too much intentional. Yeah, the film was full of television guys every corner. Its not just direction, or performance failed, it was the writing. This kind of comedies is now considered ancient, that's why Rowan Atkinson stopped doing his routine comedies. But now it's certain that there won't be a third. If you had seen the first and not sure about this, believe me, you won't miss anything. Instead, I would suggest you to re-watch the original. That ain't a masterpiece, though a much better one.3/10",
      "review_date": "2017-10-09"
    },
    {
      "review_title": null,
      "content": "I don't think I have ever given a movie a 0, which to me feels like it would be a black screen with the sound of babies crying.  I would honestly rather watch that for 2 hours than sit through this.  I could only make it half of the wayI don't think I have ever given a movie a 0, which to me feels like it would be a black screen with the sound of babies crying.  I would honestly rather watch that for 2 hours than sit through this.  I could only make it half of the way through the movie.  More than that and I would have risked permanent brain damage.  On a side note just read a lot of the comments, they are much funnier than the actual movie.",
      "review_date": "2016-10-01"
    },
    {
      "review_title": null,
      "content": "\"Oh, he's fat! Hahahahahahahaha! Now he did something dumb and he's overweight so that makes this super hilarious!\"\r I can't even imagine WHY this was seen as a good idea. I mean, the first one was fuсkіng disastrous — no need to make\"Oh, he's fat! Hahahahahahahaha! Now he did something dumb and he's overweight so that makes this super hilarious!\"\r I can't even imagine WHY this was seen as a good idea. I mean, the first one was fuсkіng disastrous — no need to make another film basically revolving around a fat guy doing \"funny\" things. Ugh. I don't want to live on this planet anymore.",
      "review_date": "2015-07-12"
    },
    {
      "review_title": null,
      "content": "I understate that comedies sometimes are dumb but this film exceeds the limit. Was so pathetic and dumb. I lost 1 hour of my life in this movie and i feel so sad cause that time never recover.",
      "review_date": "2015-08-06"
    },
    {
      "review_title": null,
      "content": "The first half is horrible. I almost turned it off. The last thirty minutes or so was pretty funny. I'll give it a point for every 10 minutes of decent movie. Some pretty good gags in the last bit if you can get through the first hour withoutThe first half is horrible. I almost turned it off. The last thirty minutes or so was pretty funny. I'll give it a point for every 10 minutes of decent movie. Some pretty good gags in the last bit if you can get through the first hour without turning it off.",
      "review_date": "2015-08-28"
    },
    {
      "review_title": null,
      "content": "It has been quite a while  since I saw a movie that made me laugh which did not focus on sex or swearing. Sure it is more a kids oriented movie but I really enjoyed some of its silliness.\r Yes, it was nice to just kick back, relax and viewIt has been quite a while  since I saw a movie that made me laugh which did not focus on sex or swearing. Sure it is more a kids oriented movie but I really enjoyed some of its silliness.\r Yes, it was nice to just kick back, relax and view a bit of old type comedy.",
      "review_date": "2015-07-18"
    },
    {
      "review_title": null,
      "content": "Ugh -- what is this? A godawful sequel, that's what that is. I don't know why Sony would do something as cancerous as producing an unnecessary sequel to an unnecessary movie. Perhaps it's because they desperately need money. They think theyUgh -- what is this? A godawful sequel, that's what that is. I don't know why Sony would do something as cancerous as producing an unnecessary sequel to an unnecessary movie. Perhaps it's because they desperately need money. They think they could make a good movie again but after Pixels and Aloha got panned, I'm not sure. But there's no good movie to be found here. No level in this cinematic abomination is redeemable in the least. The script is awful, the jokes come across as forced and random, the characters are something I couldn't care less about, the villain, particularly, is bland and not amusing, the direction is awful, the pacing is awful. Everything is awful in this movie, and I don't think any movie will top this as the worst movie of 2015. Stay away from this, and I mean it.\r Final Score: A generous 0/10.",
      "review_date": "2015-08-24"
    },
    {
      "review_title": null,
      "content": "How is it this character of Paul Blart has become so unlikeable since he first showed his silly face in 2009. This movie is the exact reason why some movies just shouldn't have sequels.",
      "review_date": "2015-11-28"
    },
    {
      "review_title": null,
      "content": "I'm not going to bother making a video review for ‪Paul Blart‬ Mall Cop 2. This movie is terrible. It suffers from the curse of comedy sequels which are being significantly worse than it's procedure. The acting is terrible, it has no flow toI'm not going to bother making a video review for ‪Paul Blart‬ Mall Cop 2. This movie is terrible. It suffers from the curse of comedy sequels which are being significantly worse than it's procedure. The acting is terrible, it has no flow to the story. It has cheap laughs (that admittedly made me laugh a few times) but for the most is unfunny to the bone.",
      "review_date": "2015-11-15"
    },
    {
      "review_title": null,
      "content": "One of the most depressing movies I've ever seen. Seriously, it's just a bunch of awful things happening to Paul Blart and him making an ass out of himself for an hour and a half. Also they try to make you feel bad for him but he's such anOne of the most depressing movies I've ever seen. Seriously, it's just a bunch of awful things happening to Paul Blart and him making an ass out of himself for an hour and a half. Also they try to make you feel bad for him but he's such an idiot it's impossible to care. I've had bowel movements funnier than this movie.",
      "review_date": "2015-07-18"
    },
    {
      "review_title": null,
      "content": "There are good sequels, then there are bad ones. Unfortunately we get another one with Happy Madison Studios making the not-so-likable character Paul Blart in his sequel \"Mall Cop 2\".   Kevin James plays in the title role yet again as one ofThere are good sequels, then there are bad ones. Unfortunately we get another one with Happy Madison Studios making the not-so-likable character Paul Blart in his sequel \"Mall Cop 2\".   Kevin James plays in the title role yet again as one of  New Jersey's well known mall cops this time he is more annoying and obnoxious than ever. I don't think I have sat through a movie looking at a character more annoying than any of the other bad characters I have seen in other bad movies. Actor Kevin James has spoken out about liking this character (for whatever reason) and had the idea of making a sequel.\r The movie begins with Paul Blart, who had just got married and started to have a new life; that is until his wife divorces him after six days of marriage. This is ridiculous as it sounds but it gets more distressing after only five minutes in. Paul's mother goes out for a newspaper, and then is randomly run over by a milk truck. It suddenly goes from sad to dark just minutes apart. After Paul's mother randomly dies. his daughter gets accepted into UCLA, but she does not want to tell her father because she thinks it will hurt his feelings. They then take a trip to Las Vegas, Nevada to go on vacation.\r Then the problems go on from there. There are so many gags and offensive jokes through out the entire movie. For example, the Segway that Paul shows off to two lousy men later in the movie is only there to extend the movie's duration time in order to get to the ninety minute mark. There are countless amount of these scenes in the movie that it makes the film boring instead of reaching its goal to be funny.\r Speaking of which, where is the comedy in this movie? None of the jokes are original and don't make any sense. I waited patiently for ninety minutes waiting for a funny moment to happen, but it never came. There are times where the movie adds in a random scene to make the movie look more ridiculous and redundant. There is one particular scene where Paul Blart attacks an African Crane, this scene tries to make Paul look like a funny guy, but really, he is being a jerk and shows that he is very easy to annoy.\r This isn't Happy Madison Studios' first film to have a sequel worse than its predecessor, Grown Ups 2, Joe Dirt 2 are both examples of bad films that the Studio should listen to the criticism in order to make their film better.\r \"Criticism is a lesson\"- 30 Cents.",
      "review_date": "2015-11-27"
    },
    {
      "review_title": null,
      "content": "This movie really digs below the surface to show the utterly depressing and remarkably unfunny life of titular character Paul Blart. Paul Blart is a mall cop, who is incredibly incompetent at nearly everything he attempts. Kevin James wasThis movie really digs below the surface to show the utterly depressing and remarkably unfunny life of titular character Paul Blart. Paul Blart is a mall cop, who is incredibly incompetent at nearly everything he attempts. Kevin James was perfectly cast as Mr. Blart, showing limited range, but owning the role amazingly. The acting was so natural it was as if Kevin James wasn't acting at all.",
      "review_date": "2015-07-10"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPaula Deen Mall Cook 2 had high expectations from the last installment and many people seemed to love it. The cooking was great to watch and the food looked really tasty. I was really glad to see her recover from her racist past ( ͡° ͜ʖ ͡°). The first movie followed the protagonist Kevin James aka Paul Blart roaming about the mall on his segway. How the thing didn't cripple under his weight who knows. The comedy was meh and im pretty sure no one asked for a sequel. Basically the same s h i t happens. His fat mexican daughter gets gang banged by criminals stealing some s h i t. Then pauly saves the day and gets no promotion or anything. His salary is probably equivalent to an indian man that runs a convenience store that sells mystery meat and c o n doms that more than likely have been tampered with. Its just not fun to watch. Thanks for the pepperoni pizza-yours truly-paula deen",
      "review_date": "2015-07-30"
    },
    {
      "review_title": null,
      "content": "Pault blart mall c u n t 2 has to be the equivalent of watching a fat kid with downsyndromne dress up as a mall cop and run around trying to arrest family members around the house then they all have to clap and celebarate for him so he feelsPault blart mall c u n t 2 has to be the equivalent of watching a fat kid with downsyndromne dress up as a mall cop and run around trying to arrest family members around the house then they all have to clap and celebarate for him so he feels important.  This movies plot is god awful and eveytine i see paul c u n t on the segway i vomit a pool of blood on the floor. The plot is people are trying to rob a hotel of all of there paintings and a mall cop that weighs 298 pounds some how beats trained professionals. Dont see this movie save your money and spare you heart the trouble of watching this movie.",
      "review_date": "2015-07-30"
    },
    {
      "review_title": null,
      "content": "This movie shouldn’t have been made in the first place. It pulled the “Go Set a Watchman” in the Paul Blart universe, completely ruining the heroic goodness of Blart and making him out to be a dickhead. Maybe Paul Blart isn’t on the sameThis movie shouldn’t have been made in the first place. It pulled the “Go Set a Watchman” in the Paul Blart universe, completely ruining the heroic goodness of Blart and making him out to be a dickhead. Maybe Paul Blart isn’t on the same level as Atticus Finch… But, the film ruined Blart regardless.Also, for a stupid crime comedy, the comedy was weak and the plot was surprisingly difficult to follow. I’d go as far as to say there wasn’t much of a plot at all. As for the weak comedy, the only jokes that were funny were few and far between and involved a horse.This movie is generic, dumb, and shouldn’t have been made, just as the second Benchwarmers movie shouldn’t have been made.",
      "review_date": "2020-08-16"
    },
    {
      "review_title": null,
      "content": "A more appropriate title for this movie would be \"Paul Blart: Unfunny Cop 2\" and a more appropriate tagline for this movie would be \"Vegas has a new unfunny high roller who just doesn't get the funniness right.\"",
      "review_date": "2016-01-13"
    },
    {
      "review_title": null,
      "content": "The first movie was fun but it clearly did not need a sequel. Paul is angrier, not as much fun at all and alot of the jokes are overused. The film gets quite tiresome even with an hour and thirty four minute run time. I felt bad for theThe first movie was fun but it clearly did not need a sequel. Paul is angrier, not as much fun at all and alot of the jokes are overused. The film gets quite tiresome even with an hour and thirty four minute run time. I felt bad for the daughter because she seemed to get so hammerd by her way too overprotective father. The movie was horribly and is the perfect example of Hollywood being  lazy and not caring enough to make a good movie",
      "review_date": "2016-03-25"
    },
    {
      "review_title": null,
      "content": "Never before have I loved a guy so much. I'm not gay, but I would be for Kevin James.  His acting in this movie was stunning and every time he speaks I just wanna make sweet roll love to him.  The other actors in the movie feel wooden inNever before have I loved a guy so much. I'm not gay, but I would be for Kevin James.  His acting in this movie was stunning and every time he speaks I just wanna make sweet roll love to him.  The other actors in the movie feel wooden in comparison to his stardom.  This movie truly is the embodiment of our generation as a whole.  The reason that I gave it a 0 out of 10 is because I thought there could have been more gratuitous butt angles.  They really missed Kevin James's true good side, if you know what I mean ;).",
      "review_date": "2016-03-03"
    },
    {
      "review_title": null,
      "content": "Unbelievable, goofy and unoriginally written. Paul Blart: Mall Cop 2 may hardcore young viewers (with some luck, of course) but there's no way this film could have a redemption. At the end, it surprisingly sucks to see it (you'd really ratherUnbelievable, goofy and unoriginally written. Paul Blart: Mall Cop 2 may hardcore young viewers (with some luck, of course) but there's no way this film could have a redemption. At the end, it surprisingly sucks to see it (you'd really rather watch the first one).",
      "review_date": "2016-03-09"
    },
    {
      "review_title": null,
      "content": "The story is bland at points, especially the second time you watch it. The jokes are super funny and they have a lot of them. I see no reason why it didn't get ok reviews. It is for sure not as bad as they say.",
      "review_date": "2017-05-22"
    },
    {
      "review_title": null,
      "content": "GodawfulThis sequel is annoying, braindead, unfunny, and extremely poorly written.",
      "review_date": "2019-12-19"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWant to scream bloody murder? Then the new Halloween is the trick-or-treat frightfest for you. But, first, a leap of faith is required. You have to forget that there are already nine sequels and remakes of John Carpenter’s 1978 original — thankfully, director David Gordon Green and coscreenwriters Danny McBride and Jeff Fradley pretend those lame copies never existed (no loss there). To them, Halloween 2018 is the first sequel ever to Carpenter’s horror classic. It’s been 40 years since babysitter Laurie Strode (Jamie Lee Curtis) got rocked by PTSD when the masked killer Michael Myers rampaged through the leafy streets of her hometown of Haddonfield, Illinois. And in the years since, the Final Girl has turned herself into Bloody Grandma, a rabid survivalist who’s booby-trapped her house and stayed rifle-ready until the day Michael — the essence of pure evil — breaks out of his loonybin and comes for her. That day is here. And, yup, it’s Halloween.Just watching Curtis dig into the role of this former-babysitter-turned-hardcore-avenger will keep you on the edge of your seat. She’s a marvel of ferocity and feeling. Laurie knows that her Michael obsession has lost her custody of her now-adult daughter Karen (Judy Greer), trained in combat since childhood, and caused a rift with her granddaughter Allyson (Andi Matichak). But she’ll live with it if her family can be safe. Playing the naïve Laurie made Curtis a star at 19; now she brings a sense of loss, regret and separation to the role that deepens the character’s humanity without diminishing her resolve. It’s a savage roar of a performance that stays alert to nuance. And it fits in perfectly with Green’s concept of the film as a feminist parable in which three women come together to call #TimesUp on a male predator.In other areas, the filmmaker must fight familiarity in a sometimes losing battle. Though he ups the violence quotient on Carpenter’s film, Green’s R-rated sequel comes after the torture-porn excess of the Saw and Hostel franchises that numbed us to gore. It also lacks the satiric bite of Get Out. This is a film made by Carpenter fans for other Carpenter fans. Green brought on the master, now 70, as advisor and to update his eerie synthesizer score with son Cody Carpenter and Daniel Davies. The credits ape the original’s right down to the serif font, and cinematographer Michael Simmonds indulges in those long, suspenseful tracking shots that take Myers’ point of view. The first actor to play the horror-flick icon, Nick Castle, joins forces with James Jude Courtney, to embody the older but still death-fixated man-in-the-mask. And yes, that William Shatner/Star Trek mask painted white is very much present and accounted for. So what’s new? Not much according to the plot, which more or less follows the same trajectory as the original. The first Halloween‘s Dr. Loomis, played by the late Donald Pleasance, has been replaced by the equally obsessive Dr. Sartain (Haluk Bilginer). The shrink wants to know why Michael kills. For a with-it touch, two Brit podcasters (Rhian Rees and Jefferson Hall) have been added to the equation to retell the homicidal maniac’s story for the uninitiated. They are also around to provide fresh meat before Michael goes into slaughter mode on the babysitter beat.All things end, as they must, with the Strode women taking on Michael in the woods. Halloween started as a slasher movie done with an inventive talent for the game by Carpenter. That Green’s sequel works as well as it does — it’s still a slasher movie — is due only in part to the director and his collaborators’ copycat admiration for Carpenter’s blueprint. Mostly it’s the troubled times we live in that allows this energizing, elemental horror film to touch a raw nerve for #MeToo. We watch a woman call a male monster to account for her own lasting trauma. That’s too real to laugh off as Hollywood make-believe. We’re living it.",
      "review_date": "2018-10-28"
    },
    {
      "review_title": null,
      "content": "Cop 2 retains some of the silliness of its predecessor, but the painfully unfunny jokes and far-fetched plot remain of a forgettable caliber.",
      "review_date": "2022-04-01"
    },
    {
      "review_title": null,
      "content": "This film can be funny at times, but mostly fails to replicate the funny slapstick humor of the first film. This film fails to create a interesting story, and it repeats the plot of the first film in a far more uninteresting way. Overall,This film can be funny at times, but mostly fails to replicate the funny slapstick humor of the first film. This film fails to create a interesting story, and it repeats the plot of the first film in a far more uninteresting way. Overall, this film is not a complete step-down from the first film, but when that film was already very flawed and only saved by its humor, this one falls flat.",
      "review_date": "2021-08-10"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis film is one of, if not the single greatest piece of cinema ever produced. The hard cuts, the beautifully symbolic dialogue, the awesome action, this movie simply has it all. Sure, you might come for the laughs, but you'll stay for the heart. The emotional roller coaster this movie takes you on is one that you'll be thinking about on your deathbed. The key note speech (spoiler) alone rivals anything President George W. Bush ever said. Paul Blart is the real deal. He has a huge heart and a selfless soul, not to mention a decent voice. What's next, saving lives in Africa? There simply is no ceiling for Paul Blart.",
      "review_date": "2021-12-08"
    }
  ],
  "num_reviews": 97
}