{
    "title": "Star Wars: Episode VII - The Force Awakens",
    "rating": 6.7,
    "release_date": "2015-12-18",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi",
        "Fantasy"
    ],
    "summary": "Thirty years after the Battle of Endor, a new threat has risen in the form of the First Order and the villainous Kylo Ren. Meanwhile, Rey, a young scavenger, discovers powers that will change her life -- and possibly save the galaxy.",
    "critic_reviews": [
        "Star Wars: The Force Awakens is some kind of miracle. It works on every imaginable level - as a heartfelt love letter to fans, an irresistible invitation to newbies, a visual marvel and a blockbuster of unparalleled emotional heft and cultural significance.",
        "The Force Awakens barrels back into Lucas' 'lived-in' universe with inextinguishable energy and boundless joie de vivre.",
        "Star Wars: The Force Awakens is not perfect nor could it ever be. But for every niggle...there are 10 things that are exactly right, and it says much that no one will leave disappointed despite going in with hysterical levels of expectation.",
        "Rarely have age and shining youth been juxtaposed more affectingly, but that’s only one of many moments of grace in a movie that mines its resonant mythology while moving its story ever forward.",
        "The Force Awakens reveals surprising connections, begins a few bromances, solves mysteries while digging up others, and sets a strong tone for what comes next in Star Wars lore. Best of all? It’ll make you feel like a kid being introduced to something truly special once again.",
        "The storytelling in The Force Awakens is masterful, in that it seems to be taking its time but is always moving relentlessly forward and coming up with surprises.",
        "Perhaps the greatest triumph of Star Wars: The Force Awakens is that it justifies the enormous hype. Working from a screenplay that he co-wrote with Michael Arndt and Lawrence Kasdan, director J.J. Abrams (“Star Trek”) brings fresh energy to the franchise while adhering to the storytelling values that made it matter in the first place.",
        "From the off, JJ Abrams’s film sets out to shake Star Wars from its slumber, and reconnect the series with its much-pined-for past. That it achieves this both immediately and joyously is perhaps the single greatest relief of the movie-going year.",
        "What a beautiful, thrilling, joyous, surprising and heart-thumping adventure this is.",
        "The rollicking, space-opera spirit of George Lucas’s original trilogy (you can safely forget the second trio of cynical, tricked-up prequels) emanates from every frame of J.J. Abrams' euphoric sequel. It’s also got an infusion of modern-day humor that sometimes steers the movie this close to self-parody—but never sarcastically, nor at the expense of a terrific time.",
        "It must have seemed like a nearly-impossible task when JJ Abrams and his collaborators set out to bring \"Star Wars\" back to life, but they've more than done it. They've made something honest and beautiful and, above all, fun, and I find myself energized by the movie and by the promise it represents.",
        "The Force Awakens is ridiculous and melodramatic and sentimental of course, but exciting and brimming with energy and its own kind of generosity. What a Christmas present.",
        "If the sequels to “The Force Awakens” are as good as this film, that will probably be because they follow the same formula: heavy on the human side, more comedy, less CGI, more fresh faces, and more delightful droids. And, yes, one must pay homage to the Force.",
        "All you really want to know is whether it's good, right? Well, in fact, it is better than it had to be.",
        "What Abrams has done is find and return the ingredient crucial to the original three films in the franchise that was sorely lacking in the second round: fun...There are some laugh-out-loud moments here, but also some touching ones. Happy, sad, exciting, silly — all that is included, along with the original sense of Saturday-morning-serial abandon that made what became known as “A New Hope” so wonderful all those years ago.",
        "Mr. Abrams may be as worshipful as any Star Wars obsessive, but in The Force Awakens he’s made a movie that goes for old-fashioned escapism even as it presents a futuristic vision of a pluralistic world that his audience already lives in. He hasn’t made a film only for true believers; he has made a film for everyone (well, almost).",
        "Abrams and his collaborators have made a movie that feels resoundingly fresh and new by paying tribute to a style and story that is decades old.",
        "The action, from lightsaber duels to X-wing dogfights with TIE Fighters, is explosive and buoyed by John Williams' exultant score. And the movie is also funny as hell. Abrams knows how to build a laugh and fill the emotional spaces between words.",
        "The film ultimately runs up against the limitations of its own nature.... But it’s still an exhilarating ride, filled with archetypal characters with plausible psychologies, melodramatic confrontations fueled by soaring emotions, and performances that can be described as good, period, rather than \"good, for 'Star Wars.'\"",
        "If Hollywood’s going to extend the most famous movie myth of the past 40 years, The Force Awakens seems a worthwhile way to do so.",
        "Abrams understands what George Lucas never quite figured out: that we’re less interested in the science fiction future than we are in revisiting the past. We don’t really want to see what happens next in that galaxy far, far away. We want to recapture what it felt like the first time we arrived, in 1977, with a movie called “Star Wars.” We want to go home. Star Wars: The Force Awakens takes us there.",
        "Star Wars is fun again. Fans whose love for the series was forged with the Original Trilogy will see too much they recognize (and, later, missed) not to love this effort.",
        "The Force Awakens accomplishes its fan base mission, bringing back a modern myth with the torch-passing respect it deserves (plus some crass commercialism it doesn't).",
        "The ending he’s come up with for The Force Awakens feels so perfect it’s hard to imagine it any other way. In an age when we’ve all become binge watchers, we feel as if it’s become our right to immediately roll right into the next episode, the next sequel. And when The Force Awakens ends, it’s bittersweet because you so badly want to head right into the next chapter.",
        "Snazzily directed by J.J. Abrams with vibrant effects and a busy plot that sets the whole franchise in motion all over again, The Force Awakens delivers on expectations with a fun, polished space odyssey that embraces the appeal of the originals.",
        "Like their Star Wars forebears, Boyega’s Finn and Ridley’s Rey are brave, funny, and admirable but also imperfect, uncertain, and sometimes afraid. That is to say, they’re genuine, multisided characters with believable motivations—no small victory in a movie designed with the express purpose of breaking world box-office records.",
        "Robustly entertaining while carrying the weight of impossible audience expectations, Star Wars: The Force Awakens is a fascinating, often satisfying mixture of rollicking mythmaking and fan service.",
        "Abrams had the benefit of learning what didn’t work in Lucas’ prequels, and he’s gone in the opposite direction. He’s also set an interesting course for moving forward with this engaging cast playing new characters making their way through this beloved universe.",
        "Star Wars: The Force Awakens pumps new energy and life into a hallowed franchise in a way that both resurrects old pleasures and points in promising new directions.",
        "You would have to be practicing some pretty dark arts to not smile as you watch the iconic Millennium Falcon take off into battle one more time.",
        "The prequels this ain’t. We can all breathe again.",
        "Star Wars: The Force Awakens is not a great film, but it flirts with that designation far more often than this lapsed fan could have ever expected. If, on a creative level, what’s contained herein is ultimately the planting of seeds that will continue growing two, four, or forty years down the line, I suspect this franchise is in its best-ever state. How fortunate that it also stands alone as a good time at the movies.",
        "The Force Awakens is half reboot, half remake, and all fun.",
        "So what’s the final verdict? A mixed bag. It’s a good start to a new trilogy but hardly the hoped-for masterpiece. It’s a solid space opera spectacle with enough nostalgia to overpower even the most hard-hearted child of the ‘70s and ‘80s but it relies a little too much on recycling old plot elements.",
        "Ridley is the picture’s real find. Her Rey is fearless, forceful, resourceful, and with a hidden side to her personality that slowly manifests itself and will surely be more deeply explored in the sequels.",
        "The Force Awakens strikes all the right chords, emotional and narrative, to feel both familiar and exhilaratingly new. Filled with incident, movement and speed, dusted with light layers of tarnished “used future” grime, it captures the kinetic energy that made the first film, from 1977, such a revelation to filmgoers who marveled at Lucas’s mashup of B movies, Saturday-morning serials, Japanese historical epics and mythic heft.",
        "If Abrams didn't take many chances, he didn't make many mistakes, either. First, Do No Harm became Don't Mess With Success, and it worked. Show Me the Money is sure to follow.",
        "It is good. Not great. But far better than \"not bad.\" Solidly, confidently good.",
        "Abrams makes big decisions and takes chances that command respect, especially in the very safe current tentpole film industry, but he doesn’t always quite sell them as he could. Still, as this new chapter props the franchise back up on sturdy legs, the Force seems to be in capable hands with a fresh forward direction.",
        "Abrams and Kasdan’s respective humor and pathos push the characters beyond some of the more rote and redundant storytelling. So while it’s not always compelling, it’s always fun.",
        "What Abrams has done is strip Star Wars down to its core components, rearranging the stuff people liked about the original trilogy and getting rid of what they hated about the rest.",
        "By temperament, Abrams is more of a Spielbergian than he is a Lucasite. His visual wit may not be, as it is for Spielberg, a near-magical reflex, but nor is Abrams suckered into bombast by technological zeal, as Lucas has been, and the new movie, as an act of pure storytelling, streams by with fluency and zip. To sum up: “Star Wars” was broke, and it did need fixing. And here is the answer.",
        "The movie has already blown away advance-sale records, and when you go (which, of course, you will) I bet you’ll have fun — I did, mostly. But it’s the fun of seeing something fairly successfully redone, with the promise of more of the same to come.",
        "Star Wars: The Force Awakens steers the franchise back to its popcorn origins. It's not a Bible; it's a bantamweight blast. And that's just as it should be: a good movie, nothing more.",
        "Although Star Wars has always been about the past, The Force Awakens is ironically at its best when it looks the future.",
        "The reassuring familiarity of Abrams’ approach has its limitations: Marvelous as it is to catch up with Han Solo, Leia and the rest of the gang, fan service takes priority here over a somewhat thin, derivative story that, despite the presence of two appealing new stars, doesn’t exactly fire the imagination anew.",
        "Still, as a nostalgia trip that knows exactly what die-hard Star Wars fans want and then layers in some memorable new characters, The Force Awakens is exactly what it needs to be: an old-school Saturday afternoon sci-fi matinee writ big.",
        "It exists less as a meaningful extension of its world than as a fan-service deployment device.",
        "What’s missing in The Force Awakens – and this is a major, critical flaw – is a fresh story template, a plot that doesn’t build toward a climax you’ve already seen, played out in practically the exact same way. That’s the kind of failing that a lot of fans will overlook while they bask in the undeniable bliss-out the movie delivers. But in hindsight, as you play the film back in your mind, the huge lack of imagination and freshness become more problematic.",
        "The shamelessness with which Star Wars: The Force Awakens replays the franchise’s greatest hits is startling. To put it another way, it’s a satisfying meal — but it’s $200 million worth of leftovers.",
        "It tells a well-crafted story; the new characters are invigorating; the old characters are reintroduced tidily. But it is also far too enamoured with the power of its own history.",
        "When you’ve been charged with reviving one of the most obsessively beloved franchises in modern movies, is it better to defy expectations or to meet them? With Star Wars: The Force Awakens, J.J. Abrams splits the difference, and the movie suffers—in the end, it’s perfectly adequate, hitting every beat. But why settle for adequacy?",
        "Though a definite improvement on the last three abortive Star Wars prequels directed by series creator George Lucas, The Force Awakens is only at its best in fits and starts, its success dependent on who of its mix of franchise veterans and first-timers is on the screen.",
        "The Force Awakens boils down to a couple of genuine lump-in-the-throat moments, and those are due to nostalgia. The rest? Seen it, done it, been there, and remember it — even though it was “a long time ago.”",
        "You can choose to understand The Force Awakens as an embrace of the mythological tradition, in which the same stories recur over and over with minor variations. Or you can see it as the ultimate retreat into formula.... There are moments when it feels like both of those things, profound and cynical, deeply satisfying and oddly empty."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "The Force Awakens is another way of saying A New Hope. If it had a theme it would be rebirth. Although there is wit, a lot of action, personality, there was less surprises. The movie took place in locations we have all seen before. TheyThe Force Awakens is another way of saying A New Hope. If it had a theme it would be rebirth. Although there is wit, a lot of action, personality, there was less surprises. The movie took place in locations we have all seen before. They revisit a small amount of areas making it feel less like an adventure. It almost feels unnessesary because why retell the first SW like it was broken? They played it too safe. Maybe JJ will have more creative freedom with the next one. He probably wanted to put his own cteative stamp on a project after the new characters were established. I would like to see less characters killed off. I think it's used too much as a lazy filler. I'd rather see people die in old age respectfully.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "JJ Abrams has delivered an absolute blast of a film with The Force Awakens, which is admittedly a film with flaws, but an incredible ride for any Star Wars fan to behold and possibly one of the greatest in the franchise now.\rPRO’S\rFirst offJJ Abrams has delivered an absolute blast of a film with The Force Awakens, which is admittedly a film with flaws, but an incredible ride for any Star Wars fan to behold and possibly one of the greatest in the franchise now.\rPRO’S\rFirst off I must admit I was sceptical about John Boyega from watching the trailers, but I actually found him a highly enjoyable watch, being able to infuse comedy into the film and still hold his own in more serious scenes. But whilst Boyega does a good job, Adam Driver absolutely kills it as Kylo Ren, bringing sheer and unchiselled menace to the screen, absolutely dominating any other actors with his presence and still yet being able to bring a sense of humanity to him. Driver has made possibly one of the best Star Wars villains, but we’ll have to see how he progresses through the next 2 entries.\rThe Nostalgia is also palpable and surprisingly well executed, giving you goose bumps and not bombarding you with every single reference they can think of.\rThe Visual effects and practical effects (yes they actually have sets in this film) are of high quality and really immerse you in this universe, with its new additions and its familiar ones.\rThe set pieces in the film are exceedingly exciting to watch, especially the lightsaber battle at they end. The fighting is certainly grittier and faster paced, but luckily not stepping into the silly speed domain of Yoda/Dooka fights.\rThe overall pace of the film is incredibly executed well, picking up at the exact right moments and slowing for others, and with the film starting off with a kickass scene and still giving us time to get to know the characters quickly.\rThe humour in TFA is actually a very nice addition to the film, actually genuinely bringing laughs at times (one scene with BB-8 bringing out many laughs), although at some times the humour seems a little out of context with the Star Wars universe, but it is still ultimately enjoyable.\rThe surprises the film brings also are actually pretty well done also and work effectively, even when you can kind of see them coming, they’re all done well, despite all the speculation beforehand.\rThe Story also has a very dark tone, similar to Episode 5 which is great, and balances it great between the comedy and lighter moments of the film.\rI also loved the Hierarchy in which the First Order was made, not making Kylo Ren seem fully powerful and being treated the way he probably should be for how volatile he is.\rThe film is actually an incredible set up for future episodes and ends perfectly and conclusively which makes you hyped for the next episode.\rUNSURE’S\rTo be straight up, the story is so close to being the same as the original trilogy’s but there is still enough kind of layers added onto this films that it kind of gets away with it, but to be honest you don’t care too much as the execution of the film is great, but it is noticeable.\rThis is something that I found a lot of people didn’t agree with me, but I thought Daisy Ridley started off a little rusty. Her line deliveries felt very stale and something about her demeanour on screen came across a little annoying. Despite this she does improve through the running time and by the end I found her a likeable character, but I still preferred Finn (Boyega). However, chemistry between the two is good and feels pretty genuine.\rCON’S\rSadly, I found that Oscar Isaac’s Poe Dameron was terribly underused, as he seemed like an awesome character and Isaac put up a good performance as we know he’s a good actor, and so we certainly wish we could see more of him.\rCaptain Phasma who was hyped up quite a bit prior to the release was also horrendously underused, even more so than Poe, and literally only appears at the start and at a rather insignificant part of the film later on, which makes her just feel like a creation made for selling toys.\rLastly, my final complaint (out of a surprising few) is the scene just after Han Solo is introduced again. The scene include these aliens that I can’t remember the name of (Ranthids?) and a bunch of cannon fodder for them that arrive just on time that just seemed forced and added to try have another action sequence in it, and I wasn’t too sure about the design of the alien either.\rOverall, Star Wars: The Force Awakens is a resounding success with a few minor blips that hardly detract from the experience of it. It sets up brilliantly for the new trilogy and showcases an incredible cast of actors with a brilliant amount of action. Star Wars is back, and this one has a high midichl--- naaah just kidding, f**k that, the force is just motherf**king strong in this one.\r8.5/10",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A long time ago in a galaxy far away there was great sci fi movies that went by the name of Star Wars and we have finally returned there.\r This movie was the best possible return for the original great trilogy. Not just playing off ofA long time ago in a galaxy far away there was great sci fi movies that went by the name of Star Wars and we have finally returned there.\r This movie was the best possible return for the original great trilogy. Not just playing off of nostalgic moments(although it did have it's moments) but also adding great new characters that we grow to love and respect just as much as the original cast like Han Solo and Luke. And a villain although certainly not as great as Vader(not at all surprising) but fascinating and unique in his own way he wasn't like Darth Vader and it's a very good thing because no one does what Darth Vader did like Darth Vader.\r Not to mention the superbly filmed action scenes that i just sat and drooled over while watching the epic battles unfold before my eyes.\r There is a few complaints that i do have however they are quite minor but i am going to warn you there are some spoilers ahead and if you have not yet seen the movie i recommend that you do not read the following entry into my review you have been given a good long proper warning so here we go.\r The complaint that i have is that in pretty much every Star Wars movie i do like to see a well done light saber duel a battle between two masters such as Obi Wan and Darth Vader however you didn't really get that in this movie it was really only two i'm going to be honest here rookies going at it and my second complaint was that you didn't get to see Luke Skywalker until the very end of the movie which kind of disappointed me because i really like the character of Luke. Overall though disappointment doesn't take away from the awesome experience that The Force Awakens brought us and it gets a 9/10",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie makes things right.\r Prequels be damned, the Sequel Trilogy is in the hands of a great director, and if the movies after it are similarly good, this might be the best trilogy.\r\n\r\nIt does have its flaws, but the humor is on point,This movie makes things right.\r Prequels be damned, the Sequel Trilogy is in the hands of a great director, and if the movies after it are similarly good, this might be the best trilogy.\r It does have its flaws, but the humor is on point, the mix of action, comedy, drama is very well done, the story is beautifully crafted, and the visuals - fantastic in every sense of the word.\r The movie is amazing for veterans and newcomers alike, but it looks like it's made with veterans in mind.\r Instead of watching Metacritic user reviews of it, just go watch it right now, J.J has done a great job, and i'm happy that the Sequel Trilogy is in good hands.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I want to say this first, whoever gives this movie less than 5 is not being objective in my opinion and is just trolling…\r With that out of the way…\r\n\r\nI won’t call myself a die hard Star Wars fan but did enjoy the previous films, and, mustI want to say this first, whoever gives this movie less than 5 is not being objective in my opinion and is just trolling…\r With that out of the way…\r I won’t call myself a die hard Star Wars fan but did enjoy the previous films, and, must admit that I even enjoyed certain moments in the prequels.\r The Good\rSo off the cuff. I would rate Star Wars The Force Awakens right up there with the Empire strikes back. The acting was great in most instances. I enjoyed Rey, Finn and Poe’s characters. Kylo Ren was my favourite though. Han Solo was also better than what I expected. Great special effects and sound.\r The Bad\rThis didn’t bother me so much but I if I have to single out a problem I would say that this movie borrowed allot of the plot elements of episode 4, but as my art teacher told me “Originality is overrated, if you can improve on something and it works then why not.”\r 9/10",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Having been whistled up in the Star Wars universe myself when I was a child, I did a little pre-screening research on the film. Out of all the trailers and interviews that were done on the movie there was one in particular, an interview doneHaving been whistled up in the Star Wars universe myself when I was a child, I did a little pre-screening research on the film. Out of all the trailers and interviews that were done on the movie there was one in particular, an interview done with director J.J. Abrams, that stuck out to me. Having written the script himself with the help of Lawrence Kasdan, the mastermind behind arguably the best Star Wars film \"The Empire Strikes Back\", Abrams said that the movie was going back to its original roots and the whole film was basically a faithful recreation of the space magic George Lucas had once shown us. After watching the film, I couldn’t agree more or less with his statement. “Star Wars: The Force Awakens” is an embodiment of the original trilogy (the good ones of course) that we all got to love and worship and, furthermore, is a testament to the fact that regardless of the crazy hype and commercialization the old sci-fi space adventure franchise still stands firm through the ages, enough for audiences of all shapes and sizes to thoroughly enjoy and be happy with. Let’s be clear with this; I’m not saying the movie breaks any new ground. Character and plot development is still a bit rushed and shallow, as well as glimpses of the infamous corny dialogue still stick out now and then during the course of the film. But then again, I can’t say this is a terrible film either. The heart-pumping action, the beautiful music, the grandiose scenery, and the endless imagination that lifted Star Wars to legendary heights are all there and flawlessly executed. Overall, \"Star Wars: The Force Awakens\" is a true Star Wars film right down to the bone marrow, with all the pros and cons of its original predecessors. Director J.J. Abrams, like he did with the Mission Impossible and Star Trek series, blows off the dust of an old series and refines it  with a movie good enough for both Star Wars manias and average joes to run for a giddy old-fashioned space ride. Nothing new is discovered, but truly the force is still strong with this one. Enjoy!",
            "review_date": "2015-12-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am not typically a Star Wars fan but this movie was enjoyable. I enjoyed the cameos and found it to be well rounded in content. It made a good movie for someone that isn't very familiar with the franchise, it definitely stands on its own.I am not typically a Star Wars fan but this movie was enjoyable. I enjoyed the cameos and found it to be well rounded in content. It made a good movie for someone that isn't very familiar with the franchise, it definitely stands on its own. It was nice to see a more mixed gender cast for a change, and without apologetics.",
            "review_date": "2016-03-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Star Wars the force awakens is a very well rounded movie. The writing, cinematography and the\rActing make this movie a very recommended watch for all.",
            "review_date": "2016-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Star Wars: The Force Awakens. I finally got to see the film and I am definitely telling you this film is loads better than Age of Ultron and I was extremely happy when I left. I have never seen any Star Wars films and this was my first oneStar Wars: The Force Awakens. I finally got to see the film and I am definitely telling you this film is loads better than Age of Ultron and I was extremely happy when I left. I have never seen any Star Wars films and this was my first one since my friends pulled me to it. I was worried by the negativity but the film really blew me away. The acting was great and the action sequences were cool. I'm not quite sure if the reason I enjoyed it so much was because I saw it in 4XD or something where the chairs move. I did notice some cliches and plot holes, but I didn't really care as long as it was entertaining, I'm fine! This is one of those movies that is fun for the whole family and fun to watch with friends. Also great for a Christmas Movie! Daisy Ridley and John Boyega are amazing in this film!",
            "review_date": "2015-12-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was unsure what to expect from this chapter of the famous and beloved saga.\r There were mixed feelings about Episodes I, II and III obviously. I didn’t mind Episode II and Episode III and I endure Episode I, as it reminds me of theI was unsure what to expect from this chapter of the famous and beloved saga.\r There were mixed feelings about Episodes I, II and III obviously. I didn’t mind Episode II and Episode III and I endure Episode I, as it reminds me of the excitement I felt, as a 13 year old at the time, to be witnessing Star Wars at the cinemas.\r I was concerned that a major company like Disney was in the driver’s seat and it appeared George Lucas having sold the rights - including the lucrative merchandising rights that made him most of his $5.1B - was keen to vacate the space and have a hand off approach to the project. Would it be the same without the Star Wars creator there every step of the way making sure everything fit in with his original vision and previous chapters?\r Essentially would it keep its Star Wars-iness or would it be commercialised and Disney-fied beyond recognition to the horror of millions?\r I’m very pleased to report that J. J. Abrams has delivered in spades.\r It fits seamlessly into the Star Wars universe. However, you do need to take your mind back to the 1983 Return of the Jedi and remind yourself this movie slots in 30 years after that. All the while forgetting Episodes I, II and III.\r Once you’ve made that mind shift you’re able to fully enjoy what unfolds.\r All the original Star Wars characters that appear are 32 years older than they were in Episode VI, so it’s no drastic mental jump to accept it is 30 years since the events of Return of the Jedi.\r There are a new generation of heroes that step up for the Light Side in Rey (Daisy Ridley) and Finn (John Boyega). Like all Star Wars movies Episode VII is based around a small cast of heroes. These two form the core of the movie. And probably will for the rest of the sequels.\r Daisy and John provide strong compelling performances that hold the movie and cast together and work in perfectly with the beloved characters of Princess (General) Leia, Han Solo as well as C-3PO and a few other throwbacks.\r There are many moments that elicit audible responses from the audience. Aspects that connect back to some of the more memorable moments in the first three movies. And these are a nice touch to bed it down in the Star Wars universe.\r The graphics as expected are flawless but there is an awkward kind of aspect to some design elements and the level of computer graphics given the quality of both from Return of the Jedi 32 years ago, but this is obviously not avoidable.\r The relationship between Han and Leia is handed brilliantly and their is great on screen chemistry. There is a sense of a lot of time having passed and a lot having gone under the bridge with these two.\r Harrison Ford makes what I think was an awkward first appearance but given he’s now a much older battle hardened character it doesn’t detract too much. Perhaps it was intended?\r He warms into it and is “Han” in no time.\r Carrie Fisher gives a stellar performance and her first appearance in this movie is well delivered and handled. She’s entirely believable as a General of the Rebels.\r Her scenes with Han probably provide the best moments and this should be welcoming news to old school Star Wars fans.\r No shortage of nostalgic tear jerker moments with these two.\r A lot has happened between Return of the Jedi and The Force Awakens. It doesn’t explain all that has happened between then and now but it goes a long way to starting on the journey. Much like The Phantom Menace’s plot line did for the lead up to A New Hope.\r There’s a new generation of Dark Side villains to become familiar with. Kylo Ren (Adam Driver) is the new Sith apprentice and Driver inhabits the character completely.\r The soundtrack from the lauded composer John Williams is top notch as expected. A lot of Star Wars’ feel has been created by him and his masterpiece scores. He doesn’t let the team down.\r The script is fast paced and full of detail. Almost to the point of being overwhelming, as there is so much to pick up. But this is typical Star Wars and it’s a case of strap in and catch up.\r The script isn’t cliched, kitsch or derivative, which I thought could be a major issue.\r Humour changes over time. It’s hard to maintain a tone when creating movies over such a long time span that are supposed to fit in seamlessly after one and other. Many will want to watch all 7 in order and they all need to feel like they belong.\r The Force Awakens did this brilliantly but with a slightly modern edgy aspect. There are plenty of jokes that die hard fans will get and enjoy.\r There is, rightly so, a romanticism around Star Wars - with many having grown up with this genre creating saga - like no other series in movie history. The bar is set very high and people will run a very critical eye over every detail.\r\n\r\nIn my opinion it reaches the highs we all hoped it would and fits in with the rest of the vast Star Wars universe.\r\n\r\nThe movie of the year. Exceeds its high expectations.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Star Wars the Force Awakens achieves in bringing together the original trilogy's sense of magic while simultaneously integrating a modern take on the biggest science fiction franchise (sorry Star Trek)\r As an individual who has experiencedStar Wars the Force Awakens achieves in bringing together the original trilogy's sense of magic while simultaneously integrating a modern take on the biggest science fiction franchise (sorry Star Trek)\r As an individual who has experienced the Original trilogy and the Prequels at the same time in my childhood, I could only find the good points of the films. As my taste matured, the Original Trilogy stood well above the Prequels so when the first teasers for the Force Awakens were released my anticipation and expectations reached extremely high levels.\r Star Wars the Force Awakens allows JJ Abrams the chance to direct/produce/co-write yet another major science fiction franchise which he completes to a degree. Minor faults in editing and chopping of action sequences can be jarring, however, these minor faults are too few.\rThe film launches at a breakneck speed as the major characters are introduced throughout with Daisey Ridley the standout. The characters of Rey and Finn both combine elements of the Original Trilogy's characters with the Han, Luke and Leia influences clearly seen. This only makes the characters more engaging with the on screen chemistry between Finn and Rey entirely authentic and brillant, completly leaving behind the Chrisstenson and Portman's forced relationship.\rThe film shares many parallels with A New Hope with several plot points and scenes clearly similar to A New Hope, but Abrams instead twists these plot points in a new way while adding subtle nostalgic hints and humor. Clearly the script was the most impressive as the lines of dialogue at no point feel forced while maintaining momentum and adding the Original Trilogy's cast back into the world famous roles. All the performances are strong and was one of the few movies where I couldn't find one member of the cast who felt out of place.\rHarrison Ford's performance is the top of the pile with Han Solo's character showing all the points that made him one of the most iconic characters of all time while Carrie Fisher also figures strongly.\rAdam Driver and the script both combine for the making of a complex villain in Kylo Ren  with Adam Driver giving a performance to the level that Anakin Skywalker deserved in the prequels.\rStar Wars the Force Awakens is not a perfect film,however, too few exist and the Force Awakens delivers beats felt in the Original Trilogy, more specifically a New Hope, but never takes the franchise into a dangerous place such as the Prequels did, which, while making the Force Awakens feel \"safe\" doesn't ever diminish the film.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's been 32 years since the Star Wars film canon last progressed, leading many fans to lose hope for a proper leap forward in the franchise. So, have J.J. Abrams and Co. struck a winner with this daunting attempt at a seventh episode? Yeah.It's been 32 years since the Star Wars film canon last progressed, leading many fans to lose hope for a proper leap forward in the franchise. So, have J.J. Abrams and Co. struck a winner with this daunting attempt at a seventh episode? Yeah. Yeah, they sure have. You'll hoot and holler at the familiar faces spouting trademark quips of yore. You'll smile wide at the fresh, new faces charming up the screen with their infectious enthusiasm. You'll gasp at every new development. You'll gape at every set piece. Your eyes will well up with tears of joy. And then the tears will stream with every melancholy beat that follows after. Basically, whether you're a newbie or just one of the true fans who's been holding out for far too long, \"Star Wars: Episode VII - The Force Awakens\" is the perfect movie to reintroduce you to the magic of cinema's greatest franchise.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie. the chemistry between the old and the characters is great, the special effects and sound was amazing and the story build up is very well done. the movie is made in such a way that a non star wars fan will love it. the onlyGreat movie. the chemistry between the old and the characters is great, the special effects and sound was amazing and the story build up is very well done. the movie is made in such a way that a non star wars fan will love it. the only problem i had with the film was that there was a bit of an over use of humour (which i don't think really takes anything away from the movie). overall : amazing movie, good visuals, amazing cast and acting and great storytelling, its good to know that star wars is finally back and may the force be with you.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "JJ Abrams' vision of Star Wars is essentially a fresh coat of paint on an old car. The Force Awakens is remarkably similar to A New Hope in numerous ways, and while I enjoy both of these movies, The Force Awakens doesn't quite captivate theJJ Abrams' vision of Star Wars is essentially a fresh coat of paint on an old car. The Force Awakens is remarkably similar to A New Hope in numerous ways, and while I enjoy both of these movies, The Force Awakens doesn't quite captivate the same way the very first entry into this franchise does.  What this film DOES do well is flash what lies ahead for us - the technical prowess is incredible here. X-Wings in formation striking beachheads or enemies in space are incredible.  Everything George Lucas did through 6 episodes is suddenly garbage in the wake of the Abrams touch.  The new cast is also solid, even if Kylo Ren's character isn't as well explained as I would have liked.  Certain characters and the background story need some work to transcend all the other excellent franchises being iterated on year after year right now.  Star Wars is no longer alone in the sci-fi world, it's merely a cornerstone and The Force Awakens does only enough to remind us of what Star Wars can be, but doesn't fully deliver in its resurgence.  Regardless, this movie was very enjoyable and should please many fans worldwide.  The BEST news is that Star Wars isn't limited to just episodes 7-9 as there are four other side-plot movies in development as well.  So while the core story of this new Star Wars adventure isn't completely built yet (at least, in this movie), these other movies taking the Marvel universe approach could perhaps fill in some of the blanks and keep satiating our appetites for all things Star Wars.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pretty Much Perfect.\r The film is funny, exciting and thoroughly entertaining. The new cast members are great, particularly John Boyega as Finn, who provides most of the comedy in the film (an interaction with new droid, BB-8 and anotherPretty Much Perfect.\r The film is funny, exciting and thoroughly entertaining. The new cast members are great, particularly John Boyega as Finn, who provides most of the comedy in the film (an interaction with new droid, BB-8 and another with Han Solo being two stand out examples). Daisy Ridley is similarly terrific as Rey, though she takes on a far more serious role.\r The plot hits many of the same major notes as ‘A New Hope’, but remains different enough to feel like a revitalisation, as opposed to a simple re-tread. Original cast members are used effectively but sparingly, giving the new cast room to breathe and start developing their own characters.\r Also, the action scenes are intense, well-directed and spread out just enough that the film never feels exhausting or over-stuffed; an early chase through the wreckage of a Star Destroyer, featuring the Millennium Falcon and a couple of Tie-Fighters, standing out as one of the best in the movie.\r I cannot recommend this film highly enough. If you are a fan of the series, the chances of you being disappointed are slim to nil. Go see it as soon as you can. Then get on the hype train for Episode 8.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As many of the professional critics have written, we can finally write off the prequels and get back to the Star Wars we've known and loved.  The franchise is now in really good hands. The two young actors playing Fin and Ray are absolutelyAs many of the professional critics have written, we can finally write off the prequels and get back to the Star Wars we've known and loved.  The franchise is now in really good hands. The two young actors playing Fin and Ray are absolutely terrific - I was worried that they wouldn't be.  Adam Driver is solid, though not outstanding.  Loved seeing the actors from the first films (withholding the significance of each for obvious reasons).  Having been deluged with so much BB-8 merchandising, etc., I was concerned that \"it\" wouldn't be nearly as likable or endearing as R2, but I was happily flat wrong - love that little robot.  The technology is brilliant - advancing from the 70s and early 80s, but not losing the charm from individual set pieces and objects. Bottom line:  it's very similar to the \"A New Hope\", but it's a very solid launching pad for many more sequels to come. Of course, some scenes dragged, and the lack of originality dings it a bit. Not enough to take away from my whole-hearted recommendation. I'll see it again - not right away - but I can see young people (and many who are new to the series) eating this up.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "J.J. Abrams had an almost impossible task but did very well. While he played it very safe his The Force Awakens is a masterfully done movie and a good start for the rest of the new trilogy. I would rate it the fourth best Star Wars Movie andJ.J. Abrams had an almost impossible task but did very well. While he played it very safe his The Force Awakens is a masterfully done movie and a good start for the rest of the new trilogy. I would rate it the fourth best Star Wars Movie and that's all I hoped for.",
            "review_date": "2016-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As a fan of the original trilogy I was happy VII delivered a meaningful morality play with soulful characters. Storm troopers have personalities! It had sentiment and excitement. I'm thankful for the fearless new plotline. The force andAs a fan of the original trilogy I was happy VII delivered a meaningful morality play with soulful characters. Storm troopers have personalities! It had sentiment and excitement. I'm thankful for the fearless new plotline. The force and franchise will thrive.",
            "review_date": "2015-12-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "All I can say is it's pretty clear that the people that didn't like TFA clearly flocked to metacritic to try to be as anti-hype as possible. Every positive vote review is getting a ton of unhelpful votes, and all the negative ones are gettingAll I can say is it's pretty clear that the people that didn't like TFA clearly flocked to metacritic to try to be as anti-hype as possible. Every positive vote review is getting a ton of unhelpful votes, and all the negative ones are getting unhelpful reviews right off the bat. Kinda silly.\r I liked it. Characters were fun, action was good, visuals were great...I did a full review elsewhere so I don't feel like getting into the pros and cons or even my full review. It's not perfect but it's a hell of a lot better than the prequels.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nFun, visually jawdropping and well acted, Star Wars The Force Awakens is a welcome return for the Star Wars franchsie after the dark times (the special editions and the prequels). This is the best Star Wars movie since 1983 (the year when Return Of The Jedi came out). It mixes the old and the new perfectly.\r¨\rThe new cast (Daisy Ridley, Jon Boyega and Oscar Issac) is great, as well as the old cast (Mark Hamill (even though he does not say a single word in the movie xD), Carrie Fisher and Harrison Ford).\r The effects are fantastic (minus the CGI on the rathtars and Mas Kanata). It mixes CGI effects and practical effects wonderfully.\r It is a fun ride from start to finish with great banter between the characters, realistic looking lightsaber fights (more realistic then the cartoon fights in the prequels), exciting ship to ship battles/chases (The Millenium Falcon chase on Jakku was an edge on your seat level ride :D)\r Kylo Ren was a great villian. He was conflicted, had understandable motvations (he wants to be as powerful as Darth Vader was) and the scene between him and Han Solo was perfect (it is also the scene where Han Solo died, which was heartbreaking ;_;)\r The flaws I had with TFA is as I said before the CGI on the rathtars and Mas Kanata. They didn`t blend in that well and look like something from the prequels (which is not good O_O), the stupidly over the top speech from General Hux on Starkiller Base was so unintentionally funny and Starkiller Base (it was just a third Death Star, but the end battle on it was fun :D)\r Overall, I give Star Wars The Force Awakens a 9/10. I have seen it 3 times now, and I want to see it one more time before it goes out from the theaters and releases on Blu Ray/DVD. I am pleased with what JJ Abrams, Disney and Lucasfilm has done with The Force Awakens and  I am excited for Rouge One this December, Episode 8, Episode 9, and furte sequels and spin-offs.",
            "review_date": "2016-02-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Even if its nowhere near as good as episode 5 and 6 this is still one of the best movies of 2015, totally living up to the hype it justify going to see this on release date, great new comers as well as a lot of nostalgia and a lot of fanEven if its nowhere near as good as episode 5 and 6 this is still one of the best movies of 2015, totally living up to the hype it justify going to see this on release date, great new comers as well as a lot of nostalgia and a lot of fan service, this is a hell lot better than the prequels and its not the piece of **** that some people say it is.",
            "review_date": "2016-02-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Sometimes the best way to decide if you like a film is how good you feel walking out of the cinema; and I had a big grin on my face. The new characters were very engaging, the action sequences thrilling (I particularly enjoyed the sequence onSometimes the best way to decide if you like a film is how good you feel walking out of the cinema; and I had a big grin on my face. The new characters were very engaging, the action sequences thrilling (I particularly enjoyed the sequence on Hans' ship) and many a laugh out loud moment (Chewie and BB8 having particular moments). Some marks taken off for a slightly rushed final sequence and perhaps an overly-similar plot to Episode IV but these were far outweighed by the positives.\rThe most Star Wars-y Star Wars film ever; including the originals.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "How do you write a sequel to America’s most beloved space opera trilogy more than 30 years later?  How do you make a movie which appeals to a multi-generation fan base more massive than the death star, and which has been badly damaged by aHow do you write a sequel to America’s most beloved space opera trilogy more than 30 years later?  How do you make a movie which appeals to a multi-generation fan base more massive than the death star, and which has been badly damaged by a series of misbegotten prequels, and thus needs to make the jump to light speed quickly?   Not an easy task.  You return to the tried and true.  You bring back the original cast, and write a story that recreates and revisits those most memorable moments in those original movies.  The result is something familiar, maybe a little old and faded, but not totally out of date.  So yes, the story is more than a bit of a remake of the original, but who cares!  It’s a re-union tour.  And a transition piece which allows for the introduction of new generation of characters, and in that regard Rey (Daisy Ridley) appears to be a winner.",
            "review_date": "2016-01-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \n“The Force Awakens” was a thrilling, emotional journey all the way through. JJ Abrams did a remarkable job by staying true to the original trilogy's DNA and managed to combine iconic characters with new ones very smoothly. The new story-line fits very well, mixing up classic elements with the new setting/atmosphere. Rey is the highest point of this new Star Wars world and i don't think anyone of us saw that coming (BB-8 was awesome too).\r In my opinion, the lowest point - other than not having Luke say one single word in the entire movie and just getting to see his face for a second on screen – was the main villain. I would have picked a different actor with more character to portray Kylo Ren. The guy started off well, showing potential, but then (even if it was part of the script) he got burned and lacked the appeal and personality to reverse it. General Hux did a better job as a villain with his “military persona”, though. Overall, it was an outstanding 1st chapter and it's too bad we have to wait until 2017 for the next one.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A thrilling throwback to the glory of the original trilogy. The new characters are lovable and the legacy characters are still awesome. Some of the best scenes are between Han and Leia whose chemistry is still there. Overall, I am thrilled toA thrilling throwback to the glory of the original trilogy. The new characters are lovable and the legacy characters are still awesome. Some of the best scenes are between Han and Leia whose chemistry is still there. Overall, I am thrilled to see where this new journey takes us.",
            "review_date": "2015-12-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Star Wars the force awakens reminds me everything I love for Star Wars,this entire movie kinda feels like \"a new hope\".It the same kind of formula.The story this time tells a good story.2 heros in a movie this time,Finn and Rey.They are theStar Wars the force awakens reminds me everything I love for Star Wars,this entire movie kinda feels like \"a new hope\".It the same kind of formula.The story this time tells a good story.2 heros in a movie this time,Finn and Rey.They are the best characters I have ever seen in a Star Wars movie.J J Abrams is really good at making a good character.Kylo Ren is also an amazing character,he is unique in his own way.Not just a Vadar-like villian,He is more like a emotional person.Other people in the first order just feel disappointing.Space battles are too few in this movie,it focus on ground combats and the characters.The lightsaber battles are fantastic,it is like real person fighting with a sword,you can see Kylo Ren,Rey and Finn all very afraid with each other,and when they start to fight against each other,it just the best lightsaber battle I have ever seen.Overall The force awaken is an outstanding movie,but some of the characters don't do much in the movie,like Captain phasma.The whole movie and the ending is very epic.But there are some questions that the movie don't answered,probably going to explain in the next episode,I recommend every star wars fan to watch this movie right away.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An absolute joy from the moment the iconic text crawl emblazons the screen, the energy flows through the entire audience, much like the Force itself would. Without spoiling a single aspect of the film, it gets back to it's original formula,An absolute joy from the moment the iconic text crawl emblazons the screen, the energy flows through the entire audience, much like the Force itself would. Without spoiling a single aspect of the film, it gets back to it's original formula, an adventure, from beginning to end. The score is more subtle than John Williams signature to this franchise, but the good kind of subtle, and gives you a fusion between sounds the beat through every second of Star Wars that we hold dear, blended with song that let's you know you're watching an Abbram's picture. The writing it's amazing, and executed well by our newest additions to the franchise, and our old favourites. The action and visuals astound! Now, it isn't a perfect film, as some of the minor characters haven't been expanded upon in this outing, but you get the sense that this is just the beginning. It's funny, heartwarming, and tear-jerking. This makes up for the most recent entries, of course I'm talking about the prequels. You really get the sense that everyone on-board gave their heart and soul to give us one of the most exciting entries in the Star Wars mythos. I can't wait until Episode VIII arrives.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Easily the second best Star Wars film (behind episode 5) with it's great characters,great story and amazing directing by JJ Abrams, the people who don't like this wonderful film are clearly trying to be special snow flakes. I would say go seeEasily the second best Star Wars film (behind episode 5) with it's great characters,great story and amazing directing by JJ Abrams, the people who don't like this wonderful film are clearly trying to be special snow flakes. I would say go see it but you probably have already.",
            "review_date": "2016-02-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Why does the movie use so much plot elements of the past? It's literally easy money. People just love it because it's star wars but when you begin to think about it , it's so cheap and cliché. There you go star wars fans , in your face",
            "review_date": "2016-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nFinally saw SWTFA this past weekend after all the hype and hyperbole has died down and stayed away from any spoilers. That said, the movie was definitely entertaining. But afterward, I felt something was missing. I hate to use the word pedestrian, but besides the nostalgic feeling seeing the favorite characters (Chewie practically stole every scene he was in, IMO, not to take away from Ford though) return to the big screen, the magic was missing. The action sequences were well staged, the special effects (except for the Rathtars in the hallways) were well done (let's admit, effects artists can create ANYTHING nowadays) and mostly practical. John Boyega and Daisy Ridley (her first film??!!) did very well as our protagonists, while Adam Driver was mixed (seriously, SPOILER......Han and Leia created THAT face?) And that's another problem I have with the series as it continues. It's like the line from Spaceballs...\" I  am your father's brother's nephew's cousin's former roommate.\" In a galaxy not only far away, but assumingly populated by billions of people and creatures, does everyone have to be related?",
            "review_date": "2016-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "(+) The movie looks really good.\r(+) The main villain, and a few other characters are interesting.\r(+) The movie feels like the original ones.\r\n(+) Good action sequences\r\n(-) It shows too much resemblance to the New Hope, it lacks(+) The movie looks really good.\r(+) The main villain, and a few other characters are interesting.\r(+) The movie feels like the original ones.\r(+) Good action sequences\r(-) It shows too much resemblance to the New Hope, it lacks creativity and courage.\r(-) Most of the main characters are boring, unreal, or just being a copy from the original series.",
            "review_date": "2016-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "$2 billion dollars box office and rising. I have just watched the movie this week. It is a Disney movie. Escapist, fast moving fun with family friendly characters. I can only assume the people who gave this movie 0/10 are racist, sexist or$2 billion dollars box office and rising. I have just watched the movie this week. It is a Disney movie. Escapist, fast moving fun with family friendly characters. I can only assume the people who gave this movie 0/10 are racist, sexist or have part of the their brain missing. I have already watched the movie three times. Love it.",
            "review_date": "2016-02-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Star Wars: Episode VII - The Force Awakens is one of my favourite films of 2015 and this is why; For the first time since RotJ I've watched a Star Wars film that actually feels like a Star Wars film. Right from the opening shot of a StarStar Wars: Episode VII - The Force Awakens is one of my favourite films of 2015 and this is why; For the first time since RotJ I've watched a Star Wars film that actually feels like a Star Wars film. Right from the opening shot of a Star Destroyer casting a shadow across the planet Jakku, you immediately see how much care and attention has been put into this film. It could've been so easy for JJ Abrams to fill this film to the brim with CGI, but what we have here is a film with a healthy balance of CGI and practical effects (more in favour of practical) just like episodes IV to VI. I've seen some people score 0/10 and this film is nowhere near that. I can understand why some people may not like it, but I can't help but feel The Force Awakens is being hit with the super negative reviews because of how big and hyped this movie was and that it's now \"cool\" to rage on Episode VII. People have also been commenting on how the film is too much like A New Hope, but just remember that pretty much all three trilogies follow a similar path, the same way in which the first 3 Indiana Jones films do (and when they did change the formula, we got \"The Kingdom of the Crystal Skull\"....) The film isn't without it's floors, but then again no film is. Overall, this is a very enjoying film and a great Star Wars film.",
            "review_date": "2016-01-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's a great movie, far better than expected. It has its shortcomings - namely being to faithful to its source material and not really delivering something new - but the great pictures and a decent cast ultimately make the movie a satisfyingIt's a great movie, far better than expected. It has its shortcomings - namely being to faithful to its source material and not really delivering something new - but the great pictures and a decent cast ultimately make the movie a satisfying and worthwhile experience.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "J.J just successfully did what the creator himself couldn't do with the prequels. Star Wars has returned to its roots where humor, action and beloved characters are all combined in a flawless way.\r *Spoiler free review* ’Star Wars The ForceJ.J just successfully did what the creator himself couldn't do with the prequels. Star Wars has returned to its roots where humor, action and beloved characters are all combined in a flawless way.\r *Spoiler free review* ’Star Wars The Force Awakens' is a wonderful journey of, once again; good and evil. It’s definitely the most character-driven movie of the franchise to this date, and it really is a good one. We see similar faces and a bunch of new ones. Rey, Finn & Han are the major players and they all have a spectacular chemistry and surprisingly much humor. We experience wonderful development of both old as new individuals, and the acting performance of this diversity-friendly flick is five-star worthy! One character’s fate is a big event in this film. Some of you might find it like a smart move meanwhile others just find it like a bad one. I think it gave the film a brand new future. But it’s still a bad choice by the writers from a story-perspective. Can the franchise really continue after this event? The moment could also have been much more powerfully presented.\r Rey is probably going to be the new favorite of this trilogy. She’s smart, funny, independent and just fantastic. We see her develop in a wonderful way, but there are two moments in this film where her character might have been too rushed into development. But this might be further explained in episode 8 & 9, were they probably will establish more background to her character. Kylo Ren is another big individual in this space-epic. As the main protagonist does he somewhat hold up as the new Darth Vader. Sure, he's not as menacing nor as awesome but he's without any doubt one of the best villains in the whole franchise (and the most complex).\r But there are a few minor aspects with that make him look a bit flawed. He got a very special behavior and I do find it very unique to see a villain like him act like this. But there could have been much more understanding to why he act like he does. He sometimes come of as an immature and childish villain, and I miss a better background why he act in this peculiar way. The second time I saw this film though, made me look at Rey's and Kylo's flaws in a much less critical way. There're hints throughout the film that might give an inside to why they are as they are. J.J and his mystery box; I should have known it wouldn't be simple enough to notice everything in the first viewing.\r The movie starts in a very high-paced way and it continues to be exactly that throughout the whole flick. I especially love the first act; it's the most character-driven, action packed and intense part of the movie. There, characters are quickly introduced and the feel throughout the movie is very \"SW-ish, it really is a return to the old days. But 'The Force Awakens' might use too much of the old ingredients and less of new ones. There are very many similar aspects from the original trilogy, perhaps too many. The lack of originality of the plot in the 2nd and 3rd act made the film a bit meh, I wanted more to happen since there weren't that many original nor mind-blowing scenes. It's kinda the same with the action; very similar to the old days and too remake-ish. The second screening did however boost the action-feel, even though there could have been more originality and power to the action.\r Those were pretty much my biggest complains about this film. The plot is very remake-ish yes, but I still enjoyed it and it never drags along! It's great to, after have seen the film three times, still have several questions that remains unanswered. There are tons of aspects that could have been better yes; like that the music had too little drama, power and thrills or that there wasn't enough space or that too many scenes were shown in the trailers. Yes, the film got flaws. But ohh boy it's good. It's been thirty years since RoTJ and we still, after seen the film, got questions. Everything basic with the film is excellent - flawless dialogs with humor, minimum exposition are presented in a very discrete way, splendid & unique J.J-cinematography and one of the most emotional endings in the franchise (but a bit too convenient).\r Everything that George Lucas failed to deliver in the prequels are top-notch in this film! Star Wars has finally returned, and it really uses a lot of its passed self to build this new foundation on. Sure it’s no 'Empire Strikes Back', but it didn't need to be. It’s one of the best in the series, but not as inventive! J.J Abrams gave the franchise new energy, but perhaps too much to please the fans and forgot the regular moviegoers. It's a character driven fan flick, and it got better after every time I saw it (3 times). There're lots of teases throughout the film that really did diminish the flaws that are mentioned above, and it took time to notice them.\rStar Wars is finally back!\r Personal rating (1st viewing): 85/100, 3rd viewing: 90/100\rCritical rating (1st viewing): 81/100, 3rd viewing: 86/100",
            "review_date": "2016-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "WOW! The Force Awakens was everything I hoped it would be, and more. A perfect mix of old and new, playing on nostalgia whilst introducing elements that will take the franchise onto new heights. Disney have proved themselves to be worthyWOW! The Force Awakens was everything I hoped it would be, and more. A perfect mix of old and new, playing on nostalgia whilst introducing elements that will take the franchise onto new heights. Disney have proved themselves to be worthy custodians of this precious franchise. Episode VIII can't come quickly enough.",
            "review_date": "2016-01-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Like many Star Wars fans, I've waited so long for a worthy sequel to Return Of The Jedi. We all thought that the prequels released between 1999-2005 would fill that void, but as we all learnt, those films are better off where they belong,Like many Star Wars fans, I've waited so long for a worthy sequel to Return Of The Jedi. We all thought that the prequels released between 1999-2005 would fill that void, but as we all learnt, those films are better off where they belong, very much In the past...\r With The Force Awakens, JJ Abrams and the entire team that worked on this film have absolutely nailed it! I can't even begin to imagine the amount of pressure they must have felt to get this movie right and to satisfy the fans of what has become one of the most iconic movie franchises In the world, but I believe they have done the Star Wars universe some much needed justice.\r The film itself manages to combine a great sense of old with the new. Han, Leia and Luke return yes, but Its the addition of the new characters as well as the old guards presence, that really brings the film to life and really makes you care about all the characters, not just the characters we have known, and grown to love over so many years.\r The 146 minutes of viewing time flew past and not only am I eager to go and watch the film again, but I cannot wait for the next installment and to see where the future of Star Wars takes us...",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the Star Wars movie we should have gotten after Return of the Jedi. The characters are well written and the chemistry between them feels real. The story has the adventurous feel that the prequels sorely lacked. The action scenes areThis is the Star Wars movie we should have gotten after Return of the Jedi. The characters are well written and the chemistry between them feels real. The story has the adventurous feel that the prequels sorely lacked. The action scenes are incredible fun and the practical and cgi effects look gorgeous. The John Williams scores are as always amazing. The only criticisms I can think of is that the movie does indeed borrow much from A New Hope, but there are so many twists and differences that I wouldn't even consider it a con. What keeps the movie from being perfect is a number of coincidences that are obviously there for fan service but the strong performances more thank make up for this. I give this a solid 9/10 but I will write this out as a 10/10 only because I know some bozo is going to give it a ridiculous 0/10 which I don't even believe the prequels deserve.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Such an incredible movie. I laughed, cheered, cried, and applauded. I think most of the people who dislike this one were just wanted something that wasn't Star Wars and so were disappointed when J.J. delivered a movie that is most definitelySuch an incredible movie. I laughed, cheered, cried, and applauded. I think most of the people who dislike this one were just wanted something that wasn't Star Wars and so were disappointed when J.J. delivered a movie that is most definitely Star Wars.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Star Wars is back, and it’s back in spectacular fashion. After the opening crawl, the opening few shots and the first character interactions, I knew that Star Wars was back. The story is fast paced, humorous, visually stunning and emotionallyStar Wars is back, and it’s back in spectacular fashion. After the opening crawl, the opening few shots and the first character interactions, I knew that Star Wars was back. The story is fast paced, humorous, visually stunning and emotionally gripping, ensuring director JJ Abrams and writer Lawrence Kasdan have successfully returned us to a galaxy far, far away. Whilst each member of the original cast was brilliant, it was the new cast that stole the show, particularly Daisy Ridley’s portrayal of Rey, and Adam Driver’s terrifyingly powerful yet human display of Kylo Ren. Such characters were subject to magical settings and themes and more fantastical elements displayed than ever before, and it was brilliant. Whilst no film is perfect, demonstrated as a few characters were underdeveloped and will hopefully play a bigger role in future acts, no character is expendable however and whether they are on screen for thirty seconds or an hour, each has a part to play in the progression of the story. The magic of the force, the magic of the lightsaber, the magic of aliens and starships, the magic of the Star Wars blockbuster, the magic has all returned and promises to thrive for years to come. The Force Awakens exceeds all expectations, and with perhaps one of the most emotional and spectacular final shot’s in any film to date, the audience is left both wanting to immediately watch the movie again and wanting to watch Episode 8. After years of anxious waiting, and years of positive signs we can finally confirm, JJ Abrams has done it. Star Wars is back.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Force will be strong in this review. If you were ever looking for a movie that lives up to a very long hype, that movie is 'Star Wars: The Force Awakens', a movie that, in my opinion, is just as fantastic and thrilling as \"A New Hope\"The Force will be strong in this review. If you were ever looking for a movie that lives up to a very long hype, that movie is 'Star Wars: The Force Awakens', a movie that, in my opinion, is just as fantastic and thrilling as \"A New Hope\" (1977) and \"The Empire Strikes Back\" (1980).\r Directed by J.J. Abrams ('Star Trek' and 'Super 8'), the movie is filled with gorgeous set pieces, some fast-paced action scenes that is pure eye candy, and a well-told and well-paced story.\r Luke Skywalker has disappeared since the events of \"Return of the Jedi\" (1983), and we meet some new characters who try to find out where Luke is. We meet a pilot named Poe Dameron (Oscar Isaac), who is sending a BB-8 Droid the map to where Luke has disappeared to. We also meet a former Storm Trooper whose name is Finn (John Boyega, in an ambitious performance) who is on the run from the orders of the film's main enemy, Kylo Ren (Adam Driver), who promises to finish the job that Darth Vader set out to do.\r Finn ends up in an accident and meets up with a young, female protagonist named Rey (Daisy Ridley) and they agree to help each other to send the droid where it needs to be in order to find the missing, legendary Luke.\r Harrison Ford returns as Han Solo, and his accomplice, the wookiee, Chewbacca (Peter Mayhew) in order to help the two young warriors find Luke and finish their mission.\r More familiar characters do return in this movie, but the main focus is on; Rey, Finn and Han. These are the three reasons why anyone, \"Star Wars\" fans in particular, should see this movie.\r Back in 1999, everybody was waiting so long to see \"The Phantom Menace\", and the result was disappointment, and mostly hate. That wasn't the movie everybody wanted to see. In my opinion, \"The Force Awakens\" is what \"The Phantom Menace\" should've been. Filled with superb action, a memorable plot, and some troubled characters with a dark past, who we end up caring for.\r Many of you may, or may not know about my strong dislike for 'Guardians of the Galaxy' (2014), a Marvel comics movie made very similar in style to \"Star Wars\". This was also the movie I wanted \"Guardians\" to be. The humor has to be reduced to when it's appropriate to joke, the characters need drive and focus instead of being so thinly written and having forced romance (Drax and Gamora from \"Guardians\"). The action needs purpose and the villain needs motivation and needs to be memorable (Does anybody still remember Ronan from \"Guardians\"?).\r All in all, 'Star Wars: The Force Awakens' is a movie that is worth the hype, everything from the action, to the characters, to the plot, right down to hearing the iconic theme by John Williams while the opening credits still remains the yellow text crawling upwards on the screen. It's nostalgic, but also new and fresh.\r J.J. Abrams did a fantastic, albeit very complicated, job of bringing in over 30 years of \"Star Wars\" into one movie, it may look overcrowded, but it's organised to a fault. You will have no trouble following the story, plus with a few surprises added in, this is a movie that is not to be missed, and must be seen in the theater.\r This is why, for me, it is a 10/10. Absolute perfection...",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A return to form for the franchise. Highs, lows, tears, laughter, an absolute masterpiece of movie making magic. The returning characters that we all know and love do wonders for the film, and the new characters are interesting, lovable andA return to form for the franchise. Highs, lows, tears, laughter, an absolute masterpiece of movie making magic. The returning characters that we all know and love do wonders for the film, and the new characters are interesting, lovable and all around brilliant. \" It's good to be home. \"",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nLuke Skywalker has gone missing and General Leah Organa has dispatched her best resistance fighter pilot, Poe Dameron, to investigate. These details (as you probably can tell) are part of the opening crawl and sets the tone for the seventh Star Wars movie. It's a fun, emotional and poetic motion picture that really captures the spirit of the original trilogy. It's imperfections are few (the film may have left me wanting a little more than it should have), but this is still the joint second-best chapter in the series. It's as good as A New Hope, but The Empire Strikes Back remains my favorite.\r What is truly astonishing about Star Wars: The Force Awakens is how it manages to retread the familiar beats of A New Hope, but remains fresh and exciting nonetheless. I loved the new cast. Rey, Finn and Poe are fantastically realized characters, especially the very good Oscar Isaac who plays Poe (he's the new Han Solo of this trilogy). The ending is not a definitive one, but it's emotional and moving; the final shot will grab you and leave you thinking about what it could mean for the next two episodes. The original Star Wars movies are legendary. This film is magical.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Force Awakens is the movie we've wanted for years. It has great characters, cinematography, music, just everything. The plot is basically the same as A New Hope but it doesn't matter in this case because that subplot isn't what'sThe Force Awakens is the movie we've wanted for years. It has great characters, cinematography, music, just everything. The plot is basically the same as A New Hope but it doesn't matter in this case because that subplot isn't what's important in this movie, It's the story about Rey, Finn and Kylo Ren that is at the centre of attention and JJ pulls it off incredibly good!.  Amazing movie and me and a lot of other people just can't wait for 2017 when we get to continue this new piece of film history.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Its got all the right ingredients from the previous star wars films turned on by a 100% into a full blast of excitement and nostalgia at the same time. Loved everything about it! There is nothing more to add. Bring episode 8 now please!",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I absolutely loved it! It felt like it had been made with a lot of love as well as an understanding of what makes Star Wars great. Not a big fan of Abrams but he has proven himself to be the perfect choice to relaunch the franchise.",
            "review_date": "2016-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Force Awakens is Star Wars reborn. In fact, I am of the opinion that it surpasses any of its predecessors. With acting performances far superior to anything seen in the Star Wars movies to date, this movie improves upon all the flaws ofThe Force Awakens is Star Wars reborn. In fact, I am of the opinion that it surpasses any of its predecessors. With acting performances far superior to anything seen in the Star Wars movies to date, this movie improves upon all the flaws of the original trilogy, while learning from the mistakes of the prequels. It loses minor marks due to the similarities that can be drawn between this movie and A New Hope, which may be seen as a not so subtle attempt to appeal to the nostalgia of it's audience, but it pulls it off with style, and has so much more to offer. Anyone who is reviewing this film negatively had decided they wouldn't like it before they even entered the theatre. This film boasts some of the best characters in the universe, a story arch to rival that of both previous trilogies, and far superior cinematography, direction, editing and special effects.",
            "review_date": "2016-02-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie bodes well for future Star Wars movies - hopefully Disney will give the same love and attention to all these films. It's cleary evident that this instalment has been made by fans for fans. The nostalgic elements were appropriateThis movie bodes well for future Star Wars movies - hopefully Disney will give the same love and attention to all these films. It's cleary evident that this instalment has been made by fans for fans. The nostalgic elements were appropriate this time, but let's hope the next entry is more daring.",
            "review_date": "2016-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Must admit this isn't gonna be the most objective review as I'm a MAAAHOOOSIVE Star Wars fan but s**t I freaking lost my sh** over this movie! :-) From the opening crawl to that awesome last shot I was hooked. In fact I think the only thing IMust admit this isn't gonna be the most objective review as I'm a MAAAHOOOSIVE Star Wars fan but s**t I freaking lost my sh** over this movie! :-) From the opening crawl to that awesome last shot I was hooked. In fact I think the only thing I was disappointed with was that there was no Fox fanfare at the start.....man I missed that. But he'll yeah this movie is da bomb!",
            "review_date": "2016-02-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not as amazing as I expected it to be, but still good and entertaining. Both a strength and weakness is in how heavily it relies on callbacks to the previous films, particularly Episode IV: A New Hope, which it closely mimics in terms ofNot as amazing as I expected it to be, but still good and entertaining. Both a strength and weakness is in how heavily it relies on callbacks to the previous films, particularly Episode IV: A New Hope, which it closely mimics in terms of major plot points and even imagery. The fight scenes are better than I thought they would be, which is great since I'm big into action. The special effects, of course, are lightyears beyond what Lucasarts did with the original trilogy, making the whole thing more believable and immersive.\r The biggest strength is undoubtedly the excellent performances of the new characters, in particular Oscar Isaac's Po and Daisy Ridley's Rey. I will admit that I was the least impressed with Boyega's portrayal of Finn. Maybe it is the way the character is written, but it simply did not seem right to me. BB-8 is of course the adorable little robot that everybody wants to have nowadays, and had a number of fun moments.\r There are more than a few plot holes, questionable actions by characters, and seemingly dumb plot points that, as a long-time Star Wars fan, I am ready to forgive simply because the overall package was still a good enough beginning to the next saga of Star Wars.",
            "review_date": "2016-02-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Bob Iger, Kathleen Kennedy and JJ Abrams should be applauded for this sensitively handled 'soft reboot' of the Star Wars universe. It feels strangely old fashioned (in a good way), a million miles from the Fast and Furious, Transformers andBob Iger, Kathleen Kennedy and JJ Abrams should be applauded for this sensitively handled 'soft reboot' of the Star Wars universe. It feels strangely old fashioned (in a good way), a million miles from the Fast and Furious, Transformers and countless over generic modern action films.  It's clearly aping the style of the original movie, and I think criticism of the recycled plot is fair, but despite this, it felt like a breath of fresh air for its whole running time. This is largely due to the new cast members who infuse the familiar story with spades of energy, soul and humour. The new droid BB-8 is a good metaphor for the film - likeable, fun, well rounded, cleary owes a great deal to the past while putting a new spin on the original.",
            "review_date": "2016-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The only thing I don't like about this film it should have more Luke Skywalker. Hopefully next film will have more Luke and we will see him take on Kylo Ren. I love the new designs of the stormtrooper and x wings they are actually better thanThe only thing I don't like about this film it should have more Luke Skywalker. Hopefully next film will have more Luke and we will see him take on Kylo Ren. I love the new designs of the stormtrooper and x wings they are actually better than the ones from the original films without being too different. The new baddie Snoke should have been done with a real actor but that's a small complaint. Maz is amazing hopefully she will return in the next one. I like the ways she can see through people and what they think id like to see her in a scene with Kylo Ren, lets see whats going on in his head. Leia and Han it's so great to see these back too bad it cant last. I'd like to see Leia use the Force more in the next one. Rey is the best character in the new films and I think we will love her like we love Luke. It would be good to see her seduced by the dark side and join Ren, lets see what happens if she is not as strong as Luke. Finn is like the new Han Solo he's funny and a flawed character. I hope BB8 joins with Artoo in the next one, I never really liked C3P0 so wouldn't be to sad to see him go.",
            "review_date": "2016-02-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A very fine movie with amazing effects and shots, The Force Awakens delivers an entertaining start of a new trilogy. With a mediocre plot, amazing characters, and interesting twists, this movie gets a 7 out of 10.",
            "review_date": "2016-02-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Force Awakens is going down in history as the most successful movie when it came to making dollars. The movie imo isn't as good as \"a new hope\" and \"the empire strikes back\" but still is a solid movie. The movie contained great sounds andThe Force Awakens is going down in history as the most successful movie when it came to making dollars. The movie imo isn't as good as \"a new hope\" and \"the empire strikes back\" but still is a solid movie. The movie contained great sounds and production along with bringing back memories from the original trilogy such as the millennium falcon and old characters. One big problem is that the story copied a few things from the original star wars. (Death star, locations, etc) but it isnt as big of a problem as some people say it is.    P.S. Idk why it is rated pg-13 and that probably scared away overprotective parents. Screw Voluntary Movie Rating System.",
            "review_date": "2016-02-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie, unlike the prequels, has a soul. Star Wars is back, at last! Great story, multifaceted characters, some memorable scenes, a young woman as main protagonist, I love it to bits.",
            "review_date": "2016-02-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'd like to talk about Kylo Ren in this review. Ren could very well be the most interesting character to emerge from the Star Wars mythology. Beautifully portrayed by Adam Driver, here we have a young man desperately trying to live up to hisI'd like to talk about Kylo Ren in this review. Ren could very well be the most interesting character to emerge from the Star Wars mythology. Beautifully portrayed by Adam Driver, here we have a young man desperately trying to live up to his Grandfather's legacy, and failing. Many fans have criticised Ren for being too 'weak', and that his appearance under the mask not intimidating enough. This seems to me to be an immature assessment of the character. These weaknesses and failures are the reasons Ren is so great - not as a leader or warrior, but as an character I want to watch unfold. And why his journey throughout the planned trilogy will be so utterly fascinating.",
            "review_date": "2016-02-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "After the long, long wait, I honestly expected JJ Abraham's entry in the legendary science-fiction series to be a bit like Halo 4 - good game, but not a true Halo in the sense of atmosphere & that big presence you feel when playing. But thisAfter the long, long wait, I honestly expected JJ Abraham's entry in the legendary science-fiction series to be a bit like Halo 4 - good game, but not a true Halo in the sense of atmosphere & that big presence you feel when playing. But this sci-fi blockbuster NAILED the atmosphere. The sheer nostalgia I felt at the end(which I won't mention any specific bits of, since if you're reading this you probably haven't seen the film) made me remember my childhood, watching Episode V over and over & playing with toy lightsabres and OH MY GOD, so much nostalgia. While I was upset by the death of a certain someone, the villain made up for it. He had something I'd never seen before in a bad guy - being torn apart & slowly driven insane by the dark and the light. Now I only have to wait until 2017 for Episode VIII..... dammit.",
            "review_date": "2016-03-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Personally, I enjoyed The Force Awakens. It was great to see the legacy tribe return (aka Fisher, Hamil, and Ford). On top of that the special effects were top notch, the new planets were interesting, and the new dynamics were engaging. Can'tPersonally, I enjoyed The Force Awakens. It was great to see the legacy tribe return (aka Fisher, Hamil, and Ford). On top of that the special effects were top notch, the new planets were interesting, and the new dynamics were engaging. Can't wait for Episode VIII!",
            "review_date": "2016-01-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Star Wars The Force Awakens gives me great hope for the future of the saga. Thoroughly entertaining from start to finish, it gets back to basics and achieves what it set out to do - introduce Star Wars to a new generation.",
            "review_date": "2016-02-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Force Awakens is proof that if you go into the theatre with moderate expectations, you will be blown away when it turns out great.\r I'm sure that gave away my general impressions of the movie, which is fine because you've either alreadyThe Force Awakens is proof that if you go into the theatre with moderate expectations, you will be blown away when it turns out great.\r I'm sure that gave away my general impressions of the movie, which is fine because you've either already seen it and want your feelings backed up or you haven't seen it at all yet. The latter of which is weird.\r The first twenty minutes after the opening scene of the movie are the best part based on a pure storytelling standpoint. There is very little spoken dialogue by Rey, our main character but we still understand her. The excellent shot design shows us exactly when the movie is set, the state of the galaxy, our main character's motivations, personality, hopes and dreams. They do a fantastic job showing why we care about Rey with next to no exposition.\r I've praised the first scenes of the movie, does that mean the rest feels lacklustre? Aside from a few scenes, no.\r With that said, I enjoyed nearly every scene in the movie. Even the ones that didn't necessarily need to be there. I recall the first action scene after meeting Han Solo and Chewbacca, while fun it was entirely pointless for as long as it went on.\r The action scenes were decent, but not great. This is the way it should be as Star Wars doesn't need to be The Avengers. At least not the main trilogy, feel free to switch it up for Rogue One! The main problem with the action scenes is they are mostly similar. Tie fighters attack the ground, there's some people there, things blow up.\r The lightsaber fight on the other hand was awesome. I've seen people criticize that it wasn't choreographed or fancy enough. I disagree given the characters presented. They had a dirty fight for their lives without all the dancing and prancing we saw in the prequels. While I loved the Darth Maul fight scene in The Phantom Menace, we didn't need that style for this movie.\r The characters save this movie in a big way. The casting is bang on for every single character. Daisy Ridley owns her casting and gives Rey a much appreciated personality, John Boyega puts on the upset performance of the movie and Oscar Isaac plays pulls off the perfect cross between Luke Skywalker and Han Solo in Poe Dameron.\r Speaking of Han Solo, Harrison Ford fell back in to his role with much more grace than I expected. It felt like Han Solo plus thirty extra years. He didn't play the exact same character, there was a nuance of guilt and trepidation from him throughout the entire movie. Good on you, Ford.\r Kylo Ren has been a point of contention among people. I think Adam Driver does a pretty good job with the character he is given. Kylo Ren is not supposed to be a a big bad villain, he's a troubled kid trying to rebel who got caught up in more than he wanted. He reminds me of Prince Zuko from Avatar: The Last Airbender, which is a huge compliment.\r Supreme Leader Snoke is the master of Kylo Ren, leader of the vicious First Order and most generic baddie this side of Mos Eisley. There is absolutely nothing interesting about this character so far. We know he's evil because he looks like the wrapping photo on a cigarette box and talks like he smoked the pack. Sidious had mystique around him, but they begin with an unhooded Snoke, stunting the reveal and have him do absolutely nothing to captivate an audience. He reminds me of all the Marvel Cinematic Universe villains I just can't remember. I hope that they have Andy Serkis do some spider wall crawling with multiple limbs or something in the next one.\r Snoke is a very poor CGI job which is a shame considering the majority of the movie looks fantastic. This is mostly due to J.J. Abrams living up to his word and using real props. What an idea. The real suits and sets work extremely well with CGI touches to clean it up. More movies need to use this formula and I haven't been this impressed with practical effects since Hellboy II: The Golden Army. It does make certain non-practical effects look much worse especially when making living things, as evidenced by Snoke.\r The set design is an absolute masterwork. Every location has so much detail and speaks to you like it has a history behind it. They varied up the locations enough too, with my favourite being a particular snowy forested place. Props to the people that made the props.\r Star Wars: The Force Awakens is a compelling movie to all Star Wars fans that is sure to be remembered in the future. It's the type of movie I am looking forward to showing my kids one day so they can appreciate the same universe I did growing up. A love-letter to the original and passing of the lightsaber to a new generation. While it does have flaws, that's all part of the charm. I can fondly say that it gave me the same familiar feeling I had watching the originals as a kid.",
            "review_date": "2016-03-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "To put it simply, it was a badly executed good idea. Im glad i didnt pay to watch this because if i did, id have a bit of an empty feeling after. but thankfully Thepiratebay and i are very good friends, would of never paid to watch it. but itTo put it simply, it was a badly executed good idea. Im glad i didnt pay to watch this because if i did, id have a bit of an empty feeling after. but thankfully Thepiratebay and i are very good friends, would of never paid to watch it. but it was ok to kill 2hrs of my meaningless life",
            "review_date": "2016-04-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "So Star Wars! All those people who don't like it are just haters and had already decided it would not be good going into the movie. I am probably one of the biggest Star Wars and Star Trek fans out there and I loved it. So much of it lends toSo Star Wars! All those people who don't like it are just haters and had already decided it would not be good going into the movie. I am probably one of the biggest Star Wars and Star Trek fans out there and I loved it. So much of it lends to the rest of the Star Wars Saga. It is up there with Episode V. I love cinema and make movies myself therefore I have an idea what constitutes a bad film. I love all of Star Wars for various reasons and I guess unlike some of the reviewers on here I tend to be a positive person. I highly recommend this movie!",
            "review_date": "2016-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Thank you JJ Abrams for bringing the magic back! For me, previous to the prequels, Star Wars had an indescribable magic that made those first three films different to anything else. Abrams' triumph is that he has somehow been able toThank you JJ Abrams for bringing the magic back! For me, previous to the prequels, Star Wars had an indescribable magic that made those first three films different to anything else. Abrams' triumph is that he has somehow been able to re-create that magic and soul. JJ 100% gets what makes Star Wars different, and manages to express that on the screen. I don't see him as an artist, but more of a skilled craftsman. And that's exactly what this franchise needed.",
            "review_date": "2016-01-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Have watched this twice now, first time would have given it a 7 or 8 but my enjoyment increased quite a lot on second viewing. Going into it first time I wanted it to be the greatest film I'd ever seen.....It wasn't.  Plenty to nit-pick.Have watched this twice now, first time would have given it a 7 or 8 but my enjoyment increased quite a lot on second viewing. Going into it first time I wanted it to be the greatest film I'd ever seen.....It wasn't.  Plenty to nit-pick. After the second viewing, with my lofty expectations no longer a factor, the film really bloomed. It has been made with so much love and care, and the actors really shine. I think I'll enjoy it even more with future viewings, just like I did with ANH and ESB (Jedi, not so much). Sure it has flaws and there is no denying the story is a re-tread, but it's all executed so beautifully it doesn't matter.\rIt can't have been easy to create new characters that people are going to love like the old ones, but from what I've seen here they've done just that. And that's probably the crowning achievement of the Force Awakens and what makes it a great film.",
            "review_date": "2016-01-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I enjoyed this film thoroughly.  The characters and aspects which were re-introduced from past films did so in a tasteful and relevant way.  I felt that the story was well written and told, with the exception of Carrie Fishers' scenes.  TheyI enjoyed this film thoroughly.  The characters and aspects which were re-introduced from past films did so in a tasteful and relevant way.  I felt that the story was well written and told, with the exception of Carrie Fishers' scenes.  They just fell flat and that is the one real critique I buy from all these harsh reviews.  The story probably had some \"holes\" in it as well, but nothing too critical that  would distract from the characters or general plot.\r All-in-all this is a solid film all the way through, that is easy to follow, and will make you refuse to go to the bathroom out of fear from missing something.  A well-deserved 8/10.",
            "review_date": "2016-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Star Wars magic is back - the true test was whether the Force Awakens could recreate the feeling those original movies. The answer is a resounding 'yes'. Credit to JJ and the crew for achieving what I believed was impossible.",
            "review_date": "2016-02-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I absolutely loved every minute of the Force Awakens, been to see it three times now and I honestly think it got better with each viewing. There's so much to discover with repeated viewings (for instance I noticed Rey's Luke Skywalker ragI absolutely loved every minute of the Force Awakens, been to see it three times now and I honestly think it got better with each viewing. There's so much to discover with repeated viewings (for instance I noticed Rey's Luke Skywalker rag doll on second viewing), I can't wait to see it again. There is no denying that the plot echoes that of Ep IV, but I think it was the right decision for the franchise moving forward. Get back to basics with this one, establish a new fan base among younger fans, and then move into unchartered territory with future instalments. Exciting times to be a Star Wars fan.",
            "review_date": "2016-02-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Definitely my favourite Star Wars movie and possibly my favourite movie of 2015. The Force Awakens had a lot to live up to, and didn't disappoint. It's not without flaws but the overall experience was a 10/10 for me.",
            "review_date": "2016-02-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I must say I enjoyed this tremendously! If one is looking for a rollicking good time at the movies then The Force Awakens delivers. Particularly liked the Stormtrooper chap and his pilot friend but everyone involved was a lot of fun. All inI must say I enjoyed this tremendously! If one is looking for a rollicking good time at the movies then The Force Awakens delivers. Particularly liked the Stormtrooper chap and his pilot friend but everyone involved was a lot of fun. All in all it was rather splendid!",
            "review_date": "2016-02-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is very funny , very entertaining .\rIt has details I did not like .\rThe characters well done.\r Everyone will like this movie .\rGo and see it .\rLeaves many questions unanswered.\rSTAR WARS IS BACK !",
            "review_date": "2016-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Star Wars was dead to me previous to watching this movie. I officially checked out when the Clone Wars movie released. Now I'm back on board 100%, the Force Awakens is a magnificent return to form.",
            "review_date": "2016-02-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The greatest achievement of this movie is that Abrams has succeeded in creating new characters that could become cinematic icons that will stand the test of time. I'm talking about Rey, Finn and BB-8. For that, he must be applauded. WithThe greatest achievement of this movie is that Abrams has succeeded in creating new characters that could become cinematic icons that will stand the test of time. I'm talking about Rey, Finn and BB-8. For that, he must be applauded. With reference to the review below, in answer to your question about IMDB - this was organised by fans of the EU who arranged to flood review sites with negative reviews by creating multiple accounts. Look to the overall rating to get a true idea of the consensus. Thanks.",
            "review_date": "2016-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "AWESOME! That is only way to describe Force Awakens. This is the best SW film ever I hated the last three movies this is as good if not BETTER than parts 4 and 5. $2 BILLION  and counting this movie deserves to be seen again and again it willAWESOME! That is only way to describe Force Awakens. This is the best SW film ever I hated the last three movies this is as good if not BETTER than parts 4 and 5. $2 BILLION  and counting this movie deserves to be seen again and again it will be up there with the greats.",
            "review_date": "2016-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I really enjoyed the force awakens, the action was especially good as it wasn't shot in that horrible modern way like fast and furious and transformers where it keeps slowing down. star was is back and better than ever IMO.",
            "review_date": "2016-02-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I've seen the movie twice, the second time was just as good, if not better, than the first and got to enjoy the story without wondering what was coming next. I thought the character development and interaction between the new characters, andI've seen the movie twice, the second time was just as good, if not better, than the first and got to enjoy the story without wondering what was coming next. I thought the character development and interaction between the new characters, and the interaction with the established characters was excellent, there were plenty of nods and references to the previous films which I loved seeing, and the CGI was magnificent. I think the movie was an excellent bridge from the original trilogy to the development of Finn, Kylo Ren and Rey and I cant wait to see what comes next. I'm surprised at the number of hater comments for this film, it was pure spectacle and just what a Star Wars film should be.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I have never seen any Star Wars movie and I have never been a Star Wars fan until i saw The Force Awakens. The storyline is great and the character relations are great as well. I have seen no mistakes in this movie and the acting is very wellI have never seen any Star Wars movie and I have never been a Star Wars fan until i saw The Force Awakens. The storyline is great and the character relations are great as well. I have seen no mistakes in this movie and the acting is very well done. They also learned from their mistakes from the previous Star Wars movies. In TFA they used more practical effects making a realistic movie as if you are actually in the movie.\rI give this a 10/10 because I liked the movie, I have no regret at all watching it and it was an amazing experience. Go Star Wars :D",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is done expertly,however it has some glaring flaws I just simply cannot overlook.\rIt is done well with great characters returning and introducing new interesting ones,and a single bad one I will talk about later.The Effects areThis movie is done expertly,however it has some glaring flaws I just simply cannot overlook.\rIt is done well with great characters returning and introducing new interesting ones,and a single bad one I will talk about later.The Effects are amazing,you are on the edge of your seat as the Order sets off its super weapon.It catches your attention throughout\rDialogue is great,nothing more to it.\rStory is....above average,there are some things are issues and I won't spoil it for the sake of spoilers.\r The worst part is the main villain who essentially takes Darth Vader's place,indeed a extremely hard part to fill but it is done bad.The character comes off as a rebellious teenager slamming doors and banging on walls.\r The movie is great,but I cannot give it a 10/10 like other people with these glaring flaws.",
            "review_date": "2016-02-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The force awakens is definitely a Star wars movie that can proudly sit in the top end of the Star wars spectrum. However, one could be forgiven for feeling a sense of deja vu when watching this box office beast.\r If it wasn't for the thirtyThe force awakens is definitely a Star wars movie that can proudly sit in the top end of the Star wars spectrum. However, one could be forgiven for feeling a sense of deja vu when watching this box office beast.\r If it wasn't for the thirty year gap between sequels, then forgiving this movie for its recycled plot, might not have been so easy. Luckily its a thrilling experience to see such a beloved universe being given new life.",
            "review_date": "2016-03-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI enjoyed this movie, I love seeing the Star Wars back. Unfortunately, there were some aspects of the movie i disliked very much and have degraded my opinion of the movie.\r Most of the story in The Force Awakens is copied from A New Hope, even the name can suggest the same thing. Main character grows up on a barren planet without it's parents, has a strong force within him/herself. The enemy has a deathstar / deathplanet. Main enemy character has a teacher controlling/helping him from the shadows(in secret).\r I also take issue with the speed at which Rey not only learned to control the Force, but you might even say mastered it. Being able to mind control a storm trooper from the first try and then even controlling him without even having visual connection. Kylo Ren acting out like a 12 year old child, having temper tantrums whenever things weren't going his way.\r A lot of things left unexplained, e.g. why did Luke went away, how can Luke's old lightsaber callout to Rey.\r Overall I enjoyed the movie and 100% recommend to watch it but things like these I've mentioned ruin the quality of the movie for me.",
            "review_date": "2016-03-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Okay, we all knew it. Star Wars VII would never live quite up to the masterful creations of the Original Trilogy. But anyone has to admit, it was a pretty darn good movie!\r I am ready to admit, I grew up as a Prequels kid. I had just oneOkay, we all knew it. Star Wars VII would never live quite up to the masterful creations of the Original Trilogy. But anyone has to admit, it was a pretty darn good movie!\r I am ready to admit, I grew up as a Prequels kid. I had just one VCR tape in my possession and that was Star Wars: The Phantom Menace. Call me deprived, but at the time, I thought it was amazing. Hit 10, I had watched all of them, and by 14, I understood that the prequels were definitely not as good as the OT, regardless of its flashy effects and the presence of Ewan McGregor, my favourite actor at the time (still top 10).\r I learnt to love the original ideas of Star Wars - odd band of misfits in search for princess before destroying bastion of evil and representation of oppression in form of moon-sized superweapon. Once I understood these, the core components of Star Wars, story and characterisation, not necessarily the flashy lightsaber fights and big battles, I began to think about how someone should have given A New Hope to Star Wars, even if unable to remove the marring stains of the Prequels. For me, at least, The Force Awakens was that chance.\r Admittedly, I joined the hype train. From pulling all-nighters to watch trailers as-released, as well as film theories and snippets of information, to buying a number of Chewbacca shirts in preparation for the big day (howl out to my Wookiee brethren), I was into it. I knew in the back of my mind that it would disappoint. The question was how much.\r The answer - not much. Not much at all. As a person who, within the first two weeks, had watched it seven times, I can attest that no matter how much this film lets us down, it drags it up just as well.\r Yes, the action was a bit too fast paced, with focus constantly changing from one moment to the next, and the story itself was a bit slow, but I enjoyed it. It played to my nerdy self, giving me hope that Star Wars is going to new places.\r So let's go to the nitty gritty. Characters. We are introduced to a cast of new faces, from the maverick Poe Dameron to John Boyega's rendition of ex-stormtrooper Finn. Probably the star of this show, with a beautiful accent to match, is Rey, as portrayed by Daisy Ridley. Her shifts in character and beats in each scene are articulate and well-crafted.\r The music is done beautifully, with John Williams reprising his role as Star Wars' composer, and multiple parts of the music mirror those from the Original Trilogy gorgeously. As well as this, pieces such as The Abduction, Rey's Theme and some others have made good additions to the list of Star Wars Leitmotifs.\r All in all, Episode VII has made its way into Star Wars history, and I believe successfully. People have been waiting a long time, and it would never have been just as good as the Originals. But certainly it isn't the Prequel trilogy, and that is something very good.",
            "review_date": "2016-03-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I totally flipped my **** for this movie, I've been three times and it gets better each time. Daisy is a total bad*** cant wait to see her again and John Boyega is soooooo funny. Lets see Daisy turn to the dark side and Kylo Ren switch to theI totally flipped my **** for this movie, I've been three times and it gets better each time. Daisy is a total bad*** cant wait to see her again and John Boyega is soooooo funny. Lets see Daisy turn to the dark side and Kylo Ren switch to the light side, I think that would be an interesting way to make the next film. I wanna see more of Snoke as well, hopefully we'll get to see some dark side training which we haven't seen before.",
            "review_date": "2016-02-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For me, the biggest problem is the way they resolved the threat at the end of the movie.  It seemed absolutely ridiculous, which is saying something after sitting through every other Star Wars movie ever made, and not once being as appalledFor me, the biggest problem is the way they resolved the threat at the end of the movie.  It seemed absolutely ridiculous, which is saying something after sitting through every other Star Wars movie ever made, and not once being as appalled at the lack of thought put into a resolution.\r That aside, I really did enjoy most of the movie, so I'll give it a 7.",
            "review_date": "2016-04-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I watched the Star Wars Episode VII The Force Awakens in the cinemas in the odeon. The film was brilliant and i am a big fan of star wars for years and i want to carry on watching the film when the new star wars film some out on DVD.",
            "review_date": "2016-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A decent return for Star Wars. While it is no where near the awfulness of the prequels, it also doesn't quite reach the heights of a film like Empire Strikes Back. John Boyega did a great job as Finn and the rest of the supporting cast wasA decent return for Star Wars. While it is no where near the awfulness of the prequels, it also doesn't quite reach the heights of a film like Empire Strikes Back. John Boyega did a great job as Finn and the rest of the supporting cast was pretty good as well. Rey on the other hand I found to be annoying and whined too much. Also a big reveal occurs much too early for it to have a major impact later in the film. Overall The Force Awakens has some great visuals, excellent action scenes and some good performances. This film isn't a masterpiece or even the best film of 2015, but it is a fun time.",
            "review_date": "2016-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is f*******g FAN-TAS-TIC!!!!!!!!!. JJ Abrams understands Star Wars and gives fans exactly what they wanted (unless you a entitled EU fan of course). The perfect antidote to the sterile stuff that has come out over the last fewThis movie is f*******g FAN-TAS-TIC!!!!!!!!!. JJ Abrams understands Star Wars and gives fans exactly what they wanted (unless you a entitled EU fan of course). The perfect antidote to the sterile stuff that has come out over the last few years pre Disney, I cant wait to get this on Blu-Ray next week!!!!! Bring on more. We want more Star Wars!!!!",
            "review_date": "2016-03-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie that everyone not just SW fans should watch!\rPeople who only like the original SW Episodes IV to VI should simply stop watching this movies, you will simply not get what you want and that's a good thing. The original SW moviesGreat movie that everyone not just SW fans should watch!\rPeople who only like the original SW Episodes IV to VI should simply stop watching this movies, you will simply not get what you want and that's a good thing. The original SW movies created that great universe we all love but apart from that they only offer a lot of bad acting.\rEveryone who complains about the acting and the plot of Episode VII should put off their rose-colored glasses and actually compare the new movie with the old.",
            "review_date": "2015-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "JJ Abrams' vision of Star Wars is essentially a fresh coat of paint on an old car. The Force Awakens is remarkably similar to A New Hope in numerous ways, and while I enjoy both of these movies, The Force Awakens doesn't quite captivate theJJ Abrams' vision of Star Wars is essentially a fresh coat of paint on an old car. The Force Awakens is remarkably similar to A New Hope in numerous ways, and while I enjoy both of these movies, The Force Awakens doesn't quite captivate the same way the very first entry into this franchise does. What this film DOES do well is flash what lies ahead for us - the technical prowess is incredible here. X-Wings in formation striking beachheads or enemies in space are incredible. Everything George Lucas did through 6 episodes is suddenly garbage in the wake of the Abrams touch. The new cast is also solid, even if Kylo Ren's character isn't as well explained as I would have liked. Certain characters and the background story need some work to transcend all the other excellent franchises being iterated on year after year right now. Star Wars is no longer alone in the sci-fi world, it's merely a cornerstone and The Force Awakens does only enough to remind us of what Star Wars can be, but doesn't fully deliver in its resurgence. Regardless, this movie was very enjoyable and should please many fans worldwide. The BEST news is that Star Wars isn't limited to just episodes 7-9 as there are four other side-plot movies in development as well. So while the core story of this new Star Wars adventure isn't completely built yet (at least, in this movie), these other movies taking the Marvel universe approach could perhaps fill in some of the blanks and keep satiating our appetites for all things Star Wars.",
            "review_date": "2016-03-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "OH YEH Star Wars is the best film I seen all year!I love Kylo Ren! When he clattering **** out of that control panel! BB-8  is so cute and only he can compete with R2. Rey and Finn so cool I can't wait to see more. And Poe, well we need moreOH YEH Star Wars is the best film I seen all year!I love Kylo Ren! When he clattering **** out of that control panel! BB-8  is so cute and only he can compete with R2. Rey and Finn so cool I can't wait to see more. And Poe, well we need more of him in the next one! It deserve to be number one all time movie at box office I've seen it three times now.",
            "review_date": "2016-02-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Giving it a 10 just to counteract some of the strange \"zero\" ratings it's receiving.\r No movie is worth a zero rating.  Not matter how bad.  People are just being angry grudge children about it.",
            "review_date": "2016-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThis movie was excellent.  I've seen the movie twice now, so the following is based on my analysis of two viewings.  Minor spoilers will abound, but nothing too big.\r First of all, yes, this movie is very similar to episode 4, aka the \"original\" star wars.  So what!  It knows that it is doing this and, unlike the negative reviews, isn't pulling a fast one.  It is intentionally following a similar thread, almost like a symphony.  The prequels were actually supposed to be more similar to the originals until G Lucas messed them up.  But, to break it down - lost heroes unite.  One of them is strong in the force, they at the end is a battle, and the good guys destroy a space station.  Sound familiar?  Well, it happened in the Phantom Menace, A New Hope, and Force Awakens.  So any complaints about the story being a copy are unreasonable - the movie is intentionally being parallel to its predecessors.\r Where this movie SHINES is in its new cast.  Rey, Fin, Poe, and Kylo Ren were all excellent.  Han Solo served enough of a plot point but was necessarily killed off to leave room for the new group.  I was surprised at just how good this new cast is.  I haven't felt this excited about a group of characters in a sci fi show since the original star wars trilogy.  None of the prequels had this quality of cast.  Ewan McGreggor was good, Liam Neeson got killed before we could appreciate him, Sam Jackson was in the prequels too infrequently, so we were left with Hayden Christiansen and a boring version of Natalie Portman (who, aside from the prequels, is actually a great actress).  No such complaints can be found for the Force Awakens.  That move is simply awesome.  Go with an open mind.  Don't tear it apart due to its similarities to the originals - and just realize those similarities are intentional, and don't be too sad when you see Han die, it is sad, but don't let it ruin the movie.  All said, J.J. Abrams nailed this movie more than anyone else could have.\r Oh, and just to throw some fuel on the fire - Rey is clearly Luke's lost daughter...",
            "review_date": "2015-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "JJ did it. Easily the best Star Wars since Empire, and it might even match that movie for emotional punch. Feels fresh and new, mainly due to injection of brilliant new protagonists Rey, Finn and Kylo Ren. The only scene I personally foundJJ did it. Easily the best Star Wars since Empire, and it might even match that movie for emotional punch. Feels fresh and new, mainly due to injection of brilliant new protagonists Rey, Finn and Kylo Ren. The only scene I personally found disappointing was the Rathtars on board Han's freighter. This scene had the look of a generic fantasy/sci-fi pic with its use of CGI. The Scottish guy was a bit unnecessary as well, would have prefered they used more of the guys from The Raid. Hope they develop Maz Kanata a bit more in the sequels, I found her to be quite charming and unique.",
            "review_date": "2016-02-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Best Star Wars ever. Beautifully made, respectful to the franchise whilst introducing new exciting elements. The Force Awakens was the perfect way to introduce the franchise to a new generation.",
            "review_date": "2016-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nOne of great adventure films ever made. This has all the ingredients that go toward making a fun movie - propulsive action, great characters and a lot of humour that always hits the mark. The Force is strong with this one.",
            "review_date": "2016-02-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "By far the best movie of the year so far. I loved the new and old characters, I loved the visual effects, I loved the story, I just loved every aspect of this movie, and I cannot wait to see Episode 8.",
            "review_date": "2015-12-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film expands the Star Wars mythology (as can be the least to be expected after the EU being wiped clean) as well as providing a very promising backdrop for the future of the franchise. The very fast paced nature of the film left littleThis film expands the Star Wars mythology (as can be the least to be expected after the EU being wiped clean) as well as providing a very promising backdrop for the future of the franchise. The very fast paced nature of the film left little room for too much dialogue but I would argue it wasn't needed as the story was quite probably the best anyone could've asked for which is in my opinion the main thing, other things can be expanded and cleaned up in the sequels not to mention the possibility of tie-ins in the other anthology films.",
            "review_date": "2016-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Star Wars as its meant to be. A triumph from start to finish, the Force Awakens has everything that made me fall in love with this Universe in the first place.",
            "review_date": "2016-02-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Whoohoo!!!!!! Force Awakens freakin' ROCKS man! Everything about this movie rules - the actors, the script, the effects......the little ball robot! The laser swords!!!! Harrison Ford is the Don. Chubacca, I love. This movie FLAT OUTWhoohoo!!!!!! Force Awakens freakin' ROCKS man! Everything about this movie rules - the actors, the script, the effects......the little ball robot! The laser swords!!!! Harrison Ford is the Don. Chubacca, I love. This movie FLAT OUT RULES!!!!! Who give this movie zero out of 10 do you need a head examination!!?!?!?!?! What so this movie is worse than Transformers???? Don't think so!",
            "review_date": "2016-02-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie exceeded all my expectations and a perfect start for a new trilogy. Daisy Ridley blew me away with her performance as a newcomer. although it parallels the plot beats of the original trilogy especially a New Hope,  i can understandThis movie exceeded all my expectations and a perfect start for a new trilogy. Daisy Ridley blew me away with her performance as a newcomer. although it parallels the plot beats of the original trilogy especially a New Hope,  i can understand why it needed to be made that way to take away the sour taste of the prequels and bring us back to the reason why we love the OT,it is  because of the CHARACTERS. this film is a character driven film and it is told through the point of view of the characters.\ri don't understand those who hate this film, the aesthetic look and editing of this film are enough reason to win  the awards. the use of practical effects and real locations are very nicely done. Overall i really loved this film and very much looking forward to the 2 sequels.",
            "review_date": "2016-02-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Watching this movie made me so happy. I actually like all Star Wars films including The Phantom Menace. But this was way better than any of the prequels and it is as good as A New Hope in my opinion. I love the soundtrack John Williams meansWatching this movie made me so happy. I actually like all Star Wars films including The Phantom Menace. But this was way better than any of the prequels and it is as good as A New Hope in my opinion. I love the soundtrack John Williams means everything to Star Wars. This was a beautiful movie well acted and directed. It score full marks from me. Jimmy.",
            "review_date": "2016-02-08",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 155
}