{
    "title": "Tangerines",
    "rating": 8.2,
    "release_date": "2015-04-17",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "summary": "Set in 1992, during the growing conflict between Georgia and Abkhazian separatists in the wake of the Soviet Union’s dissolution, this compassionate tale focuses on two Estonian immigrant farmers who decide to remain in Georgia long enough to harvest their tangerine crop. When the war comes to their doorsteps, Ivo (Lembit Ulfsak) takes inSet in 1992, during the growing conflict between Georgia and Abkhazian separatists in the wake of the Soviet Union’s dissolution, this compassionate tale focuses on two Estonian immigrant farmers who decide to remain in Georgia long enough to harvest their tangerine crop. When the war comes to their doorsteps, Ivo (Lembit Ulfsak) takes in two wounded soldiers from opposite sides. The fighters vow to kill each other when they recover, but their extended period of recovery has a humanizing effect that might transcend ethnic divides. Set against a beautiful landscape defiled by war, this poetic film makes an eloquent statement for peace. [Samuel Goldwyn Films]… Expand",
    "critic_reviews": [
        "Tangerines is an example of lean, unadorned old-school filmmaking where familiar style and technique combine to unexpectedly potent effect because of the great skill with which they've been employed.",
        "This remarkable piece of antiwar cinema honors its theme, and the movie medium.",
        "Georgian writer-director Zaza Urushadze avoids histrionics or moralizing, relying on a strong cast that expresses the film’s central argument about war’s absurdity largely through taciturn action, not words.",
        "Although events unfold amid a gorgeous pastoral setting with rolling green hills and leafy trees, there is a silent starkness about this countryside that suggests Ingmar Bergman’s use of natural surroundings.",
        "Ivo’s farmhouse looks leftover from another century, which gives a timeless feeling, as does the regal bearing of Ulfsak and the dry humor of the script. The film telegraphs its pacifist message early on, but it’s still deeply affecting.",
        "With nearly five-decade screen veteran Ulfsak setting the wry, soulful tenor, Tangerines balances humor and seriousness in deft fashion, its delicacy abetted by all thesps and design contributions.",
        "The film turns out to be highly effective, thanks to the skills of the actors and director Zaza Urushadze.",
        "Its impact sealed by across-the-board strong performances from its all-male cast, Tangerines is a film about loss and belonging, about rootedness and departure.",
        "The alliances of the characters are a tad confusing at the beginning, but you don’t have to be an expert in geopolitics to appreciate the finer points of director Zaza Urushadze’s intimate film, which was nominated for a best foreign film Oscar.",
        "A simple tale, sharply drawn and smartly told, a portrait of a people, a place and a centuries-old conflict that this wise yet myopic citrus farmer cannot get his mind around any more than we can.",
        "The film, beautifully shot and cleanly edited, has the economy of a short story, unfolding in a mood of slightly sentimental masculine stoicism.",
        "Interior scenes focus theater-like on the dining room table-as-vortex: Threats and insults whip about, but, finally, so do forays of friendship.",
        "There are some touching interactions between the players, but the film’s humanism is too predictably calibrated.",
        "War is brutal and senseless and would be laughably absurd if it didn’t cause so much widespread, unnecessary destruction and suffering. Tangerines is a heartfelt reminder of that fact, but not a particularly essential one.",
        "Urushadze’s excellent cast imbues their thinly drawn characters with a great deal of life, but the roles are so transparent that the film feels like more of an advertisement for peace than it does an argument for it.",
        "Too blunt and didactic to convey the futility of war with the complexity the subject demands, Tangerines works primarily as a showcase for its trio of lead actors, who work hard to make their characters’ gradual yet quick thaw seem not just credible, but inevitable.",
        "The shift from philosophical parrying to actual combat doesn’t make Tangerines more compelling; on the contrary, it suggests that the filmmakers didn’t have the confidence to tell their story without falling back on genre tropes.",
        "For all of the potential, historically specific revelations regarding nation and religion, Tangerines elects to become bathetic hokum."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "A really good movie about character.  It develope4s at a leisurely pace but never lags or fails to interest.  If you want an action picture, go elsewhere; but if you are in the mood for a thoughtful and touching movie this is for you.",
            "review_date": "2015-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A taut, absorbing, suspenseful battle of wills drama set against the backdrop of a spiteful civil war in which the perspectives of the principals have become blinded by unwavering, unquestioning beliefs. While some aspects of the narrativeA taut, absorbing, suspenseful battle of wills drama set against the backdrop of a spiteful civil war in which the perspectives of the principals have become blinded by unwavering, unquestioning beliefs. While some aspects of the narrative are a bit predictable and a tad preachy, the film nevertheless delivers well in making its points known, An excellent ensemble cast and superb production values lend a distinct mood to a picture that should be required viewing for anyone wanting to do battle without thinking through the consequences.",
            "review_date": "2015-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "good movie with an interesting setting and good development of the well written characters. But the pace was a bit slow. Of course the movie is left orientated and anti war.",
            "review_date": "2020-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Well ploted and well acted, 'Tangerines' isn't a complex movie, it's melancholic but not melodramatic, it's a movie about how war become us idiots, it's a movie that make you reflect: Why must the people bleed in the nobody's wars?",
            "review_date": "2015-07-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a brilliant movie from director Zaza Urushadze. I recommend it if you want to watch a good movie-in drama/war genre.\rFilm is about what happens during Abkhazia war and you can see the conflict between Georgian and Chechen soldiers.This is a brilliant movie from director Zaza Urushadze. I recommend it if you want to watch a good movie-in drama/war genre.\rFilm is about what happens during Abkhazia war and you can see the conflict between Georgian and Chechen soldiers.\rThere is also things about religion conflict too,so you should watch it",
            "review_date": "2015-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "this movie is amazing ! you should totally watch it.\rit really has deep character development and shows you conflicts between two nations and religions.",
            "review_date": "2015-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazing movie with amazing director and actors!  It shows us how hard life becomes during any war and makes us think about how precious our motherland is.  Highly recommended!",
            "review_date": "2015-09-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ebert gave this the highest rating - and I agree.  Powerful movie about war, death, and friendship.  Even though the movie was in Estonian, Russian, and Georgian, I couldn't stop watching it. Sad, but inspiring.",
            "review_date": "2015-10-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A powerful conveyance of the absurdity of war, and a poignant conveyance of the fact that, despite ethnic differences, humanity should and will always prevail.",
            "review_date": "2016-01-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "‘Tangerines’ is a war drama movie that was directed by Zaza Urushadze in 2015. The script was also written by Zaza Urushadze. The stars are Lembit Ulfsak, Elmo Nüganen, Mikheil Meskhi, Giorgi Nakashidze and Raivo Trass. This movie earned‘Tangerines’ is a war drama movie that was directed by Zaza Urushadze in 2015. The script was also written by Zaza Urushadze. The stars are Lembit Ulfsak, Elmo Nüganen, Mikheil Meskhi, Giorgi Nakashidze and Raivo Trass. This movie earned about $1 million, whereas its budget was €650,000. ‘Tangerines’ is a deeply meaningful and powerful movie about people and their lives in Abkhazia during the conflict between Georgia and Abkhazia in 1992–1993. The actors are highly convincing. The movie provokes strong feelings. It tells us about the value of a human being. ‘Tangerines’ was a critically acclaimed movie. It received many awards and was nominated for the Best Foreign Language Film. Written by Anastasiia Shystovska",
            "review_date": "2021-02-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I recently watched this and really enjoyed it.  The character development is excellent and it has a good story line.",
            "review_date": "2021-01-16",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 29
}